{
  "DZ8_TreBB9I2TXiRmCE_8A": {
    "date": "7/10/2015",
    "text": "7th year anniversary. Flyers promoting the event which includes $2 cocktails spread out on bar. Inquired about the party special and was told \"not eligible\" only for VIPS.  Wow is all I can say",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4H45XhiOrFfkQp9Tkho1UQ"
  },
  "1nNouP5Mgx1j7c3YbNnMnA": {
    "date": "5/20/2013",
    "text": "This bar is in the Epicenter in downtown Charlotte.  I found the crowd a little too young for my taste.  But on the bright side, they had a mechanical bull.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NTKDMcOFPQMaJQ7CQZ1LEA"
  },
  "WB2R4Fbg4S0MKzNCO16FRw": {
    "date": "7/24/2015",
    "text": "Typical bar food menu...limited on draft beer about 4; rest they carry are bottles. I doubt I would return again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PPvX2qYOTo57HNU3B4W4zQ"
  },
  "4h-IuVZHJASU8XhQGqatnw": {
    "date": "8/1/2013",
    "text": "I don't go to Whisky River all too often. But have been going more lately due to the fact of the new restaurant - definitely head over for a meal.   Everyone knows Whisky as the classic uptown scene of the buff bouncer, the crowded club (but great for dancing!) and the high-priced drinks on the weekends. But have you been to the restaurant?   I highly recommend the buffalo dip. Creamy and a good heat - nothing too spicy so perfect to share with anyone. The BBQ sliders are good. They are served only with onions and on every table are four Dale Jr BBQ sauces to try. I dig the gold, nice and sweet with a mesquite hint. If you go, might as well try them all though!  And hidden secret - ask for the mini pork tacos. Not on the regular menu, and can only be found on the happy hour menu, these mini tacos are served in a crispy wonton shell with pulled pork and topped with a slaw mix. Taste explosion in your mouth. Oooo and the pimento cheese balls!   Only disappoint I've found are the salads... OK, OK, I know they are promoting themselves as a BBQ place, but I appreciate a good salad variety! I had the pulled chicken salad which was nothing special and the chicken was bland, no seasoning or marinade, which could have turned the whole salad around.   And the service has always been friendly and helpful but at times quite slow. And seeing how I usually take my lunch hour to go to lunch, not always the best option. If Whisky would become consistent on getting the food to the table quickly, I would have awarded it another star. But the pork tacos! Delicious.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "woT2AcKuonN5L1N8h1HGMA"
  },
  "PAt2ZXSNkN1AbQH6NJun3g": {
    "date": "11/21/2015",
    "text": "Redskins Rally. Got in sat at bar. Packed house.  But cannot get raffle tickets because we were already in the house. Booooooo! And we need to go outside and wait in line.   That sucks.  Loyal fans get screwed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "f0axop89FQbXzVUCSuz6kA"
  },
  "H8TwlySDnZgopw4pbKHnBA": {
    "date": "1/19/2013",
    "text": "Was here for a private function and the bar staff wasn't terribly friendly but they were quick so that works for me.  I think I spoke with a manager for a bit and he was friendly.  Strange band playing hip hop, country and metal cover tunes but I liked them.  The more than half naked waitress outfit is more than a little demeaning to women and they lose a star or that.  Some of the younger women in my group loved the bull riding and the men loved watchng them.  It's that kind of place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "JNLTh1iGDWLncTlnESdv-g"
  },
  "WPl_mPayckJsage5eEG-_Q": {
    "date": "1/24/2012",
    "text": "I personally don't really do the club scene anymore but I had to go here because they have a mechanical bull that's free to ride. Besides that the drink prices are what you would expect in a club. They have a huge dance floor as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Gy8mq7V3bJId2tLxT3f8CQ",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. Nice.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gy8mq7V3bJId2tLxT3f8CQ/o.jpg"
      }
    ],
    "user_id": "HiKXqt366G3FmHZyIxM20g"
  },
  "Udaf2JWBrGfb5UjvWAcibw": {
    "date": "2/18/2016",
    "text": "Nice place to eat. Wings are pretty good service is great too. But I do have one issue I ask one of the food runners if they had plastic sliver ware he was so quick to say no as if he didn't just want to bring it to me which is fine not his job but don't lie to me and say you don't have it when you do. But I like the food so I would come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NMtMelJNDIzDGhntIOwV4Q"
  },
  "za8yi2-o4QfZCDg7pILO8Q": {
    "date": "11/4/2012",
    "text": "Came on a Thursday night  - No food yet. Just drinks - Ride a bull.  - Small round tables. Big group friendly? Not really - Sexy Waitress. Pleasure pit status.  - Cover to get in?! not on a Thursday :)",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "rHgT6lBbZ2PaHt0UWfTMtw"
  },
  "bBOgsvoYaiOhvLSQEJaPxA": {
    "date": "11/22/2015",
    "text": "The only reason I didn't give 5 stars is because I didn't order any food. I attended the Redskins Rally on 11/21 and had a great time! Bartenders were attentive and fast. Drink prices a little pricy, $8 for a Capt. Morgan & Coke. Great atmosphere and party environment, a must for any sports fan visiting Charlotte, NC.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lbsX9OvcREDJ8AouRolr7A"
  },
  "bjDzAdNssxwvNIsQipCigA": {
    "date": "2/5/2015",
    "text": "I have been to this place 3 times now, most recently SB Sunday (I had a Living Social certificate that was about to expire), another time after the Bears-Panthers game.  I was there one additional time for a professional networking event, but I won't count that in my review because for all I know it was 3rd party servers and food.   All 3 times this place was pretty much packed, and all 3 times I went with the unwise intention of ordering food.  It was so busy after the Bears game (mostly out-of-town Chicago fans), that we couldn't even find a place to sit down (to order food).  And in all actuality, going there for food is probably a bad idea anyway.  As bar food goes it's overpriced and average to below average quality.  They have a few BBQ platters $14-$25.  For that price you can do much better in Charlotte.  Even when ordering food, none of the servers (that I have had) seem to know much about the food menu.  You get a sense that they are more accustomed to taking drink orders.  Btw, with the exception of SB Sunday, where the female servers were all wearing football jerseys, they are pretty scantily clad.  Some people may find this not to be family friendly (or feminist girlfriend friendly), so just a warning.  Personally no complaint here   And lastly the beer.  This was perhaps the biggest disappointment.  For a place this large you would expect that they have at least a couple local drafts on tap.  Not so.  Looking around it is mostly a Bud Light / Fireball shots crowd.  They even have a beer pong table.  In summary, this place simply lacks character in my book.  However, if you are looking for a place to drink, dance, and hang out with bra's and sorority chicks, this might be your place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YzAt61MHuaQ1oDOG-F9xHA"
  },
  "cR_w8-jfTJYlFQVoDQrwjQ": {
    "date": "8/4/2014",
    "text": "The music was great; there was never a line at the bar and service was fast. One star because some girl that worked there tried to get me kicked out for no reason. We were leaving the VIP area and she rudely told us to \"move faster\" I told her she needed to calm down and then a bouncer came over to me and told me to follow him, I did and he told me that same girl told him I had hit her. I immediately began to deny hitting her because I didn't and he said that he knew I didn't, he said that she worked there and he was doing this for \"show.\" He took me outside, told me he knew I didn't hit her and to go back inside and join my friends.  Talk about a power trip to the lying girl who worked there. Rubbed me and the 6 other girls I was with the wrong way so we left; ended up spending a couple hundred more dollars at another bar. In the words of Julia Roberts \"BIG MISTAKE!\"",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "X_cNEbIgDgvyyLn_AMOkJg"
  },
  "jXo1kVsdYss9se95hA6XEQ": {
    "date": "8/1/2012",
    "text": "In the interest of full disclosure, understand that I have a natural aversion to all things redneck. In fact, the second star is only because I try to reserve 1 star ratings for places that genuinely mistreat me, which they haven't done. Am I not merciful? AM I NOT MERCIFUUUUUL!?!?!?!?! Still, you can take the rest of this with a grain of salt. What I might hate about the place may be exactly what makes you a fan.  Music: Over-played, asinine generic Top-40 and hip-hop with trite lyrics (usually about doing the sort of things you're probably doing at \"da club\", but on a tighter budget) mixed awkwardly with contemporary country, i.e. the worst kind of country. All of which is played at a volume that leads one to wonder if Dale Jr. has some bizarre profit motive for rattling vital organs out of his customers' rib cages.   Drinks: Standard variety of beer and spirits you'll find anywhere people go to get hammered. I don't remember anything noteworthy enough for praise or criticism. The prices were a little high but no more than what you should expect for uptown.  Amenities: This is where Whisky River does best. The dance floor is pretty large and the bar is long enough that you MIGHT not have a sea of humanity separating you from the bartender each time you go for another drink. The floor to ceiling window looking down onto Trade Street is pretty cool too. The mechanical bull is, well...a mechanical bull. If you'll forgive the lazy tautology, it is what it is, a means of allowing (or tricking) hot drunk girls to be sexually provocative. As a straight male, it's kinda hard to criticize too much.  Clientele: Imagine a large group of out-of-town NASCAR fans of all ages who, in desperation for a big night out in an unfamiliar city, find themselves at a night club...on college night. Maybe throw in some townies in Ed Hardy shirts and pointy black leather shoes and there you have it.    So if you can stand a couple hours of ear-splitting T-Pain, Nickelback, and Jason Aldean without envying the deaf this place may be for you. However, if you need me I'll be at Connolly's or Belfast Mill.",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "clXKco_bCYG3ajR6R-L1KQ"
  },
  "hIUCnG0ue0qr8gUZ3oBT0g": {
    "date": "1/25/2015",
    "text": "Location, location, location. If you stumble in unaware of what your other options are that might be the only reason to be here. I would be shocked if anyone goes here more than once for good reason. Lack luster everything. How this place has stayed open most be soley due to late night drinkers and the late hours. Don't waste your time eating here thats for sure. The food is generic, boring and over priced. Other than a meeting place to have a few drinks or catch a game minus even needing a food menu that is all this place is worthy of. Just have the mindset this a bar and bar only not a eatery.   P.S. this is the Epicenter so keep in mind anybody and everybody is welcome so expect some less than desireables to come on in and make themselves at home.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xS5AVRJ9f5-nzxCBbZKD0Q"
  },
  "JtEDzzoGFRNLZrIQsWhb3Q": {
    "date": "8/3/2016",
    "text": "Probably not worth it to come here. Odd crowd of southerners and alcoholic try hards yelling and screaming. Decent large area to dance on busy nights... It's not absolutely horrible here but there's nothing that stands out where you really want to come. The mechanical bull is kind of cool though",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y1JGjCAkQnsXfqiTKQHEJw"
  },
  "BV4seHfRI6psoNL36wZoBQ": {
    "date": "8/30/2015",
    "text": "Went last night prior to Crue concert for some pregaming.  Enjoyed the drinks and the service at the bar was on point.  One of the bartenders hooked us up with a VIP pass for after the concert....and thank God the line was longgggg.  Stayed until 1am-ish and had a great time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bPQDYIFr1oJQhj6S4ZoEww"
  },
  "kTTrGTMyATYz7NXayejS_g": {
    "date": "3/9/2015",
    "text": "Horrible experience at this place while in town. Customer service needs a lot of work. We ordered drinks and looked at the menu, but decided to go eat somewhere else. The bartender just was not very friendly and we did not feel comfortable there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J7lonP3Fu985BhsIkd-VUA"
  },
  "rRxzvqxaZ_PEVjnpk-dVUA": {
    "date": "2/4/2014",
    "text": "Great service!  Carolina brisket tender but flavorless, coleslaw lacks any flavor at all. Onion rings downright bad, buffalo shrimp very decent. Sweet tea is good and always kept full. Buffalo dip not so good. Turkey platter bout as dry as you can get it, be sure to smother that baby in as much sauce as you can!  Mac 'n cheese is acceptable, add a little sauce to it while you're at it. Fried Milky Way on the way, but can't see how that can be anything but delicious. Great atmosphere, substandard food. UPDATE:....it's been 25 minutes waiting for dessert, although with just us and 4 patrons at the bar I can see that they may be slightly overwhelmed. Oh wait! Here it is, let's jump in and see how it is.....as expected, hard to mess up deep frying a candy bar. Not bad dessert.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3_CJ_fd85lrSRzDjusLrSg"
  },
  "20skjoWxjvbIywBOjvJjeg": {
    "date": "10/12/2015",
    "text": "I have mixed feelings about this place.  The first time I ever went there they were having a bikini contest.  I was not a fan of the creepy men taking pictures on their cell phones of college girls in bikinis.  The drinks that I ordered on both occasions that I've been here have been delicious.  The music has always been all over the place going from rap to country within 5 minutes.  The crowd is always interesting.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B2e_SpGq-QBQLYyPc2VWvQ"
  },
  "YrmIa14_-ZyQYi6ly4KooA": {
    "date": "4/9/2015",
    "text": "Such a fun bar, and great lunch and dinner as well! Cute girls in daisy dukes, current music as well as country night on Thursdays. Great drink prices. There is usually a cover at night, but still less than most other clubs in town, especially in epicenter. Fast service at the bar, mechanical bull.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lxgo4vje8kp7LKWeS9gyLw"
  },
  "xUVfTRz4rxm3UlxuFKl8GQ": {
    "date": "10/10/2014",
    "text": "Well, can honestly say I have always wanted to visit this place ever since I heard Jr.(Earnhardt) owned it. Being a huge Dale Eardhardt Jr Fan, its only natural to want to check this place out, good or bad reviews.  Finding this place can be fun, its located on the second floor of a shopping area right along side the charlotte hornets arena. Be advised you probably will have to pay 6-8 dollars for parking and walk to the place.  First of all i went here for lunch so this place was not \"hoppin\", nor was it busy when i got there. The building seems to have two halves, a club side and a food side. THe club side was blocked off kind of and was empty. Walking in my first thoughts were kind of disappointing. Nothing really \"racey\" feeling about it, yes i know its not a racecar bar but yet kind of figured it would have some kind of feeling reminding you what the place was about or where it came from.  Typical bar style room with the bar in the center and tall tables around it. Waitress took at least 10 minutes to come greet us after we were seated. Then our order took good at least 20-25 minutes to arrive, she kept saying she was going to check on the status then would walk over to another table. The more guest our waitress had, the longer we had to wait for refills and our check. All the female workers seem close so they focused on gossiping  more with each other while they walk past our table failing to notice my empty glass could use a refill.  Food was okay, had the \"Dale Q\" i think it was called, was a burger with shredded pork on it. Really didnt have alot of taste to it, had to add the bbq sauce to give it some kind of taste. However i did order the waffle sweet potato fries and those were excellent!  Overall i left kind of bummed, just guess i need to visit it at nighttime. It seems being open for lunch, they only run the bare minimum staff and that effects everyone as more guest arrive for lunch.  Oh side note, dont get too excited if you see the mason jar they offer with your soda drink for 8 bucks, its plastic and a total letdown. Asked if they offer glass like it looks like in the picture and she said no.....only to find glass ones for sale at the spot to buy hats and shirts.....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SSQs_852BIiVaFTM0tn42A",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. Want the cool mason jar they offer for 8 bucks?.....I did too till it came back as a plastic jar.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SSQs_852BIiVaFTM0tn42A/o.jpg"
      },
      {
        "img_id": "A4weadZtfMhQm65m_9Mo1g",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A4weadZtfMhQm65m_9Mo1g/o.jpg"
      },
      {
        "img_id": "EdTu3Zdx7tbNsaN9ZwlUlA",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EdTu3Zdx7tbNsaN9ZwlUlA/o.jpg"
      }
    ],
    "user_id": "ryWgX_dZVzfGhTq-TWUu4w"
  },
  "aN-gtyvcreWDM5cIbz14MQ": {
    "date": "3/2/2018",
    "text": "Giving his place one star is an overstatement. They don't give a damn about their cusotmers. I understand that owning a club is a hustle and I get that. However you should not treat your guest like they are next to nothing! I arrived to party with 4 of my friends! So there were 5 females in total. We all paid $60.00 admission, which is reasonable considering it's CIAA weekend. Anyways, once we all paid we were still standing next to the lady who collected our $300.00 in total. I asked how much a table would cost to a lady standing next to the lady collecting the cash and she said $500.00. I explained that we had just paid $300.00 to the lady just now which was less than 10 seconds ago. I asked if they could just let me give them $200.00 and we could purchase a table. She said no and explained tables are booked aside from the regular paying. Then told me I could give her 400.00 and we could get a table, we were still standing here and had not even entered the club section, mind you we paid in cash and they could of easily just handed it to the lady who clearly worked there also. As a business owner I don't understand why they felt it was ok to treat us this way. It was awful as there is no place to sit. They are only concerned about their money and not making their cusotmers happy. The drinks were also weak and over priced. We come to CIAA every year and this wasn't our first visit to this place but believe it was our last and I will take my table money elsewhere. BEWARE OF THE RUDENESS. The table lady told me to speak to the manager who was walking by and didn't stop to talk to me. Then said he would be right back to talk to me but he never came back. Horrible place, horrible drinks, horrible service. NEVER AGAIN",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hoioVfrsD6meX-0FnaLqug"
  },
  "QZZLcqCwKlIaom9nH0lo9g": {
    "date": "10/13/2017",
    "text": "Prime check-in spot for Panthers, Hornets and Knights games.... Emily, Kirsten, Brit and all the ladies are absolutely great. Good cold beverage at a decent price before going to the games and paying 3-4 times more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aeIt4qrSSk6C6MosczgiLA"
  },
  "xU_20PAf6yts94nPeQOskA": {
    "date": "8/28/2017",
    "text": "This place is fun, great atmosphere, friendly staff & GREAT food!! Always hosting cool parties and ways to get in without a super expensive or even free cover. Very race fan & sports fan friendly. TONS of TV's so it's a great place to come in for a game or event.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1IQLO_kxXeSSyPY6R8nBMg"
  },
  "jGQM4Kqj2pIGN6X76UDVNA": {
    "date": "5/1/2017",
    "text": "We walked in the sign said please seat  your self. We sat at a booth near the bar.There was 2 other guest at the bar. No one was at the bar 3 employees cleaning another bar in another area. We waited 10 minutes no one came over. This not the experience I was expecting.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FdWd_fPQfTiLdDUhRUXiXg"
  },
  "n-9mUoJPa8VAkvuVpqZDVg": {
    "date": "4/5/2018",
    "text": "Clean Clean Clean. Thank you! There's no kid menu, but French fries and Mac cheese suited my 3 year old fine. It wasn't busy when we were there, and the food did seem to take longer than we'd like, but the different shows on the screens kept us occupied for the wait. Friendly staff, overall good experience and would go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YvYKKlTYACN7yb7molUuaA"
  },
  "v_81RVaJSx3YNQWRWDylfw": {
    "date": "9/28/2017",
    "text": "Emily, what an amazing girl. I am from Denver, felt such wonderful hospitality. I love the south for a reason. Good choice Emily on the food tonight. You are amazing! Cheers! Girl.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tkscb6uSts3cgWamTVjTA"
  },
  "MRXDnL0QkGNtvxoctsZV6A": {
    "date": "3/26/2017",
    "text": "My boyfriend and I (who are Nascar fans) stopped on a Nascar Sunday while we were in Charlotte. All the TVs that were showing the Nascar race were at the far bar where there was no bartender, therefore we sat at the main bar facing the other bar to watch the race. Apparently certain ends of the main bar don't get served as often as the other end. We waited probably about 10 minutes before we were acknowledged and there was only about 10 other people at the bar who already had drinks in front of them. Finally we got to see the menu, ordered our drinks, and paid for them. We drank our drinks for about 30 minutes and the bartender never came back to ask if everything was ok or if we wanted another drink. We left before the race was even half finished. I was pretty disappointed",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GW6jFOX5pcxIwYBitSMguA"
  },
  "K1Lul1JB4LLNYfaVSq3Ong": {
    "date": "4/8/2017",
    "text": "Extremely rude. Terrible service. Overcharged drinks. Plenty of better places to go around here. Everyone working acts like they have a stick up their ass.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sXBlBgzusQ5waDkWqWN24A"
  },
  "EriD-S_57s78XITx6nPaug": {
    "date": "2/26/2018",
    "text": "Purchased tickets to a concert/event through SPONSORED Facebook advertising and the event page, ticket page, and their social media posts about the event was total False advertisement. It simply had \"Tournament Takeover with Ludacris... No Refunds\" listed on the page. Absolutely NO DESCRIPTION about what the event was for. This event is for the CIAA, the athletic association and division for area race-specific colleges, this tournament has proven crime statistics within the Epicenter area to cause in increase in arrests, police calls, and crime overall; it would be a shame to have all 9 of my friends go to the event and something bad happen to us, which is very likely given that we are predominantly small females. I purchased 9 tickets assuming, as it was targeted on my news feed, that it was a Ludacris concert. One of us found out from a coworker what happens during this tournament weekend in Uptown and how it is not the place for us to be. After looking into it and doing some research, all of my friends and myself wouldn't go even if THEY paid US! We have tried contacting the managers and called 4 different times, finally had to go into Whisky River to speak with someone in person, this girl pretty much said they will not help us. Not even an exchange, or partial refund. We have tried to sell our tickets to other individuals but Whiskey River has since lowered their website prices AND added a detailed description about the event, and what exactly is happening. Now I am SCREWED, and have lost $500.  I am on the Board for non-profits in the area, along with an event planner within my company. We will never ever be back to Whisky River, or purchase any sort of tickets from there. Horrible way to build a loyal customer base - and trust me, word travels fast.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PMMXl57c0SaQaTpB_hsc7w"
  },
  "tuQj7X1ZQu1RPAKYJiK4NA": {
    "date": "4/19/2016",
    "text": "Decent wings... Lemon pepper and parmesan garlic were a step above average. Surprising since I like traditional flavor wings for the most part Good service for our private event. There was also a decent band and an evil mechanical bull. :-)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k0m5nvgAIIA24t_iPZOAsw"
  },
  "IBxxDZAVxT4twh1jXeFqwg": {
    "date": "10/2/2015",
    "text": "It's what buffalo Wild Wings would be if it did meth in a double wide for a week straight. They have all the fixins to be successful with the exception of class and quality. Maybe I was there on 2 bad nights, but damn were they bad.  They did have great security tho!",
    "rating": 2,
    "rated": {
      "funny": 7,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RA4XqDfosRAERmQvsumdig"
  },
  "dlFk2OMfJhxE-SCT791Qbg": {
    "date": "2/20/2017",
    "text": "Went in here for the first time this past week. Was really disappointed. The service was okay when the bartender was not on her phone.   Mostly just upset about the prices - as in well vodka comes with a $9 price tag. That's insane.  Super over priced drinks, served in plastic wear. For the prices you'd think the presentation would have been better.   My first and last visit, there are definitely nicer bars in the area.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KdexguR6S0GPyAuTO10Yww"
  },
  "yT9s4xrMXyU-4E5-TaNYOQ": {
    "date": "9/4/2016",
    "text": "Manager Andy sucks, the other staff was nice. I thought it would be pretty cool to visit Dale Jr's bar and watch the race but Andy seems to think that turning the race volume on will run customers off so we have the pleasure of listening to some Alan Jackson. We will finish our beer and roll to the Mexican restaurant down stairs that has the race and volume turned up! Thanks Andy while you just stand and play on your phone!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "sQcNikeFJjO1UBsq0pLUsg"
  },
  "IpcFcGrrmFQv__0rAhRb_Q": {
    "date": "4/21/2017",
    "text": "Fun place to dance, get drinks or hang out with friends or make new ones.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vEXQPLOCIgYoNXeekjL2aQ"
  },
  "YD4IsvxTkH5mMJgMKrdOWw": {
    "date": "9/24/2017",
    "text": "Horrible service.  From out of town and wanted a good bar to watch the football games.  Sat at bar for 10min and waited for bartender to acknowledge and he walked by 10 times and avoided eye contact.  As a bartender myself you have to greet a guest within 15sec of them sitting down.  Don't normally write reviews unless they're good but felt that this place needs to know that their bald bartender with a beard is horrible at his job and only takes care of his regulars.  My managers would fire me immediately if I ever got a review like this.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "rbZQlzyx3KwrjxHL5QBI1Q"
  },
  "N2KXWuDBd2tkDbUrN4e0lw": {
    "date": "8/29/2015",
    "text": "I was there with another couple last night and our experience was really bizarre. I wonder what's going on behind the scenes? We were in line to get in, and there was a group of men in front of us who were nicely dressed and behaving well.They were turned away at the door and I'm not sure what reason was given. The couple I was with was let in, and then my boyfriend and I were pulled aside by a woman standing next to the doorman and asked to fill out a form so we could get in. She said that Whiskey River was a private club, and we needed a membership card that she was going to give me right away. Fine, although I'm puzzled I fill out the form with basic information and go inside (my friends were not members and allowed to go right in).  There is a $7 cover charge to get in, however the cashier said if we gave her $1 she would let us all in!? Um, ok... thanks!  The venue is a great space and has good energy, but the dance music was all over the place. They changed songs and genres like every 30 seconds. It was really hard to dance to that!  They should really consider sticking to a specific type of music and letting it play out a bit so people can get into it.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "9k59MZQL32IhPr54AGAesw"
  },
  "aUmP0wUatv9VW-iCBbyPwg": {
    "date": "9/5/2016",
    "text": "Sorry food. Sorry service. Sorry ass managers. One server in the whole restaurant on Labor Day. We sat on the patio. Had to go inside to find our appetizer, they said they couldn't find us. The appetizer was cold and soggy when we finally got it. Food finally came out, all wrong and disappointing. Asked for a medium burger, received a burnt well done one. Asked for smothered chicken and received chicken with what looked like microwaved cheese and bacon, nothing else.  Server forgot to put one persons food in, it was only three of us. The only reason I gave them one star is because the food had potential.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "wGn9vnpSuVPiAJlujmG4gA"
  },
  "jEGASU6N94tpBsfCEQS-Yw": {
    "date": "11/29/2016",
    "text": "I live for good wings, so I was pleasantly surprised by how delicious these wings were! I was visiting Charlotte over Thanksgiving weekend, so I was able to stop by this place with some loved ones. I had never been to Whiskey River, so I didn't know what to expect. They have a pretty strict dress code. A lot of guys and girls were turned away at the door after the bar turned into a club. So make sure you dress appropriately before stopping by here. Since we got here after the kitchen closed, we didn't know if we would still be able to place an order. Fortunately, our waitress was kind enough to ask her manager if it would be okay for us to order, so we were able to order some wings. It was 3 of us, so we ordered 26 wings with fried pickles! Unfortunately, I had already eaten prior to coming here, so I didn't get the chance to truly indulge in the wings and pickles. I did have a few wings and they were cooked to perfection! Try the BBQ flavor if you get a chance. Once the dance floor opened up, the bar became super lively. Everyone was dancing and having a good time, just what I like to see when I go out. Oh and there is no cover charge! I would definitely check out this spot the next time I come to Charlotte. Only reason why I give this place 3 stars is because of the super strict dress code (it's a sports bar, why the need for super strict dress code?)  and lack of diverse music. Other than that, this place was pretty legit!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Upc0yyL3cbeoMZZxLKARcQ"
  },
  "un_BCKWl233GOkTR0rR5hw": {
    "date": "8/31/2015",
    "text": "Was on vacation in Charlotte when I happened upon this place.  The menu had typical bar food but also had a nice selection of salads.  I decided to build my own salad cuz I am quite the picky eater.  When the waitress came to take our order I noticed she wasn't writing it down and I told her she might want to because of my order but she assured me she would get it right.   I ordered turkey, tomatoes, cucumbers, peppers, red onions,  cheddar cheese and no dressing.  When the salad came I immediately noticed that there were kalamata olives on it, and I hate the way they taste.  I started picking them out but there were too many so the waitress apologized and offered to have another salad made for me to which I readily agreed.  Unfortunately my friends were nearly done with their food by the time mine arrived.  The manager came over and apologized as well and said that because we didn't get to eat together that my salad would be free so that was pretty awesome.  He then said that in addition they would give us a discount on the rest of the food.  When the bill arrived we were comped my whole meal and drink plus the other drinks so that was very nice.  The food was all very tasty and we received excellent customer service so I would definitely return if I am ever in NC again.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "TpP-TPTWjeFsyu3U41s1WA"
  },
  "kwaG8-mT7YkFce_bOBY2iQ": {
    "date": "7/17/2010",
    "text": "Is it possible to feel old and have fun at the same place? Well that's how I felt last night at Whisky River. The part that made me feel old - The 20 something year olds sporting tight clothing and bumping and grinding on the dance floor. I became that gal who points at the drunken dance fools and laughs (only that used to be me just 5 years ago!). Also the DJ was schizophrenic and went from 90's hard rock to country w/o transition. OK. But every now and then there was a good song from the mid 90's that they'd play and we couldn't help ourselves but dance (part of feeling old and having fun). Plus the plastic bull ride in the middle of night club type of space is just plain hilarious and can only crack you up. So yeah, Whisky River had its good points and not so good points (don't miss having a 20 year old's butt hit my purse!). Still I'd rather do karaoke and that will be my next move on a night out in Charlotte!",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qRBTAUOEWrBY9N1JszH1ow"
  },
  "r9U0hbVMEv2PQr8Qx-5ZVQ": {
    "date": "10/13/2010",
    "text": "Some new friends invited me here one evening and I really had a good time: loud but good music, big crowded dance floor, good mix of guys and women (though much too young for me) and plenty of cushy seats and staff serving drinks (at least in the VIP area). Lots of bouncers around inside but not sure why as all the customers seem to be drinking and having a good time with no sign of belligerent drunks. Not the place to go if you are on a budget but otherwise I would recommend it for a good time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cziRQQ6D7ogpL1gQWEbqRw"
  },
  "5SPHipQNV1ewCZgdMsmGHA": {
    "date": "8/6/2012",
    "text": "okay look, this place look disgusting everytime i go in, everyone is like either sweating perfusely or the dance floor just randomly spray u with water. and its so packed that u are bound to get rub off on with other people's body fluids while listening to some over played music or country music which im not a big fan of.  the staffs seems like they all had a bad day before they go to work or went to their parent's funeral the day before whats their problem?  definitely not a place for fun for me, staff seems like they hate u with a passion, drinks are the same price as other clubs except the place is smaller doesn't have place where u can just have a seat and relax a little bit, so everyone are pretty much forced to go to the dance floor no wonder even the other yelpers are saying the floor is always packed, the bar has little glowing lights on the bar table which was the only thing that interest me in that place but im not going back to see it again considering the over all quality of the place.  but i bet u alots of those people who goes there actually like what most of the things that i just dislike and thats probably why they are there tho =_= cause if not, they would've been out of business 5 years ago.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYyyl3UB_MC_bBWFBqSdkg"
  },
  "ok-tds5LO1NYnXdXbtQtGQ": {
    "date": "2/23/2011",
    "text": "Not my kinda place, but only based on my personal taste. Drinks were kinda weak despite the price, bar tenders weren't flat out rude, but not exactly customer service oriented, and if there's no band playing the only thing to do is watch the drunks ride a mechanical bull in the back of the bar. Sounds like fun at first, and I even gave it a ride, but after about 1/2 hour of watching the same attention whores hop on the back of a fake cow I would've killed for bar game of some type. That's probably my biggest whine about the place is there is not much to do beyond stand there or maybe cut a rug if the band is jammin. Not even a dart board or a pool table. If you're in to the meat market scene, you'll probably like it...just not my cup-o-tea.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "LQ0JVoX-BgAE3aduK_m93Q"
  },
  "ZMWeVABjZnaLPOzrsTd6NQ": {
    "date": "12/14/2011",
    "text": "I went in this bar and had a good time. I followed someone out and was stopped by the management. He told me I couldn't exit at thus particular place. I told him that was fine but the person at the front told me to exit there and he should coordinate with him so they were on the same page. He had me kicked out even though I was fully cooperative. I'm still not certain what his problem was.  I would recommend another bar. There are plenty great ones close.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H-hWTQMp46otbTju2KCs5A"
  },
  "XxRtdgg28Yg5lf_JJ_5Gwg": {
    "date": "9/29/2011",
    "text": "I've been to alot of the dance clubs and bars in uptown..this by far is the most consistent in terms of music and crowd and what to expect.  It's always a diverse crowd - all ages - but not that outrageous that you are wondering what Twilight episode you just walked into.  It's fun for a date night, going out with couples or the girls.  I'm not single..so I don't know if it's a good pick up spot.  The dance floor is crowded but it is always a lot of fun- after 10pm..I\"m sure there are drunk people bumping into each other but your out in a bar!!  I will always pick this place over the others.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vc_3jWCvHssvzMn6EFVvrw"
  },
  "P0OjwyIr8cn4KDr965sWLQ": {
    "date": "5/1/2011",
    "text": "Mechanical bull...pretty great music...and definitley one of the more \"happening\" places in uptown Charlotte.  They have a lot of events and contests here, and it is definitley more of the younger 20 something crowd. I don't like going anywhere I have to pay a cover to get in and I do hate the amount of bachelorette parties that parade through this place, but certain things can't be avoided.  Because it is so huge even when it's packed it's not crazy like Blackfinn nearby ( which goes bizerk on weekends).  For the guys there is always something to look at...over 2 dozen hot young women in short shorts and cowboy boots man the beer stations positioned throught the dance floor while dancing with a ferocity rivaled by the Coyotes.  Not the best place before 9 pm or on a week night, but worth the adventure if you're bar hopping through the epicenter.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ayX1ftLcD59yNwA3awmpA"
  },
  "GKktp3PRdG-yxQD6m8IOMw": {
    "date": "2/3/2014",
    "text": "This is probably a nice late night bar but the food was terrible. There is pub food and there is frozen pub food which I am sure we ate.  I am sorry I passed by Hooters. I met Jr. next day and If I knew him better I would have told him to get new kitchen staff.  I hope management takes note and makes changes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3eF6LauFnCut8vbOQoCpnw"
  },
  "8FKD5Ks8TUxJ0_0JhJIX7Q": {
    "date": "11/12/2012",
    "text": "We were invited to come to Whisky River to be apart of their friends and family event prior to the Grand Opening of the restuarant that is opening before Thanksgiving.  It was actually my first time there, as I have never been to the bar/club before this.  My boyfriend and we were impressed with the service, even though most of the staff was in training.  Our server, Megan, was very sweet and personable and had great recommendations.  We had the buffalo chicken to start and it was amazing!  We also had the BBQ sandwiches and the sauces they have to select from are delicious!!!  And the desserts----WOW.....fantastic!  They have a fried candybar of the month that's going to be featured and even though we didn't order this one, I'm impressed by the option.  The manager, Chris, came over and inquired about our experience and was genuinely interested in how we felt about the food.  I'm excited for them to open because I think it will be a great diverse option to the other food choices at the Epicenter.  Kind of a gourmet, southern menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "VP0jOO0u-z0JIxZ52bQtJw"
  },
  "rOU-6zpYKqV3HZmuFZxEsA": {
    "date": "3/11/2013",
    "text": "They recently added food, so we decided to check it out. The food was OK, but not something I will go out of my way for. Went on a Saturday afternoon and it was mildly busy, but we got seated immediately. It's like a Hooters in the Epicentre. I actually felt bad for the waitress, she was basically wearing nothing. Although that didn't excuse her for the horrible service we got. She gave us the check well before we were done eating, which normally wouldn't bother me, but I didn't realize it was so she didn't have to come back to our table. We eventually had to seek her out to pay just so we could leave. So I got my first and last time at Whiskey River out of the way.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oY9ZkOjJJ_zShYQ4AsZ7CQ"
  },
  "xPnSnT_0SixqA5z6_oKx-w": {
    "date": "11/9/2011",
    "text": "They play good music and the staff is friendly.  One of the less snotty clubs in the epicenter.  The best part is the MECHANICAL BULL!!!  My friend rode the darn thing 4times while we were in town.  Its so fun to watch all the drunk girls get giggled around on the bull. Not to mention the guys! HAHAhAA i dont know what makes any self respecting man get on a mechanical bull, but hey i wasnt mad about watching.  I would totally go here again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y55cqs0PYcRQNL_yLuenuA"
  },
  "pZItz3PiddGclXI-dJbPHA": {
    "date": "10/26/2011",
    "text": "This place is full idiots!   There should be a screening at the front door only allowing certain people in.  :)    That would make it a much more enjoyable enviroment.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5QfAKgk-_DUArxx0EiYRw"
  },
  "yaic289_1C96dZgWy3kQnA": {
    "date": "2/27/2011",
    "text": "Everytime I've been here, It's the same thing. Too many people, generally The same age as my parents. People drop their drinks and no one cleans up the broken glass. Bartenders kind of suck, but are at least nice when you pay them. It's just far too expensive to get in. Not really a fan",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "etJXHbM-XrQY0J6MPrYESg"
  },
  "OjXtwImCURju7m1fIVpPzA": {
    "date": "7/4/2011",
    "text": "Not great.  I like that there is a lot of space and the cool fog machine shooter things.  Otherwise it is a pretty dumpy place.  The interior is industrial NASCAR garage /  cowboy / clashing things.  There is usually a cover.  The music is alright and there is the bull to ride.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f47N37WU1_PsQKxvZdaTwA"
  },
  "3DGd-_iU6A808a_Jn-VeBA": {
    "date": "12/13/2010",
    "text": "Had a really great time here, tons of people and really good music, and the thing I remember MOST clearly was that there was NO line for the women's bathroom! Maybe girls are just lower maintenance or more considerate than in NYC, but I was so impressed with the lack of a bathroom line.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "l-lJjM6MejlDEhbuGnhDKg"
  },
  "YleET1ARnF_WD2zsgLGxHQ": {
    "date": "9/19/2010",
    "text": "Whisky River is nothing special. We went there on a Saturday night after the Jaguars vs. Jets preseason game so it was pretty crowded by the time we got there around 11pm.  First off, there was a line out the door to get in and seemed to only be letting 2 people in at a time, but it moved pretty quick.  For 3 of us to get in it cost $21, which isn't that bad.    The drinks were reasonably priced for a club/bar in a downtown area. Example, 2 bottles of Bud Light and a mixed drink w/well liquor cost us around $12. I'm from Chicago, so those prices were great compared to what we pay downtown at an equivalent type of bar.  Try to find a place to stand at the bar(we did) as it was 3 people deep trying to get a drink behind us.  There are 3 bar areas though, and we didn't have to wait that long for a drink.  The crowd ranged from 20 somethings to mid 40s.  There was a DJ who played mostly what you would hear on the radio Pop, and some \"rap\", or club music.  It was crowded and people would bump into you frequently.  If you want a place where you can talk and relax, then this is not for you.  If you want some laughs there is a mechanical bull.  Watching the drunks try to ride it was hilarious, however, mechanical bull is more for the men to oogle the young women.  I wouldn't ride it because the operate seemed kind of pervy.    One complaint I had was that someone dropped their glass and it broke, apparently glass had cut my ankle, but I didn't know it until I went to the bathroom.  When I went and told a bartender that there was broken glass and I had already been cut he said he would send someone to clean it up. It took about 45 minutes.  They didn't offer me a band-aid or anything.    It was fun! I'd say check it out if you're in Charlotte.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Bp8WMNhxtT9DjAEzXvjP9A"
  },
  "GcTaccd29UgB9wGsIkZi6Q": {
    "date": "10/12/2013",
    "text": "Best ribs I've ever had. Definitely worth the trip if you're in Charlotte for the races.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lh45QnUpliqCdkhVJsXzsA"
  },
  "j5Q2s1bSG--lxRSO3-gmag": {
    "date": "8/27/2011",
    "text": "All I can say is wow! I recently had to go to Charlotte for some training for work. It was Sunday and I couldn't sleep because of the time change so I went to get a drink as a replacement to the Ambien I wish I had. There is where I met the reason why I spent 4 of the 5 nights I was in town at Whiskey River.  Ashley and her little sidekick Whitney were the coolest and most accommodating people I think I may ever have been exposed to! My first efforts at damaging my corporate reputation in front of 26 coworkers and 4 managers started by a shirtless bull riding stint.  I couldn't believe that I didn't get thrown out immediately, instead embraced as legendary at least among colleagues. This was college night which by the way if you're looking for beautiful women dressed up all naughty, GO THERE ON TUESDAYS!  Wednesday was an interesting night where I seduced a woman to hookup with a married guy, don't judge it wasn't my decision. Thursday was the concert where Ashley worked outside to awesome music and dancing. I dont mean to make this sound like a journal, but this is America where we have freedom of speach, so if you don't like it, read another review. Im simply trying to describe my experience and if you like what you hear, you can follow what i recommended. All in all it was fantastic time based on the scene at the bar with my new friends Ashley and Whitney. I wish you guys would stay in touch...   All the best,   Your favorite customer",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oHzcyQ4OZhTJkwR2qeE7JA"
  },
  "FmO2W2Yu4g_PsOg7jm7HsQ": {
    "date": "12/7/2009",
    "text": "I dunno, I was drunk when I got there.  It's amateur night there every night! They have a mechanical bull.  You might find yourself looking up at the sky wondering if it was 8 seconds.  Trust me it wasnt.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "abZtGdO5wgXUBjolcZgb7Q"
  },
  "6h6AmT-RXuU4jmUw9XMgqw": {
    "date": "8/7/2009",
    "text": "When is bar first opened I was excited!  I thought the concept was awesome and it would be like a neighborhood bar.  Instead it is nothing but a tourist attraction for race fans with the need to do all things Dale Jr.  I've been three times hoping it would get better but if I want to drink overpriced beer with a mediocre atmosphere, I would not go uptown to do it..  And if you don't like Whisky River and trot down to Suite, it is also a total bomb... The only reason I gave it two stars is 1, it has beer, and 2 it has a bull....",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "7rowBp6ubUFWCHseEpRKpA"
  },
  "vQmrLxQMZBWvcIL0oKwI-g": {
    "date": "3/8/2013",
    "text": "The food is great! My friends and I ordered platter full of BBQ chicken and pork, and it was absolutely amazing. The servers are very friendly and energetic. Defiantly a must see if you are visiting Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hrVVTZA4yiLvXrPEUvhamA"
  },
  "dtqAhTQq-WxiumSq6u390g": {
    "date": "7/31/2009",
    "text": "Yeah!  Bud Light specials and 20-year-olds!   If you're lucky you can get your drunk mug on Lazy Day!  Sorry just not for me.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Sz84_SyrNYi4wsX__6haLQ"
  },
  "2BHPj0dQ_qJuHGgJcGqDJQ": {
    "date": "11/26/2012",
    "text": "this review is based on the food. I came in on a monday night at 5pm and there was nobody there...the whole epic centre was pretty dead. we were looking for a place with food and drinks and decided on the whiskey river since the menu looked good we gave it a shot! I was pleasantly surprised, the food was great! i'm giving them 4 stars because the baked beans were to thick they were more like refried beans although the flavor was great, the beef brisket was excellent and so were the ribs, corn bread and fried pickles . This was my first time there and i would defiantly come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MO9Dx4RxfLx2o1bfn__eNg"
  },
  "fEh4p4Q8PK336ND8gOVp4A": {
    "date": "4/8/2018",
    "text": "First of all I did not even want to add one star to this review . The food was decent but the service was awful by chelsy and we called.the manager that was on evening duty and he could careless that the server gave bad service I don't know his name because he dint even bother to say who he was nothing , just nothing at all I drove 14 hours from Chicago  n I just wanted decent service n a good meal . I DO NOT RECOMMEND",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1DcBnXzwVTurhVsSXNHGsQ"
  },
  "4S2FunYaFoAS8pl5Uz7h0A": {
    "date": "5/28/2017",
    "text": "Horrible service ... one waitress on staff ( from what we would see ) Memorial Day weekend ... they were out of so many items on the menu ...took the waitress 30 min to come back and tell us ...  and still hadn't put out order in ... we ended up leaving after waiting an hour to be told our order wasn't even in yet .... and our bill was $40 for drinks and no food :/  we left and went to five guys ... very disappointed and no apologies were even given   And the restaurant was relatively empty",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ubNyBF2Mti8I3FF82ruc0w"
  },
  "w25uy7AFQFKu3BA5Mdj_VA": {
    "date": "5/26/2015",
    "text": "Two words: Dale Yeah.  You need to know what Whisky River is and what it isn't before you walk through the doors. It's Dale Jr's bar. It's not a five star restaurant. There's a mechanical bull. The girls are hot and dressed to show it. The music may be loud for some people. You'lll hear country music. On Thursdays, you may see some line dancing.  I always have fun when I pop in to The River. A lot of staff members have been here a long time, so I always see a familiar face behind the bar. Tuesday is college night. Don't be shocked if there's a bikini contest. For the sports crowd, there's a bunch of tvs and a projector screen. Sundays NASCAR rules. If Dale Jr wins a race, it's open bar for an hour. If you're looking to do a birthday/bachelor/bachelorette party, they have a nice little VIP area for tables and bottle service. Keep an eye on the events calendar, they always have some sort of fun happenings.  I never come here to eat, but I have had some things here at various events. Ton of wing flavors. There's even a flatbread with mac and cheese on it. They do a lunch menu where everything is $8.88 (includes fries and non-alcoholic drink).   Both bathrooms (at least in the land of the ladies) are clean and there's usually a bathroom attendant. Whisky is a nice spot to pre or post game for Hornets/Checkers/concerts/arena events.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "DY3iaxTxSgERXWemPURkMg": {
    "date": "9/17/2017",
    "text": "Here's the deal. They're on a False wait. On a game day. How are you not fully staffed on a game day? 7 open tables within sight upon walking in the restaurant.... 1 hour wait. \"The kitchen is on a wait, the dining room isnt.\" Maybe you guys should learn how to staff. Was willing to check out a new local spot and regretted it immediately. Management is clearly the big issue here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PDlHdhMgtpHR4wvJ8Ho6gg"
  },
  "diC3tLDb4Nd6LqmFYramqw": {
    "date": "4/19/2018",
    "text": "I would give this place zero stars if I could. The service was horrible. We came with a big group and it took a while for us to get seated. By the time our drink orders were taken, we had been there at least 30 minutes & only 2 menus were provided for a party of 12 people. We finally realized we weren't getting the proper service and decided to leave. The manager apologized stating that he should have told us before we got seated, that he couldn't accommodate our group. He even had the nerve to think we would pay for the drink orders that the waitress got completely wrong! Huge disappointment after a friend recommended this place to me. Definitely not coming here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bzmJ2c_Zcic7d4qEjXO3SA"
  },
  "2GftIgH2wbiVeROVqkRkSA": {
    "date": "12/10/2015",
    "text": "5 stars......  Yeah, I'll go there.  Is it the best restaurant in town, no, but who doesn't want to ride a bull after dinner?  Add the fact that they have an amazingly friendly staff and I'll go ahead and throw out that 5th star.  I've been here a couple times, but never wrote a review.  It was always for an event, so I didn't know if my experience was a genuine experience.  It is the epicenter, so expect a diverse crowd.  A general mix of what Charlotte and the surrounding area is, eclectic to say the least.  On to the food.  I was surprised, like REALLY surprised.  I expected normal bar food.  I think it might just be a current special, but they have these little potato cake things, kind of a latke meets hashbrowns maybe?  Obviously fresh made and then they cover them with a gravy and scallions.  Friggin delcious!  Thanks to a heads up from Nikki W.(not the CM one) I ordered up some buffalo dip with chicken that was a great way to get some wing flavor without all the mess.  I had a cute date and was trying to show some manners.  What really gave it the 5th star was the service though.  Although quite young, our server seemed to have an attentive smiling face seemingly no matter what else was going on.  Plus, the manager on duty, a dark haired, smiling, young lady even came over to ask how everything was.  Not something you normally see in a bar situation.  As far as the decor goes, there is a mechanical bull, what else could you ask for.  Lava lamps all over one of the bars?  Cowhide on the back of the barstools?  Does it all work?  Thats up to you I guess, but it gave me plenty to look at.  I don't know that this will be my first choice in bars in Charlotte, but it will always be there as an option, especially when entertaining out of towners.  There's a non-chain feel to the place that is hard to come by these days.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wnFWoQ63F9-ohUQ-C0AeIw"
  },
  "MZaYJpfI7zP8Z_OJnBsk_g": {
    "date": "7/4/2017",
    "text": "This place is a joke!!! Me and my friends when in at sat at the bar I ordered a sweet tea and my friends ordered a beer and he got his beer and I waited for my sweet tea never came so another  bartender came up and asked I said I ordered sweet tea so she told me that other woman was getting it the lady never got the other one did and she gave me attitude when I said no because it took to long and she got mad!! The two bartenders were talking crap about me ordering a drink other then alcohol!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xv6SV8EcOw4I6p6O50kCLA"
  },
  "RILy1rKGHXpIjqdyDiUecw": {
    "date": "3/23/2016",
    "text": "I was at Whiskey River on a Monday night while in town for a conference.  Overall, the experience was meh.  My company hosted a conference near the Epicenter and Whiskey River came recommended to us by the concierge.  About 50 people from our group of conference attendees showed up, and it turned out we were the only people there.  The ambience was cool, very rustic, ands there was a stage set up, so I imagine this is a great live music venue.   The service on the other hand was pretty awful.  Perhaps they were short staffed, but regardless, it shouldn't take 15 minutes to get a beer.  I tried ordering whiskey on the rocks and asked for 4 different whiskeys on their menu before finally choosing one they had in stock.  A whiskey bar that's out of whiskey?  Weird. Someone in my group ordered a giant plate of wings, only to be brought a gooey, sloppy mess on a plate.  Despite that, I tried one, and it was just that: a gooey sloppy mess.   I can't say I'll be back to Whiskey River next time in Charlotte....it looked like there were some other cool spots nearby, so I'll check those out instead.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "axh9xP0o47yr9LPT3AEtTA"
  },
  "teXI_lhEPMIdBmBrVTSHnA": {
    "date": "10/4/2017",
    "text": "I have never in my life been treated so badly. I am a bartender in Charlotte and I know how it goes if you have a bad day or whatever. But to walk past three ladies sitting at your bar when there are four of you and 5 other people besides us is appalling. I can almost guarantee you would have made more money off of us three than the college kids who came in. The only saving grace was your bar manger who was the only person to serve us. Having friends come down from up north to visit and to be treated like that is embarrassing. Get it together.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tJZWscnlFyzpq28FCpY5vw"
  },
  "m-elpIkquPrLMuqHAa6hDA": {
    "date": "8/8/2014",
    "text": "We visited the Charlotte, NC location last week for dinner around 6:30.  It was not a positive experience.  The whole place smelled like cow crap, but that might be by design.  One of the guys in our party admitted it might be hard to keep the food down with this stink.  After being seated fairly quickly, we were told that we couldn't order any of the beer on tap because it \"wasn't in the computer yet\".  We asked if we could be served the beer while they put it into the computer, but no luck there either.  When we received our food, which I admit was pretty quick, the brisket on Texas Toast was a mess.  It was a single slice of dry meat product between two slices of white bread.  See the picture I uploaded as an example.  I feel I'm describing it accurately here.  The place was mostly empty so we paid and left pretty quickly, passing a really dirty guy that had his swollen foot up on the bar with a bag of ice.  Definitely not sanitary.  I saw this same gentleman the next morning yelling at people for change. I would avoid Whisky River.  There are better places with better prices all around the Epicenter.  We'll never go back here.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tNMvGS0UrLDr9yIl8hXYrg",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tNMvGS0UrLDr9yIl8hXYrg/o.jpg"
      }
    ],
    "user_id": "X6rimtLNwVq7xp_CdBGXFA"
  },
  "511f_GHITD7S5gBh5gVTLQ": {
    "date": "8/13/2017",
    "text": "Great Spot! Whisky River has been a favorite of my wife and I for years. John the bartender keeps it real and the flow smooth. Try the buckin bull if you dare... guys please no",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "asEBo8lyHhnVm2xL3xE13A"
  },
  "CBcd9TslHLKVTMy93wJgbg": {
    "date": "1/13/2016",
    "text": "These place is pretty skanky to start. The last straw is their sponsorship of an opposing team pep rally during the Panthers playoff run. I will do everything I can to make sure nobody ever goes here again. Trash food/beer isn't worth their insolence.  GO PANTHERS!",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 11,
      "cool": 7
    },
    "photos": [],
    "user_id": "cdCuPlORVt2y7XnCb7SECQ"
  },
  "6bt33T3X-5pwLA06VhR4uA": {
    "date": "1/30/2016",
    "text": "Terrible. I have been a bartender for 8 years and currently work for a large beer company. I NEVER send food back, or complain. We ordered 3 entrees, all terrible! Chicken Nachos where cold and awful, wings COLD AND AWFUL! Buffalo chicken dip was discussing and clearly sitting in the window for to long. They still had the nerve to charge us $27.00! Apparently a Jameson and ginger ale is $18...GARBAGE...I would recommend gas station sushi over this place   P.S I would put 1/8 a star if possible",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4HHtFXnW0yJIk9dCm0Vfxw",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. Don&amp;#39;t go here if you like warm food",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4HHtFXnW0yJIk9dCm0Vfxw/o.jpg"
      }
    ],
    "user_id": "WwRV8mXmxVOCzlWWVec7IA"
  },
  "9pTygzepWvZs66DNd_pGDQ": {
    "date": "3/15/2017",
    "text": "This place is god to hang out for the fact that it has a dance floor and for its proximity of being in downtown. We were there just for drinks. The most awful experience was they took cover charge from us, gave us a wrist band and when I had to step out for a phone call and step back in within 15 min, the woman at the front charged me another 5$ saying I didn't get a stamp on my hand. Neither was there anyone at the exit to stamp nor anyone informed that we have to get a stamp on our hand. It's not about paying 5$ but the desperation to make that money when they could see the band on my hand and understand that I was admitted. Neither she or her bouncer was willing to listen. I could have thrown 10$ for their desperation.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bernKVE_dEP0B6q8I66_vg"
  },
  "-6MsPWlVWZlDUKlfCKbA9Q": {
    "date": "6/23/2017",
    "text": "This was a total buzz kill as far as the food. Atmosphere, people and music were great. The food was just not good, bland and tasted as if the brisket and roast beef were microwaved. Dale can work on it after he retires.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3NnuDmr-wjg9u2fNs2vhuw"
  },
  "z8Uz3tik31PK71X-UBR-pw": {
    "date": "10/30/2014",
    "text": "Went here today before heading out the panthers games. Our server was friendly but me and my brother had wings and they wasn't hot at all as in flavor. Was really looking forward to that more than anything . We used a groupon so not such much of a waste.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q9em5qdXxwdlV6cTS8k9ug"
  },
  "alHGAJlLb-Z-vJuYt23ZOg": {
    "date": "10/5/2015",
    "text": "What a horrible experience from the time we sat down at our table the waitress was completely clueless didn't know what kinds of flavored vodka they have so not  make it anymore difficult I just ordered a regular vodka and tonic she didn't even know what brands of vodka they carry then ordered patron shots and she brings some brown liquor she was totally clueless and rolled her eyes when we told her that wast patron . Decided to order chicken fingers asked for ranch and honey mustard she brought ketchup had to ask her 3 more times before she finally brought what I asked for. My spouse ordered the hamburger and it was terrible and and the fries were cold and like rubber He sent it back she didn't even ask if he wanted anything else and not to mention when we got the tab she still charged us for it . Will never return here again beware stay away !",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "oaCl7cv19ZXOSK21Hhh9GA"
  },
  "SqyI6550rT9N3wT6ffLB1w": {
    "date": "9/5/2008",
    "text": "If you don't mind paying a ridiculous cover charge to listen to loud, live music you could hear just about anywhere else, and don't particularly care what you're drinking, this is probably a really fun place. The coolest things about it are that it's a huge space and they have coin lockers so you can ditch your backpack, purse or briefcase and have fun all night hands-free with nothing but your ID, cash or credit card and that orange key in your pocket.  Would I go here again? No. Why? Because they don't have any whiskey!  I know it's a glorified All-American bar. But if you're going to call yourself Whiskey River, carry some bourbon I haven't already had a million times!  Wild Turkey (crap!), Makers Mark (crap!) and Johnny Walker (bo-oring!) hardly create an amazing selection of booze. Maybe I'm completely missing the point. But I'm a whiskey drinker and there's no notable selection of whiskey, whisky or even moonshine here. Call it \"Swill River\" and stock nothing but \"well\" labels and you won't disappoint.  Also I have no interest in the electric bull gazing crowd. That's usually a half step from a strip club, with guys ogling and girls just trying to get in and out of the spotlight. But Whiskey River is a really cool looking bar with cow themed booths, lava lamps and seemingly friendly people just out for a good time.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "H5ngovzzIaGkEBdGubD7XA",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. Bronco Bull Bar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/H5ngovzzIaGkEBdGubD7XA/o.jpg"
      }
    ],
    "user_id": "c3_AdjAlMy4EJYQhuXADgA"
  },
  "6HfGx_3QvWLS8s_0RE1omg": {
    "date": "1/24/2016",
    "text": "I have mixed reviews on this place.  On one hand, literally every girl that works here looks incredible and the food is pretty good.  On the other hand, the menu can fit on a 3x5 card and the beer selection isn't that great.  I know most people can live on Budweiser and Yeungling, but I want more out of life.  The layout is pretty cool and there are plenty of tvs to see the big game so I would probably come back, just not if I was hungry or looking for a drink.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q-_1OsrDp8QNRWEFF7qf0w"
  },
  "8UDjdsj76SeoNFl1U7LIsg": {
    "date": "6/12/2016",
    "text": "I'm here visiting from New York and the two bartenders that worked today are fantastic. Lizzie and John served us and they were respectful, outgoing, welcoming and very attentive to us and everyone around them. The bar did pick up a bit from when we came in but their service was just as great when there was one person and just as great when there were 12. If you end up coming to this bar I recommend coming in when they are working! Great place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BqKj22kVwraqtZsYyBFnnw"
  },
  "Wb9QhxkoqtMMAlrDWMEwlQ": {
    "date": "10/23/2016",
    "text": "Very deceptive bar attenders and they tend to cheat and are capable of covering it. Not preferable place if you are planning for a good <a href=\"/redir?url=http%3A%2F%2Fweekend.dance&s=cddbad04f761eec01cd538334e1f443a1032132e20139da53bdf5f48345fa37b\" target=\"_blank\" rel=\"nofollow\">weekend.dance</a> floor is good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ECSOO8P3WQVvaNNr3IzHjg"
  },
  "Xy0Hwg_kGgf0gF_DEEU57w": {
    "date": "11/15/2016",
    "text": "Service was worse than horrible.  It's as if the bartender didn't want to work or make any money.  It was so bad I didn't even stay to eat. She was to busy stuffing her face to even ask me if I wanted something to eat or drink.  Atleast find some girls that can look good in those shorts to work behind the bar.  I should have sat at a table.  The bartender with that tattoos looked like she just lost her dog",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XircXz37-jKKIRI6Xa1UgA"
  },
  "roeTBYSWqw5cCBVQX3j68w": {
    "date": "11/1/2016",
    "text": "Very prejudice bar.  Kicked a black guy out for dancing with a woman.   Also kicked out a gay friend for ordering a drink when the bartender didnt know how to do  her job.  She was rude to everyone. The bar lost lots of money due to this incidents. Piss poor service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2H8jO1vGJMe2uqOtTgjRjQ"
  },
  "wdoOD2XPnzF6POov7e5DFw": {
    "date": "11/20/2015",
    "text": "Came in here with my sister. I'm in town for a little bit and she wanted to show me the epicentre. She didn't really have a specific spot in mind and we were starving so we just walked into whiskey river. The two hostesses at the front weren't extremely friendly, but whatever. We were sat at a high top table. Comfortable seats. We got chips and salsa as an appetizer, the salsa was pretty good. I ordered a California burger, sis ordered a buffalo chicken sandwich and sweet potato waffle fries. My fries were hot and my burger was good. I also had a Kentucky Mai tai? It was a good drink for me, tasted just like fruit punch. See how I keep using the word \"good\"? That's how everything was here, everything was decent, good, average, just VERY average. Nothing was exceptional or standout to make me come back ever again, but I was pleased with my experience. Nothing to complain about! I really do believe they need something to give them an upper hand over the other billion places that serve American food. Plain burgers and tenders aren't doing it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TXKAjgYnGhbTAFeKhxOpeA",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. Pretty average",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TXKAjgYnGhbTAFeKhxOpeA/o.jpg"
      }
    ],
    "user_id": "GtfDViA2EwaoKI0A6kWnRw"
  },
  "jFwNDcSrPxXMFaUf6vO5ZQ": {
    "date": "2/21/2017",
    "text": "Whiskey River is perfect for the late business crowd that just landed in Charlotte. Their lemon pepper wings are crispy and well seasoned. Our waitress was kind and patient.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cM-pKH-C_P30NPz-_b9wfQ"
  },
  "mBFEqLrIBJGVHS7L1Kpj9g": {
    "date": "3/30/2016",
    "text": "Look, most of the reviews here are entirely accurate but this place serves as a Redskins bar so I refuse to say a bad word about it. They usually have domestic beer specials on game days so you can get by without spending too much. Don't count on the food being great but this is  the place to be on Redskins gameday.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e_Dntr4e4djF49d126tLew"
  },
  "DGyYzwH8MPIJO55QzRfVZA": {
    "date": "11/2/2016",
    "text": "This place was a huge disappointment.  We're in town for a conference and we're looking for a place to take clients. We decided to come to Whiskey River and it looked like a great place to hang out. As the night progressed they began charging people $5 at the door. We figured it was to dance with the DJ that they said would be  later after the ball game. They decide at the last minute to leave the dance floor section of the club closed. The security 3 times escorted people out who complained about the service. Doubles were single pours and when one of my clients complained, the bartender stood on the bar screaming for security and they had him thrown out. The way the situation was handled was pretty ridiculous and after closing a $550 tab, we all promptly left. Do yourself a favor and pick another place. This place was rude.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FxmAksbZFlYfLXD11SVklg"
  },
  "2EVDl1nF4vPbQeE7cXprFw": {
    "date": "7/4/2015",
    "text": "We didn't eat, so this review is based solely on drinks and service. We waited for 15 minutes for a server, finally went and asked the hostess. She said she would send someone right over. We waited 10 minutes and when we were getting up to leave, a server finally came over. At this point we were ticked off but each ordered a drinks. The beers were warm. The bar had a limited liquor selection. Before we left, we waited 15 more minutes for our check. Was not a staff size or business issue. Restaurant was 1/3 full and literally had 10 servers hanging out talking to each other hardly doing anything. Drinks were expensive. Definitely will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "xSHjgI3uUEneFNlYHR1dEg"
  },
  "VzIubfxasZVH-dmu81m4hw": {
    "date": "8/21/2015",
    "text": "Positively mediocre. Stale sandwich roll and the chicken died in vain. The beer was cold and they had two local brews so at least they've got that going for them.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mzm0R3sXFRgDQ0DPf1UKSA"
  },
  "iK4sWy4Wr-l0VlTvcNhZfg": {
    "date": "9/13/2013",
    "text": "Not very impressive. Male bar staff unattentive to customers. Chicken tenders served for our non-profit fundraiser. We will be somewhere else next year.  See Amy H. review (8-11-13), I ditto her reaction.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DfwEL-QFMK2DinoqAHqKCw"
  },
  "AEKUepnYNdT3ogN0_-M0VA": {
    "date": "4/20/2017",
    "text": "I enjoyed the wings more than anything and the food was ok and the banana pudding was on point just think it's more alive at night cause I honestly thought it was closed on first glance lol but overall great experience just bad timing I think. Worth the stop for sure!!! Thanks",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H8jQEYPQzV0Qgiox0t7W0g"
  },
  "CUYqbYZ0CAhd74K37Cmq2Q": {
    "date": "10/18/2015",
    "text": "This is a little nicer version of a sports bar.  It's spacious and clean but the service was mediocre.  We order apps and drinks; the prices were average maybe even a little high for NC but I would go back the food was decent.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6E3Z4yiajuHAd_NKBPiROA"
  },
  "yAeZAVDfPl4yxiJ-xftLCQ": {
    "date": "8/1/2015",
    "text": "I honestly thought this place would be awesome given its location and the owner.. Not so much. I tried it once about a week ago and was served warm beer. No big deal, staff was accommodating so I let it slide. Went in again Friday night with some friends paid a $7.00 cover and had one beer. Went to order another beer and the bartender responds with \"sorry we just lost our liquor license and can't serve anyone\" that's all fine and well however paying $12.00 (including cover) for a yuengling only to have to leave 20 minutes later is unacceptable. They should have reimbursed everyone their cover charge. It makes no sense that they wouldn't, the place clearly makes plenty of money. I don't care about the $7.00 it's more so just the point. I'll never return to this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yCSCz8nNxz8ct8Z9CI0hmw"
  },
  "7F-xT7Fi9ktITT7YomH2Yw": {
    "date": "11/14/2016",
    "text": "First of all I work in the industry and manage.  I absolutely hate reviews but this place is all for looks.  Hot bartenders with no service skills.  They were on there phone half the time not trying to communicate with the guests it's \"what do you want to drink\" and \"are you ready for your tab\".  Which translates to me give me your money and get out.  Too any bars to go to in Charlotte to avoid that crap",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iDAYnfp7tKAn-wjjZhfGKg"
  },
  "y68j9mDfAjwbk0k4T7GwAg": {
    "date": "7/11/2015",
    "text": "Horrible service. Waited 15min after being seated and not one server came and took our order.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "koAH4Rlg1zph-YgdqlD9KQ"
  },
  "IN0M4seuCleTvRH0dqSj8w": {
    "date": "8/11/2018",
    "text": "Good drinks and cool bartenders ask for Mark if you want a good drinks. The bull ride is a must.. Late night no cover charge yet good music and vibes. The location is okay for it to be the \"country\".",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dEuHFkcWg-qQkmgpa1OLtg",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. lemon drops, Jack, and moscow mule!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dEuHFkcWg-qQkmgpa1OLtg/o.jpg"
      }
    ],
    "user_id": "5HHFevwnq-cnyTyIMb4PQg"
  },
  "fK6B6tKTNgHswUNmlzZ0pQ": {
    "date": "7/15/2018",
    "text": "I've been here a few time but today I'm truly disappointed. My friend and I met up for dinner, she arrived before myself and she wasn't even acknowledged by staff. When I arrived the same thing happened,  no one said anything to us, so after about ten minutes or so we left.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KYr1mr7NjRQicflxVxlR6Q"
  },
  "M-DBKhBmxQcvATLKnkz7bg": {
    "date": "2/3/2019",
    "text": "Don't waste your hunger here. For $63 we had a Cesar with dark meat chicken cubes yuck. A club that was basically a turkey sandwich on toasted white bread yuck. And chicken tenders that were thin and over cooked yuck. The wait staff was perfectly fine but we went for lunch.  Disappointing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T95n8zY4Yq22Kl04jT_qeQ"
  },
  "DOslUEzkMjCgkfQkeLN9PQ": {
    "date": "5/8/2018",
    "text": "The food arrived cold. The spinach's dip had decent flavor. Good jalapeno bacon bites. The wings were overly salty. The atmosphere is typical southern bar with a nice aesthetic. The service was poor at best, and the managers were apologetic to every table within earshot. The service was polite, but slow and forgetful. We aren't planning a return visit. Overall poor kitchen with poor service that is poorly managed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ju2-w69EGA4CKhSqef49uw"
  },
  "-fXzL89ySeeCfLmAbjMnlA": {
    "date": "6/17/2018",
    "text": "I went here a while ago and it was amazing. Staff was fun and entertaining. Food was good and hot and the drinks were great. I'd recommend it to anyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dDhVVN0ylsB3qUIUnLlyAQ"
  },
  "6clnBdqDGbEvMwSQlTeQOg": {
    "date": "9/23/2017",
    "text": "There are no words to express the profound disappointment in our dining experience. I'm quite certain that Dale would be shocked at the sad state of his brain child. I have given my mind a few days to think things clearly, but nothing has changed.  That being said, the manager did correct the situation from a financial standpoint.   I am from Idaho.  I am in the heart of NASCAR.  It was my choice to make a trip of 5 of us into Whiskey River to satisfy a NASCAR based whim. On a Wednesday night. That was not hardly busy.  Three of us ordered brisket. We were served LESS THAN AN OUNCE OF SOMETHING ABOUT THE THICKNESS OF BACON. 16 bucks for less meat than any local Dennys. Some was so crispy that it broke in half, other pieces were nothing but fat.  I couldn't comment on flavor or smoke - there wasn't enough to get a good bite. What in the hell? The fries were cold - not like warm... cold.  The chicken sandwich was so extremely over cooked to the point of jerky. Dry... cold. Not even lukewarm. It was ordered as grilled, not deep fried.  But the blue cheese salad dressing was really good.  The fact that I brought 4 other people with me was beyond embarrassing.  Again the Manager took the entrees off the check; offered to bring us something else. At that point, we cut our losses and just left. I honestly cannot recall a more miserable experience as long as I have been actively reviewing restaurants.   Dear Dale - your management needs an intervention. I realize you have much more in your plate, but I also know the concept of Whiskey River was near and dear to your heart. It is not a place I will come back to nor recommend to anyone.  Cross posted.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XG6yiZ73giOFUF2IMGCOVg"
  },
  "eDN0MZMUn068EprU0RA-vQ": {
    "date": "11/26/2018",
    "text": "Look, I am the last person to complain about this place because it's a wvu bar but we came in just for an order of nachos and to leave and it was awful. A meal that should have taken 29/30 min turned into almost a 2 hour experience. But it's probably because our server, Brooke, spent the majority of her time on her phone sitting at the bar. Love the food but next time I'm going to make sure to get a better server...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f0jZg60LMW7yYkO8zLqKGg"
  },
  "WuDU1QKgeFB2E4dJHoo4Ig": {
    "date": "6/11/2018",
    "text": "In town on vacation.  Wanted to try this place seeing how its owened by Dale jr.  Did not come away disappointed. Our server Jordan went out of her way to serve us.  Great attitude and willingness to meet our needs.  Amanda the was working in the merchandise area was great.  Fun to talk to had us laughing.  She was also nice enough to take our picture under the whisky river logo.  If your in town and want a good meal with great people check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7hK7ooNd4dKQWI9aRjGUpA"
  },
  "TOWBo-xats-u0mg7kUGZLA": {
    "date": "3/10/2018",
    "text": "Service ok!! No hand soap in women's bathroom. Told the waitress about it and she said she would have to get the manager. Food took forever and it was not good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iRM02471TcYjT1z0QRqT5g"
  },
  "IdFVi8GGUlx9Q2_NUw2pUA": {
    "date": "3/15/2018",
    "text": "Cool location came for ciaa I had tickets but by time I found the correct entrance  to enter threw   it was expired and they charged me 20  the bar staff was the coolest the bar was gorgeous  like the lights in it also the layout is spacious .   There is concierge  in the rest room  she has everything curling irons, lotion, soap , pads etc  there is numerous bars and vip  great spot",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iI6u5Wpxs0tVzaK996pzXQ"
  },
  "IXKe96Q1KRVzAG1hDkVyrQ": {
    "date": "9/1/2017",
    "text": "Nice spot. Great music. The jalapenos were good and so was the sampler. They were out of the jars. Big bummer, wish it wasn't advertised. Staff is pleasant. It's a cool spot to grab a drink, chill, and people watch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "CzzoNeaCU2nQK8iztuAelw",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CzzoNeaCU2nQK8iztuAelw/o.jpg"
      }
    ],
    "user_id": "zg3TAzMtKeMocfBIPhHcSg"
  },
  "X_JQNccjJRsvd7-VNxx-ZQ": {
    "date": "5/30/2017",
    "text": "Oh Jr.  I don't know.   I'm so confused on this place.  I had a bunch of places I wanted to check out before I left and of course being part of the NASCAR demographic, you knew I was coming here.   I left a pretty good party at Flight to come here.  It was a Thursday night and there was no vibe. Actually, it seemed like the whole place was 'off'.    Bartender was great, I ordered a margarita and wasn't impressed with it.  Thank God I didn't pay for it.  I was expecting something a little more exciting.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QwIfxmyyANP305EJhQOoEg"
  },
  "yaRV-jPN_WcwgbNJ3sxN6w": {
    "date": "2/15/2018",
    "text": "Rather an underwhelming experience. Don't get me wrong the venue and overall layout was rather impressive. Visiting around lunch time I was surprised to be the ONLY one in the restaurant. The bartender was nice, I wouldn't say very interactive. Seems the rest of the staff had enough free time to converse at the bar my entire visit.  My side salad is pretty much what I would expect for $5. Drink wasn't necessarily what I would expect for a $9 value. The glass can be deceiving as the entire bottom is oddly shaped leaving you less than you think is left. Maybe stopping by later in the day may make a difference. Not a mind blowing experience, not a dumpster disaster either. 3 stars from me for now.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KckkEb-lZ--a5dPwpfHUUg"
  },
  "ERxi44Wg2yNi1Yl-BeBS1Q": {
    "date": "9/29/2018",
    "text": "We were in Charlotte for the race. Decided to walk from the Nascar HallofFame for lunch. Walked in and people were waiting to be seated with no one at the hostess stand. Waited -0 minutes no one showed up. When someone showed up, she didn't acknowledge any of the people waiting. Walked away right after that. Other employees saw the people waiting and didn't acknowledge any of the them. So we walked out to find somewhere else to eat",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-7c6VMVeVU1LYNfKq5jmKw"
  },
  "HBvzoZCAg4Kmc5m-BsWSjA": {
    "date": "9/28/2017",
    "text": "I really enjoy the experience of have having a few drinks and enjoying delicious food! Thank you Lauren Moye!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RbHfYpcEqxwBxRC_lOxivw",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RbHfYpcEqxwBxRC_lOxivw/o.jpg"
      }
    ],
    "user_id": "SLTMR-hUTpep8--3waGvLQ"
  },
  "mgVgwKg6J_og9oJCO7Dqqg": {
    "date": "3/18/2017",
    "text": "Slow service. Food didn't come out right and came out slow, and also didn't come out at all. But the food that did come Out tasted fine. The minute you walk in you're hit in the face with a very strong vanilla smell that was throughout the entire place. I likely won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ct77aBDwU0PwJyOhjPTKXQ"
  },
  "Ez6u8ygo43MwSdq3kNBYMA": {
    "date": "12/2/2016",
    "text": "Kind of yucky place; everything served on and in PLASTIC, music way too loud and just bad, creepy dumb staff.  Are you a Hooters wanna be?  Stop trying to be a restaurant and stick to being a sleezy bar attracting dirty traveling business men who get excited looking at young big boobs scarcely clad females (they don't deserve to be called women or ladies).   Awful place, will never return.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mxH9F4ZBCk_FqLL2k7kCSw"
  },
  "f38QinD3KoPOf2LcqoH7vA": {
    "date": "12/28/2014",
    "text": "I am giving this rating due to an awesome Hornet game day deal I scored on groupon recently. I paid $15 for 2 shirts and 2 entrees up to $47! So awesome considering the shirts by themselves were $12-15! We already had a parking pass for a nearby lot so we didn't bother getting the other deal with parking included.   It was super empty when we got there and got a seat super quickly. The setting was pretty casual.. fully stocked bar, big screens everywhere, and a mechanical bull that was out of service for the night. The waitress was pretty cool about redeeming our entrees. Most of the listed entrees were around $15 but we wanted to get our money's worth. She let us get a customized burger and large order of wings. I ordered a custom double black bean burger with cheddar cheese, pepper jack cheese, lettuce, tomatoes, onions, jalapenos, mushrooms, and avocados. My boyfriend ordered the 25 wings with sweet thai chili, hot red ginger, hot bbq, and garlic parmesan.   It took a while for the food to come out but we had some time to kill and picked out our shirts. My burger was the BEST black bean burger I've ever had...It had great consistency, taste and actually held together while I ate it. The wings were great too...my favorite was the sweet thai chili. No slutty servers/bartenders/girls...which was nice since I came with my boyfriend lol if that's your thing though, the college nights are where thats at apparently. When it came down to it, she didn't even print us out a bill. Pretty sweet groupon deal...wont be coming back here without one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_WEqQmOOR9hFkFVvQU9dDw",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. My loaded custom double black bean burger! Delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_WEqQmOOR9hFkFVvQU9dDw/o.jpg"
      },
      {
        "img_id": "Hxq5e-a-0shvUJ1K1R91Ww",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. 25 wings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Hxq5e-a-0shvUJ1K1R91Ww/o.jpg"
      }
    ],
    "user_id": "C5QsUsQg5I3dMdLM02SXGA"
  },
  "xz9CXdBb0puXS-iiwWDdQA": {
    "date": "10/13/2016",
    "text": "Start off by saying I gave 2 stars because there were some good things, so I'll start with the positives: As a former bartender I enjoy showing support & dine at the bar when I go out. When we walked in, it was pretty dead, but because the menu had a lot to offer, and the hostess was sweet, we decided to take a seat at the bar.  There were 3 Female bartenders & 2 Male bartenders. A bartender greeted us right away, she had long black hair & made a very good White Russian, which surprisingly so many people mess up, so we were excited for our meals. We ordered Buffalo Chix Dip, and a Mac & Cheese Flatbread, which came out in under 10 minutes.   I really do hate leaving bad reviews, but I really had too....  The female bartenders were super friendly and gorgeous, but acted extremely inappropriate and immature. It was about 7pm, and dead..... and the bartenders were the loudest there, \"twerking\" on each other, as there are couples trying to enjoy their meals.... Awkward- girl come on you're gorgeous have some class. Not to mention, as they were having fun doing that... we were patiently waiting to order some food, which is when a male bartender took our order as he saw us waiting.  I finished my White Russian before my meal even came, and the food was out in about 6 minutes after we ordered it in, but tasted rushed and awful....  The Buffalo Dip tasted like complete ONIONS. It was super super chunky and the cheese was not melted all the way.. The Mac & Cheese Flatbread looked amazing, but i picked up a slice to a soggy thin piece of dough, but the bottom was burnt.... This had been our second meal all day, so we ate it.   During the entire time of my meal, I was not offered a second drink. The girls were on the other side of the bar where it was empty, taking selfies, and twerking. FINALLY!!! The red hair chick who is extremely gorgeous by the way finally comes and leans against the bar, as I went to make eye contact with her and ask for another drink, she lets bout 3 huge BURPS! (BELCHES). I was mid meal, and disgusted... Really girl c'mon have some class people are eating... so I didn't even bother asking.  Meal is over, and then a blonde female bartender asks if I want another drink AFTER our meal is finished and plates are stacked... We politely decline, and she walks away seeing cleared dirty plates.   The male bartender comes over, and we ask for our check, he runs our cards, comes back for us to sign. As he was cleaning our place, he did not bother to ask how our meals were, which I would have politelty told him my review personally instead of writing a bad one online. Even worse, as we get up from the chair never said a word.   AWFUL SERVICE, and I would not recommend this place to anyone. Its sad you're located right in the EpiCentre, and run such a poor establishment like that. Hope to hear of improvement to get me to try it again.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "345d0M5bsjwXjFJ8ufutSw"
  },
  "LjBPI4wS8puChPC9XeAPYw": {
    "date": "11/2/2016",
    "text": "I have never eaten here, but I have enjoyed their adult beverages and dance floor on several occasions.  As a bar there are several reasons this place is a win in my book:  1) They have a sizable dance floor and as a country music fan I often quite enjoy their music. 2) Since their dance floor is already big enough they often leave the high top tables in the bar area. During a night out in the Epicentre it is great to find somewhere you can dance and take a break to sit down (without shelling out ridiculous amounts of money for a VIP table).  3) Great outdoor space with tables where you can sit and people watch the lower levels of the Epicentre. 4) They have a bull! Now that Bar Charlotte has closed I believe they are the only location in Uptown with a bull to ride. Most of the time it is free to ride. I love to mix up a night out with something different. 5) Efficiency - they've been the check in spot for several events I have attended in the city. They always make the process as quick as possible. The same for the bar staff - even though it gets overwhelmingly busy the bartenders are always able to send out drinks at a great pace.  I am not much for clubbing or going out in the city any more but when I do this is a location I like to include.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "wbvjiDpw0FoZDeqbzAIcDQ"
  },
  "VfFjReXiM5MmwvK3IoyiDA": {
    "date": "8/4/2010",
    "text": "I had the time of my life with my greatest friends during a road trip to see my WVU Mountaineers play in the 2009 Bowl Game in Charlotte. The whole venue played host to the winning Mounties and our crazy country antics! Nothing Greater after a BIG Win that Booze, Music and A Mechanical Bull to throw us around! my grls and I had an amazing time with our freinds whom a had worked so hard all season!   Next time I'm in the Charlotte area there is no doubt in my mind if I will be back at Wiskey River....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i7zNcSqgmNw48aUvh5Axlg"
  },
  "CIMJ59Hmq9bVMfDsWMWbcg": {
    "date": "3/23/2009",
    "text": "Whisky River, where the whiskey flows like molasses on a cold day.  You'd think that a place with a mechanical bull, costumed patrons and an affinity for country music would harbor a playful vibe.  But playful is not a word I'd use to describe Whisky River.  Like others on Yelp have said, drinks are distributed at a snail's pace.  And they're expensive for a bar of this class.  Enforcing my claims about the horrible vibe at Whisky River, the space surrounding the bars is a mixture between the floor of the stock market where customers thrust fists of cash at bartenders as they walk by, and a mosh pit.   I understand that when a bar is busy, you have to expect the employees to be busy.  But maybe they could use some of the $20 they charged just to walk into the place for hiring a couple more bartenders?  On the Saturday night I came here, the fire marshal could have had a field day.  It took approx. 5 minutes to weave our way from one side of the building to the other.  Literally, wall-to-wall, shoulder-to-shoulder people--and this place isn't small. And that doesn't help the moods of the patrons.  Everyone seemed aggressive and pissed.    The guy operating the mechanical bull pulled girls out of the line waiting to ride, selecting the girls with the shortest skirts and biggest boobs.  Mysteriously, the bull faced away from the operator for the vast majority of the rides, coincidentally facing the exposed posteriors of the riders to the leering eyes of the man with the joy stick.   At Whisky River, the bulls don't buck so much as they vibrate in a jiggle-inducing seizure.    And while I'm sure the following experience is a rarity, it is, in my opinion an ugly snapshot of the mood at Whisky River.   On our way out of the bar, walking down the sidewalk, someone threw a glass bottle at us from the balcony of Whisky River.  Is shattered on the handrail next to my wife.  Thankfully, it didn't hurt anyone, and the cops saw the whole thing go down and ran in to try and find the culprit.    But needless to say, I won't return to Whisky River anytime soon.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "XFoGm5ayOBBJqqSuiRuiFw"
  },
  "HpgQpfhwgnMikurjbF1Lrg": {
    "date": "12/7/2012",
    "text": "Wings wings wings: if you don't get the Thai Chili then bury your head in the sand. They have great flavors (not typical) and their ribs are as succulent as I have ever had. Great music and sexy bar staff -big thanks to Annie and Mallie!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3erdYBtvz52Ldi3RdCzIOw"
  },
  "TOPCBAcVhzQ8VJyCL0Afyw": {
    "date": "2/21/2015",
    "text": "Food was surprisingly good, and our server was friendly (not overly, which can be annoying) and prompt. 4 of 5 stars because our draft beers weren't as cold as it should have been, but still very tasty!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-JAFy5OJ1dy0ClrJYh05QQ"
  },
  "iXf6ANl7BteZJdk3dsO3Mg": {
    "date": "2/12/2012",
    "text": "Terrible service. Very unprofessional would never go back. Chose a different location in the epicentre if you want a good time and to be treated well.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zZhZL5GnM5M2wnGhLO8VAg"
  },
  "qjYsGke0ex9q8Na4PNZXpA": {
    "date": "12/29/2008",
    "text": "I gave Pat White a low five here after his 332 yard performance against the Heels. I tried buying him some drinks but he disappeared into VIP section.  I love West Virginia Mountaineers Football (I mean, seriously, I live for it). Pat White is the greatest player in the history of WVU football.  This could have been the worst place I've ever been, I'd still give it 5 stars.  If you're visiting from other cities, I'll give the analogy (to decide if you want to go). If you've been to Chicago, this is like John Barleycorn Wrigleyville, if you're from DC, this is like the Clarendon Ballroom or Tom Tom's. Meaning, don't go here if you're not completely inebriated.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "DFsjkbr__OpnB5a4ryrIUg"
  },
  "ul7sG4k4QJ9sZe_0H9PXqw": {
    "date": "11/10/2012",
    "text": "Went on a Thurs night when it was pretty quiet. The mechanical bull was on but it wasn't put to good use. Average sports bar. Average priced mixed drinks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NW-2LQYEUoJmngYfVKt9RQ"
  },
  "z5cU3FhLMd6LHHuxBkMQdA": {
    "date": "12/8/2008",
    "text": "I'm giving this bar/club a 2-star bc of the intense amount of country music that was played in the first part of the night. True, I am not a Charlotte resident and I was there with a group of friends, just visiting for the weekend and might have made a mistake in going to a country bar. But nonetheless, I thought at least they'd play a mix of country and contemporary. Sadly, the contemporary dance music did not kick in until the dance floor was too packed to dance. Drinks are reasonable ($3.50 for a bottle of Miller Lite, $6 for mixed drinks) and there is a mechanical bull in the back near the exit, which makes for good people-watching.  On the Sat. night we visited, there was some kind of fire drill which took out the whole place. One minute we were drinking and having fun, the next all the lights went on and we were ushered out into the bar for no reason. Or, at least not a reason my group could figure out.   The group of bars in the area where Whisky River is located seem like fun, but the plaza is still under construction and it was a little hard to tell where things were located. We popped into Blackfinn too but it was v. v. crowded. Whisky River is prob. more geared towards the \"just out of college, just want to drink and dance\" crowd, and if that's your scene you'll enjoy it. If it's not, go somewhere else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZNfXFSzPLlWFrFWyh9BA9g"
  },
  "Bv14WxKGryjMyBMxcwoOCQ": {
    "date": "10/27/2014",
    "text": "As mentioned earlier it was quite empty.  I asked it the place was opened.  The food was about the same as most bars.  What I really wanted to do was ride the bull.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "deVz7CbX6fUp12x690FQNw"
  },
  "MgVcbl7ZRYjfMelpl7DCeg": {
    "date": "3/29/2009",
    "text": "I can't give this place a lower rating, because my co-workers absolutely loved the \"atmosphere\" (we stood right behind the two scantily clad women selling beer out of a tub...and women were basically falling all over them since they look good and dress well).  However, I can't give it a higher rating, since a) they charge a cover, even on Tuesday nights.  Ugh.  b) it's a trashy, crowded club not unlike the ones I loved as a college freshman, which is not my scene anymore...  Still, I had no problem getting served quickly by the bartenders (although I should note they were all guys), and I thought the crowd was more polite than I've experienced in similar settings.  Plus it was a 50-foot stumble from the door of our hotel.  So take the advice of another reviewer and go...as long as you are already in your happy place.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "QG13XBbgHWydzThRBGJtyw"
  },
  "SkgX4HWCHGXyl4fFBrGSZg": {
    "date": "8/11/2013",
    "text": "This place is awful on multiple levels. The music is ear splittingly loud. The beer selection is extremely limited. The bartenders have their butts hanging out of their short shorts. yes, the staff is attractive so this might be a plus for a straight male but as a woman, it made me pretty uncomfortable. I dont expect to see butts at a place that isnt a strip club. I need to be drunk to be at a place like this but since they dont have any good beer, getting drunk wasnt possible. perhaps this place would be fun if i were a liquor drinker. They also have a very bizarre dress code. Not allowing super baggy pants, I get, but what the hell is wrong with white t shirts and flat brimmed caps? You also have to pay a seven dollar cover to get in. There are plenty of much better bars in Charlotte that dont charge covers so its just not worth it. Only reason I paid and went in was because I was attending a celebration for a friend",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "_IeoNQ6gvEJeogsPWa-d8A"
  },
  "NuRqCoQYI_tu_S54-nfGyw": {
    "date": "7/11/2009",
    "text": "Hands down the WORST night club (or whatever you want to call it) that I have been to. I actually went way back in April, but didn't remember that I wanted to review it until recently.  Tank Tops, flip flops and \"Don't Stop Believing\" is not my idea of a good time! Don't make it to Charlotte that often but Will NEVER go back to this place and would NEVER recommend it to anyone else!",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dawTXCW4dhi_5l5ItMm8oA"
  },
  "9UyojOAfff_kC4j92Xz8IA": {
    "date": "12/10/2014",
    "text": "Solo on a business trip to Charlotte. Nice little sports bar. Two hd big screens and lots of 40 inch TVs all over. Service the night I was here was excellent. Friendly servers, decent beer on tap. The food was average. Wings were pretty decent, but the burger did not come out the way I asked for it and it was sub par. I would go back to have a drink, but probably not to eat.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XBJYgnO4ru1L3HJfj_AZ2A"
  },
  "qqbY01mG5tfpzBpEj5DDxQ": {
    "date": "11/26/2012",
    "text": "If you want a night out of drinking and dancing, that's exactly what you're going to get..  I've been here several times and have not been disappointed.  The bartenders are on their game.  I've never had to wait more than 2 minutes and that's when the place was crowded.  Always a party there",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D9TkKsC2wKAApMbyCMj1Lg"
  },
  "RfKgPTy99vAwZFg9Vt9pPg": {
    "date": "6/27/2010",
    "text": "I enjoyed this little place and It was my second stop for the night, the bar tender (mark) was really great and very helpful. The atmosphere during the fall early evening is great and it was fun to hang out with the football crowd. The mechanical bull wasn't running but my boyfriend and I were told we should come back for bull riding night.  A tad over priced and there was no cover charge when I went, however that could be seasonal.   Good early night stop.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FiTKEN84lkTQhuHMeERpZQ"
  },
  "APPpImboqusNr4easPuEgQ": {
    "date": "9/8/2008",
    "text": "At first thought, you're going to think a bar owned by Little E (Dale Jr), is a country music bar with a laid back atmosphere. But this is the complete opposite of that. In my few times here, I have yet to hear a country song & there is nothing laid back about this bar.  The dance floor is huge & always crowded. The key is making it onto the stage area to the 2nd dance floor that's a little less crowded. The music is usually hip-hop & pop, & usually keeps the tempo upbeat. For me, it's a great place for someone that likes to dance to rap & hip-hop. But if you don't prefer the dance scene, you can hang out in the bull riding area to catch the willing getting tossed around.   There are 2 main bars, along with beer tubs throughout. But if you have a card, expect to wait a good while at either bar to get a beer. And beer isn't cheap, so along with the $7 cover, expect to spend a good chunk of change here.   So don't judge Whiskey River by it's name and/or owner, because you will be completely fooled by spending the night there. Expect loud music, lots of dancing, expensive beer, & a great time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kjYbPkrbgPMVUAjungJ4Aw"
  },
  "11LdLN38eOYo33uFat2ZtA": {
    "date": "12/27/2012",
    "text": "Atmosphere was good, but I waited for 15 minutes and never got attended to at the bar. That's unacceptable. If in Charlotte, visit somewhere else if you want some drinks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RMl7TmtaFlGIe0pxy0EE1w"
  },
  "Yu1mV8Vu_zHsrcJYmqwdtw": {
    "date": "6/15/2014",
    "text": "Nice atmosphere. Very clean.  Good food.  Really poor service.  We saw several people get up and leave because they could not get service.  It was a Sunday afternoon so not really very crowded.  They had plenty of waitresses but they all seemed too busy on their cell phones or putting on their make up to help the customers.  Very disappointed. Will not be back or recommend to anyone",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CBP9ZupZyahlaptId3ZH5A"
  },
  "vbkw9SVRPgyrQtGkgYEoeQ": {
    "date": "3/6/2011",
    "text": "Looking for a sub-25 year old party in the Epicentre nightly...here you go! Place is A-OK. You've got a few bars, a stage area for bands and a riding bull for the drunks to make idiots of themselves. You'll find some cheap specials from time to time, but also a cover charge most nights. A little pretentious in my opinion, but that's Epicentre for you. They play good music and when PBR is $1, dropping by fr a few is a must. Staff is always friendly too.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "c8cur4lMkQsHoUEqm-qwxg"
  },
  "UQSaRGrfvFfJAHOT-Fc9Jw": {
    "date": "4/26/2012",
    "text": "No cover, live band, and plenty of room at the bar.  Yay me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bTo5nXiV9suExHPa0m0rRQ"
  },
  "afyT1mIFbo1I3-57R9bdag": {
    "date": "1/1/2016",
    "text": "We spent over $100 and were still charged a cover charge for a DJ when we came back the same night.  Highly disappointed. :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nn_Hxg5FWAsM_utvkExHWA"
  },
  "_d7oykm3XEYV0QHZLrRnBw": {
    "date": "12/12/2012",
    "text": "So my boyfriend and I were trying to find a place to grab drinks late on a Sunday so when we looked at the website they said they were open until midnight and last call was around that time. We showed up at 11 and were told by the guy at the door that last call was happening so grab a drink quick but in less than a minute the bartender told us last call had passed and we couldn't get a drink.  NEVER GOING HERE AGAIN! If they don;t serve alcohol until closing then say so on the website or at the door. The place had a good crowd therefore I didn't understand why last call was so early. Also the staff was rude. Don't go here!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "beh2zi3UfykALTE9myYIsg"
  },
  "l73Lp89yOpz7ZbEJoR-eBg": {
    "date": "10/26/2014",
    "text": "Worst half-assed imitation of a poorly run buffalo wild wings I've ever seen. Terrible service and idiot hostess made sure no return trips will ever happen. Pathetic.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9cnESYJUoh20zUnGlRNT0w"
  },
  "mQisH-cVt-4iOVCnAB-VBQ": {
    "date": "8/12/2010",
    "text": "Ok.. You ready for this... Please read the whole review and dont stop before the ending... hahaha.  We went to W.R. on the Snooki (jersey shore) look alike contest night.  ON ACCIDENT!! But it ended up being hilarious.  Girls came dressed up like her and there was a $300 purse to the winner.. Then Snooki, aka the Jersey whale, showed up out of nowhere sipping on a huge purple drink.. My eyes couldnt believe it..   Other than that, the place was so lively and had a huge bar.  Not to mention a bull that you could ride in the back for free.. That is something special.  All the bartenders are beautiful and it is a typical college esque bar.  Dancing and lots of drinking.. I would highly suggest trying to go for bottle service though.. That is the way to do it.   -Ian M",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "KsK2VrCDys9hzpT5JMkkNw"
  },
  "kTitPKbn3UxiCjLb2NEAcA": {
    "date": "1/20/2014",
    "text": "I was pretty disappointed with Whisky River - we were expecting an awesome bar with tons of whisky mixed drinks... they only had a small selection of whisky.  It was more like flavored vodka river - We didn't stay to eat after waiting at the bar for our table and finding out that it was more commercialized then specialized.  I'm sure some people will really like this place, but its just like your average Chilies restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BWzuE65PVuCiEf9Zmna2yg"
  },
  "snisuoyRMGlkhR5TokvAIg": {
    "date": "12/3/2012",
    "text": "I almost didn't want to review Whisky River, but it popped up in the cue so I figured why not?  I've been here a few times for friends birthday parties, their choice, not mine, I can assure you. This place is what it claims to be, a place for people to get hammered during bachelorette parties and birthdays, and dubious cats to oggle scantily clad bartenders and waitstaff.  That pretty much sums it up. Throw in a mechanical bull-ride, and some cheesy Top-40 tunes and you've got the picture. Just not my kind of place, but it serves it's purpose I suppose...",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FSr1CdDnHilQ2forw4buLw"
  },
  "3JoM_kWUcx9XPvR9YXbvyQ": {
    "date": "8/28/2013",
    "text": "Monday after work, this place is dead.  Maybe every place uptown is as well.  But, $20 will buy a glass of house wine in a dirty glass, a domestic bottled beer and an order of fried pickle chips. ---- they aren't chips after all, but spears..... Not impressed!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V23Dtman8oXpyLFqVGmdTg"
  },
  "y9VoR6Me3qBteJo9lrJOwA": {
    "date": "12/23/2012",
    "text": "- \"Cocktails\" have so little alcohol my bartender friend started laughing when he saw   them and told us we got hustled. My $8 (pre-tip) LIT tasted and looked like it was all    sweet n' sour with an eyedropper of tequila. The Vodka Cranberry (difficult, right?)  was even more pathetic.   - My friend's shot of tequila had ice crystals in it, which means they had watered it down.   - I don't like to pay covers to get into bars, but if I do I expect to feel like I got  something other than the privilege of paying it.   Positives:  - The shot girl was dressed like a stripper (just short of naked)  - There was the usual drunken circus outside when all of the bars let out  - There is a 5 Guys a few doors down (and a Rite Aid if you want to get some beer    for the after party)  - The opportunity to pay for parking, then cover, then weak full priced drinks and $4  beers  - They help you avoid hangovers by watering down their liquor",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e8JH23NhsAbdmfoC3wyRFw"
  },
  "7uDt_mXdovq0fZGWRpwc8w": {
    "date": "12/28/2014",
    "text": "Seems like a tourist trap and we fell for it. Not many people here for football Sunday. The few who are here are loud and rowdy. Servers are young and inattentive (slouching in groups behind the bar). However, I enjoyed our bartender, a blonde who was a sweetheart. As for the food, fried pickles were under fried, but jalapeno burger was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TMoF4CkHd5F9g5WFTWK1IQ"
  },
  "uGFm7hOVCEL5wP_f07tsoQ": {
    "date": "12/1/2013",
    "text": "-1 star.  Came with a group after the panthers game and wow what a disappointment !! No service or hostess! Finally got to the bar and we're not asked what type of vodka? Just served house and we wanted premium . Bathrooms were horrible . No toilet paper and stalls were filthy.  You need some serious help.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pei7pVC9-LX-q0bHgHpfzw"
  },
  "UQtilp2wo5Hzs7psqGQJig": {
    "date": "10/20/2010",
    "text": "The waitresses and dancers are quite good looking.  The crowd is diverse (age, some race), with a mix of music that goes into the 80s/90s/00s.    The dance floor gets crowded.  I mean, like really really crowded.  Nice venue though.  There's bull riding in an area.  Please, no guys (not a rule, but who wants to see a dude on a bull in a bar?).  Girls, sure!  =]",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "B5mpfVCviyUl9Bsdef5jUQ"
  },
  "R4Mvm_rQ94U2aAmlKC2GhQ": {
    "date": "3/21/2011",
    "text": "Ok.....mixed reviews.  Likes, good drinks, bikini contests, fun atmosphere.  Dislikes:  one tiny pisser in the back corner, the big tranny who they let dance on a box but ask me to get down when I do it.  Honestly she was bigger than me and I'm 300+.  If you catch it right you could have a decent time.  Bad timing though...it'll suck ass.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3YDaORKofxCLGiEFdNFnUQ"
  },
  "T6G-DAJM4UAZUdpqjteb0w": {
    "date": "5/20/2013",
    "text": "Was in town for the NASCAR race and stopped in. We had a blast! Fun music, nice atmosphere and friendly bartenders. Definitely avoid the shots getting sold though by girls walking around the bar.?They were watered down, weak and terrible!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8mZGy3uSA-GigFBu_ny0Rw"
  },
  "1tOgZE5ou6oRW-VIxtu99g": {
    "date": "1/31/2015",
    "text": "The food here is somewhat greasy and not that good. However, you come here not for the food but for the big screen TV's. It's not that great overall.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uBHRgjD2xy77JCVm7CwmOA"
  },
  "xQNfyH_RoyBEqAWTXhBUGQ": {
    "date": "7/2/2015",
    "text": "We come here often and the food is great! For some reason they won't allow us to sit outside and eat which is weird, especially when they are slow.  We visited today and they told us we could order at the bar and sit outside. The bartender, Kelly, took our order and even graciously offered to bring our food outside for us. It was extremely kind of her. It was a slow afternoon and we witnessed other servers actually sitting outside because they had nothing to do. They should have had that server serve us outside rather than telling us to go to the bar. Food and atmosphere is great, just could improve the service aspect.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V4M3lMoKUvW_gU_3BT1_5A"
  },
  "0xqJY3P-9HnDitVZZnp6Gg": {
    "date": "11/11/2012",
    "text": "This place is a cluster f$@k and Dale Jr should be ashamed. Staff had no clue of what they had, there's no drink menu and no one working could actually tell you what they even had in the place. Ridiculous!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V4c1HV0Ap3B6QIErn-s91g"
  },
  "7sKJDW1_IKCafjdWAb6pEA": {
    "date": "10/26/2014",
    "text": "The atmosphere was fun for football but the food was poor. Cold nachos and they are supposed to be that way? I won't be back and you should think twice if you are hungry.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Epi2FMMzQhiuL82K1G5EkA"
  },
  "Q051WtoNk6qUp28IQq_rhA": {
    "date": "9/2/2011",
    "text": "I give it 4 out of 5 for the entertainment and diversity of the Party-Goers. This place rocks in so many ways, Junior has an asset here for sure. This definitely not a place for Site-See'ers...you need to come single and prepared to mingle.   They have mechanical bull riding, two bars, couple of drink bins, and a large dance floor that shakes under your feet from so many people. PLEASE GET A STRUCTURAL ENGINEER TO LOOK OVER THE FLOOR!  You definitely will get pulled into the partying if you come.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2iVkwlxAM4jjsDa7wP9NA"
  },
  "V9Tm8dWMXzwwk_SgwJ24HQ": {
    "date": "8/11/2015",
    "text": "The staff was awesome, but the food definitely should have been better for the prices. Our salmon was overcooked and my long island came out tasting like a margarita. I expected better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N03BWjYmGXkpJ7EtlMojaA"
  },
  "pMk44ZmLlmo6QDCCC8_jNw": {
    "date": "5/13/2013",
    "text": "I admit I have not eaten here - however my brother in law is going to be visiting Charlotte for his 60th birthday and a fabulous gift for him would be a gift certificate to his idol, Dale Earnhardt's, restaurant.  So I email them for instructions on how to purchase a gift certificate.  No reply for 4 days.  OK, next I call mid afternoon so there was no lunch or dinner rush.  Whoever answered the phone didn't have a clue.  She asked two managers and they both said I can't purchase a gift certificate over the phone.  Pardon??   No, she says, I will have to come in personally and buy it.  Which is an issue as I live a very long way away.  What restaurant doesn't take a credit card over the phone to purchase a gift certificate??  Really?  Either they don't quite have it together or their staff doesn't, I'm afraid.  Super disappointed.  They may have good food, but we will never know.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s7KfqX_Yxjs3_bLZGa8Ptg"
  },
  "MyKfdDqPVud_9k4qy5Oopg": {
    "date": "7/7/2018",
    "text": "One of my favorite local hangout when in Charlotte, NC visiting parents or on business trip. Place is clean, trendy, always full of fun friendly crowd. Food and full bar and awesome service! Definately worth the visit and will find me there when in Charlotte after a game!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HFkRytLt_Sa2EzfEiU09uQ",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. Great bar and awesome bartender (Cristy) while visiting Charlotte,  NC.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HFkRytLt_Sa2EzfEiU09uQ/o.jpg"
      }
    ],
    "user_id": "J9wSLzoP33ZU_k-PAWrlLg"
  },
  "h2-r9mbaNd0ecSk1eTYm2w": {
    "date": "6/23/2018",
    "text": "The food ok, service was good place felt like you were in a club during the day with the lights on. The artichoke dip was really good the nachos were just a sad lump of chips with some cheese on top about 7 shreds of lettuce and maybe 4 tomatoes. The location is perfect for a pre-concert bite but the food and atmosphere in no  night club hours needs some work.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AKQ1lRXsD46frjs-esoP6w",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AKQ1lRXsD46frjs-esoP6w/o.jpg"
      }
    ],
    "user_id": "lMjqSHFDrNAj2ZOGknQHnw"
  },
  "uITBwzgT8hzu95wVFT2yvA": {
    "date": "5/7/2019",
    "text": "Great wings and even better service from Kate our bartender!  I would definitely come here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Yw4K8Qy4-QEwJ5wJ12Z8g"
  },
  "ewrla9VnWm9i7nwihzwwPw": {
    "date": "7/9/2018",
    "text": "We had great service and drinks. Food was average bar food but not bad at all. Overall a fun place to pregame or just hang out with friends. Located at Epicenter which is pretty fun. Would definitely go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H3yrY9JcrCk5bwK3z5EzCw",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/H3yrY9JcrCk5bwK3z5EzCw/o.jpg"
      },
      {
        "img_id": "t8LqcYtvMZHTv37rLIxp5Q",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t8LqcYtvMZHTv37rLIxp5Q/o.jpg"
      }
    ],
    "user_id": "dYTzj-bgNn0jNiJ_XT6zuA"
  },
  "U43oOnlhmeLU-YQM6zRa5Q": {
    "date": "12/25/2018",
    "text": "Came here with my wife and a friend for lunch so it wasn't very busy. We were getting weird looks from the hostesses as soon as we walked in. Kaylah, our waitress was very nice and did a very good job. I didn't expect to be stared at by the hostesses the entire time we were there. The food was alright for the price. Pulled pork sandwich with mac n cheese. Nothing too special about it. My wife had the wings and they were alright. Not bland, it was well seasoned. Meanwhile the hostesses still staring and whispering to each other. I'll come back again for the wings most likely because my wife enjoyed them.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "THnlJARDvXGWI62eyIn8pA"
  },
  "sZ26oiTF_2VO2dqj0Qfgvg": {
    "date": "12/1/2018",
    "text": "In town for ACC championship game. Waited in the bar for 2.5 hours and was told when we came in they could not take reservations for over 4 people. We reserved a table for 4 to speed up the process with two people standing.  Numerous tables were seated with 6+ people with less wait time less than we were quoted for only 4 people, how can that be?Establishment needs more staff. Very poor encounter for out of town visitors. Go across the way to World of Beer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eYTgk3T02-GvpcioL_AnMg"
  },
  "ynYmIBTx2PlE4V3VhCczng": {
    "date": "4/26/2019",
    "text": "This place absolutely sucks!!!!!! The waitress was on her second week there and obviously overwhelmed bc she was the only one waiting tables. 9 people behind the bar serving drinks. Food was ok when it finally came drinks took forever even with all those people behind the bar and were weak and not worth the money. Absolutely will never step foot back in Whiskey River ever again!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SZzJ-l44v8hk3O_-tGrSUg"
  },
  "IXaz7WZg6jns5qUbh-qsXQ": {
    "date": "4/26/2019",
    "text": "Had a $60 gift card to Whisky River so I brought my friends in one night with me, we ordered one bucket of beers and decided we wanted to go somewhere else. Upon opening the tab, I gave the gift card to the bartender who said she will hold on to it until we close the tab. When we were all finished, I went to close the tab and the waiter claims \"she set the gift card down and someone must've taken it\". We had to pay. Considering this was HER fault, we should've been comped and given a new gift card. Will never go back again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ukxwG85d8iNtvV74jxG6bA"
  },
  "Ld2kPP7yi2njvW0rjly66w": {
    "date": "12/19/2018",
    "text": "We went before a concert. Had a drink and nachos.  I would say they were ballpark worthy at best. The drinks were good, but I'm not really sure there was any alcohol on them.  They were packed, but the service was definitely less than stellar.  Waiting for plates was something that shouldn't happen.  With all the other options so close by, we won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yViJyrI0Wa9RGFP6vVRP6w"
  },
  "aV_K8ChmYeqJhwpAk1zwMg": {
    "date": "6/15/2018",
    "text": "Great service from *heather*  We fly every weekend and stop by whisky river each time for the months since they opened at RDU. Heather is the first server who was pleasant and welcoming. She understands flight times and gets our order to us. Kudos!!! Will ask for her each visit !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sCOZtUBVG9Cs2AFFltTCog"
  },
  "WlCyIcS-5I8deSAis5ui3A": {
    "date": "12/11/2018",
    "text": "The wings are awesome! Big and meaty. The atmosphere is good and not much of a wait. Highly recommend",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZG23BTF5ki_vN81ej843fA"
  },
  "wyhB2owESTaEuiWQy1PhOg": {
    "date": "3/26/2019",
    "text": "Probably the worst burger of any sports bar ever.   For a place the be that empty right before an NbA game across the street, we should have known it would be bad.  Our server was very nice But service was slow.   Dishes sat in front of us until we left.  The guy who \"ran food\" couldn't have been any less interested. Overall an embarrassing place to take customers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3EkdOVagp6xQH5Yho8CW2A"
  },
  "MRPCm_BYEHl2T9oNZYnCbQ": {
    "date": "1/20/2018",
    "text": "Pros: Fun atmosphere, great for people watching, mechanical bull is unique in my experience  Cons: I had the chicken tenders and fries and while the tenders were alright, the fries were pretty terrible. I've had fries that didn't taste good before, but these were the first fries I've experienced that actually tasted bad. After dinner, I felt sick and had to drink lots of water to get the taste out of my mouth. Would not go again!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oAFF_A02Ws0mwH-lkbzyMQ"
  },
  "b_KRL1VkF--IhZCV9pWgVA": {
    "date": "9/8/2018",
    "text": "This place has a great variety of meals for everyone. The shrimp volcano wrap was insanely great. This is a great group spot for a picky group. All 6 of us enjoyed the meal. From pastas to burgers to seafood. We all got what we wanted.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "crtKfRLezQLfmWpSYN8XuQ"
  },
  "WoFULsgUMf3e1-0Q1euzvw": {
    "date": "1/25/2016",
    "text": "First off, I hate bar/grills. There's not a bar/grill in existence that can trill me. Just wanted to preface my review with that little note.  Because I dislike these establishments I should've known better when my travel companions suggested Whiskey River to remedy our starvation mode. But you know the saying, \"Desperate times call for desperate measures.\" Against my better judgement I went along and the service was horrific!   Sure it was a game night so the place was packed but they were also properly staffed with servers, bartenders and I'd think cooks. Our server took FOREVER to come take our order, FOREVER to bring drinks & silverware, FOREVER, to get the food out to us, NEVER came back to see how things were, NEVER returned for drink refills, NEVER... Never mind you get the point.   Single star for location, Epicentre is pretty happening. If you like loud, drunkard behavior, slow service, beer on tap, a mechanical bull and large TV's for game-watching this is your place.   ~Christy, not so much.",
    "rating": 1,
    "rated": {
      "funny": 44,
      "useful": 58,
      "cool": 48
    },
    "photos": [
      {
        "img_id": "wDt-WU0hZ-EcGuHOYHWJoQ",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wDt-WU0hZ-EcGuHOYHWJoQ/o.jpg"
      },
      {
        "img_id": "CSLhs5uCeHIZtEuCZvGNLQ",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CSLhs5uCeHIZtEuCZvGNLQ/o.jpg"
      },
      {
        "img_id": "iXHpsR50VfWr6jlY4n7FpA",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iXHpsR50VfWr6jlY4n7FpA/o.jpg"
      }
    ],
    "user_id": "lMY8NBPyzlPbbu-KBYfD9A"
  },
  "ULXjOgh4UHVfoavdKvbR-w": {
    "date": "2/27/2017",
    "text": "I thought this was a pretty decent place.   I came to watch part of the super bowl here earlier this month, and all the servers were pretty friendly. Nothing special or out of the ordinary, but there wasn't anything bad about my experience here.   They have quite a few screens in case you want to come here and watch football or basketball, so you'll be covered on that front. The drink prices also aren't to bad, but being from NY, maybe I'm used to paying more for alcohol in the first place- not sure if North Carolinians are used to paying different prices.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "lgB93Q5dePzMBWXu_GVHEA"
  },
  "yRx2chroF5Zlb-S98mQWEA": {
    "date": "3/17/2019",
    "text": "Be prepared for the slowest service ever!  We recently traveled out of state and while giggling places near us this place popped up and seemed interesting since it's a Dale thing so we tried it. Now I will take into consideration that there was a concert that night and this place was super packed. We waited an hour for a table. Once seated our waitress came and took our drink order and when she brought them back we gave her our food order. And that's the last we saw of her. Other people brought out our apps and main meal. I ordered the smothered chicken which was so over cooked I couldn't even cut it with a knife. My friends chicken sandwich...she couldn't even bite into it. And my poor son who ordered ribs which are suppose to fall off of the bone  he tried cutting the meat off. Didn't work. Tried biting it off. That didn't work. Needless to say his ribs went untouched because the meat was literally glued To the bone! It was the worst almost $100 I have ever spent on food! Not to mention with our waitress never bothering to at least check on us once we sat there for a good 45-60 minutes trying to flag someone down so that we could get our check. The service is absolutely terrible. I said I understand that were packed but come on you know you have a table at least make sure everything is ok.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wS0J0FPiMkJQxk5gMxWCcA"
  },
  "FBCgNNp8YCm_v1LqZ4nRSA": {
    "date": "9/24/2018",
    "text": "The food was decent and the wings had great flavor but they were the smallest wings I've ever had out to eat. For over a dollar a wing it's genuinely unacceptable for their size. Also, no gameday specials was a little disappointing. That aside the flavor was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aG0EcPBKEx1iCflViXJelQ"
  },
  "KEG44-Y2ewyikjQkSZLBzg": {
    "date": "9/9/2018",
    "text": "Wayyy too many people crowded into this place. There was no service it was basically arguing and fighting for a beer. It shouldn't have been allowed to operate in such a manner. Never again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "suqA3xx5LxghYLDj1n4VgQ"
  },
  "g42gbochFcuWvr2k2EUxcw": {
    "date": "8/29/2018",
    "text": "My group stopped here as we were in between flights. The burger I got was ok. I thought the description made burger I had sound better than it was. Overall not a bad place",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MJuEWFnw6boGScQBdJGFrg"
  },
  "UtVkzfWIArqXhggXzonasA": {
    "date": "9/10/2008",
    "text": "I was surprised and relieved to find that Whisky River is not a shrine to Dale Earnhardt Jr. Still, it's a haven for his adoring middle-aged fans and very much a tourist trap. There is even a stand selling Whisky River T-shirts, hats and other merchandise.   If you're not into NASCAR, you definitely shouldn't go during a race, which dominates all 20 TVs in the bar.   Whisky River is a private club, so if you're going for the first time, you'll have to go through the annoying process of waiting in line and filling out a membership form. You'll also have to pay a cover to get in.  Unlike other EpiCentre hotspots, Whisky River's crowd isn't very dressed up. Most women wear jeans and halter tops; most guys wear jeans, collared shirts and baseball caps.    With three large bars and several beer tubs, there are plenty of spots to get a drink in the smoky, packed bar. And I'll admit that watching people (mostly women) tackle the mechanical bull can be entertaining.   A big plus is that it's right off the light rail.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "y68HUTTO6NGnpKl2yimtTQ",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y68HUTTO6NGnpKl2yimtTQ/o.jpg"
      }
    ],
    "user_id": "aYF3NR0KpOkPfMbWIrFzmg"
  },
  "BS5yu0NBhHi_L7IQAErBmg": {
    "date": "7/19/2016",
    "text": "If you like $12 well mixed drinks and $15 top shelf single drinks then this is the place for you! All pre-frozen bar food from your local US Foods or Sysco. Crowd is scary after nightfall. You've been warned.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PYjnM76mHHCACSiSHbs09w"
  },
  "g2RHxe8HJbdtbLUBUpF7Wg": {
    "date": "6/14/2011",
    "text": "Don't remember all very well but I know it's more of a young relaxed crowd that frequent this club. Whisky River comes with a country vibe to it. I first came in here back in '08 or '09 with some friends in which I got us a table and had a fun time dancing and watching drunk chicks get on some mechanical bull they have in there yeah fun time.  Now, move forward to 2011. After hanging out at Kazba which turned out to be a let down, I tried to get into this club with friends from NC. Got to the door and my friends were fine to go in but not me. The guy at the entrance didn't believe my Nevada ID was real. Informed him I was visiting from LV. He asked me what's the address on it and before I could tell him, he said no, you're not getting in with this... haha dude cracked me up!  The trip to charlotte ended up being weird. I was in the twilight zone, what a bummer.",
    "rating": 2,
    "rated": {
      "funny": 6,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "SvkOt67Q4pOw2oviK_13og"
  },
  "c4bxC-agqw5vScIBPVg7uw": {
    "date": "8/1/2014",
    "text": "We visited Whiskey River on a Saturday. It served as the after party spot for a friends birthday party that had taken place a few hours earlier. We hung out in the VIP section because of the group of people that were with us. The waitress was nice. She brought a bottle and poured everyone's drinks up. The DJ was good. He played a nice variety of music. Whiskey River has a large space. Most people where near the bar or on the dance floor. Laid back atmosphere. It's located in the Epicenter, which is an attractive space for nightlife. It's located close to the Charlotte Hornets/Time Warner arena, so folks flock to the area after concerts and games. I'd go back. We had a blast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5OogBR0kD0YR6v6Y0PI4eg"
  },
  "VFA8UbiTtnxJBZqMBLgWLQ": {
    "date": "8/25/2011",
    "text": "I think my review is based mainly on the fact that I'm over the age limit to be in here.  We came about a month ago with some friends to go dancing.  We got all decked out, had too many drinks at home and off we went.  The place is so crowded you can't move on the dance floor at all.  My husband is almost 6'5\" and kept getting ran into by teeny tiny girls who had no regard for their surroundings or people around them.  After about an hour of this we headed out to another bar with less people and more room.  Bottom line - if you are under 25, or out on the town for a bachelorette party this is the place to be...ride the mechanical bull, dance in uncomfortable confines and shoes....regret it in the morning.  If not, head somewhere else!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5k1P5jLOBdjAKsxmE5uwmA"
  },
  "wn3YSYXVfV-LqZRlJ2B5lw": {
    "date": "3/24/2014",
    "text": "Went to WR for a couple of drinks before the Bobcats game, I forgot my card there and picked it up on the way out after the game.  Before I got home, I had an email from American Express saying that someone had cloned my card and used it in my hometown 500 miles away and spent almost $2200!!  This is in less than 3 hours.  Not sure what they are doing there but I will definitely not be using my credit card at this bar ever again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OaWc1c9uLCr50Du-K0-LTQ"
  },
  "JhdZNzoD3N1C75YcHLUP4w": {
    "date": "10/30/2014",
    "text": "Had a VIP evening here for night 1 of my Brother in-law's bachelor weekend.  The service was good and there a was a real party atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1wukwqNH4iz2IHfT51-oyg"
  },
  "7iDSXtX_Z8YMK6Nh_9uBrQ": {
    "date": "2/15/2012",
    "text": "I feel like there are three things important for a club: music, crowd, and drinks.   Whiskey plays decent music. Some days better than the others depending on the DJ. The crowd is alright too. I feel like if you go with a good group of friends, even the worst club can be super fun. The drinks are not bad, decently priced.   It's pretty casual and it's a big space right in the middle of the EpiCenter.   My advice: get a fun group of friends and you are all set!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1b1YnxVeuSf0KM1as9YLUg"
  },
  "N6vzCrVtJNk67Q3WLY1Cpg": {
    "date": "3/29/2016",
    "text": "Went to whisnky rive for St pangricks bare crawl! Wow all the people! even got dizzy a little from all the dancing wow! Next day watched Phoenix NASCAR race andd Dale JR almost won past harvike! Dame cation at the end screwed JR man!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B9wtH9CLdpAuIopkpaLGWw"
  },
  "LVDw4vIcZ6E22IjtVtp1tg": {
    "date": "9/1/2014",
    "text": "A sports bar the Epicenter. Drinks are reasonably priced, at least from the East Coast's perspective..! There's a mechanical bull that was loads of fun. The dance floor opens up later in the evening as well.   There is a cover.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dMBzfEZVid6__5D4D5IgBw"
  },
  "oKIhuSPt5Vd8Oq5cnJP66g": {
    "date": "8/5/2014",
    "text": "We went there for a quick bite to eat and to cross it off our list on the Bar Crawl we were doing for the Champions cup. The place was very large and pretty crowded but a great atmosphere. They had big projector screens showing the match and they even have a mechanical bull. We got the chicken tenders as an app and they were okay. They were thinner and flatter then the usual tenders I am used to but they were pretty good still. They had a $5 guiness beer special going on also. I would go back if I am in town again to watch some sports games!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQHRukX1mHBbUKWg1bKUpA"
  },
  "BVVzyhNV2lefASnwoz6iuw": {
    "date": "12/1/2011",
    "text": "This place is fun, but really more of a college aged crowd.  And to counter Melissa......ALL WOMEN SHOULD GET ON THE BULL.....more than once would be best *evil grin*.  It should be a stop off among many in a night of partying......if you approach this place that way you should have a good time!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "DXh8yxwZCg5Ckj5kmDvKXw"
  },
  "JClcyC0mPwF8fxj6Jtvfog": {
    "date": "4/3/2011",
    "text": "Don't waste your time. Overpriced, boring, and full of drunk grenades. Customer service is awful.   My buddy and I decided we would go since they were offering free cover before 11pm. We arrived 10 minutes after 11, and although our whole party had arrived, they still charged 7 to walk through the door. We decided we would just go to Mez or Kazbah so went to leave. A friend came out and begged us to stay, so we decided to bite the bullet and pay cover (the last time we had went it sucked so we were apprehensive).  We went to the line, and the manager said he wasn't letting people in for a minute. We had already been carded 5 minutes before but he decided to make us wait and be ID'ed again. 15 minutes goes by as they are checking in more and more grenades from the VIP line, and then we are finally let in.   Within 5 minutes my friend and I had dropped over $30 on 2 drinks and cover. The wait at the bar was another 10 minutes. My 3 goals entering the bar was beer, shot, bathroom. I completed my mission at 11:50, 40 minutes into my one and only Saturday night of the week. What a waste of time.  The music was awful, Rod Stewart, really?? I didn't hear one song that I haven't heard a million times before. We retreated to the smoking area, the only part of the place I found bearable. There was an amazing amount of girls that could not hold their liquor acting trashed out there. Not normal trashed, more like first-time-I-ever-drank-so-I-decided-to-chug-a-bottle-of-everclear trashed. Words of wisdom: No one wants to do you if you are a puke time bomb.  We asked if everyone wanted to go somewhere else for a drink and dropped Kazbah as an idea and a girl walks up with the heaviest accent ever and says \"Kaaazbuh? Eww, isnt thAt a PUURSHUN place?!\" ...... that sentence sums up my recommendation. If you have an aversion to 'PUURSHUN' places, please keep the rest of uptown fun and go to Whisky River! Otherwise, don't waste your time.",
    "rating": 1,
    "rated": {
      "funny": 9,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "KiUqwL148Aj3xQB5yDl4ag"
  },
  "ahtdYeZNgCoLZqyrAC9nFg": {
    "date": "9/1/2013",
    "text": "My husband and I walked in, stood in the entrance for quite sometime waiting to be seated. Nobody approached us and the only staff we saw was one bartender. We walked away and will never return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "M6zmM1QXQFkyyfHEx08IuQ"
  },
  "QZhhkl-UIhF4IOWx4uYcKA": {
    "date": "2/28/2011",
    "text": "Calling all cheeseball 20 yr olds find your Ed Hardy shirts or your plaid button-downs tucked into your faded jeans.  Seriously.  Ladies dont get on the bull.  It just isnt hot.  Period.  I dont care how hot or drunk you are, it is just embarrassing....horrifying....if your mother could see you now...you would be in BIG trouble young lady!   The only thing I can say positive about this place is that they have my beer there and you get a lot of free drinks because the VIP lounge looks down on the bar by the dancefloor.  Just know what you are getting into when you walk in the door.  Ug!",
    "rating": 2,
    "rated": {
      "funny": 8,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "htiVdsiY_rBmJc65aZ3YAA"
  },
  "4-IJhXNSCxxjyF9EXyexhA": {
    "date": "4/16/2016",
    "text": "Just go ahead and get rid of the rude cover charge girl (blonde). She literally YELLS at everyone walking in and is generally unpleasant. We walked right out after our initial interaction with her!! Across the Epicenter we were warmly welcomed by every other establishment. Go to this place if you want to be treated like you're belligerent when in fact you're sober :)",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-phvfOCoo5joB2qnPWX76A"
  },
  "vriX_4v1PpwDuCMyFLlJDA": {
    "date": "5/9/2014",
    "text": "Great bar.......   the food ? Eh not so much. Stopped by with some friends from out of town. Disappointed with the food. Friends flatbreads were burnt black on the bottom. My burger was not as ordered. Great place with a great location but the kitchen needs tightened up ! At least the beer was cold !! Bartender was excellent. Manager made everything right. Good guy !",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XAw_ztLSIHwRCzavTe_Aiw"
  },
  "Ugktyk_ZSlkkP_EwZILEuQ": {
    "date": "2/9/2016",
    "text": "Horrible service. I was in town for some training and wanted to try it out. There were no more than 10 people in the bar at 6:30p on a Monday night. We waited 5-6 mins until someone finally acknowledged us waiting to be seated. There were two in my party but we were on given one menu. We shared that one menu for about 10 minutes and when we still hadn't been helped we decided to leave. You would think with the Hornets hosting the Bulls this place would have been slammed. Maybe the locals knew something I didn't.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dggSMS_ZtUnRgOrE4uVCHw"
  },
  "gQEKlFhaSWgmAN1BSUNzeQ": {
    "date": "1/11/2014",
    "text": "Fun place to go out in Charlotte, very popular so its always busy but its in no way a great place. Over priced bud lights, ok music.. i've experienced better. Of course its the crowd that makes it fun so if you're with a group of friends give it a shot.. oh by the way theres a cover charge. which sucks.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_miVui2XUcYO0KMbfa4fOQ"
  },
  "djD7ovU865v7ETjRs9Vw0Q": {
    "date": "6/19/2014",
    "text": "I'm sure this place doesn't survive on folks eating lunch there on the weekend. But I'm gone a few times during some slow periods - and the food was mighty good.  The burgers can hold their own with anyone in town. Plenty of tasty fries, nice service. Watched some NASCAR on TV. A solid choice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KHUgVpPRBAKCQjn_ViHlQw"
  },
  "dnBdo-AnDQ9LEqeX83tfpw": {
    "date": "6/9/2019",
    "text": "Started here for our brunch crawl.  As the host of this event you would have thought there would have been better direction to the day. Instead they let the app be what we used to figure it out.   Upon arrival I was immediately uncomfortable as we were never offered anything.  The three of us literally stood there looking lost yet trying to fit in. It was only noon so hard to judge the overall atmosphere of the bar scene.   We stayed for only a few minutes as we felt like outcasts.  We thought we would go outside and work to figure it out.  Want to return as I have only heard good things about this bar....just not impressed with their hostess abilities.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "fS0kFv5UdbQLBy1Rq3xuwA"
  },
  "jAfQAx5-Xh5UgwXCZmFyhQ": {
    "date": "4/30/2019",
    "text": "What a great BIG bar! Loads of tv to watch sports and there's even a mechanical bull!   & the wings?! My goodness so delicious and fulfilling!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "B5oANkcaV7EJsru9R8Xt6Q",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. Buffalo Wings and Sweet Chilli Wings",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/B5oANkcaV7EJsru9R8Xt6Q/o.jpg"
      }
    ],
    "user_id": "E6vBZfX71MMMQ4fvTVCuOg"
  },
  "J3Uat00Dar1qHBXI0AD-xg": {
    "date": "7/30/2019",
    "text": "A group of friends and I came here this past Saturday for the Rum Fest in the Epicentre. We paid $20 for one signature drink at 4 different establishments. Whisky River was the third establishment. When we tried to get our complimentary drink from the bar, they proceeded to tell us that they \"ran out\" of the alochol for the drink, but we could purchase others for the \"special\" price of $5. Now if you run out of something that people pay for, why would you try to supplement this with something for another charge? Sounds phishy to me. This was the only bar who did this, and we were extremely displeased with the service. Thanks for not holding up your end of the special. We will NOT be returning here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NKnoOwKnyN8rs1eFLmqeJQ"
  },
  "tv5BZjpi2mak0YHntYwelg": {
    "date": "8/25/2019",
    "text": "Food was your typical bar food... appetizers, burgers, sandwiches, etc.  Service was good and the bartenders were friendly.  I gave it only 1 star because while there we witnessed two employees wrapping utensils in an unsanitary manor. The utensils were being handled with bare hands...  being picked up by the tops of the utensils that a customer would be putting into their mouth.   It's pretty disgusting not knowing if the employees hands were clean or not.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f2inL1ur2yOh6_AS7xyyDw"
  },
  "hTWTBeb48J_PolsLhPzthg": {
    "date": "4/14/2019",
    "text": "Came here to watch the Nets playoffs vs 76's on April 13, 2019 and this was my first time at this establishment. The wings were phenomenal (see attached photo) and there were dozens of tv's all over the restaurant that allowed for multiple viewings of different things!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q-eD-FAP0lFrcOeCZn3OPg",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. Sweet Thai Chili and Garlic Parmesan Wings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q-eD-FAP0lFrcOeCZn3OPg/o.jpg"
      }
    ],
    "user_id": "Nh01PE2mMSPERvCtc6A4FQ"
  },
  "N5vOQoVU8b1fLwUMVNnaNw": {
    "date": "8/3/2019",
    "text": "Got here with my cousin from NY. She was turned away because she has a state ID vs a license or passport. Due to this being a \"Private Establishment\" they would be fined because a 34yr old woman has a state ID from NY. So all 8...yep EIGHT of us had to leave. A huge percentage of New Yorkers don't have driver licenses so a GIaNT  middle finger to this \"Private Establishment \" with the dumb rules. When a law is unfair or nonsensical, business owners should challenge it vs nimbly stating \"it's the law\" We walked across the hall to another bar and had NO problem. So again...a big middle finger to the restaurant with the DUmB rules",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7dPGhATzIbdlElKND_hsFw"
  },
  "yBH_YnNdxSuUPk2jUs4S3Q": {
    "date": "7/6/2019",
    "text": "You know, good bar but their food selection is really sub-par.   I'm not going back there for food.    Everything seemed frozen, thawed, and heated up.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OEeS_GLsjJK2RpCWCuWEuw"
  },
  "eqDpBWYORY_HLr8PL79EPg": {
    "date": "3/10/2019",
    "text": "If I could give 0 stars I would. Took 45- minutes to get cheap tortilla chips with Pace picante \"salsa\". (Living overseas, it was the only salsa we could get and that taste is engrained in my memory.) Awful!!!  The cheese dip is any microwavable dip you buy in the grocery store. 2- minutes after the \"appetizers\" were served, I got my poor excuse for a \"Killer Club\". 3- slices of processed, packaged \"ham\" and 3- slices of that same crap only a different color, called \"turkey\". ( Seriously, think Oscar Meyer bologna.) It even had the slime from the package. I could have easily made that in my hotel room and had it taste better. Sorry excuse for calling it restaurant food. Dale Jr. ought to fire whoever thought the menu was good and disassociate with this piss-poor restaurant.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "57BKctZQAzXkrc7MuOr3fw",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. Killer Club- only if you eat it. They opened a bologna package and slapped it on the bread.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/57BKctZQAzXkrc7MuOr3fw/o.jpg"
      },
      {
        "img_id": "pZqi23sGO174614n7ymGCw",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. Didn&amp;#39;t bother to separate the stack of packaged, processed meat. Cold, disgusting meat product. Bag of cheap tortilla chips.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pZqi23sGO174614n7ymGCw/o.jpg"
      }
    ],
    "user_id": "p4hBafsrhQK8VCQ-IRCdOw"
  },
  "fa-bGMc-6lJS5Uc3KVwWOw": {
    "date": "4/7/2019",
    "text": "I came here for my birthday on a Saturday night. They have decent drinks, a bull free they just take tips a big bar area and at soem point in the night the open some area for dancing. The music started fine but then went down, I was just here once so I'm not sure if it was just one night or the DJ is always the same. Either way, to spen one nigh was a nice place. There are some waitresses walking around with some shot drinks in case you want and no need to walk to order at the bar",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y-fUYOj1o4aPSJguYVnigQ",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/y-fUYOj1o4aPSJguYVnigQ/o.jpg"
      }
    ],
    "user_id": "3rv0NvA0bI7c1frjDywXmQ"
  },
  "-f_3OtWlhw8XN9OpuZk4DA": {
    "date": "4/12/2018",
    "text": "I was nervous because of the low ratings on Yelp! But I love Dale and had to do it. And I love the surprise coupon. Thanks Yelp!  We got nachos for an appetizer with chicken. They were the typical bar food appetizer. Not bad.   I got the ribs. They were fall off the bone tender.  BBQ sauce on the side. Crispy fries and the mac n cheese was good. Nothing spectacular but not bad at all.  Don't forget your souvenir t-shirts!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GyWxfVpil0b1vVVjSdxhwQ",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GyWxfVpil0b1vVVjSdxhwQ/o.jpg"
      },
      {
        "img_id": "WBII9Oz0oYbq2CRN94RQ2w",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WBII9Oz0oYbq2CRN94RQ2w/o.jpg"
      },
      {
        "img_id": "1oGgNtwjv7LPI5w2V2ZUcg",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1oGgNtwjv7LPI5w2V2ZUcg/o.jpg"
      }
    ],
    "user_id": "QanV5AtttYtMFfzX6x1-SQ"
  },
  "_WSogPdul18KZuX-G-ZV5g": {
    "date": "6/12/2019",
    "text": "Came for the nightclub part of the establishment.  Draconianly strict dress code policy that is selectively enforced. Many of these rules seem obviously geared towards African American culture (none of these: loose attire, huge logos, flashy shoes/clothes, hats in any direction other than forward, visible necklaces, athletic wear, do rags). The only reason I bothered giving the place a shot was to perhaps try out the mechanical bull, which was not used by many - there was never a line to use it. The unwelcoming bull operator was likely the cause of this.  The DJ was HORRENDOUS. The genre of music constantly changed, nearly every couple songs with no thought seemingly given to as what songs were played. I had more fun dancing to 80s/90s music, which I never listen to, at another nightclub than the selection given at Whiskey River.  The bartenders wore very revealing attire, the bottom halves of their butt cheeks were clearly visible. Trashy and embarrassing to bring along someone with a ounce of class. This is very at odds with any excuse for their targeted dress code possibly being in place to require their patrons be dressed nicely. The drinks were nothing to write home about.  The venue was beautiful, although unoriginal.  You know it is a sad club when the most entertaining part of the night was some guy in the dance floor with a cowbell. There are much better places in the Epicenter to visit. The only time I'd ever go back is if every other club in the world vanished over night.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WKrYJecMmVXof1Trk-XxFg"
  },
  "jVYYz9Te5z7YMHsI9Z9L6A": {
    "date": "1/3/2019",
    "text": "Ate here after the Belk Bowl. Beer is cold and that's the only good thing I have to say about the place. The chairs are wobbly, the bathrooms are dirty but the cherry on top is ordering buffalo CHICKEN dip and it tasting like buffalo CRAB dip. It was exactly like biting into week old fish-barf! Sent it back after two bites and they still tried to charge us for it. They should stick to being a bar because the food is no bueno",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ez-Qm8oIJI0ROn254RgB-w"
  },
  "Ms7AIETwe2yzD1dTfpfjPQ": {
    "date": "4/21/2018",
    "text": "Cool spot at the Epi center. When you come in your greeted. I sat at the bar. Staff are nice. The place plays all kinds of music so you can't get into a groove. They will play country, rock, old school hip hop, pop, etc. when you check in on yelp you get a free appetizer. We got the spinach dip which came with rainbow chips. Don't get it. It tastes like a creamy paste. They have several televisions with music videos to the game. Drink prices are decent and the drinks are tasty. The restrooms are clean. It's a nice sports bar spot to try. I'll go back in passing, but not a place I know I will return to. It's basic and they aren't known for anything.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 11,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "eAZqtpM5OoEiMWsSmiwUTQ",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. Spinach dip",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eAZqtpM5OoEiMWsSmiwUTQ/o.jpg"
      },
      {
        "img_id": "iJoG1VAmGPftU0F2DecHLw",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iJoG1VAmGPftU0F2DecHLw/o.jpg"
      }
    ],
    "user_id": "Wt-dSc-L33pKiQ4mdZv3nQ"
  },
  "HNtA6lo0MQVK0_rCy5X_8g": {
    "date": "10/28/2018",
    "text": "Quite a disappointing experience. Came in on a Tuesday evening with a colleague for dinner. Waited a bit for the hostess to figure out what to do with us. There were plenty of tables but for some reason she wanted to sit us at the bar, which isn't what we wanted and that seemed to confuse her. We were finally sat at a table, which wasn't the cleanest table I'd ever been at and as we sat there for a bit waiting for someone to pay us some attention, we decided we'd take ourselves and our money elsewhere. I'm glad we did after reviewing the other yelp reviews, which frankly, I should have done first.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z3nwYQzDUimoUl8LNDIxjQ"
  },
  "HWWhxj2KImW5huZXoGR5ew": {
    "date": "5/20/2018",
    "text": "Was attending an event at the convention center which is only a couple blocks away. Several other attendees went in separate groups. More of a sports bar than a restaurant. The food quality says sports bar as well. Service was excellent. I didn't have any drinks so I couldn't tell you anything about it. Overall it was ok but not a \"I must do again\".",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J-UBolB51iFBWt4hyw6xLw",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J-UBolB51iFBWt4hyw6xLw/o.jpg"
      },
      {
        "img_id": "l6Ufbp1rz5vwWB6rrTEnqA",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l6Ufbp1rz5vwWB6rrTEnqA/o.jpg"
      },
      {
        "img_id": "mFiw6U7JVQUaqqdgMAF7Kg",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mFiw6U7JVQUaqqdgMAF7Kg/o.jpg"
      }
    ],
    "user_id": "9vyJ7z12GalZ9m9K8uWOyA"
  },
  "gORgM4giBrksMz9XrTz0QQ": {
    "date": "7/10/2019",
    "text": "The bar was cool and service at the bar was great. The guy running the mechanical bull was the rudest individual I have ever encountered. Not going back to a place that treats customers in that manner.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s7B25WqTzA9Eu7Br9VdIVQ"
  },
  "xhmq1D8upeecW3xt7sN8Zw": {
    "date": "6/20/2019",
    "text": "Poor service. We went there tonight and didn't recieve any type of service. The bartenders walked pass us several times and didn't even acknowledge us with a hello. Never going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DLStZ17IcBOPxzymEcWAlw"
  },
  "y-G7BvhaCYhMIRbTpaZ27g": {
    "date": "9/4/2018",
    "text": "Went to take a #2, stayed for the food. Both were average.  I was disappointed with this place. The food was very average, the drink list was minimal and the bartenders were not very attentive.  I like Dale Earnhardt Jr and I wanted this place to be good.  But I also know Jeff Gordon would not put his name on something with such low quality.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zv1t3ApgtHvRWe3DhFXTTA"
  },
  "Sgs6FkCmAR-ZYFbROUW9Sw": {
    "date": "3/24/2018",
    "text": "Great food, and service.  Had an issue with meat temperature, but manager was very professional and provided great customer service.  Highly recommend the Cali Bowl, with seared tuna and greens; the Mac and Cheese bites were very, as well as the nachos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HMSH2m-Jp-BISG5FpX15yQ",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HMSH2m-Jp-BISG5FpX15yQ/o.jpg"
      },
      {
        "img_id": "fdAwGfp2-X-195grGIlebQ",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fdAwGfp2-X-195grGIlebQ/o.jpg"
      },
      {
        "img_id": "QvOpS0WIrTh7jiZ7XnGMMw",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QvOpS0WIrTh7jiZ7XnGMMw/o.jpg"
      }
    ],
    "user_id": "wBLanThahsHWsrVaJe6W7A"
  },
  "p_pTzUUgS2CeznMr5i8n_Q": {
    "date": "6/15/2019",
    "text": "Great service! Kate in the bar was outstanding and made some incredible food recommendations! The wings were cooked perfectly and tasty. Highly recommend WR!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SbxxaOmhk0zYd2e144E0Gw"
  },
  "8iHCmUCPK9M6efHLGlQ68g": {
    "date": "4/20/2010",
    "text": "Interesting place. Long line to get in, no idea why because there was plenty of space inside, but the line moved quickly. $7 cover...where do you think  you are?? A bigger city? Please. At least I didn't have to pay for that ish.  First round of drinks were served in small plastic cups, lame. Second round were actually served in slightly bigger glasses. How does this place get away with that?  Mechanical bull..anyone ever get an STD from riding a mechanical bull? Because I'm sure you would if you mounted this one after all those other ladies finished grinding up on the hand hold.  Huge dance floor with a raised platform at the end of it. Perfect perch for all the creepers. Music was horribly mixed top 40s with a few popular 80s songs (i.e. Journey).   The only reason why I'm giving this place one star more than 1? TVs all around the dance floor so I can watch the NBA playoffs.",
    "rating": 2,
    "rated": {
      "funny": 8,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "53QaFbmZojYK0vv3RQagcw"
  },
  "m72ukWQIiz8rWFp8xwMGcw": {
    "date": "11/15/2016",
    "text": "Bartender with the tattoos was awesome! Took care of us both nights we were here! Great environment and the staff was very nice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N3bgOCpVeVY8NPxGJwEZAA"
  },
  "Yc0q_4iNYKBKlCfEJmafhw": {
    "date": "8/24/2015",
    "text": "I went here simply to kill some time on a Thursday night and they had a free band playing, can't remember his name but he was new and on the radio and they were great.  The Bartender was even better, can't remember his name but he was very funny, joked around with you, knew how to give crap and take it, quick with drinks, and just overall a great bartender.  They had Yuengling Beer which I totally forgot because I am from Minnesota and can't get that there and I was excited about that.  Prices were great, met more people from out of town, great atmosphere, I would highly recommend this place to everyone.  I didn't eat here so I can't rate that but I did try the mechanical bull (Of course I didn't last long on that).  Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Yh7-P5AibkeNmms9dcavQ"
  },
  "TAQkSWvJ7_qyV4B4DH4n4Q": {
    "date": "6/11/2012",
    "text": "I don't normally go to clubs with riding bulls but I must admit I've been here a few times.  It's a favorite hang out joint for southern folks.  I'm being nice by not using the term RED but I can because I'm from the south.    Last time I was here I had to do shots just to get in the groove because the drinks being made were pretty much pointless and watered down.    Being that this place is right in the Epicenter it's just and easy drop in during AA5 sometimes.  That's about the only reason I've ever even walked into the place.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "MW1HTZpZH-GV32vmuXIU-A": {
    "date": "5/28/2016",
    "text": "Having never been to Charlotte, we chose to eat at the Epicentre. We chose Whiskey River out of a few other options. We were seated at a window table overlooking the city- awesome! Our server was all out of sorts. We ordered the nachos as an appetizer. They came out quickly but were so disappointing. Very little toppings and super flimsy chips. The guac that was supposed to come on the side came as a dollop on top. We were starving and finished quickly. We ordered burgers. Waited an hour. No burgers. The waitress came out and told us that our order never printed in the kitchen. They comped our burgers and had them out within 10 minutes. They were delicious, as were the fries. The atmosphere is not all that great and even for us as a young couple, the young kids at the bar were obnoxious. And the mechanical bull was directly behind our table, super distracting.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BWYlxWYTgi64qRzZTTAm2w"
  },
  "44kiGpCOem_tHL1m4zv9iw": {
    "date": "10/2/2012",
    "text": "Meh. I've been here before but it's been years. Friends were in town and this is where they wanted to go, so we went. Didn't have to pay cover thanks to some hospitality passes, at least. Overpriced drinks, impossible crowds, blah music turned up really loud. This seems to be the place to go for your bachelorette party though, as we saw 4 or 5 groups. The bartenders were attentive and friendly, I will give them that.   While we're on the subject of bartenders, I understand the purpose and desire of scantily-clad women bartenders, but I do think they have gone a step too far with the shot girls' uniforms, or lack of uniforms. When there's more cheek than pants, I think it's time for new pants. I've seen more cloth on cocktail servers at an actual strip club. And what are the male staff members wearing? Cleancut polo shirts and long pants.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "I6DOULDVlRpIHuhV3rQpTg"
  },
  "Da1-pX6ayESWGvl3qkjd6A": {
    "date": "5/23/2012",
    "text": "We have come here a few times and have always had a great time. The free bull rides are great and the guy that runs it is really friendly. (if you want to stay on a while make sure to put on a show on the bull).   This was the first time we've made it on the dance floor. It was packed. If you like being crammed in to dance then this is a great place. I personally don't like such a packed floor but it was still a good time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mGj5EthnShJFU5CSnBaLFA"
  },
  "0DvSYwVVgK5hptBstEaloQ": {
    "date": "11/22/2014",
    "text": "Went Thursday night for dinner before the TSO concert. I had read reviews before we got there. A lot of them were right. Especially about the service or lack there of. We were seated and waited about 10 mins for our waiters to grace us with her presence. She didn't introduce herself or anything. I asked for a drink menu and was informed they didn't have one. We ordered margaritas and they were actually very good. 20 mins later she came to take our food order. Ordered fried pickles, club sandwich and a spinach flatbread. It was ok not great. We were given our check way before we were ready to go. They wanted our table to \"Reserve\". It made our waitress made when we told her we weren't ready to leave. We stayed 20 more minutes and got dirty looks. We watched \"less attractive\" people being turned away after 6 pm. Even though the alcohol was good, we won't be back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ESYv1XKS-bFTFCQI0X86A"
  },
  "w3QN41kKAQaaxRsSbvkiQg": {
    "date": "10/12/2014",
    "text": "I cannot recommend this place  food was below average and the service was worse.  We had a group function, all had to sit separately, two people left because they couldn't sit where the game was visible and two others left because a son couldn't sit at the bar with his dad and eat.  Katrina, my waitress, forgot my order and brought us the wrong drinks three times.  Next time I'm back in Charlotte, I will not be entertaining here.  Sorry.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCRL4inyEgxXGLPiCJk1iw"
  },
  "H8T3DBzVonH7jGPIVAGBgA": {
    "date": "9/25/2014",
    "text": "I am giving this 2 stars, because I have to give it something. I am updating my previous review regarding the horrid treatment I received from the clueless hostess when I attempted to have dinner there last weekend. I did receive an e-mail from the manager asking me to call. I called him and he apologized profusely and asked for a chance to make things right. I plan on taking him up on his offer, because I really want to try this place out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sf_S_Va3hg92BtXCpYtECw"
  },
  "XVZLeUNQ9qWn1Qcz3xFtfg": {
    "date": "4/25/2014",
    "text": "We didn't eat, we didn't dance, all we did was drink a few beers.  Our bottles of beer were not cold enough.  Neither were the drafts.  It's my fault for not complaining because they could have accommodated us in someway.  But, even still, 4 different beers, 4 times not in temp.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UV010-rZ3ZhFdC_RPsbQfQ"
  },
  "D07km0WwXihhc2sGITgC9w": {
    "date": "4/19/2016",
    "text": "Last Saturday was the first time we'd ever been here and honestly we hadn't planned to go there.  We were walking by and heard the music and it was so awesome that we just had to pay the $7 cover to get in.  There was a huge dance floor and it was packed with all different types of people.  The dj was THE BEST!  I wish I knew who he was so I could follow him.   We will definitely be back to Whisky River next time we're in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H2QWYf1Vj7HTEqYHpfNHHQ"
  },
  "eFVux26MewRV1dNl-d5Jog": {
    "date": "2/8/2012",
    "text": "Not a fan. Crowded.. Can't get to the dance floor.. Some girl in the shortest, tightest shorts dancing the SAME grind while 60 year olds stare ... mmm??? Bathrooms in bars like this.. No words. It's a story amongst stories. The later the night gets.. the better it becomes.. Took me 20 minutes to get from point A to point complete in the womens restroom.. As I waited.. the random youngster runs past line.. holding mouth... random friend following youngster runs after her. Girl behind me bumps me..says some 'mf' stole her jacket while she road the bull.. Did I see? ( No cougar ville.. I saw ur butt tho hanging for the world to see while u tried to ride some mechanical bull... G O A W A Y).. attendant.. curses at puking girl.. I just want to use the restroom.. AND leave . Fast. NOT my place..",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1sGYXSkJHPhJ6wQtc-RbZw"
  },
  "pAOVHeR7R6dgN00yiyEpng": {
    "date": "3/29/2014",
    "text": "Digging the mechanical bull (it's a plus that it's free).  Packed dance floor on Saturday night. DJ spinning top 40s, which I don't mind but his mixing was pretty bad..played songs for like 1-2 min the switched. But it was really noticeable and killed the vibe for me. But bartenders were nice here. Also noise level is loud but tolerable. Ears won't be ringing when I leave here. Also $7 cover (ok but please get a better DJ).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mu0NjbMX8SxveXQMicZm7w"
  },
  "Al9icXaipRTYH3d3EiMmjw": {
    "date": "11/10/2014",
    "text": "Went on a Friday night. Fun sports bar atmosphere. Mechanical bull riding was entertaining to watch. Lots of TVs. Good music, not too loud and was early enough in the night the rush hadn't started (yet). Clean bathroom with an attendant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wNI49PpVAAsvYZM8JZkDrg"
  },
  "3Or657uvtsvQ4QyVYchEBQ": {
    "date": "5/20/2012",
    "text": "I went here Saturday night with some friends.  We were visiting from Raleigh and knew that the EpiCenter was the place to go. I checked the reviews on this place and it didn't look too promising, but everyone else wanted to go ride the bull and dance, so I followed suit.  The cover is $7 on a Saturday night which in my opinion is WAY too high for a place that charges so much for their drinks. I got a vodka cranberry and my boyfriend got a beer, and it was $10.50. wow.  Thankfully because I checked in I got in for free as part of their check in offer. SCORE!  Anyways, the place was absolutely packed, there were people everywhere and it took forever to get around. Fortunately they had beer coolers set up around the bar, and there was two bars with quick bartenders, so getting a drink wasn't too difficult.    We got in line for the bull first. Now I've ridden the bull in Raleigh at City Limits, and its a good time.  After seeing the way its ran at Whisky Rivers I decided to opt out of the adventure.  First off the man who is running it makes it very obvious who he thinks is attractive and who he doesn't.  The girls who he didn't have the hots for were thrown off after a few seconds.  The more attractive girls were up there forever,  the bull barely moving expect for vibrating, which of course made the whole experience look completely provocative. There were a few guys who got up there, although it was mostly just drunk girls.  After exiting the line for the bull we went to the dance floor. The DJ was playing good dance music, top 40s with a few country songs thrown in here and there. I had a good time dancing to the music but it was difficult because there were people bumping into us every few seconds, which is to be expected at a place like this.  Girls, the bathroom only had three stalls, they don't restock the toilet paper and the line moves very slowly. Be Warned.  Needless to say this isn't the most fun I've ever had a dance club, but it was a good time. If you are looking for that crazy loud, crowded club scene, this is your place on a Saturday night.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LrcLU6QNMxTV1z8DgUMm7Q"
  },
  "ADYAYGXmFbuNvI_fHa4Bwg": {
    "date": "5/9/2015",
    "text": "Fun bar/club with good music. Reasonably priced and definitely one of the most fun spots in Uptown Charlotte. No drama, which is a huge plus! Everyone is just here to have fun and enjoy themselves!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HQx6wq01BMp51XiGVjAmRg"
  },
  "gEMRsrgiDpfzmDghzEOMfw": {
    "date": "9/10/2012",
    "text": "Meh. I was here for a private party. It's a large space. Plenty of room to move around. The stage area was alright, but far from good. There were plenty of bars, so getting a drink was always easy. The beer selection was meh. The food spread was pretty awful. I can't say how it would be here on a typical night. However, based on my private party experience, I would go in with low expectations.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YMgZqBUAddmFErxLtCfK_w"
  },
  "7MUTw2YJNH9OuXZRae0dNg": {
    "date": "5/25/2016",
    "text": "This place had great music, dancing and drinks!  We enjoyed a ladies night out and had so much fun!  I will definitely go to this club again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fXjucZvOg6ph6AxMxa86Ug"
  },
  "sYlYdtGWDjlvkPud4LBBaQ": {
    "date": "12/28/2014",
    "text": "Fun night out dancing. Overpriced cover and drinks. Good mix of people of all ages. Dj was a bit odd - went on Friday night and he rotated playing half an hour of awesome music followed by 15 min of Ingrid Michelson, which of course cleared the floor because no one knew how to dance to it. I would go back if someone else suggested it, but might try some other spots first.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XVwMHihEU6R2t0lrmioroQ"
  },
  "lzjQZhtEk0mDGQ_hx1DGAg": {
    "date": "6/10/2017",
    "text": "Really a disappointing place. Stopped in with my parents after visiting the NASCAR hall of fame. Figured JR's place had to be good. So wrong. Service was extremely slow. It was us and a couple there. Took forever to get anything. My father had the steak and cheese sandwich. Stay away!!  He ended up spending most of the night visiting the bathroom. We skipped dinner and it was about 12 hours later. Pretty sure I know what happened. So sad. Brisket I had was just so so. Nothing to write home about",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VqiSXV4fyJDoaqEqdPKNBg"
  },
  "hbnd-aJClqWAdT8yNa4qQQ": {
    "date": "2/9/2017",
    "text": "Terrible customer service... Hostess didn't greet, advised me there was no seating available, she told me that I could walk around to see if I can find a table or a seat at the bar. I decided to look around to see if there were any seats & right by the bar there was an open table... my friend & I sat down & waited for a waitress to approach us (mind you it was a slow night) a total of 3 waitresses saw us & walked right past our table. After about 15 or 20 minutes of being ignored my friend & I decided to go somewhere else. This was the FIRST & LAST time I'll try Whiskey River.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "7nHztVqdMxs17ceYZvY23Q"
  },
  "BhZcou_V69ttbWQUFWO2Jg": {
    "date": "7/22/2014",
    "text": "We stopped in here with 3 for lunch during the world cup. The food is not that great. It's OK, but clearly came out of a can or was pre-made without any preparation for the meal. Appetizers are ALL fried and their dishes come with HUGE portions that aren't really appropriate.   The bar seemed fun, although we were here during lunch and on a Sunday so it was pretty quiet. However, because the game was going on the service was TERRIBLE. Our waitress barely stopped to check in on us and took over 20 minutes to return our check after we asked for it. All the waitresses were just hanging around and talking to each other or flirting with a group of guys at the bar and not waiting on the ~8 tables that were seated.   Will probably not be back any time soon.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "B45WZ4vSgAjsC3T1na3Olg"
  },
  "MsO4gOwVzkfPhPhO_AF_Hw": {
    "date": "11/27/2015",
    "text": "Terrible time. I saw a 'security guy' tackle A random guy after dancing on their make shift bar. After tackling him, they continued to rip their shirt off and punch him on the ground. When bystanders asked for the managers name, he responded, \"It's not relevant.\"",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D-P7pLzQWJl401ZDLVqFGQ"
  },
  "IyQ44UB4rnLsjvsJIWQ4ZQ": {
    "date": "11/15/2016",
    "text": "Good service great food would recommend this place to anyone bartenders are super nice",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9RHJtmZ4-UDCA3fLQcdog"
  },
  "NOrmhZA58P1YJt7v_yRkbw": {
    "date": "12/20/2015",
    "text": "Went there with my coworkers for pre-party cocktails. Place smelled really bad - not sure what it was. Also, there was some sort of water leak or leak they left on the floor - they cleaned it as we left... So the water on the floor was there for about 45-50 mins. Bartender was nice. Drinks were expensive, I felt.Served it's point. Quick cocktails before a work Christmas party.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "oWxy_YR6n2w8e9L00hxhPw"
  },
  "tZJpGxN6ZgiZBsSbYv3dUg": {
    "date": "5/10/2015",
    "text": "I enjoyed the restaurant it's pretty cool the food was good I had the chicken finger plate I liked the dipping sauces  we also ordered chicken wings the where ok pretty good prices also.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZHQlcgzSyLXDtpM5sTbbFw",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States. Chicken finger plate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZHQlcgzSyLXDtpM5sTbbFw/o.jpg"
      }
    ],
    "user_id": "R10bLB3DyZ7c1W8jeYMc9w"
  },
  "bQ1Zy-CFncz76_s1O8R3iA": {
    "date": "1/18/2016",
    "text": "Went in for lunch at 12:30pm on a Monday with my wife and daughter.  Waited 50 minutes, yes 50, for a hamburger and chicken sandwich.  The place wasn't even busy!  Food was decent but who wants to wait nearly an hour for their food?  Won't go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "MVwvNLTkGGXub3sZHsuL3Q"
  },
  "AVGFZf0JIIlYa0geR3_NnQ": {
    "date": "4/25/2017",
    "text": "Very disappointed food was average at best , drinks were super expensive and service was non existent. They must not get a lot of repeat visits, just first time visitors, fool me once.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jKQhQ6BbkGY1fG-Xp-UhFg"
  },
  "Fk9rBlKZLYVVzCVP1vWBDw": {
    "date": "5/8/2016",
    "text": "I went there Friday, this was my favorite place until this Friday. nothing bad ever happen to me in this place but this time there were bunch of HIGH girl that literally hitting me while they were moving LIKE THEY ARE DANCING!! But definitely something is lead me to escape from there was a girl who scratch my leg with her high hill shoes while she was jumping! my foot was bleeding and i want to show her what she did and she start to yell at me, What?? i talked with security and they said they are sorry! i could not even wash my foot when i came home caz it feels burning my skin. being sorry and telling sorry is the worse thing they can do i am sure they dont have any heart to feel sorry for someone and IT IS SO DISRESPECTFUL THING TO HIT SOMEONE AND EVEN DON'T CARE AND THE SECURITY OF THIS PLACE DO NOT EVEN CARE THAT I WAS BLEEDING AND THEY DIDN'T EVEN TRY TO COME INSIDE AND BRING THE GIRL OUTSIDE THIS IT TRULY RACISM AND I DON'T THINK I'M GONNA TRY TO RESPECT THIS PPL ANYYYYYYY MORE!!!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R7nxGSz1oUGIm8-kNvnn8g"
  },
  "9PFcEyPcwOMJX9xEctMPLA": {
    "date": "3/1/2012",
    "text": "Young hotties all around and a racket loud enough to burst your ear drums. If you're into that, then this is the place for you! Thumpa-thumpa-thumpa.  $7 cover at midnight on a Saturday. I can't tell you how much the drinks are, because I didn't have any. I ended up here following a friend.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "Jo5nrXeS4uSvDYWO-FbWBg": {
    "date": "3/30/2016",
    "text": "I didn't rate for the food. It's your average airport food. When you want to drink a few beers between flights, this is your place. Good live entertainment and excellent bar service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5TkpUXe1KwOdrkob7s30uA"
  },
  "tzBoXO35g0U-L91hyMBW7Q": {
    "date": "4/23/2016",
    "text": "Came in for a drink at the bar and decided to have dinner. Their female bartenders played on their phones and ate behind the bar while we sought out male bartenders to bring us drinks. Food was subpar - disappointing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LzKdEc1ddYK1WW_0zyaNbA"
  },
  "lNEcJf8jyjvizZQFW2BcuA": {
    "date": "10/22/2015",
    "text": "A lot of strong opinions on this place as to be expected.  That's what happens when you're on the of the biggest places in the Epicenter.   I've been here multiple times- sometimes with friends, sometimes alone, sometimes just to watch a game, sometimes to dance, sometimes just to get drunk.  For those who've had bad experiences I don't doubt their story but don't think it's the norm.  Again big place, lots of staff, a club, bar and restaurant so there's bound to be a couple staff members who aren't up to par.  For the most parts I've found most of the staff at least average with only a couple exceptional.  Food- it will never be a place where someone asks where you do want to go for dinner people will yell \"Whiskey River!\".  It's okay.  Never been overly impressed or overly disappointed.  But again in a place like this I'm sure there will be a few people who have those feelings.  But I would imagine the majority of people who go here have an \"a-ok\" time (as that's what Yelp calls a 3 star rating).  But if you go there depending on the night, how much you drink, who you go with it, etc. it may be entirely possible you have a 5 star evening or a 1 star evening.  But you never know until you try.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "pzlimkZq78A4zOvsaHMqgw"
  },
  "JkDpk2fae0gNNOXj-4f9hA": {
    "date": "8/8/2014",
    "text": "I give this place two stars simply because the food is good. Other than that service sucked! Went there with friends to grab lunch around 2pm so not crowded at all. Our waitress was less than happy to serve us. She constantly kept disappearing and we could never find her. The bartender would pour fresh beers and we would almost have to go and get our own beers. Staff was none existent and there was several managers on their computers doing jack!!!  Food was great, but definitely not coming back or inviting anyone to this joint. If you don't have great customer service then doesn't matter about the food because no one wants to visit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M5wVOdY68IP2djVhuPAeSg"
  },
  "cgLVPm-IohbOWKYDYhQixQ": {
    "date": "3/28/2017",
    "text": "Terrible!! Service sucks and chefs were fired on 3/26/17 for spitting in customers food. I will never go again!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oG0jIv1duIaid2v-njbuBw"
  },
  "WDxSonD-mw1eQT4QeJuitg": {
    "date": "8/4/2016",
    "text": "My wife and I grabbed a late lunch here as we just arrived in town as tourists. Place is a typical bar type so it was not busy at 3:45pm. Staff was friendly. We both ordered burgers and fries. Food was very good and our server checked on us several times. The only complaint was the fries were on the salty side. I would return to have a lunch here for sure.  We both agreed that of all the places to eat in Epicenter, this was the only decent looking place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HtgaXQfe3n4pt-Igsg1M5A"
  },
  "qJttwQ4R5JVoMXwk6zf1Pg": {
    "date": "1/4/2016",
    "text": "I went with my sister in law before the ballet on December 18th. When you walk in, it smells like stale cigarettes which is odd since you can't smoke inside. So we sit down at the bar and the bartender looks at us and practically rolls his eyes. I've been in f&b long enough to know he was thinking, \"oh great. They're young.\" We order our drinks and he makes them then immediately gives us our tab and doesn't Check on us or even look at us again. It wasn't busy and other people were being tended to, so I was pretty offended. We intended on staying for a while and I've rarely encountered a golf bartender who doesn't Check build. We were going g to eat but the smell alone was too much. Fortunately, a cute little blonde wAitress was really sweet and ended up closing us out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Zy9Hldc3F-Rf5cDEYIkMQ"
  },
  "WQI85ThNwNYtjm0F6Y458A": {
    "date": "9/7/2011",
    "text": "A terrific place to measure how drunk you buddies are.  Would a self-respecting sober man ride a mechanical bull?  No?  I didn't think so.  The amazing thing about this place is that you never know the type of crowd that may be there.  Football crowds, twenty somethings, thirty/forty somethings, rednecks, Jersey shore wannabe douchebags, bikers, accountants...whoever.  The drinks aren't bad and the prices aren't outrageous...not great...but not that bad.  The music isn't something I'd particularly play...but it seems to keep the lemmings happy.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "cx4-WfPgm1Jxurtd83I83g"
  },
  "phydp8iinWtb2ghpWph9PA": {
    "date": "1/17/2016",
    "text": "Went for the playoff game. Great food, particularly the wings. Great place to watch the game. From Norfolk va",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zwOiJvD09N1dNf-ts7wscw"
  },
  "foGnbwQhZFJJ1SlLvl32fA": {
    "date": "12/3/2017",
    "text": "Well I would not recommend this place. I am currently here and my table of 5 were the first customers of the day. Initially our server came with waters. Then we ordered sodas and it literally took 15 minutes to get them with only 1 other table of 2 in the restaurant. We ordered our food with the drinks and it took 25 minutes for a salad and 4 burgers. Seriously with 7 total customers?  Then one burger was not done properly. I asked for my salad dressing on the side but it came fully dressed with my lettuce doing the back stroke in the bowl. If it is like this with 7 customers how do they handle crowds??? I would not recommend this place!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YZuC8xnn1dMJFEg9DoIgGg"
  },
  "t8Z8yHRtuKx-QvyotZOsqA": {
    "date": "8/31/2015",
    "text": "Not a picky eater, but I'm never coming back.   Came on a Tuesday. Sat at the bar and had chicken. The chicken was dry, and took well over half an hour to come out. There were probably only 10 people there max. The sandwich had nothing on it, it was bland, and the drinks were only okay for the price.  The only redeeming quality is that bartenders were attentive, but didn't seem to be the sharpest tools in the shed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4VmK7nXlOR-pvkyuY7nASw"
  },
  "ea31NMVtTo7D6x46tKRFnA": {
    "date": "1/6/2013",
    "text": "If you are reading this review and are on your way to this place TURN THE CAR AROUND.....  The only association this place has with NASCAR is the fact that it is owned by \"Junior\".   More of a bar than a restaurant - which is evident in the fact that they recently added food to the place to be like the Florida location.   Loud music that goes from Country to Rap to Pop in the blink of an eye.  A couple of TVs playing sports, a mechanical bull, concrete floors, floor to ceiling windows just make this a miss match of a place.   Add to the fact that the food here is TERRIBLE!  If you are so desperate to look at some tits and ass (the waitress wear short shorts and bustiers) spare yourself the $20 and look through a Victoria's Secret Catalogue.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "n-44u62KhwWbzioM6nLdhA"
  },
  "L0vXXyDGeFxvVZI8yLCvHA": {
    "date": "11/30/2015",
    "text": "I also attended the Redskins Rally \"and the staff was great . The drink and food was great and thank god for Dale E jr that really take care of the Redskins Nation ' what a bar full to the rim with Redskins Fans . Also met the great Chris Cooley wow!!!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5W3i1uz-mI2svsN_AkDwGQ",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5W3i1uz-mI2svsN_AkDwGQ/o.jpg"
      },
      {
        "img_id": "dpPC394QqUIkRE-7pKkx3w",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dpPC394QqUIkRE-7pKkx3w/o.jpg"
      },
      {
        "img_id": "S_fVyl5NkQwAzar6u3SAng",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S_fVyl5NkQwAzar6u3SAng/o.jpg"
      }
    ],
    "user_id": "ArWDzC-B5_Z_uRKXfykmpA"
  },
  "eQRGQWgvXvAol_qfrMS1vQ": {
    "date": "1/13/2015",
    "text": "This review is solely based on the food, and what an utter disappointment it was. I started with the boneless buffalo wings, hot, with ranch dressing. The order came with six, but I should say three and three \"little\" nuggets. Pathetic. The heat was decent and chicken fresh, just diappointed in the overall order. After that I went with the nachos with chicken.  OMG, please do not bother. The entire plate was covered in cheese, and before you go there I love cheese. This was out of the can, day old cheese that covered every chip so they were completely soggy! There was maybe two slices of chicken underneath all of the cheese, 5 jalepenos and maybe a droplet of lettuce. I love a chip covered in cheese, but when it is so soggy you cannot even get it from the plate to your mouth, that is an issue. I do not plan to return anytime soon..if ever!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "cvP3XpokWsW85rY-33YGGw": {
    "date": "6/12/2016",
    "text": "Just so you know ahead of time, they do not offer draught beer. Not one. \"Scenery\" (as in pretty waitress) is nice. Seems empty for a weekend. If I wasn't a Dale Jr. fan I probably would have chosen pizza on the first level. Just got the check, $4 for domestic bottle. Will not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "8feSNTahUPKZTmIkv0kFEA"
  },
  "ZL0ZJESt_gy5dk-155eSbA": {
    "date": "8/14/2016",
    "text": "About the best part of eating here today was the air-conditioning it provided from the August heat. The waitress was ok - refilled drinks without asking, BUT did forget to put in my side order so I had to wait halfway through my lunch for it to come. The food was pretty bad - wings were so fried the outside skin was difficult to eat, but the inside meat was pink! Also the Pepsi was very flat and the onion rings were super salty.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "faEgJuuB5ZMAR1_H8WGf1Q"
  },
  "pmLnvg4rA9lPfFWxJOecrQ": {
    "date": "5/7/2015",
    "text": "This place has been around about 7 years and it lost whatever cool factor it had about 2 years in, has had NO updates our renovations unlike other locations in its chain  The concept didn't make sense that it's a \"county party bar\" that lies about being country as they always play top 40.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "daFezWUv_AjdPV64ZaYA3w"
  },
  "k5_CeGiUG3fbwU2wRiaGbw": {
    "date": "6/2/2018",
    "text": "Stopped by here randomly. I ordered chicken tenders and fries and Mac. The Mac and cheese was alright. Desperately under seasoned. The fries were TRASH. The chicken tenders weren't great again, the breading was under seasoned. Overall the food was mediocre and the service was pure hot trash. Our waitress stopped by once told us her name and the other waitress who was shadowing her for training and then poof. Never came back. The waitress in training got us approximately 1 refill. And the kitchen staff ran our food. So we never saw our waitress again till she brought out the bill. I hate to be a stiff tipper but you literally didn't even come touch base with our table after getting the food that you didn't carry out. I understand when places get busy but there was one other table in the whole joint.. WHO GOT THEIR FOOD BEFORE US. so, probably would never go back or recommend this place to anyone",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lYQTB0h5A4S4h01zX5Lbsg"
  },
  "yDvNDfkj6lqC9h2Vaz6WMQ": {
    "date": "9/17/2017",
    "text": "Wanted to watch football and have some drinks which Whiskey River is perfect for except 9 tv's were on the same game. And, not a desirable game! We asked 5 times for the channel to be change on the tv we were in front, apparently only the manager can change the channel. Seems somewhat ridiculous no one else can change the channel!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G-IKeU1I_3OFk6GQlefZ9w"
  },
  "zP0M2wuq43hjl5Ju1zzsrQ": {
    "date": "5/18/2013",
    "text": "My personal favorites were the appetizers (buffalo shrimp, buffalo dip, corn dogs, and jalapeno poppers), the mac and cheese, CORNBREAD, burger and fries, smoked bacon anything, and of course the entire dessert menu.  With barbecue spots popping up all over Charlotte, Whisky has some stiff competition.  They don't claim to have the best barbecue in town, which is appropriate because their barbecue, while good, falls short of the competition.    I posted a full review on the blog, but these are the highlights.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gc4WUy07eaQYPGOly1t-Ww"
  },
  "wSRktW5mWqk24TQ7b3njHA": {
    "date": "9/18/2014",
    "text": "I had a supper around 5:15 at Whisky River there were probably 12 customers in this good sized place.   The food was traditional \"pub food\" and was average in taste.  The prices were great.  I had a cheeseburger with a drink and my bill was under $10.  The downsize was the service.  It took a long time to get waited on after server showed me the table.  I almost walked out after the waitress took my order because getting the food took what seemed like forever.  I actually had stood up and then say the meal coming so I sat back down.  Thankfully the server sat another group of people next to me so I asked her to find my waitress so I could get a refill on my drink.  She says \"I'll find her for you.  They tend to be lazy sometimes.\" Bottom line - Ok food; poor service",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "3N3THZdOuC9UMK2DaRXmXA"
  },
  "IKltU6lbVk-uzFqvczHJVQ": {
    "date": "7/14/2010",
    "text": "This is about as country as I will get! There is usually a 7-10 cover charge, but they have nights and times when you can get in free.  I have been here many times with CLT friends and someone always ends up riding the BULL, which I must say is probably the only reason we go here. I am more of a posh lounge type girl myself.. chill, listen to bands..  lay back on big cushy sofas and drink smart cocktails.. OH.. that is NOT Whiskey River. This is the place to wear your daisy dukes and cowboy boots and listen to pop, r&b, techno and a lot of countryish DJ music while dancing, ordering drinks and hopefully NOT slipping on all the spilled drinks on the floor.   If you want a get down dirty time, you will like it here. If you are looking to chill and be seen.. maybe Suite or Kazba is better for you in the same area..  there is also a great Piano bar above Whiskey called Howl at the Moon that is fun too..",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "LSpnHE3dswGKkE4CQUgYdQ",
        "caption": "Photo of Dale Jr.'s Whisky River - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LSpnHE3dswGKkE4CQUgYdQ/o.jpg"
      }
    ],
    "user_id": "MWuVbyBgP4vD24Rc7UH5xw"
  },
  "zEPnpHTbB0Uvs1_tEIwpfw": {
    "date": "12/10/2016",
    "text": "Great service! Nachos were great but multiple people at my table mentioned that their food was very salty. Other than that the place is awesome! Love the vibe!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3jx20G9B5Uif5eFagt6KVQ"
  },
  "G7m0Wi3AK2X70mJAC52-wg": {
    "date": "7/26/2017",
    "text": "Absolutely terrible service!!!! Took almost 3 hours to get our food, but the food was good. Better places to go than here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGeqA4iCLXOTM6NtbMegZQ"
  },
  "Q2tcceSHzguA3zXW2zwaAQ": {
    "date": "9/28/2017",
    "text": "Went to WR for lunch. Good food and great service from Autumn. 5 stars. Quick, fast and easy for lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Gs5ZidYckpfxyODPMu9zg"
  },
  "X-NsyGoM6yzvYU058z5hqQ": {
    "date": "3/11/2016",
    "text": "Poor ass service. Food is sub par. Won't be coming back. Girls trying to be pretty... Please!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "AkmGwVblkykhfqdmeg9ONA"
  },
  "S6RQrkeY0Tu2fC8TKkA0qA": {
    "date": "4/7/2016",
    "text": "The food was below average especially for the price for example the fried pickles were extremely salty. The Texas tequila bacon cheddar burger if it had the bbq sauce on it I could not tell. I will not return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "CpCUXrtiVZxMCXPS9jtHjQ"
  },
  "xpa7baDbsC606j-QiKlObQ": {
    "date": "5/21/2014",
    "text": "Maybe it's because I'm from upstate NY and just don't know any better but I thought Whisky River was underwhelming.  First - is there an actual Whisky River that this place is named after?  Because otherwise their logo looks like someone spelled Whiskey wrong before they sent everything off to the printer and that just bugs the crap out of me.  We went there for lunch during the weekend of the All-Star Race, thinking it would be a happening spot - but there were only two other tables taken.  It was dark in there.  Good for midnight I suppose.  Not so much for noon.  Our server let us sit at our table for about ten minutes too long.  Our drinks sat on the bar for about five minutes too long.  Good bloody mary though.  However, being a bloody mary fanatic, I always ask what's in the mix.  If you're making them you sure as hell better know what's in them.  Our waiter did not.  I ordered the Carolina Pork platter and what was delivered was a pile of plain pulled pork with those fries that are super crunchy with nothing inside of them. That's it.  No presentation.  No garnish.  No roll for the pork...wtf?  I liked the pulled pork very much and sampled all three of the sauces on the table which were all delicious and made the pork that much better.  The fries are just not my thing.  The side salad I ordered was the same as you would get at Applebee's or Chili's.  I thought the bathroom was cool.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "SBYFwU6EStmGJRdTQWHM8Q"
  },
  "X90ziBU91w5ubbzzmbGbXg": {
    "date": "10/12/2017",
    "text": "Love this place, and it's because of the staff. Amber is always so pleasant and wonderfully quick and helpful. Great for lunch, wings are great. I would be remiss if I didn't mention another wonderful server Autumn, always quick with a smile and some quick wit to dispense. Always walk out of here with a smile!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iss6HnKVWG3HXAN8KpfC3A"
  }
}