{
  "FPiIWnuE8gz-TjSpNHLe8w": {
    "date": "7/15/2017",
    "text": "We went two days after opening, and while you can expect some problems, there were too many to be acceptable. The waiter was severely undertrained. When we asked questions about the menu, he stumbled through explaining anything past what was written on the menu. We asked for a Butterbeer off the menu, and the waiter told us they might not have it. He brought it out, it was a 1/3 full in the glass. He mangled the cork opening the bottle, and got cork in the wine. At least the food came out at a decent pace. The duck gyoza and spinach soup was good. The wagu deckle was requested at medium rare. It came out presented as the strip steak and well done. The chef brought it back out and let us know that it was cooked with a thermometer to a proper temperature of 220... Medium rare steak is 130 at the most. The dim sum pancake was okay. They also delivered plates to the wrong table. Needless to say, not a recommended experience for the $$$$$.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q5qOQcr-pn2q9acrhWWj7g"
  },
  "_RFPgKy7IIW9E-kSZ_uslA": {
    "date": "8/29/2017",
    "text": "Awesome place. Great food and service, everyone was accommodating and the beer was delicious. Friendly staff and had great recommendations",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V3qoG0f40ya1qmEnlczO7g"
  },
  "lluGggo0qOqbghCw0e1aBw": {
    "date": "3/28/2018",
    "text": "Love, love, love this place!  I went with several friends and we mostly worked our way through their phenomenal and totally unique cocktail menu. You really can't go wrong with your choice of beverage. The food was absolutely phenomenal and totally worth the price tag. I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6XwC8TxCGwbY6O_nJAaSUg",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6XwC8TxCGwbY6O_nJAaSUg/o.jpg"
      }
    ],
    "user_id": "PHQfUOvha4JSrMfAci4isg"
  },
  "ps04o0JvtOhkoMg1rR8XSA": {
    "date": "7/25/2017",
    "text": "Food and service was good but the portion sizes for what you pay is a joke. I understand that this is supposed to be a \"tapas\" restaurant, but my friends and I have been to many tapas restaurants and have had way more to eat for less than what we paid tonight.   Everything was teeeenie tiny. Not even shareable. Between 5 girls, our bill was $208. And we all left hungry.  The servers also need to not hover at the wait station. It made for an uncomfortable experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xbVygxMz6LqZQW2Yp2UQ6w"
  },
  "KfIvyX-yLqpKNQSVCeR4XA": {
    "date": "1/8/2018",
    "text": "I cannot say enough about the food. We had 10 people and each dish was delicious.  I don't drink so I can't comment on the bar. They haven't been open too long but they should be open for a long time to come. I would highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jSIyCU-z4sGNaL-WK2x6gg"
  },
  "oyzC30uNI5J_JqXOhI35ug": {
    "date": "9/22/2018",
    "text": "Tried this place and the food was just okay. Sounded good on the menu, but the execution was not good. Had the scallops which came in a big bowl with a lot of sauce and bread on the side (for dipping).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "leAnil_G7_uBcLtz0WfgJQ"
  },
  "KGDWIAKt-UWz0_aoCvDSmQ": {
    "date": "3/4/2018",
    "text": "I LOVE this restaurant! A nice mix of fine-dining with a more casual/hip vibe. The food is delicious, and made from scratch. The management and servers are friendly and professional. The cute bartenders make uniquely tasty prohibition-style cocktails. I LOVE their old fashioned! Salim (bar manager) is SO talented and his drinks are really special. I highly recommend L & C for amazing food, drinks and fun ambiance.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r94V0huRAqGDi_0zzxlx6Q"
  },
  "ksl8LwEhVCO8llaIyC76ig": {
    "date": "7/18/2017",
    "text": "They have butterbeer!! It tastes exactly like it does in Harry Potter world at Universal. I was very impressed with their wide selection of cocktails, beer and wine. It's not the same old local beers and run of the mill cocktails. Lots of creativity.   The food menu is pretty wild and there are a lot of things I'd never expect to find in Charlotte. The Reuben Tartare was great. The serving was pretty small for the cost but it was expected and as far as quality goes, you certainly get what you pay for.  Ambience of the upstairs lounge area is great and should be very popular.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1zCJEaKbhINP5Ssb8Hut0g"
  },
  "UUVU4ORS6-M52tVGExLTkQ": {
    "date": "8/18/2017",
    "text": "Amazing ginger salad! Also, half off Rose ;) Had my dog with me and they brought out a water bowl for him. Matt was very attentive. Monday's are half off of bottles of wine so I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BXnHcMDyb5j0zRmdFz_15g"
  },
  "6IftA4x41fnwBW4zllFqWQ": {
    "date": "1/21/2018",
    "text": "Went here during Queens Feast with a group. Waited over 2 hours for our food and it was not even crowded. Food was a disappointment. Lack of communication between our waiter and servers....didn't know who ordered what based on where we sat.  However,  they were polite and apologized for delay.  Regardless, not returning here. Don't know how they got a Zagat award.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sbgjfI2SLTIwUiRZGW_8ZQ"
  },
  "Ywq0H50XfNxPderHHqliUA": {
    "date": "5/27/2018",
    "text": "Worst restaurant in charlotte. Ruined my 39th birthday. I can't believe restaurants like this can stay in business in a thriving city. Please do not even waste your time. Food is ok when it arrive but will take over an hour to get. Short staffed and not horribly trained.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BY0q3h7P2UfT3PKSzGpvjw"
  },
  "6RZ-4LZEwFKgfl5thco99Q": {
    "date": "10/25/2017",
    "text": "One of the best Sunday brunches that I have had in Charlotte. Started with large delicious Mimosas in a couple of choices of flavors. Then they had actual shredded hashbrowns with a variety of choices of Add in's. I added both smothered onions and ham hock and it was delicious. Others in my party ordered different dishes and everyone was extremely happy with theirs. Looking forward to coming back to try lunch and dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zPs149VxF0Sv1W7nXvvArA"
  },
  "n5O37sPgUXxR6DaMaGduNQ": {
    "date": "6/8/2018",
    "text": "I'll start with positive; The service was excellent. The cocktail was delicious. However, our meals were disappointing. We came here for a special night out due to hype and it being close to where we live. We didn't feel like it was bad, but definitely felt we paid a lot for mediocre. What I ordered was all fried and not indicated it would be on menu, I checked online after and it was on an old menu there but They must've updated the menu and didn't add \"tempura\" on the new version. My fiance also got the pad Thai which was mediocre too. I wouldn't say either of our meals were bad, but not what we wanted. We left with disappointment but also decided we may have just chose wrong menu items.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jI-k3A2khm1a2cYTOVXOTg"
  },
  "1pgurYukE2-FUgTEoq4hTQ": {
    "date": "8/5/2017",
    "text": "2 stars only because Jen the server was great. $24 for a fist full of ramen noodles is a joke.  Food took almost an hour. $10 for one quartered tomato sprinkled with feta cheese and called caprese is also a joke and $16 for three TINY lobster sliders that came on a roll that was hard as a rock and literally were painful to eat was the icing on the cake.  Place just opened and on Friday night at 9pm was completely empty and the food STILL took forever.  Will not be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dAiFpN4JZ1iHtFzXT6TLrA"
  },
  "k3PyXkjVF2yHIlvvEeBHjQ": {
    "date": "7/13/2017",
    "text": "Note: This was the first official opening night.  I was very optimistic about Loft & Cellar. Great use of the space, close to a lot of things uptown, good concept.  I brought my cousin and a friend who were in town. Overall, I thought it was a good experience but not a great experience...and honestly, something that may be a bit too much for Charlotte.  First, we were there an hour after they opened. They asked if we had reservations. They literally opened for the first time ever an hour ago. No, we did not, but the place was empty so there was no problem getting a table. The menu is setup so you can experience \"a movie or a play.\" Exposition - Rising Action - Crescendo - Resolution. Ok, I'm cool with that concept. But it's difficult to tell what everything is on the menu, even if you're somewhat of a foodie. Second...the drink menu is literally a book and the food menu is one page.  I had a pisco sour drink - which, admittedly, was delicious. They intend for that to be their signature drink and I believe it will be!  Our group ordered the Reuben Tartare (yummy but bread heavy), the Lomi Lomi (good but tasted of mayonnaise), beets bravas (not too bad...but still beets), Duck Brunswick Gyoza (the best dish of the evening!), Souther Pad Thai (bland bland bland), and the Pickey Eater with chicken (sufficient but expensive).  Overall, a good experience for their first night, but not a place I will return to for a lot of food options. If it is to be successful, it will be either more as a bar, or they will need to expand/broaden/simplify the food to make it more accessible to the non-foodies.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "B8FKS2jjTZ7xneWuadrH4w"
  },
  "K9T1cOyIRXlAviTPWICoqA": {
    "date": "8/30/2017",
    "text": "I guess it's only fair if I give this place a 2 because I actually didn't end up eating here.  My friends and I were very excited to try this little place out, but ended up leaving before ordering because the lighting was just so horrible!! The whole restaurant was very bright and not the kind of ambience you would think for a wine bar restaurant.  We were sat under extremely bright lights and all three agreed that it wasn't very pleasant.  Felt like being in a basketball stadium or office building instead of enjoying a nice glass of wine and dinner.  Excited to try this place out if they figure out how to dim the lights!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpGSWF8RtLhce7d83CfWCg"
  },
  "RQ1whaD2F4Mfwif6yNuRZw": {
    "date": "3/26/2018",
    "text": "Absolutely fabulous. We were a large group there last evening. We shared appetizers and then ordered mains. I can't say enough good things about all of it. I tasted so many wonderful things! I won't refer to any standout dishes because they were all amazing. Great service, too. Any of you who read my reviews know that I rarely give such accolades. Keep up the great work, Loft and Cellar!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qxYY0P8R4GRi3uyoMIJ6ew"
  },
  "tXDK17PQgoqz5fN0YHgXqQ": {
    "date": "8/2/2017",
    "text": "This place is amazing! Each and everything that we ordered was devine! We stopped in for lunch on a whim and were so pleasantly surprised. Large sandwiches. We tried the shrimp poboy,  lobster sandwich,  salmon pita and the homemade tamale, yum! We also shared ginger salad, capresi salad and a double order of their empanadas. All very good choices. A great place for something different and eclectic. Did I say yum?!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SjMfWr-Ivy5zHFZQrWMIDw"
  },
  "HlIihUec9Zlnmx_uT8PsLg": {
    "date": "7/8/2017",
    "text": "We were lucky enough to attend the soft opening. The beer menu is extensive. The specialty drink list is unique. We had four items off the tapas menu and we're delighted by each!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i7rm7RTA5X-rlZq_uH50ig"
  },
  "7upay_ReigfPFQUzcMR0mA": {
    "date": "3/24/2018",
    "text": "Terrible. First and only time eating there. Chicken Kiev was nothing but a well past done fried breast served on top of potato salad with a watery sauce. Wings were less than mediocre. Would not recommend in the slightest.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CLUTDfbWiYOn_cNfTpNywg"
  },
  "wUxJ4MZMEDaUVTevro7_Tw": {
    "date": "7/15/2017",
    "text": "Awesome drinks! wonderful ambiance! Outstanding service! All around classy place! I'll be dropping by often! Kudos and good luck! I",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UnQdADQcX9OgrCRwu0ZqRg",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UnQdADQcX9OgrCRwu0ZqRg/o.jpg"
      },
      {
        "img_id": "KZd87hTxxNzgv5d40rnAJQ",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KZd87hTxxNzgv5d40rnAJQ/o.jpg"
      }
    ],
    "user_id": "EtKbchwV7myfOxoT2xFVXA"
  },
  "GwFQOmThel_UkGWyo6cMSw": {
    "date": "10/15/2017",
    "text": "Went here on a Saturday night and we were one of two tables occupied in the restaurant. Service was awful being that the place was practically empty. Had to ask to have water glass refilled, no pepper was available and they had to get a little bowl of pepper-did not have pepper shaker or grinder? Our octopus appetizer was cold and very small. Entrees were decent, but a little pricey for the size. Only great thing were the drinks...but when I ordered a second they didn't have the ingredients(they had run out). Will not be going back here anytime soon. Also the manager was friendly but smelled like cigarette smoke at the end of the night when he was talking to us...not very professional.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TEUE9Wwh96TmX0KB7zOmVA"
  },
  "GaFpEqIsUbN-LtwA33cz9A": {
    "date": "12/24/2018",
    "text": "Made a reservation and was told to go upstairs(live music was being played downstairs). Waitress looked confused as to why we were sent upstairs. Someone came to apologize that we weren't made aware of the jazz event. We sat at the bar upstairs and shared the hoecakes. The hoecakes were delicious, but the service was subpar. Haven't decided if I want to give them another try. We shall see....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y3t7mKa5in7ATCecMslNzQ"
  },
  "6a6833lW9gru_GkVD0seUQ": {
    "date": "11/1/2017",
    "text": "This review is for the Bar area only.  I went here the other night, since it was a friend's birthday.  They work across the street, so apparently, they are \"regulars\".  I was a newbie.  The place itself is pretty cool.  Love the tan seats with dark blue walls...kind of cool hipster meets corporate, without being pretentious (this is a good thing).  It's also not too dark, so a great place to meet after work for dinner/drinks.  As for the drinks, they have a VERY extensive menu...seriously, something for everyone.  I couldn't decide on a wine, so the bartender asked what I like to drink and gave me a taste of a few options until I found one I liked.  Throughout the time we were there, he was constantly checking in on us to make sure we were good.  I really appreciate that, especially on a slower night when he could have completely chosen to just stand at the end of the bar and play on his phone until we flagged him down.  Great first experience.  I  would love to come back and try the food at some point!  Definitely recommend as an after-work spot.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "g4CEweu8TJo9NRvbtd4zEQ"
  },
  "mNGBswkJ3LWWqfs_jq_Mbg": {
    "date": "8/3/2018",
    "text": "Popped in to let the traffic die down after fanfest at the panther stadium. Ordered the calamari and veggie lumpia. They were both done very well and tasty!!   You get a great portion of calamari so pace yourself if you are ordering an entree. I couldn't make it past these two appetizers. I did order the skillet brownie to go. (Tired of not saving room for dessert!!) I will have to edit my post when I have a chance to taste it. The server says it's very decedent. If you have the chance slide by and visit the place after a game. There's a roof top area where you can take in all the sights and get some great shots of the skyline and the park.  Cool place to watch the fireworks after the Friday night Knights game.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CEzlyNdPA8Go0EZXxNwfDw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CEzlyNdPA8Go0EZXxNwfDw/o.jpg"
      }
    ],
    "user_id": "6FqCq3GJ-PEuEaFtVzGrUQ"
  },
  "uJZYG8NQl-nmPCI2L5ZeOg": {
    "date": "9/28/2017",
    "text": "I really enjoyed this place! So shocked when I walked upstairs and saw such a big, open space with sofas - bar - dining tables. Great attention to detail with charging ports at the bar! (I could mention other things but let me get to the food!) 2 thumbs up for everything! Really! It was sooo good I went back the next day for brunch. 1st time we order the sauteed mushrooms (a must); gourmet sliders; empanadas with an amazing red sauce that I put on everything; craft cocktails with knowledgeable staff and bartenders.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AQ1tDz1s0PzTpsQ_YosA2w",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Sausage egg biscuit",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AQ1tDz1s0PzTpsQ_YosA2w/o.jpg"
      },
      {
        "img_id": "kfmPkqem0uuLeTXI53eQ3A",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kfmPkqem0uuLeTXI53eQ3A/o.jpg"
      },
      {
        "img_id": "gQUh4Jbnf1yK8tgAFU5CbA",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Mimosa 10oz",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gQUh4Jbnf1yK8tgAFU5CbA/o.jpg"
      }
    ],
    "user_id": "GLge1JexYxqP-00QQMhM0g"
  },
  "cfgoxzX5G0wgPHpSmLSP3A": {
    "date": "6/24/2018",
    "text": "1) AC is out (\"because it was replaced but service provider didn't put freon in\")... Um, call an emergency service! It's too hot for this.  2) Did not put our order in correctly and we had to inquire almost an hour later. They then rushed it and gave a significant discount and a few free drinks. Still, the food wasn't worth the wait. 3) Service was very friendly overall, but disorganized and very slow. Not professional. Our particular waitress wasn't very good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVOjp8ut4_GQyC70z1JPCQ"
  },
  "r2KunUl4jPB7y-9u00hLQg": {
    "date": "3/7/2018",
    "text": "I made a reservation here for my birthday dinner. When I initially called I didn't know I was speaking with the owner at the time. He promised the best table in the house in front of the window. I got a text message to confirm the reservation and I was able to relax. When I got there, as promised, we had the best table in the house. The waiter Clayton was really nice and accommodating as the rest of my party arrived.  The place is really nice and the upstairs is huge. Okay on to the food, since it was a big party and my birthday,  I was able to sample a little of everything. The wings were cooked perfectly, I had that as an app. I ordered the lamb and tres potatoes. I also sampled the crab cakes.  The lamb was so good. Possibly the best lamb shank I ever tasted. I was at intrigued by the tres potatoes from the description but it was amazing. 3 types of potatoes in 1! You cant go wrong with that order. During dinner the owner came by the table and introduced himself as the guy I spoke with on the phone. He even took a few pictures for us! Everyone here was so personable and nice. I will definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AIMT2Ezf7k3YSjJdYCkl8w",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Lamb shank and tres potatoes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AIMT2Ezf7k3YSjJdYCkl8w/o.jpg"
      },
      {
        "img_id": "QYqmhCsp7gFKm-M4kAYEow",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Tres potatoes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QYqmhCsp7gFKm-M4kAYEow/o.jpg"
      },
      {
        "img_id": "be2o0INLc-gzJ-Rp9xRWgA",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Full party at the best table in the house",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/be2o0INLc-gzJ-Rp9xRWgA/o.jpg"
      }
    ],
    "user_id": "k9pA-xp_9pg6xu_eFYwYig"
  },
  "QjuRJ-gtRaw8dAdSSBoXsg": {
    "date": "8/8/2017",
    "text": "I hope this place stays in business because the food is amazing and the drinks are divine. I went for cocktails the first time I came and definitely put it on my list for food, which I did this past weekend.  This is the only place that I can think of that serves and has pisco on their menu. Their pisco sour is divine and tasty, with homemade sour mix and a generous pour of pisco. I also tried their Valpariso Rain but the pisco sour is definitely the better choice.  As for food, the menu has changed. Instead of the theatre-like style, it's simpler and on half a sheet, with sections for small plates, bowls, greens, ala carte, and sides, along with the chef's tasting menu. The \"picky eater\" item is the most hilarious thing on the menu because it's just so out of place from the other menu items, although I'm sure that if you ordered that, it would taste just as good as everything else (it's just chicken with salt and pepper.) My boyfriend and I shared the duck gyoza as a starter -- yes the portion was pretty small at first glance but as a starter it was a perfect size and tasted quite rich with the duck stuffed generously in each gyoza.  The Iberico pork loin and the Wagyu deckle were both quite rich and flavorful and perfectly portioned. If you're looking for large portions then this is not the place for you. I couldn't eat more of the deckle -- it was rich with an amazing ponzu-style sauce on the side. The pork loin was cooked perfectly and with the sauce at the bottom was delectable.  Dessert? Yeah, that cotton cheesecake was amazing with the matcha topping and the ice cream on top. Also, they serve cotton cheesecake. That's pretty damn cool.  As for service, it was spectacular. Our dishes came out a bit late because of a mistake the kitchen made (the meat was over cooked when they cut into it), and not only did a manager come out to apologize profusely, the executive chef came out and apologized profusely and explained what had happened. My boyfriend and I didn't mind the wait at all, but it was above and beyond what I expected from a restaurant and we appreciated it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jG7ChjDvMEJjyosyrtD6Lg",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Wagyu deckle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jG7ChjDvMEJjyosyrtD6Lg/o.jpg"
      },
      {
        "img_id": "yqAlVFl8P0o1nzHpRqXfgw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Duck Brunswick gyoza &amp;amp; Desert Wynd",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yqAlVFl8P0o1nzHpRqXfgw/o.jpg"
      },
      {
        "img_id": "wcBrsJqkTM1lPAUKPuyifA",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Pisco sour.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wcBrsJqkTM1lPAUKPuyifA/o.jpg"
      }
    ],
    "user_id": "QjeTzTWHRgCL3LM71_EHUQ"
  },
  "xJFkY4HlMdvg5UN6NWz16Q": {
    "date": "1/25/2018",
    "text": "This review is for the bar only as I have not had a chance to try any of the items in their menu. My boyfriend and I went there before dinner for a few drinks and had an amazing time. The bartender Salim is professional, friendly and had a great attitude! I was very impressed with his Old Fashioned - I will say that is the best I have EVER had. We ended up leaving for dinner and coming back two hours later with friends because I could not stop bragging about my overall experience. Thanks for the excellent service and my new favorite drink in NC!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RwZTyb_GRmF3725c0lDi2g",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RwZTyb_GRmF3725c0lDi2g/o.jpg"
      }
    ],
    "user_id": "mPSA7Qnn0f8QTVGN5m9f9g"
  },
  "IvWCKxz4R7BntcGrIjJY9A": {
    "date": "2/22/2018",
    "text": "Really nice venue. The loft is nice and spacious. Clean bar and bathroom.  Full menu was a bit pricey. I tried the Shrimp empanada. It was really good. I would visit again for happy hour but not dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Lr6W7gCA97sSVWuIZGcB5Q",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Lr6W7gCA97sSVWuIZGcB5Q/o.jpg"
      }
    ],
    "user_id": "l4YJ7QZ0ICZMVpkAEP5_mQ"
  },
  "n0p-7oiaIijjlhtI1kqpcw": {
    "date": "9/1/2018",
    "text": "Great place, eventhough owner is WVU fan, he took us Tenn fans in and we had a great time. Flatbreads were awesome and service first class. Go Vols and we will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gR3HrmSoNVz9dk60UF6U2Q"
  },
  "4PNUNJIbixXlkLGO3UacXw": {
    "date": "1/16/2018",
    "text": "I have been to this place twice now. The staff is always great and very welcoming. The 2 times that I've been I've tried the staff's recommendations for the menu, I have yet to be disappointed. The Southern pad Thai is a favorite dish. Defintely recommend it for all to try. The lobster roll appetizer mouth watering.  This place has live music on certain nights. If you ever have a chance to go upstairs you won't be disappointed at the view and the nice little lounge space that they have.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2h4FD8zytF4uxjH55dViw"
  },
  "K4lnXH_M1ZvhiE0R-j5Hcg": {
    "date": "8/4/2018",
    "text": "We were here with a group and got to do a whole tasting menu ranging from Calamari to Flatbreads to Sushi to Entrees to Dessert. When we first showed up, the place seemed fairly empty for a Friday night, but didn't let that get to us as it was \"new\". We ordered our drinks and awaited our first bout of food to come on the tasting menu. Drinks came out and we quickly learned that the bartender makes his own syrup (including mint syrup to replace the mint leaves in a mojito) causing some unexpected flavors. In a nutshell, food was great. Only not so great items were probably the desserts and the sushi isn't like you're at a sushi restaurant so it seems out of place. The staff was eager to please and try to get us to come back and spread the word, but I'm not sure if it would be a top choice to go back to in the city.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvvYtGLHYpjjaY7IpbkCOQ"
  },
  "BkGiPQC9j46LZnYNHvnsDA": {
    "date": "8/8/2018",
    "text": "The chef Chef here features authentic Peruvian food and drink. Their Pisco Sour has got to be one of best cocktails in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4KWyhXM3rdXeRtlSg8cB8w"
  },
  "zE6qiNbjfiyZk3tXw4t9JA": {
    "date": "7/13/2018",
    "text": "Maybe the worst service I've ever experienced? Not just from one or two of the staff, but the entire staff was terrible. The food was quite gross, not just bad, but literally gross (and cold). I had cod with what could've passed for cream of mushroom soup on top. The one bright spot...my cocktail tasted good, but took 30 minutes standing at the bar to get. The bartender only had two single orders ahead of mine. Terrible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FV5HiMtUf_-uSnHTFMN_vw"
  },
  "768dgc4RKI32at4qwgiaiA": {
    "date": "7/21/2017",
    "text": "This place cannot stay open long based on the experience we had tonight.   We were led upstairs where a gentleman who we would later learn was our server, Dylan, was complaining to someone else about something or another. We had to walk directly through their conversation in order to get to our table as Dylan and the person he was complaining to were positioned on either side of the stairway.   We were seated, and some person who was not our waiter came to the table and informed us that he was not our waiter. Thanks, guy. Our waiter did eventually show up after 5-10 minutes and gave us some water.   For drinks, a friend and I split the punch bowl for $24. Another friend ordered the chai tea cocktail, and my husband got sweet tea. My drink was okay, the chai was pretty good. My husband's sweet tea sat empty for an unreasonable amount of time given the prices this place charges.   We ordered the bento box as an appetizer. I ordered the southern pad Thai, husband ordered the picky eater, and a friend ordered the 3 oz steak as entrees. My pad Thai came out before the appetizer did. Then the appetizer came out. We waited a good while before the other entrees arrived. Whoever delivered the remaining entrees apologized for the wait but offered nothing for it.   My pad Thai was pretty good but the portion was tiny. I was still hungry after eating it. The 3 ounce steak reportedly tasted like a mixture of steak and jerky and was at least one third fat. My husbands meal was okay but nowhere near worth the $25 spent on it.   The music was too loud and weird. The view from the \"loft\" was nonexistent. The server was unable to split the $24 punch bowl drink between two people. How is this even possible? The drink is literally meant to be shared; how can you not split it? I was a server in what was possibly the worst sports bar ever in 2009 and we were able to split items between checks. Don't tell me that this place operating under the guise of \"fine dining\" can't do the same.   I will absolutely not return and will be surprised if this place stays open.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 10,
      "cool": 0
    },
    "photos": [],
    "user_id": "oUilYNfXensjapTI_s7cOQ"
  },
  "0H2MT1pyUDS9JZAi1WRV-A": {
    "date": "10/9/2017",
    "text": "I attended a birthday dinner here on a Saturday evning & we practically had the entire downstairs to ourselves! I ordered the Nacho Fries & a Cheese empanada w/ powdered sugar!  I'm a picky eater & those nacho fries were great, so much flavor & who wouldnt love fries, queso, & pulled bbq chicken w/ spicy salsa?  My drink, El Presidente, was so strong it took me straight back to Havana.  This was a very cute spot & perfect for a date night.   The music had me grooving! There is a parking lot right behind the resturant & it cost us $7. I would definitely return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fF3lYkGh_nfIY68yciKlGw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Nacho Fries &amp;amp; a Fried Cheese Empanada!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fF3lYkGh_nfIY68yciKlGw/o.jpg"
      }
    ],
    "user_id": "BngwIY5RjUNHxzqVvx8Agw"
  },
  "RbgKtqHhpw-llFWz5dQLKw": {
    "date": "4/22/2018",
    "text": "Ambience was laid back.We had the pleasure of meeting the owner and executive chef. We started with a mimosa , followed by various brunch small plates. The crab Benedict was delicious. I substituted the poached egg for egg whites. The fried rice curry was Amazing! Overall, the service was great and the food was fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WT7virqU32aE_mUbi4SrTg"
  },
  "cGgMDC7JI0dypKaEinGimg": {
    "date": "8/5/2017",
    "text": "I don't know if I have seen a more adventurous menu than this one. Every plate was an utter victory. The mussels. The octopus. The ginger salad. Then the Merluza?!  Follow the chef's advice and get the side of sweet potatoes and beets and put it in the broth. You're welcome.   It's simple. If you're adventurous, then you will find a lot of opportunities to be happy, here. If you are not, then stick to Chilies and stay away from this joint. But let's put it this way, if you don't like it then we can't be friends. The service is amazing, too, BTW.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "i9gyfRo9aycpx4v-q19D3w"
  },
  "w7xdpkzVuKMDp0R_tEi3sw": {
    "date": "7/15/2017",
    "text": "SHARING IS NOT CARING! They bill this as a \"sharing\" style restaurant which usually means you're going to spend a lot of cash for tid bits of food. And in this case, they took that meaning with gusto! $12 for 3 dumplings. $17 for 5 sushi chips. The only redeeming thing from this visit was the Chai Tea cocktail and the laugh we had at how much money we spent to still be just as hungry as when we walked in! Service was fine for the 10 minutes we were there.   I'm reminded of the law of diminishing returns. Even if something tastes really great, at a certain point when the price gets too high, it doesn't matter; it's not worth the return. This cannot last long this way. If I come back, it'll just be for the drinks.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cOjpCHdQSutN6nAVxFe0sA",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. This is where you get your &amp;#34;view&amp;#34; of Romare Bearden park.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cOjpCHdQSutN6nAVxFe0sA/o.jpg"
      },
      {
        "img_id": "TEFc468h9DBf0ugAVvHMVw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. I like that there are outlets along the bar.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TEFc468h9DBf0ugAVvHMVw/o.jpg"
      },
      {
        "img_id": "QLJIjIZhG4G3v11FrxzTlw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. THIS is awesome! Chai Tea cocktail",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QLJIjIZhG4G3v11FrxzTlw/o.jpg"
      }
    ],
    "user_id": "wWxPbWWaKBIdxDUZuHST_w"
  },
  "XFLZ6Pn9eCgofDnzKn7qzQ": {
    "date": "8/2/2017",
    "text": "Full disclosure, I met Chef Nick while dining at Wooden Vine several years ago.  In that moment my wife and I were amazed at the talent within this chef that we've yet seen in Charlotte or otherwise local.  We were able to grab dinner here during its first week of being open and what a delight it was.  The menu is nearly the most adventurous you'll find anywhere within the area.  Tiger milk? Yes.  Butter beer?  Yes.  The entire menu is full of some of the most intricate and detailed compilation of culinary treats I've ever seen.  You'd likely have to come 4-5 times to enjoy it all (or be really hungry).  The interior is split into 3 levels (cellar to open later).  Main dining area is open and inviting from the street and the upper level lends a bit more coziness and laid back lounge style space.  The wait staff was ultra attentive and quick to explain the menu as needed.  Parking is easy with multiple parking decks around and a surface lot adjacent to the space.    Do yourself a favor and go try this unique and never before seen style menu in Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "rYabwujxvthUNOmAuyWN6g": {
    "date": "5/18/2019",
    "text": "Went here for a date night one Friday night and this place did not disappoint!  First of all the atmosphere. It's very chill and relaxed yet upscale. We decided to have dinner at the bar and stay for the jazz show. The best thing about sitting at the bar is watching the bartender do his thing! What a delight to see his craft at work. So many great drink options that surely did not disappoint. Now the food! I never thought chicken skin as an appetizer would be a thing, but let me tell you, IT IS! What a different yet familiar dish that will have you feeling like you're eating your grandmothers Sunday fried chicken. For my entree I got the lamb pasta which was full of so much flavor! Everything complimented each other so well! For desert we decided on The bluegrass! I'm not a big chocolate person but the way that mousse and that walnut pie tasted together has me still craving it. All and all it was a wonderful night and I look forward to coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DQ6qOC8F56nwqzq-NQMiDA",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Lamb pasta",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DQ6qOC8F56nwqzq-NQMiDA/o.jpg"
      },
      {
        "img_id": "4q5rPYznMs37CWbaGkT_XA",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Chicken skins",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4q5rPYznMs37CWbaGkT_XA/o.jpg"
      },
      {
        "img_id": "reedzwXuAfD5wikBCquybw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. The bluegrass",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/reedzwXuAfD5wikBCquybw/o.jpg"
      }
    ],
    "user_id": "SGTH6vBZibuM6FmzTFiqHw"
  },
  "zAXFefffmQISXqgnEo3Fhg": {
    "date": "4/2/2019",
    "text": "I very much enjoy my visit. I'd love the music playlist; contributes  to the relaxed setting. It's instrumental so you  can still have a conversation with your friends   The menu is really different and ecletic and i absolutely love it. It challenges you to try different flavor combinations you otherwise wouldnt order or try.  My favorite are the Chesapeake  deviled eggs and the sweet potato chess pie.  We opted for the spring menu 3-course special for  $35 including appetizers  entree and dessert.  Crystal was our server and she was very attentive and personable.   Yashira gave us in depth details about each food options and how the flavors  compliment and contrast each other. If i didnt have an appreciate for culinary before I definitely do now.   They have local brews from Lenny Boy on tap and plenty of unique cocktial and wine options.   Definitely  recommend  and definitely will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vpezpsciq_3WFCCbPpelmQ",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. upstairs loft bar and dancefloor",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vpezpsciq_3WFCCbPpelmQ/o.jpg"
      },
      {
        "img_id": "42iZ0ruwxDK9xzZtyOXOPg",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. up stairs loft section",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/42iZ0ruwxDK9xzZtyOXOPg/o.jpg"
      },
      {
        "img_id": "aGQV-422q6St6WM3Ccx9OQ",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Sweet Potato Cheese Pie",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aGQV-422q6St6WM3Ccx9OQ/o.jpg"
      }
    ],
    "user_id": "7gg29jxOEulX5m6f1mWaqA"
  },
  "BmoFdMN8Cy2NgZYbklujTw": {
    "date": "7/28/2019",
    "text": "The cook quit. So there no food to order. The drinks prices are high. They give you shot glass size  mix cocktail for $12. It's fill with  more ice than liquor. Wine is also $14 and selection is 6 bottles of medium dry. Shots are $14 . pregame before coming here. DJ had the crowd moving and scene was lit. We had a good time beside the drinks tooooooo high and no Cook.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Qa2vQ6p_15L_0BP8vaDthw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. They currently have no Cook. I came early to eat then par take in the night event. My bff and i are furious right now.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Qa2vQ6p_15L_0BP8vaDthw/o.jpg"
      }
    ],
    "user_id": "6J1qrfD7XSfccAHOfWyevQ"
  },
  "uikz6CwCw5vahohbF54crA": {
    "date": "4/30/2019",
    "text": "Beautiful uptown location...I think it is a hidden gem. A friend and I went on a Monday evening. After work specials are offered. The staff were personable, knowledgable, and attentive. We tried a variety of dishes that did not disapoint. My favorites were the deviled eggs and braised short rib. The deviled eggs had just the right heat and sweetness. Yummy! The braised short ribs were prepared perfectly. This restaurant appears progressive and provides a variety of items on their menu because the menu is updated often.  Loft & Cellar also offers a great cocktail menu. We did not order drinks because we are dieting however they had half off on bottles of wine. Check their social media to review daily specials. I plan to return to Loft & Cellar",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mgs-_pZ1rWAxXQd_PdrF5A",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. My favorites were the deviled eggs and braised short rib",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mgs-_pZ1rWAxXQd_PdrF5A/o.jpg"
      },
      {
        "img_id": "aIG1Y8VG-hZip8F-Sxv-lg",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Deviled Eggs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aIG1Y8VG-hZip8F-Sxv-lg/o.jpg"
      }
    ],
    "user_id": "DcW2TdfyN2kVNpIGQYMAvQ"
  },
  "vIC1C4U0Rwb4gMrJfO5TAQ": {
    "date": "6/29/2019",
    "text": "I love the music, Buffbone Jazz Dillard. He was AWESOME!  Don't come hunry. I didn't like food at all and drinks were terrible",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PO6UGRKqGaTB4she2uTimA",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Jazz player Buff Dillard, the best jazz player. He was AWESOME!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PO6UGRKqGaTB4she2uTimA/o.jpg"
      }
    ],
    "user_id": "2Vd-aDoEtnLKPp6uzEugbg"
  },
  "62DtGOOPmXasyFtqnwozsw": {
    "date": "5/20/2019",
    "text": "I was so disappointed! I was so excited to visit this restaurant after I heard a couple positive reviews, but my experience wasn't great. Our waitress, who was very kind, just wasn't great. She didn't know the menu, didn't know drinks, and brought us some wrong items. The bar was out of a few things we asked for, and so was the kitchen. To top it all off, the whole place was dead on a Friday night. Not exactly the atmosphere you'd expect for a trendy Uptown spot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TSiGRNZpxT4ivk2QS5romw"
  },
  "GHBSx09DOcFmxuChM2pdIg": {
    "date": "8/21/2018",
    "text": "Visited Loft & Cellar for the first time . I didn't have the opportunity to sample the menu, but I had an excellent Pinot Grigio , which happened to the the wine of the day.   I attended a 'paint-and-sip' event , put together by a separate entity , that took place at @ Loft & Cellar.   The first floor and second floor are usually meant for dining, but the second floor was used for the event.   It truly is a spacious loft with a full bar and lounge area near a large window with a view of some of downtown .   I could definitely see someone renting this space out for more events like paint and sip, as well as an engagement dinner , birthday dinner, etc .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v2Pma3OFtYo4_Ai1J6Tjtg",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Wine &amp;amp; Sip Event @ Loft &amp;amp; Cellar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v2Pma3OFtYo4_Ai1J6Tjtg/o.jpg"
      },
      {
        "img_id": "VKd6hDR2xfg0gZ6t39gjIw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Wine and Sip Event @ Loft &amp;amp; Cellar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VKd6hDR2xfg0gZ6t39gjIw/o.jpg"
      }
    ],
    "user_id": "8XJ7DpZhQrzxNIJDRShf5A"
  },
  "h-HYGYYTGSqESWYimqgGvQ": {
    "date": "3/14/2018",
    "text": "I came here to celebrate a friend's birthday dinner. I was very pleased with the service and the food.   The setup is really nice, they have a few tables downstairs and one directly in front of the window (excellent for people watching) and a huge space upstairs. They were actually hosting another event that night so we got a chance to see the dj setup and the open floor plan and bar area. If you're looking for a cute spot to host an event...check them out.   The food was delicious. I ordered the wings and the tres potatoes. The wings are SO good. They have just the right amount of spice and flavor and they are so tender! My compliments to the chef. The tres potatoes is so interesting. Its three potatoes in one! I absolutely recommend!   I also had a chance to sample the crab cakes, and the lamb dish. All were excellent. This is definitely a cool place to check out if you're looking to try something new!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Gg3j5rwpyUXgrEJLubSAOQ",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Margarita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gg3j5rwpyUXgrEJLubSAOQ/o.jpg"
      },
      {
        "img_id": "_il804LiiC2tkzhPiT-YLQ",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Lamb",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_il804LiiC2tkzhPiT-YLQ/o.jpg"
      },
      {
        "img_id": "7SjDivKCNAdC4BUZknyGbQ",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Maryland style crab cakes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7SjDivKCNAdC4BUZknyGbQ/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "jvVMf9shMzoX-j3RPQ7T8A": {
    "date": "1/29/2018",
    "text": "Well you've done it, you've broken my Palette! Crab Stick Bruschetta.... My God, where did this idea even come from?? Pickled Watermelon, Avacado Toast, Gin Aioli... Every bite, every morsel, just a masterpiece....  ...oh yeah, this review is about the Loft and Cellar by the way! Sorry about that, it was just such a mesmerizing experience that I had to start it off like that. Chef Nick has taken ideas from every corner of the globe and forged it into an approachable yet elegant product. Located right off 4th street, West from Tryon is the intimate restaurant. My good friend Vic the Chili Man told me about this place as he's friends with the Chef-Owner. If I've learned anything from Vic, it's that someone who makes incredible food most likely knows where to find some more as well! Me and Kristen visited during Restaurant Week while they were at double capacity and they still blew us away! The upstairs is typically just for drinks and entertaining but they opened it up for the volume.  The menu is, adventurous to say the least. My advice would be to take all your culinary prejudices, taboos, and no-no's, put 'em in a box for the night, and trust in Chef Nick's incredible talent. I honestly can't wait to return so I can try some things I never thought I'd want!   So I've already gone over the starter/mind-bending dish that is the Bruschetta, let's talk about the main course: Me and the girl both ordered the Beef Matambre, which was a flank steak rolled up like a pinwheel, stuffed with chimichuri and served with Farro. This was the highlight entree of Queen's Feast for me. Rich, harmonious ingredients brought together with an amazing compound butter. Breathe... Just breathe and enjoy, Chris! When it first came out I was hoping the portion would be bigger, but bite after bite I realized what a gem this was and would have paid even more for less (but don't tell them that)!   I should also note that along with the restaurant week menu we also got the tempura bento box with assorted vegetables that was fried to perfection. Did you know that beets are awesome Tempura Fried? I sure didn't! Incredible addition with a small price that's perfect to accompany the three course menu.  A quick note on service: Impeccable! The entire staff went above and beyond to ensure their Queen's Feast week went perfect and Sam the Manager came by our table twice. I typically don't remember manager's names but this was different because he actually had passion about the food they were serving, instead of the oh-so-typical \"How was your meal?\" followed by a dashing shuffle to the next table. Well done guys!  I'll call ahead next time so y'all can make me a platter of that Bruschetta. If there was any negative to this review it's that the bar is now set in the clouds for every other restaurant in Uptown. And to that I say \"Good luck, everyone else!\"",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Yh-_fhB27diJjp6d83T-ew",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Butter beer Mule. I could get trashed on this.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Yh-_fhB27diJjp6d83T-ew/o.jpg"
      },
      {
        "img_id": "0cgAEkeg_Y7GIUa1W5zpeg",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Trophies for the Dog Day Afternoon, one for weenies and one for Tater Tot dipping sauce!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0cgAEkeg_Y7GIUa1W5zpeg/o.jpg"
      },
      {
        "img_id": "Xt6W7DDaxNuZzy8oMDdrQw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Dog Day Afternoon at the Loft &amp;amp; Cellar. Hot Dog Contest!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Xt6W7DDaxNuZzy8oMDdrQw/o.jpg"
      }
    ],
    "user_id": "dpzAqLprtex54rXlCU-OTA"
  },
  "AOIioBA3JRhunmUyZpif8A": {
    "date": "6/20/2019",
    "text": "Jerry gives big pours at the bar and is hands down one of the most interesting people I've met. Come here for drinks and bites with your friend and get to know the man behind this fun uptown spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FtLluAm4Z8CytDHIIRparg"
  },
  "3j11Kqram9DEsLpsLEKm0g": {
    "date": "1/20/2019",
    "text": "I'm a fan of the chef here and have been trying to catch the brunch here before he leaves to open his own restaurant and I finally made it over on a Saturday.  I was so very excited and already had my mind set on what I wanted to order but sadly a few things were not available.  They have a $25 3 course menu for brunch and I ended up ordering the hoe cakes with ham hock jam and sorghum butter........I can't even explain how amazing this was.....ham hock jam?!  Man it was everything.  I ate every bit of it and next my fish and grits came out which was salmon cakes as the fish and it was equally mouth watering but I wanted to save room for my dessert so I didn't finish it.  As the waiter placed my 'sweet potato bread pudding' in front of me I was twisted because it looked like pie?  Then he said we don't have the bread pudding today and I was heart broken.....everything was perfect but I wanted the breading pudding not cold pie.  Welp, I guess I will have to return to get the ending I was expecting but the music, food and service was great, and the pineapple mimosa was good.  I'm not sure who the new chef will be, but I'm hoping the food remains the same.",
    "rating": 4,
    "rated": {
      "funny": 15,
      "useful": 22,
      "cool": 21
    },
    "photos": [
      {
        "img_id": "PRZ7QOEhIvlT7pCFX7LYKw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Pineapple mimosa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PRZ7QOEhIvlT7pCFX7LYKw/o.jpg"
      },
      {
        "img_id": "Qg3B4TqfYBKDDvzMLvcyyA",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Hoe cakes with ham hock jam and sorghum butter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Qg3B4TqfYBKDDvzMLvcyyA/o.jpg"
      },
      {
        "img_id": "wHl48t2A71g1bGvN0CkGbA",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Fish and grits(salmon cakes)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wHl48t2A71g1bGvN0CkGbA/o.jpg"
      }
    ],
    "user_id": "9IRuYmy5YmhtNQ6ei1p-uQ"
  },
  "qme3SW3Fpftu1Is88xXH0Q": {
    "date": "10/29/2018",
    "text": "We have been following Chef Greg Collier in all of his food ventures. He is now taking his talents to Loft & Cellar. My cocktail was well crafted. Scallops seared to perfection. They offer 2 portion sizes. Bring your appetite and a few friends to try the whole menu. I heard brunch was superb, stay tuned for updates on their weekend menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x2Pdu40ztxbUl-SqZkmerA",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Cellar Hooch",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x2Pdu40ztxbUl-SqZkmerA/o.jpg"
      },
      {
        "img_id": "kQrLosGVZKYFJoLsTcVuhw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Duck &amp;amp; Dumplings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kQrLosGVZKYFJoLsTcVuhw/o.jpg"
      },
      {
        "img_id": "7cnGfXHf47gSaWgPMAT2kw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Bartender&amp;#39;s Surprise",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7cnGfXHf47gSaWgPMAT2kw/o.jpg"
      }
    ],
    "user_id": "gy2cx-_VqDhgSIiIYIYQ7A"
  },
  "YQFHwKQmTvljlJFZTolu_A": {
    "date": "1/14/2018",
    "text": "Finally made it to this location just a block from me.  It's been on my list a while, but first it was too expensive for one friend to go, then the menu got weird, and then the weather was bad.  But this time it worked out (ok, the weather was still bad, but we went anyway).  We arrived for a slightly late dinner on a Thursday evening, were told we could sit at the bar or a table.  The tables are either along a single long booth with chairs on the opposite end, or are high tables.  We opted for the booth/chair option.  The drink menu is extensive, but the food menu is moderate.  We ordered a handful of small shareable plates, and one bowl, still to share.  The small plates were... honestly not that great.  The duck dumplings (a steamed gyoza) were flavorful and the street corn garnish was nice.  The lobster rolls were a mistake, and the short ribs which were described as boneless by the server weren't boneless in any sense of the word (also dry, not moist or tender).  We did like the mussels, mostly the tomato based sauce.  We asked for additional bread to have more sauce--we were given two additional slices of break without extra charge.  I really did like the mushroom sugo bowl.  The noodles were clearly homemade in that they were inconsistent thickness.  The noodles were a bit too dense for my preference, but I love mushrooms and the burnt pork ends did give it a nice well-rounded flavor.  So I tunneled for those.  I had the barbie doll cocktail, based on the recommendation from the server that this drink had a lot of mint.  It didn't.  It had maybe two whole mint leaves in it.  I was sad.  We weren't given an empanada menu, which is also sad, because I'm sure I would have ordered several.  I liked the ambiance of the place and the server, bless her heart, was clearly trying.  I understand what they're going for, it just didn't feel like a $120 experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "eqtEDyqn1kCXwlo2OKdW_Q"
  },
  "6k1UdKaJkTgiH9l3bq6xOg": {
    "date": "6/16/2018",
    "text": "I came here on a Thursday night and it was pretty much empty - my boyfriend and I almost left. I'm so glad we didn't. Our waiter Michael was amazing. He picked our appetizer, wonton crisp \"nachos\" with tobiko and crema, and it was the best appetizer I've ever had. No joke, this was INCREDIBLE. Our entrees were also great. It's a bit pricey but absolutely worth the money for the quality and flavor of the food. This is a gem of a restaurant and I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "K1ZATo_HjeJaVkqELpi1vQ",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K1ZATo_HjeJaVkqELpi1vQ/o.jpg"
      }
    ],
    "user_id": "e0JXm2TuFoD0ykiFSUgg4w"
  },
  "JAvAgiQ8aKcqZ6H9DtNvgg": {
    "date": "11/24/2017",
    "text": "Loft and Cellar reminds me of an uptown or underground bar/lounge in New York City Vibe. Our bartender Hannah was the best, she gave us a little history of the restaurant and the cook and how it all started.We came here fairly early so we didn't get to sit in the other parts of this place like the actual loft was closed upstairs and the cellar was still in the process of being built but Hannah was nice enough to take us around and show us the rest of the Loft and Cellar, this place actually used to be an old stomping ground called the V Lounge me and my friend used to go to all the time in our clubbing days lol.   Wings/fries and fried cheese empananda is what i ordered and might i say not only was the food dynamite ,the execution of the presentation of the food i loved... Including the drinks i had something called the Pisco sour this drink had my taste buds in party mode i couldn't get enough of it my friend had a drink called Barbie doll which she loved as well but she eventually on her second round ordered the pisco sour as well i have to go back just for the drinks if not anything else. It was cool how when she makes the drinks she used props like a colored spritzer bottle to add the toppings on our drinks it added a nice unique twist to it. Will definetly come back here had a great experience with great people and food and drinks!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "152X78thbtJiku54uXy2nw",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Lunch menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/152X78thbtJiku54uXy2nw/o.jpg"
      },
      {
        "img_id": "o5ednBB-cK3w5RQeOvn7Bg",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. wings/fries and fried empananda",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o5ednBB-cK3w5RQeOvn7Bg/o.jpg"
      },
      {
        "img_id": "j9ZkzsmgcwChslg2-K0ZBQ",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/j9ZkzsmgcwChslg2-K0ZBQ/o.jpg"
      }
    ],
    "user_id": "NVVknS1I51z8wY5NNrJ6vQ"
  },
  "Itn08NFjdqimjJr4C2skQw": {
    "date": "2/23/2019",
    "text": "This place was amazing. They put together a 6 course pairing menu for a small group of us to celebrate my husbands birthday. The chefs came out for each course and talked us through their thinking for the dish and their components. The food was delicious upscale southern food. Loved everything about our dinner. Check out some of our pics!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n-D3BufRT2Qv8hpBHBvXQQ",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Sweet potato and kale soup with mini grilled cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n-D3BufRT2Qv8hpBHBvXQQ/o.jpg"
      },
      {
        "img_id": "3qw0mBH3D1ILcvRVP3su2w",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Shrimp tarting on toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3qw0mBH3D1ILcvRVP3su2w/o.jpg"
      },
      {
        "img_id": "93BQf78qHUGWwM0IBbTi6g",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Duck confit on a butternut squash hoe cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/93BQf78qHUGWwM0IBbTi6g/o.jpg"
      }
    ],
    "user_id": "HmyYPLYHwqyeJ7soVd96ig"
  },
  "C9KpF-og3MqyOjNbvCxnPw": {
    "date": "11/17/2018",
    "text": "The food is here is usually amazing, don't order the $18 scallops however. I was full of anger after ordering takeout, mainly I was anything but full!  What a rip off!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "89rMnip7Pnu2MHDJm0DokA",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/89rMnip7Pnu2MHDJm0DokA/o.jpg"
      }
    ],
    "user_id": "mMcD-Sy10i-PYkW2u7uQsA"
  },
  "r_gd2bO05vbBzRPIJacJGA": {
    "date": "8/28/2018",
    "text": "Try somewhere else  I have been three times.  Previous two times they couldn't cook a steak to correct temp.  The last time I was responsible for brining in a party of 8.  I ended up not eating while the other 7 finished their meals due to my medium well steak coming out well done.  About the time the other 7 were done with their meals my steak arrived.  Tonight we were walking past after dinner at another restaurant.  I wanted dessert and my husband wanted wine.  We sat at the bar.  The bartender ignored us.  The person that greeted us politely showed us to the bar and then went to check on what desserts they had.  He came back to tell the bartender.  Bartender told him to tell us himself.   After about 10 minutes and after no drinks were offered to my husband or I, we told the bartender to cancel the dessert that we were leaving.  We told him it would have been nice to be offered service.  He said fine to our leaving.    I have given this place too many opportunities.  We won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "iGGP0gxdJ42bDQuiVxXonQ"
  },
  "3MGW7LfsNfobVGXbxcbLfA": {
    "date": "7/15/2017",
    "text": "Loft and Cellar is a super cool concept, and it's executed well (bravo to the whole team for a pretty seamless 2nd day service!) but I'm not sure that The Lady and I will be picking Loft and Cellar for date night any time soon, and it's mostly because of price vs. serving size.  Okay, first thing's first: The building has 2 front doors (doesn't matter which one you pick!), and you walk into the main dining level. The upstairs (The Loft) also is full menu and bar service, but there's a lounge area and a stage for live music. The Cellar, which wasn't complete when we visited, will be reservation only and equipped with their full wine cellar as well as the chef's tasting menu only.  The space is really nice and open, with a long bar, benches, and plenty of seating between the top two levels.  We did have a reservation and were immediately seated and handed menus, as well as their tome of a drink menu (seriously, it's in a hardback book complete with like 4 pages of wine, and the first page containing their cocktails). The Lady ordered a Desert Wynd ($12), which was incredible. A tequila drink that had flavors of walnut and butterscotch and citrus and rosemary and it was just out of this world. I ordered the Pisco Sour ($9), which was also delicious. We'll definitely be back to try more, while hanging out in the Loft.  The dinner menu is broken up into 4 sections, and they'll bring out your food in the order they're listed. The menu is exotic, and even for a foodie you'll find yourself googling some of the ingredients. Don't be ashamed, the point is to try something new :) We ordered:  Exposition - Lomi Lomi ($17): Basically a wedge - shaped wonton topped with guacamole, and then a thin slice of fish is on top. Garnished with a small piece of pickled watermelon, an aioli, and some red caviar. This comes with 5 pieces, and is pretty light and relatively refreshing, although I wish that the guacamole had more substance to it. It was tasty.   Rising Action - Nacatamales ($12): One tamale split into two pieces, stuffed with indian spiced ground chicken. This was delicious, had a little spice to it, and man I wish there was more. This was like maybe 3 bites big if you stretch it out.   Resolution - U10 Scallops ($23): Two (yes, you read that, *2*) scallops in a bowl served with a wonderful leek and cheese sauce, with some pistachio brittle which added the much needed crunch to the dish. They are very large (U10 means that there are about 10 to a pound), but still.  Dessert - Halo Halo ($9): The dessert menu changes almost nightly, so I can't guarantee that you can get this, but basically it was a piece of awesome sponge cake, a lemon sorbet, and a red bean gelato accompanied with a condensed milk glaze. This was wonderful both in texture and in flavor.  Service was excellent the whole night, with multiple people checking on us, and when somebody didn't know the answer, they went and found somebody who did immediately. No opening pains here, we were well taken care of!  TL;DR: Okay, so bottom line, the food was good, but good GOD the prices for the portion you got? This whole meal was $82 for two people, and this was a super light dinner. I didn't expect small plates, but that's what Loft and Cellar is, and they are SMALL. I'm not sure that the quality of food, although imaginative and very good (and a lot of it is inaccessible in the rest of Charlotte, let alone most of America), is worth paying the price point. This will be a pricey night if you want to leave full.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "cb-UswhpVD4FoS2LkU1-xA",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Halo Halo!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cb-UswhpVD4FoS2LkU1-xA/o.jpg"
      },
      {
        "img_id": "8f32zGOyHc6Lh_pDDdK4Mg",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Tamales!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8f32zGOyHc6Lh_pDDdK4Mg/o.jpg"
      },
      {
        "img_id": "wBRxhtBuIE1VF_h_1VJgTQ",
        "caption": "Photo of Loft &amp; Cellar - Charlotte, NC, United States. Lomi lomi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wBRxhtBuIE1VF_h_1VJgTQ/o.jpg"
      }
    ],
    "user_id": "rSQITvDnm1smzJl-3LJz4Q"
  },
  "WkopiFcVZsGU4x-cPO8pPA": {
    "date": "12/28/2017",
    "text": "Single best tartare I have ever eaten, and I've had some great ones. An absolutely perfect rendition. You could just bring a bucket of it to the table and we would be good.  Ribs, okay. Sat a bit, clearly, good, not legendary. Lamb and mushroom sugo were both excellent and I would recommend them without hesitation to anybody.  They lose a point because the gyoza stunk. Hard, chewy casings like it wasn't cooked enough, not enough sauce to mask it. I otherwise fully endorse the place, rest of the meal was incredible and I would get it all again. Tartare, to repeat, is perfectly done.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nHE4uQoOwmQNstD2NddCkg"
  }
}