{
  "9b8jpzm6OiCMk2uWws8baQ": {
    "date": "8/21/2014",
    "text": "Ladies room dirty!!  stuff splashed or drips all over walls and walls in stalls, hasn't been cleaned in years and no where to hang your purse so your forced to put it on the dirty floor.  Service was pretty bad. Not enough staff to cover an almost full restaurant. Dirty tables.  Waited quite a while for everything.   Waiters looked like they were new and didn't have a clue, walking in circles, could not find the wine we wanted on their by the glass list?  got another one.   Rigatoni was just fair. chicken marsala was decent.    A bit expensive for this food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_IF9tnkSm-Xq7yCRynJ1cg"
  },
  "HWMiu7gVsF0OfRnZT81-DQ": {
    "date": "5/7/2013",
    "text": "About the only decent Italian place in South Charlotte, and well worth the effort. Great service when we last dined in the bar at a high top and the wine is not too badly priced. Try the pasta fajiole and the lasgna.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O1KPaX3LiQ2N1s_ON0wF-Q"
  },
  "T7orQh2zgK_rmDF1fIIIiQ": {
    "date": "12/10/2012",
    "text": "They make great lunch sandwiches due to New Jersey bread they \" import\".  However, the place is always filthy and they never clean up tabletops as  customers leave. They just keep rotating to unused tables. Been here 3 times and have never seen wait staff clean off a table. The employees keep walking by as if they don't notice it. I don't understand it. Good food, but who wants to stare at dirty, neglected tables while eating? That lack of attention to cleanliness in the front makes me wonder what the kitchen looks like. Also abysmal wait service with the personality of limp dish towel.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IZQhRicDrPQ3RWuHRUMM0Q"
  },
  "8MZHopSrwBuegdkeRhd5Lg": {
    "date": "9/14/2009",
    "text": "SUCK ON A SPOON!  My wife and i were in the mood for some italian but didn't really feel like going out so we decided to order some to go. I ordered the chicken Alfredo and my wife ordered the lobster ravioli.   What a disappointment. the portions were tiny. My pasta tasted like metal. It was like sucking on a stainless steel spoon. Their to go containers are those cheap aluminum containers and i guess it reacted to their food but i had a few bites and threw the rest away.  My wife's ravioli didn't have as bad of a metallic taste but she said the ravioli tasted as if it had freezer burn.   Can't say much about the inside and maybe its just their to go service that stinks but with all the options we have in Clt. It might be a pretty long time before i give them another shot.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iTm_bnTSIyTAP4FrJ_XE3Q"
  },
  "mo5KL6lXkwUb4RPH-2gUCQ": {
    "date": "9/22/2010",
    "text": "4 of us went to Arooji's in The Promenade on Friday night.  We've been here 4 times since they opened and had only 1 good experience, which was the previous time we went.  I doubt we will go again.  Though I have heard that their South Park location is better.  Most of their food is good.  We ordered the crab dip which my husband thought tasted fishy.  I thought it was good but a little too thick and creamy.  A lighter crab dip would be better, where you could tast the crab more than what it was mixed with.  I ordered the lobster ravioli, which I thought was very good and had a nice size portion.  More ravioli than I have gotten elsewhere.  My huband ordered the veal saltimboca.  When he asked for pasta instead of the mashed potatoes, the waiter told him it's a $4 substitution charge.  ($4! Is the pasta made of gold?)  We also found out that the SouthPark location doesn't charge for the substitution. My husband wasn't impressed with the dish.  Too much cheese. Our friend ordered a chicken dish which was very good.  So, you want to know why I gave it a two...they had their special select wine list in which we ordered a Malbec .  After we were half way through the wine and not impressed with it..we realized that the year was not the same as on the list.  It was 2 years younger.  We ordered another bottle of wine from the list and that too was not the same year as listed on their list.  This just screams to me that they really don't care about the quality of their service or how they present themselves to the diner. We've had a problem with this before.  Unfortunately, it's not just good food that keeps people coming back..it's great and courteous service.  I really feel that the arrogance comes from the upper management and not the servers because they have always been very good.  If I am going to spend my hard earned income than I want to go to a place that I feel appreciated and at this location I don't.  So, get a new attitiude Arooji's (and it better not be fake)!  I really am surprised this location has lasted so long.  After I posted this, someone asked me why did I go after the 2 bad times..this does need some explaining.  After the first bad experince, I wrote to the management and they sent me a gift card, that led me to go there the second time.  Then a friend gave me a gift card which led me there for the 3rd time.  Remember I like the food just not the attitiude. So, this 4th time was the Illios Noches was too crowded to wait.. and it was close.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "vc_3jWCvHssvzMn6EFVvrw"
  },
  "SVZZnW5p66j6EG43lpuFoA": {
    "date": "4/13/2011",
    "text": "Perfect place for a romantic night out or to listen to live music on a Friday or Saturday night or if you enjoy an extensive wine list.  A lot of people really like Arooji's.  As far as the food, I think it's mediocre for the price.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dk9GzM6Nni61oBdkETDFkA"
  },
  "XiBfFszSHW_E-h8EgHAOvw": {
    "date": "9/27/2013",
    "text": "Wow, how disappointed  we were, the service was terrible, the salad was right out of the bag. The main dishes were ok. For the price you would expect so much more. This used to be a great place. Not any more. Won't go back..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZUdtA23gsrco5WFELBYn0w"
  },
  "-0fn-WkLSMmut9q6Fk5J-g": {
    "date": "3/22/2010",
    "text": "I have never been to to Tuscany but the inside makes you feel as if you are eating at a quaint little restaurant there. The Cuore Sano Salad is amazing as is the Eggplant Parm.  I would have rated it higher had it not been for the prices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ADvSJWpDG3Sh2OLOYe7eSg"
  },
  "Ohm8KuTZjfx9CFdIx8Xwkg": {
    "date": "1/13/2010",
    "text": "Pretty good food, okay waitstaff.  Nothing to rave about, but nothing too bad.  A little overpriced.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Th8GIPkG0BPqW9YQv7TUSw"
  },
  "RYS00NAHgMHhovuUCtTGig": {
    "date": "3/21/2010",
    "text": "Had a filet last night. It was okay, not better than filets half it's price. The sides that came with filet were really small portions.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sipy4n758EmuE2d4EJR6MA"
  },
  "s37p9dUG_p5f2bH3X4yiZw": {
    "date": "1/23/2009",
    "text": "I would go there more often, but I'm usually attracted to restaurants that are packed during lunch time. This restaurant never seems to be packed at lunch time, and when I went, there was only two tables: me and another couple of men eating together. But the interior is very nicely decorated and looks authentic Italian. The food was a whole lot better than I expected; my sandwich was memorable. I do plan on making more visits here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tGYPA6kmF8rdXf95tSMcYA"
  },
  "nN4p5hlCCuF3mi3TNgvhfA": {
    "date": "3/18/2012",
    "text": "I recently had lunch here and our table of three had impeccable service and food.  I had the penne special for lunch.  A big portion I thought I couldn't eat it all - but it was gone at the end of an hour. Delicious and just enough sauce/cheese.  A very relaxed atmosphere and wait staff that delivers upon request even when one of our three inadvertently ordered something other than what she told us and then when it was delivered the wait staff had no problem changing it to what she thought she ordered.  Prices are great for lunch - will hopefully get to dinner there at some point.  I had iced tea so cannot comment on alcohol.  Have heard this location is better than South Park.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZUVkr4tasALS0ICofIBpSQ"
  },
  "MBAnWdy5yBusHg8Znq45uA": {
    "date": "2/15/2011",
    "text": "Well went back for the 14th. We were 2 couples.  The wives had the stuffed chicken special. It was great from what the girls said. I had the lobster bisque a very nice taste with lumps of lobster meat in it. For the main course I had  tuna special and it was one of the best I have ever had and I am a sea food guy.  The other husband had the  pasta and shrimp. I did not try that but he said it was good.  The service was great for a busy night. We did not wait for anything. The desert and coffee was all good and we were never rushed to get going to open the table back up because people were waiting to be seated when we left. I would give them an A++ over all",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ez-feGJqoSE2HRDP7BTTDw"
  },
  "HHtxjBEmsW15xRbwbCre8Q": {
    "date": "8/2/2016",
    "text": "This is my 3rd or 4th time dining at Aroojis and I had forgotten how good the food is. I ordered the eggplant parmesan which is my go to entree at Italian restaurants. It was excellent - made fresh not frozen like many places serve. I enjoyed  the delicious olive oil/basalmic/onions & cannelli beans that accompany the freshly baked bread. Service was attentive without being obtrusive. Some might complain that the wine by the glass is a little pricey  but it's not really out of line for an upscale restaurant like Aroojis. This restaurant has an intimate ambiance because it is small & has 2 dining areas. We had a very nice waitress and the rest of the staff was very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5YmrWQeNPTMQqrzrOOQ4Q"
  },
  "eTFmhTG4IBJlTeEZ3xdHxA": {
    "date": "7/24/2017",
    "text": "We live close to this restaurant, but had overlooked it.  We didn't realize that it was there.  But some friends recommended it and we decided to give it a shot.  We were really glad that we did.  The atmosphere was relatively quiet and quite intimate. We were comfortable from the moment we sat down.  Our waiter, Ray, was attentive and very knowledgeable.   The food... oh, the food.  We both loved it!  I had the lasagna, a unique implementation that had me eating the entire very large portion, even after telling my wife that there was no way I'd ever eat it all.  My wife had a special veal meatballs with fettucini entre' and also loved it.  We will definitely go back and we were excited to find such a great place so close to our home.  We highly recommend this restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UYiRqDOrbHsNQ9n5-b2xYw"
  },
  "ynutYXSnSo1RqnFcXXsOZg": {
    "date": "9/13/2014",
    "text": "Dinner: Terrible service and even worse food. Cold and obviously microwaved. Would not recommend.   Lunch: Totally different atmosphere. Salads are good and service is fast.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iUYuy2LX4Rljd_zzTmYypQ"
  },
  "w-80jeN7hOxRsSEEWEZi4Q": {
    "date": "5/25/2014",
    "text": "Laughed at Jordon O.'s comments- SUCK ON A SPOON review.  His comment was the  pasta tasted like metal.    I actually agree.  After the Penne a la Vodka, that metal taste was awfully strong!  Listen to Jordon.  He is spot on!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fAlsE5g9TXWyeFc71nwV7A"
  },
  "iB7xEDGcXrbFYE-vn7_5fQ": {
    "date": "7/2/2012",
    "text": "I would give 3 1/2 if that was an option....  Ok, this place has all the right elements.  It has all the potential in the world!  It is dimly lit, rustic/old-world decor, intimate, live music, extensive wine list, neighborhood gem, etc.  It sounds perfect, right?  Well, all of those things are the pluses.  But I am not only looking for the atmosphere...I am all about the food.....  I would say the food was OK.  It wasn't amazing and it wasn't puke-worthy.  The bread was fresh and had crunchy crust, which is always a good thing in my book.  I loved the canneneli bean dip they serve as well.  It was very tasty.    I ordered the pasta fagiole and a salad, the rest of my dining partners ordered chicken parm.  My salad and soup were just okay.  The soup could have easily been out of a can but it wasn't bad.  The chicken parm was okay as well.  The pasta it is served with is very light on sauce and the little that was on there tasted like chef boyardee.  I wanted a past a dish but I honestly didn't see one on the menu that looked worth the $20 they were charging.  I mean, even the Penne Vodka was $16.  I was told it was very salty so I didn't risk it.  All the other pasta dishes had too much going on...shrimp and sausage and mussels, etc.  I just wanted a good old fashioned pasta dish or even one that was served with marinara but that was nowhere to be found.    We didn't try the desserts but they looked good!  However, we were told by our waitress that the canoli cream was not made in-house.  I am doubting that very much was made in-house.    Overall, it was just an okay evening.  The service wasn't spectacular, the food was mediocre and the prices don't seem necessary.    However, the gentleman singing and playing the guitar was awesome.  His voice was soothing and he was extremely talented.  IF I came back it wouldn't be for dinner.  Maybe some wine and appetizers while soaking in the tunes of what sounded like James Taylor!  :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TB9ibgXVrq1B7-fajbsu8g"
  },
  "RAt4k-aSeYm0pBxW8T4_6Q": {
    "date": "8/5/2017",
    "text": "Despite what BRAD said,  this place was great! We totally enjoyed this meal,  Brad is just an asshat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zFrr0ht4sbPx8yIgid2hbQ"
  },
  "twQ8avcHVp-CrXWOpGzOAg": {
    "date": "2/9/2018",
    "text": "If your desire is exquisite Italian food, a breathtaking atmosphere, & top notch fast & friendly service this is the restaurant for you. First thing you notice when you walk in is how beautifully crafted & put together this restaurant is. It's like you walked straight into Italy. It's also very clean & very well kept. My boyfriend & I came in for dinner one night & were greeted with a warm & friendly welcome from multiple staff members. We were seated promptly & didn't spend time waiting at all. We sat down at the bar. The staff was very accommodating & friendly & took care of all of our needs. The food here is also outstanding!! I got a salad & it was the freshest salad I've ever had!! Everything was fresh & made in house!! My boyfriend had the salmon piccata & he was very satisfied with his meal as well. We are both very picky eaters but this place is excellent!! Also if you're a fellow wine connoisseur like myself this is the place for you!! I spoke with the manager who was extremely friendly & knowledgeable & he said they had over 200 different kinds of wine with all varieties. Trust me there is something for everyone here. I chose the Chianti. All around it was an amazing dining experience. The staff really love what they do & they care about your experience here. We'll definitely be regulars at this establishment. All around excellent from every angle. As a veteran in the restaurant industry I know a good restaurant when I see one. I highly recommend this place to everyone who's looking for an all around amazing dining experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IsxvFNmLfMVyMXT6mP63sA"
  },
  "bZDTaomtpXY05yDm21EbIw": {
    "date": "8/7/2014",
    "text": "Very nice food and wine. I had sea bass and my husband had grilled lamb - both were perfect. Try crab and spinach dip, too!  No kids menu, but you can order any half-meal or even a custom meal, which we did - our son enjoyed pizza made just according to his taste.  Service was very good, Thanks Jeffrey :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w-mXQBcPlwD74jN3n26rgQ"
  },
  "HB4ESvH2A3N9s-yqF28U6A": {
    "date": "4/30/2017",
    "text": "Arooji's has the best gnocchi with pesto and grilled chicken - hands down!  They also have very good lasagna and sea bass. Very nice wine list and knowledgeable staff. It's not usually very busy during the week, so we drop in a couple times per month. Very quaint inside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wh0NmCqmMWoo16gXp5UWLQ"
  },
  "1YUiOlIzRmqMOGfjXDlZjA": {
    "date": "4/12/2017",
    "text": "Great food and service! Every lunch and dinner has always been a great experience. The atmosphere is very comforting. The wine selection and the dishes are fantastic. I am hung up on the lasagna and the veal dishes. I would highly recommend Aroojis.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lgfyxfERf2LWkTrTYwrSJA"
  },
  "n6860UPNSXy8X9sOBOJHig": {
    "date": "12/22/2014",
    "text": "So this is a wine bar so I'll start there.  Ordered a bottle of cakebread chardonnay, and they were out.  Ok no big deal we'll try the Sonoma Cutrer - out.  Ok how about KJ Grand Reserve - out.  Tried one more and guess what, they're out.  Why put this on your menu?  We switched to Cabernet to see if we could have some better luck.  Ordered a bottle of Silverado.  Guess what, they were out.  Guys that is pathetic.  Zero out of 5 bottles at a wine bar, and they're bottles on your menu?  You are located right next to Total Wine.  GO STOCK UP.  They must be going out of business.  Chicken dish tasted like chicken jerky.  My wife's pasta dish was very good.  Couldn't find the crab in the crab dip just mayo.  Servers were very friendly!  Won't be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oX5pvTPY8K20c0p7YRDnUQ"
  },
  "sRkyDzuLdji-lCKMmHjDow": {
    "date": "9/30/2015",
    "text": "Ok, what's up with this location.  I had to call and get directions in the strip mall.  But I found it.  I walked in and just stood there.  About a minute or so later a waiter came up to me and asked how many were in my party.  Whew...I was about to walk out but I needed to use my Groupon and had driven this far so I really wasn't leaving.  The waiter was super nice.  The calamari was okay.  I liked the aioli sauce. The lasagna was really tasty but I was too full to get past a few bites. I'm looking forward to the leftover meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dHRchS7reL10P-EpYXYUiA"
  },
  "7CpBYwzM2a3My5AlOZBp6Q": {
    "date": "7/7/2014",
    "text": "My husband  and I went here this evening  for date night we saw it was a new restaurant  and thought  we'd  give it a shot. VERY BIG MISTAKE!! our food  came out Luke warm even though  they said it was cooked  to order. I  had pasta with  broccoli  and steak. The broccoli  came out raw in my pasta,  so I  asked waitress if I could get some that was cooked. She was very nice and said  it would be abound five minutes. So when she brings out new broccoli  I can't believe  that  this is also  raw. My husband  and I  left hungry and then went to portifinos which  is where we should  have gone  to begin with. Stay away from this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2v7oU_NQf_JOMwRjUZPAEQ"
  },
  "GPolNvVa3Y3cFaDu1Q2KGw": {
    "date": "4/27/2012",
    "text": "My wife and I have been to this restaurant a number of times over the years.  Our meal tonight was the worst dining experience we have had in a long time, and it wasn't all because of the food.  Our server, a blonde in the cocktail area, was oppressively attentive.  We were looking forward to a relaxing meal, but it seemed like she came by every couple of minutes or so.  It got to be so irritating that we couldn't wait to escape.  It was doubly annoying because I have some issues with my voice right now and have to write things down on a sheet of paper and she was STILL asking both of us how things were going every 3 or 4 minutes.  She asked my wife if she wanted a to-go box while were both still eating.  I haven't left anyone a 10% tip in many years.  I am sure she is a nice girl, but she needs to learn how to read tables a lot better.  We made it quite clear with our body language and my wife's one word responses to her questions, that we really wanted to be left alone.  Do her a favor and teach her the right way to do things.  And when you only have two specials, she should try to memorize them rather than read them off a piece of paper.  One more thing:  I ordered the spaghetti gamberi, which is described on your menu as being sauced with garlic and olive oil.  What you served was essentially a thin sauce of crushed cherry tomatoes.  I didn't notice any olive oil.  I pointed this out, but she basically told me that it was correctly done.  I didn't feel like arguing.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ScUX8L5It9BA3BRYrWNXsw"
  },
  "kAHcYDrDb8dOn7L5zKneVA": {
    "date": "9/29/2015",
    "text": "Weird experience! Tonight when I got to the restaurant I was told that my reservation had been cancelled?? And the small party room that I had been promised was locked and no longer available?? It was a birthday dinner for a friend so it was very disappointing for all. Our server was great and the food was good, but when we went to pay I could not find any of the wait staff or even the owners that could help me with change for a twenty. The owner had no interest in helping us and in fact packed up his stuff and left the restaurant while this was going on. I am not a complainer and love to eat out at good places, but I have no interest in returning to this restaurant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "wuB8Sj31HWu1Fj5ZqdVxmQ"
  },
  "fu08KJ8Pb5l0odgrAYJcdA": {
    "date": "6/30/2017",
    "text": "Our first visit to this restaurant which we stumbled on quite by accident, and so glad we did.  The service was excellent, very friendly staff.  Being half Italian myself and spending a lot of time in Italy eating authentic Italian food, both dining out and eating home cooked meals with my huge Italian family I was a little skeptical about what the food was going to be like?  We were by no means disappointed with this little gem of a place.  The food was excellent, made with real fresh herbs and spices.  My husband had the rack of lamb that was cooked to perfection and just fell of the bone. I had the Salmon with  Vegetables cooked al dente as vegatables should be, and the presentation on our plates was very impressive.  Being a frequent traveller throughout Europe this is one experience we will not forget.  I don't normally post reviews but i was so impressed with our dining experience here that I felt compelled to share with other good food lovers also looking for, good food, wines, service and value for money.  Our complements to the chef, this place deserves the 5 stars given. We will definitely be going back again if only to sit at the bar for an aperitif and appetisers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sM3GSBtomcnJqvCFik4dlg"
  },
  "wAcA4ZkOQS-ysw3MiBBD2Q": {
    "date": "9/30/2014",
    "text": "I've been here twice.  The first time was for lunch several years ago and I recalled really enjoying it.  This last time for dinner was just okay.    I really like the atmosphere of Arooji's.  It is very warm and comforting.  The giant racks of wine, the high ceilings, and all of the wood give the place a nice vibe.  The service was attentive.    The food wasn't bad.  It just wasn't great.  We started out with the calamari which was very good and certainly better than average calamari.  I got a special which was a mix of mussels and clams in a wine/herb broth.  The broth was nice, the clams were meaty, but I don't know what went wrong with the mussels.  It appeared that they had been cooked to death to the point where they and just about completely disintegrated.  My date got the lobster ravioli.  The presentation was nice but the dish was devoid of flavor.  Lobster is a very distinctive flavor and if you are eating it, you know it.  I could not discern much lobster flavor in this ravioli.  There really wasn't much flavor otherwise either.  We were \"cheating\" in getting this rich dish on a week night with the pasta and cream sauce.  Needless to say, we were disappointed by the lack of decadence.    It's a shame that the food was more consistently good as there are a lot of things to like about this spot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjTG24J-UT3vs2fuwTJ9vw"
  },
  "stj-kwSs5Mc52-txVHcg_Q": {
    "date": "8/3/2014",
    "text": "We've been before and had great food. However, this last time we ordered 4 entrees to go, were told it would be 20-30 minutes so we arrived 30 minutes later. Upon arrival, we waited another 60 MINUTES. They not only forgot to make our food, but didn't even rush to get it out to us 'in time'. I'm not sure I would wait 60 minutes if we were sitting at a table, but we were STANDING at the front door. The manager never came by to speak to us and explain - in fact, we could see him sneaking around in the back, avoiding us, I assume. We were offered no free drinks, no free desserts, and we paid full price for this terrible experience. We will never be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CSHj2vfR6PGYxo36uXprhw"
  },
  "CJ-WYn-xM0uRLxjDjZ2PBw": {
    "date": "6/12/2011",
    "text": "I have been to Arooji's once previously for wine and appetizers.  So, on Friday night, we spontaneously decided to stop back in to enjoy a bottle of wine (or three as it turns out) with some friends after dinner.  The weather was nice and we opted to sit outside. There were serveral other tables of guests outdoors and the ambiance was relaxed and welcoming.  They have a great wine list!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "Rt8wAbQW_rlk9I0occ_lRQ": {
    "date": "10/11/2013",
    "text": "Outstanding just walked in from Orlando Florida and being from NY originally with frequent visits to Little Italy,  the food was great.   Bread,  bread bean and vinegar, onion dip was great.   Have the double Tuscan wine and the chiliean sea bass and you will have a fab time.   The guy who gave it a one star is not Italian and probably thinks olive garden is  5 star.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zzYF64kl9es4c16fv68OIQ"
  },
  "2QnXoHLDlSj0Nctr1hv9xg": {
    "date": "2/22/2016",
    "text": "I won't come back.  Rigid policies with Groupon.  By coincidence friends came to the Restsurant at the same time. They would not honor our Groupon even if we sat at separate tables.   I do NOT recommend this Restsurant to anyone who uses Groupons.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "cT2_lqP-tV5s3g4VDYI1KQ"
  },
  "Dunvsyxg7HmNbZL4DcKqXQ": {
    "date": "3/4/2017",
    "text": "I went there today for lunch with my daughter. It's always empty when we go by which should have been a red flag. It was empty as usual except for one man at the bar. Shortly after being seated I looked over and saw one of the employees (I later found out it was the owner!) sitting with his legs propped up on a chair with his shoes off! Is that even ok in a restaurant?   After the food came he got up, walked over to our table and told us we were being rude and loud on our cell phones. I should mention that we weren't on our cell phones. I tried to explain that to him but he started shouting that we needed to \"respect the privacy of the other customers\". Again, there was only 1 other customer and It's unlikely he went to a bar for \"privacy\". I discontinued trying to reason with him  because he was either drunk or is mentally unstable.   Do not go to this restaurant. The owner is unstable and there are just too many other wonderful restaurants in Charlotte that actually want your business.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QThBTcUrfE2BlzQ-m9Dfnw"
  },
  "6JfI4ABtbkh9k-80p6Q15w": {
    "date": "8/20/2017",
    "text": "My wife, daughter, her boyfriend and I went there last night to celebrate daughter's 23rd birthday.  We ordered several things from the menu.  I ordered Filetto Alla Pompei and have to say without hesitation that every single thing we ordered including appetizers and sides was absolutely perfect.  The manager, owner's Son and our server Ray took wonderful care of us and we couldn't have been happier.  Will definitely put this place on our favorites list.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bJguBxPlnTW29tRTAF0nkQ"
  },
  "5be4Y57pedo6mzTsyPCzNw": {
    "date": "2/10/2018",
    "text": "Decided for a little date dinner with my wife. Was seated in a perfect two seat section. Ordered a bottle of wine (#303 more to follow on this selection), had bruschetta (very tasty) for appetizer. Wine came out, presented, tasted and accepted. My wife having a much better wine pallet then myself, liked it. However, I explained to her the wine I ordered did not seem like the one we were served. We looked over the bottle and decided maybe it was labeled anew and continued our conversation. My lamb came out solid, very tasty as were our salads, and my wife enjoyed her vegetarian whatever it was pasta dish. Time to depart, asked for our check and was amazed at our check total. This is where #303 came into play. Pulling the waiter (great job serving) to the side in the back, I asked him what number bottle I had ordered, he stated #303, exactly what I ordered. He pulled out the wine list, and to my surprise, TWO separate bottles were listed under #303. The one I was served happened to be $185 more then the one I had asked for. Yippie!! Manager came forward, I explained the situation and told them that I would work with them on the price. Due to the fact I'm an amateur wine drinker and I should have notice the bottle was not correct upon presentation. If I purchase a wine at cost for over $100, I'm going to have it decanted every time. Nonetheless, manager was exceptional, and we agreed at cost for the wine. Just be aware if you order from a numbered wine system you do two things. 1st, ensure there are no double wines listed under the same number, 2nd, know what your getting before having it uncorked. Over all, we where 100% satisfies with our dinner, waiter, management and of course our wine. We will defiantly be back, and I did learn something new.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pmF_Hto3BJRdtMhd6K9dog"
  },
  "G79iQnzN-ON8COt_pzDguQ": {
    "date": "3/17/2018",
    "text": "My husband and I went to Aroojis tonight for a rare child-free date night and could not have been more impressed. I wait tables for a living, so for me, good service is just as important (sometimes more important) than the actual food I'm eating. Our server, Angel, was on point from start to finish. He was warm and polite and gave us great recommendations on food and wine. The pace of the meal was perfect. We never felt rushed or wanted for anything - empty dishes were cleared promptly and waters were always full. As someone who does this kind of work, I really appreciated the attention to detail that I saw tonight. On top of that, my husband and I both thoroughly enjoyed our dishes (lobster ravioli and lamb osso bucco that was on special - YUM). Great flavors and good portions for the price. We left very full and very happy and will definitely be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-yI5pKOucUoTxdgAydXD1g"
  },
  "e6REcTluEofKHsxbj1Yd0w": {
    "date": "5/22/2016",
    "text": "I was going to give a 2.3/3 based on appetizers alone. Excellent wine, but otherwise....  First off let me say that I came in on a Sunday evening. The place was place fairly empty, but the waiter was not very attentive.   The calamari was good very good.   I had the fish they called branzino.  Now I've had branzino and chilean sea bass many many times before they were calling the sea bass branzino.   It was just OK. I've had much fresher, such as at Upstream and many other places in NY.  My wife had the salmon: it was very mediocre at best.  Definitely was not fresh.   We were not impressed and will not go back.  I'm glad we used a groupon to defray this overpriced dinner.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vvwTa0rVGlsHMIllfSG9nA"
  },
  "QuW5jORkInT_6rpN_4yOpg": {
    "date": "3/25/2017",
    "text": "My husband and I don't live close enough to Arooji's to go as often as we like but we jump at every opportunity we can to visit Arooji's. We are always greeted so warmly, as if we were family. The wine list is very expansive and there is always a great recommendation by the bartender- no matter the mood we're in there is a wine for that. The food is nothing short of amazing. We even threw our engagement party in their restaurant. The owners and staff worked with my fiance at the time to develop a menu and wine pairings- my guests still talk about it to this day. The service was impeccable- never an empty drink and the personalized menu made us feel so special. I wish we lived closer!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O7OYwyDkIJudpjvSIzv93Q"
  },
  "_EBc2HIdluRWlmkEvru4FA": {
    "date": "1/3/2017",
    "text": "Walked into a romantically lit and intimate space with relaxing jazz music playing after my dad chose this place from Groupon and got really excited for the evening to come. The walls are covered in wooden wine racks, but the ceiling is open and industrial. It's a comforting modern and rustic mash-up.   I opened up Yelp to see what entrees are recommended and was so disappointed by the negative reviews I read, especially for the medium-high prices I saw on the menu. Oh well, Groupon already purchased so no walking out now! Maybe they heard me whispering about the reviews with my mom or maybe they've recently stepped up their game but the dining experience was very pleasant. The complementary bread was warm and the bean dip a unique twist to the usual olive oil and balsamic. I got a Cesar salad and the meatball soup and my mom ordered the crab cakes. Dad got salmon. Everyone was happy with their choices, but in my opinion every dish was noticeably acidic in a way that surprised me, but didn't totally turn me off to the point of dislike--especially the lemon salmon glaze. The service was excellent and attentive. They even shook all our hands on the way out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "j-qy8XYRC4VVjqCGJFXOnw"
  },
  "EpTUHaIjkg_el6yXm6mzDw": {
    "date": "8/26/2017",
    "text": "Cozy alfresco dining, excellent service, extensive wine list, great appetizers and meal selections",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wzbn1tpP8uItLKpljyxD9g"
  },
  "H2pSs8uG-taCz3dte0XsDQ": {
    "date": "2/6/2017",
    "text": "Have been going to Aroojis for years they have a great selection of wine to choose from and the food is always fabulous.. they also have great lunch special!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P8sQpi4ZJhYBGfpcoMPnqA"
  },
  "4cbvL6goFXOvj4Z5r1LUJA": {
    "date": "12/9/2016",
    "text": "Not a good experience.  I took my mother and husband there for his birthday lunch.  I was not greeted very well by the owner.  It was like we were a bother. We were the only customers there at 2pm I requested seating in the wine room.   It was all set up but told NO it was not set up and we could not sit there. I said please it is special occasion to some guy with an attitude again the answer was NO.  I was planning on bringing a group of 10 back for a holiday dinner an sit in that room....not  now...not EVER.  The bread came    yuk. frozen processed rolls. I can get better from the freezer at Cosco.  I asked for some olive oil and balsamic vinegar to dip it in.  They said NOo they only do that at dinner. Wow, it was a birthday lunch.. a little olive oil and vinegar would not break the bank.  Instead we got pre-wrapped ice cold butter pats for the crappy roles.  Right then and there we should have left. If we did not have my elderly mother with us, we would have.   The food was a disappointment.  Our mushroom ravioli was cold, the sauce was thin and tasteless, the ravioli was the frozen kind it was gummy and  (once again) I could have gotten better at Cosco.  The iced tea tasted like the instant kind (Nestea). My husband's spaghetti and meatballs looked like a child portion and the sauce was bitter.    I did not complain, we were all very hungry, we had another appointment to go to after lunch, so we choked it down.   There was another location in SouthPark that went out of business.  I can see why.  This was a waste of hard earned money and a very disappointing birthday lunch for my husband.  I can't understand how they get away with this...maybe the people living in that area never tasted good Italian food?    Lest not forget Ajoojis loves the word NO. So in the spirit of Aroojis..... will we return? NO...will I take my staff there for our holiday dinner? NO. Is the food delicious? NO.  Are they accommodating? NO",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MmX3MmxWwz3Grcdul4VGAA"
  },
  "tyfR7S-ze4kfkfvvfl8Krw": {
    "date": "5/27/2017",
    "text": "Great menu, quaint atmosphere . We had appetizers and a bottle of wine  Calamari , caprese salad and crab cakes very good. Great service .... will come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qslw19LB1xs6loZHvsqJEQ"
  },
  "ZolE9QYQCTPT4IHu8HFljA": {
    "date": "9/22/2015",
    "text": "Rudest service I have ever encountered, took me aback and being new to food allergies, I did nothing while the manager yelled at me.   I had called ahead and asked if I could bring my own pasta so, I could enjoy their sauce. Everything was very nice, my husband and I were enjoying a table outside, some wine, a nice salads. Then the manager came out with my meal and told me NEVER to do that again and chastised like a me like a child. I just sat there and felt like crying, I didn't say a thing back and I regret it now. I never told him I called and asked before if I could bring my own pasta, and that they could charge me the full amount for my dish. I just wanted to enjoy the evening.   Everyone has an off night,even though In the public eye you should suck it up for paying customers.   The way you treat people says a lot about you.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "3sY-Wj7CKDb9YjQm7LG5Ew"
  },
  "uHyDr4Yap3OCwoAuetKCKQ": {
    "date": "3/18/2017",
    "text": "We Started with the crab dip! Some of the best penne ala vodka I have had in Charlotte! A nice spot to bring a date, cuddle up in the booth, and drink a nice bottle of wine. Five stars all around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZP-zsaCg3a4KODxIe8b_NA"
  },
  "xcofHl3jfoE_zNHLqKUZ2Q": {
    "date": "12/5/2016",
    "text": "I used to love this place but when I was there the other day, I had a glass of Chardonnay. I drank about half and noticed a fruit fly in the wine.  Really gross.  We told the bartender and he offered another glass, which I declined.  I was kind of turned off wine at that point.  He had the nerve to charge us for the glass of wine with the fruit fly in it!! Unbelievable.  I will never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yK2BYrKP5g-Z8URSnsdHVw"
  },
  "SnzuNC9S7qafpFZ3wFEAig": {
    "date": "3/23/2017",
    "text": "If you're looking for real authentic Italian this is your spot! Love the ambiance/decor. Painted murals on the wall, cute little booths and Italian music playing in the background. Perfect date spot with huge selection of wine. Gotta have their crab dip and caprese salad!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RGUHlp8yIXUD-Epnl-vzww"
  },
  "UQM199Q9_Fw8Hx4fbzlVQA": {
    "date": "12/20/2017",
    "text": "Once inside you would never know you were in a shopping center. The service is attentive, the food delicious! So glad I was introduced to this gem. The wine selection is awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F-2lE9ipc0gbX1iJnUUt7w"
  },
  "47zg9BZ6Xw4GZgvbKCneog": {
    "date": "7/29/2016",
    "text": "My fiance and I went here because we had a Groupon, and I love anything with the word wine in it. The decoration is very rustic and I really enjoy that. The service was very nice, the host and the server were very friendly and helpful.   The food, unfortunately was not so great. We started with mussels which were very fishy tasting and the sauce was very fishy tasting, which good mussels should not taste this way. We got two Caesar salads with anchovies ($4 extra-not mentioned), and the salad was fine, the croutons small and not much dressing. Then we split the lasagna and they charged us the split fee of $3, but they just cut it, they didn't put it on another plate, so we still had to move it awkwardly to our plate. The house cab was not very good for a wine place, had much better house cab elsewhere.  I feel bad I want them to make it cause it's a cute place but don't think I'll be going back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vkn5-vlB89kNL59Y9cBC7w"
  },
  "CRgUyf4wbHLQchHEJ9CMZQ": {
    "date": "11/18/2015",
    "text": "I have been here twice. First time the service was excellent. I got the lasagna and it was delicious. Second time it wasn't that great of a experience. We waited forever to be seated. They were seating inside and outside so the staff was going in and out of the doors and not one person told us they would be right with us. Finally someone came and walked us to a table. The bread is good with the bean dip. I got a pasta with steak. Steak was tender but very small. Sauce was flavorful. My fiance got the salmon dish and thought it was good. Server was nice but you can tell he was overwhelmed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "1Zu-k0vCMihGOwCDNKd6Dw": {
    "date": "5/20/2016",
    "text": "WORST EXPERIENCE!!! BACK AWAY FROM THE BUILDING!!  Me and Frankie Boy got there yesterday at around 5:45pm. Yeah, I know, it was early.  Anyway, place empty!! First red flag. Place is really pretty, I'll give them that. But thats it. The server knew nothing About the description of the items that he was telling us that were on special, I had to ask. We ordered the  appetizer of cold antipasto  that was supposed to have olives Parmesan cheese and peppers that it didn't come with. It also had a poor presentation  and looks like it was just cold cuts slapped on a plate. When we told the waiter that the olives and the roasted peppers were missing he took our plate back to the kitchen and he came back with two olives and no peppers because they were all out. We also ordered the caprese salad and I asked for more Olive oil which was clearly lighter than the olive oil that was drizzled very cheaply on the salad. I guess they don't want to give out the good olive oil. We order the tortellini Alfredo and it was tasteless and we also ordered the lobster ravioli in a cream sauce that barely covered the ravioli itself and when I asked for more I was told that I would be charged extra for it!!! Fuk  atta here!!  We used a Groupon to check this place out and even with the groupon we spent 53 dollars because of the conditions the restaurant puts on its with the amount of money that we spent here we were really disappointed and disgusted at the poor service and the cheapness of the owners of this miserable little place and we will never ever go back again  as it was not worth it at all! Arrivederci douche bags!!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hs-nahI7ZwTi3PHl5mJSUQ",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States. This is supposed to be antipasto with roasted red peppers and olives. They gave us 2 little olives and no roasted peppers.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hs-nahI7ZwTi3PHl5mJSUQ/o.jpg"
      },
      {
        "img_id": "IX8Db1O_Wy22kn6YvHczVQ",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States. This is the caprese salad and if you ask for extra olive oil you get a cheap lighter blend",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IX8Db1O_Wy22kn6YvHczVQ/o.jpg"
      },
      {
        "img_id": "4spyXBvoguJ-QYn8X8DEuA",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States. Tortellini was tasteless and bland",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4spyXBvoguJ-QYn8X8DEuA/o.jpg"
      }
    ],
    "user_id": "EDZKP6CGokUIoQfRmkLhdw"
  },
  "lAE6zYQrRiybXWZgNZ8ZRQ": {
    "date": "4/21/2019",
    "text": "Though we have lived in the area for 20+ years and Arooji's has been around most of that time,  we had never been in...until last evening.  We have missed out!  Between the impeccable service and the flavorful food offerings and the delightful atmosphere, Arooji's has impressed. In addition,  they have a fine wine menu.  The table placement allows for private conversation, some places are so crowded. My only very minor complaint is that the decor looks a little tired. I strongly recommend a visit to Arooji's.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pLYQsEbdC3jP0NFN5tLnPQ"
  },
  "CUxHrlOpjkbCgVIM_-StpA": {
    "date": "5/25/2019",
    "text": "Wow... we have lived in CHARLOTTE for 8 years and just found this jewel of a place... The atmosphere, service, and food is amazing... I am already planning for a return visit... yummy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aJcgNs1SaKepTGSxEidedw"
  },
  "yTqh_JVlyCmBGjP3PTf7XA": {
    "date": "10/26/2018",
    "text": "Back to Aroojis with my wife for a quiet dinner after a stressful, run-around day.  Beat, we sat and allowed our selves to be immersed into the quiet atmosphere, lowered lighting, quiet and attentive service.  The atmosphere is very nice.  Romantic even.  Wines by the glass, great menu.  We had side salads with their in-house ranch dressing.  Yep, good and rather large portions.  Two different wines:  one was the Dogajolo (cool name) which was simply a nice, Cabernet style wine.  Then, the Parducci, a very naughty and delightful spicy Zinfandel.  So excellent that if we were not driving would have had another glass bringing us up to the equivalent of a whole bottle between us.  It was that kind of day for us.  Wife had the Rigatoni Bologne which she liked a lot.  I, without asking or thinking, ordered a special offered.  It was a seafood mix on top of narrow fettuccine.  It was HUGE.  Literally a table salad bowl heaped to overflowing with more seafood than I could finish.  Nice sized shrimp, mussels, clams.  It must have been time to clear out the stock of seafood in the kitchen.  The sauce was a marinara, not necessarily my favorite, but this one was light and actually had flavor.  Quite a combination.    I should have guessed this enormous dish was coming when they delivered two bowls for debris.  I filled one completely and finally hit the stop button on my mouth when the other bowl was half filled.  I was stuffed, but smiled, along with the wait staff, at how large and good this $30 dinner was.  I recommend that this be a shared dish for two.  Maybe even three is you are not eager eaters.    Arooji's is a good place with good food and good service.  Just wish it were located closer to where we live.  I'm a fan.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "cyuDrrG5eEK-TZI867MUPA"
  },
  "4GmnIseSnbNFWne4P14G7Q": {
    "date": "7/1/2019",
    "text": "The WORST FUCKING PLACE EVER. PLEASE READ THIS BEFORE YOU GO IT WILL SAVE YOU MONEY AND TIME:  When we first came in it seemed nice until it wasn't. The waiter was very sexist and made inappropriate jokes all night. The table of 7 that I was with was extremely uncomfortable. When I got my food, I was unsatisfied because it tasted like nothing. I added salt and cheese and it still tasted like nothing. I fed it to my friends for feedback and they agreed as well that it was awful. I politely wait to the waiter and tell him I was unsatisfied with my food.. he then proceeds to blame me for disliking it and starts asking everyone and my table if they enjoyed their food to justify why I possibly couldn't dislike him. He rudely asked me for what I wanted and at that point, I didn't even want to eat there anyone so I told him to take it back and eject it. He had a rude attitude all night after that. I read some reviews at the table and saw that this was a very common problem where workers get angry or offended when customers are not satisfied with their food. After leaving, I felt sharp pains in my stomach, as did two of my other friends. When I returned home the pain was so unbearable I tried to sleep it off, only to wake up at midnight from awful pains. From 12am-11pm, I was using the restroom. When I finally fell asleep I woke up and started throwing up. I call my friends and they have been having the same symptoms as well. I still have pains right now as I type, my body is so weak but I am fueled by anger right now. I call the restaurant and the manager essentially blames ME or my sickness and tries to downplay it!!!! They're more worried about their reputation than customer service. The food is absolutely gross and not worth the price at all. The wine bottles are over priced as well, when you go just look up the wine bottle you'd be interested in and you'll see that it is SIGNIFICANTLY cheaper at alcohol stores. WORST PLACE EVER. Charlotte has so many great Italian restaurants this one is not worth it, unless you like unseasoned pasta and mediocre customer service.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "dOlA6u19yBU5itFELMvwdA"
  },
  "VW-EYtDwIyb46hMtLCjD9Q": {
    "date": "7/1/2019",
    "text": "Great food and wine selection. Wait staff very heplful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bx8kzJZ4LTjoSbXIrYHZUA"
  },
  "lkje218-tQIv2wt4LzmFqg": {
    "date": "4/13/2019",
    "text": "Burned food and bad service! The server took our order, and then we never saw him again. The host brought our entrees, which took over an hour to arrive. I said the crab cakes looked burned and host with a big smile \"yes, we deep fry 'em and then bake 'em.\" Um, what?  We flagged him down and pointed out the charred black food. He took it away and promised another. Smiley returned and, for our trouble, offered a free dessert that he clearly expected all three of us to share.   My other 2 visits were just \"meh.\" This one took the cake. I'm done!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wFF9AhzgfrGCZD8oOWOYQw"
  },
  "ijAdbCHLLKLwTSvWdsKMLw": {
    "date": "12/13/2017",
    "text": "Today's lunch gab session with my friend Joe was in one of the most charming and idyllic spaces in Charlotte.  It's tucked in a shopping center and almost unnoticeable. Has the feeling of an Italian wine bar, yet the menu is robust enough for a great meal.  I had the chicken kabob.  It came with mixed veggies and the most delicious rice ever.  The rice had dill in it and was a combo that I never would have considered on my own.   Loved the jazzy and soft background music and the classy vibe.  Oh, there are architectural details here that are so visually interesting for a restaurant.   Check out the arches and the side dining spaces.  I was shocked that there were not more people here for lunch.  We were told that the dinner crowd is much more pronounced.   That means I will be inclined to keep coming back for lunch.   Definitely TWO THUMBS UP!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "KbHLBPdd5Nc3bvBLsXwLSw",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KbHLBPdd5Nc3bvBLsXwLSw/o.jpg"
      },
      {
        "img_id": "UXTGDiuniaj9F_gdR421Bg",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UXTGDiuniaj9F_gdR421Bg/o.jpg"
      },
      {
        "img_id": "sy00CRJ2imXbJfqnX7hevw",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sy00CRJ2imXbJfqnX7hevw/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "fqMXXMDEYogIldPEUqJcxw": {
    "date": "10/5/2018",
    "text": "I recently went to a Arooji's with a friend of mine and lovvvved it. Joel made me a fantastic drink at the bar and after our pastas the chef came to ask our meal was -- what a sweetheart!  I had the Lobster ravioli and the server recommended adding shrimp -- to die for, seriously. He also told me to try the Gavi (Italian white wine I guess?) and it absolutely brought everything together.  My friend Kate had the Bolognese (I did sneak a bite or two). Seriously -- just order this and a glass of red wine -- you will be blown away.  -M",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lVqhEbd78FIosfESJecw8w",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lVqhEbd78FIosfESJecw8w/o.jpg"
      }
    ],
    "user_id": "z0rgZ_2VTKzZq7gzIIWsNQ"
  },
  "F8eSR-RoMmFFfg3HkEm-UA": {
    "date": "9/9/2018",
    "text": "Aroojis Wine Room is absolutely delicious with wonderful service. We especially liked the rigatoni bolognese and the risotto with shrimp. The ambience is lovely and of course the wine is delicious. A hidden gem in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Iy7N98uWTFsoq5xXtwo60w",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States. Rigatoni Bolognese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Iy7N98uWTFsoq5xXtwo60w/o.jpg"
      },
      {
        "img_id": "SYilajmnOpVSLg48kODHoA",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States. Risotto with Shrimp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SYilajmnOpVSLg48kODHoA/o.jpg"
      }
    ],
    "user_id": "jJD8_k497HSLQ33gzZWebA"
  },
  "YGFR0sisOAj-oEl6yW58Ag": {
    "date": "5/26/2018",
    "text": "My husband and I just moved to Charlotte and have been looking for a nice romantic Italian restaurant. We had dinner here tonight and the entire experience was so wonderful. We sat outside with a bottle of wine and twinkling lights and our food was absolutely delicious. I highly recommend the penne alla vodka. Definitely our new favorite place for date night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Er5fgKIDi0GQDVj96yPYGQ",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Er5fgKIDi0GQDVj96yPYGQ/o.jpg"
      }
    ],
    "user_id": "JvHXAzodYjLxKMTNWnrQuA"
  },
  "ziFoynz27b4qf3vo5VlZaQ": {
    "date": "5/11/2019",
    "text": "If 0 could be given I would give that score.  Met an old friend for dinner and this this food is worse than Olive Garden. Ordered the Seared Tuna special and they served old bad tuna.  I've eaten fresh tuna all over the world and this was the worst.  Owner came out and told me I was accusing him that the tuna was bad when he saw it delivered today.  Answer me this.. when is seared tuna brown.  Don't eat here...yuck",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PuL9u2jPG-E16m2Pj47utQ"
  },
  "DMXPEuBxhWWegwIes4CJhw": {
    "date": "5/7/2018",
    "text": "A very nice date night out nice music great food n  wine service is excellent. I recommend the Gnocchi Pesto. It had a lot of flavor and done to perfection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gKovK-qtA16zG_5GtoXRXA",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States. Gnocchi Pesto",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gKovK-qtA16zG_5GtoXRXA/o.jpg"
      },
      {
        "img_id": "Xi1KsRtErfathCBHgEriug",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States. Chicken picatta",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Xi1KsRtErfathCBHgEriug/o.jpg"
      }
    ],
    "user_id": "0ZmO4NHhMkocFP31vSfVOg"
  },
  "0iXV2koudxF6x7XkmLD0EA": {
    "date": "4/24/2019",
    "text": "Placed a group order, and everyone agreed to not order from here again. The Penne alla Vodka smelled like those brown liquid on the streets in NY. Highlight of our order was salmon salad coming with only three pieces of greens. \"She says just salmon\" was what was written on the take-out container. Who's she? My manager asked. Who's she? I said. On the bright side, we got 24 pieces of bread for the six of us, so if you'd like a bunch of bread rolls, order from here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "06028wx5Bn3E7sflOM0lPA"
  },
  "1vfIYd-i_zQQG4rNvnPzVw": {
    "date": "7/21/2018",
    "text": "Awesome place! Great food and service! The chef is super nice and accommodating! I am an Italian from NY and really appreciate this restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EYTgflshluR7o3DCBAgEXQ"
  },
  "v0gv7Z8xo-atsUmovViUKw": {
    "date": "11/15/2018",
    "text": "Aroojis never disappoints and it is one of our favorites, but I recently ordered our meals to go. I always hesitate doing this with fine dining restaurants, but Aroojis made the \"to go\" experience just as good as dining in, complete with the garbanzo beans and bread and grated cheese and they got our entire order, which contained substitution, perfectly! Great food and attention to detail...even to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CTRYOGTBOmuAmRsgg6b-5g"
  },
  "-qpq74ljwHLtH5GlbYlXGA": {
    "date": "2/20/2018",
    "text": "I think this restaurant is suffering. We walked in at 3:30 for a late lunch and were told lunch was over and an incredibly expensive menu of dinner items ($23 for most) was placed down. The exterior has large pics like you would see visiting Greece of food and sandwiches. I guess we missed the lunch cut off. Had stuffed mushrooms that were not as tasty as premade ones at Harris Teeter. My husband has the capeese salad with tuna salad, just basic for $15. I had ceaser salad with chicken for $16. No flavor on chicken which was over cooked and no flavor of any dressing. I had a glass of Maria Sauvignon blanc for $12 which typically is $7 around Charlotte. The owner needs to go eat and see prices at Illiois Noche. Plus the dust on the fake bamboo and chairs is gross. Maybe they can figure it out but I would not go back!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LXwIwJiObtyR5szpwwatRw"
  },
  "YBYuG853lbi8AxNierSrKg": {
    "date": "8/11/2017",
    "text": "Excellent dinner and ambiance!! Not to mention fantastic wine list! We enjoyed a great bottle of wine and dinner was amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "09BDHUr_-8wDLfrvPnhNaw",
        "caption": "Photo of Aroojis Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/09BDHUr_-8wDLfrvPnhNaw/o.jpg"
      }
    ],
    "user_id": "7b1r84tnEEK-XY5UIplTaQ"
  },
  "YRGdfDUotwvkCit1fqz6iQ": {
    "date": "7/19/2018",
    "text": "Cheap quality food. Terrible ownership. Owner sleeps in the restaurant and does not care about the customers. \"If they want to come here they come, if they don't, they don't\".- owner Steve",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G5u8om2JViaaKBOhZmdqLg"
  },
  "fd-OovKE5xLS7S8P-I3C_g": {
    "date": "1/20/2018",
    "text": "This was a great experience for the family. Food, service and atmosphere was top notch. Would highly recommend.  We will be back, for a date night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KH40Id0X-DjD5eq-hZvacw"
  },
  "nSnIZG6l5zgR_Bv4O7VFCw": {
    "date": "6/12/2018",
    "text": "I love this place! A warm, cozy, authentic atmosphere with amazing food. I love their chicken parm! The tomato sauce on it is incredible !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6aklT92xV0_duyUI9l84Pw"
  }
}