{
  "OcjMIVb1C9WeY1bBLnxhmA": {
    "date": "1/16/2017",
    "text": "I will start off by saying the food (once we got it) was wonderful, it is the service and poor management that needs work. we sat down, ordered our drinks (Coke and sweet tea) and appetizer. our appetizer arrived before our drinks did. we then ordered our meals. after waiting about 35-40 minutes, we were then informed our actual ticket order was lost so she needed to get our food order again. the waitress told us she would inform her manager so they could make it right. the manager never came by our table and addressed anything with us or apologized. after we finished eating our waitress brought our check to us which was full price. I inquired with her about the bill (since she told us earlier they would make it right) she took our bill to the manager, came back and told us that the manager wouldn't do anything with our check but our waitress took our appetizer off of the check and had to pay for it herself since she is the one that lost our ticket and it wasn't a kitchen issue. that was never our intention at all which I made very clear to our waitress. we made sure we left her enough of a tip to cover the appetizer as well as have herself a tip and once again the manager never came to our table or acknowledged what happened. I've been in the service industry for 10 years now and it reflects poorly on a restaurant as a whole when the management staff doesn't seem to support their servers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tj3X5-ZxZzyUATP5HpcjEw"
  },
  "hib7jr-BoD-7XkR5l3WW4A": {
    "date": "3/8/2017",
    "text": "I really enjoyed the patio today. The food was very good as was the service. They have a kids menu with the typical foods; grilled cheese, chicken tenders, etc. my only complaint was the outside chairs. They had some sharp metal edges and it snagged my pants. Before we left I noticed the same thing happen at the table next to me. Please replace the chairs! Everything else is great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iihncQES63JKNELMeBv9ZQ"
  },
  "lZYOtWCxD4PX7ifgtvZ-xQ": {
    "date": "8/29/2016",
    "text": "Wonderful food!!! Very large portions!  Great service! Great place to meet friends for lunch or dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FdHLefvDdCgfIZ5JeBbeVg"
  },
  "P-Wv9tHKj9wc4GvKb3hBuA": {
    "date": "8/21/2016",
    "text": "Visited for the first time. Was very pleased with the service and the food. Waitress was very attentive to our needs. Food came out of the  kitchen quick. Nice atmosphere on the lake. I will go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M1Nkk7skwn3Pz3VgHDz9Mg"
  },
  "jGLVINWXiGt734-TQhIfbQ": {
    "date": "9/7/2016",
    "text": "we went there on wednesday evening about 5:30,went right in and seated quickly. i ordered the prime rib cooked medium,salad came and is exactly a copy of california dreaming restaurant chains and is one of my favorites.the prime rib came and was overly cooked and asked our waitress to take back and get one not so overcooked,she came back with one a little better and i ate <a href=\"/redir?url=http%3A%2F%2Fit.it&s=cd70ccce3d607ad46f5cdaee887e162d6633f96a25dcca3397dfc4003af30df3\" target=\"_blank\" rel=\"nofollow\">it.it</a> was fair but not one i would order again.i will come back again because i think other things on the menu looked great and i look forward to trying some other items.i know that sometimes prime rib is hard to get just right but they need to work on getting it a little closer to what you order,i would suggest people who order this drop down one notch to get the desired cut,like order medium rare if you want a medium and so on.with that saying we enjoyed this place and will go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3U7Bob0ipDBvgoN1GXtYIQ"
  },
  "1_aP3VvramKPlVxORLhQYg": {
    "date": "10/17/2016",
    "text": "This is my second time going here. The wait was very long the staff does not seem to know what they are doing still. They have not worked out the kinks yet. Seems to be getting worse and not better. Others have said the same. Stood at the bar while waiting for our table. The younger bartenders or very nice but the older bartender with blonde hair was not personable at all. Very cold. Couple next to us complained about him as well. When finally seated I noticed a lot of tables were open and no one was seated in them for quite some time. Very unorganized! The wait time for the food was an hour long so we cancelled and left. The first time I want I ordered a chicken salad. Not impressed. It was mostly iceberg lettuce. I was very disappointed. Our waitress  was very sweet and apologized often for the delay which made no difference because our food still had not come out and we left. It is very dark atmosphere  and the floors  seem to be very slippery and uneven .  Very poor construction . Would not go there again or recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uOIma69BliiuIPNmuwD_ow"
  },
  "dC_AYhcKEyv450LR6wRpRQ": {
    "date": "7/3/2018",
    "text": "Been here two hrs, no food. Service is perfectly awful. Manager is terrible. Never going NLG back!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lKaTzPrRRa7Lim704bTkUQ"
  },
  "ciaqg7Zzj9tNbgB8o4nRgw": {
    "date": "7/24/2018",
    "text": "I've been to other J Peters and they were really nice and the kind of place to take a date.  Oh my god not this location.  The place was only about half full but the acoustics made it sound like a 1000 people were all talking at once.  Reminded me of a noisy sports bar.  The atmosphere was more like some tourist crab shack buffet.....but with steak house prices.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xT6-DnTtjV3kVTjQyOnSfQ"
  },
  "tTBHEyXP5f0m1gAahZNnXQ": {
    "date": "3/25/2017",
    "text": "If I could give less than one star, I would!! Oh god the food was so bad!!! I was too hungry and embarrassed to say anything in front of my in-laws but c'mon how can you have such a terrible fries and burger...and flavorless prime rib sandwich!! Oh wait..broiled steak!!! What the heck...normal chef would know that is unacceptable!!!!!!! plus the fact we waited for an hour for this terrible food....Bojangles would have tasted better!  The location is great but food is worse than Applebee....",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "chOxRdfT9W2efzZdWWOp9Q"
  },
  "y6e6H7VpLpqE1_S6XNxbzg": {
    "date": "5/6/2018",
    "text": "Everything here was below par. We arrived at 7:45 pm, and didn't get our food until 9:15. The shrimp was bland, the sweet potato fries were cold and bland as well. Overall totally dissatisfied.  I wouldn't waste your money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ntpDgTt2NuL94-_X2ENtQ"
  },
  "kwvvvHLsHQAzoYH0kq60_A": {
    "date": "3/25/2018",
    "text": "Ha, I guess that my review was overly wordy...spend your money if you enjoy less than.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "69W9b28qzWiNjBHlVi6anA"
  },
  "kbk_SO9_GdHVNBR6qRkHRw": {
    "date": "7/18/2018",
    "text": "I typically don't write reviews, but this place has gone down hill and fast. Biggest issue I have is with flys. I understand when your outside you'll have a few, but the place is infested inside and out. My wife got a chicken sandwich which was rubbery and she couldn't eat it. I have a club sandwich with a large hair in it. One upside is the house salad; that's very good. I will not go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l8OMYp3ttnTeOniPh1jY1Q"
  },
  "wekDWNg0CmFz8tdQHQRwgw": {
    "date": "10/22/2018",
    "text": "J Peters is one of my favorite restaurants! The shrimp appetizer is amazing! I have been here a dozen times and the food is always fantastic. I would recommend this restaurant to anyone. It is always busy but service is consistently good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_gxuVChuBnxZRvh9q4MoWw"
  },
  "tdN69x2rSHyUT9xkMzaadQ": {
    "date": "2/19/2017",
    "text": "Our first time coming to this restaurant was wonderful. The prime rib was amazing. The appetizer of cheese fries was yummy. The strawberry crescent desert was great. The 2nd time we came a week later on a sunday, we had to wait 45 min to sit. Then after we sat was told it was atleast going to be 30 min before we could even order food because the kitchen was backed up. With having a 2 year old and a 5 month old, that's just not easy for us to handle. On top of that, I asked if I could order my 2 yr old food and me & my husband will wait, that way the 2 yr old won't act crazy. We were told no. Not going back after that.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "u1QYcNRgcr4K4dCLqdvbdA"
  },
  "i5eMiCVg9k2xQRKB0nQzeg": {
    "date": "4/11/2018",
    "text": "We tried it out and I was not terribly impressed. Everybody else seems to love it and the honey croissants are excellent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H8YAT4lvKCduoT2nkDNp2Q"
  },
  "1axI_EpFE4hNHq5iu7QIiw": {
    "date": "7/1/2018",
    "text": "Horrible service and will never go again. My boyfriend and I were absolutely treated like shit. The bartender only allowed 1 drink and said something underneath their breath when handing it over. Even the friends that we were with noticed and said something about it. A male manager give us dirty looks every time we go... unprofessional service from the manager and the bartender. Not to mention how disgusting the restaurant itself is. The bathrooms always have flys and a lot of toilet paper on the ground. When I went back the booth, there was at least 10 dead flies laying, a few buzzing around and a dead one laying on the table that we were eating at. The food was alright.... except for the fact that me and the person I went with ordered the same thing and both of us had stomach problems for the next few days. The service sucks, and the food isn't worth having stomach aches over. If I could give this place 0 stars, I would. This is the last restaurant in Mount Holly I would recommend someone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fr_SBIeFIHhz0HNSfrl9SQ"
  },
  "gdb2dzZ9FcvR4U8YPggCWA": {
    "date": "4/15/2017",
    "text": "First visit. Waited 45 mins for a table and sitting in the restaurant now waiting for food, 45 mins after being seated. All we ordered was salad, pasta, a bowl of soup and prime rib sandwich. Everyone else's food on their table looks delicious. We lost our appetites. Will get it to go and sort through it later. On a positive note, my Sprite was thirst quenching.  UPDATE: 20 mins after writing the previous review and watching a party of 12 and a party of 4 receive their food before us and were seated a while after us, the food finally comes. My chicken and pasta alfredo had the equivalent of three tablespoons of sauce and my broccoli was hard. I asked the waitress for more sauce and she said they would charge me. I made her take it back. A few minutes later, the waitress comes back with a message from the manager that she will personally make my food with extra sauce. I accepted, but this whole experience was AWFUL. I will not patronize this establishment again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "faiykpfgHD68fxipGfpkKQ"
  },
  "Rd-sbwjPRMnOiyt9DBozjA": {
    "date": "6/24/2017",
    "text": "After a long day of kayaking this was a great stop afterwards to unwind and relax by the river. The J Peters Burger was okay. It's pretty huge, I could only eat half. The fried were fresh and delicious. I would want to come back and try some appetizers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QI2wIkILHMuhDfj3vX02ug",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. J Peters Burger was pretty good",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QI2wIkILHMuhDfj3vX02ug/o.jpg"
      }
    ],
    "user_id": "caV30R9uCewFdvtdhDg3Nw"
  },
  "G8xfOghlLrIMILW1SMMryA": {
    "date": "4/5/2017",
    "text": "This place is amazing!  The view, service (molly is a rockstar) and the food!  Grouper platter is wonderful, generous portions, and delicious. I want to come back soon. Just saw the appetizer shrimp...omg. i highly recommend this.   I sat alone at the bar, and it was a great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e25-QoozkM9J11p5QxDNbQ"
  },
  "lHDQcCKyfsI1hM5Apapa5Q": {
    "date": "7/6/2018",
    "text": "Stopped in for a late night dinner on the patio - enjoyed a bowl of the she-crab soup and Caesar salad. The food arrived quickly. The soup was hot and yummy. The Caesar  salad was cold and slightly overdressed. Cool breezes from the fans overhead left the patio at a perfect temp. Would visit again for the soup",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rk1u7AAH6jLcyTNN6q7Z4w"
  },
  "_5Iwj_gBgvshZL8ErNcPdw": {
    "date": "2/14/2017",
    "text": "Location, location, location.  Beautiful spot down by the river.  When I grew up in this area, all you could find was old fried fish \"fish camps\" in spots like this.  This restaurant is gorgeous and so are the views.  This is not haute cuisine, but it's tasty, reasonably priced and equitably portioned.  A perfect place for a romantic dinner, or to meet up after work and watch I-85 stand still on the bridge down the river.  This place must be booming in the summer.  I had an excellent time here and I will be back EVERY time I'm in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLETsn3GLsGFch3__puulg"
  },
  "6Qe-e_vbdp8OVJ76vLb-eg": {
    "date": "6/30/2018",
    "text": "I liked the place. Food is great, beer selection is bad. No porters or stouts. I did get a hoppy IPA and it was flavorful. I think it had a high alcohol percentage but I cannot seem to remember. They did forget our appetizer but they brought my wife's side salad out first. Wow. That was an entree salad. Also it had a honey and butter glazed croissant that was very light inside. This thing melted in your mouth. The salad had their home made thousand island, bacon, ham, almonds, eggs ,tomatoes and mixed greens. We are headed back tonight just for the salad tonight. There was a special on the steak so my wife and I split it. 14 ounces. It was fine but the salad was the highlight. My daughters had a J Peters burger.  It was a  handmade patty with Monterrey Jack cheese, bacon, our signature BBQ sauce, fried onion straws, lettuce, tomato, & pickles. Great combination of flavors. Luckily my daughter only ate a quarter if it. Worth a visit in my opinion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iatQL09WjKvj5DOz2QNDGw"
  },
  "xUvanqLGFV5uAhK9TbTCSg": {
    "date": "11/8/2017",
    "text": "This place is incredible. I love a great Ahi Tuna and it's undeniably tasty at J Peters. For $11.99 you can get a huge portion of a Ahi Tuna cooked to order, medium rare is the only way to go for Ahi if you've never order it - just trust me - on a sandwich with lettuce, tomato, onion, and tartar sauce (a little odd for Ahi Tuna, but not bad....I dip it for this sandwich since I don't want it for every bite). It also comes with a side and I usually grab sweet potato waffle fries with their homemade honey butter and it's incredible. Their cheesy mashed potatoes are delicious too.but the fish is a solid 8 oz portion I would say...probably a $7-$8 piece if you'd buy it fresh at any Harris Teeter or Publix, $9+ if you get it at Trader Joe's or Whole Foods. Same size fish on the Ahi Tuna Salad and the salad is very big. It's $13.99 and quite tasty. I prefer Oil & Vinegar or Balsamic and keep whatever toppings you like - and yes, the Tuna should remain medium rare as the most.   If you split an entree with anyone and want to get s soup or whatnot for yourself begin either, the She Crab Bisque is sooooo tasty and rich. It's real crab and a creamy, rich base. Their side salads also plentiful, but if you want something out of the box that you can get everywhere, try the soup and either the Ahi Tuna salad or the Ahi Tuna sandwich. Enjoy! Remember - medium rare at MOST!!! Rare is best (and still warm and cooked), but newbies will probably like medium rare better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LgE23a0MBvCty4uPWOlPSA"
  },
  "apvGj_H1lIbkJknhblRZbQ": {
    "date": "7/28/2018",
    "text": "The food was absolutely awesome. The service was great!!! The atmosphere was fabulous. Highly recommend this place. It has a peaceful river view. Dine inside or out. We will be going back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_eJ4g8dCHJg5FafI721_Iw"
  },
  "RuMVHy_aQYssvJKR8EWYkw": {
    "date": "8/21/2016",
    "text": "J Peters just opened - so while I'm going to explain about some of the issues that we experienced - it just opened, so I'm going to give them the benefit of the doubt and assume they'll work out those kinks soon.  J Peters is located in the same parking lot as Tailrace Marina - and also some new apartment construction so right now parking isn't great.  Once the construction is done, parking will still be tight super close to J Peters.  7pm on Saturday was super busy, so my friend went ahead and got us on the list for an outside table and found two spots at the bar.  Bryan the bartender was great - recommended some drinks and was very attentive.   We ordered the quesadilla and the ranch fries - both super huge portions that came very quickly.  Fast forward to a missed call from an unknown number - that was the hostess stand calling us about our table.  Its about 10 feet away, so we walk over and they've already given away our table - within one minute.  This is that opening-week kink that I'm going to assume they'll work out.  Cell phone reception is not great inside, and by not great I mean I was as close to the windows as I could be and had 1x service occasionally with Verizon.  If the hostess stand insists on using phone to reach parties in line, there could be some issues.  So back at the bar, waiting for our outside table, they try to sit us inside.    So back at the bar, waiting for our outside table, it happens!  We can sit outside!  We take our appetizers and our drinks to our outside table and enjoy the waterfront views.  A few minutes go by and I start to think that its odd that we haven't seen a waiter/waitress yet.  Twenty more minutes go by and it gets to be a bit odder.  Finally, Bryan - the bartender - shows up and lets us know that he was just informed that he was supposed to be waiting on us.  Interesting, but works for us because Bryan was awesome.  All in all, I'm hoping some of those kinks get worked out and I can come back and give this place a 5-star review because J Peters has great potential!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ziF9bL2WU9boE6du0yAIA"
  },
  "tD6PbpzlkhNOQB2zgkmnSw": {
    "date": "10/4/2016",
    "text": "I was not overwhelmed by the food or the service.  Would return but mostly for convenience of location. Bartender  struggled with making a drink on the cocktail menu, finally another one came and made it.  Went on Sunday to watch the game, was pretty empty, games were not on. Maybe they are are still working out the kinks.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ifacscc-JGOmMy06xpv2iw"
  },
  "JxN5fGDCCeFNIgixS_Wuiw": {
    "date": "8/26/2018",
    "text": "This was our second trip to J Peter's.  The first time wasn't great but we decided to give it another chance.  The first thing I noticed was the sanitation grade, which was a 91.  Normally I wouldn't have even stayed with a rating that low, but my grandmother was taking us out to dinner and this is where she picked so I didn't say anything.  There were also mutiple flies flying around the restaurant and our table.  The service was decent, our waitress was by frequently and brought everything we needed or asked for.  Our food, however, was not good at all.  My steak salad looked good when first brought out, but under the mound of onions and steak the lettuce was slimy and old.  My husband's salad was the same.  My grandmother had the potato soup which had an odd flavor and was cold.  We all three had stomach issues afor three days after eating here.  We won't be back.  I encourage everyone to find the report online for the sanitation grade and see what the violations were before you eat here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ztr6JYYU6QZHqPmFeIVBEw",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Slimy gross lettuce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ztr6JYYU6QZHqPmFeIVBEw/o.jpg"
      },
      {
        "img_id": "SxZjLxMsFGCMbObiUXWeOg",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Ahi tuna salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SxZjLxMsFGCMbObiUXWeOg/o.jpg"
      },
      {
        "img_id": "FbeGTWGLJrElbHSq9JCqpQ",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Honey butter croissants",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FbeGTWGLJrElbHSq9JCqpQ/o.jpg"
      }
    ],
    "user_id": "oBVcFTk3qRn4P7NwO-qiHA"
  },
  "qgas_m1mwPbPb15W0tLuhA": {
    "date": "4/18/2018",
    "text": "We've been here many times and after one poor experience, we took a long break. We just went back for the first time last weekend and it was delicious. It's a little more expensive than some of the competition, but I can assure you - you will not find a larger grilled chicken salad for $10! The croissants are SO good. And I mean SO, SO good. One comes with each salad, so if you get a salad, you still get your croissant and then you can feel better about eating the buttery goodness that is the J Peters croissant. The chicken tenders are also very good and the sirloin is definitely a much better quality than you find in a standard chain restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z3POJ4axjeTjI1-8eWSlmg",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. $10.99 and two meals worth!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z3POJ4axjeTjI1-8eWSlmg/o.jpg"
      }
    ],
    "user_id": "IfhacZEGE1p3qTHxmU3SCQ"
  },
  "6xcVDhCL_MWMQIr9Wcwg0A": {
    "date": "1/16/2018",
    "text": "What a great spot! We arrived on a Sunday evening with approximately 16 people and needed a seat and got that seat within the hour in the meantime we were greeted by Hannah at the bar and she was awesome. She was very attentive while being also very busy! What I thought was strange for her was she was making drinks for the entire restaurant and she was also answering calls for to-go orders when there were perfectly capable hostesses that could do that. But anyway she was still good and she took care of it made great drinks and was very sweet. We got seated all of us together which was awesome. We were then greeted by our server Q who was also just as awesome, she was attentive very prompt and knew exactly what we wanted and the best part was she was a blast. The food was good as expected the location was nice, it was dark so I could not see what the marina looked like but I'm anxious to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S6fYxRnJzcwa9rQ0fViCgQ",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Our server found out that it was a birthday / engagement celebration and she brought us this! She was awesome!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S6fYxRnJzcwa9rQ0fViCgQ/o.jpg"
      }
    ],
    "user_id": "kCQATyW43WfNt7xYCoxtMg"
  },
  "7D-WRGytrji0sIBj_y1MMg": {
    "date": "8/6/2018",
    "text": "The food has always been great the two times I've been here. Servers have been friendly and attentive, constantly refilling drinks and getting us more chips. Great atmosphere and nice views being on the water. I would suggest getting a reservation as we've had to wait both times.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BgmmCHXKgPWAywecBUmHog"
  },
  "GoF_RO1w3hEhhVEqcu6Vdw": {
    "date": "11/10/2017",
    "text": "Not a quality establishment. Service was excellent. Waitress very attentive. BUT food came out together. Appetizers and salads. Main course not far behind.   Sirloin was good. Not great. Special of the night was 14 ozl ribeye. More fat and grizzle then meat. Difference between choice and prime.  Atmosphere..dinner. Seats were uncomfortable like a worn out fast food restaurant.    Reminds me of Old Stone Steakhouse.  Poor food but its the only steak house in Belmont.  Do yourself a favor and go down the road to the Webb Custom Kitchen. Much bettet quality.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "YhUgoIgk_a8HJmqeLobvHA"
  },
  "UJU6V0UG9baLvjsiqSG1fg": {
    "date": "6/8/2018",
    "text": "Let me start from the  beginning. My coworkers all decide to order from J Peters Grill & Bar.  We work close by and order quite frequently . Orders were placed and a coworker went to retrieve our takeout orders.  I decided to surprise a coworker with the barbecue chicken and queso cheese nachos. Every time we have ordered that item off the menu the items come in separate containers. Today that did not happen. The queso cheese was poured on the chips and the barbecue chicken was on top of it. They made the chips soggy as our lunches range from late morning to late afternoon. I decided to give them a call, asking can the meal be replaced. I called at 11:50 was put on hold until 12, hung up the phone. Called back, only to be told that the managers were very busy and unable to come to the phone.  So the coworker that I surprised with the meal went back after getting off work at 7 PM to replace the meal with receipt in hand. They gave him a hard time about replacing the meal, but eventually did. Needless to say my coworkers may continue to order from this establishment but as for me being told that a manager didn't have time to speak to a customer is apprehensible. Finish, done, did.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zjYi5IO6dB0oYa_I_llcvg"
  },
  "8F-4Rt5CYm-QmZsoe7JgFA": {
    "date": "10/21/2018",
    "text": "Posting On My Wife's Yelp Account: My wife and I, along with two of our friends went to eat dinner last night at J Peters.  My friend and I both ordered a beer and our wives ordered a bottle of wine.  We ordered our food and had an appetizer.  Then my wife's salad (that came with her meal) came out and she ate a few bites only to find a plastic glove in the salad mixed in.  We complained to the manager and he said he would comp the salad only.  We laughed and said we were not paying for anything and we no longer wanted our food.  He insinuated that we are simply trying to get free drinks and food.  He (the manager) proceeded to threaten to call the police.  We agreed that he should.  We walked out.  I go to this restaurant a lot for business and fun.  My friend lives on the lake and he goes to this restaurant all the time.  I was so insulted by this manager's treatment of us, that I will never go back.  I will also tell anyone who ever listens to NEVER go to this place again and that this manager should be fired.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tCTUknuE3n9pGUtnEe8vg"
  },
  "TZz_hVzdaobrTWBLUXI8Kg": {
    "date": "5/26/2018",
    "text": "Used to go a place called The River Rat in SC for years to get their Prime Rib.  They closed and we haven't found prime rib we really like until now.  Great Prime Rib.  Great Service.  Great Atmosphere.  Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1bHFFYH6qRhNceeGA0-BoA"
  },
  "4E5UkwCn8rrVEZS5bJFPOg": {
    "date": "3/1/2017",
    "text": "What a hidden gem in Mt.Holly, NC. This restaurant sits on the banks of the Catawba river and it is just a beautiful setting.  Food was well prepared and presented.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0jz4ZG81WCkQOXnVrZRqwA",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Black &amp;amp; blue ahi tuna salad  Delicious",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0jz4ZG81WCkQOXnVrZRqwA/o.jpg"
      }
    ],
    "user_id": "ZVBbc_8fmLEXCHJjIHNEAQ"
  },
  "HuIWcFhYxYqtH3DH6XJmNw": {
    "date": "5/31/2018",
    "text": "This place is great for the view, and decent food. Some things are a hit and some are a miss. Personal favorites are lava shrimp and the steak sandwich, my husband likes the burgers. Great staff and variety of drinks. Only reason why it's not 5 stars is because sometimes the food isn't consistent but that's expected for such a busy place on the water.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oOPGZ9iYzxsDlPxTURZmTg"
  },
  "7NOwv2vkP2FM0mziYG7kCw": {
    "date": "3/28/2019",
    "text": "I love J Peters and particularly their J Peters salad. This is why we came to this restaurant on our trip to Charlotte this past weekend. It was a bit out of our way but I thought it would be worth it because I love that salad so much. But, this must have been a bad weekend because i see many people complaining about their awful experience over the weekend. We also had a bad experience. We got there about 12:50 and were fortunate to get seated right way. About halfway through our meal, the crowds arrived.  After getting seated, it was all down hill from there. Service was slow to start with and just got worse. Our server was James Q and I've never seen someone so disinterested in his job. He literally could have cared less if he served us and certainly didn't listen to requests. First off, we asked for our dressing on the side and instead it was on the salad. That was a shame as it really detracted from the taste of that yummy salad. We were in a bit of a hurry so after a few bites and realizing the salad dressing all settled to the bottom, we didn't feel like we had time to send it back and get out of there in a timely manner. We tried to get out of there as quick as possible but because our server had no clue about how to be efficient in his work, it took us forever. I've never been a server before but I'm quite sure i could have done a better job than this guy. We overheard one guy say that this was his second day on the job. Maybe our server was new as well, perhaps he was new to being a server. Perhaps, they just pulled warm bodies to work because they are desperate for help. This restaurant certainly is not on par with the J Peters in Columbia, SC. This restaurant this weekend is certainly a black mark on the J Peters name. I was intending on writing to the manager but it appears from previous reviews, that he/she really doesn't care. Instead, I'll write this review in hopes that others will be wary of patronizing this place. I'll never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pZuTj6Yz99iRRPn93VutJQ"
  },
  "9v2eQT2QPLt3uk4XH2NT8w": {
    "date": "7/23/2018",
    "text": "I give J Peters 3 stars simply because of the atmosphere. The deck is very nice, comfortable and the views of the river are lovely. There aren't many places in the Mt. Holly area to find this atmosphere. The food is just OK. Burger patties are obviously not made in house, the cheese dip was plain and had very little flavor. Not a bad place to visit for a small variety of local craft beers and a nice outside seating area, just don't expect to be wowed by the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYFXppDIn2rpwdj_Q4RB1Q"
  },
  "BWiYp-EEOjGGKmt2DiCNiw": {
    "date": "9/22/2018",
    "text": "We'd been here twice before, the last time just two weeks ago, and had decided J. Peters was going to be our place to come after going to the whitewater center or kayaking on the Catawba River with the dog. Very good food and good beer selection. Friendly service and a great outside dog-friendly deck. Until today. Got there on this beautiful sunny afternoon, my wife went to ask for a table on the deck only to be told that dogs are no longer allowed.  Needless to say, we were disappointed. There are plenty of restaurant patios spaces in Charlotte that will allow dogs; we will seek those out and not return to J Peters.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkRKjjBmzyE6hDmAFL_ZHA"
  },
  "uHHcEw5ZBQhUVxaT-LhMjg": {
    "date": "6/23/2018",
    "text": "Been here a few times and have tried a good portion of the menu. The outdoor view is phenomenal, but the indoor atmosphere is really lacking. I've never quite liked the drinks here, I feel like I make better at home. Overall, it's been a good place, but I think it tries to be more than it is. Prices are a little high for the quality, and a lot of the food is coated in fats like oil and butter. Great place for appetizers though, I love it for just meeting up with old friends!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j8FPEI84GQup2VN_0ngrQw"
  },
  "flujWl8-0dOhxCgZ2M2ASw": {
    "date": "4/10/2018",
    "text": "My husband and I were not impressed at al. Quality of food is sub par.  Not the best chain restaurant out there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gJAUD-7MZZK7USQxfAYeXg"
  },
  "2314ynduXynhilpUKa0IUQ": {
    "date": "6/6/2017",
    "text": "After floating on the river with my Wife and Dog on our kayak, we were famished and needed to get something to eat. J Peters was close to where we put in, so we packed up and headed over for a late lunch. We were seated quickly on the patio, and even used the chance to move closer to the water as the wait staff was very friendly. I didn't know this place existed, and enjoyed the view of the river close by. We ended up going low key and ordering some local beers and split a Ahi Tuna sandwich with sweet potato fries. The beer selection was decent and cheap ($4.75 for local craft beer is cheaper than you can buy it at the brewery) and the food that came out was enjoyable and well cooked. I can't comment on how this place would be for dinner, but for lunch the spot, food, and prices are hard to beat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "nvHJFFr5R74ug5NOh2VDPg"
  },
  "st5JtBEXyYNmeScC1nKEvQ": {
    "date": "3/7/2018",
    "text": "I had a wonderful dinner tonight at J Peters. It was our first time and our waitress Logan was quick to recommend some great cocktails we loved and helped us to navigate the menu. Our friend Roger was a little intoxicated and she knew just when to cut him off. A+ I wish more servers had this kind of training. He wasn't even offended! I had the tuna sandwich med rare and it came perfect. We will be back. Thanks again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8Z1Hm3VkAf4wAlG7fm-ysA"
  },
  "9tIZtsdQSqXXXvqx1LKIUg": {
    "date": "4/4/2018",
    "text": "We go here all the time! Indoor and outdoor seating on the water. Portions are huge! We always split an app and a meal because it's so much food. Best croissants ever! I highly recommend the house salad, J Peters chicken, and the strawberry desert!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VO-qpiAbTKd6C-wKKCsd4g"
  },
  "EHpBnYH0iKnq8fw-IzBJRw": {
    "date": "4/13/2018",
    "text": "No no no.. service was ok, server seemed a little overwhelmed but was so kind... food was not good at all.. had the she crap soup and it was disgusting, I was afraid to eat it for fear of getting food poisoning.. manager replaced with potato soup, asked for no bacon.. still had bacon on it, sent back and the second serving had bacon as well.. come to find out it is made with bacon in it.. neither manager or server know the menu.. the drinks were over powered my alcohol.. the shrimp appetizer was drowning in sauce... left hungry.. not sure that I will be back.. FYI had to tell host twice that the bathroom was dirty..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_iVVwYhqTl8XGuxnJGySNA"
  },
  "b-GfbyKo-jlfwoINu0-bLA": {
    "date": "5/11/2018",
    "text": "Excellent food and service - drink prices are way to high for Mount Holly - daily beer special would keep me coming back.   $6.00 for a draft IPA was a tad on the high side.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rDUxstWvH7NJyKkrmBH1vA"
  },
  "IHkoShGcWoVj2qd2GS74yw": {
    "date": "3/25/2017",
    "text": "After hearing rave reviews of J Peters, my wife and I decided to give this establishment a try. I'll give them credit for great location, nice surroundings and decor and a pleasant enough wait staff. The first issue came with a 1/3 full restaurant and we were seated right by the kitchen. I let that go and ordered a glass of wine for my wife and a beer for myself. That took almost ten minutes to get and we still had not had a chance to order a meal yet. To make things easy, we both ordered she crab soup ( which was excellent), a house salad for her and a chicken salad wrap for myself. I got MY soup in about 10 minutes an nothing else made an appearance for 35 minutes. I asked about the status of our order and was told that the kitchen was backed up. I mentioned that it was all cold pre-prepared food and that none of it should take this long. By now we noticed people arrive, order, get served and leave, with us still waiting for a salad, a cold wrap and one soup. I asked to speak to the manager who took her own sweet time coming to our table and miracle of miracles, our food arrived. My wife's salad showed up minus the soup and my wrap came sans french fries. They haven't finished in the fryer yet I'm told. My wife's soup finally finds it's way to the table it's the wrong soup. The manager finally shows up and I explain my frustration only to hear the kitchen is backed up. Backed up? It's mid afternoon on a Saturday with a restaurant that's less than half full and they can't keep up? We were offered a free desert for our inconvenience but by then I was on my soap box. I explained that I wasn't interested in any kind of comp, but she needed to understand that she was in charge of all of this mess and was failing miserably. Reading earlier reviews, this seems to be a recurring issue with J Peters. Obviously someone has spent a big chunk of change to bring a great dining experience to little old Mt. Holly. They need to address this kitchen issue soon or they'll find their clientele start finding other establishments to spend their dining dollars, like me. Bottom line, food - very good, atmosphere - pleasant, wait staff - adequate, kitchen staff and management - fail.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "OkecNiefzmRt3cSzAnXwCQ"
  },
  "Tt0aZmsWcTE3wxoEWSblMw": {
    "date": "8/11/2017",
    "text": "It was a Thursday night and I couldn't believe the wait. The parking lot was full. This is a place seemingly known for steaks. The clientele seems to be on the older and more affluent side, but the prices are extremely fair. The atmosphere has a classic elegance, wood and black. They also have an open kitchen with I always prefer. We got sat in a reasonable time and the food came out in a timely fashion. I ordered the club sandwich (which was not quite what I expected--only one layer with lots turkey and ham on a grilled white bread) with fries and the house salad. I really enjoyed the house salad and the club was very tasty. My friend ordered the chicken salad wrap with she did not like, but she did order the cheese mashed potatoes, which was decadent. The potatoes are served covered with a cheese sauce and browned in the oven. A must try when I go back. They have a great outdoor bar with seating. I'd love to go back in the fall with the leaves are changed. If you get a window seat, you have have a great view of the river. This restaurant is tucked away inside of residential area, and off the beaten path, but don't knock it until you try it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MU8NYqHeB0hmGRNcWSGGmA"
  },
  "jQ-uX1hOB7cT1-HhIBVEng": {
    "date": "11/8/2016",
    "text": "Food was delicious. Price was appropriate considering the quality of the meal and atmosphere. We visited for my sister's birthday with a party of 5. We were seated in a timely manner for a moderately busy evening and our waitress went above and beyond adapting to the personality of our table, along with being attentive and heart warming without being overbearing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XDejk2hU0w4X_T-sOX49QQ"
  },
  "90QBvYXHagj42RG0yjFmKw": {
    "date": "10/17/2016",
    "text": "Outstanding. Patio seating with a great view of the river for 4 adults and two small children. The kids' meals were brought out early without us having to ask. Much appreciated. The Caesar salads were great as were the entrees. We tried the fried shrimp, a burger, and a prime rib sandwich. We'll definitely be back whenever we're in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1M2gTYnRA2ZGWiwWmRoTEA"
  },
  "-CWPC6E3troC070a6CUJZw": {
    "date": "9/20/2017",
    "text": "Great atmosphere, the friendliest bartenders, and food is outstanding.  The ONLY reason I can't give this a 5 star is because the waitstaff for tables can be slow.  I have only been seated 3 times (usually sit at the bar) and every time it took 20 minutes to be acknowledged with menus in hand, 30 min to received the food, and forget refills, once the food was delivered we never saw the waitress until we asked for the check by someone else.  LOVE THIS PLACE but more training needs done for the wait staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgXaTESCFyBanibUiH4vyA"
  },
  "jzT0OZ-o6oYEuUhauIJjww": {
    "date": "10/12/2016",
    "text": "This was our third visit. Went first for my birthday.  There was no acknowledgement for that which I think is rare these days. No bother. Food was greatly enjoyed by our entire party.  Second visit was absolutely perfect. Totally enjoyed the j peters chicken.  Recommended the dish and restaurant to my coworkers.  Third visit, today.  Total disappointment.  Wife's soup was unacceptable.  Received my entree, the chicken, before my salad. Both our salads, when mine did arrive, we're swimming in dressing.  Wife wasn't thrilled with receiving lettuce core.  By now the mood is totally ruined.  Did ii mention that this was a dinner to celebrate our wedding aniversary?  I mentioned it to them. So, apparently they have no form of recognition for special occasions. Birthdays,  aniversaries mean nothing here.  We'll go back. However, we certainly won't expect the treatment we've received at other places on special days.  Still highly recommend this place. Just hope our next visit is better.  Trust it will be anyway.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Au8c6_c7pVqq_1roFN-RWQ"
  },
  "jayCDVsyTg6Jho1OTmzXug": {
    "date": "10/7/2016",
    "text": "Had a wonderful experience a JPeters tonight! Food was wonderful and the service was excellent. Will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jHgVLBxOYvpiRSjBq4G4mA"
  },
  "AhUIXjn1E0d2bQIoPAKp4A": {
    "date": "7/7/2017",
    "text": "Went for lunch today.  Party of 5. Was seated fairly quickly considering a 30 min wait.  We ordered drinks and appetizers.  This arrived and were good.  We ordered our lunch.  2 Burger,wings,Ahi sandwich and a Ahi salad.    55 minutes after we ordered I asked the waitress and it was still going to be another 15 minutes.   We had to be somewhere so said we would take it to go.  We're told it would be an additional 10 more minutes.   At this point we canceled our lunch and asked for check.   Still paid for our 2 appetizers and 3 teas and a coke.   No compensation was offered and only an apology from the waitress who said it has been this kind of delay all week. The manager was to busy to talk to us.   I was bummed about this.  Finally excited for a new place to eat In Mount Holly.   Not sure how the food tastes but over an hour is way to long to wait.  The fact that they really don't care is just a show of poor management and we won't be back.     Update-we have tried two more times.  Second time my tuna was overlooked.   Third time we were with a large party.  Ordered a bottle of wine.  She brought it to the table with 4 glasses and left it.  Not opened and no opener.  She did not come back until the food was served.  When we addressed it she was like oh I'm sorry no one trained me that I had to open the wine!!!!     3 strikes never going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6KQlQ9OMMZY5U0W68zIKKQ"
  },
  "2tWBwFYhk5PhaxzEb6ppuA": {
    "date": "6/24/2017",
    "text": "I love this location, I love the patio, I love the atmosphere!  I am just so terribly dissatisfied in the food.   I have eaten here several times, each time hoping something will improve.  On at least 4 occasions I have been sick upon returning home after a meal at J Peters.  Tonight, I ordered the filet minion.  I asked for medium rare and the first go around was served a blue steak, I sent it back and the second time around was still very raw, as you can see in the photo, definitely not worth the $26, additionally they refried my sweet potato fries and burned them.  I asked to speak to the manager and despite his very obvious disinterest in what I was saying, gave us nothing more than basic lip service.  My hope is that the owner of this establishment reads this post and makes some very needed changes to management at this restaurant.  I would hate to see it fail as we so desperately need good restaurants here in Mt. Holly!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BNjdlX4D7qkQf-7sEVy5BA",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BNjdlX4D7qkQf-7sEVy5BA/o.jpg"
      }
    ],
    "user_id": "OxeKw0J81iodVuDybc5cLA"
  },
  "uo6jhK38hevayUsiNpisCA": {
    "date": "6/24/2017",
    "text": "Not worth it . Food other than burgers is bad. Been there 10+ times thinking it was training. Had wings once not cooked through and they refried them with the sauce and all on them. Nope. Ok for drinks .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T6hLhOEz6K_a3rv1XfcjGQ"
  },
  "ROn-R62aux6xtSSqKvsmSQ": {
    "date": "4/22/2017",
    "text": "Great food selection and amazing view! You can get nice bar bites or have a higher end meal! The staff is very friendly and helpful as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CoLTNpjcAHMCqp34aEo3iA"
  },
  "FZgDoa184Au48yfCFCIHaQ": {
    "date": "4/30/2017",
    "text": "Very good but the service was a bit slow but then again it was packed. Parking is tight because it shares its lot with the marina and is located near a residential area. Potato soup is wonderful club sandwich was good but bacon a bit too salty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q7GCqimRxhQJCTaNV_mVVQ"
  },
  "gJ9-pQugkaGVkSp5pdBvFQ": {
    "date": "6/12/2017",
    "text": "Nice restaurant on Lake Wylie but service is not very good and food just ok for the price, they always drench the salad with dressing so order on the side. Hope it gets better",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EjwB0rMNdi7wL_5jfAm9bA"
  },
  "bOvZGUXlySrCW7WQqX8P-w": {
    "date": "9/16/2016",
    "text": "Hearing so many good things about this place, and hoping to finally have a good restaurant in  Mt Holly, I really wanted J Peters to be great.  Our experience was mixed.  The sweet tea and the appetizers were great.  We had the croissants, barbeque nachos, and she-crab soup.  The croissants were melt-in-the-mouth great.  The she-crab soup was rich and flavorful.  Our son had the barbeque nachos as his main course and they were very good. The main courses my wife and I had were disappointing though.  My prime rib sandwich was shaved and overcooked, which made it taste like typical roast beef, not prime rib.  Also had to order horseradish, which should be automatic with prime rib.  My wife had the seared tuna sandwich, blackened.  She said it was bland.  It should have had at least a small kick if it was blackened. Although our experience was not stellar, we will be giving J Peters another try, just making different choices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eUIuiO9wiap0X_Nc0O6P2g"
  },
  "GsJTQMRUTgP2YINoVEnZ2w": {
    "date": "1/20/2017",
    "text": "Really great food. Awesome views of the river. Try the fried croissant with strawberries :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n_a342KAs6ODg9k7Ge6eig"
  },
  "q4N1TuHsNmwgKbVesdNe2w": {
    "date": "8/20/2016",
    "text": "Excellent food, great service! Food arrived hot & quick! Highly recommend this place, outdoor patio was very pleasant!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wgpi9ZglPc91PTvWhL1t3g"
  },
  "dZqht7oH-EBGKyQsq7dNmw": {
    "date": "9/5/2016",
    "text": "Well it was my 2nd time here.  The first time it was just for drinks and it seemed great!  This time was different, we ordered food and the food took for ever to get to us.  When I finally got my burger, it was completely wrong from what I ordered, and was so dry I could not ever eat half of it, very disappointed, and would never order a burger again from here. We were also having a few drinks, and our waitress never came to ask us if we needed another drink, we sat there with empty glasses, so I got up and went to the bar to order drinks myself. It is a great atmosphere and I will go back, but hope the food is better next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wXtOQEnQo9hzKc-Mc0tmDg"
  },
  "Z1Twt4hWZYvN7_qVGSFiLQ": {
    "date": "5/14/2017",
    "text": "Been here several times but tonight will be my last , was told an hour and a half wait to be seated but staff was not cleaning the tables was ready for the next group  ... we  always get the cheese dip as a appetizer . when they came out we sent them back not once but 3 times because the chip was not cook and was like rubber . One of the staff and customer got in to big argument at the bar . In front of other family's and children causing a big scene... but our waitress Q was great !!!!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hQ9k9zANTsiq9aq2_km7XA"
  },
  "IOS_7CsWKWjAkY0W0C929A": {
    "date": "2/28/2017",
    "text": "Saturday evening and prime dining time.  There were 15 names ahead of us.  Problem...There were three booths and two large tables empty during the half hour we waited before leaving. The greeter was consulted and she said that it is their policy to call the next patron on the patron's cell phone and wait until it is answered.  Maybe the restaurant supplied buzzer would be more effective.  Did not dine and thus no rating for the food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "peIS9Mti2zp6riYuY_OeKw"
  },
  "mOVislpQil2K1zeay1Awjg": {
    "date": "10/7/2016",
    "text": "Great new spot on the water in Mount Holly, which is desperately needing some new eateries.  Great atmosphere, great wine list and very reasonable. Lava shrimp appetizer was delicious with the right amount of \"hot,\" but it's hard to mess up fried anything, especially smothered in hot sauce.  I got the blackened tuna salad and ordered the tuna cooked rare.  It came out medium-medium well. Mixed greens were really iceberg and overall didn't seem fresh.  My boyfriend got tenders and baked potato, (again, impossible to mess up,) and my girlfriend got grilled chicken, Caesar salad, and steamed vegetables.  I think everyone else had a better food experience than me, so I may be willing to try it again.  Maybe just don't come here expecting to get anything relatively healthy that actually tastes good?  The (I'm assuming) owner did come over at the end of the meal and was very polite and thankful and appreciative for our business.  Decent atmosphere but my meal didn't do it for me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Mb1RhZDxSynjK9XTcQnAA"
  },
  "H5ligloFXMEpY-aV6kiInQ": {
    "date": "6/10/2019",
    "text": "great food and the outside patio is the best on a nice night. The only downfall I have found is that the kitchen WILL NOT mix wing sauces. I, on two separate occasions have asked the server to have sweet heat wings. They serve bbq,mild and hot. I asked for them to mix half bbq with half hot sauce and toss the wings. They absolutely wouldn't do it.The server brought me my order of hot wings and a side of bbq so I could mix them myself. My thoughts were cancelling the wings all together because I thought it was obsurd and save the ten dollars. Still like it there but thought restaurants were about customer service and pleasing the customer not losing a sale or customer over something so easy to do.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ab7co0XzDF-g2310idJnHw"
  },
  "L0p2rvGe59ugShXmvUi91w": {
    "date": "5/26/2019",
    "text": "Great place to enjoy some good food and drinks. We always sit at the outdoor bar. Friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JExZrAYLJjvsMREZFcRqIQ"
  },
  "PXThyvuWD-I4m5_Pn5qJGA": {
    "date": "3/8/2019",
    "text": "Love the food here!! The fish and chips, chicken tenders, or quesadilla is the best!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ro3Zpko2kq1rqiVMJI6KRQ"
  },
  "SeGJpKmKmDSLz2CeacE1pA": {
    "date": "2/23/2019",
    "text": "It was a good ambience but not a lot to choose from the menu. Location is great love the water views. Prices are not bad over all not bad",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8egFPyoHV8lQ5TgElalZEg"
  },
  "5t6Jzt6hq15AFt5ZAqfWQQ": {
    "date": "2/10/2019",
    "text": "Food is great. Wait staff has always been very nice. It's very busy during the summer , which tends to have servers running around crazy and I understand . More staff should be added during peak season. No complaints here!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qnb3aW6M6B-c3GS_N4K3aA"
  },
  "kEeee5kPnJR5WokLX8sbxQ": {
    "date": "3/23/2019",
    "text": "Do not go to this place service is awful ad they let you go and wait on what is supposed to be ac40 min wait is an hour and a half and do not seat you in the order  it is awful situation place is going Dow hill stay away from this place. No star is deserved but you have to leave a star to to leave a review",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U1mpr5l1blHJNu8hvIexUw"
  },
  "qqeosM0Etb59udUerrtSBw": {
    "date": "5/21/2018",
    "text": "Check out my latest Wing review from J PETERS GRILL & BAR In Charlotte, NC. Type Wingman Collier in the search for Facebook and YouTube.   Enjoying wings and a great scenery!!   Keep the Wing Train  Rolling & Enjoy Life One Wing at a Time!! J Peters Grill & Bar",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_nEVFYSbw_B_0ZT-cVVxHQ"
  },
  "yyZZfTbduxCvmlSbhQ_aDQ": {
    "date": "9/4/2016",
    "text": "Fantastic!  About a 45 min wait for a patio table, the wait with good company was worth it.   4 selections off the menu: Prime Rib sandwich, Grilled Salmon, Chicken Fingers platter w/ mashed, & the Blackened Tuna sandwich.   Let me say up front the non 4-star reviews (if u take the time to read them) are laughable. As with most Yelp posters, you can deduct that the complaints were due to the customer having inflated expectations or pure ignorance.   The service was exceptional. From the greeting at the hostess stand to Mackenzie taking care of us. 1 item was sent back to the kitchen for additional cooking, understandable for Salmon. The chef returned with the re-fired salmon, delicious.   Everything was above expectations, the atmosphere was delightful and the staff presented an attitude of desire to be there.   Understand, this is only their 3 week of operation, literally a feat in itself. The service was great, the food was delicious, and the process of turning the table was on spot. Great job!!  If you don't visit J Peters YOU are missing out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PM5XZ3px3gr71apoPb_ksw",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Blackened Tuna sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PM5XZ3px3gr71apoPb_ksw/o.jpg"
      },
      {
        "img_id": "4fhzPmxQVj3WYoOkN_DGZw",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Salmon w/ potato",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4fhzPmxQVj3WYoOkN_DGZw/o.jpg"
      },
      {
        "img_id": "nUSe1J7k4EOLGYlIme5lAg",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Chicken fingers platter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nUSe1J7k4EOLGYlIme5lAg/o.jpg"
      }
    ],
    "user_id": "rh27ydFpR-fOIA2BhB2Z5g"
  },
  "ZXyc_zgLTmJIh2ylZ1jWeQ": {
    "date": "10/4/2017",
    "text": "Visitors with four kids under ten with food restrictions can be challenging  They wanted a patio, preferably by the water,and not too expensive  And not too loud. Well this place fit the list perfectly. Very pleasant atmosphere by the water and big enough menu to find something on there you would like I love the big house salad   And I love their prime rib   It cooked in house and a big portion. Enough to share Baked potatoes after 4pm. They have a full bar We came as a table for 8 at 5 pm on a Wednesday. Very fast and courteous service. Very short wait for drinks , salads, and meals , even though there were special accommodations for food allergies  The burger is big and you can get it cooked however you want. Even rare The fries were hot, plenty of ketchup,drink refills The apple crisp dessert was huge and enough for four Lots of waitstaff working today and our server was on top of everything  The patio is pet friendly so I brought my dog too! Very comfortable place, good value Need a gps to find it. But I'll be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4qVvtf_B6iP88KADVrEffA",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. View",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4qVvtf_B6iP88KADVrEffA/o.jpg"
      },
      {
        "img_id": "dNry88Wg6rThx7tbCzdo5w",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. View",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dNry88Wg6rThx7tbCzdo5w/o.jpg"
      },
      {
        "img_id": "49ztCOxl-IYbqCWAlb3nww",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. View",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/49ztCOxl-IYbqCWAlb3nww/o.jpg"
      }
    ],
    "user_id": "hvs6n04dKZheWJVzhB7TDg"
  },
  "Kg81-Doq_nTdrz9QtAtm0g": {
    "date": "4/25/2019",
    "text": "Wonderful restaurant!  The food is delicious, the staff is great and it's in a beautiful area.  My niece and her family and I went on Easter Sunday (think 4th time) we sat outside and it was great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cqyc4u3_yLLeEpHOx4OSLA"
  },
  "uPY7xQM_U7P6ZTXUMza3Pg": {
    "date": "9/21/2017",
    "text": "Best way to describe this experience is \"meh\". You would expect better from one of the few places on Lake Wylie, since there are only a few. The service and attentiveness was not a problem, but the food was less than desirable.   Following an afternoon on the lake, we swung through for a late lunch/early dinner and were seated almost immediately outside. We mulled over the menu and I announced that I was opting for the chicken salad sandwich. One of our co-eaters advised that she did not like chicken salad but had heard it was not good. Naturally I asked the waitress who swore it was one of her favorites... We have different favorites. I opted for the waitress's opinion and the chicken salad. The fries were delicious. I ate about half of the chicken salad sandwich and left the rest for disposal.   I've never had chicken salad with less flavor. Fries are delicious, beer menu is extensive, but don't head this way for a dinner meal.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdJ5RyU4nUWj8bceNxLrZg"
  },
  "bxA3V9YZYwR355qdvMxm4Q": {
    "date": "6/7/2018",
    "text": "Not what i expected. Fish was not fresh, was chewy little bit. .  I wont come back , never.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yM3YbTZYedIhcvslBbKqTQ"
  },
  "nwEnRkaNRVVGKP2gBzVfMQ": {
    "date": "4/25/2018",
    "text": "Excellent blackened tuna sandwich and the giant hand cut fries are delicious also! Absolutely will come back to enjoy the patio and view",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RXKXztu3g2JjPRLoJp_j8Q",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Excited for lunch on the river.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RXKXztu3g2JjPRLoJp_j8Q/o.jpg"
      }
    ],
    "user_id": "Kszi0Zhxd90cf0yKutvtcQ"
  },
  "NtPywwlrfADUfaTom_wetg": {
    "date": "7/15/2018",
    "text": "Love the food and prices here! It's never a let down. Our service was good today but in times past it wasn't. They have gone through many serving staff. Now, it seems  like they have improved their staff. I definitely recommend this place- honey butter croissants and ranch fries are my FAVORITE!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EYnA46k_anCDH5FmCeeIoQ"
  },
  "vVv4dmwC_Yl7FOw64jUi5A": {
    "date": "8/2/2018",
    "text": "Found this little gem in an effort to avoid traffic; it's right on the water with a great patio! The food was delightful; you must have a honey butter croissant and the cheese mashed potatoes!! The flounder sandwich was great and the blackened chicken and shrimp hit the spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6iopTREHgTcw_fzQP8UAtg"
  },
  "yB4NqE4dkN1kUDz0azSTZA": {
    "date": "4/6/2018",
    "text": "Had dinner tonight for the first time for my birthday!! Dinner was amazing everyone liked their food all delicious!! We had the  best waitress !!! I didn't get her name but really sweet and so on top of her game!! Thank you for being so good to our party!! We never had to ask for anything!! Thank you myra lindy and Susan for making my birthday so special! I love you girls so much so glad your my friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6tKCG1duIptN8__wQJ14Mg"
  },
  "6hicHEhjInHVkt877JC3uw": {
    "date": "8/18/2018",
    "text": "Went Sunday afternoon for lunch. We sat outside and they put up an umbrella for us. There was also a big fan to keep it a nice outside. I had the chicken salad wrap. It was ok but next time I will try and order it without nuts if possible. The fries are huge and great. But the biggest thing was their burger. It was massive but also delicious. I would only recommend it to someone with a big appetite. The menu reasonably priced. The only thing was the service was kinda slow and it took a while to get a check. I would absolute return for lunch in order to stare at the water.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_naXcx_8yLdm1H-kmA7uJQ"
  },
  "l7xCJKpFPMi-FSbxqIXcqw": {
    "date": "4/28/2018",
    "text": "Ordered the Prime Rib, medium.  Disappointed overall.  I didn't like the presentation, the cut was loose/wiggly, it was not hot, my baked potato also was not hot and I ordered sour cream on the side; it was missing.  Due to a time constraint, I did not send my entree back.  The staff was attentive.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WGcQz3MFYoottxXir4MaMQ",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Prime Rib, medium.  Disappointed overall.  I didn&amp;#39;t like the presentation, the cut was loose/wiggly and it was not hot.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WGcQz3MFYoottxXir4MaMQ/o.jpg"
      }
    ],
    "user_id": "VmhdNN6BhH9u49BBIw298g"
  },
  "k_5OVPwHRtBA478UoBCdRw": {
    "date": "8/3/2018",
    "text": "7/31/18 Celebration Dinner for Son Coming Home for Visit Party of six and we sat as soon as we walked in thinking it would be another nice evening at the grill. However to my amazement Lamar was our server and bartender. I've never met such a condescending individual. He took bar orders while doing so he degraded my younger 25 years of age then informed him his license are up for renewal next year and also our daughter of 24 years of age. He proceeded to take drink orders and returned with the wrong drink for my husband. When it was brought to Hannah's attention she was going to handle it; however, Lamar made a scene by coming to the table and pouring then waiting for him to taste it then questioning him about the drink not only then but continuously. Then he used the old drink dump old olives in it and some liquid from the side bar into the martini at the table as a new drink. That did it!!  We ask Hannah to take over our table and for Lamar not to come back!!  Hannah saved our evening what was left of it!  She had a great attitude and superb service!!   Lamar should not work with the public!!  He has no manners nor skills to communicate in an educated manner.  We truly thought this restaurant had higher standards than were shown tonight. I hope we can return and avoid this type of experience again. I know I will not be serve by Lamar. I do want to point out Hannah is an assist to your restaurant",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "n9ku0rlGwCRSPMdZBvNG1Q"
  },
  "aXm8GzLb7yl67_dqOhpQVQ": {
    "date": "8/14/2018",
    "text": "Prepared to be deaf if you sit inside on a weekend night as it is very loud inside! The food is great and staff is always friendly. I wish they treated their waiters better... They don't even get a discount! How are your waiters supposed to share their opinions on your food and their favorites if they can't afford to try everything. Anyways it's fun to sit outside when they have live music. I wouldn't suggest coming for a date night as you can barely think much less hear one another. The steaks are good and salads are fantastic!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xNbEEcymPtaEPtFwewsqQA"
  },
  "ficJadzgKRXNsjRTPHPRcg": {
    "date": "5/17/2019",
    "text": "Just ordered via Postmates.   Bad idea.   The order was entered correctly.   Simple order.  Two salads with no modifications.  One salad was missing three main ingredients, Turkey, Ham, and cheese.    I had a carton full of greens.   Way too much money for a half head of lettuce.   Won't order from them again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mkTlnNEWo3Ij53ZGhuqMdA"
  },
  "-UNVwTruocCfdec0S4ZtQg": {
    "date": "4/7/2019",
    "text": "At least 50% of the time you can't get a to go order correct. And 100% of the time no one answers the phone. One dog barked on the patio and now there is a no dog policy. See ya later.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "grmC0x7VX57-3eFXU4Xj1Q"
  },
  "DRUOS9eiNgKn0I804SAU6Q": {
    "date": "3/23/2019",
    "text": "Waited 1 hr and 45 minutes.!checked in at 730 . At least 10 tables empty. Hostess said manager wouldn't let her seat anybody because the kitchen was backed up ?",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TTtbHbOyceByk9gvY0XCA"
  },
  "dEdDwXI_O0OM-9GhHURl1w": {
    "date": "3/24/2019",
    "text": "If I could give zero stars I would.  We have given this place 10 opportunities to fix their problems and the manager refused to come out even though we had been there for almost 2 1/2 hours for 2 salads and a salad wrap at 2:46 pm on a Sunday.  I have to say we spent $100 and no one was apologetic or cared that we felt we were being held hostage.  Do Not Put Yourself Thru The Anguish\"!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RRi5mCJX3X7tZWzh5p0SQg"
  },
  "3tsS53ouk3KsR16_ybZmGQ": {
    "date": "9/29/2018",
    "text": "Two words....SO DELICOUS! My family and I came to J Peters for their famous ranch fries! I had never been before so I was pretty excited to see what all the hype was about! The location is right on the lake and is so beautiful and classy! However, our waitress serving us was not the kindest to say the least. She didn't really care about what we were ordering, she kind of just wanted to get it over with. Anyways, we ordered two plates of the ranch fries with the meat on the side, I'm glad we did that because the meat looked like it was kind of microwaved. The fries were A-M-A-Z-I-N-G! So saucy, cheesy, and mouth-watering! Once we finished our fries, we decided on ordering some dessert! We chose the Strawberry Croissant Madness and it was so tasty as well as beautiful! It featured hot, buttery croissants on the bottom with cold, refreshing vanilla ice cream, whipped cream, and strawberries on the top! It was one of the best desserts from a restaurant! Overall, I would DEFINITELY come back to J Peters and I would love to try their entrees next time!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "pfa9-s2sOjUzy0xzTQc_9Q",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pfa9-s2sOjUzy0xzTQc_9Q/o.jpg"
      }
    ],
    "user_id": "uoFMF4culI4Z7_3Cwws3JQ"
  },
  "etNF8MY-pldc6vWJVy2esg": {
    "date": "5/19/2019",
    "text": "This is a cool place I kept saying I was going to check out but never did but I'm glad I checked it out today. It's hard to find a good parking spot but lucked up and found one close to the front door. Upon entering the decor was nice and modern and was happy to see that both bars mirrored each other with one inside and the other outside on the patio. The restaurant itself sits on the river and you'll have a great view on the patio. I ordered a simple grill chicken salad from the lovely bartender Q who was very sweet to all the customers. My meal came out on time with more than enough food to satisfy. To my surprise there was a honey glazed crossoint with it. Which I would've destroyed if I currently wasn't on a diet, lol! Great experience and will definitely be coming back as a regular. All smiles.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r2mLnlIXMwl_Avw4L08n4A"
  },
  "pNh9viEWr9sNw4wx5FNbCg": {
    "date": "4/2/2018",
    "text": "This is an american food joint with massive portions and some delicious and somewhat unique versions of your typical american style menu items. My favorite item was their fries. Their burger is one of the biggest I've ever seen. The nachos were tasty and the black and blue salad with grilled Tuna is not something you can get just anywhere.   I removed two stars because of service. We waited an hour for our food and our server had an attitude.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SxYshmZF-2-wAntX3X0UiA",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SxYshmZF-2-wAntX3X0UiA/o.jpg"
      },
      {
        "img_id": "imZCX3YQ_hf4tEknBm7H0A",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Nachos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/imZCX3YQ_hf4tEknBm7H0A/o.jpg"
      }
    ],
    "user_id": "t-iZ58bltp9H7aDSvQu_mw"
  },
  "yVyi17ovWrw83C3OZzahFg": {
    "date": "10/30/2018",
    "text": "Came here on a nice date night. The atmosphere was amazing and so was the food. We looked at reviews on YouTube before we visited, so I knew exactly what I wanted to order. YouTube done this place no justice at all. We will have many date nights together in the years to come.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mdqrCLYW3hynOgkJMr-kMQ",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. I believe my dish was called the J peters chicken with yellow rice as my side",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mdqrCLYW3hynOgkJMr-kMQ/o.jpg"
      }
    ],
    "user_id": "wwsEmTsf3YCHYJLuB0UUCg"
  },
  "-sPIIqIxCl51Dw4BRfpxdA": {
    "date": "4/19/2019",
    "text": "The whole experience was just meh.  It's a shame, because the location is awesome.  The salad was supposed to be 'mixed greens'... it was straight iceberg, nothing else. For $11, I expect at least a little spinach. Iceberg lettuce is not 'mixed greens'.  The ranch fries didn't look appetizing at all, but tasted a bit better than they looked. Except... the bacon topping was grey/beige. I have never seen bacon that color.  The nacho appetizer was just chips, queso, and a blob of barbecue chicken right in the center. Unimpressive.  The only thing I'd go back for is a drink. The bartender makes a mean rum punch.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Qxc_c7yO5GGLSfpu5Dohw"
  },
  "3wMia-2wi9Nhlt5mMin_5Q": {
    "date": "4/27/2019",
    "text": "Good food its a place for cheap food and great scenery. The menu is full of various options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tjBzbUr1w_Xx3m65oSjO1Q"
  },
  "grks7chSR6HCfBsBkcO37g": {
    "date": "6/14/2019",
    "text": "Went there today about the 4th time. Found out they have re-branded themselves as J R Cash, though the sign outside still says J Peters. The menu is the same, as are the rather high prices. I ordered a steak medium rare which came out medium. It was the waiter's first day, Nathaniel S. and while he was attentive he messed up the bill and charged my bill to my friends card then had to refund it. When he brought her a to go tea he turned it over and while only a small amount came out he didn't bother to clean it up. The worst service was when we first got there. My phone showed two wifi networks, JPeters and JPetersL. I thought one may have a guest password so I asked Nathaniel. He went away then came back and said that there are no wifi networks in the building, that all their stuff used landlines. So either someone lied to him or he lied to me, not sure which but if they didn't want to be bothered they could have just said we don't have one for guests, which is what I asked. So it was a disaster basically. Won't be going back to J R Cash anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NrVGXLALtLBwkbWP5EZ3MA"
  },
  "cDb65fzU12I-_irxGaYxJg": {
    "date": "3/15/2019",
    "text": "The food is good here. Not a fan of them not giving out Wi-Fi.  Came to work during lunch and was disappointed. Also, if you have a boat, they charge a docking fee.  Those are my only 2 complaints.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Byjn24Jhcq_Gl6QkjSdlPw"
  },
  "JHjln71DlDEQa_3TihRSTg": {
    "date": "4/25/2019",
    "text": "Dont know how the food is pulled up in our boat and was told it would be $10 to park and come in, yeah right we left",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F1cnOzmNAZLJnggl0Pk48g"
  },
  "Yd_ByInHXbocRRH-gFKCvg": {
    "date": "6/25/2019",
    "text": "I have never had good service here and the last 3 times I have placed a Togo order it takes 30 minutes for someone to answer if I get put on hold I asked for a GM and was told they do not have one I will not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_fwB_wpGrv480PBc-_ZWWg"
  },
  "QKooh2XTNbK8D1023Gy1nA": {
    "date": "7/25/2018",
    "text": "I really enjoy this place.  Always forget that it's in the marina. I'll probably end up spending around $20 a person. The blacken Alfredo pasta is always great. The cheese fries is banging too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ocIXrxH-FnkJO8SRtWqzTA",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ocIXrxH-FnkJO8SRtWqzTA/o.jpg"
      }
    ],
    "user_id": "KRrXBAV4I2REfC77p2DKQQ"
  },
  "EsR5G1goqtDH_0V4v_ceyg": {
    "date": "4/6/2019",
    "text": "J Peters was an okay Grill and bar. The service was okay. What I really didn't like was how badly seasoned the steak was, it tasted FLAVORLESS. The medium rare was great but when the steak wasn't seasoned it destroyed the amazingly cooked medium rare steak. Overall, this was an okay restaurant. (Don't recommend coming if you want nice, seasoned, food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KKUVanRVvvsOt_hTo7rUGA"
  },
  "xJjY8DFimlwDU3KS9IW0pw": {
    "date": "1/13/2019",
    "text": "My family and I have been here twice now and both times had great food and great service. My husband is a restaurant manager and can be pretty critical at the service, but was extremely impressed each time we've come. He also said it was the best prime rib he's ever had. Great steaks and love the band that plays in the summer's on the deck. It's been a couple months since we've visited. It's about time we get back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3zC_UshOhQMnZccV9aVTzg"
  },
  "nB0rJf-8z6-t9MhWnwtRTg": {
    "date": "3/30/2019",
    "text": "Well it was great when i first got there. Never had been there as I am new to Charlotte. Got some drinks and an appetizer with a friend. Finally got my entree and it was the chicken with bacon, ham and cheese and i had a side of mashed potatoes. I couldn't eat it all so i took it home. Finally had the chance to eat it tonight and as I'm eating it, I came across a piece of plastic, PLASTIC! Cooked on top of the chicken with the cheese and ham on top of it. Unbelievable.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aH6v7CvB3EIYJyXuCPBrKw",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aH6v7CvB3EIYJyXuCPBrKw/o.jpg"
      },
      {
        "img_id": "BTGTtep8XqkN4i0pUM19Gw",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BTGTtep8XqkN4i0pUM19Gw/o.jpg"
      },
      {
        "img_id": "vVIHmkPmC0X20-goDLPxaw",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vVIHmkPmC0X20-goDLPxaw/o.jpg"
      }
    ],
    "user_id": "O7CafHYw4XtDOImceRy8Kg"
  },
  "SVU5GIE8L2agamkyN3a1jg": {
    "date": "2/5/2019",
    "text": "My wife has been eating here with friends for a while and has been trying to get me to go. Well, I finally went. We were a party of 6 and got a table immediately. Our server was Thomas B. Thomas was fairly quiet, and seemed very pleasant. I ordered the 14oz Prime Rib, med rare with a Caesar salad. Everyone else got the House Burger. Let me tell you, the Caesar salad was one of the best I've EVER had. The dressing was incredible. Along with the salad came some crescent rolls, known by the snooty as Croissants... They were covered with butter and were like eating little puffs of heaven. My prime rib arrived and it was cooked perfectly !!! Not sure why, but I almost ALWAYS receive my steaks horribly over cooked. Not this time. Perfection. Meat cooking PERFECTION. A side of Au Jus. No horseradish. Did NOT need either. The meat was absolutely succ As the meal progressed I was very impressed with Thomas' efficiency. NEVER did we have to ask for drink refills. He was proactive in bringing condiments and additional sides. I feel like we did task him a bit with extra requests, but he handled it in stride. A perfect meal, good atmosphere and a GREAT server.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jVaHZzHISX4zPDtYU1OrGg"
  },
  "VF15WJO8m0IO1k8OUMK9kQ": {
    "date": "5/9/2019",
    "text": "Horrible food and service the only reason we went is because we could go by boat (and pay to park!!!!) AND for the last two years we could take a dog on the patio. Tonight my husband and I have had a stressful week and took the boat up for a nice relaxing dinner with our 2 small dogs and were not so nicely informed dogs ARE NO LONGER ALLOWED!!!! We were devastated- there is no restaurant on the lake that allows dogs and this really rises to a new low. They have lost our business for life and I hope this post makes them lose even more business. not worth the money people go to a real restaurant!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8L8o2Th4cUxxvL-9OZNSgg"
  },
  "Ntqnh4gFii02jKuqIz4rKQ": {
    "date": "5/29/2019",
    "text": "Very nice atmosphere on the water, but a lot of work trying to find parking for lunch in a lot that is shared with water recreation and apartments. It was a beautiful Sunday, so I'm sure that had a lot to do with it.   Inside are tall tables, large bar, short tables, and booths. Natural color scheme makes it cozy. I had the fried shrimp entree with a house salad and cheesy mashed potatoes. The shrimp is crispy fried with a light batter. The potatoes appeared to have a white cheese sauce poured over them. Very yummy. Good homemade-style Ranch dressing.   They have several wines at various prices and a few white and red house wine options for $5.50. I got the red cab house wine and wasn't disappointed. I'm looking forward to going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yp0ARvJpE020PAJ2kMNshg"
  },
  "x3CK4GsWSYzxKsE1gFcu0Q": {
    "date": "6/15/2019",
    "text": "This is probably the best food in Charlotte! We have tried just about everything on the menu and not once have we been disappointed. The food is so good it's hard to decide what to order. The staff is always friendly and the prices are not that bad.   So disappointed in J Peters last night. We ordered take out and everything we received was way below their usual standards. The salmon was so dry I couldn't eat it and my husband's flounder and shrimp plate was fried beyond recognition.  Will try once more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KezgKF9L1-Q7gzDdbiL2YQ"
  },
  "IxNsEVp_Gq2-O7AlIInORw": {
    "date": "5/20/2019",
    "text": "I had been to this place a few times, after it was introduced to me about a year ago, but the last time that I went is the last time that I will ever go!! The food is alright, regular bar food, decent place to go to get an order of wings, a cold beer and watch the game.  The last time that I went a few weeks ago was on a Saturday night and it was a reservation that was made for a party of 20. The reservation was for 7 pm, they didn't seat us until 7:45, and we didn't get our food until about 9 pm. Luckily we had drinks to hold us over, which by the way were weak and watered down. It didn't taste like any alcohol was in it. The food was disgusting. Half of our party never even received their food, the other half received the wrong order. Our waiter was new, he said he had only been working there for 4 days. Now here it is a busy Saturday night, a brand new waiter, a party of 20 and no other waiter helping this young man with his party. It was a disaster! The person who made the reservation brought a cake for the waiter to bring out with candles, so that we could sing happy birthday... the cake never came out.  When it was time to pay, our waiter was cashing out tabs ONE BY ONE! After 30 minutes of this, we finally called the manager over to complain that our waiter needed help and that no one was helping him. Another waitress finally came to help. Someone gave her a $100 bill to pay his $50 tab. She walked off with the money, and never came back. He had to hunt her down for his change.    The entire ordeal was unprofessional and unorganized, and left a very bad taste in my mouth (literally)!  NEVER AGAIN!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "80Jf38EAC2QQppyFj-A_iQ"
  },
  "vkvrDABQ7E07sP1z01I28Q": {
    "date": "8/13/2019",
    "text": "I first came here when it was J.Peters not much has changed since changing the name although I did here a rumor dogs are no longer aloud on the patio if so that's disappointing. I took my mom here for her birthday dinner. We ordered the lava shrimp to start will have to say its a must! Also not the greatest app list of all time so stick with the lava shrimp trust me on this one this one! The dirty martinis were good but personally I like them in a martini glass it came in a cocktail glass. We ordered the mahi mahi and blackened salmon. Both are excellent choices! For dessert we did the fudge sundae and some strawberry pastry thing with ice cream on top. WOW order the strawberry pastry thing it was shocking how wonderful it was!. All together great time once again. Two tips if going try to sit outside much better view (if its not too hot or cold) and its always busy on the weekends (they do not take reservations) so expect to wait a little bit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "83awRBUIBtSJLT81Bgz2QA",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/83awRBUIBtSJLT81Bgz2QA/o.jpg"
      },
      {
        "img_id": "lyUTLUzyqw5VwGcDq97tVA",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lyUTLUzyqw5VwGcDq97tVA/o.jpg"
      },
      {
        "img_id": "WO7awjpMLb6KJHaQ-cYLng",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WO7awjpMLb6KJHaQ-cYLng/o.jpg"
      }
    ],
    "user_id": "WU1jQOBAy5C19xoXV75XKw"
  },
  "XnXhPKX9oiUJpO2sycJBdg": {
    "date": "8/16/2019",
    "text": "I have been here so many times. I love the location and the view of the Lake it is so peaceful and relaxed scene when the weather is nice I enjoy sitting outside on the deck or sitting out sitting at the outside bar. These staff is very polite always smiling always helpful. The full takes a long time only during rush hour and dinner time if you come when they are not busy normally the food is will not take long at all. They have many options to choose from from seafood to steak to salads. I love their croissant. I have tried many of the bartenders there and they make pretty good drinks. I judge everyone off of how well they can make a Long Island ice tea top shelf.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JXdhEf_hg3-SMjs1Qwbtyg"
  },
  "u10MWul5jsCcDIb14tTdbA": {
    "date": "8/24/2019",
    "text": "Glad they kept the prime rib but no pasta so for me it's basically just another Lonestar.  Also they used to let dogs on the patio and apparently now that's not okay :(",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oc1ZkDXxYoEKu3oe4oOJKw"
  },
  "Mm6xgJw2Nl_Ab4dJFlTpnQ": {
    "date": "5/19/2019",
    "text": "Used to love this place. We're here right now,  and last year we came a number of times, but this WILL be our last. The food is still good and we love the atmosphere however we've always brought our ( little ) dog here and we have just been asked to leave because they are no longer a pet friendly patio. Even though when we got here there was another dog here that they didn't say anything about.   Sorry guys but if our little baby scares  you, well we'll gladly take our business elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "keFjlZJFVTc8V5QlszN6Xg",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/keFjlZJFVTc8V5QlszN6Xg/o.jpg"
      }
    ],
    "user_id": "Qz6jpfNMNPTiqSxrIVpbKg"
  },
  "JizQV0IUDKza2RT-Abe86g": {
    "date": "8/10/2019",
    "text": "This is one of my new favorite places. I absolutely LOVE their house salad / dressing. The sirloin steak was really good. Also love the shrimp appetizer. Service has always been top notch. I will keep coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fHmLUdPQ7KPWxY23Tc0udA"
  },
  "J3RexsEpUpkxjHrraIlZwA": {
    "date": "7/11/2019",
    "text": "As of right now I'd have to say that was probably one of the best burgers I've had. The service was excellent thank you to Haley. We ordered the ranch fries appetizer and that was delicious. The manager or who I assume is the manager came out and asked us how was our lunch and the only thing I could think to say was, \"its awesome.\" It was delicious as the my wife described it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-Ai5JxffF3Fm8H4E93cbdQ",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. The Cash&amp;#39;s burger; holy cow, 10 oz. of meat, cheese, what seemed like a giants handful of fried onion straws, pickles all on a toasted bun.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-Ai5JxffF3Fm8H4E93cbdQ/o.jpg"
      }
    ],
    "user_id": "WEGqMww5vHfeGckXI6hRRA"
  },
  "6w9w84UO6hs3y7Ydyo7weg": {
    "date": "6/11/2019",
    "text": "We love this place. A good variety of foods, great value/price, large portion sizes, and great service. Our food came out quickly, and the views of the Catawba River are lovely while you eat. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mgEvYr_1VibfFkyKGAEJ4Q",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Marina/river views",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mgEvYr_1VibfFkyKGAEJ4Q/o.jpg"
      },
      {
        "img_id": "T1Bz23BD8TM5iuUHV6p_cQ",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Parking area, outside building",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T1Bz23BD8TM5iuUHV6p_cQ/o.jpg"
      }
    ],
    "user_id": "ZAR8vPleYKavFAGm0Unpkw"
  },
  "pw1cQfQDBYQ2VnrdjkPH1A": {
    "date": "7/21/2019",
    "text": "I wonder how this restaurant carriers over reviews from a former restaurant   J. Peters Grill & Bar  <a href=\"/redir?url=https%3A%2F%2Fwww.gastongazette.com%2Fnews%2F20190709%2Fmount-holly-waterfront-restaurant-rebrands&s=68bcd0504e4e8b57ab0012721d71136c50d9d3fb4323bffdb5ab28215d519bd5\" target=\"_blank\" rel=\"nofollow\">gastongazette.com/news/2...</a>",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MsYbc4oNG6L8r3JZg1t0dQ"
  },
  "dJO9Dbx3PbXc-5IcYPP6FA": {
    "date": "6/18/2019",
    "text": "we went here over the weekend because my husband kept hearing rave reviews of this place. They recently changed to JR Cash and I don't know if this is the reason, but I was not impressed at all.  I had a chicken salad wrap and I felt there was hardly any flavor and a bit dry.  We both agreed we would not go there again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKrIApQDIT_Aeait5bLlTA"
  },
  "5cIW_FuCc9KaN6HJ7gBOXg": {
    "date": "3/14/2019",
    "text": "Met my sister here for drinks since it's almost a half way point for us and it was very nice! My pomegranate margarita was deliciously delightful, I've never had anything like it! She ordered the she crab soup and I ordered the strawberry shortcake. Although I didn't taste the soup, my sister did mention that it could've used some extra seasoning. I enjoyed the the strawberry shortcake a lot though. It was made with croissants which was different but if you like croissants the way I do I'd definitely recommend trying it! There were views from the window of the table we were sitting at. It was raining so that ruined the view but I plan to go back on a day that the weather is better. Nothing's better than a lake view on a beautiful day!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VGFXbtZQkP8lax0T1Ou4dQ"
  },
  "uNPqBfVkswCNNtzD1A2hwg": {
    "date": "2/21/2018",
    "text": "I hope you are hungry!  This is a hidden gem in Mt. Holly.  Right on the water, so great views, and a fun atmosphere.  We visited for my sister's birthday and sat at the bar.    Service was amazing, very attentive and the food was brought out in a timely manner, though it was quite busy.  All of our food was amazing!  A favorite dish was the loaded fries the table shared.  Yum!  Extensive menu, great drinks and awesome atmosphere.  Visit soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Du5ullnwJAf_6oEYgsIOvg",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Loaded fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Du5ullnwJAf_6oEYgsIOvg/o.jpg"
      }
    ],
    "user_id": "5b59DMCxPWn-c2b6q50P7w"
  },
  "07LGBlYYhmdF9oHkhZ8ucg": {
    "date": "1/13/2018",
    "text": "A good view of the river and good food as well.  Time for our traditional Saturday lunch and this time I chose J Peters over in Mount Holly. J Peters is a regional chain mainly in upstate South Carolina but with an outpost in North Carolina as well.  Picked up my wife at Northlake Mall and from there, it's about a 15 minute drive down I-485, I-85 and Exit 27. Easy to get too.  Right on the banks of the Catawba with the river on one side and a small channel inlet on the other. Building looks relatively new and inside is very neat with clean architectural lines  pleasant blend of golds with blacks and grays. Plenty of glass providing great view of the water.  Walked in and were seated immediately at a high top with a view of the river on one side and down channel on the other.  Our server was excellent and made for a great visit.  We both order tea, In my wife's case, it was unsweetened but with artificial sweetener on the side. Mine was a half and half blend that came out perfect.  We both started with a soup course. I ordered a Sea Crab Soup that was nice and hot and perfect. On the other hand, my wife ordered the Potato Soup and it came out luke warm at best. Our server offered to take it back and heat it up but when it came out, not much better if at all.  For her entree, my wife decided on the Black and Bleu Salad which she deemed as perfect. Portion size was immense , and looking at it, looks like they made it Pittsburgh style with Fries on Top. Look carefully and you'll see in the photos, she decked out in here Steeler gear.  I went with the Flounder Sandwich with a side of Fries.  The Flounder was perfect. Nice and flaky. Tartar Sauce was mild which was good and they also gave you a slice of lemon which made it perfect. Great texture and taste all around.  Problem was with the Fries.  Crispy on the outside and under cooked in the middle. Need to drop the temperature back a couple of degrees and extend cooking time yielding a more uniform product.  Great atmosphere and with the large screen TV's, would be a great place to watch and upcoming game.  Even better, it's going to be a great place to come back too when the weather warms up although that did not seem to deter the Great Blue Heron who was right off the deck as you walked out.",
    "rating": 4,
    "rated": {
      "funny": 23,
      "useful": 41,
      "cool": 34
    },
    "photos": [
      {
        "img_id": "FrCESK8LX2gjoy9SNyC-fw",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Entrance looking back to the bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FrCESK8LX2gjoy9SNyC-fw/o.jpg"
      },
      {
        "img_id": "k3UMILkMZVLT5mDljNsurA",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Bar area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/k3UMILkMZVLT5mDljNsurA/o.jpg"
      },
      {
        "img_id": "xaof9ON4nxMI53spBJBb9g",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Dining Area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xaof9ON4nxMI53spBJBb9g/o.jpg"
      }
    ],
    "user_id": "GGTF7hnQi6D5W77_qiKlqg"
  },
  "xDqlA-zEBrFTvekngFj54Q": {
    "date": "5/15/2019",
    "text": "You either get a good experience or a crappy one.  Been a few times since we live right by this place.  Managers don't ever walk around and never seem to be helping their staff.  Always have had good waiters.  Had a few orders get messed up but they fixed it.  Tried doing a call in order for pick up and now they have rules about it, no call in orders at certain times (I have two little kids and sometimes they just want to bring it home). No consistency it seems like, no good leadership. And still can not understand why you put a restaurant water front with out a dock (you have the option to use the transit dock for the marina at $10 a pop but who wants to do that).",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sL7agffMO31U8RFyEY9l9g"
  },
  "3K4lJZao1K3ivfO1Azdazg": {
    "date": "5/3/2019",
    "text": "Went as a group of four for the first time here.  The food was very tasty and everyone seemed to enjoy their meal.  The problem was two orders came out wrong.    The waiter never, not one time refilled our water.  We has to stop him walking by  to order our second beers.  To top it all off he brought our check without asking if we were finished.  We planned to sit by the river and have a few more drinks but felt very unwanted by our waiter named Samuel.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "lF-kbiESiZ7WUuccmCy5Lw"
  },
  "opm9Ug1v5XXTWCosirGAiA": {
    "date": "6/8/2019",
    "text": "Used to eat here all the time. The food is good and everything. Today we drove 20 minutes with the dogs to eat on the patio like we also do and they told us no dogs allowed anymore. This is very upsetting  they said they no longer allow dogs on the patio.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4lz_T6ho8Atz7aq6JLxrA"
  },
  "EWMEO9X-pNKJCuslPpNnxA": {
    "date": "7/20/2018",
    "text": "Flavorful food, awesome atmosphere, and fabulous service and prices.  When I come back to NC...!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mBM4_xLfhripOUp0vIrnsQ",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mBM4_xLfhripOUp0vIrnsQ/o.jpg"
      },
      {
        "img_id": "ElJ_seFBYVKE_-scd58Qtw",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ElJ_seFBYVKE_-scd58Qtw/o.jpg"
      },
      {
        "img_id": "cIYEimytLdKDdWkUafKIFA",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cIYEimytLdKDdWkUafKIFA/o.jpg"
      }
    ],
    "user_id": "UG6qyxgM1qsJJctTeGRuOg"
  },
  "zedPNKc4YETbBX43amchTA": {
    "date": "4/12/2019",
    "text": "I will be fair because Ive only tried the prime rib here so here goes. If you pay to have a billboard with a giant prime rib try to make it incredible and not fight for position under the likes of Longhorn! It was small, dry and bland, oh and expensive! I know prime rib can be fickle to cook properly but thats no excuse for a professional bespoke resturant and a billboard showing the best prime rib this side of Texas! Any way if some one could please bring back the Woodshed resturant when brown bagging and free tomato sandwiches were a thing? Oh and the Woodshed used to have the best prime rib I have ever eaten consistantly thus side of El Paso! YOU CAN DO BETTER J!!!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xK9AM3xmLm63G7UfHEnksw"
  },
  "a9BlDIxdfC7lwNgUg-tWdA": {
    "date": "9/7/2017",
    "text": "Great food at good prices.  I have been there four times in the few months for meetings and family outings.  Still enjoy it.  J Peters chicken - yum!   Love the deck overlooking the river.    Only negative is the noise level inside - acoustics are not very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bWRXHUjgQ38DPyfn8L_Lcg"
  },
  "LaJqBCqc4WHJ2JyjXp59TQ": {
    "date": "8/30/2017",
    "text": "Our favor spot for a bite to eat and a beer. Sitting on the bank of the river at the tailrace marina the atmosphere is what keeps bringing us back. The food is outstanding, prime rib, burgers and salads are a favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GSoas5zFjUxz3RkG8tzVWQ"
  },
  "xRx_o-1neN61qDoLwXt0cw": {
    "date": "5/21/2017",
    "text": "Don't think I can convey just how good their burgers are. Lots of restaurants have burgers and some are even burger joints. But none match the quality or quantity of a J Peters burger. They also have great sweet potato waffle fries done just right. I have eaten some of their other dishes and have never been disappointed but I keep getting their burger and they have several styles to choose from so they can build a burger you will throughly enjoy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qD5DaWZ4LNXMCF1iWt1S1Q"
  },
  "L39DOfSDay5dlltPudR9yQ": {
    "date": "7/31/2018",
    "text": "Tonight was my first time at J Peters and hate to say it but it will probably be the last time we'll be making a trip. In their defense, the food was pretty good and I personally enjoyed the drink that I got. But out service was absolutely terrible. First we he waiter had an issue with my ID because I hadn't updated in a while, though it didn't expire for another year. After making that ordeal we had a issue with one of the drinks we ordered, and when we asked to get it fixed the bartender repeatedly asked my dad if he could taste a difference in the drink, instead of just taking the drink and making a new one. He then continued to make a spectacle of this by bringing the martini shaker out to my dad and pouring the drink in front of him, then asked him again later if he tasters a difference. After a while one of the people in our party pulled one of the waitress they knew and asked if she could take over our table, and after that our meal went smoothly. If it weren't for Hannah we all would have left very unhappy, but the male bartender should really work on his people skills.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LkN6OVXoZH3TuuvUkjvynw"
  },
  "Zomnh5NYYaOwjBeNi0BZSw": {
    "date": "9/21/2016",
    "text": "I thought I'd try this new place out. It's close to work and well needed in this area. The layout and setting casual but very nice design. There's an outdoor deck with covered seating on the water and full bar. Leslie was very nice and took the time to know the guests. I had the Ahi Tuna Salad. It was a large filet cooked medium as I had asked. Pretty tasty. The salad was colossal and at least as size goes-worth the $12.99.   It was made with romaine lettuce and served with blue cheese crumbles and balsamic vinegarette that I don't believe was made in house as it had a bit of processed taste to it and it was overdressed. They serve all salads with a nice croissant. I'd give the salads a 5/10 compared to all other tuna salads I've had. It would be better with mixed greens and a ginger type dressing. The onion rings were truly the best part!  Perhaps my fit and fat taste buds were in conflict !?  Overall, I will try it again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o2aMS-YTZUYptLXRqxMmhw",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Ahi tuna salad-- romaine lettuce blue cheese crumbles n onion straws.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o2aMS-YTZUYptLXRqxMmhw/o.jpg"
      }
    ],
    "user_id": "Bxzn4CwUYT6ta4cJGqbymA"
  },
  "tItNMXsw_Zt0M05n40g79g": {
    "date": "9/15/2016",
    "text": "I thought this place did a great job cooking my steak to a perfect medium rare. Almost anywhere else I go I get well or medium well when I ask for medium rare. It hate an over cooked steak and this place does it right. The chicken tenders, house salad and she crab soup were all great as well. I loved my entire meal. The place is nice and has an open kitchen. I wish there were more seafood choices though other than the fried shrimp and grilled salmon there was nothing unique in that department. I will be back of course.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DTUPcJYoYiwQPWOlVq9jFw"
  },
  "02S0k6mtuLpmxnUlZo-_0g": {
    "date": "8/28/2016",
    "text": "My new hangout. I rarely go out because I haven't found a place that had it all. Those days are over! J peters has delicious food, huge portions, cheap drinks, awesome views and great live music, as well as outstanding service. I will definitely be a regular and can't wait to go back. But yes, for reasons I just listed, it is packed. Complainers stay home.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "w3QcdYODEOWKMOspL6qEOQ",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/w3QcdYODEOWKMOspL6qEOQ/o.jpg"
      },
      {
        "img_id": "536JWttpOLOftLwR16x1KA",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/536JWttpOLOftLwR16x1KA/o.jpg"
      },
      {
        "img_id": "cchhB7gzt8TE0aQwJeQUNQ",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. View and menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cchhB7gzt8TE0aQwJeQUNQ/o.jpg"
      }
    ],
    "user_id": "DA36hEMLv81mmt_Ru9nPDw"
  },
  "dKxci4lX_e7RJqYPslkwHQ": {
    "date": "10/16/2016",
    "text": "Food is good. Atmosphere and view is great!!  Finally a nice new place to Eat in Mt Holly!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IJe10BYf0ZJ75dc6k1ygkw"
  },
  "nRa67vuyRnaWOUMe3dnl_g": {
    "date": "10/12/2016",
    "text": "A little disappointing. The food was decent...the sever tried in the face of the kitchen mishaps, but the True allure of JP is the boat access. Yet, they really don't have. If by land...I will chose elsewhere. If by sea...I may be left out at sea.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-dbwSnJlSg_HPtjofhGpQg"
  },
  "SYS1Zgd6XCCncTUE6tul-Q": {
    "date": "6/24/2018",
    "text": "I've given this place several tries and each time they've fallen short. Today was no different. We had a party of 7, I was advised it would be a 45 min wait. Ok I understand. So 50 min later after we went back up to the hostess she finally said they were clearing a table for us. When we walked to our table we saw only half the tables in the restaurant had guests seated. So why did I just wait almost an hour when all these other tables were available? Then we placed our orders and it took 45 min to get them. We didn't order anything fancy- some chicken tenders, a salad, etc. My order was completely wrong, the waitress was very apologetic and asked if she could redo my order to get it right but at that point it had been 45 min just to get it, I was starving, I couldn't risk waiting another 45 min to maybe get it right. This seems like the same story every time I go there. I like to support businesses in my area and think this restaurant is a great idea but it keeps disappointing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rII5fCeMdeVq1h5kdpHELw"
  },
  "Klq_v0GhgO6WmjLsW8EQ6w": {
    "date": "10/19/2016",
    "text": "We were there with a group and practically had every appetizer. The food was excellent. Aside from this hyper uncontrolled ADD turd of a kid who frowned at me and stuff his tongue out, the experience was great. They have live music and great drinks! At the moment, there's a bit of construction in the area. Parking seemed a bit scarce as a result of the popularity and construction.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EaHRlbCrUk_KX-s3e1IgXA"
  },
  "wO3ZshVilFO_eVV35NgZlg": {
    "date": "12/19/2017",
    "text": "First timer.... had salad and she crab soup. The soup was not good, even after seasoning it... still could not eat it. When the waitress asked I took the high road and said I just didn't care for it. She offered another soup and then proceeded to charge me for it. Customer service 101... if the food is nasty and you offer to replace it... don't charge for it. Salad was good... service was meh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YtEvrImsYSYoKtJFJ2uokQ"
  },
  "PeVRXr36MbqIzRqYkvN6Zg": {
    "date": "4/10/2017",
    "text": "Wonderful place to stop by off interstate 85 if you have a appetite.  The portions here are colossal and more than enough to share!  Ice cold drinks will keep you quenched with excellent courtesy from the bartender *Christine Rice.  Customer service here is outstanding and well worth a second visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "deZarxxVscoVaXkwX24WqQ"
  },
  "QF39h-wy42XGFp2_8t740w": {
    "date": "9/8/2016",
    "text": "First time there tonight. Only been open 4 weeks according to the waitress. Very nice location and layout. The food was very good. But, the staff is clearly not trained or ready for business. Our waitress clearly forgot to enter our dinner order as after 75 minutes I pointed out to her that we had not even seen or salads yet. She should have noticed this herself. So technically this should be a one or two star review but I think and hope this is just a start up issue because we really like the location, accessability by water on Lake Wylie and most of all the food.  So JPeters whoever you are, pull some talent from one of your other locations and teach these goods folks how to make a success of this new location. With little effort this is a 4.5 star place all day long",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iehQsZ5REZbRK3nq6-tD6w"
  },
  "c8OFubqro53n2ajrjva2Ig": {
    "date": "10/28/2017",
    "text": "My family and I found this gem last night and could not have been more pleased. We chose to sit outside where there were heaters and the deck overlooks the water. Our server Miley was incredibly sweet and helpful. My husband had a huge, delicious prime rib sandwich and I had the J Peter burger. It was so large I took half of it home to have for lunch. They even wrote a label on the take home box! We also got the honey croissant app- delicious! Will certainly be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fUjQOkew0sk_J1h5_yJ7Ag"
  },
  "EdhH6xE1vnE1_XXhQ80baA": {
    "date": "8/25/2016",
    "text": "Nice location, good food, and huge portions. Nice to sit and watch the river go by. Need to add patio seating, and some outside games.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "emJ3rAuqumdLIaWdsBcJJA"
  },
  "ARWVPiJf882yI8DmnYx9mA": {
    "date": "2/15/2017",
    "text": "I went for the very first time in the early afternoon a couple of days ago with my two young daughters.  We were very happy with the food, drinks, and service.  The only reason I didn't give it five stars is that I was informed that the place has a 90 minute plus wait on Friday and Saturday nights.  Unfortunately, the restaurant is just too small to deal with the demand that it has given it's location in a new apartment complex located on the river.  I will be back, but just not on \"date\" night with my wife.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SiPqJuS6p3AwKfSTMWrthQ"
  },
  "gAUCu49yigp4LNeuBlJvHQ": {
    "date": "9/6/2016",
    "text": "Food was good overall, scenery is nice. I think my chicken salad wrap should have had pecans instead of crunchy peanuts; that was a little off putting but I tried to remove as many as I could. My mom liked her burger but we read the sweet potato fries came with a marshmallow dip but the waitress didn't know about that. Oh well, I'll try it again and sit on the back patio for an even better view.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UhZWp2oHWLGWZuARHBQtKg"
  },
  "2y94Bc0nvFUXEX8Ep3jnxg": {
    "date": "9/17/2016",
    "text": "This is an amazing place , the food is above excellent, the wait staff is incredible, the hostess need some work, but amazing atmosphere",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t74b3KiaHL64II9XJtujgw"
  },
  "Z4PU6zWhFrH5E0Yg7THX1A": {
    "date": "1/18/2017",
    "text": "I was so pleased with this place! Great service, fantastic food, nice view, and good drinks! I highly suggest ordering the shrimp as an appetizer, and queso mashed potatoes as a side. I will definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vnOEVetsbfmUkv5Krzuy3Q"
  },
  "Kdk9WRaxjJBy8v5TfCSEfw": {
    "date": "4/20/2018",
    "text": "This is a bit of a mixed review. Some of my party really enjoyed their meal others did not. The restaurant is nice looking with a good view pretty much surrounded by water. The wait was pretty long but it was Friday night. We got a honey  croissant appetizer was told it was very good. It came out fairly quickly but the salads took probably 20 more minutes to come out. The entrees eventually came out. One person got the mahi mahi and it was very dry and basically inedible. We told the waitress and she said they have heard that before.  Another got the sirloin but it was cooked far below what they ordered. My wife ordered the blackened chicken pasta and she really enjoyed it. I got the J Peters chicken and it was pretty good. So a bit of a mixed review. It is a bit expensive for the quality of food. I guess you are paying for the location. I'm not sure if I will go back or not. My wife might talk me into it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oX5AnxFMq6YxPxmZc52NpQ"
  },
  "J8T4DB8nIJsbX3hT3oCqGw": {
    "date": "5/12/2018",
    "text": "Just had the worst meal experience. Asked for a glass of ice 3 times, food didn't come out for over 30 minutes, never got set ups with napkins so our glasses just sweated water all over the table, asked for medium tuma, came back almost brown, leaf plated was wilted and brown. Flies all around.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Qy29cyDDTxnCafXq9hKxQ"
  },
  "70meQd7GA6CuxlE-YyHVgw": {
    "date": "11/6/2017",
    "text": "I had dinner Sunday evening for the first time and was very pleased. I had the house burger and a side of steamed broccoli. The burger was cooked exactly as I liked and was very juicy and delicious. It was a thick patty and was served on a very good bun. They used very lean beef. The broccoli was hot and steamed perfectly with a very light seasoning. I was sad when my side dish was empty. I was too full for dessert but they sounded yummy. The only reason I didn't give 5 stars was the restaurant was extremely cold and I ate a little faster than I normally would have. I hope to go again and try more of the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NZP8-qYHv9tNfviHZaBrIw"
  },
  "Qu8o3PwbzNDGAcyeRhfThg": {
    "date": "7/6/2017",
    "text": "Let me start out by saying, it's a shame that there isn't a rating lower than one star!   Got to the restaurant, no parking, which wasn't surprising for the scarce lot they have. Waited 30 minutes for a table, which was understandable, they were pretty busy.   My party had a total of TWO people, myself and a friend. Sat down, ordered. 30 minutes later, no food. Noticed a party of FOUR get seated at a booth adjacent to us. 15 more minutes later, no food for us, but the party of four gets their food. I go to the front, as our waitress is no where to be found, and ask a hostess to bring a manager to the table.   Manager comes, apologizes, says the kitchen is busy, offers us a dessert. A dessert??? Really??? After waiting for 45 minutes and seeing a party twice our size get their food in 15 minutes???? I was at a loss for words. Turned down the dessert, and the manager offered to do NOTHING else. Not even a discount on the check. Waited another 10 minutes, food finally comes. At this point, I am so irritated that my appetite is completely gone, I don't eat anything and pack everything up in a box.   I have NEVER waited so long at a restaurant in my entire life. Sure, the waitress was more attentive and apologized after I got the manager to come to the table, but it looks like I wasted my time there!   I brought my friend to the restaurant hoping for a good first experience, but BOY was I wrong. Will NEVER be returning or recommending it to anyone.   Summary: 30 minutes for a table, an HOUR for food, for a party of two. No comps from the manager. Party of four across from us? 15 minutes for food and a nice attentive waitress.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "pzQm6AiKGhulnnzh6NG6gg"
  },
  "cHo5Ai3_TtfAMOyur3L85A": {
    "date": "4/30/2017",
    "text": "It is unacceptable to be treated as we were on our visit here. My sister and brother in law were visiting from Miami and I took them to J. Peter's - since my previous visit was so delightful.   We were seated quickly and were greeted by friendly staff. When we sat down, we were surprised at the amount of time that it took for our server, Cindy, to come take our order. When she finally arrived, she genuinely apologized for her delay and was very polite. We told her it was ok and not to worry. We gave her the complete order including our drink order, our main course and the appetizers. Simple right? Wrong. We got a drinks and appetizers relatively quickly but 35 min later we still had no main course food. Cindy never came by to apologize for the delay, never refilled out drinks, never asked if we wanted more alcoholic drinks. In fact, we never saw her at all. When we finally had  waited enough, we asked a separate waitress if we could speak to our waiter. She went to go get her. Upon her arrival, Cindy again apologized and said that she had just put our order in. \"Excuse me?\" I stated. She again apologized but gave no reason for what had just happened. Our order was not even being cooked since she had \"just put the order in\". My sister, not wanting to cause a scene said we'd wait for it. 5 min later, I'd had enough and went to go find her. I explained to her that I would like to cancel the order. She replied \"I'm so sorry, they're about to start cooking it, it won't take long I promise\". I replied that we had been waiting over 40 min for our food and waited a long time initially for her to even come by the table. I would not wait any longer. I am upset and angered at the fact that what was supposed to be a lovely night last night with my sister and brother in law turned out to be such an awful experience.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ta2zyzUdVdrWPxjOASnO5Q"
  },
  "h3HZ9Xm_x89evKBKvz52sQ": {
    "date": "5/28/2017",
    "text": "I had the best prime rib in my life here yesterday. Don't forget to try their signature honey butter croissants. They are simply out of this world. The service is on point as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z03JqGSeRSM19FY7eQOeuw"
  },
  "meTXEJl7147I_ArHzqFqzg": {
    "date": "5/22/2017",
    "text": "I live in Lake Wylie I saw this place while out on our boat... anyway we decided to give it a try we were their early know problem but the food was fair, we both had potato soup which was more like ham soup and club sandwich which was ok.. nothing special about this place other than it's on the water.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mh1xCy6kDy1BHKXh0DH-Rg"
  },
  "ZnYZw3C1ODnIaZr-j-Abjg": {
    "date": "11/19/2016",
    "text": "Slow Got order wrong The waitress was nice but it was probably her first day on the job the food was average just really slow",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RCbMv-xLq7KecFXfDL4wBA"
  },
  "0PvJou5PRNsB57zTO_Z7wA": {
    "date": "9/3/2017",
    "text": "J Peters is always consistently good-there's a lot of variety which is good when you have a group or picky eaters!  Quesadilla or the burger is what I usually get!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "19jhOq7Z6LDVJmwhOpsc5w"
  },
  "gP27PKxkAnD96h5CA8HXsw": {
    "date": "5/13/2018",
    "text": "I attempted to go to eat; however, the person that answered the phone was rude. This was not a good start. We are going somewhere else. This happened at Mount Holly location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vYJBLgvUjfgPpLufuC6zFg"
  },
  "JNNWXQcJ67H6FqCZ7qe7qg": {
    "date": "8/13/2017",
    "text": "Always fresh, hot and delicious food.  Prime rib sandwich is piled high and amazing flavor with tender slices of meat.  Chicken tenders are hand breaded with four large tenders on a sandwich, best dral on the menu with a side.  If baked potatoes are available best net, cheesy mashed potatoes a good back up.  Great lake views.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XE36pmSiByd4YtSiPkn9_A"
  },
  "vNc7uXIVVn-GzmTb9_4X7A": {
    "date": "9/2/2016",
    "text": "NoService was great, food was fantastic! The sweet potato fries with the marshmallow honey butter is amazing... chicken was juicy n tender... the house salads are great and filling.... the cheese ranch fries are out of this world... We had the strawberry croissant dessert, can I just say, nothing short of perfect?! Portions are a good size and prices are reasonable! We will go back very soon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Sz1yeJ_yuTedVrifgbp5mg",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Shrimp n flounder",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Sz1yeJ_yuTedVrifgbp5mg/o.jpg"
      },
      {
        "img_id": "891HGgV6Ok4PJmCE9xuUwQ",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Burger n sweet tater fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/891HGgV6Ok4PJmCE9xuUwQ/o.jpg"
      },
      {
        "img_id": "ngFL2Mz4ZjDaSF9v173Edw",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. J peters bbq chicken.. topped with ham bacon n cheese with bbq sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ngFL2Mz4ZjDaSF9v173Edw/o.jpg"
      }
    ],
    "user_id": "RmIEGDaTG3gxoUnEBNjRiQ"
  },
  "U8L2sxn-1PNXtSxplfuzxQ": {
    "date": "4/5/2018",
    "text": "Called three times to place a take j e out order and was transferred to the bar each time. No one picked up any of my calls!!! Are you kidding me? Won't be calling them ever again. Service is crap.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r_1Cale0i5SuSEeEiD-FeA"
  },
  "ZA5yP5KeuqtJ0ib5W1n9-w": {
    "date": "11/9/2016",
    "text": "We tried J Peters out on a Wednesday at lunch about 1 week ago and enjoyed our visit.  The atmosphere is nice.  The server was really good and very attentive.  The food was average, nothing really special.  We ordered the fried shrimp appetizer that has a spicy, but not really hot sauce.  It was good and went well with our IPA.  We also ordered the she-crab soup which was so-so.  It arrived at our table luke warm and for my taste could have included more sherry.  Maybe the servers could offer a shot of sherry on the side for those who would like it. We will definitely try it again and maybe try the baby-back ribs, a burger or a steak.  The patio is very nice with a view of the river, so we'll definitely try to sit out there next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8rplMFgN_U2wu9Vu1tce8g"
  },
  "OLA74o4hWXscj1AE5IoEZw": {
    "date": "4/1/2018",
    "text": "Was told wait would be an hour and a half....it was our night out and already had a sitter so we decided to wait.  In 15 mins they called us for a table.... waitress w asnt accommodating...it was our first visit and asked for recommendations she said everything's good....really....appetizer (hot lava shrimp) was amazing....ordered my filet medium it came out charred to a crisp....she knew it too because she sat it down and said check to see if your steak is cooked right.  Hubby enjoyed gisnbaby back ribs while I waited and waited...after 15 mins I stopped the waitress who had been ignoring us since the send back to tell her just to box my steak to go....she sent the manager out with the steak and they asked me to Check it again....it was good this time and she said ok...we were sat right outside the kitchen so it was loud...overall our first and last time....husband and a coworker had eaten at J Peters in Clemson while traveling for work and enjoyed it....guess manageme t and staff make a difference!!  Not a pleasurable experience...wait staff not friendly...food had potential to be good....wouldn't recommend",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "InAVfC9WXqAtT3OKFn-iJg"
  },
  "O5h8QkG7Gvuqg1eNuDS-dw": {
    "date": "10/29/2016",
    "text": "The food is AWESOME, the staff is cheery and friendly, I had a great experience here. I cannot express my love enough for the croissants which come with the side salad before the meal. Honestly, I could happily make a meal of the croissants or the salad alone.   The food portions mean I will have enough food for 3 more meals which to me is concerning. I love leftovers but I left more full than at thanksgiving dinner.  I will certainly come back, but it may be a bit before I can eat up all those leftovers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kG8TEzKyz9wKmczXFUhO7A",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. Just look at that sexy croissant! It&amp;#39;s hot and covered in a butter- honey sauce. This is the side salad by the way... the side!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kG8TEzKyz9wKmczXFUhO7A/o.jpg"
      },
      {
        "img_id": "dOmPtbaRmSKCIhpiHZgZHA",
        "caption": "Photo of J R Cash's Grill &amp; Bar - Mount Holly, NC, United States. J Peters Chicken Dinner. So tasty!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dOmPtbaRmSKCIhpiHZgZHA/o.jpg"
      }
    ],
    "user_id": "1jrNd7R4-94-BFHI5Cp0CA"
  },
  "RMvgOEIqwY5XmtnstVk2YQ": {
    "date": "3/26/2018",
    "text": "Staff were very indifferent about our long wait. Once we got seated, we got service quickly. However, someone in our group asked for some extra small plates and the waitress brought out 3 small plates and placed them on our table beside our plates of food. When we picked up the first one, the bottom was covered in mashed potatoes. We can only assume the plate had someone else's dirty food on the bottom or had been removed from the sink - who knows. These contaminated plates were placed on the table beside our food!! Make me wonder about the condition of the plates I was eating on!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWSq_yRhyjN-T7xIQULV3Q"
  },
  "raSkwfE4yqf57jMxf13W2Q": {
    "date": "8/1/2017",
    "text": "The location is really great! We were seated next to the kitchen, which wasn't ideal, but the hostess was nice and moved us when asked. The honey butter croissants were awesome and my salmon salad was really good (they let me substitute salmon for chicken for a small upcharge). The only negative was my husband got the BBQ chicken nachos - they were not good. The queso was good but it was literally just queso, BBQ chicken (chunks, not pulled), and stale chips - that's not nachos in my book! He also mentioned the chicken was ice cold. He had a few cocktails though that he said all were really good! Overall a good experience and we would try again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WylJrFsX7MbnuACEwYMepQ"
  },
  "wFhdgpAmR4z7hr4QvCIVcg": {
    "date": "4/12/2018",
    "text": "We were in the area to check out the Tailrace Marina and while there decided to try J Peters for lunch on impulse, knowing nothing about the place. We were wonderfully surprised. It is comfortably appointed, and we chose to sit at the beautiful deck overlooking the river. Service was prompt and friendly with our server offering helpful advice about the menu. I opted for a salad with chicken and warm house dressing. My wife did a barbeque burger and seasoned fries. Both were generously portioned, good quality and excellent in their preparation. The atmosphere is terrific, great value for the quality provided, and the staff is on their game. What's not to like. We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5sF50Sn2t8-ip7b8LU4DHA"
  },
  "--K4ytfFDIZSxWQxp22asw": {
    "date": "2/19/2017",
    "text": "Tonight I'm super disappointed in J. Peters. We've been here a handful of times and had amazing food. Tonight though they were severely understaffed...so this review is based solely on their management. We waited over an hour for a table...there were tables available however the kitchen was so backed up we were told (after an hr and 10 mins) that they could seat up, however we wouldn't be waited on for another 45 mins! We left disappointed and hungry. Off to find somewhere to eat!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-xidiX-yLjJn3gHcApCmXA"
  }
}