{
  "o5EKmpNIup_Ld3Zadlddew": {
    "date": "10/1/2017",
    "text": "I had a reservation for 11 people (3 adults and 8 13-14 year old boys) for my son's birthday.  The boys had a great time because they were in a group of friends and eating pizza.  The pizza was marginal, wings and salad were good and the waitress was lovely.  The biggest problems were the pizza stands and the management.  The stands were slightly crooked so when the kids took the first slices of pizza the remaining slices and tray went sliding to the table.  I caught the first one.  The second time the pizza slid into a drink and was ruined.  By this time we were ready to leave.  The waitress told me she could not give a refund for the pizza but would make another.  After a while, I inquired about the status of the replacement pizza. She said it was 5- 10 minutes away- it was in the oven.  20 minutes later the assistant manager told me it was being boxed up.  30 minutes later I had not gotten the pizza and but did have some very impatient boys.  The assistant manager refused a refund.  I eventually got the pizza and called to manager when he returned the following week to complain.  He told me he would look into in and get back to me.  He never called back.   When I followed up, the assistant offered me another replacement pizza.  I wanted a partial refund not more of their marginal pizza that is going to take too long to arrive!  I do not recommend this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eowuwwb1CSiJFER78pVRgQ"
  },
  "0rZEKvQ073WTql7jaX8_fQ": {
    "date": "9/11/2015",
    "text": "Real Brick oven pizza just the same as in Italy.  Friendly service, warm atmosphere.  Salad for 2 is more than enough to share.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KVJygO2pwg1RKFH4TLCcxg"
  },
  "58bmWSBOoUxPcX2Yu_w-WA": {
    "date": "6/12/2015",
    "text": "After my favorite NY pizza place closed down I started going to Luisa's and I have to admit, it's a close second. It's not the cheapest pizza, but it blows the chains out of the water.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UV7DtM2SALZSBQOBiZ65Wg"
  },
  "rLJHjVR4qg7oYqhUmBdlxg": {
    "date": "9/21/2012",
    "text": "Good Pizza. The service wasn't so great. The decor...not so great. The brick oven is visual when you first enter which is cool. I would go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iU4w4vw4fUrPxDylffpR-w",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iU4w4vw4fUrPxDylffpR-w/o.jpg"
      },
      {
        "img_id": "C_gc4bwosvSq7XnbF24AwA",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Half Spinach",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C_gc4bwosvSq7XnbF24AwA/o.jpg"
      }
    ],
    "user_id": "onsvManL82rHzpcCB3Uyfg"
  },
  "MsC7qV0Gb2I-Pa3RDfM30g": {
    "date": "9/7/2012",
    "text": "Great, very authentic brick-oven pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u8ipkF_PwdoybLOz4v-p3Q"
  },
  "9P9n-s53JNMHn3EdAaRY2A": {
    "date": "4/22/2012",
    "text": "First time me and my wife had ever been there and it won't be the last.   To me the #1 thing i loved from Luisa's (other than the pizza) was the hospitality. Jeff made us feel at home since we walked through the door. Everyone made us feel like we were locals, even though this was our 1st time here. Jeff and his wife made our lack of knowledge of their menu a non-issue. The pizza was everything that my wife and i had expected and the bruschetta.....AWESOME.  Whenever my wife or i have a pizza craving, we know that Luisa's is the spot. Awesome pizza and great service...what more can you ask for?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jswl0Tv4bn8CA7jXvPVvXg"
  },
  "gaLbjIgC3azfioakUXUeEg": {
    "date": "5/27/2016",
    "text": "When you order a large pepperoni you expect a decent amount on your pizza. I received my pizza and it had one and a half pieces of pepperoni per slice. Completely unacceptable in my opinion.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S51A9ZqI1sQW9fWFTWIO5Q"
  },
  "xNd51n2S9R1fr-0xYvN2vA": {
    "date": "6/8/2014",
    "text": "Ordered from here through foodie call. I ordered the muffeletta pizza and my son got the hot wings. Being from Louisiana I can say that they nailed the flavors of a muffeletta sandwich on a pizza. The wings were huge and my son had leftovers because of the size of the order. A very satisfying experience and we will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pFHNF4X_qUuhpFB4_C1Viw"
  },
  "04nkd_RL7TS2C6ZFa4H6pg": {
    "date": "5/22/2013",
    "text": "I love this place. The pizza is great, very tasty, and has thin crust. The pizza is cooked in a brick oven, and doesn't take long to cook, so the food is ready soon after ordering. I love the taste, the service is good, the variety of ingredients is plenty, and the price isn't too high. And their lunch buffet is worth the price.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "v3xFWIUv_8Ph3dd0gy10Pg"
  },
  "5kyPgxxKc2TPZ77y9YV33w": {
    "date": "12/19/2014",
    "text": "This place is awesome!! It's a top-quality family restaraunt! It's not one where the waiters are annoying with weird conversations, or out-of-context jokes, it makes you feel at home, everyone is really nice and enjoyable! The pizza, don't even get me started! Mouth-Watering smells ever since I got in the door! The pepperoni is great, not too greasy of a pizza, and the bacon is UNBELIEVABLE! I love it, and if you're in town, definitely plan to make a stop here at the Brick Oven.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SmuJnsTi3lsXESScp3_1rQ"
  },
  "4pWHmJAemuo3YMkHk12xAQ": {
    "date": "4/20/2016",
    "text": "I love Luisa's!!! They have the best pizza in Charlotte.. Five of us came in last night.. It looked like kids night was almost over but kids were still able to play with toys and get face painted.. The service was great and the pizza was amazing.. We havent been here in a while but we will definitely be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t5TMNQUPGUIMLk7X-dpeQQ"
  },
  "IpRilx-Cxt9UFZrLZGw69Q": {
    "date": "3/18/2012",
    "text": "Was flipping through the good ol' Entertainment Book on Wednesday looking for a place to go for dinner, and came across a buy one get one free coupon for Luisa's.  Had never been there before, but decided what better enticement to try a place for the first time than a BOGO, so off we went.    Headed up the stairs to the entrance and was greeted by a friendly server who said we could sit wherever we wanted and he would follow with our menus.  There were only a handful of folks there, but it was about 45mins before closing time, so not a huge deal at all.    The place had a couple of tv's set to soccer and I asked if he could switch one to the NCAA tournament game, and he said no problem.   We decided to try the hot wings as an appetizer and went with 1 Italian Sausage and 1 Pepperoni Pizza as our main course.    The wings were solid but not spectacular, as the sauce was hot but not overwhelmingly so and the actual wings were decent size but didn't really stand out in any way.  The pizzas were also solid but not spectacular, as they were comparable to other competitors in the local market.  What elevates Luisa's from 3 to 4 stars is the service.  They really treat their customers like they value them and it shows in their attention to detail and level of attentiveness.  Our server did a great job of making sure our drinks were consistently filled and he checked multiple times to make sure everything was ok.  He was very personable without being intrusive, and overall did a great job (even though he was a Duke fan..ugh!).   Also, it is always a nice touch when the manager swings by to check on things, and to see if there was anything he could do to make our dining experience even better, so kudos to Luisa's for making their customers feel like they are priority number one!    With the Entertainment Book coupon, it was a solid value, as the 2 Pizzas, 1 App, and water for drinks only set us back about $20.   Again, the food was solid, but what sets Luisa's apart is the excellent customer service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "yoF8kxQTH4qCDijyKMm1KA"
  },
  "Gl78Y_vZKBvhLaYtSuN0Ug": {
    "date": "4/25/2014",
    "text": "Was excited to come here. Brought kids. Awful service. Nasty. Got sick. Do not recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oAWEntmSNx8h4GO-GIL6bA"
  },
  "C2uR6UOMSLDhXgoZxpzV-Q": {
    "date": "9/17/2010",
    "text": "Ehhhh it breaks my heart to write less than stellar things about a pizza joint, even more so about a local pizza joint.   I've been on the prowl for delicious pizza - of any kind (NY or Chicago) for more than three years now. Thus I was really, REALLY hoping that Luisa's dished out a delicious pie. The overall experience really left me with \"meh.\"  Hubs and I walked into Luisa's to enjoy a relaxed Friday afternoon meal and wanted to sit outside to enjoy the great weather. Our initial greeting from the gentleman (owner? manager?) was so sweet - he genuinely seemed happy to help us. I had high hopes at that point...and then our waitress took over and it went down hill...fast.  We decided to forgo the buffet and order an appetizer of mozzarella sticks and a 'za - intending to take some home. The mozza sticks were good...however I've never had a bad piece of fried cheese. Then we waited for our 'za - not too long, though! In 15 - 20 minutes or so our pie came out...wrong. The waitress must have misinterpreted our order, but no worries...we decided to eat it anyway. That's all on us...not complaining about that.   The problems were 1) the waitress never brought us silverware, red pepper flakes, extra napkins, etc., so hubs kept going inside to grab these necessary items. Tres annoying. 2) the pizza was full of grease. I'm normally a \"pizza blotter\" anyway, but this was an obscene amount of grease. Ack. After I blotted away, the pizza was just ok - not very inspired. Very little flavor and super bland. I expected a tasty, crispy crust too, considering the \"brick oven\"...but alas it was sub par. We brought the majority of the pizza home...and I don't think we ever ate it. That tells you something because I will typically eat pizza for breakfast, lunch and dinner.   As Todd W. said - we both really wanted to like Luisa's but it just fell short. Maybe the waitress and the brick ovens were having an off day? Sad 'za, sad face.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 10,
      "cool": 2
    },
    "photos": [],
    "user_id": "qlC607Cyp0Mj91vDFvkp3Q"
  },
  "4wZYyWufPyowdZS2dDbnEQ": {
    "date": "9/13/2010",
    "text": "I wanted to enjoy this restaurant...I really did, considering that's it's locally owned and in the hot Montford area. However; my recent visit was a little disappointing. Decided to sit outside because there was a shady spot on the small patio area (3 tables). Was offered the buffet by the hostess and the waitress, but wanted to see the menu as well. While they were getting the menus I decided to check out the buffet. My initial reaction was a short giggle, as the buffet is just a few pizza choices (4-5) I believe, and a big stainless bowl that had salad it in and it looked like it was doused in dressing. Um, no thanks.   Started with an order of the mozzarella sticks, which were good...nothing fancy. When asking the waitress what pizza she recommended she said I'm not sure, I don't eat it (hmmm?). I was a little taken back by that and asked the wife if I heard her correctly after she left and she said I did. Anyway, that comment aside, decided to get the eggplant special pizza with sun-dried tomatoes on the side. Special pizza is suppose to come with eggplant, provolone, garlic and parmesean. Then we added half of sun dried tomatoes. Even pointed to the menu to make sure the waitress got it right...size was 15\".   Well after the mozza sticks the pizza came out and at first glace I knew it was wrong because half the pizza had eggplant and the other half had sun dried tomatoes. The pizza also had so much oil/grease on it, I had to go back inside and get extra napkins to pat it down. Decided to let the obvious misorder go and try the pizza...sure enough, just a cheese pizza with a topping on each half. This was reaffirmed when the check came and it said 1/2 sun dried, 1/2 eggplant. Not what I ordered. A small item that no red pepper flakes were brought out or on the table so I had to go back inside and get them from a table.   We were also charged for an extra drink we did not get. When I asked the waitress what the extra charge was she said it was for our 2 drinks. I reminded her politely that we only had 1 drink and a water. Without apologizing for the honest mistake, she just looked at the person I was paying and said remove a drink and walked away.   All and all, a \"eh\" experience. Recommendations...spruce up the buffet and leave the dressing off the side and make sure the pizza is labeled and fresh. Also, better knowledge of the menu by the waitstaff so answering questions and looking for recommendations aren't returned with awkward responses. Bummer...potential is there...",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "c8cur4lMkQsHoUEqm-qwxg"
  },
  "wdQrmHPnI-JyuIeRFyjPIQ": {
    "date": "9/20/2010",
    "text": "Best pizza in Charlotte.  The pizza is thin crust style.  The brick oven is a real wood fired unit.  The antipasto salad is huge and fresh.  The staff and owner are friendly and on top of things.  Tuesday is kid's night so it's great if you need a local fun place for the whole family.  The other nights are quieter and more conducive to conversation.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "DY5CeTfdTtol9qmn7sEVpQ"
  },
  "BsgnMJwT0OSWTAi1zU9ayA": {
    "date": "11/7/2015",
    "text": "Best pizza in charlotte.  Owner is always there and takes care of you. They really do have a brick oven from Italy and it makes this great subtle char on the bottom of the crust unlike any other pizZa in clt.....also the \"big salad \" is a great salad to share that comes family style and Has a great homemade creamy Italian dressing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6TFZfnKTe5qsO5MOp6nZng"
  },
  "YxFE8efGli0sMam7gqpNXw": {
    "date": "8/5/2010",
    "text": "My review is primarily for the lunch buffet.  For about 7 dollars you can't do much better.  The pizzas are fresh.  They usually have about 8 to choose from.  And, they also take requests for what pizza to make next.  If you want a quick, affordable, yet quality pizza lunch, you should give Luisa's a try.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "pEhPiiu7S175VaEy-rWDeQ"
  },
  "xeUdiyCl8G_6ppZPItnhyA": {
    "date": "9/14/2014",
    "text": "It distresses me to write this, because for several years Luisa's has been our go-to restaurant for birthdays and the place we brought out-of-town guests. The pizza has been fabulous, the best in Charlotte.  So for the pizza, in the past, this would have been a 4- or 5-star review.  However, tonight's visit will be our last.  And yes, it was my wife's choice for her birthday celebration, so we drove almost 1/2 hour to get there.  It started the moment we walked in the door.  The restaurant was nearly empty; only a couple of tables were occupied.  The hostess brought us to a table with two chairs and a corner banquette and said, \"is this okay?\". My wife, knowing we'd be getting at least two pizzas, said \"no, it's really too small for two pizzas.\" So the hostess put us at the next table, which had no banquette...but the table-top was the exact same size! My wife started to say, 'but that table's still too small', but the hostess simply dropped her menus on the table and walked away without a backwards glance.  Now, there were plenty of eight-seater tables empty all around us...it's not like it was a packed house, so they certainly could have let us sit at a larger table.  As it was, when the second pizza came out, we had to put it on the table next to us simply because there was no room on ours.  On to the waitress, who brought over a stack of plates, napkins and utensils and put them on the table, where the utensils promptly slid off.  Not a big deal, just loud when they hit the pizza stand.  We started with our usual, the big salad, which is a salad that's big enough for all four of us to share. (Although, as it happened, my son's pasta dinner also came with a salad, but it was me who had to ask the waitress if he got one, since she didn't mention it.)  We asked for a couple of different dressings, since we were splitting the salad three ways and one cup of dressing isn't enough for all that salad anyway.  Turns out they charged us $.50 extra for the second dressing! Now, we've been there many times before and ordered as many as four different dressings, and never been charged extra. How cheap can you be, Luisa's? That salad's way too big for one cup of dressing.  The salad, by the way, didn't come with any serving utensils; we had to ask for them. And the lettuce was brown in places.  The two pizzas arrived. The $20 eggplant specialty pizza had very little eggplant on it, and what was there was in big huge chunks rather than nice thin slices.  But the pizzas are good at Luisa's, can't take that away from them...although that eggplant one has been better in the past.  My son's pasta came swimming in sauce, which was annoying since my wife had asked specifically for sauce on the side. But he didn't want me to send it back because he was hungry and didn't want to wait longer.  We were surprised when the bill came, although the charges were correct they sure do add up fast! And of course monetarily that $.50 for 'extra' sauce wasn't a big deal...but it sure did rub the wrong way.  So my wife went to the guy at the cash register and said, you know, charging me $.50 for extra salad dressing is enough to make me not come back here' to which he replied in a bored and sarcastic voice, 'is it?'. VERY rude and with absolutely no interest in righting a problem.  I didn't hear this exchange because I was at the table counting out some money, but when my wife told me about the conversation when we got out to the car, I went back in and asked the guy...who, by the way, was the manager!...if they'd undergone a management change lately, he said no.  I said, well, things seem to have changed, and he said in what way, and I said, well, for one thing, the salad was brown, and he said 'was it?' in the same bored tone he used with my wife.  Sadly, Luisa's seems to be on a slide downhill. I hate to see it happen, but when management simply doesn't care about quality service and customer relations, and is cheap enough to nickel and dime you for salad dressing, the writing's on the wall.   With Libretto's right across the street, I think we'll be heading over there for future pizza outings.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "iiK2-UjSq69BfdE626G6fA"
  },
  "IwXWy_lt0iboHmZLRQWvkQ": {
    "date": "7/26/2012",
    "text": "First of all, move your vienna beef hotdog eating ass back to Chicago! No one likes you or your slander. This is pizza for people who know what pizza is - vs a bowl of cheese and slop that they call chicago-style pizza. No one likes Uno - it failed here for a reason. This is not a place for dBags, snotty-types, nor big timers. They have the best pie by a mile and the service will rock your lame ass! Do you really think they have slung well over a MILLION pizzas out of that brick over b/c there is any doubt about the quality? Really? Again, I drive to Charlotte from Dallas and have to fight my daughter to get to go and see family before Luisas, so great is the pie - and the world's greatest waitress also. Go here, eat, and be happy!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ptqOIs3ZwYPMU466assCQg"
  },
  "hwmRtjrfTUqA1upKCmewDA": {
    "date": "3/29/2014",
    "text": "The pizza is great. Service? Not So much. One of the waiters here asks every customer: \"Parmesan?\" Everyone said yes. But no cheese was forthcoming anytime during our meals. The closing time is 10:00 PM but they're putting chairs up on tables at 9:20? Tables around us go without cleaning and full I f dirty plates and drink cups during our entire meal. It just looks sloppy.  Here's hoping they clean up their service to match the quality of the pizza.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "qyTcPOgOgH-i4YVvSCsfhQ"
  },
  "taGj3b-8ZVRvmX5h04wT1w": {
    "date": "12/2/2015",
    "text": "This is a tough place to review.  I give the ambiance one star! I give the service 2 stars! I give the pizza 4.5 stars!  Antiquated dining room that needs to be demolished.  It feels like your great grandparents pizzeria.  Spend the money for a remodel, you're located in one of the trendiest spots in Charlotte.  It will pay for itself and bring in new customers.  DO IT!!!  Service needs to improve.  Family places often fall back on doing things the way they've been doing it for years.  This can be a blessing or a curse.  Some places get that nostalgic feel and they earn business for treating people to a taste of the past.  Luisa's is not one of those places.  They need to get better systems set up to deal with customers.  Bottleneck at the counter, seems like any kid can be a server.  I have never had great service inside the restaurant.  The pizza.  It's unique for Charlotte and it's a really good pie.  Their thin crust is cooked in a wood/gas fired oven and has unique characteristics.  New York hand tossed reigns supreme in Charlotte, so it's really nice to have a great pizza that is a completely different style.  It's not Chicago thin, it's not authentic Neapolitan or Roman, it's not Midwestern thin, and it's definitely not New York style.  And trying to define the style really doesn't matter at all, what matters is the quality and flavor of the pizza.  The crust is delicious, sometimes it's better than others.  They probably slow rise their dough in a cooler, and the longer is stays the better it gets (until all the sugars are gone and then its trash).  I like the use of cornmeal or semolina on the bottom of their crust.  I'm not sure which they use, but it adds the slightest flavor and texture and it's the perfect amount.  They are too light on their toppings.  For the price of their pies, they should do a better job with toppings.  The flavor is still really good.  If you want a crispy bottom to your pizza you will not get it here.  If you think that's what defines good pizza, get in your car, shut your stupid trap, drive back to wherever you're from, and keep your ignorant opinionated ass away from other humans :)   This is a place that most will get around to trying because it's been around and has a decent reputation.  Once they've dined in, they aren't likely to return because you feel yourself age in the dining room.  One hour in the dining room ages you one full year...for real.  It's a great pizza and one you can't compare to any others in Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "I7FvE1jTafKbS-mWy9GQqQ"
  },
  "hQEnnymuzZ__6saOfrwDGQ": {
    "date": "4/29/2014",
    "text": "One of the very few places I know that uses an authentic brick oven. Their crusts are thin, and that's jus the way I like them. They have a few Italian signature pizzas that you have to try, but you can also make your own. I've also learnt that there's no limit to the number of toppings you can order on your pizza. If you are a wine lover they also have a few selections that are good but not too pricey, especially if you want to order a bottle to go.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hKzzpKGHsO0ImnRmZlFlBw",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Luisa&amp;#39;s brick oven",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hKzzpKGHsO0ImnRmZlFlBw/o.jpg"
      }
    ],
    "user_id": "uE_j5YXkYCDnjugCJ8BE8w"
  },
  "tNLzL5IeTFX8vFbSW3wWIg": {
    "date": "3/16/2014",
    "text": "This is the best pizza in Charlotte hands down. The pizza is done in the Italian style with outstanding thin crust. The brick oven provides a great texture. Great toppings like salami. Their Coke machine is always well maintained so the Coke Zero tastes great.   Service is generally good. Ambience is ok.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6rAzelxtcMYZmla153beQw"
  },
  "uJHj4o8QKVN-9zoP9G2i5Q": {
    "date": "3/23/2017",
    "text": "Pizza lunch buffet is advertised..what you will get is a bunch of people standing around waiting for food to come out. Staff is obviously overmatched and didn't seem to care. I'd heard it was that way but wanted to try it for myself...should've heeded my friend's advice. I can't review the pizza because....well...they just never brought any out. Good news though; you meet new folks while standing around in line.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RQ8pjxIva0UX6jsuUqqJgg"
  },
  "VfPBr-K3xYu3Jxg0aUt75w": {
    "date": "6/14/2013",
    "text": "I used to hit up Luisa's a couple times a month back when I worked in Southpark. It's a wonderful place to get a quick, filling lunch that won't cost you an arm and a leg.  I've never been in the evening, but if the crowd for lunch is any indication, it's got to be busy as well. I've always gone with the buffet, complete with salad (and lots of extra tomatoes).  Pizza is super thin crust, but not cracker-y. Plenty of varieties to choose from. Fortunately, not all were topped with meat-and I really enjoyed the white pizza and a pesto tomato pizza.  The Mr and I sat outside and relished in the lovely weather, and our cups did not run dry.  Definitely make the trip up the steps and give Luisa's a try.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "jfaz1aQqnkbtzQfQyCE8IA"
  },
  "Dzg0X1y146hUhaR86NLDdA": {
    "date": "12/8/2014",
    "text": "Came here one night when it was empty. It was in a decent out of the way location. Wait staff was friendly. Pizza came out very fast.  Not as big and filling as other places I've been to, but it was pretty good and decent. I plan on coming back to try their buffet.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TiqVc4f5E0lb2E5Ykj7DYQ"
  },
  "aGsAWJ0jXaNSMSUhhylSIg": {
    "date": "9/18/2013",
    "text": "Amazing pizza... the crust is on point and there is the right amount of cheese. I normally eat 1-2 slices but with Luisa's I stuff 1/2 a pizza in. For some reason not a lot of people I know eat here... I am slowly converting them to Luisa's lovers by bringing them pizza from here. I prefer to order for pick up but have eaten there a few times and its a good family friendly place. I hear rave reviews about the lunch buffet from co-workers..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "bAxtOfFyhgvyHwK3gkBUrg"
  },
  "wylC_N2barr-_f93ePjU3Q": {
    "date": "8/25/2014",
    "text": "Stopped by Luisa's for a friend's birthday and it was a-ok. There are few options for signature pizzas and so I opted for a build-your-own-pie. I was surprised to see pickled jalapeno on the \"premium\" topic list (huh?) but the beer selection made up for it.   Overall, the experience was ok and I would come back if I was in the area and craving pizza.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NsxeGRkxu106uotU2gWAYQ"
  },
  "sbPfzHYsVNHVoJWdI9QhPA": {
    "date": "3/3/2013",
    "text": "BEST PIZZA IN CHARLOTTE!! We live 30 minutes from Luisa's but we look for every opportunity possible to go eat there.  A friend of mine recommended it as fantastic pizza and literally thought she was crazy.  There are probably 1,000 pizza joints in Charlotte what could make this one so amazing?  Well, she was right.  The first time we went we ordered the 4 cheese and we loved it so much that's what we've gotten on all of our other visits.  The dough is perfectly cooked, and the service is super fast so it gets to your table with the cheese still bubbling.  After we had each eaten 2 pieces we realized we weren't even talking - it was so good we just wanted to eat.  It's like pizza cotton candy - it's so delicate it just melts in your mouth.  I don't know how anyone manages to not eat the entire pizza but I have seen people leaving with left overs.  Great job Luisa's - we'll be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "jAIs3-KgkneG596-Jihvng"
  },
  "-LrG6XBeGrvEptWuFHVerw": {
    "date": "7/31/2014",
    "text": "Overall good experience.  Went for lunch with friends. They offer a lunch buffet. It had alot of varity, never ran out of pies. Parking is alittle cramped.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2h4FD8zytF4uxjH55dViw"
  },
  "NFIm3PDJeBTOcZATJPWMvw": {
    "date": "1/15/2013",
    "text": "Wow, why has it taken me nearly 2 years to find this place??? I am a huge fan of pizza, but don't really care for a mediocre pie. Luisa's is as good as it gets. Granted, I have only had take-out from here so I can't comment on the service, but this is a perfect mix of New York style and brick oven -  delicious thin crust, corn meal on the bottom, whole milk mozzarella...delish. Our pizza had pepperoni, onions, and olives. I was surprised (and admittedly apprehensive) to see red onions when I opened the box, but they were delicious and probably even better than white onions.  Next time we order pizza, it will ABSOLUTELY be from Luisa's!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 9,
      "cool": 4
    },
    "photos": [],
    "user_id": "SB7Dd-10J_t6fgA8BMa_-Q"
  },
  "HfpcyagK5jD4ioNhtLAycg": {
    "date": "1/6/2016",
    "text": "A close friend recommended this place and he was right - they have the best pizza in Charlotte! Not only was the pizza baked to perfection (and with great ingredients), the staff is super-friendly and they had some good wine options as well. I'm a fan!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nVqMleABE7N0veECwuM1kg"
  },
  "h6wiyuCGpu-Mc2ivRF_BKQ": {
    "date": "4/29/2013",
    "text": "After spending most of my childhood in NYC, I am always on a hunt for a great New York style slice/pie, as I don't believe in pizza delivery, I was very impressed with Luisa's. The freshness of the ingredients & the dough, cooked to perfection, we enjoyed! I have not had a chance to make it during lunch, but want to get there based on other yelp comments. A True hidden pizza spot in Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "wyQ8oi2ksrZNTsJGeMRf2Q": {
    "date": "2/16/2014",
    "text": "I need to know if you make a pizza with either whole grain or whole wheat ?  Diabetics have a hard way to go. Thanks",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O1iOISd1vmDSyS4Frm3p8A"
  },
  "qdgO2vPv8MRYKqq4JWFgsQ": {
    "date": "8/8/2015",
    "text": "We frequent Luisas weekly now that we've tried it. Moved here from NYC about a year ago and looked at all the Italian spits around town. Thus pizza is by far the best to us because of the thinner crust like the pizzerias in little Italy and the Italian spots in Brooklyn and soho. Of course sometimes you must switch it up and order a sandwich or actual entree of ravioli and everything is stellar on the menu, even the Tiramisu does not diappoint. Owner is very friendly and the restaurant is always clean. If you're in a hurry after a long day and don't care to eat, you can order them through foodie call and it's just as hot and fresh. I was surprised to find such a great Italian spot in charlotte, and so happy were right down the street.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JTV-Mcb-FbFF84eXSz-_RQ"
  },
  "xa1_Eb-AYM5sdrVdSF1Eaw": {
    "date": "11/20/2015",
    "text": "Super great pizza! Don't let the humble decor fool you. I was in the area and decided to give it a try. I'm glad I did. The lunch buffet was $9.99 and included a drink. You can actually see the pizza guy placing them in the brick oven.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tq4qSoeDgDlAPap4Eesz8w"
  },
  "f8lGP2PrfrPEiA3yMhGTBw": {
    "date": "11/17/2015",
    "text": "This place has delicious gluten free pizza!! The salad was sub par and the service was extremely slow. But the pizza was delicious and fresh tasting!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7yXNEnnTZAEhl7N-qv9fyQ"
  },
  "DKWE7fs2rfEZQlqlSFAv9w": {
    "date": "12/7/2015",
    "text": "Luisa's might have a great story and a brick oven, but I wasn't impressed with the pizza. We ordered 2 large specialty pizza's for carry out. One Luisa and the other a Margherita. Disappointed mainly because both pizza's lacked flavor. It was like we had ordered 2 large, bland, and soggy discs of dough. May have been a better experience had we dined in.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jjul3N9z-e9A2gEAhqmdSA"
  },
  "V1hUu7juf0peFkcgrZZZ7A": {
    "date": "4/5/2013",
    "text": "Went to Luisa's for the lunch buffet. Very limited selection, but they were nice enough to take requests. The pizza was amazingly thin, and the service was good at first.  However, the pizza itself didn't wow me. The crust and sauce both lacked flavor, and even a well done pizza was still soggy. I like thin pizza with an initial crunch then some chew to the crust. This had neither. The buffet salad was predressed and quite soggy.  After the first round of drinks, we had to go to the desk to ask for every refill.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7kE_vJPtyYoMaYB07QGKqA",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Very thin crust with cornmeal on bottom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7kE_vJPtyYoMaYB07QGKqA/o.jpg"
      },
      {
        "img_id": "V4-3Jb8PyJtZA0dW5ktLXw",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Tomato, garlic and pesto pizza was flavorful",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/V4-3Jb8PyJtZA0dW5ktLXw/o.jpg"
      },
      {
        "img_id": "F-M3t4GpUvaNMzahwvDD5w",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Buffet - white pizza with pesto. Overall very bland and greasy.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F-M3t4GpUvaNMzahwvDD5w/o.jpg"
      }
    ],
    "user_id": "x37OyP--VEFE5p-xreplYA"
  },
  "C4Hy1Lu35o6cPMNpeMG8zQ": {
    "date": "3/4/2017",
    "text": "Came in to try for the first time. Most pizza places serve pizza. No pizza for us. Was told it was coming, but 40 minutes later, still no pizza. Please do not tell customers the pizza is coming every 10 minutes when you know it will take a long time. And when you say you will take care of the bill, why did I end up paying $17. Ohhhh, you didn't get permission. Chance we will be back....not likely.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6eh6CJWH92QOWbHc28VNg"
  },
  "lKUbrXPkb0GLO2UgX4J5aA": {
    "date": "10/3/2015",
    "text": "We went to Luisa's for dinner last night, it was pouring rain and cozy Italian sounded great. We were seated immediately with a smile. As we approached our table I asked to be seated further away from the table of maybe 12 with 6 small kids. It is very family friendly, but if you want a restaurant a little more adult oriented this might not work for you.  We ordered a large pizza, salads, and a spinach lasagna with spicy marinade sauce. A bottle of Mark West Pinot Noir for only $29. Service was quick when we ordered, salads came fast and with a bit of a delay in the food the manager came by apologized and explained the pick up service was super high and the kitchen was busy with the rain so many pick ups that night. We were fine with it chatting and having our wine.  Food came hot and delicious. The spinach lasagna was molten hot and gooey and delicious. The pizza was large and crunchy edge. Do I wish the bottom of the pizza was crispier, yes but it was very tasty. Maybe you can ask for extra crispy, not sure our first time here.  Let me say I am born and raised in Chicago and only living in Charlotte for under a year now. It does not compare to Chicago pizza it's apple and oranges, you just can't. BUT, we think it may be our favorite pizza in Charlotte so far.   Service plus: during dinner the manager brought over 3 different wines for us to sample as he was ordering new ones for the menu and wanted our opinion. I felt so honored and special, he was cute, funny and just such a great treat. Sometimes good service can make or break your dining experience. A++++++++ for a fun time and a feel good place I will definitely return to!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "LXwIwJiObtyR5szpwwatRw"
  },
  "y8_xlJcu4wyhqE47pu7ljA": {
    "date": "5/2/2013",
    "text": "I was super excited to give this place a try after reading the awesome reviews. I'm always looking for amazing pizza in Charlotte and this place did not disappoint.   I kept it simple and ordered a small pie half cheese and half pepperoni. While I was waiting I noticed all the pies that kept flying out the kitchen for the lunch buffet! They had a lot of different options and the super helpful and pleasant staff told me they take request for the buffet...whooo hooo!!! Seriously?!?! Yeah, I will definitely have to return for that...it's open Monday-Friday from 11:00-2:00.   My pie was ready in about 15 minutes. I really liked the thin crunchy crust! And the flavor from the brick oven was awesome. I'm seriously falling in love with brick oven pizza!!! Not really a problem, but they say the first step is admitting it! Anyhoo...I also really liked that they didn't overwhelm the pizza with too much sauce which is a huge pet peeve of mine! The cheese blend was excellent and they were pretty heavy handed with the pepperoni...which is always a good thing.   One downside was the parking. It was a bit of a nightmare, I during the lunch rush so it was hard to find a spot and when I finally did it was on the side of the building in a compact space...and while my car is far from compact I made it work. Well when I came out I was backed in...but some VERY helpful staff helped me out and of the tight jam. Just goes to show that their excellent customer service extends outside of the restaurant. Awesome!   Like I told Amy C, I definitely recommend trying this place!! I know I will be back because that lunch buffet is calling my name!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "CtohVA2-HwoHAeXtaEbPfQ": {
    "date": "10/7/2013",
    "text": "The pizza here is so good! I had never even heard of Luisa's until a few months ago when someone told me I HAD to check this place out.. I'm so glad I did! I've eaten here 3 times & have not been disappointed yet.   On our first visit, my BF & I got the 17\" with half Rodolfo- artichokes, ham, mushrooms, & some red sauce & pesto (he subs out the ham for ground beef) & half Bianca- a 3-cheese blend of mozzarella, provolone, & parmesan, garlic, sun-dried tomatoes, & no sauce! OMG I don't even know if I have the words to describe it.. It is so delicious I could probably eat a 17\" by myself in one sitting!  I guess BF liked the Rodolfo since he got it again when we went a 2nd time. I also got the Bianca again.. I don't even know if I want to try anything else since the Bianca is amazing already. The crust is very thin with some cornmeal dusting on the bottom.. very nice touch.   We also tried a couple of apps.. BF got the calamari & he wasn't crazy about it & I also tried the fried mushrooms. They were good, but very juicy, so it was kind of weird. I'm happy enough if we just stick to the tasty pizza!  On my last visit, I tried the lunch buffet with a friend. For $8 you get a soft drink and unlimited salad & pizza. The salad was ok & they had several different pizzas to choose from. I went with a cheese & pesto pizza.. greasy but still good enough that I ended up eating 5 slices :) Can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "RTlvmyy3b0EQWZOzJBtojA"
  },
  "dAN3DIzfr7bKVKVLgIOBRQ": {
    "date": "12/6/2016",
    "text": "In town looking for a 4 star place to eat. Found this fine place. The services was fast and the pizza was good. Pizza is very thin crust if that's what you like. Kimberly was the waitress and a True sweetheart.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a9L8xIQv5A4XjmFq4c6Njw"
  },
  "vaDc3467rF4_kW1zrYZs6w": {
    "date": "2/15/2013",
    "text": "More than Pizza!  Meat Sauce on Pasta (or in a Bowl) is VERY Good!  Might be the best in Charlotte!  Get Here EARLY the place gets Crowded and the Parking lot fills up fast!  Pizza here is Very Good, the Lunch Buffet is very Popular and as good as getting a Pie at Night!  This Pizza is WAY Better than Al's Pizza and is also Better than Jett's and Fuel!  Meat Sauce on Pasta Mmmmmm!!!  This one is Mmmm YUMMM!  One of my Favorites... Just right on the Spices and Meaty!  Very Good Flavor!  This Italian Sandwich could be avoided if you can get out of the Neighborhood... Which means they BEAT a lot of places on Sandwiches:  They Beat Al's Pizza, Mcallister's, Which Wich, Jason's Deli, Fuel and probably everyone in the Neighborhood!  Compared to their Competition (just in the Neighborhood) they would get 4 stars or more on the Sandwich, Compared to the Best in Concord, Charlotte, Cornelius and Rock Hill, the Sandwich would rate 2-3 yelp stars, closer to 2 probably!  Vavid!!!  I do not consider this place a Lookalota, though many will, from the Parking lot to the Stairway to the entrance to the Dinning Room!  You could get a WHOLE Lot of Attention here though not everyone would notice, nor be happy about it... You can probably ignore it and be fine!!!  People watching People is entertaining sometimes for sure, it would be nicer if more subtle...",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "CBijFK9T6zNl8R4Y0k2FRw",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CBijFK9T6zNl8R4Y0k2FRw/o.jpg"
      },
      {
        "img_id": "ig9v4PYGT34WdJeElaCkaA",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ig9v4PYGT34WdJeElaCkaA/o.jpg"
      },
      {
        "img_id": "EpfNrpWqVN0imAfUyj8l9A",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EpfNrpWqVN0imAfUyj8l9A/o.jpg"
      }
    ],
    "user_id": "Ug0ujy9-jd0Oc2nk3KIotA"
  },
  "pMEnrIfcry0pIKo9GvHbRQ": {
    "date": "8/21/2016",
    "text": "I've been wanting to try Luisa's since we moved to the neighborhood over 2 years ago! Crazy how long it took us but we finally grabbed a Sunday night pizza to go. We had the Luisa which comes with pesto and ricotta, instead of fresh tomatoes we had half with sundried tomatoes and half with Italian sausage. The pizza had good flavor and I think the pesto was one of the best I've had on a pizza but I found the crust a bit disappointing with the brick oven hype. It wasn't bad but it wasn't great either, the crust was burnt in a few places and the bottom of the middle of the pizza seemed almost underdone. We enjoyed our pizza but since we rarely get pizza to go we will keep trying other location spots before going back.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GyJf71ss616pHZrFZpL42g"
  },
  "DenkqCw_TSvtngr99MlYmg": {
    "date": "11/11/2012",
    "text": "It has been a long time since I have eaten at Luisa's.   When we first walked in, the place looked a bit dated and I was a bit concerned that it would not be as good as I remember. However, I was pleasantly suprised.   We ordered the Fiorentina -which is thin crust topped with red sauce, spinach, garlic, fontina, parmigiano, & mozzarella.  We added chicken to it...which came to about $22 for a 17 inch pizza.   The pizza was nice & flavorful... not at all greasy.  The thin crust was nice & crispy, just the way it should be coming out of the brick oven.  We were so pleased to see that the quality of the food is as good as we remembered.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "GCxF4KCSb-wwY5XEVhNHrw": {
    "date": "9/3/2017",
    "text": "Best pizza in Charlotte. The muffuletta special is awesome!  Always friendly service and the neighborhood atmosphere is welcoming.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D7MbimdCYak4dCtTlzJ47w"
  },
  "jTU4wwpzsGIE_XEHuhmcYg": {
    "date": "8/8/2016",
    "text": "I was very very unimpressed by the food. I honestly don't understand how people like place. Pizza looked good..but tasted bland extremely unfavorable. I'm sure the lack of flavor from the pizza sauce didn't help out at all. The chick parm was burnt and as for the marinara that was drizzled over the pasta, I think Ragu might taste better...seriously. The salad was ok..the ranch was not. All and all, I will never eat there again",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8eV_d5qzqdBcwrItV3KI9g"
  },
  "GBiPxgsxnCg-lpnxYCAcvw": {
    "date": "9/1/2017",
    "text": "Love the pizza and friendly service here. A great neighborhood pizzeria and easy takeout",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZzsE-HhiUANpKe5nACUGA"
  },
  "nfOYELOyyMxIYzDa2kU9-w": {
    "date": "2/10/2015",
    "text": "The best unique Italian Pizza you can grab in Charlotte. In hidden spot great flavor...good toppings and tasty salads as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "b0Bd9SyjfJ3QT42fQIovXw"
  },
  "ZTUYmjbQtk-6PovADdGRqg": {
    "date": "12/5/2014",
    "text": "In town this weekend for the ACC championship game and the hubby was craving pizza. After perusing yelp and looking thru the Charlotte Magazine, we found Luisa's.  Luisa's is definitely a family owned restaurants with pizza as its specialty. Having  been to Italy (and now a very picky pizza eater), Luisa's does a great job coming close. I'm a thin pizza crust lover (or I'd prefer no crust), so this was perfect for me. It's brick oven pizza, so the edges are slightly burnt.... just like traditional Italian pizza.  It's a very home like feeling and everyone that works there was super friendly.  Great find on our short trip and exactly what we were looking for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DmNgfpnr-M051u6NMJd0RA"
  },
  "0mhNSRcfDmiScnSInK-wRQ": {
    "date": "7/17/2017",
    "text": "Great pizza!  Used to get pizza down the street at another spot until I just got fed up with the quality. Louisa's however never disappoints. Great quality, great price, great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QdV_1qkYnv3i4sn0cDFBwQ"
  },
  "CbY2XjpEkowp18OcicnE_g": {
    "date": "6/27/2015",
    "text": "This pizza may pass inspection in North Carolina.... but it is a chez ordinaire in the rest of the world.  Never expected Chicago quality.... and was clearly not disappointed .. not even close. Have had oven baked pizzas many times... They must be using strange coal because it did not have anywhere near the same taste.  Ordered a sausage pizza located a few pieces of meat on one side of pizza and none of the other.   The pizza it was mediocre city.  They should visit chicago and learn.... actually Domino's would ace them in a contest.  We used an outside delivery firm they were perfect ... perhaps they denigrate the pizzas they ship out?   How could someone mess up a pizza...beats me.  Felt compelled, a week later,  to share this pizza embarrassment .....  P T Brent   Originally from Chicago W G C",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XJK43JFm6ZP8-xTICCYySw"
  },
  "GHx55QgRgBDwuSlBEToqig": {
    "date": "7/1/2015",
    "text": "Here for the lunch buffet. The salad \"bar\" is very very sad. A bowl with lettuce with dressing already mixed in with a side of tomatos and some pasta salad. Thats it. The pizza is good but they only make 5 pies at a time and they are gone in minutes. I waited 13 minutes for fresh to be added and i only got 3 pieces cause the line was so long waiting for the pizza. Cone early if you want to eat.  But for $8 what do you expect, cicis is better not quality but quantity and ypu dont have to wait forever.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DlqdkcwoOUL-65TLLPFvcg"
  },
  "TE9PItQVEi73349aOMlkiw": {
    "date": "7/9/2015",
    "text": "Pretty underwhelming. I paid over $18 for a medium specialty pizza. Not worth the money. 2.5 stars. Pizza is too flimsy and the cheese wasn't that tasty. Not very many toppings, not great. Hope this helps.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXu_ELboKx5DT6hkyBPlcA"
  },
  "jhQevC3OIHlCsKmT5zeGRg": {
    "date": "4/20/2016",
    "text": "Love this place! Between my boyfriend and I, we have been to just about every well known pizza spot in CLT and after each time we always end up feeling like Luisa's wins out. It is a family/employee owned restaurant (owner Luisa started it and ran it for 15 years and then sold it to an employee who's had it for the last 10). It has a very old timey family feel and is not overly presumptuous or fancy. The Fiorentina Pizza is AMAZING and when their homemade ranch is added it cannot be beat. This place does a great job of making you feel welcome and satisfied every time you come. Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Mc2YnaY4_N1_V1Rnkp-3jg"
  },
  "r10HPFRZSYsva81lTAKRag": {
    "date": "7/19/2017",
    "text": "Came hear based on high praise online. So disappointed. Their claim to fame is the brick oven. Our pizza came out under cooked and extra greasy. The anti pasta salad was good though",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gR2umVkfeJBp5MBrkTORPA"
  },
  "WeD8zYmYMqQYjmQHown_9w": {
    "date": "3/8/2016",
    "text": "This place is such a great deal for lunch. Pizza buffet is amazing. Classic cheese, basil tomato, and veggie pizzas are great! I love the history of their oven imported from Italy. They've made a ton of pizza in it since the restaurant opened. The staff is friendly and they are good about keeping pizza and salad fresh and full on the buffet. It was also clean! Can't beat it for $10.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WHMOlARVbnBZkrix5jMVuw"
  },
  "ZG4IO6HV2VtufXqbgVpx5A": {
    "date": "6/18/2018",
    "text": "Some of the best brick oven pizza I've ever had.  I created my own with salami, proscuitto, pepperoni and ham.  Absolutely Fabulous! Good ratio of cheese to sauce.  Definitely coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Tp9J0wMfjcoxIYoDg5DOQ"
  },
  "LpBpoF7ThK1dkd_5EzO_iA": {
    "date": "9/19/2017",
    "text": "Excellent brick oven Italian pizza! Great for lunch- all you care to eat buffet with many kinds of toppings. Lunch-$8 we go there every Tuesday for lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oGShdLQfyepF_xCEYHaOeg",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Say hi to Lori, our favorite server!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oGShdLQfyepF_xCEYHaOeg/o.jpg"
      }
    ],
    "user_id": "7Fob8moTCf7O2woVK2uhqg"
  },
  "Z1mvh6JUoQsNaEyYPvEmZg": {
    "date": "9/18/2017",
    "text": "High quality pizza and great service. The owner's hospitality made us feel like having dinner at our house. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ai3IdwDPOM8XxQSlRuXH0w",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ai3IdwDPOM8XxQSlRuXH0w/o.jpg"
      }
    ],
    "user_id": "3o-Y0q4OA_fZBErl5diV0A"
  },
  "PbSntUXQeXSOrDALpybjlQ": {
    "date": "11/19/2018",
    "text": "Luisa's has a lunchtime pizza and salad bar buffet. The pizza and salad were decent, the pasta salad better, and the service the best. The lunch buffet price was $9 a person.  It's all you can eat.  Everyone working there was welcoming, helpful, and fast.  Pretty good option for a team lunch.  It gets busy around lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OIpOb9GkWRBa2c-ymvalFA"
  },
  "abCkhzttKtcfLTfefybMKQ": {
    "date": "11/10/2017",
    "text": "We've been in Charlotte for 4 years and we cannot believe we just now discovered Luisa's. This place is awesome! We had pizza, bruschetta, and beers. Pizza was exceptional. The tomato mixture for the bruschetta was super good. And they have great beer specials. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "1uOuC4NbDV64bxG16sYK-w"
  },
  "Q5Lzx07c2630hzJdIKHaGg": {
    "date": "5/21/2016",
    "text": "After Reading a few reviews on the their Gluten Free pizza, I decided to try luisa's. I'm still on the hunt for a decent pizza for my wife. I got there at the end of the lunch rush and took the pizza to go. The top of the pizza looked great, Hawaiian style ingredients. Unfortunately the bottom was way undercooked for us. We threw it on a cast iron skillet and cooked it more. My wife said the ingredients were nice but she wouldn't want to go back. So there goes that. The price was good as compared to other GF pizzas we've had.  As far as their regular pizza, I grabbed three slices from the lunch buffet. Super small, but tasty. A good munchie pizza. I was turned off by an employee who came out grabbed a slice and jammed it in his mouth. Not cool in front of customers in my opinion.  Too many pizza places in town to choose from so we won't be returning to Luisa's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SlDD_u9gt9-RTviBWHAy4A"
  },
  "Qv9K0l6hC6SoCgB7Xr2owg": {
    "date": "10/4/2017",
    "text": "The best pizza around! I discovered this place in college, and haven't been able to eat pizza anywhere else since.  The best lunch deal.  Love the variety of pizza on the buffet.  All around great pizza, great service, friendly cooks that don't mind interacting with customers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "wKFpuIjUNKxsMkGubFfneg"
  },
  "Af4fWt6uDv5VbVn9JB2dNA": {
    "date": "10/27/2017",
    "text": "We just moved in around the corner and this is our new favorite place!! AWESOME pizza, very friendly and laid back staff, they really make you feel welcome as if you are in their home as guests. Wonderful place, love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "K7ik2pKLrPOu9kBZgGQnKg"
  },
  "5MY5402c3qdO1DhtrCy7PA": {
    "date": "11/4/2017",
    "text": "Food was great. Service was fantastic. Tripp was extremely friendly and sociable. Will dine here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1AF17Y-mIlUshlX9I7Vttw"
  },
  "0thRgeGvBAm0Wgg-27SdfA": {
    "date": "12/28/2017",
    "text": "Very good pizza, very good. A little greasy but for the money and size of pie this is great deal. The staff are so nice & friendly. Great for families with children. Looking forward to trying other items off the menu. Small almost not a  bar area by front door, wonder why that is even there. First time it was so greasy  I almost wrote this joint off. Second visit we chose less greasy ingredients and brought it right up to 4 stars. Cool wood fired oven from Italy. Give this place a chance, you will not be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfE764lyJDLXZkNfPnFlrA"
  },
  "cR6-1lisNWmAYnniLwlqCA": {
    "date": "5/24/2015",
    "text": "This is one of those places that you liked but things did not go well. but you knew they could had circumstances and timing been better?  Well of course we get there early and greeted right away, and we were sat just to the right of the dining room. Then came the kids Birthday party and always when early afternoon it is with parents who can not control them so they are up running around and screaming and yelling.  Funny thing their were 2 servers one younger she was ours and one older but...I do not think the older one wanted to serve the kids section so our server was pulled to handle us and them, leaving us with no attention.  She blew it off with I knew you had your wine and you liked the pizza, so i knew you wouldn't mind if I did not come over. Really?  Pizza was inconsistent in the crust too thin at the middle, too thinck at the edges, must have been a new maker.  So it was okay towards the edges and slimy at the middle. Do not get me wrong it was a good pizza but you definitely have to eat it with a knife and fork or fold it over.  The fried ravioli was good almost tasted packaged instead of fresh.  So far Brix then Mama Ricotta's pizza is how we order the preference in favorites.  Will keep looking for something better.  Not a bad place to go and will leave this at a 3 till we see how the next visit goes.   PS  A little out of date in the ambiance.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "4o0KkpAkyO6r0NHXmobTeQ"
  },
  "Xzhv6LupX6rBOaNz6dywOg": {
    "date": "5/28/2018",
    "text": "Very tasty crust on the pizza. Salad was very fresh and full of different lettuce. Great service and enjoyed the beer and wine selection. Overall excellent",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mcXD28P6fxKo9I_NSRZlMw"
  },
  "UXDvsQqhAin-fbpy355FKw": {
    "date": "2/28/2018",
    "text": "This place has the best authentic brick oven pizza around. They have a legitimate brick oven from Italy that they only use wood to fire - no gas flame like so many other places do. They have a great weekday lunch buffet to sample their various pies.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9QXTEffSpdhzSc7HQCkmmg"
  },
  "ZlFsNrLgz7p7CtMkfCzpCw": {
    "date": "11/15/2014",
    "text": "So I've read all the reviews, mostly from my fellow Yelp Eliters, about this possibly being the best pizza in Charlotte. My first time here so I went for their famous pizza buffet as you get to try various types of their 'Za. I believe I tried one of everyone they put out.  The first thing you notice is how THIN this pizza is. This to me is NOT \"NY Style\" pizze, but rather classic Neopolitan....with minimal toppings and a crust you can almost see through.  The thin crust was nicely baked, and the rim edges were crunchy and flavorful. Toppings were tasty as well. But in a Neopolitan you simply cannot put too many toppings on it due to the uber thin crust which couldn't take the weight.  For only $9, you get all you can eat pizza, pasta salad, regular salad, and a drink. That is a pretty good deal!  But I have come to the easy conclusion that this is not even close to being \"the best\" pizza in Charlotte. It's tasty and good, nice staff, but to me, Portofino's pizza and some of the other (gulp, hold your breath) chain restaurants like Brixx are better than Luisa's. Maybe it's because I grew up eating Chicago THIN (yes, Chicago has it's own THIN style) pizza which have tons of flavorful toppings. I just can't get past the whole (\"hey honey, you can see through the crust) uber thin crust style. Hey it's good, don't get me wrong, just not my thing.  And for the record, New York style IS THICKER than this crust. Not much, but New Yorkers do enjoy toppings on their pizza's as well.  I'd definitely come back though for a good pizza buffet. Maybe I should order a full pie to go and see how that differs from their lunch buffet?",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xn8kPiMdWcu_D1d6E0lYsg",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Very thin crust pizza with salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xn8kPiMdWcu_D1d6E0lYsg/o.jpg"
      }
    ],
    "user_id": "QYobbHEmhLGuS6QDqVRTLw"
  },
  "UrRH3spovybC2VnyzMI8Mw": {
    "date": "1/14/2018",
    "text": "I had not been here in many years because we lived far away at the time, but ordered takeout yesterday. When you go here, please do not expect your typical low quality, rubbery, greasy chain pizza. Everything tasted fantastic. Their brick oven pizza is the best in the entire area. Thin crisp crust, light chewy cheese, and just the right amount of sauce. My daughter loved her chicken alfredo and she is not easy to please. The salad was fresh and well made. Great service, great value, great portions. We can't wait to go again! Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2nzcgExGUbP3YjgtrVhkbg"
  },
  "qIHg38zY4DOR-0RLB-IonQ": {
    "date": "8/3/2017",
    "text": "I didn't enjoy the lunch buffet AT ALL. 1 watered down salad, 1 pasta salad, pizza was soggy and oiled on the bottom. Save your hard earned $9.00. It should cost half that if not less. If your looking for that crusty snap when you bite into the crust, you aren't going to get it at this place. The pizza is limp and chewy. When you grab the slice it flaps down and the toppings just slide off. The toppings are flavorless the sauce is as well. I tried sausage, pepperoni, cheese. One flavor...SALTY. If you're looking for depth of flavor with garlic, herbs, etc. you won't get it in these slices. I don't know if the quality is diminished for the lunch buffet but based on this LESS THAN 1 STAR experience I won't be back to try the other menu items. This place highlights \"best of Charlotte\" the last sign I saw was from 2008. 10 years ago.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "02C-Fenrs-7RyfktuFDOog",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. This is it. The lunch buffet options. GROSS. 2 thumbs down",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/02C-Fenrs-7RyfktuFDOog/o.jpg"
      }
    ],
    "user_id": "a6FN81i7fs4sUGuGfxFbmw"
  },
  "6c69iMEjhQ2SPp3qijMPGQ": {
    "date": "1/31/2018",
    "text": "This is the first time I have been here and we decided to go there for our payday lunch as a group.   Our waiter was awesome (he looked like Daniel Bryan from the WWE).   He was very attentive and even took a special order from one of my co-workers who didn't want the buffet.   The buffet is the best value.    They kept bringing out fresh salad and pizza the entire time we were there.      I didn't feel over stuffed by eating the pizza there.    Very reasonably priced at $9.00.   We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tA8G2mkfCbPJZA2tvPbgGA"
  },
  "2RmgCdqjwaOBiauuaI1tlA": {
    "date": "6/14/2013",
    "text": "$8 for an all-you-can-eat pizza buffet? It sure beats the heck out of others I've experienced elsewhere and the offerings are straightforward, well-executed, and not withholding on variety. We came in at peak lunch hours and still managed to grab a seat, indulge, and get out in about 35 minutes.   The buffet is small, but awesome. A few tasty salad options at the start and a generous variety of pizzas. Several vegetarian options, some with meat, some plain, some more complex. My favorite was the pepperoni with pesto and any that had a blackened crust. I'm a large proponent, and of the school, in blackened pizza. A well-done crust, rather. This flavor is key and it makes the flavors really sing in a properly developed dough. The hearth of that gorgeous oven is making a rather fine pie. Where the buffet is awesome, some of the pies were getting shucked in and out quickly, so the middle was a little underdone. No worries, though. The black crust totally made up for it.   In and out for the two of us at $20 is a steal and well worth it. I'm really looking forward to visiting again soon. Here's to you with a well-deserved tip of the hat, Luisa's. I'll be back soon.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "i3PDhjvi71MtKgxYwHe1dw",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. I want this oven.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i3PDhjvi71MtKgxYwHe1dw/o.jpg"
      }
    ],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "9ZTE-bLjcsEgBAbXcRt6rQ": {
    "date": "5/7/2014",
    "text": "If I'm going to have a pizza it's not going to be Pizza Hut or Domino's. I want something made from scratch preferably baked in an oven from Italy. This is what you get a Luisa's.  Their flavors are simple, clean and fresh. I have to fight my boyfriend for bites of lasagna. Their wines by the glass are reasonably priced and they have a pretty ok craft beer selection.  Pasta entrees come with a salad and garlic bread that is garlic butter pizza crust,  They must bake love into their pies because you can certainly taste the care.   Service can be a scotch slow but I keep on coming back from the heart and stomach filling pizzas.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XatJ1Tkqw5dw5n7WeWr_FA"
  },
  "GG188CleNpORRXuamI_54w": {
    "date": "6/10/2013",
    "text": "YES!!! Real Italian style pizza in Charlotte!  I ordered one of the specialty pies that has prosciutto and it was great! I would recommend it to everyone, I would scream Luisas from the highest mountain top, and I would declare that this prosciutto pizza is the finest pie in the Queen City.   Toasted ravioli here was great. The marinara sauce is fantastic as well!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "IRwBBig6UEaZOTuUVjhC8w"
  },
  "7_Qe7heSxe0Es1QZuVjXjg": {
    "date": "8/8/2019",
    "text": "Their pesto pizza is amazing and we loved the buffet. The staff was super friendly and personable. Best pizza and service I've had in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5BLforkktfYijUJcYtiSEg"
  },
  "MCrRbc3vovwTbsMU97yH9g": {
    "date": "10/16/2018",
    "text": "Went for the lunch buffet and was underwhelmed by the quality of the pizza.  The salad had iceberg lettuce and green peppers and tomatoes.  Restaurants need to do better than iceberg lettuce! I WILL say that the price for the buffet was $8 and very reasonable. I don't eat pizza often because of the carbs and calories.  When I do, I want pizza that is so good that it makes me want to dance around the block.  I was not dancing after I ate this pizza.  Additionally, the service was mediocre at best.  I asked twice for some sweetener for my tea.  The server never brought it and we had to go fetch it for ourselves.  I wish them no ill will, but there are better places to go when you want a pizza splurge!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Pf0axSzFtY5xHNVtcm_RGQ",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Pf0axSzFtY5xHNVtcm_RGQ/o.jpg"
      },
      {
        "img_id": "-FJXOOi7AO3hjl3MYnJE2Q",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-FJXOOi7AO3hjl3MYnJE2Q/o.jpg"
      },
      {
        "img_id": "_e_oOg0l6I2xKd3tXagAbA",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_e_oOg0l6I2xKd3tXagAbA/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "fIcPzIX-4PZJkLSwlPNIVw": {
    "date": "3/26/2019",
    "text": "We had lunch here for the first time today. I work with clients with disabilities, and I'm always looking for affordable restaurants where we can get our monies worth. This place didn't disappoint. For $8.50 you can get the \" all you can eat pizza & salad  buffet \" Unheard of right? They had several pizza options, pasta and the salad was fresh. The $8.50 doesn't include a drink. A drink is included for $9.50 .....I think we just found a new weekly spot...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "1EKqHFW1gCvIni65JJ22kQ"
  },
  "HAonGdTeIxtBd4AM-9ovAg": {
    "date": "8/5/2019",
    "text": "Fox News on all the TVs but good food for the price. Friendly staff. Buffet is worth it. I will try to sit with my back against the TVs if I return.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "opAXLe8cuoJhnJFtKxaTTA"
  },
  "fpqOK8yq2CuNgJfao91luw": {
    "date": "12/14/2018",
    "text": "Lovely little family spot! Very friendly service. We got the Milano pizza and a build your own with pepperoni, Italian sausage, and roasted red peppers. I highly recommend the Milano!  Both were mild and flavorful at the same time. Perfectly sauced and perfectly cooked!! Can't wait to come back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LvZ--kzma9nOyTUz2ZHRkg"
  },
  "OgSqqVJFdMIzvnUsgF655w": {
    "date": "6/13/2019",
    "text": "The worst pizza buffet. Out of the 6 pizzas there was only 1 veggie option. The salad was iceberg lettuce from what looked like a bag with only 1 salad dressing option. Even the pasta salad had meat in it. The people working there were not friendly and it was over all a horrible atmosphere. Never again, pizza hut buffet would have been 100 times better than this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-zUxiLPcEyr67HPkQK3Nkw"
  },
  "_Ja9MX--VoIg9eYZR4xmAw": {
    "date": "4/8/2018",
    "text": "Finally dropped in to try this place after driving through some months ago from that popular bakery.  The staircase caught my eye and gave me a 80s vibe. Looked cozy.  I got a medium deluxe pizza with veggie toppings, sausage, pepperoni, and bacon.  I figured it would be about $18.  It was $23.  Seems if you have a great taste palette you pizza will almost be $25.  Luckily, it was a delicious pizza and great service.  The guy who waited on me knew what kind of pizza I had in mind and suggested adding garlic which I had no idea was topping (rare thing to get a suggestion).  Friendly crew. So far its my favorite Italian pizza in town.  I would definitely say this a good date spot and a spot to unwhine if you're alone too.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "EU-7AHOgKZ-HQfojFESJzQ",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Custom deluxe pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EU-7AHOgKZ-HQfojFESJzQ/o.jpg"
      }
    ],
    "user_id": "DaUJvHMmKoDDT3vB_ltJ6g"
  },
  "HahW5VVDHIbYUTcYv0hdEw": {
    "date": "2/17/2018",
    "text": "Besides the Pizza Pie rivaling if not better than some of the Best Brookyln's pizzerias. this is an excellent place.  Prices are also considerable, given its prime location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DQiguCl7ea4V70cq__vjuQ",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Good Chewey Pizza. Perfect Dinner.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DQiguCl7ea4V70cq__vjuQ/o.jpg"
      },
      {
        "img_id": "G_jSlSZzDcepnv9seVYUWQ",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Best Pizza in Charlotte.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G_jSlSZzDcepnv9seVYUWQ/o.jpg"
      }
    ],
    "user_id": "u7CVJnBiU_lMFlWC2DE4GA"
  },
  "sapYVTgMK0Z2YX79jcY8MA": {
    "date": "2/11/2019",
    "text": "Worth a long wait! I first had this pizza for their lunch buffet and I wasn't too impressed, perhaps because it had been sitting there for a while. Fast forward a few years and I went back during National Pizza Day. The place was packed! It took a little while to get a table and the service was pretty slow although pleasant. However, it WAS NPD and all of their pizza is baked in a single brick oven so one could see why this would cause a delay. We ordered calamari, which was kind of underwhelming but kept us entertained while the pizza arrived. Pizza wise we ordered a muffuletta and a margherita/peppermint. Their homemade dough and sauce are great! The freshness really comes through. The dough is reaaaally good. The muffuletta was very tasty, great combo of spicy and tangy which paired well with the salami. The other combo pizza was tasty as well. There's a reason they have sold over 1.7m pizzas. I'll definitely be returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iwqvHafuIkAyBF1nN06A6g",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Muffuletta on top and pepperoni/margherita on the bottom.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iwqvHafuIkAyBF1nN06A6g/o.jpg"
      }
    ],
    "user_id": "CLFEYhpsuv-S07T3FSHlJQ"
  },
  "_4GMrYfFNt_B8OxbiaivRg": {
    "date": "2/10/2019",
    "text": "This was a disappointing end to an otherwise beautiful day.  The apparent change in staff and management has resulted in a serious decline in customer service and customer appreciation.  Order of arrival does not seem to matter - it's whether the owner Jeff knows you - are you a regular, a friend, you can have a table first...  After we were seated our waitress brought our drinks to the table and took our order (2 large 3 topping pizzas). We waited over an hour, watched others around us eat, pay, and leave, and we still had not received our food. So we decided to leave, I have been a customer of Luisa's, I have recommended Luisa's, I won't be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jio40SMzgSu_qshMHXXJhg"
  },
  "IreJ1sdHKhu5dfcTMY9ppQ": {
    "date": "11/20/2016",
    "text": "I'm not sure what happened to Luisa's. They used to be really good but my most recent take out order was absolutely horrible.   I had ordered a small pizza, fried mushrooms and a meatball sub. The meatball sub was the best of the bunch but it wasn't that great. There were 3 meatballs in a roll and very little sauce so basically it was all bread. The mushrooms were horrible with too much breading and no flavor. And the pizza was just as bad. No flavor, hardly any sauce.  I used to love Luisa's. Something had to have changed with their staff or menu. This was not good at all.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "oMFNefruAhlxPpNjO5FCGg": {
    "date": "9/2/2018",
    "text": "Very good calzone maybe the best I have ever had!! Louanne had the small Luisa pizza and really enjoyed it. We also shared the cheese bread, again very good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "QbDp8qS8wnoOnp2pBnjuAQ"
  },
  "YDTDx3rDuuvPA9R1EdMYug": {
    "date": "2/22/2019",
    "text": "I've been going to Luisa's for pizza for about 15 years! It's definitely one of my favorite pizza joints in Charlotte. The owner is always warm and welcoming.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9anMq6Y2h917tf-PGRL9tA"
  },
  "T_FBrGK7X7FYu_hDWu3SyA": {
    "date": "11/8/2018",
    "text": "This is one place I wish was close to me. Then I would bigger than I I'm. If you're looking for a great pizza. Check this out you won't be disappointed. Also very nice buffet",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y63fUggbnO3gdWvY4fgkNg"
  },
  "_onlLv1kE3CNTRYn0YqAEA": {
    "date": "3/30/2016",
    "text": "I have mixed reviews about this place. It's more of a 3.5.  When we first walked in, we were waiting by the sign where it said to wait to be seated. Right across from us was the oven station where they had three people making pizzas. They didn't say anything to us but I did notice when some people walked behind us, they greeted them like crazy. They must of been regulars. We waited a few minutes before anyone even greeted us. Someone walked by briskly asking how many people were in our party and we told him 2. He said he would be right back. We waited a few more minutes and finally got seated. We got sat at a table and as soon as I sat down, my whole dress was wet from the seat being cleaned and not dry. Not a huge issue, but annoying.   We got greeted by our server. She was ok. We ordered a pizza that was similar to a supreme (pepperoni, peppers, onions, mushrooms, ham and beef). We waited about 30 minutes for our pizza which is normal for a oven pizza. When we got it, we couldn't tell where the beef was. But when she dropped the pizza off, she pretty much just walked away. We ate a few slices and asked her if there was any beef on the pizza. She looked at our pizza then asked us if we tasted any beef. What? That's why we are asking. We didn't see any nor did we taste any. She then said she asked them to put beef on the pizza. And then said sorry and walked off. What? That's kind of rude especially since we asked for it.   I will admit the pizza was good. But the whole service in general was just ok.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5vd-CaO4GtH42cMWI-h5EA",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5vd-CaO4GtH42cMWI-h5EA/o.jpg"
      },
      {
        "img_id": "7-RdjXUrKko66h_tCrnbOA",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. You can borrow reading glasses at the register to help see when paying for your bill",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7-RdjXUrKko66h_tCrnbOA/o.jpg"
      },
      {
        "img_id": "Ize-jvIll7BMRAHU3CkgBg",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Delicious slice close up",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ize-jvIll7BMRAHU3CkgBg/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "35udVifZ8hl3jRfkoNJcNg": {
    "date": "2/9/2019",
    "text": "So I just left Luisa's after a wonderful afternoon in NC's wine country. We felt the perfect way to end the evening was with some of our favorite pizza. Well so much for that. First, there was a bit of confusion with seating our party of 4, in that a party of 2 that came after us was seated before us at a table for 4. The owner/manager didn't bother to ask who was first, just seated them. The party of 2 seemed embarrassed and felt bad and actually came back and offered their table because they knew we had been waiting.  We got our apologies and were seated shortly afterwards, but honestly that set the tone for the rest of the evening. Our server was nice but that didn't overshadow the fact that we waited for an hour after ordering our pizza for it never to arrive. We watched the owner/manager walk the floor and talk with tables around us, but he never acknowledged us or checked on our empty table. After watching the restaurant clear out around us we decided we weren't waiting any longer so we walked out without having any dinner.  This is the first time we've had a bad experience at Luisa's, and this was very disappointing to say the least. Sorry to say we probably won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "noXCJLzJq7Zu_qwO65l1Qg"
  },
  "6KkwMsuc0PFMupHhCb6PcA": {
    "date": "10/24/2017",
    "text": "Five years later, still the best pizza in Charlotte!  Since the last time I reviewed, we have had Luisa's every single week.  And my last review was after we'd been doing that for five years prior.  Without exaggeration, we've had 500 pizzas from Luisa's in that ten-year span.  Looking forward to my next 500!  Bottom line: GREAT pizza, lovingly made by people who care.  The only place in Charlotte I'll spend my money at, period.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "VdXcOl4Asp_ApK4Koo8jdA"
  },
  "rKpNhds2-fr6yrB0Ui7_kw": {
    "date": "7/11/2018",
    "text": "This review is only for the lunch pizza buffet as that's the only experience I have ever had here. I have been going to Luisa's for years now for their lunch buffet. You get pizza, salad, and a drink for under 10 bucks! Now, I'm not a regular as I only get the chance to go once every few months but I always enjoy it when I do go and do look forward to the next time I'm able to. They have served over a million pizzas. The pizzas are made in a wood burning oven. The crust gets a nice crispy char this way. My all time fave combo is their pesto pizza plus pepperoni. The lunch buffet is full of different types of pizza their pesto one without red sauce, pepperoni, sausage and pepperoni are my slices of choice. One time, they asked us specifically if there was anything special they could make for us and that had me all like  . You always see the same faces when you go and they always remember your face. We will continue to be regulars for the lunch buffet!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dp1XMUV1Laq6-EBiSXj_1Q"
  },
  "s3UM7RHzrXw8ABBa4OZ67Q": {
    "date": "9/3/2018",
    "text": "Very good pizza and service. Created my own pizza sausage, provolone, olives and mushrooms. Great and the small sized pizza pie is enough for 2. The cannoli is yummy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vAlJOpjS-ecri71b9C2b8g"
  },
  "gp70b721pefb7SXMaIgD8g": {
    "date": "9/13/2015",
    "text": "Stopped by Luisa's for their lunch pizza deal and was pleased. While it's not great pizza, it is absolutely very good pizza. Brick oven baked, rather than the usual gas oven stuff, it is a bit more charred around the edges and this adds a different flavor - a good one - to the pie.  The buffet has a salad which is nice and tasty, but don't decieve yourself into thinking that's a healthier choice than the pizza. It's got a good amaount of dressing on it. And really, you're at a pizza place. Have the pizza!  And for the pizza choices, it was a nice variety though not spectacular. The focus here is on the tasty crust and not the creative toppings. What are you expecting for $9? Pepperoni and sausage and peppers and mushrooms and the like. The pesto-topped pizza was tasty.  A very nice lunch option at a great lunch price for very tasty brick-oven pizza. I can see why Luisa's is so popular!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 7,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "rO5NSLfPxpVf75-rCJ9X0w",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Luisa&amp;#39;s Brick Oven",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rO5NSLfPxpVf75-rCJ9X0w/o.jpg"
      },
      {
        "img_id": "FLzVLQQiMzCEqhPJ8Ojjzw",
        "caption": "Photo of Luisa's Brick Oven - Charlotte, NC, United States. Pizza from the lunch buffet at Luisa&amp;#39;s",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FLzVLQQiMzCEqhPJ8Ojjzw/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "EMulXjX-wlHcJSBFIn2rHQ": {
    "date": "8/21/2015",
    "text": "From Chicago but a fan of the thin crust, this is the best you will find in Charlotte. It is not NY style (greasy and bendable) but rather a crisp crust. I wish they opened at 4 so I could pick them up after work and beat the traffic, that is my only complaint.  If anyone has a better option for South Charlotte I would love to hear about it (crisp crust only please).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wE5IujqD-WnvFoLdFd-FuQ"
  },
  "3wY7PwdKiWvlLa-rzG7T9A": {
    "date": "12/9/2014",
    "text": "Went for dinner on a saturday night. Food came out very quick and hot. The thin crust is so good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4XKI7NFuJ59LyLdPURSWZw"
  },
  "3fswp1Q3JOiH9sKCW3-wTw": {
    "date": "1/16/2014",
    "text": "Luisa's claims that for years they tried to get the authentic taste of pizza they remembered from \"the old country\". Nothing they tried seemed to produce the flavorful pizzas they remembered in Italy. In an effort to reproduce the pizzas from their homeland, they went so far as to install a wood fired brick oven. Well, for them, this was the key to much success ! The pizzas here do have that extra something that puts them ahead of the competition. My wife's favorite food is pizza, and she has gone to some effort to hunt down by word of mouth the best here in Charlotte, and this tops the list. I can only take the word of the cooks, but the oven is the key. You can see right into the oven from the counter, and sure 'nuf, you can see the wood afire inside. We haven't tried the entire menu, but everything we've ordered here is excellent. Its just a little hard to find, but thats OK with me, otherwise it probably would be so crowded you couldn't get a table. I'd give it six stars if I could !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "eFKdJ1HME5U09QbtDuQh4g"
  },
  "63zeQ2b2uuIDxRv6yK-5Wg": {
    "date": "4/27/2015",
    "text": "Heard about this place from the bartender at Savor. We weren't really sure what we were getting into, but the Yelp reviews looked good, so we have it a try. Definitely worth giving a try. I chose a Hawaiian and my boyfriend got a pepperoni pizza. He even at the crust - which he never does. Seemed to be a good family place, and the service was really good. It'll be tough choosing between here at Pizza Peel in the future :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mwLfhHGfk7AIsuqOdtU8cA"
  },
  "9Ugsxuw-BN3I7I-BvhuR-g": {
    "date": "2/4/2014",
    "text": "Stopped by last week for lunch buffet and they were filming a MTV reality show, inside. How cool is that? Love the pizza, and Lori is the best waitress ever !! When go with friends we fight over the pizza slices that have bubbles and the crust is a little char'd, yum. Check out their pesto pizza slices too..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XdSr-FdPXoxDA9p6nc1Wgw"
  },
  "ciG1ji6s_YJp3EyXY8tTIg": {
    "date": "4/19/2016",
    "text": "A year and a half later and the service is still consistently horrible!  I am surprised that the owners are okay with this...  you have a great product, but we rarely come here anymore because every time we do we feel not welcome.  When your ambiance is poor, you hope it is because it is a great family restaurant that welcomes you with delicious food and a smile.  Their kitchen timing is also all off.. we still often get our appetizers after the pizza and sometimes our daughter gets her kids meal after we get our meal... which leads to a very upset 1 year old and parents that have to let their hot pizza get cold while they try to soothe her until her food comes.  This place welcomes you with good food (it has been extremely inconsistent the past year) and an eye roll.  Sometimes I fear calling because I know the person taking me order at the other end of the line is going to act like I am bothering them by putting in an order... such a shame!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cia9AQpGC7wLGHMQOv_qoA"
  },
  "hQKxFE6tPSwHiaqn886xjg": {
    "date": "4/22/2011",
    "text": "Always great and friendly.  Just celebrated their 20 th anniversary and 1,000,000 pie.  Well deserved success. Best pizza in Charlotte..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "WFo_XDND1CfTId9PO_ltkw"
  },
  "5QAbW7PGWOcd0KziY-EA3Q": {
    "date": "12/12/2009",
    "text": "Pretty good pizza, not the best I've ever had but if you like good basic sauce and brick fired pizza this is a nice place.  We frequent here because they have good sauce and the sauce does not have garlic in it so if you know someone with a garlic allergy you'd understand that to find good pizza where the sauce does not have garlic in it is unusual.  The decor is a little outdated so don't expect to be overwhelmed with a trendy look. I think by my count there are 2 TVs in the place, not real big TVs but they have them.   Good pizza place off the beaten path, it is on top of a small shopping center. There is no elevator (that I saw) so not sure if accessible.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7MI0oX7_fTwjU5NML80jsw"
  },
  "W1dvqZiILVx3tWrjTxFDUA": {
    "date": "7/10/2011",
    "text": "Our family gathers here about once a month...there are about 20 of us! As a matter of fact, you can see our faces posted on their wall. The Milano and Florentine pizza's can't be beat. Always friendly service and amazing food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "i_5M2_oIgtzLCIXmX7OjvQ"
  },
  "nieMawZeVRHLZLSyqoKECQ": {
    "date": "4/2/2011",
    "text": "Pretty good pizza! A little pricey but you get a decent amount for the money. Other people have mentioned Jet's and for whatever reason I prefer it's pizzas (the smaller square ones) to Luisa's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "g_gasrzH_1-On-MbIdeqpw"
  },
  "mlR5B17bEevXjcHVMgwYdg": {
    "date": "2/11/2013",
    "text": "I will first say we only ordered pizza and have never come in for a full dinner so perhaps this is unfair to review but this was my experience. Very friendly and cute little restaurant and the menu looked pretty good from what I saw online, but we only wanted a pie to go. I gotta say, we were disappointed. I was skeptical about brick oven because generally speaking the best pizza does not come out of a brick oven. We have tried most of the local pizza joints and have not had good luck of late and we try our best to stay away from the national chains. I wanted to like the pizza, but it just wasn't very good. The crust was so thin it was soggy everywhere but the edges. The edge crust was tasty and that was the highlight, which ironically is usually the least enjoyable part of a pizza. Since the crust was so thin and soggy in the middle, it did not fill us up and it could not support much sauce or toppings either. Pizza is supposed to have a thin crust, but that doesn't mean it should be so thin that its soggy and without structure enough to hold a tasty sauce, cheese and toppings. I've lived in different parts of Charlotte and for some reason all the good places are up on the northern side of town. I guess we'll have to start driving a little further for it. I give up on any place south of Harris Blvd.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5e0G9Mj1h3MvbS3ymvmtpA"
  },
  "7MGZzro19JOBPmxhkZvf0A": {
    "date": "3/7/2010",
    "text": "If you are from New York or New Jersey and are really missing the taste of great thin crust pizza, you must order pizza from Luisa's Brick Oven.  This is the first great pizza I have had in Charlotte.  The crust is thin - the kind of crust you can fold in half to eat.  We ordered one large pizza - half cheese, half pepperoni and mushroom.  Very, very good.  We also ordered a medium Fiorentina pizza - no red suace, simply cheese, garlic, and spinach.  Wow was that pizza amazing!  My kids devoured it.  My husband voted for the traditional style red sauce and cheese as his personal favorite but I really think you can't go wrong with any of the pizzas on the list!  We can't wait to order from there again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "_oVFknPUotEq0LM4TJ74vw"
  },
  "V5fLtxOnE79aKbtDDnQqhw": {
    "date": "12/7/2011",
    "text": "I just realized I have never reviewed this restaurant but have been coming here since we moved to Charlotte a little over two years ago.  LOVE this place! They make their own dough and sauce daily and pizzas are baked in a REAL wood-fired oven.  This is thin crust pizza at it's finest!  The antipasto is fresh, cold, and huge..will easily feed four.  The Wine list is small but good selection and very reasonably priced.  Service is friendly and efficient.  Most nights you will find Jeff, the affable owner seating tables.  (The story goes Luisa brought the oven from Italy, opened the  restaurant and  then Jeff bought it)  Tuesdays is KIDS NIGHT, so be warned.  Although, I must admit that even though I don't like kids much, I have braved the masses to feed my Luisa's craving on several Tuesdays...it's that good!  Oh, and save room for desert, both the Tiramisu and the Cannoli are house-made, fresh, and outstanding!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "LnMcdddQD21EOQb3VF-Zfw"
  },
  "ST5m9FjhZhPYXM-_Nix52Q": {
    "date": "1/31/2009",
    "text": "Best (Italian Style) Pizza in Charlotte.  For a thin crusted Italian style pizza, this by far the best place, tucked away in a little shopping center off of Montford.  It's family friendly, and the quality is consistently good.   The Luisa (no meat) is my family's favorite, follow by the Milano when I am in the mode for  a bit of meat.  The spinach and meat lasagna  is great as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "9vsQ8EZCrYEZmNk5duFUqw"
  },
  "qotrC4-UJoEwIbFe68e--A": {
    "date": "11/29/2011",
    "text": "Excellent thin crust, oven baked pizza.  Jeff and his staff do a great job. Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "iz4E9VtZ5Wnpt8VD3c1E8A"
  },
  "4QFKn4maLwLDKC0UFE1SCg": {
    "date": "3/4/2009",
    "text": "They have an awesome lunch buffet for $7.50 and that includes a soft drink, it just might be the best lunch special in town for the price and amount of food you get. I don't know if I would order a pizza for takeout, but I will keep going back for the lunch buffet. It's not the best pizza in the world, but it's good. The overall atmosphere and decor needs to be updated.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "z5c2xCKHFj78I27dz0r9aQ"
  },
  "74j4_USIBtCA0iFKs5-yEg": {
    "date": "11/6/2006",
    "text": "Luisa's has amazing pizza.  This place might get overlooked because it is in the back part of a little shopping area on Montford, but if you have been overlooking it you have been missing out.  The pizza here is traditional Italian style (as close as you'll get in Charlotte) and the owner is a wonderful Italian woman named Luisa.  When I was a kid my favorite thing in the world to eat was garlic bread with cheese and marinara sauce on the side- it's simple but delicious (they have great sauce) and it's the size of a small pizza, so it's plenty of food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TQXtrSpsUyvHMriX8hvNWQ"
  },
  "rlU1E_xAkr8Mt_wHT1VtdQ": {
    "date": "9/24/2007",
    "text": "Luisa's just doesn't seem that good to me, even though it repeatedly came in high on \"top pizza in Charlotte\" surveys over the past years.  Their selection of toppings is, in my opinion, limited: maybe toppings like green olives are unusual, but jalapeos are not, and Luisa's has neither.  To me the pizza tastes pretty run of the mill.  I wasn't even struck that the toppings are particularly fresh, and the thin crust was actually quite soggy for me the last time I ate there.  To top it off they seem to close kind of early, especially for a pizza place.  I could maybe see giving the pizza three stars as it's completely \"average\" (at best), but after the missing toppings, the crappy hours are enough to put Luisa's in two star territory.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eGXGTiTWAsSGy-fzsRCBZQ"
  },
  "0xRjwRuYbaA4Mc8pCQbAVg": {
    "date": "7/25/2010",
    "text": "I can't believe Louisa's was not already on here! This place is amazing! one of the last places to use a real brick oven to cook their pizza. I tried the Louisa the first time I went there and I haven't been able to convice myself to try anything else because it is probably the best pizza I have ever had. I eat here once a month or so, and I have never been disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "WzyHgMuv7sJXWB29de3bvQ"
  }
}