{
  "9BzUgZg2dC_SBG5Rx5xTWA": {
    "date": "10/13/2013",
    "text": "Wow... WHAT a disappointment.   My girlfriend purchased the Living Social deal and like the person who posted a couple days ago,  we had extremely poor service (he seemed immediately annoyed that we were using a coupon)  and we too received less than what was advertised.  We almost got up and left when we waited 12 minutes to have our drink order taken.   There were only two other tables busy on the  Friday night night we went.  That should have told us something right there... that and the fact it turns into a Latino disco at 9pm....complete with laser and smoke show.    This was the first Ethiopian restaurant I've been to in Charlotte,  and I wasn't impressed. She said the other one near Uptown was far better and felt like we got ripped off.   In a way, she did as we should have received a separate vegetable plate like they have in their menu.   Instead we received the avocado salad appetizer and the beef tibs plate.     We made the best of it but I know we certainly won't recommend others go there.   Better food out there with less attitude and better service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "d7ItMHyS7QzUPWElkFj8Yw"
  },
  "-QAD9bEFBDC4EtyLJXJuiw": {
    "date": "2/24/2016",
    "text": "As some others have said, the area is pretty sketchy. I was the only one in the restaurant and didn't feel safe. Feel bad for the lady who worked there as she was courteous and asked me how my food was. I ordered the veggie platter and the chicken. I didn't like either. The potato dish was good. I ate that and left.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Ytx178ezwLYG387x7bzuA"
  },
  "5q4D2hiiXk9nxZQbei9SdA": {
    "date": "6/23/2014",
    "text": "Queen sheeba was very good. My first adventure into ethiopian food. The avocado salad was very delicious.  We also has a chicken and beer dish. Beef dish was tasty but chewy. They only have one server so plan on a wait. We got there at 4:30 so we were taken care of.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "il05xKedLYCmhyIRgfDCqQ"
  },
  "2axSCwh1Bf_NHwCjQrFp7g": {
    "date": "6/4/2014",
    "text": "Very good food and a different experience. Came her for anniversary and left fat and happy!  I recommend it!  I don't care if this review is shorter than most. I have said all I have to say and am wondering why yelp forces me to add more than I have to say. Ridiculous. That is all. Good food and atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qOnMBYitAFJjm5K6ZEumng"
  },
  "RJ4YVb31SUCYjN1TgV2YkA": {
    "date": "9/6/2013",
    "text": "GO! We checked this place out after hearing about it recently. I read the reviews and I agree; WAY better than Meskerem. Service and food are simply exquisite! Go and then go back again and again with all your friends! East Charlotte businesses need our support!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8A3PEWoGTFwFbarPyF3a-Q"
  },
  "hUG4mZ4c6Eoc_0-vK77O7g": {
    "date": "10/13/2013",
    "text": "Sections of Central Avenue in East Charlotte are fertile grounds for an incredibly rich selection of ethnic restaurants. This area has been changing for years and its development is, for me, one of the things that make Charlotte a more interesting place to be. Queen Sheba is one of these eateries, recommended by a friend. My daughter and \"go to\" restaurant companion drove out of our way to try what we knew was going to be something different. I used to do business in the Middle East and Northern Africa so past experience with this region's cuisine gave me some idea of what to expect - some kind of flat bread, no utensils, lots of fragrant spice though not too much heat - but I had never eaten Ethiopian food so we were excited.   We got there way early around 5:30 and the place was empty except for a few obvious regulars collecting empty Corona bottles at the bar. I know in Egypt dinner doesn't even begin until well after 10:00 pm so I expect the place livens up later. The decor is pretty plain and simple, with a large screen TV playing whatever soccer game is on, plastic covers on the tables and low lighting. Our server however could not have been more gracious and welcoming and allowed us to pick a booth that suited us.  Injera, as far as I can tell, is some sort of sour dough pancake, very spongy and in this case it was served cold with all of our dishes. As I said, there are no utensils so this flat bread is an important aid to scooping up the various stewed pureed and chopped dishes put before you. The taste of the Injera is slightly sour and provides a terrific counterpoint to the spicy dishes with which it is served. We started with an avocado salad which turned out to be a delicious chunky guacamole in an Injera burrito. The ingredients were fresh and the serving large. Two of us shared it as a really good appetizer. The beef combination was served on a large circle of Injera on an aluminum platter about 2 feet across and consisted of raw chopped beef, sauteed  beef tips, collard greens, green beans, a pumpkin puree, mashed yams and feta cheese crumbles. It was plenty for two but my companion wanted to try the lamb so she ordered Ye-Beg Tibs which were small bits of lamb sauteed with onions and mild peppers along with a small green salad and served on a large round of Injera.   Everything we were served was very good. This was especially True of the avocado salad and the vegetables. Flavors of the main ingredient were allowed to take a front seat and while I am sure that it was pumpkin or winter squash that I was eating and some sort of yam, the flavors were completely new to me. The collard greens served as a clear reminder of the African roots of some Southern US staples.  We would definitely go back. The combination platters are quite enough for two, especially if you split an appetizer and want to leave room for dessert which we did not try. Prices are very reasonable and the family setting is very welcoming.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0PRsfFlT8LY5_ZzyU824Bg"
  },
  "eCe9Q6JlDdxHMppzkP2YNQ": {
    "date": "10/12/2013",
    "text": "Found this place via amazon local. $27 coupon for $53.00 value. Ambiance was great, large tv for TV viewing, hookah next door, and a full bar. The menu was reasonably priced. We literally had to find something else to use the total value of the coupon. There was only one wait staff, so service was slow. I ordered a vegetarian entree and it was great. I will return min the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "32eNXk-AuVA6CQRh99EiWQ"
  },
  "zO280_G5b9w1m2xuAXOGmA": {
    "date": "3/8/2014",
    "text": "Queen Shaba was my first experience eating Ethopian Food. Had the Doro Tibs and they absolutely destroyed me... In the greatest way imagine able. Grilled chicken doused in spicy Awaze sauce. Dry bread was on point.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iBnLJfKnnWeLKmXvBO6eKw"
  },
  "XNN-RM192WHl5y7wZyoU2w": {
    "date": "11/20/2013",
    "text": "Walked into this place and had immediate attention. Me and a friend requested to sit in the small nook that obviously was for friends and fellow Ethiopians. They had no problem with it. Very cool cow hide seating. We had the queen Sheba combo. The lamb was delicious as well as everything else. After dinner we sat in the side room which was a hookah lounge. Great way to finish the night. Pleasant service and people. This is going to be a new to go spot immediately. Thank you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vXCdNogZn7LD-D6KtgGKsQ"
  },
  "ixQZa52EUhTzp938OyXJXg": {
    "date": "10/19/2013",
    "text": "Like a few other posters, I bought the living social deal for two meals. I instantly regretted doing it when I read the reviews of the service, but our experience was nothing like what I expected! Eden (our waitress) was especially nice and very helpful. She even brought us extra food to sample at no charge. The food and service were at the four star level, but the atmosphere and decor were....bad. No matter! The overall experience made up for it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "edEDrvHvDqYADTwi984sTQ"
  },
  "xMM6KCmMAx74hroFbbC2Xw": {
    "date": "12/5/2012",
    "text": "I gave it 4 stars mainly because of the authenticity and coolness of the establishment. The food is made to order and spicy liked I asked! First time trying Ethiopian food and I liked it. Will be back again!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "29jOWzbez_GrZJyyQE4Lsw"
  },
  "O3353ry-EPOwhaAoZuLdUg": {
    "date": "8/15/2015",
    "text": "The food was OK but the place looked deserted. I have used a living social coupon, In fact was a very good deal. I have tasted better Ethiopian restaurants than Queen Sheba in Charlotte. We went there on a Friday evening and was surprised to see only 1 table occupied. The complex looked shabby and was really not feeling safe.The food was very mild and lacked spices. The waitress looked as if she hasn't taken shower for a very long time. I would seriously not recommend anyone going to this place. I have asked for a dessert and it was not available. 2 stars for food. -1 stars for the complex.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BzKouiWjC1kbXfrDtScHrA"
  },
  "6nEDw5c7ShhNal9JHL_HOg": {
    "date": "5/26/2015",
    "text": "Love, love, love this place. The food was delicious and the service was impeccable. I have no complaints about this restaurant. There is nothing chic about the restaurant or area of town. Restaurants that have quality food and service don't need all of that. The restaurant is clean and has clean bathrooms, that's something I find important. I ordered their Honey Wine, Jebena Coffee, Apple Martini, Avocado Salad, and number 27 on the menu. The honey wine was sweet but not too sweet, perfection. The Jebena coffee was hot and delightful. I can honestly say that I've never had a cup of coffee that was so good. The avocado salad was a perfect mix, not too heavy. It was just as an appetizer should be, satisfying without regret. You will still be able to eat your main dish. The main dish was delicious. The chicken was moist and seasoned well. You get to pick out your spice level. The injera was wonderful. Our waitress always made sure we had enough, we never once had to ask for more. The apple martini was strong, I was pleasantly surprised. I despise weak cocktails and so many places skimp on the alcohol, but not this place. As I said before, the service was impeccable, the food was delicious and the prices were more than reasonable. This place is a hidden gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nwb6gPI79b_a8FYr4JbOjQ"
  },
  "SslB_aS910QyJJf7C4jO_w": {
    "date": "2/4/2012",
    "text": "We tend to go to either Meskerem or Red Sea about once a month, so when we heard that there was a new ethiopian place in town we were excited to go try it out. The restaurant is physically quite large and not particularly attractive, but I've always been more concerned with the food than the decor. Luckily, the food holds is quite good and the service is very good as well.   The menu has 19 items including appetizers, with the bulk of them being beef and lamb dishes. There are still plenty of vegetarian dishes and one chicken option. The food is comparable to both Meskerem and Red Sea in terms of flavors, so if you are a fan of those places you won't be disappointed here, although I'm also not sure yet whether this is better either. Really all three serve very good food easily comparable to what I've had in NYC and DC.   Where the menu stands out is that it includes several dishes that are most definitely geared towards Ethiopian and Eritrean customers. To wit, there are a couple of beef dishes with a 'tartare' option and I had something called Ye-Beg Dilot, which is a delicious mixture of onion, garlic, peppers, beef and lamb organ meats. It was all very well seasoned and cooked. I mention this because unadventurous eaters might be turned off by the idea of some of the dishes (but hey, at that point you should have just gone to the Applebee's or wherever it is people without a taste for good things go). The tej (honey wine) is really nicely balanced and isn't too sweet, and well worth trying. And actually, this is one item that is definitely better here than at the other two restaurants I mentioned above.  One odd thing is that the food came out on a separate large plate for each customer. I have only ever had Ethiopian food served on a single communal plate, but they don't seem to be doing that here. A minor disappointment is that there is no meat combination plate, which sort of locks you into one dish. There is a veggie combo, however.  In summary: new Ethiopian restaurant (potentially with some Eritrean dishes as well); very good food; unusual menu items; well worth a trying. I'm certainly planning on going back in the near future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 11,
      "cool": 0
    },
    "photos": [],
    "user_id": "C0ALFu8Mrvoqtfz0VnG_cw"
  },
  "NemZjan-OahDs6wzGUpNow": {
    "date": "6/5/2016",
    "text": "Ethiopian food is one of my favorite  cuisines. I have been fortunate  to have experienced Ethiopian  restaurants  that constantly  have me desiring more of their food until recently.  Being fairly new to Charlotte  I decided to appease my craving and try out this restaurant.  To my surprise  I paid $30 for an order of sambusas (two small lentil pastries )and a veggie combo entree. To add to the surprise was the upset that arose when I tasted the food and discovered  not only did i over pay, but did so for the worse Ethiopian food I have experienced. The food (all except the sambusas) was without flavor . I kept hoping that something  inside my injera  would redeem this restaurant  but instead after one taste of each food item I was diguisted  to the point of trashing the meal. Yes $30 worth of food disgarded...i do not believe in wasting money so this should prove how bad the food was. Times past I would have tried to make an unfavorable  meal work by adding to it at home, but this was beyond  repair. I will never purchase from this restaurant  again. I will attempt  to try out the other Ethiopian  restaurants  in the area with better luck  or enjoy Ethiopian  food when visiting  those restaurants  I enjoy outside of Charlotte",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U4FY0oQKBOZJHZPVSW2YKg"
  },
  "0-6d2W9yVDiHdvlKEJDRSw": {
    "date": "1/16/2015",
    "text": "I highly recommend Queen Sheba. The service was great, not at a hurried pace, but not waiting between appetizer to main course too long. The food was described accurately on the menu as well as in detail by the server who I believe is the owner who was a most gracious host who asked if we had any questions and gave us not only information on the various dishes but on the customs of Ethopia as well. The food was delicious and the coffee at the end of the meal was fabulous. We plan on going back soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XmXTDqRhULLrBZ7ODd7wzg"
  },
  "DUOh2ZjxBhLxPUknAkdB9Q": {
    "date": "11/1/2014",
    "text": "I decided to try Ethiopian food for the first time and was very impressed.  I had a girlfriend who showed me around the menu and ordered the avocado salad and one of the platters.  I was very impressed.  I LOVED the avocado salad and the platter was great to try.  I have since tried other Ethiopian places and prefer Queen Sheeba. This place is definately worth a visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBgHgNdmouKAJ0pDpTwT_A"
  },
  "a9k6wNUzAAM7YtpK087giw": {
    "date": "1/9/2013",
    "text": "Really good Ethipian Food.  The avacado salad is a must try!  I have been twice in the last couple weeks, and I will continue to go back.  It's in a sketchier part of town, but don't let that keep you from trying this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "g26UjGGwtlHPkuTzOBUH8A"
  },
  "Egwr4izevX9JWrH0rzmyew": {
    "date": "2/20/2014",
    "text": "If you haven't tried Ethiopian... do it!  I have been to the other couple of Ethiopian places in town, but this one is my favorite.  I have been here twice, once with a Groupon and then out with a group of 6.  If you go here, do not expect anything fancy, but do expect what I would consider authentic Ethiopian.  The first time I had one of the lamb tibs dishes and it was great.  The sambosa is good along with the avocado salad wrapped in injera.  My favorite thing I have had there was the raw short rib, or I believe it was supposed to be short rib.  One of the less adventuresome with food thought he ordered a cooked dish, but it came out raw so I traded with him.  I would recommend trying one of the raw dishes if you are up for it.  Very tender without any fat or gristle.  While I am sure you can get in and out in under an hour, I would plan to be there longer.  Both times we went (one time we were trying to make a show, which we did, but we had to press them to get the check), we had a main lady who was awesome and obviously running the place and she had an assistant who seemed lost or at least awaiting orders on what to do next. It took a while to get things ordered and to finally get our check, but then the main lady boxed up my friend's food and gave her a little more when we went on a Wednesday night (I mention it was Wednesday because we were the last ones there around 8:30).  We were inquiring about the coffee ceremony and she ended up giving the 6 of us the coffee ceremony for free.  And that stuff was fantastic.... just plan to be there a while because they roast the beans in front of you, while burning incense, then she brews the coffee and provides 3 cups per person.  After all that was done, she then brings us honey wine.  We have no charges for the honey wine or the coffee, although I would have expected to pay for the coffee since we asked for it.  The reason I didn't give 5 stars was because it definitely is in a less desirable neighborhood and the service was different than expected (not unwelcomed, just different when you are thinking of going to dinner for an hour with friends on a week night).  But please do not let this deter you from checking this place out with an open mind.  I highly recommend this place for something a little different, but also very friendly and welcoming.  The main lady really makes you feel like you are in her home and she wants to show you a good time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lw7C-T7wkg6Q9P0tjLf_dQ"
  },
  "cbUVQAQGuHZ1LjaRLPPAKQ": {
    "date": "2/26/2018",
    "text": "I've been eating Ethiopian food since 1988 when I met the people I am still close friends with today! I've had it home made (which is the best, of course) and in the restaurants. I am new to Charlotte from Philly and was hoping to find some good Ethiopian/Eritrean food here. I looked at a few places online and decided to try this place first. The place was nice, service was nice as well. The man who waited on us was very attentive. He was pleased to know how fluent I was when it came to their food.  My fiance and I had the salad with the bits of injera, tomato, green onions and the berbere seasoning, I can't think of the name, but it began with a \"T\"........it was ok, but the portion was big, which was cool! I had the beef tibs, spicy, cabbage and salad. It wasn't bad, but the beef needed a little more season and spice to it, because again, I know how this food taste, but everyone makes it different. The cabbage and salad was really good, but that beef dish is what's important for this review, which is why I gave it 3 stars. My fiance had the key wat-lamb, cabbage and salad and he noticed the difference from when he had it home made back in Philly at my close friend house. I may give Queen Sheba another chance in the future, but I will try the other 5 places I looked up before I make a final choice and stick with the best one from my opinion.....the one that tastes close to home made. :-)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U0UCgkHVnWnrzGArVuC3sg"
  },
  "e9VDUXL_loEWKMKFQyD2Kw": {
    "date": "5/7/2014",
    "text": "Bad location! One star because the music was too loud and our food was REHEATED.We ordered a five food platter. it was good at first until we at a piece of a chicken leg. The inside of it was cold. We asked for rice and we got Reheated rice because the bowl was very hot and the rice was warm. The chicken was reheated because when we picked it up from its black sauce, the inside of the leg was purely cold. If I wanted reheated food, I would go home and look in the fridge. Our waters never refilled our waters as well as they sat back and enjoyed the music. We Will never go back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7h4_BoZOk9zq6Xf3sX4Jqg"
  },
  "JniUN7lTQJP4Keq6XcM6Rg": {
    "date": "3/27/2015",
    "text": "I really enjoyed our dinner here! The place is simple and easygoing, the server was attentive to refill our glasses and bring us what we needed, the food is amazing. Can't ask for more, I will be there again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YyiuWQ4sxzL_rJivcivfcg",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Meat plate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YyiuWQ4sxzL_rJivcivfcg/o.jpg"
      },
      {
        "img_id": "J4wrk_EBwQfFZ7IiYT0_3g",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J4wrk_EBwQfFZ7IiYT0_3g/o.jpg"
      }
    ],
    "user_id": "o30L9H92WX5eQRR5-S8Btw"
  },
  "1boS3I4Zci0Z05rDMZh4Xw": {
    "date": "8/22/2014",
    "text": "Solid place for quality Ethiopian food. Despite a relatively bleak and charmless exterior [not to mention parking lot], Sheba succeeds -- for the most part -- at making up for disappointing initial impressions. However, there's not exactly any reason compelling enough to have me over again.  An aside... stay for their coffee! Full-bodied perfection.  Rating specifics (i.e. 1-5, low-high)... - Overall recommendation = 3 - Food taste and quality = 4 - Portion size = 3.5 - Price = 4 - Atmosphere = 1.75 - General service = 3.25 - Waitstaff = 3.75 - Location = 1.5",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m_7a65WtA8oWjerFBEbtJQ"
  },
  "Vxi1Zj9_nP8nOzASrobjRQ": {
    "date": "12/30/2013",
    "text": "This was our 1st time experiencing Ethiopian food and it was an interesting experience.    The Good: The food seemed really fresh and the hookah was excellent.  The service was also  pretty good.  The Bad: This place is located in a not-so great part of Central Ave.  The parking lot is terrible and the decor is probably below average.  Summary: If you're looking for a beautiful dining experience, this is probably not the place for you.  But if you're looking for some authentic food and and great hookah (and don't mind being in a tough part of town) this place is a blast.  We'd go back!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vcx_qpTiSNfyxR20Xuh8Rg"
  },
  "DMLZMVw5edHZHYbJtuYOEw": {
    "date": "1/3/2014",
    "text": "Definitely worth a try! I was a little askance at the location, but when we sat down we enjoyed the chill atmosphere and privacy.  We went for my roommate's birthday, and upon learning it was her birthday the owner's (who are also the major servers/hosts) treated she and to beers on the house.  The food was fantastic and a great experience as it was my first time trying Ethiopian.  The Doro Wat comes very spicy, warning to the weak of tongue.  The chicken special combo was a great buy and could have fed three people.    If you go for hookah, that can smoked in the bar which is separated to the side of the restaurant.  If you are looking for a party spot, this isn't for you. They were not very populated, but my group preferred that aspect.  The only reasons that I have for taking away stars are: * the sketchy location (though it's not unsafe, just in a weird spot) * the hours for the restaurant are 11 am-10pm, and not 11-2 am as listed on the site * the owners are obviously not native English speakers, and were slightly awkward at            first * The food does take a while to get to the table  Otherwise, the Groupons are great buys and you get your money's worth even without one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O7nFCX71_sGyyAJ6tfeJJQ"
  },
  "6jwMtUOoIzTWZGK-XrZH0w": {
    "date": "12/29/2013",
    "text": "It's alright, nothing special.  Total hole in the wall in a sketchy part of Central... obviously there won't be ambience.  Food was fine -- injera was spongey and not too sour; wots were flavorful; coffee was nice and strong.  Service was what you would expect at an ethnic hole in the wall.    We opted to get a hookah after dinner... this entailed walking through a sliding glass door to an attached \"bar.\"  It was really tacky and hilarious and once it got late enough, people were actually coming to hang out there.  Unfortunately, one of the bar patrons kept taking phone pictures/videos of me/in my direction... so I left.  Oh yah, don't get the homemade honey wine.  Unless you're a bear and like things to taste like straight honey.  Then, get the honey wine.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vj8AEdwA1GP92BYgGI54-g"
  },
  "RpYAAZ3Fvj4y7IRcW0A4NQ": {
    "date": "2/8/2013",
    "text": "The food here is some of the best Ethiopian I have tried - compared to other Ethiopian in Charlotte that I know, I much prefer it to Meskerem. I highly recommend the Queen Sheba combo, it easily feeds two people and has lamb, chicken and about three lentil and two veg dishes.   I cannot really recommend the Tej (honey wine). It had a very strong fermenty flavor, and our friends who had had it before elsewhere said it usually tasted better. But I enjoyed trying it just for the experience.  Now as for the service: That was rather an awkward experience. The waitress kept trying to dissuade us from the combo we were trying to order, and in the end said that we should order that combo, a different combo AND another individual dish, so that we could try the most popular dishes. Combos, she said would feed one to two people depending on their appetite. Once again, there were two of us eating one combo and we had another large portion left to take home. The waitress kept being a little pushy about ordering other things throughout the meal and even after we had paid. But apart from that, she was very nice. Update: Service during a subsequent visit was very nice more... quietly helpful!   I highly recommend ordering coffee - it is 5 dollars a person, but one of the owners roasted previously unroasted coffee beans (which I hadn't actually seen before) for us right there in the restaurant, ground them, and brewed coffee over a little camp stove in traditional Ethiopian/Eritrean clay pots while we sat on little stools watching and chatting with the owner about how she came to the US and how her family adapted to the life there. What a fun experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "up-mcezRNykPU1RvfNFt0w"
  },
  "qq2y00xHb5ITNS4NYyya2w": {
    "date": "8/9/2014",
    "text": "I decided to check out this restaurant after purchasing a $40 groupon deal for $20. As  others said, its located in a sketchy part of town, I don't advise going after dark. The place was empty on Saturday night.   The food was just ok, kind of bland, nothing really stood out to me. The server wasnt particularly helpful and couldn't recommend a good dish, so I had to guess and pick out something else.   Overall, service not bad, but not great either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fpS84y0mYBGDDIO3BeegHw"
  },
  "aJlDsGYgEm_OTWqaRs3NbA": {
    "date": "7/29/2013",
    "text": "Positives:   1. The food was amazing.  I tried the Queen Sheba Combo and shared it with my husband and it was enough for the two of us and a very good variety of meat and vegetables.  Everything was very well spiced and tasty.   2. Owner is super nice and explained how to eat Ethiopian food sans utensils (this was my first time).  Negatives:   1. The decor isn't the greatest.  It has potential, but they really need new tables and chairs.  The coverings on the chairs are a bit gaudy. Also, there could have been some music playing or something - that would have added a nice feel. 2. We were the only two people there the entire time we had dinner (we were there from 7:15 - 8:30pm on a Saturday).  If you don't mind being alone in a restaurant then it's not an issue, but if you like to have others around for ambiance, this probably isn't the place for you.  Bottom Line:  You may need to overlook the atmosphere, but the food is delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-twdrk90QiwCAkrOyVQEzg"
  },
  "0VsHtx1asFJ5R159ZMU02w": {
    "date": "9/5/2013",
    "text": "I love Ethiopian & Eritrean food and Queen Sheba did not disappoint. We started with the Avocado salad which was very tasty.The espresso was delicious! I had the veggie plate and it was very tasty. The atmosphere is very nice and there is a separate hookah room. I will definitely be back.  So much better than those other places in Charlotte on kings and Charlottetowne avenue....you know who you are...step up your game because there is a real Ethiopian joint in town now :-)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XeDzARZdui_nHju4HM80Hg",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Veggie plate and chicken dish. Excellent #ethiopian food at Queen Sheba #charlotte #charlottenc",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XeDzARZdui_nHju4HM80Hg/o.jpg"
      }
    ],
    "user_id": "wJfz5PELonxD1J5QbywLDQ"
  },
  "0jq4hA3lZqDbeMiFcbCU8A": {
    "date": "8/15/2016",
    "text": "I went to Queen Sheba for the first time over the weekend and had no idea what to expect. But it was a good first experience. Finding the spot was a little difficult as it's kind of located in a small shopping center and the front door doesn't look like it's to the restaurant as there aren't too many signs for the place. Inside the restaurant there are plenty of traditional artwork and decor that fill the place up. The staff were very sweet and inviting. We ordered the Queen Sheba chicken combination and between the two of us that was more than enough food. Everything was flavorful and delicious. We also ordered a cup of coffee and it was very strong but great. It was served in a tiny espresso cup and came with some sugar. It definitely gave me a jolt of energy after all the food I had eaten! Overall it was a great dinner. I'll have to try out some of the other items off the menu next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3WH5iLSwxY45710l0nh8w"
  },
  "7EqeZJYSjCqjLD4p9PsoxQ": {
    "date": "9/20/2015",
    "text": "I have enjoyed the food here three times now. Delicious every time. Today, the service was extra good. The man serving us even shook my hand after the meal. He was very friendly and made sure we had everything we needed including being very helpful with the ordering. We'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "spbglothL7BHJfm8rQIZgA"
  },
  "cKnL7kszvrEj7a3SG6Fcqw": {
    "date": "1/3/2014",
    "text": "Like a few others, my boyfriend and I used our living social deal which he paid $27 for $53 worth of food. The waitress was exremely impatient  !! Is it too much to ask for a few minutes to look over the menu?? When we were finally ready to order, she never came back to  take it!! She actually rolled her eyes at us. After a very long wait, My boyfriend had to get up from our booth and find her so he could place the order. Next, the manager on duty told us living social made a mistake in the advertisement and that we could order only 1 meal combo and 1 appetizer to share. Are you kidding me? That's what the $27 covered!! After much persistance, the owner ended up honoring the living social deal.  The food was cold and the honey wine wasn't acceptable.  Also, for what ever reason my very generous guy left a tip in which I noticed the manager on duty quickly shoved in his pocket.   The manager ended up shaking my BF hand and turned out to be pretty cool. However, I don't know if I'll give this place another try.  My reason for possibly not  returning wasn't because the food wasn't the greatest (most restaurants have an off day and deserve a second chance), but because we felt we had to negotiate why he should honor the living social.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ACF4h-sxBg2eoqMdL6bvYg"
  },
  "YdTOtjHtRaPMp7aM7VbAUw": {
    "date": "4/15/2014",
    "text": "Food was horrible, service was horrifying and they act ask If they never heard of groupon. It took forever Tip get water. The waitress was too busy seeing her boyfriend behind us to pay us any attention. The Food took forever and it was sooo nasty. The manager was rude, questioned us about the hookah in which I paid for. The hookah was in a hispanic club connected next door and it was dirty and didn't pull will at all for hookah. I often do hookah and this by far was the worst. Do not come to the place if you're looking for something new to try,  professional, clean. It's located in a awful location",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4AZNsaUfgBc6rdcoO-zxgQ"
  },
  "ytOaDVdIhDPzMiBcxGN86A": {
    "date": "3/29/2014",
    "text": "I  tired Queen Sheba Restaurant and where can i began with  my unpleasant experience. The  waiter or owner was extremely rude. i advise by a friend that his place was bad new but the review seem to show that it may be a hidden gem. boy was i wrong.  i have never experience poor service this bad ever. i want the waiter to explain what where some of the dishes and what do he recommend and he talk to me as if i was a 2nd class citizen. i had to get up and get my own water . and when it was time to pay he just add everyone bill up and divided by 3 . no receipt no explanation. the food was ok but the service cause me to never return and we i didn't have a groupon like the other unhappy customer. beware. bad parking, risky side of town if you are alone.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aAARZ8x14HbZ_t44SDvBbg"
  },
  "-BBwl5wkO0k8Ud7uCZjhlQ": {
    "date": "3/30/2014",
    "text": "Customer Service was the WORST!!! . As it was our first time eating Ethiopian food ,  we tried to ask questions about different dishes and etc. our waiter was rude and completely   uninterested in giving suggestions and actually seemed irritated when we asked questions. The waiter/owner had the nerve to answer his cellphone while he was in the middle of taking our order. SERIOUSLY!  The food was OK  and I would have came back to try  more  dishes but  not after that experience. If you want to stay in business you need to  act like you actually WANT your customers .  When it comes time to pay they don't give you an itemized receipt rather they tell you how much you owe. It seems to get an actual receipt is impossible. Needless to say never again.- Next time  I will try Meskerem.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lgwZbztTZlKbuiD88cSPcA"
  },
  "N4rR7ostdHW6L8SKC2aUQg": {
    "date": "7/14/2014",
    "text": "We drove to Charlotte on a whim yesterday and decided to try Queen Sheba for dinner. So glad we did! We arrived during the last 20 minutes of the Germany/Argentina World Cup finals. There was definitely some spirited enthusiasm and competition among the other patrons, which really made it fun (although the owner apologized for how loud it was...we didn't mind!).The atmosphere is somewhat dark and filled with incense, which was fine by me. I'd rather be somewhere with it's own character than in a restaurant box that looks like every other restaurant box. The food was excellent. Now my favorite Ethiopian in Charlotte. We split the Chicken Combo, which was plenty for two, and ate every bit of it. The waitress even joked \"were you starving, or was it that good?\". It was that good! The honey wine is worth a try...although it tastes like neither honey nor wine, rather an almost malty beer-like flavor.  Service was friendly, albeit somewhat slow...but we wer not expecting fast food, so we just sat back and enjoyed ourselves.If you've never tried Ethiopian food before, here are some things to keep in mind: 1. If you don't like your food spicy, be sure to mention this to the server 2. You are going to be eating with your hands. No utensils provided. Just grab a hunk of injera (bread) and use it to scoop up your food. 3. This style of eating is great for sharing with others, so bring a group of friends and dig in! Other reviewers comments on the location are valid. The plaza is a bit run-down. Don't let this stop you from stopping by for a great meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uzz6LlaqGdd-U1dfPOo7_Q"
  },
  "lS4NCByCOLRlTpEfsxwpbg": {
    "date": "10/12/2013",
    "text": "DO NOT BUY THE LIVING SOCIAL FOR THIS RESTAURANT!    The short story.  Service was AWFUL, the living social that I paid $27 for was valued at $53, but only got us $30 of food and 2 glasses of dubious wine, food was decent but not what I expected for such high ratings (after having had awesome Ethiopian food in other cities).  Want more details, read below...  I was VERY excited about trying out this restaurant.  I love Ethiopian food and have been looking for a great experience here in Charlotte.  After reading all of the rave reviews on Yelp, my husband and I purchased the Living Social deal, expecting a somewhat sketchy environment, but awesome food and service.  We knew from the reviews that the atmosphere would not be incredible.  Our service was AWFUL (even though it was not crowded): - our waiter, a middle aged gentleman in glasses, barely spoke to us (I wonder if there was a lack of English) - we had NO refills on our glasses of water - despite being OBVIOUSLY pregnant, he still insisted on dropping off 2 glasses of honeywine - the honeywine came out of plastic bottles and wasn't listed on the menu (homemade without a permit?) - our waiter NEVER asked us how our food was - when we needed a pen to fill out info for the Living Social voucher, he proceeded to help out the drunk behind us and two other couples before retreating behind the bar with his back turned to us (my husband had to go up to the bar to retrieve a pen) - our waiter waited on EVERY other table and the random drunk guy that sat behind us WAY more than he ever bothered to pay attention to us.  Truthfully, as an Asian minority, it almost felt like racism/discrimination, but it wasn't overt.  As far as our Living Social, our deal read that we could expect 2 glasses of honey wine, an appetizer, one meat or veggie combo, and one veggie combo for $27, valued at $53.  Our waiter indicated that we could get one appetizer and ONE combo.  When you look at the menu, there are appetizers around $7, veggie courses around $10, meat courses around $13, and combo courses on the far right listed at $23.  So based on the waiter, our $27 Living Social could buy us a $7 appetizer + a $23 combo + 2 glasses of wine (that I doubt costed $10 a piece).  We will be filing a complaint with Living Social momentarily.  So why 2 stars?  The food was decent.  Better than the other Ethiopian I've had in Charlotte.  Decent injera, pretty good doro wot and doro tibbs as well. The beef sambosas were good, nicely spiced, but the beef overcooked and chewy.  I also wonder if maybe you go on a different day, you get a different waiter with a different experience.  Yelp has always steered us in a great direction, so I'm surprised at how awful our experience was.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJy4sMTgT_GUA9yjidMErw"
  },
  "QoIVnb7Iqwhqh4sAelNAGw": {
    "date": "12/15/2014",
    "text": "I love this place!! The avocado salad is really good and if you haven't been before I recommend the chicken combo. Some dishes are served raw so if your not into that they taste just as good cooked. As a child I always got in trouble for eating with my hands but here it's exactly what your supposed to do and in my opinion it taste better that way. For sure worth a try. The staff there is very nice and the service is fast. My daughter cried because she didn't want to go and the waitress carried her out and put her in the car!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SQHr0NPJwaTpqs1OCuun4g"
  },
  "vlPdDOjQ5-cm_8mBNv7s2g": {
    "date": "7/2/2019",
    "text": "The restaurant may look a little bit sketchy on the exterior but if you go inside, you'll find great food. The waiter was very friendly and the portion sizes are big. It is also nicely decorated with Ethiopian art. The waiter even explained the artwork to me. I recommend you check out this place for yourself !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pz3iPvstkTVpnioODn8ptg"
  },
  "nKoCTt6ktYb5am8jBQ_3WQ": {
    "date": "12/30/2018",
    "text": "This was my first time eating Ethiopian and Eritrean cusine and it was amazing. The staff was very friendly and the food was made to order. My friend and I had the vegetarian platter for  $17.99. This was more than enough for 2 people and we were more than satisfied. Amazing! I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XQKi4zovxJlOD6m_Q6i7tg",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Vegetarian Platter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XQKi4zovxJlOD6m_Q6i7tg/o.jpg"
      }
    ],
    "user_id": "z2FkdIV7blVF91G70loCjA"
  },
  "IZan30o8sSIkw91QVHv6fg": {
    "date": "6/14/2019",
    "text": "The food was phenomenal and only topped if possible by the hospitality and warm of the owner and staff! A hidden gem I would highly recommend Queen Sheba as a healthy alternative that's tasty, healthy and not yet mainstream but will be if word gets out about Ethiopian cuisine!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jZJ7IfkmEnfakXnqiNfezA"
  },
  "brGH5k3Nh2R6ywr9gb5jyg": {
    "date": "2/14/2019",
    "text": "I am sad to leave a bad review,but after inconsistent food (cold food, dry and hard injera, inconsistent quality of ingredients) and upset stomach after eating there with our  recent experience, we will no longer come here. We came here for years and shared it with friends and family. It is sad that it has taken a downward turn for quality and consiste",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QdsPb6PtrNdsLN9iMH9IgQ"
  },
  "XTKlkNps2Bye830n5CwD_A": {
    "date": "4/21/2018",
    "text": "So I have scale for Ethiopian restaurants that goes from sanitary but bland to authentic but might give me hepatitis.  Of the places in town, this strikes the optimum balance.  If you are primarily concerned with the restaurant inspector score, this is not the place for you.  Kind of smoky from the hookah bar next door and from the burnt coffee, and not particularly current decorations.  But if your focus is on the food, here it is delicious and plentiful.  Servers or owners are delightful and very generous.  I always get the veggie platter with 6 different things (cabbage--my favorite, two different lentils--yellow is mild and brown is spicy, collards, potatoes, green beans, and salad) and all of them delicious.  If you express liking something, expect them to bring you more of it, including injera.  Since 2 of our party got there earlier than the other 3, we got to chat and they brought us samples of the honey wine.  They don't have Ethiopian/Eretrean beers, but would like to.  We also got the lentil sambosa to start and they were flavorful and a little spicy.  Have never seen a crowd in the restaurant and it is in a sketchy strip mall next to a Tejano/polka bar, so it's a little noisy, but I still think of it first in town for Ethiopian.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fd5gM6idIEYEhsxtUHLm3Q"
  },
  "7AyaYvRMFhB7CYokR8881g": {
    "date": "4/23/2017",
    "text": "Small but quaint restaurant! Definitely authentic food with great service. We ordered malt wine which was delicious and went well with the meal. It is a little sweeter than most.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vL-VuhgzHuPsOQ5KoLzGuA",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Malt Wine &amp;amp; Authentic dishes!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vL-VuhgzHuPsOQ5KoLzGuA/o.jpg"
      }
    ],
    "user_id": "JlTEv3ZAHTCDvt94fOjWOQ"
  },
  "91Wu2Ty-so5qGDX5hO7sWA": {
    "date": "11/5/2013",
    "text": "Yum, yum, yum.  You Charlotteans really need to check out this Eritrean / Ethiopian establishment.   The taste level is above what I've experienced at the Meskerem's of the world, and you're definitely in for more of an authentic experience, with real teff injera and more varied menu options such as the tartars.    I went with the avocado salad and veggie platter.  Taste level was outstanding for both -- 5/5.  Perfectly cooked, fresh vegetables and the injera was perfect for me...not too sour with a touch of sponginess.  The owner is super nice, and really goes out of his way to make sure you're happy.  I get the sense that it's literally a mom & pop shop.  He even offered me an extra helping of my favorite part of the veggie combo (happened to be the spicy chickpeas).  All I can say is double yum.  :)  Why is this not a 4?  Plastic over the tables, a 90\" tv showing football matches, and the hookah bar next door detract from the restaurant experience for me.  I'd recommend they go full-on food, because they're that good but apparently they're trying to do the bar thing too which is disappointing but very African-restaurant-esque sadly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3Ef2VveKPolixUWGA7Myig",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Veggie platter.  Owner was nice enough to offer seconds of my favorite component!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3Ef2VveKPolixUWGA7Myig/o.jpg"
      }
    ],
    "user_id": "RKPkxOYQlM0BjhM-H6_vAw"
  },
  "Hrs3384c85ofuYg420iH1g": {
    "date": "5/14/2015",
    "text": "If you enjoy Ethiopian food, Queen Sheba should be on your list of places to go!  If you haven't tried Ethiopian food yet - go here to try it!  It's a small hole in the wall that many might hesitate to go into, but sometimes these are the gems.  Once inside, the quaint little abode is bursting with color. There was a traditional coffee seating area as well.   It's fairly small inside with limited seating which is a good thing since I believe the chef was also serving the food and drinks.  So this made the service was a little slower than normal, but they still strived to do their best and it wasn't bad, just a little unhurried - but we could all use a slowdown in this day and age.  The honey wine, Tej, was sweet with a bit of a bite at the end keeping it from being too sweet.  It went really well with our meal.  The food was scrumptious and we ate everything we could until our bellies could take no more in.  We had the Veggie firfir to start. It was spiced nicely and I really enjoyed it.  The veggie combo was our main to share and all the components were done well.  My only regret was eating it with the injera that came on the side verses scooping it up with the injera it was served on.  I missed out on the flavors that injera had absorbed.  Note to self for next time.  It may not be fancy or hip, but it's good and I wouldn't hesitate to come here again or recommend it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2ZL0L5mxS-sNkxqA6qDk-Q",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Veggie Combo - delish!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2ZL0L5mxS-sNkxqA6qDk-Q/o.jpg"
      },
      {
        "img_id": "yzRllso_UfXqQJ7a5uthGg",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Honey Wine",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yzRllso_UfXqQJ7a5uthGg/o.jpg"
      },
      {
        "img_id": "g95ripS_mnzE9VmT7VvXhQ",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. #2 (forgot the name) - oh so good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g95ripS_mnzE9VmT7VvXhQ/o.jpg"
      }
    ],
    "user_id": "KdvF4hhsMqxe47yiS1netw"
  },
  "09EUGcHa9CNUESIwuK-JIA": {
    "date": "2/23/2017",
    "text": "I never have to wait to eat here. The service is always great. The food is made fresh so it takes maybe 15-20 minutes to come and you get a lot of it. We got the beef combo last time I went and it was so good. I've also tried the meat variety combo and it was also good. If you can finish the whole thing then my hat is off to you. I always end up taking some of it To-Go. This is the only place I go to for my Ethiopian food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8QmgSIF98gKtKsW3C8NuLg",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8QmgSIF98gKtKsW3C8NuLg/o.jpg"
      }
    ],
    "user_id": "ndAYXLt22Yd4yTfosZlbPw"
  },
  "meSo0C92nceRMEbXzNS3BA": {
    "date": "9/7/2016",
    "text": "Very happy with the most recent visit to Queen Sheba. This is my 3rd visit in the last 3 years and it gets better each time. The service is very friendly and the food is delicious. The owner also stopped by twice to make sure everything was to our liking.   The combo platter and sambosas were very fresh and had great spice. The tej was also great. Compared to some lackluster service and food at other Ethiopian restaurants in town, Queen Sheba stands out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2tdU9vdKHFJ7Qh4A6cSVeA"
  },
  "IX5JQGb4pczIghAPFOIiPQ": {
    "date": "6/1/2016",
    "text": "First time at Queen Sheba and I thoroughly enjoyed my Birthday dinner. The staff was nice and gave wonderful recommendations on what to try. I had the Sambosa, and Ye-Beg Tibs spicy.. The popcorn and coffee after dinner was great.. I'll be back for sure",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GahGonQjBV3X0Pa_PebuOQ",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Sweet treat",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GahGonQjBV3X0Pa_PebuOQ/o.jpg"
      },
      {
        "img_id": "SNDZJQ8weCZhqJO635F7ew",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SNDZJQ8weCZhqJO635F7ew/o.jpg"
      },
      {
        "img_id": "SFlcaMJYeb3mWJ5RLL0I1w",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Sambosa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SFlcaMJYeb3mWJ5RLL0I1w/o.jpg"
      }
    ],
    "user_id": "9EuCgY09kt_y1lqjscQzrw"
  },
  "NzvN-n_OY8HgQdJCACjYZw": {
    "date": "12/15/2014",
    "text": "This was my first time trying Ethiopian food and I must say that I was not disappointed . This place is located off Central and it's easy to miss if your not paying attention the outside looks shabby but the inside is beautifully decorated with Ethiopian art and decor. Our server was very friendly and helpful in explaining the menu! The food is cooked fresh and is phenomenal. I ordered a vegetarian lentil dish with cabbage and green beans the dish is good and the cabbage is amazing. I also treated my self to freshly brewed Ethiopian coffee p.s. This place makes a nice place for a cozy intimate date !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UbRTTaGMwOOvlRJ2KvU3ng"
  },
  "2kMctbjAXwfRQsCcZRjTwA": {
    "date": "2/10/2014",
    "text": "Queen Sheba has some really authentic well-made Ethiopian food. My roommate and I went to check it out after purchasing a Groupon for the restaurant. $20 for $40 worth of food and between the two of us, we couldn't hit the $40 mark but we were certainly not disappointed. The food was delicious and satisfying and my favorite part of the whole experience was the Ethiopian coffee. Oh my gosh it was so good.   The only thing that would turn me off about the place is the location. It's a little shaddy and the service was pretty spotty as well. If I was a very impatient person, I would had a bad experience but food and drinks were mostly worth the wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UCJD3WpEli5OtELzzW4nIQ",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UCJD3WpEli5OtELzzW4nIQ/o.jpg"
      }
    ],
    "user_id": "FBgDM7EaJ7yvHWitfrkaDQ"
  },
  "CfutTvv-su4LNBcM7EL3mQ": {
    "date": "10/18/2013",
    "text": "Like others, I bought the Living Social deal for Queen Sheba which turned out to be no deal at all.  I paid $26 for the so-called deal, but our bill was only $31 (sans honey wine).  What?!!!  I indicated up front that we had purchased the deal and asked what items were covered, so it's not due to improper ordering.  I just feel as if I've been misled.  Queen Sheba is located in one of the dicier parking lots on Central Avenue.  When we entered, we almost left because it took so long for them to acknowledge our presence.  The interior is nothing fancy.  There was one server working the entire dining room, so service was expectedly slow.  Although, to his credit, our server was helpful and friendly.   We ordered the beef and veggie combos.  The beef was served two ways - ground and cubed.  The ground version was decidedly the better of the two, but neither were exceptional.  The veggies were standard Ethiopian fare - lentils, cabbage, collards, and green beans.  Nothing really stood out as being that flavorful, and I've had better at both Red Sea and Meskerem.  Meskerem is still my favorite Ethiopian restaurant in Charlotte.  We do not plan to return.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "yL4whR1Qb63FptG9IVRdVQ"
  },
  "f51ott-kboyYB-iXYz8XSA": {
    "date": "5/25/2015",
    "text": "As previous reviews said, the restaurant is hidden on a strip mall among Latino shops,  on a not very nice area of town  - however one can argue that this adds to the whole experience as usually these are the most authentic places you can find.   So yes, if you're adventurous enough to go off the beaten path, you are in for a treat with this restaurant. The food is great,  combo portions are enough for 3. We also ordered  sambosas,  which is somewhat of a cross between a samosa and an Arabic esfiha. The prices are reasonable, not cheap but not expensive either. One warning, though, the kids selection is limited to none, so unless your children are also willing to try different flavors, you better leave them at home with a babysitter.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mj9ydV0mUcSwBy9SGGwc0w"
  },
  "ehbY9KSfs6T7PmRANvoVUQ": {
    "date": "11/4/2012",
    "text": "I've never had ethiopian before, but my man has, and said, \"hey!  you'll like it!  let's go!\"....and so we did.  i'm all about expanding my cultural horizons and thinking outside of the applebee's box.  :)  I must say i was impressed.  We had all 3 of the appetizers, Timatim Firfir, which is a mix of tomatoes, onions, jalapenos, olive oil and lemon juice, and injera diced up and all mixed together....you can also request this without the injera in it, which i liked better!  We had the avocado salad, which comes looking like a giant injera burrito.  It was excellent, and triangle pastries filled with a spice beef mixture and a side of spice green stuff to dip it in.  It was a little more spice than i can handle, but i will admit, i am a spice WEENIE!  However all the food is made to order, so they were very willing to make things more or less spicy for us, upon request, which is SUPER helpful.  For the entree we had the Queen Sheeba Special, which was cubed bits of beef in a very nice, tasty sauce, with jalapenos (which were not overly spicy) tomatoes and onions.  You have the choice of having it with injera or rice and we opted for rice since we had plenty of injera with our salad burrito looking things.  We ended our meal with ethiopian coffee, which reminded both of us of the flavor of trukish coffee, which we find to be very good.  This place is not only a restaurant but also a bar.  We were here on a sunday afternoon, but you could tell they had a dance floor and a stage for bands, and a big screen to play videos on.  i'm sure this place is a jammin' when it's party night.  The guy working was very nice and helpful, and was very accomodating.  The only \"downside\" is the location.  It's not in the best part of town, however i never felt unsafe, but just always be mindful of where you are.  :)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "b7EKX4Ba16qmrqOP302ccQ",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b7EKX4Ba16qmrqOP302ccQ/o.jpg"
      },
      {
        "img_id": "BQOjPaTrm_7vvugrrSXU6g",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BQOjPaTrm_7vvugrrSXU6g/o.jpg"
      },
      {
        "img_id": "0Uyd2LYw1Kg9OVYPOFCElQ",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Queen sheeba special with beef....very good !",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0Uyd2LYw1Kg9OVYPOFCElQ/o.jpg"
      }
    ],
    "user_id": "MfQ5Q4gm89MR4NM7mD-nmQ"
  },
  "QEue0dmxQszP8inXkyH-YA": {
    "date": "11/6/2012",
    "text": "EVERYTHING is Made-to Order so you can order each dish as mild or as spicy as you like!  Mild is NICE medium was about as spicy as I usually want!  Timatim Fit Fit or Timatim Firfir may sound like a great name for someones spiritual son   and it may be, though this one is a Tomatoes, Green, Pepper, Onion, Oil, Vinegar chopped Injera and wrapped in more Injera  We also ordered the Timatim Salad (not on the Menu) without the Injera in nor around it - this is my preference for Timatim and this one has good flavor.  Ethiopian Coffee!!!  Tastes like Turkish!  My Girlfriend (who is Turkish) said it has Green Cardamom in it and that is why I LOVE the Flavor!!!  Cool Coffee Pot and Mugs!  Great Presentation!!!  Is Ethiopian Coffee supposed to be this good!  I asked the guy about it and my girlfriend thought it was funny that he said \"first we grind these coffee beans...\"  So far i have only had Coffee in two Ethiopian Restaurants and this was the only one I enjoyed... The other two were not Arabian style like this one!  Avocado Salad wrapped in Injera was very good! I have never had this dish.  Beef Tibs with Rice, spiced with Rosemary and Cabbage... The Rosemary was a different and nice addition to the Rice that I have not experienced in Ethiopian.  The Music on the Music Videos was good and I'm guessing Ethiopian!   The neighborhood makes me want to start a fast song when I'm in the parking lot and this song is only sung during daylight hours, I would not be back there at night!  We will be sneaking back during the Day!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zIWXnj8MaDWjzZ51Bg_eoA",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zIWXnj8MaDWjzZ51Bg_eoA/o.jpg"
      },
      {
        "img_id": "I6cvkKABR1u_cAafBZqkqQ",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I6cvkKABR1u_cAafBZqkqQ/o.jpg"
      },
      {
        "img_id": "jhLBocV_L058XW_-3Uo8hw",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Ethiopian Coffee",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jhLBocV_L058XW_-3Uo8hw/o.jpg"
      }
    ],
    "user_id": "Ug0ujy9-jd0Oc2nk3KIotA"
  },
  "OIsc0Lr3lX4_RydueZAyFw": {
    "date": "12/17/2016",
    "text": "Delightful experience. The owners were friendly and attentive and very much added to our experience. Cannot wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UOuvDh6dHdXhcRVUxKnHvw"
  },
  "lLCq_9HKXFxGdfp9KZVosw": {
    "date": "12/6/2014",
    "text": "I didn't have a great experience here. The area was sketchy and the food was sub par. I got the veggie combo. The injera was thick, and didn't taste like traditional injera. The food was not spicy. The greens were vinegar-ey and overcooked. The green beans were flat. The alicha cabbage tasted just like cumin. The denich wat was good. Salad was good as well. Was really looking forward to the misir wat but it was disappointingly flavorless. Kik alicha was decent. The service was okay. Took awhile to get my food but that's fine. Food made it three stars, and could have made it two alone, but that combined with the area lost a third star. I was nearly hit by a screeching, out of control car in the parking lot as I left and I did not feel safe in general.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7zyWw79cnbJYIpTHpQzOSw",
        "caption": "Photo of Queen Sheba Bar &amp; Restaurant - Charlotte, NC, United States. Traditional coffee area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7zyWw79cnbJYIpTHpQzOSw/o.jpg"
      }
    ],
    "user_id": "QQ7sxRNs0A4uFK6pQE4AYw"
  },
  "7mHwD0wuAv0Dfd__l0keGQ": {
    "date": "9/19/2014",
    "text": "Decided to try this place because of their Groupon. The first time we went, the doors were locked and it looked deserted. The hours were listed as open, but they were definitely not.  I gave them a call a few nights later and somebody answered so I knew they were definitely open that time. I'm glad I gave them a second chance because the food was delicious. I definitely recommend the queen Sheba platter and the avocado salad to share. The injeera is also just the right level of sponginess. Would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NtuNSMXCPm3hSA4D73-wlg"
  }
}