{
  "h0Nhy00gmD-U9V7wWZ0THA": {
    "date": "8/16/2016",
    "text": "The food is always fresh and made to order. Fabulous selection of drinks, wines, cheeses, deli items... Very neat place. Someone on here nailed it, a mini Dean and Deluca without the price tag. Coffee bar is very good too and the deserts are out of this world.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Il99cw8Bb3LHAutFp94wwA"
  },
  "S9g3hFzl01IhGIA0P79hIA": {
    "date": "6/27/2016",
    "text": "Great concept- deli/bakery/coffee shop/fast casual restaurant/beer and wine bottle shop. You can enjoy all of the above in the grocery at a cozy table or to go. The selections are all mindfully selected, from the artisanal cheeses to the craft beer and everything in between. Also a great place to pick up a gift for a foodie or hostess, kitchen gadgets and bar wares are scattered through out the store. Menu items aren't worth mentioning by name because it's constantly changing. Free parking across the street.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O0DgWmrk4a1cPlZpARdNXA"
  },
  "JnGp3hczECc7ZQFFCOQ6ew": {
    "date": "6/2/2015",
    "text": "This place is so unique and yummy! I'm never afraid to try the things on the menu because everything just tastes amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hz1JCa8U7zdNIwLVlLp1Bg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Salmon Taco &amp;amp; Peach Gazpacho",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hz1JCa8U7zdNIwLVlLp1Bg/o.jpg"
      }
    ],
    "user_id": "t5BhQcd7M0K9XhYzhErwcA"
  },
  "4leJyu0vhGzDkZjh1GzAPA": {
    "date": "8/2/2017",
    "text": "Stopped by this evening to give the place a try and I was not disappointed. The staff was super friendly, the food amazing and  atmosphere there was great! I will absolutely be headed back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZME312h0xmmLME8GKTcy9A"
  },
  "mCltHz5g1oUMYB3XD0rzqw": {
    "date": "5/27/2016",
    "text": "Stopped in to grab some beers. Really laid back and everyone was super friendly. Came in 15 mins before closing, so I didn't really get a chance to look around, but the cheese variety looked appealing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AKOwiGFDjrGCWLiRvewXLg"
  },
  "RY8bu0e-lgxgNdZvGn_sJw": {
    "date": "7/11/2017",
    "text": "I really wanted to LOVE this place. And my husband and I will probably make it a go-to coffee place for lazy Sundays when we just want to sit and enjoy each other's company. However, I can't say much about it beyond that. I found the food to be average and overpriced. They had nice finds in the grocery area but again are expensive so you definitely don't want to make it a place you go to often. However, it is indeed a place to splurge on great cheese, etc. There was one item I do have to give praise and that is the lobster roll. Great flavor and probably three times what I can get in NY for half the price.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6bGc960ogysZDV_hp1QMJg"
  },
  "M6hIoGeaM8FQY5372ZP5Bg": {
    "date": "12/4/2014",
    "text": "Excellent staff, mouthwatering desserts & treats, cheese, tasty wine, delicious selection of craft beers, espresso, amazing, hard to find specialty items.  If that's not already enough; it's in a convenient location with a nice seating area. The only thing I could wish for is that they stayed open later. Then it would be pure perfection",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BShFGHhy7YDWu6MHkFm6bg"
  },
  "W6iqln8n_aB0gcqs8nd8IQ": {
    "date": "2/12/2016",
    "text": "This place is perfectly delightful well worth a visit! I had the pork belly ramen and my husband had the Banh mi sandwich, both were very good! Also had a great selection of beers and grocery items.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZqY56EqpFUw9p6LQ6TmSDw"
  },
  "TI_-I1IUznb1Bhs8-gHitA": {
    "date": "11/14/2014",
    "text": "I like this little place.  Yes, parking can be troublesome I imagine during certain times but side roads offer some decent size lots and side street parking.  If you park along Elizabeth during the workday weekdays you will have to park in a metered spot probably.  The interior is a little small but that's OK.  The offerings range from pre-made foods to freshly prepared sandwich and salad offerings as well as specialty soups.  I browsed the beer selection and it also seems pretty solid.  They offer a wide range of wine as well.  Seating is in the front of the place and while I was there near 12:30 pm it looked pretty packed and obviously a popular lunch spot.  Don't come here looking for your traditional groceries, this is more along the lines of a Common Market/Health Home Foods Market hybrid.  Nice addition to the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "yOxzaI0VRX9aN4eh3Oc8NA": {
    "date": "6/21/2016",
    "text": "This is one of my favorite lunch spots in Charlotte.  I've had everything from hot dogs to ramen and it has all been fresh and delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dw3ANX2M5Jyk4r_n9D013Q"
  },
  "DxZDOXb_R_8YerlRLzBvYQ": {
    "date": "11/2/2016",
    "text": "This is one of my favorite spots in town to meet people for a working lunch or late afternoon snack. I enjoy their coffee and lattes, and sadly haven't tried many of their pastries, though the cookies are good. I love that you can grab a meal, get work done, and even grab some gourmet groceries to take home. I always have a good time checking out all the fun, and often local, speciality ingredients. I have driven there just to buy Callie's Hot Little Biscuits from the freezer section to take to family in Michigan. In terms of order, I like the daily changing menu but it's sometimes hit or miss. Over the summer they had an amazing chilled noodle bowl salad, I ate it about 4 times in a matter of weeks. The salads are good, including the current fall-inspired salad. I most recently ordered the grain bowl with butternut guacamole. I found the flavors lacking and everything kind of watery, I was also disappointed with the portion size for the price compared to other menu items. It wasn't bad but it wasn't very good either, and I was hungry about 2 hours later. Ill still keep going back and hope to make to Sunday brunch and to grab a cheese and charcuterie plate some time soon.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GyJf71ss616pHZrFZpL42g"
  },
  "OUb1nPyKfqFEGjzk0EuhXA": {
    "date": "9/25/2014",
    "text": "Street food, beer and groceries? YES please! Oh and a coffee bar... STOP! I love this place sooooo much! Great spot to hang out and get some lunch time work done or meet the girls for wine and cheese. I love putting gift bags together here too. All the local products and interesting jars of sauces are so much fun. The olive bar is super impressive. The staff is friendly and knowledgeable; always there to help. I could spend hours shopping here. Order the No. 6. Trust me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SQFJvvOi9sto3OlLRN45LQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. If you bring it home, it&amp;#39;s homemade yes? Yes!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SQFJvvOi9sto3OlLRN45LQ/o.jpg"
      },
      {
        "img_id": "Xmmu1plKKp1dzKKDjTunvw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. If you are tired of Ritz crackers",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Xmmu1plKKp1dzKKDjTunvw/o.jpg"
      },
      {
        "img_id": "epFjCA3SgwN7nyBji2A5Mg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Meat. And more meat.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/epFjCA3SgwN7nyBji2A5Mg/o.jpg"
      }
    ],
    "user_id": "vVMwx-ccojMH5Hko0A_ZcA"
  },
  "bnc5XFtCdEf-njEFdeh_1w": {
    "date": "4/8/2016",
    "text": "Had a pork belly taco and it was amazing! Great location right off the new light rail extension. I've had their precooked filets before and they taste great after throwing them in the oven for 5 minutes. Also try the marinated mushrooms.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ifQeRhXCsu7Tl5lZAh1ZmA"
  },
  "AgRcLoYSS2W_bgU9srWAAQ": {
    "date": "5/30/2016",
    "text": "My wife and I have been trying to make it to Earl's Grocery for a while.  I am not much of a breakfast eater, but since my wife loves breakfast we decided to check it out on a nice Memorial Day morning off from work.  I can honestly say that the Morning Wrap was one tastiest breakfast meals I have ever had in my life. Don't think this is your standard sausage egg and cheese combo.  This Morning Wrap had so much taste going on that I am not even sure what it was that tasted so great.  I highly recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8x8nzYX3E6n3EtgzRnAXrQ"
  },
  "X5ENipOrPitEHu7VbkiENA": {
    "date": "5/12/2017",
    "text": "Good food in a fun, social atmosphere. A bit pricy for the food, even package chips, but I was with ones I love.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YQr-zoqlo0j2SHJoX0nyoQ"
  },
  "ED1-E4U6AAjqcUahERaY2Q": {
    "date": "3/17/2016",
    "text": "amazing lunch, great coffee, love the staff and feel of this unique grocery store. My favorite is the Pickup the Tempeh sandwich! Loving the Pure Intentions Coffee selections and the Fresh juices, definitely check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S23kycqI_UBvCk8uX5flMA"
  },
  "GMyw-EJVvIzZh4CkjO-XQA": {
    "date": "12/29/2015",
    "text": "Great find, great location. Food was good and the atmosphere is very clean, friendly and cheerful. I had the rock'n roll sandwich and a Lenny Boy kombucha. Both delish.Wish I had had more time to browse the specialty groceries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f8E3WMSvOqHdimljafmj6A",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/f8E3WMSvOqHdimljafmj6A/o.jpg"
      },
      {
        "img_id": "I6uy3J1Smn0rizxZERRMrA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Lenny boy come Kombucha. Awesome find.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I6uy3J1Smn0rizxZERRMrA/o.jpg"
      },
      {
        "img_id": "-v_8q8ZIsU8VNAw0MCpndA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Yum. I came here on my work break to eat lunch, and will definitely be back with my family!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-v_8q8ZIsU8VNAw0MCpndA/o.jpg"
      }
    ],
    "user_id": "JK_4bV471Lgo4wP0DI7wpw"
  },
  "MxwbWodlE_Ap7A52lu_Oiw": {
    "date": "1/26/2016",
    "text": "Great atmosphere! Definitely Common Market meets Dean and Deluca! Hipster atmosphere, areas to charge your phones, and nice sunlight. I didn't enjoy my sandwich, but everything else was great! My date had the soft taco and he devoured it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uqZD0FJMAkQjuZ9Fd9GgzQ"
  },
  "zoL83qm_VwKCPQfjC49T0Q": {
    "date": "9/12/2015",
    "text": "3rd time in.  Like a upper end Common Market.  Food is creative and not over priced for the quality.  Environment is kind of bland and has that upper end posh feel.  Staff was pleasent!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "k7SvBuj_Ud4CmpnLutu1yw"
  },
  "zOjyB3dWsT_pGEDhRZ96qg": {
    "date": "2/20/2016",
    "text": "This is a great little spot to grab a beer and snacks, or coffee and desserts. They offer a good selection of everything - olives, cheeses, desserts, prepared dishes, sandwiches, etc. I wish their beer selection was a tiny bit bigger, but I can't complain. With indoor and outdoor seating, it's pretty much perfect for a first date, drinks with work friends, a lazy Saturday lunch... The staff is friendly, too. The only negative is I spend too much money here! :D",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ea9aNN7dtf_Wa7CgbifuWg"
  },
  "h64c7lJXE-_vBVrC2YJieQ": {
    "date": "8/17/2017",
    "text": "I really like the feel of this place. A restaurant/market or a place to sit and enjoy friends. There are so many food and drink items to choose from. I had the daily special burger with a coke in a glass bottle for lunch. Then tried several of the desserts which were all great. I'll definitely return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qyG832UKfh_LPhtpItz9Jg"
  },
  "YsyW0X9RPGEc80dmRBzqVw": {
    "date": "8/9/2014",
    "text": "This new neighborhood gem is on Elizabeth and next to the Visualite. I saw on my Facebook feed that Earl's does breakfast. My husband and I checked it out today and were not disappointed! He got the duck confit hash that comes with two fried eggs and I devoured the grit bowl. What's that you ask? Deliciousness. They make their own kimchee and they top grits with white cheddar, the kimchee, some greens and pulled pork. Jeeeeezus. Loved it. Served nice and hot! You put in your order and they make it fresh for you, call your name and you grab a table. They also have a barista station where you can get coffee or tea and a baked good. We got a coffee cake muffin on the way out.  We also purchased Harissa, wine, Hellfire Bitters, artisan chocolate and items from the deli for dinner tomorrow; meatloaf, Mac n cheese and kimchee greens. Can't wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JtyL-o86s7F_9nmBtcvD0w",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Bitterman&amp;#39;s Hellfire bitters",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JtyL-o86s7F_9nmBtcvD0w/o.jpg"
      },
      {
        "img_id": "lvw34FS_6Aa-_hF8OCsGDQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Cherry coffee cake muffin",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lvw34FS_6Aa-_hF8OCsGDQ/o.jpg"
      },
      {
        "img_id": "9C1FndLUviG4Bh0OlF6t1g",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Grit bowl and duck confit hash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9C1FndLUviG4Bh0OlF6t1g/o.jpg"
      }
    ],
    "user_id": "fXPwu_pvEAQHfY_G8eW4vg"
  },
  "RZlSGhzqPP9afGJXjGbhIA": {
    "date": "12/29/2016",
    "text": "My parents and I checked out Earl's for lunch - it's a favorite spot that they hit up at least once a week. But this was my first visit. I ordered the Harvest Salad with salmon and it was scrumptious. The salmon had a spiced, fragrant seasoning and he portion was plentiful. The salad featured kale, currants, beets, pepitas, goat cheese and a very umami dressing that almost tasted slightly Asian with a hint of sweetness. Perfectly balanced and a very generous portion. Lunch tasted and looked amazing. I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VsZMouc-SRy_6Rs6LOVi8g",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Harvest salad with salmon.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VsZMouc-SRy_6Rs6LOVi8g/o.jpg"
      }
    ],
    "user_id": "-pwMpnwbhd2qQAhvjpCQJQ"
  },
  "lasQB7jAYF8xkMrdu_ooJg": {
    "date": "12/21/2016",
    "text": "What a cool spot! Went for Sunday brunch. I was surprised at how clean and organized the store was. A lot of cool stuff to browse while waiting on our food to be ready. The girl working the sandwich counter was so nice and friendly! I ordered the banh mi and my boyfriend go the No. 6 bowl. I really enjoyed my sandwich. The pulled pork was delicious and there was a ton of it. Boyfriend loved the No. 6 bowl with duck confit and beets.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vhAR5XSAtVyI84ZkfimokA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Banh mi. Delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vhAR5XSAtVyI84ZkfimokA/o.jpg"
      },
      {
        "img_id": "o4Eoy31WQqEk12PtIeSjJA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. No. 6 bowl with duck confit and beets",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o4Eoy31WQqEk12PtIeSjJA/o.jpg"
      }
    ],
    "user_id": "QkhRTrURcY3DW0BLLFPsIw"
  },
  "k2Ea1eUCyn0gZXFvai6d0w": {
    "date": "1/16/2016",
    "text": "The Deli at Earls is full of Pearls!  Deli Food Review:  Earls is great, you can't have enough places like this around town.  I had the bacon egg and cheese biscuit along with a steak and egg taco which included jalapeno slaw and avocado, both offerings delicious.  The store has a bakery and a variety of premade food offerings that I will be back to try out.  Also looked to be a good selection of beer and wine.  Plenty of tables to eat at inside with a nice atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5-_--FlotifeCjklFBR-SA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5-_--FlotifeCjklFBR-SA/o.jpg"
      },
      {
        "img_id": "_6QDwk8VG4VQ-sq7gOCuYw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_6QDwk8VG4VQ-sq7gOCuYw/o.jpg"
      },
      {
        "img_id": "hH1bnwY-EwGBuIqXX4D4MA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hH1bnwY-EwGBuIqXX4D4MA/o.jpg"
      }
    ],
    "user_id": "x2Ei7bQkD2wEA37rmGQ8Ww"
  },
  "NSwcupvM3DQlxmNYOgM8Ig": {
    "date": "10/17/2015",
    "text": "Happened upon this place on a lunch with a coworker that was running an errand and I was immediately ticked off: How many of you people knew about this place and didn't tell me?! Earl's is the best! Grocery store and restaurant all wrapped up in one. If I worked near here, they would get all of my money, all of the time! Shoot, they still might!  The cashier was incredibly helpful. She gave suggestions and explained dishes. I ordered the special (well, one of them. They have a couple different ones a day): the meatloaf sandwich on Texas toast. Gaaaaaaah! It was an open faced sandwich and it was insanely good. I don't even like mushrooms, but I ended up eating those. The tomato sauce was out of this world. They melted a single piece of cheese across the top and it was heavenly. My coworker got the soup bowl with ramen and she loved it! She also didn't share, so I was kind of sad. lol I watched them prepare a couple of other meals since I had never been there and they all looked appetizing. I totally have my eye on the warm bowl for my next visit.  Burnt butter chocolate chip cookie? Hmmm. Don't mind if I do and glad I did! Take my advice and just do it, if sweets are your thing. You know I like treats and this one had that salty sweet combo down pat!  Specialty grocery items? Yep. Pastries and such? Uh-huh. Ridiculously yummy lunch options? Hells yeah. They even have semi-prepared food you can take home to fully prepare yourself that is already seasoned. I'm so glad I finally stumbled onto this place. Somebody call The Fiance and break the news: I don't know who Earl is, but I'm love with him.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "ttZSRwCZiFMXwUO2Vr9pBg"
  },
  "AQStMkyX1ILDAgdPBdIQQw": {
    "date": "12/21/2015",
    "text": "I failed at taking a picture of my market salad. Sorry y'all! But it was realllly good, I ate it too quickly. The spiced pumpkin seeds were the winner here. The Farro was good, the currants were delicious but the pumpkin seeds were legit. I wish they had massaged the kale. Good thing I like tough kale. The golden beets are sweeter than red beets so they provided a nice compliment to the bitter kale and the salty pumpkin seeds. I can't wait to come back and camp out for the day. Earls has a mini coffee shop, bakery, and does lunch entrees and sandwiches, AND has tempting and tasty looking sides and meals you can purchase too! Plus a cute little wine shop and space for getting work done. Earls, you have a good thing going here. Elizabeth street is becoming my new favorite street in Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "v_2YRBINZHSQLFCuXbljbA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/v_2YRBINZHSQLFCuXbljbA/o.jpg"
      },
      {
        "img_id": "eKTPNSlufKylJb8AxDgQIA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eKTPNSlufKylJb8AxDgQIA/o.jpg"
      },
      {
        "img_id": "i6LM_GH6dCvU01mzYJd8Gg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Harvest Salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i6LM_GH6dCvU01mzYJd8Gg/o.jpg"
      }
    ],
    "user_id": "FRvKvr1-AsUaCBuxaoxnCg"
  },
  "g-Dr2NR2wheWXyAb3VbJ9w": {
    "date": "3/5/2017",
    "text": "What a superb find by my friend .. ordered the Buddha Bowl and Tempura Sandwich, both of which are great and the even the portion size is really good. I still feel full even after 4-5hrs of my lunch. All in all a great place for a quick meal. Coming back for sure !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "aPSKuK1HKkU0okCIQiwa1g",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aPSKuK1HKkU0okCIQiwa1g/o.jpg"
      },
      {
        "img_id": "Y6A2vgmRLVOyFWD9jKxfgw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Tempura sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y6A2vgmRLVOyFWD9jKxfgw/o.jpg"
      },
      {
        "img_id": "KLEk6tYjy15yCEHguaL7sQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Buddha bowl",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KLEk6tYjy15yCEHguaL7sQ/o.jpg"
      }
    ],
    "user_id": "AL4ef6IZAw9YwIfXw61ZyA"
  },
  "A_mrlVkQiZKkPl4ALxtMsw": {
    "date": "9/4/2016",
    "text": "I've been wanting to try this place for quite a while now, but have just not gotten there when it's open. Today we drove straight up from Indian Land after church.  Worth. It! I had the grit bowl, which had a perfect over easy egg on top, and two slices of grilled pork belly. It was amazing! Hubby had the black bean burger, which I'll have sometime in the future. Because we will be back.  This is one of those places you visit where, after the visit, you find yourself thinking about it and being pulled back. Just be sure you check website for their hours. They are tricky. For instance: Don't go AFTER a roller derby bout...go BEFORE!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zq5oemwiAZyrEC3GTVlYSw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zq5oemwiAZyrEC3GTVlYSw/o.jpg"
      },
      {
        "img_id": "TkxR1nBBIWPjny3q66cscw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TkxR1nBBIWPjny3q66cscw/o.jpg"
      }
    ],
    "user_id": "9m9mkjkyo4HGFUWgugewHA"
  },
  "jM6WkmJqvOu8ndtXJBD1AQ": {
    "date": "10/21/2015",
    "text": "Imagine that Dean & Deluca had a baby with Common Market, and you'll have a good idea about Earl's Grocery.   You can buy prepared foods (including duck leg confit, which I did not buy, but seeing it kind of blew my mind), beer & wine, artisanal bitters and other interesting ingredients for craft cocktails, everything you'd need to make a beautiful pasta dinner (including the freaking pot to cook it in), and more.   Then there's the coffee bar, bakery items (my friend brought some of their mini desserts to a recent gathering and they were a major hit), and a small but mighty made-to-order menu.   Earl's. Is. Awesome.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "71N130GXjqwymKUnhv4zTg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Quite possibly the best breakfast sandwich of my life. Just look at it.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/71N130GXjqwymKUnhv4zTg/o.jpg"
      }
    ],
    "user_id": "DM94XTJAjWR92kljgzwH4Q"
  },
  "SkyyV3_gtnQCQAjVZHdyJg": {
    "date": "7/16/2017",
    "text": "What a gem! Stumbled across this place the other day and will now be a common customer. Great sandwiches, coffee, and other beverage options. The turkey sandwich lives up to its reputation.  A small charcuterie bar makes the restaurant what it is. Highly suggest!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pQA0D3kMmYhEl_QZWPJ1ZQ"
  },
  "WQeddUvPwfsrBu5oRAGyag": {
    "date": "8/15/2016",
    "text": "I fell in love instantly with this place. One visit and I was hooked. Fresh food cooked to order... great dessert choices...prepared foods available in bulk...local brands....  Earl's Grocery has it all!  I'm starting to feel like I can judge the noteworthiness of a small grocery store buy what the chocolate selection. I know I know, call it weird, but at least I'm consistent. Earl's had all different types of chocolates, cheeses, and wines available. There's a pretty sizeable dining area inside if you want to sit down and eat right there for lunch/dinner. I had a hard time deciding which desserts to indulge and the staff at the bakery was honestly helpful. They didn't hit me with the \"everything's good here,\" they actually made solid recommendations. And OMG the s'mores pie was AMAZING!!  If I only I lived closer to this place I'm sure they'd have a new #1 customer!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "2AOyoQ1oO4lZ1H-QP0Mo2w",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. The Smore&amp;#39;s pie after they brûléed it. That dark chocolate layer really hits ya",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2AOyoQ1oO4lZ1H-QP0Mo2w/o.jpg"
      },
      {
        "img_id": "RbgfH56OHXXYh6HvW7KFlg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. The spicy chicken taco...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RbgfH56OHXXYh6HvW7KFlg/o.jpg"
      }
    ],
    "user_id": "l1CNyLLRfUFOPfuxtonReQ"
  },
  "EDUhlGUvqIzwHNw4fuW-nw": {
    "date": "4/14/2017",
    "text": "This place is so chill!! You buy your own food then can eat there feels like a picnic . Went w 2 other friends we shared a bottle of wine and crackers and cheese plates. I loved the vibe !!  - As another reviewer said, yes this concept is a bit like Dean And Deluca but more relaxed but still hip.=D",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ru_q5mNBYvD1nWqupbNF_g"
  },
  "D1mi0hh519ayk_DH7H-x4g": {
    "date": "11/7/2015",
    "text": "Originally, I wasn't planning on coming here. I actually have never heard of this place but I'm really glad I stumbled upon it. I was about to head over to 7th Street Public Market for some coffee, but I saw that this place had coffee too so I came in to check it out.   Earl's Grocery caters to your many needs. It is a bakery and a coffee bar; it has prepared foods and an assortment of cheeses and wine. The bakery goods really caught my attention. Some of their desserts included BOOZY brown sugar creme brulee, push cake pops, pumpkin cheesecakes, cream cheese brownies and more! For someone who isn't the biggest fan of sweets, I was definitely intrigued by their selection. I can't say that their dessert was to die for, but they were pretty good. I recommend the pumpkin cheesecake because it doesn't taste artificial and it isn't too sweet.   They also have a unique selection of chocolates. While they are a little pricey, these are flavors that you can't really find in a regular market *(maybe TJ's). As far as the interior of the establishment, it looks like regular seating for a restaurant, but they have an ample amount of outlets for you to do work or charge your phone like me. They also have an assortment of board games which is a great touch. I'll definitely be coming back here to hang out in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_x86ERG1WQN1x5sFLC9P5Q",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Pictured are the cream cheese brownie, boozy brown sugar creme brûlée and mini pumpkin cheesecake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_x86ERG1WQN1x5sFLC9P5Q/o.jpg"
      }
    ],
    "user_id": "SJEr0t98Op8WDVjhttkKLA"
  },
  "p6AOikwzvVqwVx1Y1EJZSQ": {
    "date": "1/1/2016",
    "text": "Earl's Grocery.. such a strange place. It's a grocery store and a coffee shop and a cheese shop and a wine shop and a deli and a place for food... and snacks that can't help but be placed in the \"odds and ends\" category. Hipster Alert.   LOCATION Next to viva chicken, down the street from CPCC. Parking is ample across the street and near the back of the entire rail line (look behind the mexican restaurant)  AMBIANCE Remember what we said earlier? It's a hodgepodge of things.. but think hipster-ized. The garage door-style windows are great in the warmer months. The windows open up and let in fresh air... which is great particularly if you're in the mood for an outdoorsy brunch.   FOOD They sell beer here. They sell weird snacks here. They sell pretty good coffee. .... but the best thing here.. is their hipster food. Their food may be labeled a certain way, but Earl's Grocery offers a twist to everything. For example, their bahn mi is not traditional bahn mi. Don't go there expecting to get a traditional Vietnamese sandwich.   If you like things that are pungent but fantastically delicious - try their Warm Bowl... turkey meatballs with Kimchi collard greens over crispy rice. Add an over easy egg. Don't ask questions.. just do it.   We recently discovered their steak tacos...pretty delicious as well. Be forewarned, the pickled onions will stay on your palate forever. It's the True test of love between you and your significant other. Seriously, our breath smelled like onions even after a load of Listerine.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8RN6G64qiv_Q2-nVfjFU9Q",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. steak tacos. $4.49",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8RN6G64qiv_Q2-nVfjFU9Q/o.jpg"
      },
      {
        "img_id": "P5po6zDVjYdkoBlJijYduA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Warm Bowl w/ Egg",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P5po6zDVjYdkoBlJijYduA/o.jpg"
      }
    ],
    "user_id": "YgRclUfGOFUcoslAXaZFgw"
  },
  "7j80mrQFehpGwfKXI2FPOg": {
    "date": "8/25/2016",
    "text": "This place is so convenient. I may be biased because it's super close to my house, but that's beside the point. I've tried many of their menu items and have never been disappointed (Banh Mi is still my favorite, and they have great brunch options).  I am here today to let you in on a very important and top secret life hack. The prepared food section. I used to marinate chicken, cook it, and slice it up to add to salads, wraps, etc for lunches throughout the week. Since I have discovered the spicy chicken skewers that they sell - not sure if that's the proper name - it really has changed my entire life! Is that dramatic? No. They are cheap (2-3 skewers will run you $8), the chicken is way better than anything I've ever made, and it comes with this AMAZING jalepeno crema on the side. I don't know (nor do I want to know) what's in that sauce but it is so good. I never want to go back to cooking my own chicken. I can't and I won't.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "dO9V1_-8a2xg5r0FdTsU4w"
  },
  "tUTcxEUsllzJdjJ0P2Qh1Q": {
    "date": "1/28/2018",
    "text": "A nice and clean place to have some appetizing breakfast. The place had a cozy and fun atmosphere which gave a good feeling to me. Reasonable prices too. I enjoyed my first visit here. The food were decent to great in quality which was okay. Would be here again soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kubvG_gBWpg2UQD34BHfrA"
  },
  "UkGKcXCT-7FrkERm_hI45w": {
    "date": "9/2/2017",
    "text": "Earl's is one of my favorite spots to chill, chat, or read. I particularly enjoy their breakfast options, of which there are usually 7-8 unique takes on 'breakfast/brunch'. I especially enjoy the French toast they have that involves blueberries and things you would not expect but ultimately enjoy. The coffee is really great as well, they can make pretty much any type of specialty coffee you like. They also make healthy juices if you're looking for it. Dessert display case, and a grocery : chips, snacks, substantial bottled wine area in the back, ready made pastas and rotisserie chickens.....the list goes on. Stop by , bring a book or a friend ( or your dog) and enjoy either the indoor or outdoor seating. Additionally , this grocery is right in front of one of Charlotte CityLynx Gold Line trolley stops and a few steps from one of the Charlotte B-Cycle bike share racks/docking stations. Good to know : they close earlier in the afternoons, not a place to come at night.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8XJ7DpZhQrzxNIJDRShf5A"
  },
  "esGUOjnp6d10PA8O55IG_g": {
    "date": "6/26/2018",
    "text": "Was having one of the hardest days of my life and COURTNEY here was so helpful getting me something for my friend at the hospital to eat on her diet. Truly amazing service from her. Thank you Courtney you're the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2O70TEAgxwKCuroK32C1g"
  },
  "fnL_Ea6-rRMRw9Y9vEA1-w": {
    "date": "12/5/2017",
    "text": "Another amazing meal at Earl's. Never disappoints. I prefer to enjoy Earl's after the lunch crowd. Such a nice place to grab a bite and relax around one of charlotte's more eclectic eateries. No chain experience here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uigHhs2agwaEkZ2ygPijCA"
  },
  "RgxqbkDEklSct1BctUxeeg": {
    "date": "8/1/2016",
    "text": "We walked in today to grab a quick bite before closing and were surprised to find such a tiny but complete market right next to noodles and co. We had to go straight for the grill since they were about to clean it. I got the heirloom BELT sandwich for $7.99 while the bf got the chicken sandwich for $6.99. We also walked around and grabbed the little containers of deli sides which were priced $1-3. The cilantro jalapeno pasta salad was creamy and reminiscent of Cabo fish taco's avocado pasta salad. We also grabbed the basil potato salad and the lemon orzo.   Earl's has a has a cool selection of craft beer and ice cream. I have to admit, $12 for a pint of ice cream is a little crazy tho. My favorite items included the hot fried or rotisserie chicken plates with white BBQ sauce. Had to grab a salted caramel blondie from their little coffee house at $3. Not bad for the size.   Things can get pricey but everything is so unique it's worth it. It's just so fun to look around and pick out cool items.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "C5QsUsQg5I3dMdLM02SXGA"
  },
  "oSpZEkkMlfOlMGoWKM41_Q": {
    "date": "6/4/2015",
    "text": "A lovely spot for brunch, lunch or an early dinner in the heart of Elizabeth. Street and lot parking are easy and they have a lovely little patio right for sunny weather. Earl's Grocery is chalk full of fancy products; whether you're in the mood for a soda, beer, cheese or meat plate, full on meal or just snacking foods, they've got you covered. I love their fancy bottled sodas, quiet atmosphere and friendly staff. Although they weren't opened on my visit, I spied a couple huge garage doors that when opened would allow a nice breeze.   Whether you're into specialty products or just looking for a place to meet up with a friend, this is a sweet spot in Charlotte. I also admired their cocktail accessory area, full of bloody mary mixes and bitters (includes Raleigh's local Crude Bitters!). Earl's meets a variety of needs and if I lived locally, I would definitely hit them up for social settings more often. It's like a better version of Durham/Chapel Hill's Foster's Market [much, much better--although definitely just as pricy!]",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "A8P4j7kQD-T6oCDpVmHxYw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Sipping on a Cock &amp;#39;n Bull Ginger Beer (spicy!) while enjoying the peaceful atmosphere of Earl&amp;#39;s Grocery!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A8P4j7kQD-T6oCDpVmHxYw/o.jpg"
      }
    ],
    "user_id": "7D0DvTzJVPJp-3G2j2bzCg"
  },
  "0n_gHDVaxQjqd17rHTJIHg": {
    "date": "7/17/2016",
    "text": "On a recent trip to the Charlotte area, I was recommended to try out a number of places to eat and Earl's was one of them. I went for breakfast early one Saturday and got there about 15 min before they opened.  By the time they did open, a small crowd of about 10 people had joined me.  Once their doors opened, we all went in.  I checked out their menu and decided to have a basic breakfast sandwich and a coffee.  They gave me my coffee and a number and within a few min my sandwich was delivered to my table.   It was very good... Fried egg, bacon and cheese on wheat bread all grilled together.  It was good but after seeing some of the other creations others got, I wish I had gotten the breakfast biscuit.  It just looked really good!    I spent some time looking around the store.  There were many interesting deli type foods to buy.  I liked their assortments of cheeses, beers, and bar bitters.  Not sure when I will be back to Charlotte but I will have to make Earls a stop if I do. Enjoy!  Atmosphere = 7  Service = 8  Food = 9",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "JxPC4zVV78s-uYVKlmoGdw"
  },
  "bFRjvoZA8WVSnoJGANgu4Q": {
    "date": "4/1/2015",
    "text": "Elizabeth Avenue has really become quite the foodie destination in Charlotte.   Earl's Grocery is several things. Bakery, coffee bar, place to grab breakfast-lunch-dinner, prepared foods, wine and cheese shop, and specialty beverages you can't find in other places.   My current obsession here is the pork ramen. It's delicious. I also like the dog of the day and the kimchi collard greens. To be honest, I've enjoyed pretty much everything I've had here except the Banh Mi. I have to agree with others on this one. I found it to be greasy and hard to eat. I actually ended up throwing most of mine away, which is not something I ever do. So far, that's the only miss on the menu for me.   How it works: grab a drink from the coolers and then go up to the kitchen counter to place you order. That way you can pay for everything together and then go sit down to wait for your food. Make sure you pay attention to prices on the drinks. There are some that are a little much. Nothing worse than buying a $6 coconut water by mistake. My last visit here the girl at the counter pointed out how much a drink was. Life saver. My friend immediately swapped it out for something else. Everyone who works here is so nice.   On top of the tables and chairs, they also have a bar like counter. It is perfect if you're looking to get out of your house and get some work done. Earl's opens up the big windows on nice days.  Important note: Earl's Grocery is open until 8:30pm on week night, but the grill/kitchen does close at 8pm.   Parking: street (free after 6pm) or in the lot across the way. The trolley thing will be coming through here at some point when they get it done. However, every time I'm in this area all I can do is think, \"who the hell is going to ride this thing?\" Oh well, that's an issue for another day.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 12,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "ieGpuFnW-Lws2Wx1X4xNyQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Ramen",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ieGpuFnW-Lws2Wx1X4xNyQ/o.jpg"
      },
      {
        "img_id": "wa2yR8As_1Uu4W3nE406Zg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Ramen",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wa2yR8As_1Uu4W3nE406Zg/o.jpg"
      },
      {
        "img_id": "IYa8XOhyxELYvFsN6fz0Og",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Banh mi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IYa8XOhyxELYvFsN6fz0Og/o.jpg"
      }
    ],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "fksJ62KfoYvPPrVgpjbyzw": {
    "date": "1/2/2018",
    "text": "The food is pretty good, it's fresh without a doubt but for some of the dishes it feels more like they threw some concepts together and did not make a cohesive dish.  However where the food falls short, the coffee can pick up the slack.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C0jou3Z34YVGQCR25RAR9A"
  },
  "FpfvaklR1hB0_cKP1K1QnQ": {
    "date": "8/11/2015",
    "text": "We were headed to Viva Chicken for lunch but they were closed for kitchen improvements so it was fortunate for Earl's and for our tummies. I've been wanting to go here anyway from all the reviews and pics I had seen. It was packed when we walked in with a small line to order at the back counter. As you make your make to the  register to order, grab a drink cause you'll need to pay for that when you place your order. Lots of drink choices plus they have a free water dispenser up front with small cups.   Check out the cool menu and the special board to the right. Lots of daily specials. I went with the steak taco special with an avocado crema. It had onions and a large helping up tasty grilled steak and avocados. I ordered two for about $5 each. I was satisfied with two though I certainly could have nailed a third if it was dinner, or just because.   We also treated ourselves to dessert from the front counter after as they looked great. The cream cheese brownie was good but not as good as the caramel nut bar. (We shared). The desserts are petite and priced appropriately. They were also super cold and they probably would have been better 15 minutes  later out of the case. Maybe get them to go.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "quM55AsfB014mqiIPsa3XA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Steak taco special with avocado crema",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/quM55AsfB014mqiIPsa3XA/o.jpg"
      }
    ],
    "user_id": "hVidDZUvOiy3xl0v3WKJlg"
  },
  "UCDgeBe-KmqxpnP4ycRS4A": {
    "date": "10/16/2017",
    "text": "Came here one Saturday to check out their brunch. I didn't know what to expect but it is a \"grocery store\" that serves food, drinks, and freshly made smoothies. The store part as per made food items, an assortment of drinks, and a small charcuterie bar. You go to the up to the counter to order and then they bring the food out to you. I tried the Korean chicken and waffles and it came with a side salad, it was delicious the syrup had a little spicy kick to it that I really enjoyed. The dressing on the salad was very lite and flavorful. They staff seemed friendly and knowledgeable. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O3cItff0mKAfXtl5VmbW2w"
  },
  "BHl5nUZFWib2968vdHEYjQ": {
    "date": "5/31/2017",
    "text": "I truly have nothing but praise for Earl's.    I had a sad experience last night at the dining establishment next door and the staff at Earl's really stepped up to save the night.    Even though our group hadn't purchased anything from Earl's that evening, they allowed us to sit in the patio area to enjoy our meal.    The staff went above and beyond what's expected.    Great job.  There's a reason why I dine at Earl's at least once a week and your service definitely affirms my choice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "eLiRuLdcgmXxZ3FCsF8j-g"
  },
  "RzRh8PcPAprda3qmzYEq3Q": {
    "date": "5/11/2016",
    "text": "This is the coolest little store!  I used to love coming at lunch and shopping around.  I have been here several times and everyone has been very pleasant.  It gets very busy at lunchtime, but I've never had much of a wait.  The products they carry are unique and fun to look at.  I could just shop here for hours!! Can't wait to stop back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "-9qHH3Pmi0zFgQaYkqQ81Q",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-9qHH3Pmi0zFgQaYkqQ81Q/o.jpg"
      },
      {
        "img_id": "nSRlH5o4Uzo1odeZmlmyMg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nSRlH5o4Uzo1odeZmlmyMg/o.jpg"
      },
      {
        "img_id": "AqslfaHsgm4W05MiivEReg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AqslfaHsgm4W05MiivEReg/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "QEOQ1LwTLomP7HWw4rnRdw": {
    "date": "10/3/2017",
    "text": "Great place! Last night was my first time in there. Had dinner a few doors down and needed something sweet so I stopped in here. Cute little coffee shop area with some good looking bakery. Purchased the most delicious peanut butter chocolate rice crispy treat. Mmmmm I want another one as I write this!! Lol Fresh made foods also. Already prepared sandwiches and salads. Cheeses. A few frozen food coolers with healthier frozen meals, pints of ice cream and bottled drinks. Cool atmosphere inside with quiet a few tables and chairs to eat at.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g5X9eeKuS_OlUB25lDYVHQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. DELICIOUS peanut butter chocolate rice crispy treat",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g5X9eeKuS_OlUB25lDYVHQ/o.jpg"
      }
    ],
    "user_id": "hfbFk_VEeVtdQNHM_a5ayg"
  },
  "ip8Kaicy2AezufXvzwUV8A": {
    "date": "9/12/2017",
    "text": "Really love this place. The vibe is casual but nice. They have a variety of items such as craft soda, craft beer, juices, pickles, sandwiches, coffee, chips, and candies. Service is always friendly. I had a turkey sandwich and it was good but not great. The environment and other options to buy make me continue to love it and try it. Parking is available across the street.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9eiqEQzRrhPjvMDoGRq20Q"
  },
  "92SBVD9U_fOMeltQzd8GXw": {
    "date": "4/5/2017",
    "text": "This place is awesome! It's a boutique grocery store, with 30% of the space for sitting down and enjoying your food. There is a food prep area and a bar. You can order a glass of wine from them, or buy a bottle and drink it there. The ambiance is nice like a good Whole Foods, (not like any locations in Charlotte). Healthy, quick, quality food and amazing staff. I appreciate the sell by dates on the already prepared food so you know how long it's been ready, or how much longer it has if you're getting it to go. The only down side is the hours! 8:30 PM is just not late enough for us workaholics! We need you open til 9:30 at least! :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ljk1DxDWC-iP9nUBaE_2FQ"
  },
  "ARrSdM3EozY8W8x6xRegPg": {
    "date": "5/25/2017",
    "text": "Love, love, love this place! My favorite meal is the Harvest salad substitute the kale for mixed greens and add grilled chicken. The breakfast biscuit is so yummy. The ready to go carrots are tasty. I enjoyed the breakfast biscuit substituted the ham with bacon. Great place to relax.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "db1JZkml45lJzxR-6auF4g",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/db1JZkml45lJzxR-6auF4g/o.jpg"
      }
    ],
    "user_id": "DlXeHPut0_ZYBJXNRFjuEA"
  },
  "31oQg3_CrieyvLiNZJ8gng": {
    "date": "6/24/2017",
    "text": "My son and I decided to stop by after hearing great things and we may have just found our favorite brunch spot!! The interior is very open and has a upscale, rustic-hipster vibe. The employees were very friendly and helpful and the food was absolutely delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "g_nElxf8XZ3NxXTfS2aqNw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. The delicious grit bowl!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g_nElxf8XZ3NxXTfS2aqNw/o.jpg"
      }
    ],
    "user_id": "Pd44WJ_HIE5Jc6HendsqKw"
  },
  "MHJbQYUiocBhi-8HghPE1w": {
    "date": "7/14/2017",
    "text": "I love this place.  It's been awhile since I've dropped in because I had forgotten about it. Some friends and I were looking for a convenient place and we all live in different areas from the office.  Great selection of wine, beer, cheese, sandwiches, and homemade sides and baked goods.  Gluten Free options available for many items.  They have several roll up garage doors that face Elizabeth to enjoy the outside on cooler days.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rwEZPeKEHWQcujVWVLdvDw"
  },
  "AozRv_5erc_ZYrBRXgcj1Q": {
    "date": "5/7/2017",
    "text": "My new favorite spot for brunch, lunch, all day Sunday hangout.  Earl's is an awesome place if you're looking for a laid back atmosphere, some good food, friendly folks and an expensive to go bag full of delicious cheeses.  I heart good cheeses.   I've been a few times with friends, and we've done everything from coffee, to charcuterie trays, bottles or bubbly, bahn mi and chicken salad sandwiches, duck confit, grit bowls...So. Many. Choices!!  And all really good. Their lattes are legit (good quality beans, not over roasted), so I recommend making a day of it, start with coffee and move your way through some meals.  You may graze until you're super uncomfortable but still unable to resist grabbing some chicken salad or the Moroccan cauliflower side to go.  I really love and hate this place for that.  Be warned, it can get pretty pricey when you add all those little yummy things up, but you could go for breakfast or lunch and stay around $15-$20 including tip/beverage.    Would happily bring the parents, my friends with their babies, and also have awesome Sunday funday with girlfriends. Earl's is definitely a one stop spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MeKltbR4ZGrJRpzVOldhsg"
  },
  "5oPGJ5c6qu4LIdcMp24xdQ": {
    "date": "6/28/2016",
    "text": "Um, hello fancy grocery store with lots of cool retail and made-to-order food options!  Picture this.  You're driving around hungry.  You don't feel like going to a restaurant where you have to fight it out for a table, but you would like to sit down and have a good quality bite to eat.  Earl's Grocery is the place for you.  Earl's has everything you need for any meal of the day...they have coffee and breakfast sandwiches for the morning, sandwiches/salads for lunch and rotisserie chicken and sides for dinner.  Now these food items aren't your normal get-this-at-any-grocery-store kind of items.  They use an interesting combination of flavors and super fresh ingredients.  They also have a nice drink selection if you're looking to relax with a beverage.  The prepared sides looked fantastic, and the orzo was very tasty.  Salad was extremely fresh and had some nice toppings.  I saw a whole mix of people during lunchtime on a Saturday.  You had people having a cup of coffee and studying on their laptops, you had small groups of friends dining at the larger tables, you had parents in their with their kids after a game.  I liked this because it made me feel like I could come here by myself and just have \"me time\" and not feel like I wish I was sitting with someone.  Two negatives on this place.  1. it's a bit pricey.  2. good luck finding a parking space.  I am 100% coming back here to grab stuff for a picnic at some point this summer.  Cheese, wine, sandwiches, salads, sides...the toughest part about planning my next outing will be deciding what food/drinks to bring from Earl's Grocery.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g4CEweu8TJo9NRvbtd4zEQ"
  },
  "z08KxUc7GUbJSUPaRKF8Fw": {
    "date": "2/25/2018",
    "text": "Earl's had a variety of delicious dishes. The White Lilu Biscuit was delicious and I highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QoLXZeW5bVjgWgx4mZ3VFg"
  },
  "ZP7juKmgBuYbRLGhlkGXSA": {
    "date": "3/18/2017",
    "text": "As a number of other reviewer's have mentioned, one of the great things about Earl's is the variety. You can grab coffee, alcoholic drinks, prepaid meals, hot meals, or just dessert depending on what you want at that time.  With that said, my girlfriend and I stopped in for our first visit today and both ordered hot meals to eat-in. I ordered the number 6, a beet hash with duck confit, two eggs, and cole slaw. My girlfriend chose the korean fried chicken biscuit. Both of these meals were very tasty but had small letdowns that keep me from giving Earl's a 5 star review. The No. 6 was excellent - especially the duck confit. My main complaint is that I feel it lacked a bread/starch component. The cole slaw and runny egg led to a pretty saucy plate and the beets and moist duck confit added to this. I feel like this dish may have been better as a sandwich or tacos instead of a beet hash. Also, be warned - it is spicy. You won't notice it at first, but by the time you finish the dish, you'll be feeling the heat.  My girlfriend's Korean chicken biscuit was tasty but pretty small and lacking a side. The chicken reminded me of a more Korean, milder version of Nashville hot chicken and was really good. The piece of chicken was too small for the biscuit though, and the whole thing wasn't large enough to be all that filling or worth $8-9 without a side.  All in all, the food was solid, and the servers were very friendly. Despite a few small drawbacks, I think we'll be back to at least try some other options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-8uaNlOQ5G6eJ7cGxKiBKg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Korean chicken biscuit - a little small but good",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-8uaNlOQ5G6eJ7cGxKiBKg/o.jpg"
      },
      {
        "img_id": "VD-zE3MxxGYDClpSnZPmAQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. The No. 6",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VD-zE3MxxGYDClpSnZPmAQ/o.jpg"
      }
    ],
    "user_id": "aLqp_fe64ugZFuwMpsXLiw"
  },
  "TzAcrwXKnZszFLkky3yNQw": {
    "date": "2/7/2018",
    "text": "Absolutely loved this place! We came here to grab something before seeing a show next door and WOW- I was so excited by all of the healthy/vegan/veggie options! Plus, all of the wine :) such a great spot with relaxed atmosphere! Wish lived closer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOAZt4J39xKyh0WFHmGW0Q"
  },
  "WBLMJjwY9OPISEv6KE9j6A": {
    "date": "4/9/2017",
    "text": "Great little spot and not too crazy for a Sunday morning. Trendy atmosphere, good food, super friendly customer service, unique inventive foods.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KemJtqnc-773xIdB9gdWLw"
  },
  "lr4PtnKv717ptEK9qNPlBw": {
    "date": "3/28/2017",
    "text": "I just recently discovered earls grocery and I love it! Definitely a charlotte gem. It gives off a Starbucks vibe but it's so innovative and cute! I love the atmosphere, the location and the coffee",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MRBfWLFgBg27WYU7yCV-AQ"
  },
  "sP3JPONKORkaRuBdPfUrBg": {
    "date": "3/26/2015",
    "text": "I will have to give it another shot...  I LOVE the concept, I LOVE the space, I LOVE the service...I just didn't like the food or the price of the food :/  I had a $12 Banh Mi that was just not good. The pork had no flavor, not enough crisp veggies or herbs, and the sauce was meh. The highlight was the bread which was very good.   The side of the day (tabouli) desperately needed seasoning...and I am a notorious under-seasoner (if that's a word).   For a $12 price point you can eat  a lunch-sized sandwich most anywhere in Charlotte (even higher-end places) and this one wasn't very impressive. I may give something else a shot because everyone deserves a second chance.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "gskpgM-ddbVqdHgxEdAbLg": {
    "date": "10/6/2015",
    "text": "I absolutely love this place. The staff is amazing and treats you like you're apart of their family. They actually care about the people who walk in and that's great! I can always count on coming in and doing some school work, having a latte, and a fun little dessert! This place has yet to let me down and I look forward to coming even more!  -Tons of gluten free options -Great wine and beer selection -Amazing lattes -Phenomenal staff -Healthy pick me up snacks -Cool deserts  What else could you ask for?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XuWa2reggAV2sC6IRcgGmQ"
  },
  "Y2_YKX_tYvxH0dYw6f7LAA": {
    "date": "9/27/2016",
    "text": "Came here with my team before we went to work excited to see many options available and something for everyone but unfortunately each thing we tried was just a little off in flavor or texture. Grain bowl was really wet with water (?) Fried Rice with tempeh all same flavored (savory) over salted and a bit of a mush. Was looking forward to pickles and kimchi Popping out at me with tangy vinegar vibes but they blended as salty with everything else. Mediterranean salad was good and chicken salad sandwich was fine. Will come back again and try again! Staff was so great and there are lots of options. I'm sure we'll find our groove!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0EoPzhRQtN64Pmgy7rAgIg"
  },
  "kjA7iJDMMjWC514VFPPLxw": {
    "date": "12/30/2015",
    "text": "I did I did......................... Had the # 6. Wow, the flavor combination was amazing.  Really cool place for amazing food , great service and specialty food items.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FObOePkrio-0djGwdq6JUA"
  },
  "vYz0q9dUrP8eDDwpgtuTdQ": {
    "date": "7/4/2017",
    "text": "I am confused. I went with the belief of almost 5 stars prior to reading a previous review and now I agree with the negatives.  Can someone that frequents Earl's define a Banh Mi?  What I bought for $8.99 was dried pulled pork on an undercooked hoagie roll (not a baguette) soggy with a bizarre mayo. The Charcuterie was \"pre wrapped\" where the cheese and additions are mushy and dried. The $11 noodle bowl was an upcharge for 2 small pieces of chewy dried pork belly on honestly cheap asian store rice noodles.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HyXgqWuIbb_lUi_fm8_8Xw"
  },
  "j5C7WF7ynlTZGKWfhK6x7A": {
    "date": "10/31/2015",
    "text": "Outstanding breakfast specials, especially the white lilly flour biscuit sandwich with egg and bacon. Melt in your mouth biscuit flavor with salty bacon and a herbed egg finish! Their chai almond milk latte is the best in Charlotte! I find myself craving a visit to Earl's. The breakfast wrap is good if you like a more huevos rancheros flavor. This place also as amazing food to go. We had their pork tenderloin skewers for dinner one night that were savory spicy and excellent cut of meat, very tender and delicious. Also love the dairy free \"ice cream\" salted caramel chocolate! Yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CKRfBUqQGaVCYTKN5kDrzw"
  },
  "xGbric09Z-XzEqLymskqIQ": {
    "date": "7/19/2016",
    "text": "Maybe it's just me but...I've been anxious to try this place from the reviews and I was SO disappointed.  1 sad little taco was $5.99, it contained 4 pieces of steak that were quarter (1) and dime (3) size!! The cabbage was just pickled cabbage. For 6 bucks I thought I'd get two tacos per order, nope just 1. I also ordered the salmon taco, same sad little thing 4, 1/4 inch thin, dime and quarter size pieces of fish, 6 bucks for 1 taco.  I ordered the watermelon and tomato gazpacho, thinking I'm getting 4 tacos, I'll get the small size, like 8oz.  Nothing to write home about, $5. I see plenty of rave reviews for this place so, maybe it's me.  I just don't think that after dropping 18 bucks on 2 tacos, a teacup portion of soup and a bottle of root beer, I should have to stop at a burger joint to get full.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C9_c1gDCIsfYlKP1CGLRog"
  },
  "7cjULdPOFQKBjUa0f2o9gQ": {
    "date": "8/11/2015",
    "text": "Quality. That's what this place is. All local or state-wide products with awesome biscuits and phenomenal coffee.  The biscuits are super crumbly but delicious!  If you want McDonald's style quality for McDonald's style prices, don't come here.  Earl's is high quality and you pay for it. I don't mind because I know this place is legit and worth every penny.   This place was full of college students (mostly) on a Tuesday morning at 9:30. The staff at the front was so helpful...and good looking! ;). I felt like I was in New York City!  Thanks Earl!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DwWwdLEty3JcsIz6MSeGQ"
  },
  "XGzTKl_gFh6KFVudqs5KPg": {
    "date": "1/6/2016",
    "text": "Tried the Rockin' Roll on my first visit to Earl's today. I was pleasantly surprised. The flavors all worked well together, and the chipotle hummus wasn't too spicy - had just the right amount of zing for someone who doesn't often eat spicy food.   The included side of pasta salad was a bit smaller than I'd like - I needed about four or five more bites, but it was a nice compliment to the sandwich.   Good selection of beverages, but only offering $1.50+ bottles of water wasn't my favorite. I'm just fine with a good ol' glass of city punch out of the faucet.   That sandwich though - I'll be going back... but probably for take-out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9YflLk5MKqeZ0JQeHDGg8A"
  },
  "Kl9Tbi6fyHKRuZNM1fE8QQ": {
    "date": "11/2/2016",
    "text": "Sandwiches, juices, pastries, and a weekend brunch are just a few of the yummy goodies at Earl's Grocery. I've not had one bad bite or sip from this place. I love having the option to grab a quick bite from the prepared foods sections or having a sandwich made to order. There are a number of specialty items sprinkled throughout the store, some of which you cannot find in your local grocery store. The dining area offers plenty of space for those who choose to dine in. Outside seating is also an option. Earl's Grocery has become one of my go to places for quick, healthy, and delicious food options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n8botb5NH8k3hAakNro2fA"
  },
  "OqyhwS9Ypr5uzTMOWL_k6w": {
    "date": "2/9/2016",
    "text": "So this place is lovely. I absolutely love the boutique grocery stores that seem to be popping in around the Charlotte area.  We used to be limited to going to Common Market to get the very unique and eclectic vibe but Earl's has a bit more of an organized chic feel to it.  Coming from the San Francisco Bay Area we have a good deal more to choose from so I'm very glad to feel almost at home sitting at one of their tables I. The dining area.    When you walk in you'll notice a coffee/pastry bar to your left and they normally welcome people with bright smiles which of course is always nice.  The deli lunch bar has an array of choices ranging from delicious burgers to even tasty noodle bowls. I'm a fan.    If you walk through the aisles you'll notice a plethora of unique goodies everywhere so be sure to give that a look as well.  This is one of the best places o feel to have lunch with friends or even stop in to get some work done on your laptop.  Cheers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zmMFnqah77obfLm8EtuVuA"
  },
  "jIm7N9vFh9MkvJ2hpOWM0A": {
    "date": "9/11/2014",
    "text": "I usually like to wait to write reviews until I have a really good handle on the menu and try numerous things, but Earl's has so much it's going to take forever to get to that point, so I'll just proceed. First, Earl's is a spacious, clean, upscale, minimalist place that is perhaps misnamed. I would have called it Earl's Provisions, but they didn't call me for branding advice. Anyway it's probably not going to be somewhere you would ever go for a week's ingredients. However it *would* be somewhere you would go for getting something special if you're having people over or want something different. Their prepared food section has tons of unique side dishes and they have a wonderful pickle bar (wish it was even bigger!) for appetizer/antipasto type of goodness.   As others mentioned, the also have a deli counter that in addition to sandwiches also have a \"warm bowl\" of fried rice with turkey meatballs (delish), and *cold* noodle bowl with mild chile lime tofu and the most wonderful picked cabbage. [ I did note to the manager I thought the noodles should be warm as well because they're really cold. ] I've not tried the breakfast, but I definitely will. Their coffee counter and juice counter is always staffed by the most enthusiastic friendly women (and unlike the lady with the bad experience, when I didn't care for something, the manager apologized profusely and immediately gave me something else and comped me). They have almond milk at the coffeebar which is appreciated and the juices are delicious. I highly recommend the Earl's refresher!  As others mentioned, they also have all kinds of gourmet treats, charcuterie, fromage and drinks, so it's a perfect place to assemble a gift basket (or just a gift!)  In addition, it's a quiet, spacious place with lots of seating (and free Wifi) so for me it's a fantastic place for a coffee meeting. It's kind of the \"not so common\" market.   I hope they consider opening a 2nd location!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 6
    },
    "photos": [],
    "user_id": "oInNoiunuDYWakwmvDiVVg"
  },
  "rhLVmYWEjKrrNezGDwEnqw": {
    "date": "7/17/2015",
    "text": "4.5 stars .. had a great breakfast biscuit with locally made chorizo sausage and egg .. good coffee, great little chill spot",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "saO8hjd5Dln5JzSMLFwkyw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/saO8hjd5Dln5JzSMLFwkyw/o.jpg"
      }
    ],
    "user_id": "Cqn_766h_JpQoV6fwizJhg"
  },
  "_Ctegve4lXwPbrVahSk7Bg": {
    "date": "11/1/2014",
    "text": "We discovered Earl's today and what a great find! Awesome little gourmet grocery/eatery with an awesome selection of unique products, made to order sandwiches and salads. Baked goods and coffee looked amazing as well! Really diverse array of wines and beers and great seating area in a modern but cozy atmosphere. Staff couldn't have been friendlier and were generous with the free samples. We will be back here very soon and very often. Definitely check it out!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LBhbjz0JHV3PDMhn41IDfQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Coffee bar and bakery in Earl&amp;#39;s!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LBhbjz0JHV3PDMhn41IDfQ/o.jpg"
      }
    ],
    "user_id": "n4-A5Bp_bzqdeknUcBiCvw"
  },
  "AUOs3Vmg1Mi6QSjcDx59fA": {
    "date": "6/27/2015",
    "text": "Have been a handful of times now and enjoyed it more and more with each visit. They do custom cheese boards to enjoy while you drink a bottle of wine, craft beer or coffee. They also have special events from time to time, including beer tastings and cocktail classes. They just started Sunday brunches.   The upscale item selection is pretty astounding (10+ kinds of bitters), but isn't really what keeps me coming back. It is the friendly service, affordable sandwiches and salads and great drink selections at retail prices that can be consumed on site.   Looking forward to stopping here even more once the streetcar opens in July. Hopefully it cools down enough for them to open their garage doors again!  Hope they extend their hours a bit more in the evenings and mornings. 7 AM - 9 PM please. :-)  Cheers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2tdU9vdKHFJ7Qh4A6cSVeA"
  },
  "0ku5ka1-kN9RbT0tYiXzEA": {
    "date": "5/1/2016",
    "text": "A friend recommended  Earls  for great  sandwiches  so I took  my daughter  and friend  for lunch  I had the # 6 Bowl / Beets, duck confit and an egg.  My  guess  is that they are trying to be different,  the result was a minuscule portion of beet gulash and a teaspoon of duck with a fried egg on top...maybe a slight bit larger than side serving. So as to not disappoint  my friend I kept  my opinion to myself. As for My daughter's  breakfast BLT ,I notice she was having a hard time with  it. I figured it was the fried green  tomatoes putting  her off , so still being hungry I thought  I would help  her out. It was then that I realized  that I could not eat them either. Being from the South  I guess  my expectations  were higher , but these were unedible, so 3 entrees and 2 teas and a drink for $45.00 later....... I like funky foods but they at least need to taste good and be of reasonable value.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lS9AaY_r_e-tSkis40AKgA"
  },
  "-6UIQfFci049_C7wBIhJhQ": {
    "date": "8/21/2015",
    "text": "One of my favorite food places in Charlotte. Great coffee and sweet treats, lots of good sandwich options, and their specialty food provisions are second to none.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GaJbIQXQ0HU3-Qzf06HolA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Latte and red velvet cupcake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GaJbIQXQ0HU3-Qzf06HolA/o.jpg"
      },
      {
        "img_id": "EAt0zZWM1OW_U-8Y_3ozvw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Pork belly ramen",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EAt0zZWM1OW_U-8Y_3ozvw/o.jpg"
      }
    ],
    "user_id": "Id_bRdA-uK8CpRjT8-JDaA"
  },
  "ihlw5dzfaR-vs155_WK26g": {
    "date": "8/19/2016",
    "text": "OMG. First time eating here. Tried multiple items. Everything was fantastic. You can only eat here if you are cool.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Cgl8z3L2RHaqRiAJFpnqg"
  },
  "xpoaGJ6qx6lNPRUbZb1i9g": {
    "date": "11/1/2017",
    "text": "This is a lovely combination grocery store and made to order market. We went for a Saturday morning breakfast. My husband and parents both got the breakfast wrap/burrito, which they enjoyed. I got the bagel with smoked salmon and an egg. I liked that my bagel came with salad on the side, but I thought the extra slaw they put on the top was a bit too much. It was as if they were trying a bit too hard. I would not let that one thing take away from the whole place though. I love the atmosphere and the different fresh and made to order options. It's a bit pricey, but that's not surprising for the atmosphere they present. My parents both got loose leaf tea and really enjoyed theirs. They have an excellent selection of teas. I also saw that they do catering and think from this sampling that they would do an excellent job.  We were going hiking so we weren't drinking, but I did get my eyes on one of their bloody Marys and they looked delicious! If we're ever doing Sunday Funday, I'll be back for one of those for sure. The outside patio is dog friendly, for us dog owners who love to bring our pets everywhere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-cztjZOhy366fUNmFpbZXw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Breakfast wrap",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-cztjZOhy366fUNmFpbZXw/o.jpg"
      },
      {
        "img_id": "v8m8WGQMRZuuinNK8qPhhg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Salmon open face sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v8m8WGQMRZuuinNK8qPhhg/o.jpg"
      }
    ],
    "user_id": "o2pZO42pH0_xXrcRYG31xw"
  },
  "q5W_3uOwRk9f6DxM5XWQ3g": {
    "date": "10/9/2017",
    "text": "It was our first visit. I didn't know what to expect and upon entering I was a little confused. It reminded me of an oversized area of a Harris Teeter deli/prepared food/bakery area with tables and chairs. There are different sections where you can order food and then they will bring it to your table. Not unless you are getting coffee, make sure you get your drink first, and your silverware and napkins.   We ordered the Korean chicken and waffles. It was very good, and it came with a small salad on the side. We also had the Banh Mi sandwich. It was also good. I am not a fan of pulled pork and that's the only option. I pulled off some of the meat because it was too much for my taste. Otherwise, it was good.   They have a bakery section with cookies and pastries and pies. My other half went for coffee and came back with the S'mores pie. WHY?!?! It was good, just too much chocolate for my taste. Overall, we will likely be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qss1G9PhuUlFzdOlUVXl0Q"
  },
  "AZXG9HUtHM5aNt5UdHF4Hw": {
    "date": "6/4/2017",
    "text": "I've visited several times at this point.  The staff on the hot grill are always so helpful in helping me decide on something great.  I've tried the grit bowl which includes grits, chow chow, and I added egg whites.....soooooo good!  The grit bowl is probably one of my favs here.  I've also tried the brisket bowl(brisket, collards, grits, egg white)....amazing!  For dessert I've tried the banana pudding and creme brulee and both are great.  There is so much to try here and usually 1 or 2 new items on the chalkboard daily.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "-GERXgZEbuWplc0hdN8C3g",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Banana pudding",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-GERXgZEbuWplc0hdN8C3g/o.jpg"
      },
      {
        "img_id": "fi3r-PGrsbb0PN_SI3MBng",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Brisket bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fi3r-PGrsbb0PN_SI3MBng/o.jpg"
      }
    ],
    "user_id": "9IRuYmy5YmhtNQ6ei1p-uQ"
  },
  "GvRaMSgEo3VEczUM4HdWiw": {
    "date": "2/22/2018",
    "text": "I was out and about in Charlotte on a Thursday afternoon. After seeing my Dr at CMC I needed a place to plug in and a recharge with lunch and a place to get some work and studying done. I yelped best places to study and this place came up. The reviews were solid so I headed there. I parked across the street and it was a breeze.  There were a few college students doing homework when I came in but the place was pretty empty. I placed my order and headed to the restroom. The restroom simply didn't fit with the space, it seemed like it belonged to a totally different facility. It wasn't immaculate and was kind of scary with flickering lights. Reminded me of something from a scene of saw. Positive of the restroom was the push door instead of a handle which is a pet peeve of mines. I had to get out of there! Once I walked out, cool...back in a nice serene environment  By the time I finished my order (turkey sandwich) was done. I had to walk past the counter so I grabbed it, found a table, plugged in and made it my personal space for 2.5 hours. I was comfortable and loved the scenery. Nice music played through the speakers which added to the ambiance but I pretty much zoned it out. At around 5:30 I started gathering my things to head out. At this time people where coming in and ordering wine and food. I would definitely like to come back in the evening and check the vibes. I loved everything about the place except the restroom. LOL. I will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "F3CNy3UTidOVtKG3YyWG3w",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F3CNy3UTidOVtKG3YyWG3w/o.jpg"
      },
      {
        "img_id": "L-LhBmd1MfpUFmyH7hI_Mw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L-LhBmd1MfpUFmyH7hI_Mw/o.jpg"
      },
      {
        "img_id": "alUNWX9Bi2bFPqVGT7X2nw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Turkey sandwich...really tasty",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/alUNWX9Bi2bFPqVGT7X2nw/o.jpg"
      }
    ],
    "user_id": "37FUZQAVQNT99CjxX3-hYQ"
  },
  "QsnQbJqKT6Qs8qBv6xJLLg": {
    "date": "4/12/2018",
    "text": "This place is awesome! Grab and go items, groceries, great biscuits, and even bloody marys! Makes brunch easy. I ordered a biscuit with bacon, jam,  and brie- a combo of menu items and they had no problems making it happen for me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vr-Rw3nMKIgGrVNT6A7p9g"
  },
  "Ivqln_yuZpeMpfkSADdlWw": {
    "date": "3/14/2018",
    "text": "Love this place! Such a unique variety of items... from lunch to bitters to craft cocktails. They host cool classes for cocktails and whatnot here and there. Oh and the desserts are AMAZING... just had a toasted S'mores pie earlier this week and it was one of the best things I've ever tasted.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-5Q56Z3K0ZpaDStmOPCt5g"
  },
  "LcF5V4k0YpCaLqBAaCMhGg": {
    "date": "10/5/2018",
    "text": "Beer wine cocktails specialty grocery. Inside and outside dining. On the trolley line #elizabeth",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vGfmQsi4HBPQikrhPIcLUg"
  },
  "MgRl5S4JBHD2mezy7Qzt6A": {
    "date": "5/16/2018",
    "text": "Still one of my favorites! Food is amazing, juices and coffee delish as well! I will most definitely be back! Probably tomorrow ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Mv61jl2VG04K20NYmxEBPw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Mv61jl2VG04K20NYmxEBPw/o.jpg"
      }
    ],
    "user_id": "gMB0_OdKhCFfSjM_occ76g"
  },
  "VDdlMHmz4A7lG0Wa0vb02A": {
    "date": "4/3/2017",
    "text": "I really liked this spot. Laptop friendly. Good for a lunch meeting. Yummy food, good sizes, good prices. They all have all sorts of great products in addition to what they make in house. Lots of vegetarian options. Wouldn't recommend bringing more than 4 people in. Definitely see myself becoming a regular here!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "p2RVDjAjqv2Ge-LozvQHvg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Carrot Tahini taco and jalapeño slaw taco, both with tempeh",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p2RVDjAjqv2Ge-LozvQHvg/o.jpg"
      },
      {
        "img_id": "fUtPpfsOYxi1yVyxVUvrNQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Delicious kale salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fUtPpfsOYxi1yVyxVUvrNQ/o.jpg"
      }
    ],
    "user_id": "T8fSuI8CXWOYZfgfm4QshQ"
  },
  "eG9PSM5hdlfEWcLyhkFnDg": {
    "date": "3/4/2017",
    "text": "So.Good.  So so good.  Always wanted to come here for lunch and I was soooo excited when I had the chance today!! Great location, great service and my salad (Mediterranean Salad with chicken) was huge and delicious.  I never felt rushed and my Hubs and I sat for two hours enjoying our lunch while sipping on mimosas.    I want to live in this neighborhood so I can come everyday.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "NeOIp8tz0kfxtmA8YUPmJA"
  },
  "NuJKX2zrNwrLMtab6PxzEw": {
    "date": "1/31/2016",
    "text": "Yepper,  I like Earl's.  Made a return visit today with Lori and she loved it,  too.  What a great place to uncork a bottle of French wine and inhale the fresh air with their garage door windows opened.  She ordered the duck hash and bragged all day how wonderful it tastes.  I ordered the steak & egg taco and the chorizo breakfast wrap (I was so hungry I hardly came up for air...so good).  I also discovered they will prep a chartreuse plate for around $20 including meats, almonds, figs, and three cheeses.  I'm already salivating about my next visit.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "hepHfTxG53CkX3vq4vuVfA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Rustic breakfast sandwich with ham and runny eggs.  Mmmm.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hepHfTxG53CkX3vq4vuVfA/o.jpg"
      },
      {
        "img_id": "mz3Kam6EDG6cVRriL-53Tg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. How to spend the afternoon with your best friend.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mz3Kam6EDG6cVRriL-53Tg/o.jpg"
      },
      {
        "img_id": "W9hVn7LVY3UXXoooIxAROw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. My humble cup of tomato bisque.  It packs a wallop of flavor.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W9hVn7LVY3UXXoooIxAROw/o.jpg"
      }
    ],
    "user_id": "CjHWRUKXhhley9N9NLS07Q"
  },
  "BSNASH6xUYdbeotb32i5yw": {
    "date": "6/30/2016",
    "text": "I ate the most amazing sandwich here for lunch and I owe it all to yelpers. The Bahn Mi Sandwich. The pulled pork was very juicy and tender and there was a generous portion. The sour daikon and carrot pickles along with the cilantro and aioli paired perfectly. It was so filling I was full after half but decided to finish it since the bread was getting soggy, not good leftover material. I was almost tempted to order one of the daily specials written on a chalkboard beside the counter and need to come back for those.  If you dine inside there are tables and a charging station inside. There are tables outside also. They will give you a number and bring the food out to you. I was in a hurry, so I ordered my food to go. Your name will be called when it is ready and they box and bag your food super conveniently. While I was waiting, I wandered around the store looking at the gourmet chocolates and candy they had on display. There are also salads, small sides, and dessert options boxed up. And a coffee bar. Also, a good selection of wine and craft beer. This place has everything.  Parking can be tricky during peak times - there are a few spots along the street right outside but not too many.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N185arXdggls2e3HBgcfYg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. bahn mi sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N185arXdggls2e3HBgcfYg/o.jpg"
      }
    ],
    "user_id": "TwCXV8ysdtRMEBU1gsOdUA"
  },
  "XJwlrp2V32w87PHix-FUHA": {
    "date": "1/18/2018",
    "text": "Tomato soup with grilled cheese was tasty. Staff was friendly. Unfortunately they got rid of the pork belly ramen. They have a cool variety of local NC products and other foods. Smooth coffee.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FyikYazQbNoOumDooOQyyA"
  },
  "WXjU5GByEqcbyw45iqUyCw": {
    "date": "12/3/2016",
    "text": "Quaint, hipster market. Not really impressed with the food. I rang the bell at the prepared foods counter and no one was around to staff it.   I ended up getting some pre-packaged hummus plate and hard-boiled eggs. The eggs had turned bad, and the hummus was lackluster.  I didn't get anything from the sandwich counter, but nothing sounded appealing. They need a breakfast burrito option without meat.  On the upside, they have bar seating along one wall with lots of outlets.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "yFqO3NGu5xHOo20Xs4JUjg"
  },
  "-K-wgut54mlUnzTzFf41jQ": {
    "date": "10/4/2015",
    "text": "I have been spoiled with endless choices and variety as a foodie in Charlotte, but Earl's is simply a category in its own. The only synopsis I'm able to give is it's Dean and Deluca's meets Not Just Coffee meets Amelie's.   Earl's has the diversity of D&C, the comfort and skillful brewing of Not Just Coffee and the enticing sweet treats of Amelie's. I would recommend the Ramen as the best in Charlotte, but the size is equivalent to a small bowl of side soup. I was expecting the giant bowl that I typically receive at Ramen places and simply wanted MORE! I found satiation in the warm comfort of a Chai Tea Latte, which melted in my mouth and was the best complement to a breezy Fall day; and ended my meal with a lemon bar to go (of course) that kept me happy for the rest of the afternoon.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 12,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "PQoS33ntageW41tbXlibVQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Dog of the Day",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PQoS33ntageW41tbXlibVQ/o.jpg"
      },
      {
        "img_id": "ErD0RYx959FO3f25trNNbA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Pork Belly Ramen! Delish but so SMALL :(",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ErD0RYx959FO3f25trNNbA/o.jpg"
      },
      {
        "img_id": "0NLyEJNnBJkLeh932yj3QA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Green Salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0NLyEJNnBJkLeh932yj3QA/o.jpg"
      }
    ],
    "user_id": "mgX7RiyezBMCTMIhNhUfaw"
  },
  "MAIOCvsRZFHAfdQXtInztw": {
    "date": "7/21/2018",
    "text": "I ordered the burger medium and while it looked beautiful, it was very rare. I spoke to the manager who was apologetic and had them whip up another burger for me in addition to assuring me that he'd reverse my credit card charge as a way of refunding my meal. The next burger came out well done and I never received a refund. May go back to Earl's grocery, but will never eat from that vendor again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GDx4hAHTSwc6h-f3IoDm6w"
  },
  "RUaa5iIbf1_PRNbyecf21Q": {
    "date": "7/26/2018",
    "text": "Crowded but nice  they could use someone to give newbies a tour because there are three or four  areas with different food. We walked around a little and decided to order from the center counter.  This counter had prepared foods that were all cold.  The young lady working the counter advised to pick out what we wanted and she would heat it up, microwave. We ordered and the food was delivered to our table by that young lady. The food was warm but not at serving temperature but we ate what was warm and took the rest to go. This is a very interesting place with things you wouldn't find elsewhere. But it is not for kids or seniors this is a True yuppie place. We were the two oldest people there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qD5DaWZ4LNXMCF1iWt1S1Q"
  },
  "bDUL_VXEgg0C38t2BWtbBA": {
    "date": "3/4/2017",
    "text": "Earl's Grocery may be my favorite new-to-me place in Charlotte. It's the perfect place to bring visitors who are ambivalent about what they want to eat. Want coffee? Done. A cocktail? Pick one. Charcuterie? That too. What about a filling meal? That's also covered. Seriously, it's a one stop for the finicky eaters. I also love the selection of adult beverages as well as fun choices for sodas, juices, and waters.  I may be mildly obsessed with the lamb burger. Perfectly cooked, and the toppings add to the flavor profile. The black bean burger is also very tasty. Try the peanut butter mousse pie. Outstanding.  Also, Charlotte's best ice cream just might be found at Earl's and it comes in a pint. Yes, they carry Jeni's! I've been looking for someone who carried that brand of ice cream for awhile now, and I've finally found it. Get the goat cheese with red cherries. You'll thank me later.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x4Z01d3Qze86FY2YKvdeDg"
  },
  "bW060s_XVsWuEKSrPLO_IA": {
    "date": "9/24/2015",
    "text": "Whether you're here for (admittedly overpriced) groceries or lunch/brunch, you're in for a treat! I love finding new grocery items you can't find anywhere else. For instance, just discovered they carry two flavors of Roots humus (coconut curry & mango siracha) that I used to bring back in bulk every time I went to Asheville because I could never find them in Charlotte. Their cheese selection is rivaled only by Orman's at 7th Street (but that requires a trip uptown). They have a lot of great deli items like premade sides, salads, rotisserie chicken, etc. you couldn't do ALL your grocery shopping here, but it makes great additions to and spices up your regular staples.   Now, let's talk about their food counter... Their daily specials are all to die for. Even their every day menu items are so, so good. I always have a hard time deciding what to get. A friend got their dog of day today with an all beef Nathan's hot dog, spicy peanut sauce, kimchi and jalapeno bacon. How good does that sound?!? I had the warm bowl -- one of my faves, especially on a cool day when you want some warm, comfort food -- with fried rice, kimchi collards and turkey meatballs. Be adventurous here. Get something that sounds a little wacky. You won't be disappointed! And, for the love, SAVE ROOM FOR DESERT!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "GE754FSIsohJyWLmQr3fFQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Warm bowl is totally my go to lunch on a chilly day!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GE754FSIsohJyWLmQr3fFQ/o.jpg"
      },
      {
        "img_id": "xQdIHvSIjpt3Ankiszq6Lg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Warm bowl with fried rice, kimchi collards and turkey meatballs. Perfect for a chilly fall day!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xQdIHvSIjpt3Ankiszq6Lg/o.jpg"
      }
    ],
    "user_id": "eVxYV4jI-618bnRCDniowQ"
  },
  "wdsISdUqg7QTUvgImiPdQg": {
    "date": "8/28/2016",
    "text": "Wonderful place to stop by in the middle of a long bike ride with The Lady. I love stopping by Earl's. Whether you need a quick snack, full lunch, a drink, local specialty items, or a dessert, this place has a huge selection of goodies for everybody. This particular time, I picked up the spicy black bean hummus wrap and The Lady got the morning gazpacho juice. Both were very well crafted; she was surprised by how well all the flavors went together. In previous visits I've ordered things off the menu, and everything I've had is just always so fresh and inventive. Very cool place.  Pro-tip: Bike Benefits gets you a free cookie :) Try the ginger molasses or the burnt butter chocolate chip. Mmmm....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "rSQITvDnm1smzJl-3LJz4Q"
  },
  "gjKhwWcedSvkF42tXbJknQ": {
    "date": "1/14/2018",
    "text": "The gem of Elizabeth. Thank goodness Earls is close enough to uptown for me to frequent this place during the week. The space is perfect for coffee dates, lunch and on occasion, a sweet treat (vegan/gluten free options too)!   A few of my favorites include: the bean chili, the Buddha bowl, the veggie burger, ancient grain bowl and the pre packaged hummus shareable.   In addition to the kitchen There's this amazing deli where you can find any food/side/main dish/salad/pasta/meat you desire to eat onsite or take home!   Grab a bottle of wine, a coffee from the barista or som Jenny's ice cream while you're at it.   This places doesn't disappoint. Thank you Earls for being Earls!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "O2P0wbH_vaPDNDecokW1KA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O2P0wbH_vaPDNDecokW1KA/o.jpg"
      }
    ],
    "user_id": "S_CeIOGlUspN3FIP028CcA"
  },
  "qhneO-M2drHgJ53AhjppOg": {
    "date": "6/13/2018",
    "text": "I cannot believe it took me this long to finally check out Earl's Grocery, but I certainly won't wait too long to come back. I came in on a Sunday morning and the place was poppin' with people. I was highly impressed with the atmosphere and the vibe of the place. I agree with the user who mentioned it is kind of like mixing Dean and Deluca with Common Market.   I had a breakfast biscuit which was really good and my dad had the turkey sandwich. He said it was awesome and he is a tough critic. They have a great selection of various sundries that are super unique and often local. They have a ton of different sodas which is always fun. I will be back for the food but also for gift ideas. There are a lot of really cool fun gifts for all different people in your life.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "dGUOe2TBchiGvU1BNkmTog"
  },
  "21R7nDIhG12e3qgQ_r-rDQ": {
    "date": "3/4/2019",
    "text": "A hidden gem on the trolley line to grab a bite before you a game or venturing uptown! Grab a prepared or order a handmade sandwich, grab a beer from the great selection and take some groceries to go! Area to sit and eat inside and outside on the street!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RWDZMPlz61PuER2fdipTKw"
  },
  "YCCxd0G8hahI0fTEAzXKWA": {
    "date": "1/5/2018",
    "text": "If you want a quick bite and or are looking for a healthy choice for lunch, I'd suggested this place. My mom and I went here for lunch one day because we heard it was healthy and good . Healthy and good sign us up because had started a date and wanted something good and different for a change.   My mom had a kale salad which had beets sunflower seeds and feta with a mushroom barley soup. I had the grain salad which had raw collards, 7 grain rice, roasted carrots and radish with guacamole. Both were delicious, I will be back.  I want to try the different items they have in the store as well as the coffee and or tea they have.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Q2NWCxP7bZJIrffX_m8tdg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q2NWCxP7bZJIrffX_m8tdg/o.jpg"
      },
      {
        "img_id": "eacRZrde2xIoOPEat-IDuA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eacRZrde2xIoOPEat-IDuA/o.jpg"
      }
    ],
    "user_id": "4jctgjQPheMcaRwheqrgwg"
  },
  "XL1id7Lao0BVPJXAmUyK0g": {
    "date": "11/22/2017",
    "text": "So after living here three years we finally made it over to Earl's which I had heard so much about for Brunch on Sunday. So if you didn't get it from the name it is a grocery store that has a pretty decent line up of food.  If you are looking for a low key weekend brunch place this is it! Order at the counter in the back but don't forget to decide on what you want to drink from the barista (at the front register) so you can order your food and beverages together in one order.  I got their breakfast tacos which come one per order and you can get them with flour or corn tortillas which I was super happy about since I think flour tortillas are just wrong! I got one taco and one of their amazing cinnamon rolls. Get a cinnamon roll if they have them you will not regret it.  We would have totally made it out of the place having one of the cheapest brunches ever if we had not been lured into the grocery side of it. They had Jenni's ice cream which is a pretty big deal and very hard to find along with a few other exciting items that ended up coming home with us.  I wish we had tried this place sooner:)",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 9,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "XFW6fsVwvuFNzQ4eAvwijQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Medium dark roast coffee with a breakfast taco",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XFW6fsVwvuFNzQ4eAvwijQ/o.jpg"
      }
    ],
    "user_id": "8pmxwY_nmXYBzKPa-klk3Q"
  },
  "OtLUzkWYEZC5ydesu39Cng": {
    "date": "1/1/2018",
    "text": "Wish Earl's was in my neighborhood. Visiting my daughter, and this is one of her \"go to\" spots.  Great bowls, sandwiches and more. And wish I could of bought stuff for my kitchen. Everything looked delicious. They support local business and had some spirits being sampled while we were finishing which was informative and fun.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "33l0Xq-CNwNKWG8yGhW9eQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Number 6 bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/33l0Xq-CNwNKWG8yGhW9eQ/o.jpg"
      }
    ],
    "user_id": "mswloq-IjRr9yXLhBqBPAw"
  },
  "GLfNAhHwoCKgjcI9S_5Kow": {
    "date": "1/15/2019",
    "text": "I found out about about earls grocery through walking through Elizabeth Avenue it's a trendy place to stop and get a bite to eat. I cane on a Wednesday at 11am had the biscuit sandwich, the biscuit was nice and fluffy. The price was pretty reasonable I would return. I recommend trying the charcuterie board next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Z5Pq5tMKzbXjATgXsKFFQ"
  },
  "ZYLJMsWQHns_xeh_nYrYUw": {
    "date": "5/28/2018",
    "text": "Always saw this place when I would come to other restaurants in this area. This morning I decided I wanted to try it. The atmosphere is really casual and gives you that local feel. Place was extremely clean! I ordered the pastor burrito and cleaned my plate in minutes. It was so good and fresh! I wanted to order another one to go. The staff was extremely friendly and my food came out exceptionally fast. If you're in the area and want a nice, fresh bite come here. You won't be disappointed!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OQt05VWxafPNVatn6X5kzA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OQt05VWxafPNVatn6X5kzA/o.jpg"
      }
    ],
    "user_id": "kDppjkN7xIgxunSLfhYjpg"
  },
  "pIgKhzjCESp0H2XD5VMjLQ": {
    "date": "2/13/2018",
    "text": "Attention business owners: Never underestimate the power of Yelp! After doing a few errands in the Cotswold neighborhood and needing some fuel, I searched \"Lunch\" on the 'ol Yelp App and checked out the bounty of options. A couple spots down the list I saw Earl's Grocery in the Elizabeth neighborhood, followed by raving reviews by several of my friends like Peter, Sheree, Christina, and more! So sure enough, this influence got me to leave Cotswold and run down to Earl's in Elizabeth without ever having tried it before...  ...and what a good decision it was! I'll be honest, Elizabeth is probably the area I know the least about in Charlotte despite being only a couple of miles away from my native NoDa 'hood. Besides the fact that the Streetcar runs thru here and CPCC students dominate the crosswalks, not much else comes to mind. What a shame on my part, all the past dining experiences in this area are such great memories. I'll start to work on familiarizing myself with this side of the QC ASAP.  The name itself, \"Earl's Grocery,\" may be a bit misleading. While they do have a limited selection of non-perishable goods and an extensive deli, cheese, charcuterie products, there's not much more to the retail foods section. The wine corner is darling with many quality brands in every type of wine you would think of. No, the real feature of Earl's isn't the \"Grocery,\" it's the menu!  The menu is loud, in your face, and has a lot of different cuisine offerings that are sure to have something for everybody. Something about the mysterious title \"The No. 6 Bowl\" caught my eye and I was even more intrigued about the description: Duck Confit, Beets, Slaw, Eggs and a \"TKO\" Sauce. Any place that's bold enough to put Duck Confit on the lunch menu has my attention, sign me up! It arrived at my table in a cool metal bowl in kind of a stacked fashion. First bite, succulent duck with plenty of luscious, delicious fat. Stay with me, yes I'm describing food here. This fat melded well with the crisp tartness of the slaw, which segued kindly into the delicate earthiness of the beets. A shade of spicy heat from the sauce enhanced the harmony even more. I'm finding tons of dishes with this masterful balance of flavor all over Charlotte and I'm glad to say that Earl's delivered yet another SLAM DUCK (see what I did there)!  Couldn't resist getting a small sweet bite. Over by the coffee bar is a diverse range of different pastries, brownies, cakes and pies. The cream  cheese brownie looked amazing and I wasn't disappointed. The brownie was a bit too dense and left a bit to be desired texture-wise, but the flavors were spot on. The cheesecake-like top had a nice browned finish and was as much velvety as it was delicious. A perfect, satisfying end to lunch.  Looks like Earl's is yet another enticing reason to visit Elizabeth early and often.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 10,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "fKMvLso3HI5mDDqkdrmaag",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. No. 6 Bowl and a Pork Belly Taco. It&amp;#39;s so good I wanna see bowls 1-5.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fKMvLso3HI5mDDqkdrmaag/o.jpg"
      },
      {
        "img_id": "g572n7x1Rd24uMDrNoVfRQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Unwind and recharge. Earl&amp;#39;s sounds like a good choice for lunch.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/g572n7x1Rd24uMDrNoVfRQ/o.jpg"
      },
      {
        "img_id": "szSgZBF2w-ji3cHl_0fUzA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Unwind and recharge. Earl&amp;#39;s sounds like a good choice for lunch.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/szSgZBF2w-ji3cHl_0fUzA/o.jpg"
      }
    ],
    "user_id": "dpzAqLprtex54rXlCU-OTA"
  },
  "Z49RGbLvhaOKqyDJoihXCQ": {
    "date": "11/14/2018",
    "text": "My first visit was meh.... but I came back and lll tell you what. The coffee. The pastries. The food = ALL AMAZING go there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NCLgAeogZNodK7PEGjQ46A"
  },
  "RTskoXmV4FN1CQSc1qEwzA": {
    "date": "4/20/2019",
    "text": "Bahn Mi was excellent. Ton of pork, and the baguette was prepared just right. Will be back soon here soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uXEa69c_gHsQu5E9BRj2Xg"
  },
  "K2thExBWugafX7favrNLGQ": {
    "date": "10/26/2017",
    "text": "Modern grocery and deli in the Elizabeth Ave. Shops, next to Piedmont Community College.  They have various sections inside the small, hipster-friendly grocery store for baked goods/ coffee/cocktails, cheese and charcuterie, frozen items in the case, wine section, bartenders shelf with several bitters and many other accessories, and various other shelves with local and regional products.    I picked up one of my favorite root beers (they have about 8-10 to choose from in the cold case), a fudge brownie and a Cocktail Kingdom fruit peeler.  Service is friendly, ample seating up front by the street.  They do ask you to move to the benches along wall or glass front during lunchtime if you're just hibernating in front of your laptop.  There are 2 entrances, one along front sidewalk, one in the rear by the restrooms, leading to the parking lot.  Yes, some of their items are pricey, like the gourmet pints of ice cream which range from $8-13 for the most part.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-oNDn77gAtovc99GmmeBdw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Delicious brownie and tasty root beer.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-oNDn77gAtovc99GmmeBdw/o.jpg"
      }
    ],
    "user_id": "hFJgRL0m1i1XFXVu7YxGTw"
  },
  "dkSDLon-tDsMGkhVGp5wqw": {
    "date": "10/21/2018",
    "text": "Loved my superfoods salad (kale, Brussels sprouts, quinoa, carrots, cranberries, pecans) and salmon.  Enough for two meals.  Relaxing setting with lots of local hot sauces & jellies plus lots of wine choices.  My first visit but I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wklmU8CM7czQQBuhOC4k9A"
  },
  "kY1DwCeGY_Z2yijfbZMuEA": {
    "date": "10/2/2017",
    "text": "Been wanting to try this place and it didn't disappoint. Reminds me of a more expansive rhino market or common market. Great selection of food and drinks.  I preferred their Cuban sandwich. It was a nice big size and tasted great and flavorful. They had somebody providing samples of products and staffed seemed informed on everything that they had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YScHoKFwx2cZdpMIelsjew",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YScHoKFwx2cZdpMIelsjew/o.jpg"
      }
    ],
    "user_id": "SGTH6vBZibuM6FmzTFiqHw"
  },
  "nnICreT1TOZhXG75cdIpPg": {
    "date": "10/18/2017",
    "text": "Funky and cool eatery near the center city.   Like a grocery and deli and restaurant all in one.   Huge variety of food selections and spreads and cards and napkins and fun gift items.  I ordered the Harvest salad which was filled with pumpkin seeds and beets and greens and pickled onions and shredded chicken.  It was really yummy.   Fun place and I look forward to returning!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "yhvGpmWy0GpBvJ7OeZeaeQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yhvGpmWy0GpBvJ7OeZeaeQ/o.jpg"
      },
      {
        "img_id": "uu3VnsJ7NEo3blegbAB-IA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uu3VnsJ7NEo3blegbAB-IA/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "KGknHRSJBlZKKAxYFD-S4Q": {
    "date": "5/28/2018",
    "text": "On a cloudy day. Earl's Grocery was the sunshine to start my day. Found this dope and tasteful place on yelp just looking for a breakfast spot. Found breakfast, lunch, my natural ginger ale,  a wonderful and hardy grit bowl. It was a great blend of flavors and a first time for me. Pork belly! This is a great place and has any and everything you would need or want when it comes to food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MZRGkN9dS9uNRRmUvl14gQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MZRGkN9dS9uNRRmUvl14gQ/o.jpg"
      },
      {
        "img_id": "1CI5Zi14TBiX88RfP7fImA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1CI5Zi14TBiX88RfP7fImA/o.jpg"
      },
      {
        "img_id": "oP2EDHQtJFkKc7HldOMOgg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oP2EDHQtJFkKc7HldOMOgg/o.jpg"
      }
    ],
    "user_id": "qxsZVBR1AEuMStHxr3UQjQ"
  },
  "XwHDRRGbrZqNnadboEykAQ": {
    "date": "11/6/2017",
    "text": "Charlotte needs more eatery/grocery/buy fresh/buy local combinations such as Earl's.  This is my go-to stop after I land in Charlotte after being on the road for a week-plus, because, simply put, I can get a little bit of everything, since I have the weirdest cravings when I land, and my fridge is always pathetically empty, and one must fuel up before actually heading to the grocery store, if the energy is there.  Great wine selection, cheeses are actually, really well-priced...great accompaniments.  Awesome telework space with plenty of outlets and of course, coffee. Not the best for phone calls because it gets real loud but if you need some good energy and vibes and can't deal with the quiet of your own home for too long, head to Earl's.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7kgmDR7So2cNJ5U00ImVGA"
  },
  "xS_smCapz5Q4_TVvheaH-A": {
    "date": "3/12/2017",
    "text": "Why haven't I been here sooner?!? Came over on my day off for a late breakfast and already have plans to go back this coming week! I'm pretty sure most everything they serve is locally-sourced or made in-house. Also serves as a market with wine and beer, meats, cheeses, bakery, the whole nine yards  Just coming in for a late breakfast I had the sausage and egg biscuit with an iced coffee from Pure Intentions. The biscuit turned out to be huge! The sausage was handcrafted and delicious, the scrambled egg was fluffy and delicious, the whole thing was just awesome and delicious. Of course you really can't go wrong with the Pure Intentions either.   Earl's Grocery may be a hidden gem, or maybe I'm just showing up late to the party. Either way, definitely going to be partying there again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KYkKCXWp746dlSE0xiJ4_g",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Handcrafted sausage and egg biscuit with an iced coffee from Pure Intentions Coffee.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KYkKCXWp746dlSE0xiJ4_g/o.jpg"
      }
    ],
    "user_id": "zdJ5RyU4nUWj8bceNxLrZg"
  },
  "Mez59TSBB7-fFvXLWDjaXQ": {
    "date": "1/27/2019",
    "text": "I wasn't much on the atmosphere at all. We tried a couple of sandwiches.  The chicken salad sandwich was different it had mustard on it.  The Philly cheese steak was odd not what I'm looking for at all in a Philly.  My favorite was the cauliflower and potato puree.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BoFluR8klYg01euXk9MO7A"
  },
  "ik1ldZOZnmoOLSHGR7IAag": {
    "date": "10/23/2017",
    "text": "If there is time to take a real lunch break, Earl's is one of my favorite go-tos. There is always so much that I want to buy! In addition to their rotating menu of salads and other entrees, there is plenty to browse between the cheese case, wine & beverages section, and shelves of assorted goods.  From their lunch menu (which again, constantly changes), some of my favorites have been the Harvest Salad, Buddha Bowl, No. 6 Bowl (grilled beets & duck confit), and a couple of their sandwiches. It's possible to get overwhelmed with the sheer amount of options here, but this grocery adventure is a pleasant mental break from work or school.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iU2zdBnpWnzwvkAxlFx4xA"
  },
  "HFbJn2F-4oO-luxfGi4U7w": {
    "date": "9/19/2014",
    "text": "This place is great. Wonderful staff and selection of adult beverages. We requested for the windows open and the owner happily accommodated our request. Plan on going back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4VKr0fxELiofLJcosDBbQ"
  },
  "F1TxZG8wqaoOOEl7Xq7hjw": {
    "date": "4/14/2019",
    "text": "I have been coming here for years and it never disappoints.   There are no bad dishes here. Whether you're ordering from the daily menu or from the pre-made dishes from the case, you're sure to be satisfied. The variety and creativity keeps you interested and coming back for more.   The grocery side of the name provides a little bit of everything. Wine, beer, cheese/crackers, coffee, desserts, and fun whimsical knick knacks.   The garage doors up front allow lots of light and despite being inside, they give the feeling of being outside. On a nice day, it's awesome when the doors are open. On nice days when they're not, there are some outdoor tables to enjoy as well.   The staff here are always friendly. They seem to really like working here because the turnover is not high.   Prices are reasonable. This is a specialty store, so don't expect a bargain. However, you are paying for high quality goods.   If you've not been yet, definitely check out this Charlotte gem in the Elizabeth neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ir8HD2v8YoL-bZfP8y7B0A"
  },
  "s9OR5TeDtLSeqJzeLKrg7A": {
    "date": "8/11/2019",
    "text": "Earls is a very cool establshment.  It has higher end groceries albeit limited, but I didn't come here to shop.  I came for the served food which was very good.  They offer a variety of sandwiches and salads.  They have breakfast too but that will be for a future visit.  They also serve coffee and juices, and a variety of baked goods.  I really like the atmosphere too; its sort of rustic with a good amount of seating.  You order at the counter, are handed a number, and then you wait for a reasonable amount of time it seems to enjoy the good food.  If you're in the area give this place a whirl!",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "l1srdS2CH7hOU8mJlUYxxA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/l1srdS2CH7hOU8mJlUYxxA/o.jpg"
      }
    ],
    "user_id": "P14bqC_Ynbp8O3tLePRKSw"
  },
  "6rwDM7QryQ0OaORrX13XyA": {
    "date": "1/9/2019",
    "text": "This my favorite place to grab a bite in my neighborhood. They have a little something for everyone here - beer, coffee, wine, breakfast, lunch, baked goods - you name it. There is a huge parking lot across the street and also street parking. It's rare to find a neighborhood in Charlotte this close to uptown with no parking issues.   I love coming here for brunch on the weekends and for a quick dinner on weeknights. They have quite a few vegan and vegetarian options which is a big sell for me. My go to for dinner is the grain bowl which is full of whole grains and vegetables and is super healthy. I have a harder time sticking to healthy options when I go for brunch because who can say no to pimento cheese grits??  This is a counter service restaurant so you can count on eating pretty quickly. This is also a good place to grab a coffee and bring your laptop during the less busy hours- they have a counter with outlets to charge your devices. They also have prepared foods that you could grab to take home for dinner. I highly recommend this place if you are looking for a super delicious causal meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-zWP0GJ3Gcj9VmgaBJGOPQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Pick Up The Tempeh",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-zWP0GJ3Gcj9VmgaBJGOPQ/o.jpg"
      },
      {
        "img_id": "iFMnVPxSZ58E91NP7flSkg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Grain Bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iFMnVPxSZ58E91NP7flSkg/o.jpg"
      },
      {
        "img_id": "ETHzW9V8UZ2fw7kznA2Ncw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Daily Special",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ETHzW9V8UZ2fw7kznA2Ncw/o.jpg"
      }
    ],
    "user_id": "dPxR3kJmlX6mAYGyAWheOg"
  },
  "64XCogp1LnHfameZF3V90w": {
    "date": "8/19/2018",
    "text": "This place is one of my favorite urban markets. The coffee drinks are high quality espresso as well as pure intentions cold brew. The beer and wine selection is local as well as diverse. I've ordered a few of their prepared foods from the register aged case and have always found everything to be fresh and well made. Prices are fair. My favorite thing about this place though is their food menu made to order. I pretty much always order the harvest salad which has roasted beets, farro, and other yummy toppings in addition to a citrus vinaigrette.   You can take the free trolley from uptown or they have their own parking lot across the street. Street parking may also be an option. I've also never had a problem getting a seat in here. It's definitely worth a visit if you've never been!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "PutPbk26aAakAjeaA8YXAQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Egg and cheese biscuit",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PutPbk26aAakAjeaA8YXAQ/o.jpg"
      }
    ],
    "user_id": "azpZPrb02xWYI_S0MYfIGA"
  },
  "P1pjGSUl6STAZ-1mVoEYVg": {
    "date": "7/28/2018",
    "text": "Interesting menu and selection of Cheeses and Meats  My wife had Cataract Surgery and we had to drive down to Cotswold for the Post Op follow-up Surgery turned out great and while we were down, since we are not normally in Charlotte mid-week early, this afforded us the opportunity to give Earl's a try.  Been on my list of places I wanted to try and finally got a chance.  At 10 am, not much trouble finding a parking spot and at the same time, the street car runs right in front of it.  Walked and took a minute to figure out the routine but after that, everything went smoothly.  You go to the second counter to place your order and that is also where the large menu board is as well.  My wife had already decided based on the one line menu that she wanted the Breakfast Biscuit which is a home made scratch biscuit available several different ways. She chose the Ham, Brie and Apricot Jam and I must say, it was appealing. She indicated that it tasted as good as it looked.  I went with the  Rustic Egg Sandwich which was eggs, Swiss Chhese Mustard and Grilled Whole Wheat to which I added Bacon.  Excellent indeed.  The coffee was excellent as well. A nice rich dark roast full of flavor and very fresh and hot.  While we waited for our Breakfast, both of us took time to look through the store at the various provisions they offer.  I was very impressed with the great selection of Cheeses on hand.  If we were going straight home, I probably would have bought some to take home.  Nice and clean and the staff is very professional and friendly.  Definitely a place I will make a point of going again if only to try the lunch menu.  On the Holiday Menu, there is a Turkey I am looking at for Thanksgiving that looks interesting.",
    "rating": 4,
    "rated": {
      "funny": 12,
      "useful": 34,
      "cool": 21
    },
    "photos": [
      {
        "img_id": "m27b9lRbp--ucPCzm5wAnw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Looking to the Cheese Counter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/m27b9lRbp--ucPCzm5wAnw/o.jpg"
      },
      {
        "img_id": "3ZU82Hm3t5owna9vGRENfQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Rustic Egg Sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3ZU82Hm3t5owna9vGRENfQ/o.jpg"
      },
      {
        "img_id": "xyeE5g6vy9KN7-hGdqts2A",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Breakfast Biscuit with Ham, Brie and Apricot Jam",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xyeE5g6vy9KN7-hGdqts2A/o.jpg"
      }
    ],
    "user_id": "GGTF7hnQi6D5W77_qiKlqg"
  },
  "SGF3yQjMMSkpcT-gZ1mI7g": {
    "date": "7/6/2018",
    "text": "In the neighborhood for lunch, Earl's Grocery fit the bill. A nice market of interesting and unique micro products to browse while waiting for your fresh sandwich to be prepared and a huge cooler of different and unique drinks, plus a number of local micro brews if you're so inclined.  I had the \"Back Porch BLT\" today and was seriously impressed. Jalapeno bacon, pimento cheese, fried green tomato pickle, lettuce, Duke's mayo on grilled sourdough. Terrific crunchy texture, perfect bacon and a lovely firm sourdough. Perfect sandwich, absolutely.  Definitely need to get back to Earl's. I can completely see why this is one of the Top 100 on Yelp in Charlotte. Awesome.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 11,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "7yha6hFw0LEH-MONM7LwNA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Side view of the Back Porch BLT at Earl&amp;#39;s",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7yha6hFw0LEH-MONM7LwNA/o.jpg"
      },
      {
        "img_id": "DiXrac0ziLwyXq-4jtd_cw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Today&amp;#39;s menu at Earl&amp;#39;s Grocery",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DiXrac0ziLwyXq-4jtd_cw/o.jpg"
      },
      {
        "img_id": "le0Z6jlTLI2B_qiwXlwcYw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Cheese bunker at Earl&amp;#39;s",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/le0Z6jlTLI2B_qiwXlwcYw/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "GCM9EUN0XCcmMluqD2sCEg": {
    "date": "7/10/2018",
    "text": "My wife and I split a grass-fed cheese burger ($9) and a Harvest Salad ($12) topped with pulled chicken. The salad was huge and was comprised of raw kale, beets, pickled onions, pumpkin seeds, sunflower seeds, and sliced avocado. Very satisfying and very healthy.  The burger was nicely prepared all the way down to the buttered and toasted bun. Of course we couldn't leave without dessert and a coffee. The gluten free brownie, ginger cookie and latte were all superb.  Menu is eclectic mix including such options as soft tacos, sandwiches, and even, Banh Mi. Service was adequate and sanitary rating was an exceptional 98. Ample seating is located in front and back, and out front along sidewalk Nothing really blew us away but, based on the other Yelp reviews alone, I'd say it's definitely worth a try. If we lived closer, we'd probably try it again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "k9jzi2yPgIFCzlfOLwOYFg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Outside seating.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k9jzi2yPgIFCzlfOLwOYFg/o.jpg"
      },
      {
        "img_id": "qm36XN3aoAUEB_bOsxLPYg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Desserts!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qm36XN3aoAUEB_bOsxLPYg/o.jpg"
      },
      {
        "img_id": "O5nsx2yVv-PA-TG2KXAf2Q",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Harvest salad with chicken.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O5nsx2yVv-PA-TG2KXAf2Q/o.jpg"
      }
    ],
    "user_id": "HFFiM63x9asevqVOZG5GBQ"
  },
  "bg9tUlfL1xoRko-J42RGTQ": {
    "date": "1/15/2019",
    "text": "Earl's is not your regular neighborhood grocery store. It is so much more! Earl's serves breakfast and lunch. The menu items are far from standard (e.g. nicely apportioned rice bowls). You will not find \"the norm\" here. They have an assortment of desserts, wines (by the bottle and the glass), beers (locals galore), and much more. You can sit, eat, drink, and chat at Earl's for a couple hours or more. I enjoy visiting to peruse the menu and to enjoy the monthly spirits event with Bob Peters. I must remind myself not to eat before arriving so that I can personally delve into the menu. Service is great. Staff members are helpful and knowledgeable. Your experience will be grand!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LDI5d8VKiVmflIJ8gUwLHw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LDI5d8VKiVmflIJ8gUwLHw/o.jpg"
      },
      {
        "img_id": "Q0qfwYQuuDUBVj7-onULfQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q0qfwYQuuDUBVj7-onULfQ/o.jpg"
      }
    ],
    "user_id": "7PiRdxYF-Uvzn2fHqdtU1Q"
  },
  "R8OreIe72w4alKP-ZO0u9g": {
    "date": "8/18/2018",
    "text": "Super trendy spot. The food is always amazing; whether you go for lunch, dinner or brunch. They have great coffee and tons of choices for drink.   We went for breakfast this morning and had the grit bowl and white Lilly biscuit with ham, jam and Brie. Both were so delicious. Loved the pimento cheese grits with the chorizo. And the coffee is so, so tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RJI5VY01sZjoZ4YKbrijtQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RJI5VY01sZjoZ4YKbrijtQ/o.jpg"
      },
      {
        "img_id": "us3tgUnhRFRQRf7RQqyDMQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/us3tgUnhRFRQRf7RQqyDMQ/o.jpg"
      }
    ],
    "user_id": "VmS5zUnuAOQn4AEz9S2xIQ"
  },
  "dkDT854nitiuYJavxpazXQ": {
    "date": "1/31/2019",
    "text": "Earl's is the bomb! We regularly make the 10 minute drive to pick up dinner to-go, and Earl's never disappoints.  Their deli-style cases contain tons of amazing prepared dishes, from street corn salad to lemon orzo to vegetarian lasagna. Our favorite thing to do is to pick 3 or 4 dishes from the case to share for dinner! You can order the dishes in a variety of container sizes, depending on what size crowd you're feeding.  We've also eaten off their made-to-order menu, and I've been similarly impressed! Goose really loves their tacos, so I'll plug them here. I have to tear myself away from the dessert case each time I'm checking out -- they look seriously delicious too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hh1M-3aDJZVTwwYYy9AnA"
  },
  "_VzLt6CJxQwXKMc8GiymGg": {
    "date": "7/30/2018",
    "text": "Earl's is a great place to stop and grab a quick bite to eat. The vibe feels very modern yet casual, with an exposed ceiling, a collection of tables gathered near the huge windows at the front, and stainless steal refrigerators and displays offering tantalizing meals of a variety of cuisines. Yum.  My friend and I came here around 2:00 on a Saturday for a late lunch and it was surprisingly fairly full of patrons given the later time of day. A foursome a few tables over we're sharing a bottle of wine, and two young families next to us were also grabbing a late lunch. I had the chicken salad wrap with was delicious with the grapes, ample greens, and large chunks of walnuts. A bit pricey for just a wrap ($7.99, no drink or side), but I'm not complaining too much. I'd definitely come back for another!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L3-1ZturOME7eqwZ15V2rQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L3-1ZturOME7eqwZ15V2rQ/o.jpg"
      }
    ],
    "user_id": "kkdNZ7XhSf8lEdKA3EqGkg"
  },
  "KS50iRkajfnZH9bjmNxJlA": {
    "date": "6/15/2018",
    "text": "I had super high hopes after reading so many great reviews of Earl's Grocery. My husband and I came here for lunch on a recent weekday. We easily found parking, which was nice. In general, the service wasn't great and no one was super friendly. In fact, when we went to order, my husband greeted the employee by saying \"Hey. How are you?\" The employee mumbled back \"good\" and then stared at us to signal that he was waiting to take our order.   I ordered the Poke Bowl and he ordered the Grilled Pimento Cheese sandwich. We also shared a slice of apple pie. The breakdown:  Poke Bowl - it arrived steaming. That's right, steaming! The rice was piping hot which in turn, heated the entire dish. I didn't love that. Plus, there was no seaweed as advertised but instead there was a ton of lettuce. I was, overall, unimpressed and didn't eat all of it.  Pimento Cheese Sandwich - my husband loves grilled pimento cheese sandwiches! If it (or fried chicken) is on the menu, it's an automatic for him. He liked the tomatoes on this sandwich and the amount of pimento cheese, however the bread was too thin for the heft of the sandwich and it all kind of fell apart after his first bite. He said he liked the sandwich, but agreed that the bread should've been sturdier.  Apple Pie - tasty but unmemorable. I asked if we could get it warmed up and was told \"it is refrigerated\". We both agreed that it would have been better warmer.   I want to love this place and we agreed that we would give it another try, but would definitely order different items.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uqCITxm_rDKE84E9Md_ohA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Cold apple pie",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uqCITxm_rDKE84E9Md_ohA/o.jpg"
      },
      {
        "img_id": "a1RYYCEDrK9QI3I4odkYKg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Pimento grilled cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/a1RYYCEDrK9QI3I4odkYKg/o.jpg"
      },
      {
        "img_id": "a6OBzqnPaaTsAfQPgn3DXg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Poke Bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/a6OBzqnPaaTsAfQPgn3DXg/o.jpg"
      }
    ],
    "user_id": "QGKOTCbS-gpAMWPADGmf0w"
  },
  "LP7qDYdrZ30EzPBXWULX-Q": {
    "date": "11/20/2018",
    "text": "This place is really great but kind of confusing on ones first visit.  The confusion begins with the name!  This place is by no means a grocery store.  What is it?  Good question. First, it's s coffee shop.  The first station near the left front entrance is where you can Ofer coffee, tea and associated drinks as well as pastries and the like. Deeper inside there is another station where you can order gourmet sandwiches (mainly hot) and pay for them. There are plenty of tables and stations where you can eat at or take it to go. In the center is a third station with all sorts of gourmet meals and sides.  I particularly like their risotto cakes and duck confit.  My father enjoyed salmon with a side of super salad.  If you want to eat at the restaurant they will heat it up for you.  It seems like more people get it to go though.  The people working there are very nice but it is kind of inconvenient that you need to pay for these items at either of the two previously mentioned stations.  This is also a cheese store with a vast variety of cheeses and charcuterie and they will make platters for you if you request in advance.  There are refrigerated coolers around with s large variety of specialty sodas, beers, lemonade and other juices. There are also a few display areas with ore measured salads and sides and a few  other items spread throughout the establishment. The prices are high but so is the quality!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pxqR59X10Qar0sRHw9H-4w",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Great duck confit and sides.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pxqR59X10Qar0sRHw9H-4w/o.jpg"
      }
    ],
    "user_id": "0--UDi26tOq3K6KmuQtKvA"
  },
  "yVp94u1eRsTb8WRNWKvHeA": {
    "date": "10/16/2018",
    "text": "If we were to play the comparison game, Earl's Grocery is the older, more sophisticated, has-a-brownstone-in-the-city relative to say, Common Market's too-cool-for-school vibe.  At Earl's, you can order made in-house alcoholic bevvies such as margaritas, coffee/tea, hot breakfasts/lunches made to order, purchase deli items by the pound, and browse their wine selection.  It's a one stop shop for any of your specialty grocery/food needs. Once I came here for a certain Jewish pastry and they had it. I would truly rely on this place to help curate a dynamite charcuterie platter to impress friends/family for the holiday season.  Speaking of holiday, they are now taking orders for any of your Thanksgiving needs until November 20th. Furthermore, they sell cartons of Jeni's ice cream but they're sold a HIGH premium - this is your warning. You can also pick up greeting cards based on occasion.  They have indoor and outdoor seating that make it a great spot as a solo work spot or casual coffee date. A quick note about their coffee: it's GOOD. Seriously, order yourself a cup and sip slowly.  The designated parking lot is located directly across the street and I've always found a spot. If the lot is full, street parking is also available.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "SBi0TYUSIrct8WSTyK6DFg"
  },
  "VIp5qC6Dnu4Z2I2UZup26g": {
    "date": "11/12/2018",
    "text": "I typically pop into Earl's for a latte before I head to the Paul Mitchell School. I noticed I haven't updated my review but I finally made it back and had time to try Earl's for lunch. The bahn mi is huge and totally worth it. I wish I'd brought someone to split it with but what can I say? I was alone, I finished the whole thing myself. Whoops. I'll be back again next time a pulled pork cravings hits.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "777OFewb2qwp4LAX20Yq5w",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Banh mi sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/777OFewb2qwp4LAX20Yq5w/o.jpg"
      }
    ],
    "user_id": "mcJ-A0OGmiWZGBbdWPMfrw"
  },
  "y5kaJpCTHq6_DRcYKYmPbQ": {
    "date": "1/8/2019",
    "text": "I love Earl's so much! I've never actually shopped there for groceries or food to cook later, as I don't live in the area, but we've gone twice for a weekend lunch when we wanted to do something a little healthier.   This place is mostly counter service, but it has plenty of tables to sit at. There's always a nice energy to the place...it can be a bit loud and chaotic when full, but the vibes are still good. I had a chicken salad wrap on my most recent visit. The chicken was flavorful, and the Dijon sauce paired really well with it. You can even get breakfast cocktails, if you're so inclined (mostly basic fare like Bloody Marys and mimosas). The servers are also very accommodating if you want to do something like get your sandwich on a sad bed of greens rather than the DELICIOUS BREAD it rightfully should be on. But we all understand. New year, new you.   I will say that you should probably sit on the picnic-style benches with caution. On my last visit, I accidentally launched another person into the air when I stood up because of the angle where he was sitting on the other side. Not my finest moment, and definitely a sign that I should probably be asking for that bed of greens instead of the aforementioned delicious bread. Regardless, I'll be returning to Earl's in the future...and hoping I don't run into that guy or catapult him into the air again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TLkPHRJX9yCJhy1kQXTe5Q"
  },
  "-_GaII9oGozPi_Q0RTodiQ": {
    "date": "7/7/2018",
    "text": "I know I'm in the minority when I say this, but Earl's Grocery is just ok.  There are plenty of tables for seating, and they play great music, but the food wasn't as good as we hoped it would be.  We stopped by one Saturday for breakfast.  I had the Baja burrito, and my husband had the Pastor burrito.  The Baja is meatless, was served slightly cold, and had too much sweet potato.  The Pastor was filled with chorizo and hotter in both temperature and spice, but we weren't sure it was worth the price ($8.99).    On a positive note, their cappuccinos were some of the best we've had from ANY local restaurant.  And the service was very fast.  I'm just not sure we'd return based on the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yL4whR1Qb63FptG9IVRdVQ"
  },
  "YaV0sUyC6_Z3dOEW_pFpyg": {
    "date": "5/1/2019",
    "text": "Loved walking into this place. A bit like a more reasonable version of Dean & Deluca. Got the cheeseburger for the first time. Bun was a bit huge but tasty. Loved the quality and was a good size. I think it had bread n butter pickles on it. Yum. Got some Sweet Onion chips too. But the atmosphere is great. Just ate and people watched. Hope to get back soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VHq5-cn5VsyrVqg1czI5Aw"
  },
  "UCZMSLnPaaAksibV7Fx8bg": {
    "date": "4/27/2019",
    "text": "Stopped for breakfast, the staff was friendly and accommodating to our special requests. The food was amazing!!! Neat place, lots to see. Very cool beer selection if you like craft beer. Would definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FMg9DXoNX0lNTVyMmOFf7g",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Morning Scramble: Garden with eggs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FMg9DXoNX0lNTVyMmOFf7g/o.jpg"
      }
    ],
    "user_id": "tt5aOb4Wryh1AGlDwG0Vzg"
  },
  "GqiKR7IUY55-Ifm_T7d9Gg": {
    "date": "2/22/2018",
    "text": "This cute cafe (from the owners of Carpe Diem Restaurant a few doors down) also serves as an artisanal market. Great place to pop in for coffee, eat breakfast or lunch, or do some local food shopping!   The prepared breakfast and lunch items can be hit or miss. The egg biscuit is always a safe and tasty one, as well as their French toast, grilled cheeses, and tomato soup (very flavorful). I've seen people get the salads, which look like they're a good size, but i have not tried one yet. The desserts and pastries here are very tasty! The s'mores pie is a classic favorite, of course -- with the toasted marshmallow on top.  I love their commitment to unique food items. Besides their pre-prepared side items, entrees, and to-go sandwiches, you can get unique things like roasted coffee from Charlotte, Rosemary crackers made in Asheville, a package of Cali's Hot Little Biscuits from Charleston, spicy honey from Durham, etc. The possibilities here are enormous for such a small restaurant/market.   Another one of my favorite things about them is their cheese selection. There's a huge selection of near and far cheeses that are great for making your own charcuterie board! If they make it for you it can be a little pricey, so don't be afraid to get creative on your own!  Pro tip: Space inside is limited, so be careful going during peak times.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P5XTLOREby3DHKGwSYqwWg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Inside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P5XTLOREby3DHKGwSYqwWg/o.jpg"
      },
      {
        "img_id": "TtlLLtpe5_YViEIAVDUQZg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TtlLLtpe5_YViEIAVDUQZg/o.jpg"
      },
      {
        "img_id": "QOy3n3S4zES62ECE8u6d1w",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QOy3n3S4zES62ECE8u6d1w/o.jpg"
      }
    ],
    "user_id": "8JiNjuhu1J45St3mEoQCfg"
  },
  "WcADbrRbhB5IR88CEFBNOg": {
    "date": "3/29/2015",
    "text": "This was my first trip over to Earl's. This place was recommended by a friend and I was on that side of town for the day so I thought I would give it a shot. It's a small, modern looking place with great energy. I was there at 1:30 and the place was packed. This is always a good sign. I will agree with previous reviews, the place  is like a Dean and Deluca or Reids, trendy and pricey.   I was told to order the Banh Mi. No objects there. Vietnamese food is my absolute favorite!  Sadly for me Earl's version of the Banh Mi sandwich missed the mark. What a bummer considering I paid $9 for one sandwich.  The sandwich itself  was very pretty to look at but the taste was not a True Banh Mi. The pulled pork was OK, It's infused with lemon grass and  it had an odd taste. The veggies were a big disappointment, they were not pickled and I only got 3 very thinly sliced radishes. They were sliced so thin, there was no way they were going to give me that  necessary crunch I so desired. The bread was the star, a crispy baguette with a chewy center. It was perfection! Can I buy the baguette alone? If so I will be there daily! The sandwich was also very wet! TIP...get extra napkins and a bib. The \"side\"of the day was this noodle spicy coleslaw concoction that offered nice heat but was WAY over dressed.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TxnCLljqXZlKCOpsCreqxQ"
  },
  "7thuvN-_YNhEnRn366V_Rw": {
    "date": "12/19/2015",
    "text": "I'm In LOVE with this adorable market/restaurant. It's a foodie lovers dream. Coffee, charcuterie, sandwiches, craft beer...they've got it all. Service was impeccable from everyone....to the lady who rang us up for our sandwiches to the guy behind the cheese counter. I will be back here and if the zombies come...this is MY spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6HoQQ8ETFgb7b8haTTM1Aw"
  },
  "UkqylJDceW4kmwPXEVE6pA": {
    "date": "2/10/2016",
    "text": "Great place for coffee, food, and work in Charlotte! Large, open, good energy, and great food. WiFi is fast, lots of outlets, good for meetings or a place to sit and work for an afternoon. The staff is awesome, can't go wrong!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sgFw8bMEpMQVrIfPAkTqwQ"
  },
  "kE0f3HfCqp8BNDrk3WKKhg": {
    "date": "8/17/2015",
    "text": "Went here Friday night for dinner. Easy parking, quick and friendly service, so many interesting products to look at while you wait. Chill atmosphere, families with kids there but also couples having a glass a wine. Got the Bahn mi and SO got the duck confit with beets dish. Delicious. Although the duck dish was listed under sandwiches there was no bread involved. After getting over that initial disappointment, he thoroughly enjoyed his meal. Bahn mi also came with tasty pasta salad. Fantastic portion size for the price. I definitely am already trying to figure out how to go back. In warm weather area is also nice to walk around in after eating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "61HgWAZmYT71XAOWU1zseg"
  },
  "kZpHJj5XYlsvcmRqCSkrzg": {
    "date": "8/10/2016",
    "text": "Had luche at earl grocer, wow good grosery store you can drink in! Order the butcher burger with pastram and go slaw on it! Sell lots of crave brews! Next time wife say \"you forgot to go grocery\" say \"ok\" and drink beer at earl!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "B9wtH9CLdpAuIopkpaLGWw"
  },
  "GFgJrFwp6Wg86edF39BOmA": {
    "date": "9/2/2014",
    "text": "This place looked to have a lot of promise... sadly, I found it grossly overpriced and after trying one of the raved-about dishes, I complained to find it very poorly cooked. The owner was incredibly rude and unapologetic. Not only will I not be bringing my business here, but i could not imagine working for her (it appears to be young college kids employed throughout.) At a glance, looked great - with a great location - sadly, I cannot see this place lasting long and do not recommend it. I would be a bit more forgiving if the owner wasn't such a rude & unsympathetic person. It's a shame!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "4LYFy4BZot6YrP3bKUsCTA"
  },
  "zHmEtxHLfsABXS8lAhvMWw": {
    "date": "2/6/2015",
    "text": "I dont get over to that part of Elizabeth very often, and I read out about Earl's from Charlotte Five (its a twitter news feed/site) when I woke up and immediately told myself \"New place for lunch!\" Then when i read the \"common market/D&D love child\" comment i was sold. This is a really great addition and has a great vibe. In here youll see lots of hard-to-find items from cheeses to meats to snacks, a salad bar, coffee, desserts, decent selection of wine and some craft beer as well as lots of interesting sodas and other drinks. But lets get down to why we came, the deli. Ive never had a banh mi sandwich mind you, but authentic or not, this thing hit the spot. This tender pulled pork with carrot and daikon (no idea what it is but it was good)\"noodles\" and aoili on an artisan baguette-type roll sandwich will make you wish youd have grabbed another handful of napkins before sitting down. If loving a messy sandwich is wrong then I dont wanna be right. Anyways, go to Earl's. Great staff, great food, great atmosphere. I think youll enjoy!  PS I googled \"daikon\" mid-review, so its now officially part of my vocabulary. And apparently i like radishes.  Who knew  \\_()_/ ",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2gNsj6eDkSBmbmjqe52h3g"
  },
  "P4QUfhsEtqpsQHBltngGGw": {
    "date": "11/6/2014",
    "text": "Don't get me wrong, I like new places that open near me and try to support them as much as possible. I have been to Earl's grocery on numerous occasions now. I have been to check it out when the fresh paint smell was still there. I have been for lunch, I've tried their coffee and I have been back a few times to buy specific products that I believe only they offer. Without a doubt, the best thing that they do is offer specialty products to include fancy sodas, sauces and cooking ingredients. They have a cheese and charcuterie counter, as well as meals or food ready to take home and eat, kind of like Dean and Deluca. They also have a lot of interesting stuff in the frozen section like non dairy ice cream that the wife loves and as she should because it's made with delicious coconut milk for those plagued with a lactose aversion.   That was the good part. The not so good part is the lunch options. The rice bowl was good, but not great. The banh mi sandwich was filled with dry pulled pork and less than ideal. All of which was at a premium price. Trust me, I don't mind paying for good food. In fact, people would easily tell me that I have a problem if they knew my threshold for paying for a good meal. The lunch offerings are not up to the price point in my opinion, and I am not even taking portion size into the equation. I am only taking straight up quality into consideration here. The worst part of my experiences at Earl's is by far the coffee or at least the 2 versions of americano that I have been offered. The first version was very weak in flavor and taste. The second was an exercise in confusion as the server seemed confused on the operation of the espresso machine. Only a small amount of water was added to my drink and I was offered more if I wanted, but I opted not to add anymore to see if this version was more flavorful. It was not. My service experience has been anywhere from full on exuberance to mild indifference. The most consistent service comes from the cheese lady or at least the lady that works the middle section of cheese and deli counters. Would I make a second attempt at lunch at Earl's? Definitely, but I'm seriously concerned with facing strike two and three all at once. I hope that they can turn around the weak points that I've experienced. Ultimately, the trolley project may sink them or at least they will have the perfect scapegoat.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GqJRlbga27rUpolN-SP9Ig"
  },
  "bGmaiIiZJlHzQHkxfpaang": {
    "date": "10/2/2016",
    "text": "Best lunch/brunch in Charlotte! High quality food at low prices. Just had the Pozole and it was so yummy! My go to place on Sunday's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mdL3nGuW9Lw9a_AYA7XfXQ"
  },
  "H1ZpYmNemGk-WkVPad6F3w": {
    "date": "8/30/2014",
    "text": "Awesome spot on Elizabeth Ave! Extremely kind and helpful staff, affordable unique products and awesome food!! Duck hash super tasty and Cali-style breakfast burrito AMAZING!!! Wine by the glass, bottles w $2 corkage fee and nice selection of beers. We will definitely be back time and time again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y3dhddT66J79DN_YWJiweQ"
  },
  "3zuxkeZvR4nZVJUl6rVDEw": {
    "date": "4/16/2015",
    "text": "A nice addition to the Charlotte restaurant/retail scene.  This was my first trip to Earl's Grocery for lunch and I had the ramen which tasted very good.  There is also a nice selection of fresh, frozen, and cooked food to eat in the grocery or to take home.  I purchased some Serrano ham, Italian salami, and imported cheese to bring home.  Will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FPZtU6eI9EM_DK2RerytDA"
  },
  "ohyWbWLIj2o_8EO1Q5aeBw": {
    "date": "10/31/2015",
    "text": "Stopped in for a quick bite before concert. Excellent beer selection and delicious steak tacos. We also had the meatball sub, which was terrific. Fast service, good value and friendly place. I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "npTlEP9oWq-9UFpijdPx7A"
  },
  "6n_ndL2jH4SUMrAPmjeOzQ": {
    "date": "12/5/2015",
    "text": "Love this place!! Tacos and Banh Mi are delicious!!! Italian sandwich was also delicious. Such a cool place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "r2S4nQS8H4XSu8ZuxixVcw"
  },
  "6LQaxthpDRYDzxK66i3TMg": {
    "date": "3/25/2016",
    "text": "I have only ordered coffee here on several occasions. They have a convenient bar with outlets for your laptop. I stop by frequently to use the WiFi. It is a nice atmosphere; A unique grocery cafe in Elizabeth rite next door to the Visulite.... although, very pricy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Qb85svvwMN_gkS0x3zbBw"
  },
  "B8skHF_sM5iy60f6uqIWIg": {
    "date": "12/16/2014",
    "text": "Very Friendly Staff. Food was good, a little overpriced. Had a burger and my friend had the pimento grilled cheese sandwich. Yummy pastries.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q5mZcUR1XimDP5zN0mZQIA"
  },
  "kOGFg-Z0AlWlmV2eqlcC-A": {
    "date": "10/14/2015",
    "text": "This place is really really good!   I had the noodle soup which definitely beat my expectations.  Another individual in our lunch party had the Banh Mi which he said was awesome.  The place also has a great atmosphere. We'll definitely be returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ot0yVHpNJNXNTJvSCD1_nw"
  },
  "DSa9DqOPDu6BNQ80StQWAw": {
    "date": "3/29/2016",
    "text": "I am OBSESSED with Earl's....granted I have only been twice now but I think I could go every day if time allowed. The food is full of flavor and amazing. Everything tastes fresh and all of the flavors are combined so well. I loved the grilled cheese with tomatoes with a side of the tomato soup, talk about perfect! I can't say enough about this place. I can't wait to go soon and grab a bottle of wine and more yummy dishes to enjoy with friends. Keep up the good work and if you haven't tried it GO...Right now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_Zf3tEbAhJ0J1wsIqs3Vw"
  },
  "zFgtYFldyGpVf2roOG12Vg": {
    "date": "5/14/2015",
    "text": "I tried one last time with lunch at Earl's and was underwhelmed, my \"street-style\" steak tacos had great flavor but the steak wasn't cut properly and had a moderate amount of sinew and fat. The small tortilla was way overloaded and fell apart under the heft of the fillings. The staff is very friendly but the overall execution of the food still isn't worth the price tag ($8.95 for the tacos).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5jrNhiP3g6IPeIA0eTj0tA"
  },
  "cKohqt3K2zfu5D0B-TViJw": {
    "date": "11/6/2015",
    "text": "Amazing place on Elizabeth. Great quality unique food. Made to order or premade. Why are you still reading this review? TRY IT OUT! You'll thank me later.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FiGlH7GxvgNlBvuKh-xTxQ"
  },
  "xUhfESh64opJ_Kpdklo3zw": {
    "date": "6/18/2015",
    "text": "Try the sausage and egg biscuit. Every ingredient  was amazing, and came together to make the best breakfast biscuit I've ever had! Sorry grandma. From the buttery flaky biscuit to the perfectly cooked scrambled egg to the amazingly well seasoned yet not too greasy sausage patty. This one is a winner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aiFObms0aeiYqVf1xTptkA"
  },
  "dtDFS13vvokUUaaFjWOz7Q": {
    "date": "1/1/2016",
    "text": "This is my go to place for a consistently good breakfast or lunch. Definitely must try the morning wrap. So good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3F2Fv-GTBeYxeLTJgj_u1w"
  },
  "e2RwZkSo24gTrDfMJ4RGyQ": {
    "date": "11/17/2016",
    "text": "I love this little neighborhood spot, and it just so happens, I'm in the neighborhood! Whether you're grabbing fancy groceries, coffee, or a quick lunch, this is the spot to be. And what better setting that right by the trolley tracks. I can't say enough good things about the banh mi sandwich, and just be aware, it's giant! Plenty to share with a friend. I love all the events here too, I recently stopped in for a Bob Peters mixology class. This is definitely on the Don't Miss List.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "I6DOULDVlRpIHuhV3rQpTg"
  },
  "wBfNIepqSITyiCeNJT9nyA": {
    "date": "2/4/2017",
    "text": "I want to like Earl's grocery but after trying several things I just can't. I got the Saigon noodle bowl and threw it out. Big pieces of rubbery chicken in a bland  broth. It was topped with raw onions and radishes. A dry turkey sandwich that cost almost $19. Very hipster atmosphere. Save your money and go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "swe3cf9ObJW428Jv3DVuMA"
  },
  "y33px4PQ08n2MudQvQ65pQ": {
    "date": "1/18/2017",
    "text": "Last week They served these delicious caramelized onion & rosemary scones that appealed to my fancy tastebuds. I couldn't make it to them that day so I called the store to ask the next time they will offer these. The lady said she didn't know but took my number & name to have the manager to call me back. The manager not only called me back but he told me that the bakers are prepping my scones & what day will I be able to stop by to get some. He was going to make sure that they were baked fresh & be ready for me that day. I told him Friday & when I stopped by yesterday they were ready for me. I didn't get to thank the staff but thank y'all so much for exemplifying excellent customer service & making sure I felt like I mattered as a potential customer who was ready & willing to support y'all. It's hard to get service like that anymore....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hpd24NI4BUWm-Yw8Ckerdw"
  },
  "ddUfL87bdjfcSFaXFPCLdA": {
    "date": "1/7/2016",
    "text": "Breakfast burrito is perfect for sharing w a friend along w a cup of coffee. I grabbed a tiki masala sauce for dinner that I will be back to stock up on  along with gourmet green matcha tea chocolate and wine! This place has a little bit of everything!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5PMZ68pSIkUyhk5ETib8QA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Vibe",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5PMZ68pSIkUyhk5ETib8QA/o.jpg"
      }
    ],
    "user_id": "3hKqJC6UzWumAojC14hcBw"
  },
  "PyuhDKFab3OwDBS0SBn0tA": {
    "date": "7/31/2016",
    "text": "Have eaten here quite a bit as the location is right by CPCC where I teach.  The food is great, healthy, tasty, and they are accommodating with special requests.  Their specials are written on the chalkboard and I try to grab one of those.  I do love the sandwiches, but the burgers are always great as well.  Lots of drink options and dessert choices.  Food is a bit high but not pricey.  The ambiance is great and the table space great for sitting for a bit.    One thing - their customer service and servers are clueless.  I stood in line there once for 15 minutes while 4-5 of them wandered around behind the counter or stood and looked while one cashier tried to ring up a single customer's order.  The customer just kept changing/adding to the order oblivious to the 6 people behind her.  Not sure why no one - and I mean no one - rectified the situation by opening another register.  This has happened alot, and I've heard others complain, put food back, and walk away.  Not sure when they will figure this out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "npiqEezAM7JA9V4xlphLsw"
  },
  "gICYrGJI9o-VdOBMK9Shng": {
    "date": "2/8/2016",
    "text": "Earl's grocery is the best kept secret! This place is perfect for everyday grocery shopping or partaking in amazing lunches or treats from the bakery.   They are currently redoing their menu. From what I hear it's going to be even better than before, I'm not sure how that's possible.   I love stopping into Earl's for dinner with a book. It is never too terribly loud. It's in a prime location to walk to other eateries or hop on the trolley and continue to explore Charlotte.  Do not miss out on this gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jVKUx15w0XKz0bo4Fy_yFg"
  },
  "OboOtx2I1UrlsusauDdyQA": {
    "date": "1/10/2018",
    "text": "Great spot to come and get some work done in the morning. Very affordable, delicious, and unique breakfast plates.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XiSoLCYSlwxGSQEbft4Jmw"
  },
  "qL7DGOMZRruz9bn78xKibQ": {
    "date": "9/24/2015",
    "text": "Dear Earl,  I love you. I love your space. I love your case of baked goods. I love your hot chocolate. I regularly crave your ramen and pork belly tacos.   Please warm up my baked goods for me next time. The pumpkin ale cupcake was dry and cold last time.   Love, C",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "PVyZXgOkVtnU6966FDFhuw"
  },
  "WzxzF93-xFhfKd9evXUijA": {
    "date": "1/1/2016",
    "text": "Earl's Grocery has helped to revive this section of Elizabeth Avenue, and it's a great addition. The location is very convenient- I typically ride the streetcar from Uptown (the stop is right outside Earl's) or sometimes walk. Its quite fun to sit by the window and watch the streetcar trundle past along Elizabeth.   I like the interior and vibe of Earl's it is very welcoming. I've had coffee here before, but this was my first time eating here.   Coffee here is very hit and miss- sometimes bitter and dark. sometimes mellow and enjoyable. Lattes and cappuccinos are also inconsistent- sometimes the espresso is watery and bitter and the milk is poorly steamed- not impressive.   On to the food, the selection is very good, a lot of options. I ordered a meatball hoagie. The staff were friendly but so slow- taking their time to do basic tasks, like pressing buttons on the register. The sandwich has very big, and looked like a big mess on the plate. It was supposed to come with crusty bread- more like soggy bread. Overall the food here is meh. But it is nice to sit here and watch the world go by.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gely67I-cNzzMkKnz-8rIg"
  },
  "R661mJxO2Z__YM-Z2etMeg": {
    "date": "1/29/2018",
    "text": "This place was great! I want to try everything on their menu and I like that they have some Asian influences in their food. I got the Buddha bowl, a latte, and a taste of their pork tacos. All were delicious. I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9IqhQ2Guf4RbjCEPiVBNQg"
  },
  "tFoX6y1qnL9idxb5aRDBUQ": {
    "date": "6/18/2015",
    "text": "Check you out, Elizabeth Ave. You've really done yourself up over the past couple of years. First it was Smalls (now closed), then Viva Chicken, and now Earl's? Goodness me, how are you going to top this? If you take a stroll out of the Visulite or dinner from Customshop without waltzing in for a few high-class chocolates, a few bottles of wine, Charlotte coffee, or pasta from the coolest self-serve station I've ever seen, then you're not truly living.   Thank you to the folks who have decided to marry the conceptualizations from Dean & Deluca and Common Market. It's edgy enough to where the cool kids will find their way in for a Japanese pour over and classy (albeit clean) enough where all of the Myers Park ladies-who-lunch will stop by for a sandwich during the day. They've really hit the nail square on the head with this spot.   I'm looking forward to patronizing the coffee bar a bit more in the near future. Pretty cool to see they are supporting Charlotte roasteries with coffees from the bar and also whole bean.   Welcome to the hood, Earl. Your grocery is a fine establishment indeed.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 13,
      "cool": 16
    },
    "photos": [],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "M2qCLEEScMey_vrb1HvWVg": {
    "date": "4/12/2016",
    "text": "This is my favorite place in all of Charlotte to work. There are healthier options than a regular coffeeshop or bakery. There's also a lot of variety - whether you want a smoothie or a salad or a big juicy burger, all of the choices are delicious.  I've never had to fight for a spot like at some other coffeeshops in town. People are great about sharing tables if they are working solo. There are outlets everywhere - a laptop user's dream!   The employees are friendly. The coffee drinks are delicious. The Earl's Refresher juice is really good. I also love the grain bowl and the grilled cheese.   I don't have a single complaint about this place. I did get a parking ticket this morning because I was a doof and spaced on the fact that there was a meter right beside my car ... but that's my own fault. So, pro tip: feed the meter!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YRhrA4f0wfF5IGiIRS0SIg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Natural Awakenings Charlotte&amp;#39;s Earth Day edition, on stands now. Designed by Melissa Oyler Designs!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YRhrA4f0wfF5IGiIRS0SIg/o.jpg"
      }
    ],
    "user_id": "Kx246DR4k9ZvqcDq5nuKWg"
  },
  "DWtqocEKxLeP_gtKKwxAgA": {
    "date": "8/6/2014",
    "text": "New kid on the block, but what a welcome addition it is for any foodie in the QC!  Earl's Grocery is something like a little local Dean & Deluca- lots of small batch, high-end chips, dips, and other edibles along with a pretty mean selection of artisan cheeses and meats and a deli counter with some of the fanciest delved eggs to be found in the deep South.  But that's not all, there's coffee and espresso with a handful of tempting baked desserts: think cookies, cakes and pies.   There's also a small deli counter with a menu of sandwiches that go far beyond what you'd see at most any other sub shop. The pork banh mi was packed with tender meat and flavors of the veggies and sauce that melded well.  Not authentic, but plenty tasty.  A grilled cheese with hoop cheddar, arugula and picked peaches was also notable for its uniqueness and lightness, which is a good option in the warmer weather.  Pair any of those with the small but able wine or craft beer selection and it would be easy to while away an afternoon here.  No alcohol? No problem, as there are a number of waters, still, and sparkling beverages to pick up in the coolers as well.  There's a small selection of tables and chairs up front, at the windows, and the store feels quite open and spacious.    This is a fine addition to the neighborhood and it's great to have another option for picking up small provisions for parties and social gatherings.  This is the kind of place that's also dangerous to a wallet, as shopping with your eyes is bound to leave you picking up things you never knew you needed- from artisan crackers to small batch caramels to locally roasted coffee.  This is a hall of temptations and it, thus far, tastes very good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v-wfW-jCQ1jJHXWCFSSAeQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Deviled Egg, horseradish filling, boiled in beet.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v-wfW-jCQ1jJHXWCFSSAeQ/o.jpg"
      },
      {
        "img_id": "_n7uHKKKkIQpfOxZV_UIBg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. The grilled cheese.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_n7uHKKKkIQpfOxZV_UIBg/o.jpg"
      },
      {
        "img_id": "ho19jKbRuq7-iOOd3lN8ww",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Banh Mi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ho19jKbRuq7-iOOd3lN8ww/o.jpg"
      }
    ],
    "user_id": "AwyM03qzhwgyskBruurWQw"
  },
  "kDdi2l1erv86kAKAytMo2w": {
    "date": "4/9/2017",
    "text": "I came here for an anniversary brunch with my wife and I'm already a big fan.  Aside from the great food, they also provide great shopping. One of the great things about Earl's is the variety. You can grab coffee, alcoholic drinks, prepaid meals, hot meals, or just dessert depending on what you want at that time. I will definitely be stopping by here regularly from now on.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nm0z8rDHu1bace9pKd7FfQ"
  },
  "1WUX4l12M05cthLMSAjPTg": {
    "date": "10/20/2015",
    "text": "I've been to Earl's 3 times and have had three different yet equally awesome experiences!  On my first Earl's experience, my husband and I decided to get drinks prior to watching a show at the nearby Visulite Theatre. We were delighted with their selection of local brews, and I literally jumped for joy that they had Birdsong's Jalapeno Pale Ale cans selling for 2.99 a pop. All told, we both had a tall boy can of local brew and spent just over $6 -not a bad deal at all!  My second trip to Earl's was a quick drop by after a lunch appointment at Nothing But Noodles (which is delightful and located next door to Earl's) to pick up some vino for a happy hour. I was delighted with the selection, diversity, and prices of Earl's wines. I ended up buying a fabulous bubbly rose for less than $13. If I hadn't been in such a hurry, I would've picked up a few cheeses and cold cuts from the charcuterie/deli section, but alas... I am always in too much of a rush.   For my third and most recent Earl's experience, my husband and I took our in-laws to Earl's for lunch. We made lunch into an entire afternoon event by taking the streetcar and oohing and ahhing over Charlotte's beautiful uptown and the Sugar Creek Greenway. My in-laws were skeptical at first because they thought it was weird that we were having lunch at a grocery store. After I explained that it was more of a provisions store/deli, they warmed up and I got a resounding \"oh cool\" from them after we walked through the door. I ordered the harvest salad which was amazingly fresh and had a fantastic Fresno chili vinaigrette. My husband ordered a bowl of chili and had some sort of artisanal potato chips, and my in-laws split the grilled cheese sandwich (which was HUGE). We were all pleased with our selections, and since it was one of the nicest days of the year, we were delighted that Earl's has floor to ceiling windows that were opened to let the fresh air in.  Whether you're looking for a quick bite or wanting to show off Charlotte's quickly growing (and ever changing) streetcar line cuisine scene to visitors, Earl's is the place to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8BKPZR7gGhJFKBSfJErEkA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8BKPZR7gGhJFKBSfJErEkA/o.jpg"
      }
    ],
    "user_id": "_siniUb8CoN9of4mhAtj_g"
  },
  "eIXL-t-eGnBrn8_wHCr58g": {
    "date": "4/19/2017",
    "text": "The food was great and so was the service. This was my first visit based on a recommendation from a friend. But I must say, that the coffee was off the charts, I may never go to Starbucks again!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1xRRJzlAVIxdSop3rDw4ww"
  },
  "ybPLth54uS_xlRvsfcOZbw": {
    "date": "2/17/2016",
    "text": "I love earls to do work and have meetings. It is a solid common space work, eat and drink (coffee or alcoholic)!   The food is great..:I haven't ore the Ed anything didn't enjoy and look forward to trying out the plethora of cheeses and other goodies they have! If you're unsure of what you want a quiet relaxing place to work go to earls! (Unless it is the weekend it will be crazy busy!)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9xIcp00kmTRHQtHZNll6xg"
  },
  "-CUcjeiBxvnDrssIv-fBpA": {
    "date": "1/4/2018",
    "text": "Breakfast biscuit was amazing but the americano was very watery.  I would give the food a 5 but the espresso a 2.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYR-2VB3dJUdiHWS4Pouog"
  },
  "bKSCMcNulmUe2LEXqXjwYQ": {
    "date": "1/2/2018",
    "text": "I love this place.  Walking distance to my house, and it's a great place to swing by for a beer and then get some pre-made dinner.  Their charcuterie selection is wonderful, as are the daily sandwich options.  The coffee is also delicious, and sitting by the window on a spring day after a long walk is marvelous.  Earls is the best!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "csE99-UUKeTWCi1IrUBPEw"
  },
  "9Ox4zMNDY075UN2v_rjV6w": {
    "date": "3/27/2016",
    "text": "Lovely spot for lunch or an early casual dinner. Menu updates daily and specials can be found on their chalkboard. I am addict to the noodle bowl and I love their breakfast sandwiches if I am carb indulging for breakfast. I wish I could fall in love with their kale salad, but the kale has been very tough.   Tip: you can buy bottle of wine to consume on premise with friends!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M-AgixKVu4CLBShRZ_SU7A",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Noodle bowl and outside patio",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/M-AgixKVu4CLBShRZ_SU7A/o.jpg"
      },
      {
        "img_id": "hHryX1MuqXCgKJu7T7qUJg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Noodle bowl with pork belly and crepe style egg",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hHryX1MuqXCgKJu7T7qUJg/o.jpg"
      },
      {
        "img_id": "hb5lUwa1_7D0GokZ3aqSiA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Lunch and dinner menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hb5lUwa1_7D0GokZ3aqSiA/o.jpg"
      }
    ],
    "user_id": "hhKwALl0hU1m1SHV7fdHhg"
  },
  "hOpgz1csxOzbSa4dkqKDyg": {
    "date": "12/29/2015",
    "text": "Earl's Grocery is a wonderful new part of the Elizabeth neighborhood!  I absolutely love this spot!  They have fantastic specials with fresh ingredients that are a must eat!  I'm not a turkey fan (at all) but I had heard so many wonderful reviews on the Turkey Sandwich, I had to try it.  It is perfection!  The market itself is also wonderful with a great wine selection.  We have also tried the Noodle Bowl, morning Grit Specials, Meatball subs, Bahn Min and more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f3_7tdzVsCV3D73072ckXQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. The Turkey Sandwich. Amazing.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/f3_7tdzVsCV3D73072ckXQ/o.jpg"
      }
    ],
    "user_id": "zvFeFboNMXqes2x5yqxpYw"
  },
  "dlTVbIOPE4Zs4BwQhluU4w": {
    "date": "9/5/2016",
    "text": "What we would order again -  Meatloaf but we would add our own ketchup Chicken salad  What we wouldn't order again - Gluten free turkey meatballs Tofu/Quinoa Peppers Buttermilk Cheddar and Rosemary Mac n Cheese",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "g4KtDgbJaIHlLUFCs54tIw"
  },
  "6GbD1_ZkGmuBbr4on9RpPw": {
    "date": "7/29/2016",
    "text": "Very nice industrial atmosphere and great service!  Came there hoping to try the ramen but was disappointed they no longer have it on the menu.  So I tried the fried rice bowl was very delicious and the chilled noodle bowl.  The only downfall to the chilled noodle bowl was that the pho noodles was a little too hard to chew, wish it could've been a little bit more soft.  But overall very nice experience here with the garage windows over looking Elizabeth avenue.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sPQD_7e_Ep6T6OLz2NYMvA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Chilled noodles, substituted chicken for pork belly but wish the noodles was a little softer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sPQD_7e_Ep6T6OLz2NYMvA/o.jpg"
      }
    ],
    "user_id": "fcD5KiJ_ACTsU6zLJR6CuQ"
  },
  "EUEQI7hlij0BfDxXmWjvBA": {
    "date": "2/23/2015",
    "text": "So this is the second trip to Earl's Grocery that I've made so far within the past couple of weeks.  I'm a total foodie so I make it to different eateries and unique little stops over Charlotte fairly frequently.  Today I stopped in at a quarter to noon and the lunch rush hadn't quite made it here yet.  Noise level is actually perfect.  I'm currently working on my laptop and I can hear the buzz of conversations but I can still work and concentrate and even make a phone call without being distracted.  This time I decided to try the Banh Mi Sandwich.  It's priced at $8.99, still a little over twice as much as the authentic Banh Mi you can get from Le's Sandwich shop at the Asian Corner Mall but they definitely made a valiant attempt.    There were Banh Mi-esque aspects to the sandwich which was accompanied with the traditional pickled daikon & carrot strips.  (I love those.)  This one had lemongrass pulled pork, radish, cilantro, mint, and was served on a toasted baguette, & a Saigon aioli.  It was definitely tasty.  Got a little soggy quickly but hey, a little mess doesn't hurt anyone.  I opted for a can of Noda Jam Session from one of the local breweries.  (Yes...it's like Common Market. You can relax with a beer here....or come with your friends for a mimosa brunch...just get a bottle of Champagne and some OJ, crack them open, and pour away...)   I still haven't been disappointed with this new little grocery/cafe/deli place.  It's situated right on Elizabeth between the hospital and CPCC's central campus.  Parking is decent during the weekdays.  It's got the usual 2 hour max parking.  If you haven't downloaded the Park Mobile app for your phone's you're missing out.  Super easy and it shoots you a text when you're running low on time.    The people here are generally really friendly and they've also got Wi-Fi if you'd like to get some work done just like I am right now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mzTZQSb1OeQn4AH39B-rDg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mzTZQSb1OeQn4AH39B-rDg/o.jpg"
      },
      {
        "img_id": "hvEUw1tpfpxXiiP4Ed6tig",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hvEUw1tpfpxXiiP4Ed6tig/o.jpg"
      },
      {
        "img_id": "PKWALf0oHtGPzUKEzn5XXQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PKWALf0oHtGPzUKEzn5XXQ/o.jpg"
      }
    ],
    "user_id": "EuGkxiM0fgk6eQ7NzpNjKw"
  },
  "DyOjdwR2Q2gfF7876ZIZQg": {
    "date": "10/6/2014",
    "text": "So I've been here now for lunch twice and brunch once:  Biscuits and gravy: delicious and a huge portion for $5. Can't wait to try the chorizo biscuits and gravy.  Warm grit bowl with fried green tomato chow chow: huge portion. Glad I added turkey meatballs or else it would have been a little bland. A+ with the addition. Chorizo would have been even better.  Duck confit hash: unique, big portion, fresh. Wish they had a little more duck and a little less beet. Otherwise fantastic.  Bahn mi: traditional bahn mi fans might not enjoy this play on the the sandwich with BBQ instead of slices.  My go to lunch or coffee spot, especially on a nice day.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "lioLPev-KDZQtMK0NRvJhQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Warm grit bowl + turkey meatballs, Bloody Mary",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lioLPev-KDZQtMK0NRvJhQ/o.jpg"
      }
    ],
    "user_id": "j5AWHk5Vhv79P5onFX3xWA"
  },
  "YkPhlIc9GCpuOiA--ex5nA": {
    "date": "10/3/2017",
    "text": "LOVE this place. Awesome wraps, friendly service and a full coffee bar. My favorites are their breakfast burrito or turkey wrap with a cold brew! There is also plenty of seating which I love so I can do computer work. To be honest I come here wayyyy too much.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n858OREckfI9syoerV-RKA"
  },
  "mOqa35TC9ruF6WqMc4Ys5w": {
    "date": "1/23/2015",
    "text": "What a great little spot added to the Elizabeth area.  I know I am a little behind on checking this place out but I am glad I was able to stop in this week.  They have a lot of great things to offer and they somewhat remind me of a cross between Dean and Deluca and Common Market.  They offer the retail priced wine, pre packed baked goods and snacks, fresh salads, sandwiches, and a full coffee bar!  Woohoo!  They offer milk subs like coconut or almond milk for your coffee or tea which I appreciate!  The fresh baked goods section was where I spent most of my time.  The place isn't very big but you can walk in circles and find something new with each lap.  But the bakery...yum.  Let me just go ahead and recommend the burnt butter chocolate chip cookie.  I realize that \"burnt\" anything doesn't necessarily sound good but trust me...this cookie is off the charts!  It is more salty than normal so you really get the whole salty/sweet thing.  It is SO good!    We also tried the brussel sprout salad/slaw thing.  It was very good!  We tried the noodle salad thing too but it was a little bland.    The service was friendly.  I find this type of place to be expensive but you can certainly go there and get a couple things or dinner/lunch and it won't break the bank.  If you plan on picking up dinner on your way home to feed a family of 4, you are going to spend a pretty penny.  Overall, great place, nice addition to this area--casual but still trendy..attracts a diverse crowd and you don't feel like you need to dress up to fit in...I mean it IS called \"Earl's Grocery.\"  :) Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TB9ibgXVrq1B7-fajbsu8g"
  },
  "tC4suEBo_tGKuPYrBEYt5g": {
    "date": "9/21/2015",
    "text": "Earl's Grocery is awesome! Think of it as a Dean and Deluca because they offer coffees and teas, high end grocery items, as well as hot bar and cold bar foods. Earl's goes a step beyond and has food made to order, one of the best being their No. 6 - a duck confit hash made with beets and coleslaw. SO GOOD! So filling but not heavy at all. The pork belly tacos are also good but very messy to eat and a little bit on the salty side. It's a great place to do work and hang out. The only thing I would say to management is to keep your bathroom cleaner - the floor was very sticky all throughout the bathroom and there was dirt all over the floor as well as little bathroom gnats.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2zFY2l893Awa9mWZBVa4WA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2zFY2l893Awa9mWZBVa4WA/o.jpg"
      },
      {
        "img_id": "7TR4TcxccL5wmp3KIr4crg",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7TR4TcxccL5wmp3KIr4crg/o.jpg"
      }
    ],
    "user_id": "LHY1GpTkKpWVfrwHVubXRQ"
  },
  "rPkOeQh8aMFvPI_67l4ITA": {
    "date": "3/25/2016",
    "text": "Earl's is a local gem. Quieter than Common Market but similar concept. The service is always phenomenal and keeps me coming back.   It can be busy during after work hours but I've never had trouble finding a seat. I recommend any of their specials- my current favorite is a cheese panini that is delicious.   I enjoy the beers that you can buy by the bottle and the wine selection as well. In the past I've made a cheese plate of my own by choosing one to two cheeses. They gave me a cheese board as well as a knife to cut it with.   They used to have a salad bar that I enjoyed but it looks like they have prepared salads now. They have free wifi as well. Highly recommend as an alternative to a coffee shop or a spot for an after-work coffee or drink.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "sCbTM223gdRBZqNjMYiGyQ"
  },
  "4isSfo-eJlUqL2yX7OLAEw": {
    "date": "10/19/2016",
    "text": "Soooo good....perfect rainy day lunch spot. Can't wait to try lots of other things. Portions could be a tad bigger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2rLnQdIY56nLw7yr8LCzmw",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Good juice but they ran out of green apples &amp;amp; substituted with red delicious (not at all the same)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2rLnQdIY56nLw7yr8LCzmw/o.jpg"
      },
      {
        "img_id": "h2KnunrkgxOFxDVteyUs0Q",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Grits bowl with pork belly &amp;amp; kimchi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h2KnunrkgxOFxDVteyUs0Q/o.jpg"
      },
      {
        "img_id": "EW05RdBh3p1fiuW7iC7tLA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Banh mi....delicious",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EW05RdBh3p1fiuW7iC7tLA/o.jpg"
      }
    ],
    "user_id": "D9yd7ZGGCCqb8aDmxkosiw"
  },
  "ESsRkLI0Vh5_nVAjJ9E38w": {
    "date": "3/24/2015",
    "text": "I visited Earl's once right after they opened just to check out the place, but I didn't buy or eat anything. Then a few coworkers and I ventured in for lunch after seeing Wilson from WCCB talk about how awesome their banh mi is. I've been looking for a solid replacement since Peculiar Rabbit took theirs off the menu, so off we went.  We got there around 11:30 on a Friday, and the place was starting to fill up. I ordered my sammich, grabbed a number, and took a seat. My coworkers' ordering took a little longer, but all the staff were incredibly nice.   However, they accidentally made me TWO banh mi sandwiches, and I didn't get to keep the extra, but I was okay with that after I tried mine. It certainly wasn't anything like the one I had at Peculiar Rabbit or Yummi Banh Mi Truck. It was more like a shredded, pulled pork sandwich, open-faced on two pieces of long, chewy bread with no jalapenos. One of my coworkers also got it, and we both had to give up trying to eat it like a regular sandwich because the shredded pork was piled so high and the bread was so tough. We just grabbed some forks and ate the pork off the top. It was also a little pricey for what you got, and the only side options the fella behind the counter told me about were broccoli/cauliflower mix and something else that didn't sound too appetizing. I went broccoli/cauliflower and got perhaps two tiny florets of each.  Overall, I'll give Earl's another try because I like its intent with being able to order food to eat there, food to go, groceries, wine, and provisions, etc, but I definitely won't get the banh mi again.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QmethzRyAvZXS9m1UNJpdw"
  },
  "lgsslSaqJyszhaB65O47Iw": {
    "date": "8/21/2014",
    "text": "Upscale Deli, Grocery, which will have something you will like.    Earl's is a neat place to grab lunch or pick up something niche to eat and drink later.  I stopped over myself for lunch, and was pleasantly surprised at the offerings.  1st, I was greeted by a awesome coffee counter, which made a splendid Americano (My 1st good one in a while).  Then I was immediately distracted but the pastries and cupcakes, which made my mouth drool a bit.   Steeling my reserve, I passed up the cupcakes (abet sadly) and headed to deli bar to place my order for a Bah Mi Pork sandwich.  Sandwiches were made fresh on the spot and they seemed to be using a local or in-house bread.      While my sandwich was being made, I was free to wonder through the wines and beer selections. The choices were good, and to my surprise, they had a couple niche ginger beers as well.   If your are around, stop by and check it out, I am sure you will find something there that will peak your interest, but beware it can also take a good bite out of your wallet.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b6wyLmzfFEP6TjBNXn3hBA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Bahn mi sandwich and Americano",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b6wyLmzfFEP6TjBNXn3hBA/o.jpg"
      },
      {
        "img_id": "2ag8isVum2ViWiDZmBEoBQ",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Cheese rack",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2ag8isVum2ViWiDZmBEoBQ/o.jpg"
      }
    ],
    "user_id": "c-1biwACMAHTD4AtOlWnpQ"
  },
  "OQ05jwTFIG14TPxa9-NYrg": {
    "date": "4/2/2018",
    "text": "Great selection of all products.  Staff attentive abd caring.  Located in pleasant neighborhood.  I rated only 4 stars due to pricing.  Prices are higher than I'm used to.  Supposedly the location and demographic served, commands the price structure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jMo_fy5hfRHGe-F54iTEpw"
  },
  "t_E0pcvLnulfBGtMj8SYog": {
    "date": "7/12/2016",
    "text": "I love this place. It has great dishes like Dean and Deluca, but is a lot more laid back and great for work! There are tons of outlets and different surfaces to use, great drinks, good music to help you focus, and yummy lunch options! I had the chilled noodle bowl today and it was perfect. All of the flavors were really well balanced and everything was fresh! Plus they have Pure Intentions coffee. You can't go wrong with Earls!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3ddTQ89QIiVbGL5LKz_rhA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. The cold noodle dish with bulgogi chicken- it&amp;#39;s so good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3ddTQ89QIiVbGL5LKz_rhA/o.jpg"
      }
    ],
    "user_id": "YvMhbkGSlzZV0WI-3x_TMA"
  },
  "A9tgQJHzcILJAqrmcGdNCg": {
    "date": "1/6/2016",
    "text": "Earl's Grocery knocks my socks off with their Ramen bowls. It is so good, my husband and I eat in silence because it's that good. Nobody wants to say a word before they finish that big bowl of noodles and pork belly. After we do finish all we can talk about is how good it is, and ask ourselves why we don't come more often?   For around $20 both my husband and I can get our own Ramen (tried to share once, not a good idea) and a big bottle of water. Earl's spends 3 days preparing their ramen broth and you can just taste the love that goes into the bowl. The eggs are perfect in the soup, which is slightly runny (not my normal taste, but it works). The pork belly is the star, which it should, just the right amount of fat.   And as I'm typing this I am starting to make myself hungry.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7JLpACO44A3xVXnOt1Z_A"
  },
  "HdMPzigsXPqkdzduazbFRw": {
    "date": "12/1/2015",
    "text": "Pretty cool addition to Elizabeth.  Ben G. said it best - its a combo of Common Market & Dean & DeLuca.  I showed up for lunch one day when I was looking for a quiet - yet kid-friendly place where I could potentially Pinterest while eating.  Earl's met all my needs.  I had a tough time deciding what to eat, but after perusing the menus I chose a meatball sub and a can of Le Croix.  You order & pay at the same place, so be prepared with your drink & sides when you order your food - that caught me off guard even though they had a sign there.. blonde moment.  While eating, I sat within view of the ice cream cooler and a display of fun drinks, it was very tempting and I definitely had to go research exactly what churro ice cream was - maybe next time, that meatball sub was delicious and left me stuffed!  On a nice day, I bet Earl's is a great place to sit out on the sidewalk, or just inside when they open the giant doors.  Pro tip: there is an entrance in back as well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "8ziF9bL2WU9boE6du0yAIA"
  },
  "hPOwQwry0U_DOID3gQylJA": {
    "date": "3/16/2017",
    "text": "This place has really great potential.... however they open basically mid morning missing a HUGE traffic potential of work goers in the morning.  What kind of place dotes themselves on coffee and scones and opens after 6am, let alone 8:30??",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWzzo2-UdU0fe1KL5V5XIg"
  },
  "wEtfzs6TBBjr8kIxgnFigw": {
    "date": "10/4/2014",
    "text": "I've only been here once, but I like it. They offer a variety of prepared foods, sweets, coffee, tea, cool sodas, meats, cheeses, etc. I like that you can order food and eat it there, as well.   On this visit I had a banh mi. I wanted to see their take on it. And while I like Le's Sandwiches in Asian Corner mall 1,000 times better, this was a nice American BBQ pork version of it. Overall, it's definitely more than I want to spend on food for lunch, especially in such a casual place, but I'll be back. Ooh, that blueberry soda in the picture was delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zO84UpO-lAa4TYteS4U0rA",
        "caption": "Photo of Earl's Grocery - Charlotte, NC, United States. Their version of banh mi, orzo, &amp;amp; fabulous blueberry soda",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zO84UpO-lAa4TYteS4U0rA/o.jpg"
      }
    ],
    "user_id": "1VEn9mGPSv2pqvSxBb5Y_Q"
  },
  "9JLGXnw3Dcv_lF_8bdUWDw": {
    "date": "3/4/2017",
    "text": "I'm an avid Earls Grocery customer and haven't really ever had an issue until today when I ordered their Korean Dipped Chicken sandwich. I ordered it as take out and when I got it home and opened the box, it was a very small piece of chicken that was mostly fried breading, a bun that looks like it was the .99 cent for 8 pack from Harris Teeter all hidden under a giant piece of brown lettuce. DEFINITELY not worth $7.99.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wyeXDvIQvSXXSyN_pmJ30g"
  }
}