{
  "Ml1zj7_iRshaWrk_oums4A": {
    "date": "2/13/2016",
    "text": "The customer service here is horrible. I placed a carry out order online and received a call that they are no longer taking carry out orders. I was then asked if I wanted it delivered and after I agreed I was told the wait would be 4-5 hours! It's a regular Saturday night and they close in 1 hour so how is delivery time 4-5 hours exactly?! Needless to say, I just cancelled my order.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8SUq27U2BUDyOJhL-eh9LA"
  },
  "EY9rtvuJY6O2GnCEWpGpRw": {
    "date": "6/10/2017",
    "text": "This is the worst Pizza Hut ever. For starters it takes them at least 2 hours to deliver the food. Then when they deliver it most likely it's cold and incomplete. The Manager is unprofessional or shall I say ghetto and can careless about the food. Walk in the restaurant and it's disgusting. Definitely don't order from this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uEvIHo1k3DQgIZ7XxIHnvw"
  },
  "6rdFaoMdMyMSCqcGY8nidg": {
    "date": "12/27/2015",
    "text": "This location definitely deserves a zero!! The past 3 times I've called for delivery I've been told the approximate wait time is 3 hours....really???? If you order from this location do so well in advance and schedule a future delivery or go and pick it up.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ytpfk9iPRxTgxPBnXSLHcw"
  },
  "6cx42GsyPaM1jV2GrA4AgQ": {
    "date": "11/7/2015",
    "text": "This Pizza Hut is horrible! The workers are rude. I called and held for more than 15 minutes! I should have hung up the phone, but I was so upset I held because I couldn't believe I was on hold that long. This establishment should be closed!!! It's ridiculous!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QuB-QKZjkBbn_1a66dHP-g"
  },
  "2TWk68ZdS0Ay89M1W4YMxg": {
    "date": "12/14/2015",
    "text": "This place is horrible. Customer service is awful!!!! Pizza is always cold. They offer you a credit on your next order but then when you want to use your credit they can't find it. It's awful!!!! If I could give 0 stars I would!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NBGXtpSwT4LBn4aVHiWyxg"
  },
  "PXZXPTzNkxQGb7vxBQAw9g": {
    "date": "12/19/2015",
    "text": "It seriously takes you a damn hour after my pizza is supposed to be delivered for you to call me and say you haven't had a delivery driver since 10pm? This entire store needs to be restaffed, remanaged because THEY SUCK AND MAKING PIZZA,CANT KEEP THEIR CUSTOMERS UP TO DATE OR HAPPY!!!!!! CLOSE THIS LOCATION AND START OVER.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "CmjKhvajIs4RDlcE_iMH8Q"
  },
  "85z5nsrEyvt676lbmJfQuQ": {
    "date": "11/22/2015",
    "text": "My husband prefers Pizza Hut to most other big pizza delivery chains and I do like their chicken.  This is the only reason we gave this location a second chance after they botched our order a few months ago.    The first order was easy: one pizza and a few orders of wings.  Delivery took close to three hours. We called the franchise several times and were told each time that our food was \"on the way.\"  I've googled the distance between this location and our home.  According to Google, it takes 13 minutes to get from their door to ours in normal traffic.  Add cook time, other deliveries, and a courtesy period for (imaginary) traffic and it still shouldn't take 3 hours.  I could have driven to Raleigh, ordered pizza there, and received it faster.  The delivery guy stated that he was their only person doing deliveries that day, so I was willing to give him the benefit of the doubt and assume this was a fluke.  Additionally, the manager did credit us with $20 towards our next order, though.  While nobody was rude during this encounter, nobody seemed overly concerned with the shotty customer experience.  Apathy, now a functioning business practice.  Yesterday, we gave this Pizza Hut another shot.  We placed an online order: 2 medium pizzas with only pepperoni and 1 order of wings.  We received the order confirmation via email and 45mins later a phone call from a NY area-coded cell phone stating that our credit card was declined and then the call dropped.  So at this point, we don't know who the phone number belongs to or if someone is trying to rip us off.  An hour and a half in, I called the store and was told by the employee that our order status was fine and that the pizza had already been sent out.  No apology for the delay or the explanation for the cell phone call.  At the two hour still-no-food mark, we received another call from the bad-reception NY cell phone.  It's the manager. He apologized for the bad reception, which was because he was under the Viaduct (the only Viaduct I know close to Charlotte is in the mtns). He stated our credit card was declined, but that it was sent out as a cash order.  I asked why they'd send an order out that was declined, what if I didn't have cash, and why the store didn't ask for another credit card when I called... no answer to either question.  The manager, I'm pretty sure Drew, said our order would be free and to just tell the delivery guy when he arrived.  To recap: the BUSINESS solution was for the us to tell the delivery guy that his manager said we didn't have to pay; we quickly placed an order with HH Gregg for a new TV based on this gem - \"No no, it's cool, bring our new curved OLED right in. I know you haven't received payment yet, but your manager said it was cool.\"  Again, when the pizza came, it was cold. And again, the delivery guy stated he was the ONLY person who was doing deliveries as they were again short-staffed.  It begs the question: why was the manager hiking at the Viaduct when he probably could have been helping his staff meet delivery obligations?  Stoners of the world, rejoice, because here's your ticket to free food:  Step 1 Order 2.5 - 3 hours before you actually want to eat, Step 2 An hour into your wait, call asking where your food is (you'll be told that order has already been sent out), Step 3 Wait another hour and get baked, Step 4 Call again (because there is no chance in hell you would have received your food by now) and express your sincere displeasure at which point they will half-heartedly apologize and comp your order, Step 5 You food will arrive, tip or don't tip, that's on you, but just know the I'm-The-Only-Driver schtick has been in place for 3-4 months already, Step 6 reheat and eat your food.  On second thought, six steps might be too many for stoners.   Will we order again? No.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8kn-9inZRq-K0IKRXmhgxA"
  },
  "03Yn0QZt6DyhVA6t6jSG_g": {
    "date": "4/29/2014",
    "text": "Ordered my pizza online and went to pick it up and they put the wrong toppings on it and I said it was the wrong topping and the guy acted like I was an idiot and didn't know what I was doing. I usually eat dominos but we wanted something different. Prob won't go back here for a while.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OqXlL9J2cNjY5e-6t3ZPhw"
  },
  "UXfAKDUk5-IcNzuOg-Xs0w": {
    "date": "2/26/2016",
    "text": "I never got my pizza and tried calling several times starting at an hour after my pizza was supposed to be delivered. Then when they finally answered one of my calls 3 HOURS later the woman said that they don't deliver to my area even though I placed my order online and it gave me the store in my service area for delivery... She then had the audacity to say \"well if you had called earlier I would have had it delivered.\" I work 12 hours on 3rd shift, and can't leave my place of business. Now I'm without dinner AND it's going to take 3-5 business days to get my money back. Never ordering from here again and definitely calling customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XfZmDoC8qgUsBvVpmptGsg"
  },
  "QlIQTcKNJUzqMlDJH7TOCQ": {
    "date": "12/6/2015",
    "text": "Rudest interaction of customer services I have ever had . I always call Papa Johns as they are closer. My husband likes Pizza Hut so I said \"what the heck\" and went on line set up an account and placed and order . First I placed the order at 6:00pm on a Sunday .. It said I got free breadsticks but wouldn't allow it as I ordered a special.. No biggie... So I place my order on line and get a receipt saying my pizza would be here at 11:59pm.  I thought \"ok I'm sure they're busy with it being a big football night but this is a mistake\".. So I called I waited a while and finally a girl got on the line who was the rudest person I have ever spoke with .. ( I deal with people on the phone all day so would rather give praise than a complaint any day) She rushed through her greeting, not that I could understand a damn thing she was saying ... All I caught was some slurred , ghetto half asses attempt at saying \"pick delivery, carry out? \" I said hey I know you're busy but I think there is an error I placed and order on line and it says my food won't get here till 11:59pm.. She said \"that's because delivery has a 3-4 hour wait ... (REALLY WTF? Who would order a pizza at 6:00 and be cool with getting it at midnight)  I said, \"well an hour I get but can you please cancel my order \" .. She started yelling to someone in the background and said \" your orders void, there ain't no charge on the card\" ... I said ok great as long as I wont be charged ... She said \"there ain't no charge... And hung up on me .. Well fuck you Pizza Hut .. There is a charge and I will be calling your manager tomorrow to make sure it's removed (as I get its a Sunday) and then your corporate office to compliment them on their half assed shitty customer service... Who the hell would order a pizza at 6 and want it at 12:59pm ? Why would you even place that order ??????I don't eat pizza much but i will choose Papa Johns any day over that shitty service ... Get it together !",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rckjLcYiZNr0agDMXPZrcA"
  },
  "hJU2CMnAVeeS43YFZjVspw": {
    "date": "12/18/2015",
    "text": "One of the worse experiences with pizza ever! Waited 90 minutes for my delivery. Box was soggy, minimal cheese, burnt onions. There was no sauce for the breadsticks. When I called them, I was immediately placed on hold.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0ev8A4zH64dO8vAUdlQQA"
  },
  "r9PTJwNVOdzTGToqhuUWrw": {
    "date": "1/6/2014",
    "text": "Terrible!!! 2nd time we have ordered from this location. Wait over an hour both times and we live less than 5 min away. Main thing is taste is disgusting. Taste just like store bought digiorno. Hard crust. Way more crust than cheese and just no flavor!!!!  Going back to dominoes &/or papa johns",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CmpejzlCSNUhXpUoS7JfVA"
  },
  "bGVrluBFIxDLczJLZUkF8g": {
    "date": "9/25/2014",
    "text": "Customer service was awesome for me. Pizza was about an 8. I gave an extra point because the veggies were really fresh. If I had to go off of the lady on the phone taking my order alone...10s across the board!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cifpp_mmT_a1K5tgYa_Avw"
  },
  "776hE3GNJB6l_4Is2pndiw": {
    "date": "2/15/2017",
    "text": "So sad that I ordered from this particular establishment. We order pizza religiously here via carryout. I ordered 2 large one topping pies and called the phone number 704-529-0701 to inquire how much the pies are. The young lady stated $6.99. I knew this, but the reason for my inquiry was because my son came home with a bill in the amount of $21.65. I told her this and she asked for the ticket number which I gave her. She then blind transferred me to another individual before explaining that I was overcharged. I explained again and she stated that she would grant me a credit of $10.00 since I had overpaid. She placed me on hold and then came back stating that now that they are under new management, you can only obtain this everyday special with a coupon that should be on the box. My son had no coupons on the box. She then transferred me to Dominic, the Assistant Manager who stated that the General Manager, Marcus no longer grants this special unless there is a coupon. Too much to deal with. I will contact the GM tomorrow. I don't want a free pizza. I'm not trying to scam for a credit. I just want them to adjust my bill. I also pick up many pies for United Health Group each month. They just lost a family of 6 and about 50 pie orders per month from my place of business due to their lack of professionalism. Really sad. Never again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ysg73fAEpriKndtiMQpnWQ"
  },
  "LLnsS-cpEIP9YU0yH0Br5g": {
    "date": "2/14/2016",
    "text": "To start, I would absolutely give negative stars if possible. I ordered a pizza from this location at 10:04pm with an estimated delivery time of 30 minutes. After 1 hour of waiting, I received a call from what I believe to be the manager. He says that he has no driver, and canceled my order. Didn't receive an offer for a rain check, or for me to come get the pizza for free. Just \"I canceled your order.\" I will never give this location my business ever again. Shocking to me that a location can receive so many bad reviews and still be open.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HXSrr0s9e_LsGTgkkKiclQ"
  },
  "PPFrWhviQED3lvVYP21FbQ": {
    "date": "12/16/2012",
    "text": "I ordered a pizza on the web. Was automatically given this location for delivery. In fact, I've ordered delivery from them many times in the past 4 years. 2 hours later and the pizza hasn't shown up. I call the store (even got the number from my confirmation email) and they try to tell me that 1) they \"never got the order\" and 2) they don't deliver to my house. Absolute B.S. The young lady I spoke with was rude and dismissive. She tried to tell me that the Lake Wylie store delivers to my house. That store is 13 miles away and IN ANOTHER STATE. I can only assume that 1) Pizza Hut hires incompetent web developers or 2) the local staff were too lazy to do their job and canceled my order. Either way, I will never be eating from here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7gbLDIMl3C1TePOxlOkBmw"
  },
  "ysak-0gY89ynSrqImryODQ": {
    "date": "10/8/2015",
    "text": "Awful customer service. Placed an order for a medium pizza at 6:15pm and was told pizza wouldn't arrive until 10:00 pm. The time before this our pizza arrived cold with the cheese as hard as a rock. If you like Pizza Hut order from a different location because this one will surely disappoint you!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TcWu9S_cAdYcrx9Ko8OsBA"
  },
  "hH6ZERECKns2OrbKTKKoKg": {
    "date": "8/29/2016",
    "text": "If I could, I would give this place no rating at all.  I placed my order at 7:35PM on a Monday and when I received the email, it said the \"possible\" time it would be delivered would be 9:26 at night (which I find ridiculous to begin with).  So an hour goes by, I think okay I'll just call and see what time they can quote me for.  The girl that answered the phone didn't seem she had a clue about when it'd be done and said \"ummm it should be there within a half an hour.\"  I said ok, and when another 45 minutes went by, I was starting to get really irritated.  I waited until 10 minutes PAST the time they said it would be delivered, which again mind you was 2 hours.  I called at 9:36 at night and said \"Hi, I placed an hour two hours ago and I still have not received my pizza and if the delivery driver has not left, I want to cancel my order.\"  The girl that answered the phone said ok what is your number and said ok i'll cancel your order.  I said how does it take 2 hours to make a pizza.  The girl said \"ma'am it doesn't take 2 hours, your order wasn't supposed to be ready until 9:26\"  I said yes and it's 10 minutes past that.  she goes well the driver didn't leave until 9:05.  I said okay, well this is ridiculous, I live 3 miles away it doesn't take a half an hour to get here and you will no longer be getting my business.  The girl seemed to have snickered almost and I hung up the phone.   The customer service was horrible.  Even on the busiest of days, I have never had to wait 2 hours for a pizza, let alone on a boring Monday night.  It's a shame to me because I love pizza hut over any other pizza place and I now have to go out of my way to get it because there is no way I will be going to that Pizza hut again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sfBfVTg4zEHC3UGbXSMa8A"
  },
  "mOJsp7VNPCQrVpf1qJDAIw": {
    "date": "3/13/2015",
    "text": "I've had quite a bad experience with this pizza hut. My roommate and I ordered a pizza a few,weeks ago, the wait was ridiculously long. After about 2 hours our pizza was delivered. We open the box and it was wrong! We called the store and they gave us a credit for a pizza of equal value. The other night we decided to use our credit. We called the store and were greeted with such a rude tone. We told the girl on the phone about our prior experience and how we have a credit, she was no help. We asked if there was a manager we could talk to and she told us she was the manager. We held our heads in exasperation, and gave her our number again.  Turns out we did have a credit. She told us we gave her the wrong number(we didnt) the pizza finally gets here and is completely wrong. Not wanting to have to wait the extra time for them to deliver the pizza we went down to the pizza hut location. Turns out the girl on the phone wasnt a manager at all! We talked with the real manager, who was absolutely understanding. She apologized and everything else was good. The only reason im giving two stars instead of one is because of how kind the actual manager was to us. The pizza was good, but nobody should have to go through that much trouble to have dinner.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cvb2n9zgspc_4jxMUpnrMw"
  },
  "0aKNvy1M5mVp0Med6PhM5w": {
    "date": "11/20/2015",
    "text": "I have been a Pizza Hut customer for over 20 years. I received the worst service from this Pizza Hut. First of all, I called my order in..very basic order, just cheese sticks and a personal pan. I was told it would be 20 minutes. I get there exactly at 20 minutes. I was told that they were behind a little and that my order was just now being put in the oven. That was cool..I understand things can get behind. So I go and run some errands. I get back almost 20 minutes later to find out (after waiting a few more minutes) that my food still had not been prepared. I requested a refund. The manager came up and gave my money back and said he would just give me my food for free. After waiting a while, my personal pan came but no cheese sticks. I asked the cashier about my cheese sticks. She went back to the manager who told her to tell me (1) he never promised me cheesesticks (lie #1) and when I countered that lie she said (2) that they ran out of cheesesticks (lie #2). I will never go back there. Very incompetent, ghetto staff there. But lucky for me, I found who owned this Pizza Hut location. A company called America's Pizza Company, phone number is (337) 289-0404. Ask to speak to Nicole! I don't play when it come to customer service. I called Nicole who apologized (although she seemed uninterested in knowing which store it was) and claimed she was going to send me coupons for free pizza (I have yet to receive them). Also there were other people who were waiting a long amount of time for their pizza and was equally frustrated with the staff there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "By02RKrc0BG2lGhT5bSgmw"
  },
  "jIucFFzXAzjKt4KfB-C5sQ": {
    "date": "3/7/2018",
    "text": "This was a horrible experience. We ordered takeout and I was going to pick it up. They said it would be ready in 30 minutes............ well that definitely was not the case. I actually showed up 45 minutes later so I could be in and out, and my order was not even filled yet. I waited for another hour which I should not have but I am a pretty understanding and patient person. When I finally get my whole order a hour later it was no apologies, no comp, not anything. I received a poor attitude when I received my order and what's even worse was I found out who took my order and she was sitting down waiting for her ride because she was off the clock. SHE WAS THE MANAGER!!!! Wouldn't recommend this place to my enemies.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "slhBGsKq7V9o93Mn9DVcIQ"
  },
  "cLY29f3JXeoeh0pgjDdhMA": {
    "date": "12/28/2017",
    "text": "Worst Pizza Hut ever. Placed my order online 20 minutes early, then drove 10 minutes to get to the location, and the food wasn't even in the oven. The guy in the back making pizza not wearing gloves and taking forever to even like one pizza.  I am at 40 minutes and still no pizza in sight. I will never order from this location again. Doesn't even deserve one star but had to press it to enter a review.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oFVHhkVTm4v1KhLHcCJ8ng"
  },
  "dMVCgkgrvigp2T6GgHcSAA": {
    "date": "5/3/2018",
    "text": "Has to be the worst customer service of any pizza place in the country!.. placed an order 3 hours ago for 1 pizza.. online order said 75 minutes for delivery... called after 2 hours and after being put on hold I was told my pizza is next one to go out.. now an hour later still waiting .. place is only a mile away and im sorry no pizza place is that busy !!.. do ur self a favor and avoid this place at all costs.. Pizza Hut corporation should really look into this because according to all the other reviews his is a very common problem !!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tn9t6z1Te6qF4Mrp7Dv07w"
  },
  "iyXRQN9Xnwdde9IWcv2rXA": {
    "date": "12/27/2015",
    "text": "Dirtiest Pizza Hut I have ever been in. Stop delivery at 7PM. Do not order from here.  Claims a 95 health rating, have no idea how they got this. Pizza was very greasy, made my wife sick  Not sure how the Pizza Hut corporation could let this place stay open.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "74BniCS3gWgiCfEgqTo16w",
        "caption": "Photo of Pizza Hut - Charlotte, NC, United States. Warming oven.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/74BniCS3gWgiCfEgqTo16w/o.jpg"
      }
    ],
    "user_id": "HjO3Qi54UwnfIPwZCdloPQ"
  },
  "mX-zUlI-HQ9th8VE6BdssA": {
    "date": "5/9/2018",
    "text": "This is the worst Pizza Hut on the planet. I walked in and stood there for 10 minutes without even being acknowledged. The guy was literally 2 feet from me and saw me but totally acted like I wasn't there! Another guy saw me from the kitchen, but not one word!! I just walked out, got in my car and left. I couldn't believe that that happened! This place doesn't even deserve 1 star.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pt_AKBv-EbP_-9_zFTofOw"
  },
  "wQHpFNWDh36lbFiCnAj7yA": {
    "date": "3/1/2017",
    "text": "I hardly write reviews but this Pizza Hut was so terrible that I had too. Last night placed an order at about 10:30 pm for delivery but I never received it. I called them up several times but no one picked up. They charged my card as well for something which I never received. When I called up the store they say that the driver wasn't there so we cancelled your order. I was not notified at all about this. There was no apology but rather very rude. Now it will take about 4 to 5 business days to get my refund for the order which I never received. Please don't make the mistake of ordering from here unless you want to sleep starving.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "R7CHtOyimM28DTpWZ-xktQ"
  },
  "Md60Ei8LNGYU2tDB_1RbQA": {
    "date": "12/21/2016",
    "text": "This is by far the worst experience I've had with Pizza Hut I use to love them but now I'd rather go elsewhere. I've given them multiple chances and I've had to wait many hours for a pizza and when I call no one ever answers. I've gotten pick up and there's only one person there and you have to wait up front at the counter for at least 10 minutes before anyone says anything to you. Do not go here or order here go to pap johns",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "z7NIiT6jIkH2umShVKQ1Iw"
  },
  "7l5-cyRW2Bja9KxS0HA0lg": {
    "date": "10/28/2013",
    "text": "Hello friends,  This fine Pizza Hut is located in a small strip mall. That had a soul food place, a gas station and some other something. It was football night and my buddy was buying..sooooooo fast food pizza it was.  This has to be the smallest business I've ever seen. All i could keep thinking to myself is, \"wow, this is what a sweatshop looks like\" . It's carry out or delivery ONLY.   As for the pizza, it was good considering. It also helps that we picked it up so it was pretty hot. It looks janky on the outside & it's pretty small on the inside and looks like it could stand a good washing. That's my reason for the low star rating.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "67KNSgenJSr7IASZw0xNwA",
        "caption": "Photo of Pizza Hut - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/67KNSgenJSr7IASZw0xNwA/o.jpg"
      }
    ],
    "user_id": "xhlcoVm3FOKcxZ0phkdO6Q"
  },
  "FMSBzGZpetlh4bReqvknQA": {
    "date": "12/11/2017",
    "text": "Delivery service unreliable and customer service non-existent. Ordered online ahead of time. Received a text that the pizza is out for delivery but never got delivered. When I called the store they said that the order was cancelled and they didn't know why. And since the delivery guy was already gone there's nothing they can do to help me. Called back to talk to the manager on Monday, and she said that since she wasn't working on Saturday she couldn't help me. She didn't know why my order was cancelled and to call back to talk to different manager.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z2Mm3WccnELvv5841FZxXw"
  },
  "V74yBKlirKsI_uQvo1zXzA": {
    "date": "4/3/2013",
    "text": "There was an impromptu game of Risk happening at the ol' homestead the other night... I was one of the last people to know about it... lol I hit the phone booth and changed into my alter ego \"SuperHostess\"... I ran to the local grocery for snack staples: chips, dips and drinks...  I would have tossed a lasagna into the oven, but I only had about a half hour... (I believe this is where someone says, \"Ain't noboby got time for dat.\")  I elected to call the local Pizza Hut and get some vittles...  Luckily, there was an awesome special.  A large pizza with two toppings for $7.99 for carryout only... That'll do it!  We ordered two: pepperoni/sausage and pepperoni with extra cheese...  I ordered some breadsticks to go with and was quoted 20 minutes... I got there in about 25 minutes... I like to give a little cushion, just in case... Turns out I didn't need it... The food was sitting right in the warmer when I got there...   The order was correct; all of the pies and breadsticks were nice and hot... The service was fantastic (Thanks, Em-Laaaay, for the best laugh ever with your awesome nametag)... When I got back to the abode and the folks got their nourishment, everyone was pleased with the quality...   I'll definitely be ordering from this place again... They saved me in a pinch without a hitch...",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ttZSRwCZiFMXwUO2Vr9pBg"
  },
  "ADgWgycha8l0OWuc7Cyl_g": {
    "date": "10/2/2016",
    "text": "If I could give this store 0 stars I would. As we speak I have been on hold for 15 minutes after making 2 previous calls and getting hung up on after asking to speak with a manager. My delivery was quote for a 2pm delivery and its going on 3pm. I call and ask whats going on with my delivery, and they proceed to tell me that my order was just sitting in the \"hotbox\" waiting to delivered. Last 2 times I've ordered pizza hut from this location, I always get the same answer and my pizza always come to me cold and rubbery. I'll just order from the Papa Johns right down the street from now on.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7NUIcgGVf_s-77f0-5aWhw"
  },
  "wFTisPEFGzMT1ZTeud_SjA": {
    "date": "12/19/2017",
    "text": "To start with if you can get what you order the pizza is fair. But the staff ( cooks ) are far from adequate. We ordered pizzas and got home to a hungry family only to find the wrong pizza. Immediately called to complain about the wrong order and was asked if we wanted to travel back to get and another pizza but would not deliver one. We said no and then they offered to give us a credit and put it on our phone number. We agreed and that was the end of the problem (solved). BUT wait we went to the store several days later to order another pizza and use our credit and was told we didn't have one under any of our phone numbers. Finally after requesting the manager she did give us the credit, ordered the pizzas and they came out missing the olives!!!! Instead of waiting for the one pizza to be remade and the other one getting cold they put olives in a cup and sent us on our way.  Pizza Hut you have lost a customer!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2SS9QhJ9lfal0mW3nW8bvw"
  },
  "kib8GRIWFKxmoexpTVb0Kw": {
    "date": "4/7/2015",
    "text": "Bad experience....even poorer resolution from management. There are great Pizza Hut's and not so great locations. This place gives the crappy ones a bad name. .....but, they are busy as hell so don't expect service or quality to change any time soon.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SMJKnaQ1ph88xrP0JCktCw"
  },
  "kclDEUBpWpiQH424yPZfLA": {
    "date": "1/27/2013",
    "text": "My friends and I were hungry for some pizza so I figured why not give Pizza Hut a try.   Of course, everyone wanted something different so when we ordered online we made tons of special request. We ordered the special with a large pizza, easy on the sauce with half pepperoni, ham and banana peppers, the other half with Italian sausage and mushrooms. A side of regular breadsticks with marina sauce and a 2 liter Mountain Dew.   We got the confirmation....our order would be ready in 30 minutes! The wait seemed like forever, but when we got there we were pleasantly  surprised to find our order hot and ready AND prepared according to our instructions. YES!!!!  The pizza was good, the breadsticks were nice and crispy and overall it was a really good and satisfying meal! We will be ordering from here again!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "uia4vdC8p9t0oitfHBN1RA": {
    "date": "11/5/2016",
    "text": "Wow. Ive been ordering pizza from this location for a long time. I expected my order to take a while, but it came within 30 minutes of my online order! And it was hot! So unexpected! I don't know what happend, but thank you! Please please keep it up! I am not a Domino's fan nor A Papa John's fan. I will always be A Pizza hut fan.. thank you for making my night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_GsG5CyyMPsiVND4MrAQfw"
  },
  "eCa9P3uDShXmaCSYpL8GGA": {
    "date": "1/17/2017",
    "text": "Most of the reviews for this location are terrible. I've tried to order from this location before but every time I call they would immediately tell me they had a 3 hour wait. I obviously chose not to order. However I called this time and there was no such disclaimer. So for the first time in 3 + years living over here I ordered pizza hut!! Oh Pizza Hut thin crust how I've missed you. The girl who took my order was a tad on the rude side. Nothing implicitly rude, just a general blah attitude, in a hurry up and order your wasting my time kind of way. Once I ordered she said to give them an hour to and hour and a half for delivery. I think it took a little under an hour and the driver was at my door. She was very nice and pleasant and the food was very hot, (as it should be since I don't live far from them). It was pizza hut as I remembered, except the marinara was a bit runny. So overall I will give them a shot again sometime. I don't even try to order from them usually since their online/app ordering doesn't work for me. It tells me that no stores deliver to my address even though I live a few blocks from pizza hut. They seriously need to update that situation. I am all about convenience and calling my order in just isn't as convenient as being able to order electronically. Yes i'm one of those people who would rather text than talk... sorry just who I am :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HhYUDP1vR7CSRi2cvfai0Q"
  },
  "90AJ4PYSSyhtX_oX-mJ6Mg": {
    "date": "12/29/2015",
    "text": "Horrible pizza! I ordered pizza for my staff and when the food finally came, we had to go out and get it because the driver didn't \"know where we were\", nor did she even attempt to ask us where the closest entrance was. The pizza looked as bad as it tasted. It appeared to have been sitting out for a long time before it was delivered. I will not be ordering from here ever again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cp-knvvckUKSML2qYKMmrw"
  },
  "L5EE-XQ9_US96Z9Vre5THA": {
    "date": "5/9/2017",
    "text": "All I can say is do not order delivery from this place. You may or may not receive your food, and if you do, it will be an hour or two late. Also, they might forget part of the order and have to drive back to the restaurant to pick up the rest of it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c1X4UiOvT-CWc4-7kqD68A"
  },
  "pHBLh1ZGJQTozGdBAxji6w": {
    "date": "7/31/2017",
    "text": "If you want your pizza to be sitting in a delivery guys car for an hour + time and arrive cold then this is the Pizza Hut for you. They get your orders wrong they are always cold. The workers are extremely rude. Go with another pizza place because this location is the worst!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HxGxIHKbjJ1ANersnSaZ1A"
  },
  "aRoytGWqayVrYOpoOfm0BQ": {
    "date": "7/5/2017",
    "text": "What a joke.  Ordered a pizza online only to find out AFTER I completed the order that there was a 2 hour wait.  Then, when I called to cancel the order, the rude little twit that answers the phone just dropped me on hold.  I never once got through again.  Beware this scummy outfit.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p941DHskyAuTJjBCi-VU8A"
  },
  "GWVUbF7SJAZDlIe5A2hwvg": {
    "date": "9/7/2017",
    "text": "This place is great when it's good. Service polite.  Deals everywhere  But when the sun goes down .... it's a crap Shot and they seem to enjoy shooting snake eyes for the customer.   Tuesday, I placed my order online for 9:30p pick up at 6:00pm. I arrive at 928p and sat in the car. Walked in and had to wait ... no worries.  Got to the counter, paid (because you can't online)   then proceeded to wait 18 minutes without warning nor apology for a personal size pan.   I'm over it but I resolved to complete the pizza Hut survey with the hope that things may improve. We Shall See.   Why did I order in advance?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "r-zUIQPaHzvIyL93wQaoiQ"
  },
  "rJLjHkC-uLsVnHoVJsEK_A": {
    "date": "6/12/2019",
    "text": "Hey here's an update! So I can't suggest enough to take your business elsewhere!!!  So the other night we ordered a pizza from here on line. It said it would be delivered by 10:50.  They charged my card, they sent me a thank you email. We waited up till 1:00am and it never came. Called there the next day and they said they didn't have the order in there system. So I had to drive over there to get a refund. And they were hesitant to do that. So when it's all said and done they offer me a store credit. Just now went on line to redeem it and couldn't do it that way although it did say 20-25 minutes for delivery. Anyway so I call in to redeem the credit and they say it's a 31/2 hour wait. WTF???? So I call the corporate office and tell them everything, and these PIECES OF SHIT, hang up on me!!!!  No I don't use foul language nor was I being argumentative.  Now, right now,  FUCK EVERY KNE OF THOSE BITCH ASS MUTHER FUCKERS!!!  FUCK PIZZA HUT!!! I will never EVER EVER give them a fucking dime!!! DON'T WAIST YOUR MONEY!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qz6jpfNMNPTiqSxrIVpbKg"
  },
  "FDcnE-xDtbvKIsWiIMeltg": {
    "date": "9/24/2019",
    "text": "WORST EXPERIENCE EVER! Rude, unprofessional, and terrible staff. Very short staffed and restaurant was dirty. Ordered pizza online and after 2 1/2 hours of waiting, decided to cancel and order for another restaurant. The manager on duty stated she had no control over the drivers and had no idea wheee my order was and when it was coming. I DO NOT RECOMMEND this Pizza Hut and will never order from them again. Lesson learned.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "csFlyjR-WXb7e1mjZfvq8A"
  },
  "sfvX1zMjGxWLUaDOLNeVpQ": {
    "date": "4/30/2019",
    "text": "The order was quick but instead of a Hand Tossed Pizza and got a weird dry flat bread pizza! I also asked for pepper and Parmesan but they said they don't have any which seemed really weird. Didn't feel like a Pizza Hut location at all. Felt more of a mom n pop pizza shop. It would incredibly difficult to try to come back to this location again. I would rather go to the upgraded and nice looking Dominos location further down south Tryon on Sandy Porter road!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u-NbxbNdh7GZGnwxXUitYg"
  },
  "timYUIXh3JOxSKB8kY2-hg": {
    "date": "8/30/2019",
    "text": "I'm giving a 1-star rating but that's only because i can't leave a zero - Seriously. Every time I order a pizza from there, pickup or delivery, it's a problem. I've gotten cold food, or pizza with barely any toppings. Tonight the hood rat workers decided they wanted to leave early and weren't making pizza after 11 although the store is supposedly open til midnight. I put in an online order and paid online for it. I get to the store and there were two workers there, a lady and a man. The door was locked. I knocked three times on the door, she heard me and kept ignoring me. Then tells me I was \"hostile\" so she's not opening the door because she's \"in there by herself\". A blatant lie. The warmer was empty and they were wiping things down preparing to leave. My experience with this store is that most of the workers are lazy, the food has zero quality and that means there must be horrible management. I don't know how they have any business but I'm officially done with all Pizza Hut. At this point I've complained so much that they just give me free pizza all the time but even the free pizza isn't worth it. I hope they shut that place down.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5wfRhQ6oG1IWgYGTsedovw"
  },
  "svm6DEf1qaFtFrutE9IUhg": {
    "date": "5/16/2019",
    "text": "My order was received at midnight I ordered at 9:30... The order was for a pan pizza regular cheese extra pepperoni... In addition to their not being extra pepperoni and cheese or not quite all of the pizza I had to cook the pizza myself because the dough was still raw...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y66kFbllps6y-pRDpacn-g",
        "caption": "Photo of Pizza Hut - Charlotte, NC, United States. Pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y66kFbllps6y-pRDpacn-g/o.jpg"
      }
    ],
    "user_id": "mgDnzO4X_0ZHMPBTASWSRQ"
  },
  "N8rYWHHy5Wm-Ub3snDCJug": {
    "date": "6/4/2019",
    "text": "No sanitation grade posted. When I asked about it the girl said she asked her manager about it and he said they'll get to it when they get to it.  Won't be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GnS71POxE5o2Uell9V_2Zw"
  },
  "ROapWm7SOctctbiq8goIwg": {
    "date": "12/6/2018",
    "text": "DO NOT GO HERE. Usually it's okay besides the terrible customer service, however this time I got food poisoning from their pizza. I should've known when i opened the box and the pizza looked old. Never again",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tNluDtVPLhndDO3YXrngvg",
        "caption": "Photo of Pizza Hut - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tNluDtVPLhndDO3YXrngvg/o.jpg"
      }
    ],
    "user_id": "FjfM_YfaSbcpmb-4ZY6amg"
  },
  "AAHl3j9UjVmXmJIT94PshA": {
    "date": "5/16/2019",
    "text": "This location disappoints. Customer service is lacking, wait times longer than average and the pizza is typically under-cooked. The Domino's and Papa John's further down South Tryon Street are much better.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBs9C8XnE8Py8yji7EF3nQ"
  },
  "a5Omg_hVTg6jMJ4p_j4Wbg": {
    "date": "10/26/2018",
    "text": "We've given this Pizza Hut plenty of tries, but always find ourselves frustrated and disappointed. The pizzas themselves are perfectly fine as long as they actually arrive, and that's where the hard part comes in. For reasons unbeknownst to us, pizza deliveries from this location are always 1-2 hours late with no apologies or excuses. Please be warned: DO NOT order from this location. We will be taking our business elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3-_JDUTpNXDhzpWRif_yQQ"
  },
  "7r0k3cWyFUbdzkQ4e0Zkpw": {
    "date": "1/3/2019",
    "text": "First and for most, I've been ordering from this Pizza Hut since they opened and here recently not only does the food suck the customer service is terrible. If you have a problem or issue with your order you are unable to reach anyone because they calls go to a call center. With Pizza Hut being a multi million dollar company you would think they would do better but they haven't i have written to corporate and still no answer.  They don't have to worry About me ordering from them ever again",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pn9LWm9p7lFUivsGxvbvMQ"
  },
  "Ujd-cfhuKlrV49S3-4pjCA": {
    "date": "12/6/2017",
    "text": "This was my first time using the order for a future time option.  I set it for 445 to pick up the pizza. I got there at 448....BOOM! Pizza was ready. I paid, grabbed my 2 liter and left. I will say the traffic situation getting out of there is not ideal but overall great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k9pA-xp_9pg6xu_eFYwYig"
  },
  "d24weTE0xGQRI13PaesMYg": {
    "date": "6/24/2018",
    "text": "So the pizza came super fast so initially I was impressed UNTIL I realized the stuffed crust was so light that it couldn't be done. I tried it just to confirm the dough was not cooked thoroughly. Disgusting. What a waste of $18. NEVER ordering from this Pizza Hut again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tWz7nGOSznFgp_VRFmHiFg"
  },
  "fkgPxv69D9EGMxaPWg2tiQ": {
    "date": "6/5/2019",
    "text": "First and foremost I am extremely upset at the level of service I received. Here is why, I placed an ordered online at 8:06pm I get an email confirmation to allow 55 minutes max  for my delivery the email stated at 8:55 my pizza would be here I gave it a little over an hour then I called I speak to a male didn't get his name and asked if he could give me the status of my delivery since it's been over an hour and I haven't received my food. He states the online is messed up  I should've called and gives the wrong ETA. He offers a credit since I've already paid, then he puts me on hold and says he will get the pizza to me in 20 min since I stay not even 7 minutes away.  I have already been on the phone for over that amount of  time so I knew  that was bologna. Then I get on the phone with Nala who says she's the manager in training since there wasn't a manager available  then she apologized and applied the credit. She told my my pizza will now get here  before 10. The pizza guy gets to my home at 10  pulls out the driveway and drives off he comes back a few minutes later with Pepsi in a QT bag so, I'm assuming he forgot my sodas. He apologized again I signed the receipt he left . Then  upon checking my order I realized it was not complete and my pizza was extremely cold. I immediately called back, spoke to Nala again she apologizes and says she will  have the driver bring my other wings and call back she also, advised that I come in tomorrow to speak to an actual manager . Further more, the wings I received were the size of small chicken nuggets (five of them at least) then the other 3 might has well been non existent because, it was literally 3 pieces of crumbs  with no meat whatsoever.Lastly,  It is now  11:11 I still have not received a call back or my other order of wings. In conclusion, stop apologizing, fix your online system  since it's always broke and communicating wrong eta and hire more people since I was told by Nala you guys only had 3 people working.  Better yet don't even take online orders since that's always an issue here. If my kids weren't craving pizza and you guys weren't the closest one with stuffed crust I would not have ordered from here 0 stars if I could.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D37D1TpWXbODSthxZQnNOg"
  },
  "OqTt_eKWaZwfL_aZx4A9cQ": {
    "date": "2/10/2019",
    "text": "Not only do the employees lack customer service skills, they seem to have no motivation to get things done in any timely manner. But worst of all, is the terrible hygiene!!!! During my last visit, I observed a health code violation. The lady cutting the pizzas walked outside for several minutes, came back in with things in her hands (a purse and something else, I'm assuming her cellphone,) and went straight back to cutting pizzas. Didn't wash her hands! Her being the last person to come in contact with food, DIDN'T WASH HER HANDS! I was appalled! I filed a complaint. No word back as of yet. And I will not use this location again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s0mj8ksVY_4W8MinV70zCw"
  },
  "2fioGuqP7ywtat5oN3FrPw": {
    "date": "8/2/2018",
    "text": "We ordered from this location tonight at 6:36 PM and the online tracker said it would be a 35-45 minute arrival. We have two toddlers and some company to feed. We ordered a large pie, a medium pie and an order of breadsticks. By 7:50 we became frustrated and called the store, they offered us a $20 Pizza Hut credit and explained he was late because it was wet outside. Finally, the delivery driver arrived at our door almost an hour and half after the time of delivery at 8:30PM with only 2 boxes! We only received the medium pizza and breadsticks and they were both very cold, we were shorted our large pie. After the delivery driver dropped the order off, I tried calling the store (was on hold for 15 minutes before anyone answer) and finally spoke with someone who offered yet another $20.00 credit. I explained I don't want a credit, I don't want to pay for a pizza I didn't receive. She said please hold for the manager. After another 15 minutes of holding someone who didn't introduce herself asked how she can help me. When I explained myself to her now for the second time, that I wasn't paying for a pie that wasn't delivered she said please hold. I have now been on hold for 43 minutes and they never answered me back, but hung up the phone. This is unacceptable and I am appalled at the lack of attentiveness to the customers in this community.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "nmW-p728DygT7hdHK3wf9Q"
  },
  "X5dBke4_ZBwP2yroJTe5Ag": {
    "date": "4/19/2016",
    "text": "I placed an order at 6:30pm tonight and JUST now received it. (8:30pm) Now, I could understand if I had ordered for a bunch of people but my order consisted of ONE medium pepperoni pizza and an order of bread sticks. I ordered a hand tossed pizza, what came was close to a thin crust, which is fine, not what I ordered or expected but not upset over it. I'm not going to complain and disregard the positives. There were two positives though, the bread sticks tasted fresh and the delivery driver was very pleasant.  This is not the first time I have had issues with this Pizza Hut. A few months ago, I placed an order online and about five mins later, I get a phone call saying \"We aren't delivering anymore tonight\" This was roughly 7:00pm. This pizza hut is giving ALL Pizza Huts a bad reputation. I do believe I will stick with Marco's Pizza from now on. Sad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VlcasgkqiTuPi-nVT7rEtw"
  },
  "RY3izmEQg-_i0jHVltjfvg": {
    "date": "10/22/2017",
    "text": "Worst Pizza Hut in the country!  Ordered pizza and after waiting more than 1 1/2 hours I called to ask where the food was. I was told by the person who answered the phone that she just had 2 people quit and that she sent the food and no one answered the door which was a blatantly lie as we were sitting outside the entire time waiting on them. They just don't care and I will never order from this store again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "toDWdipuufY2qwVy0QR13A"
  },
  "ONv96QvnBA4YUt9yRtcnaw": {
    "date": "4/21/2018",
    "text": "The pizza was inedible. Spent 40 dollars and had to throw it out. Don't even want to call because they'll give me a credit, and I'm never eating there again. Any Pizza Hut. It actually put me off pizza for life.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkMByHdod8RO6o0XbdmF8Q"
  },
  "H_otGf7rjxx5bHKl9PchVg": {
    "date": "3/22/2019",
    "text": "I was really craving pizza hut haven't had it months so I decided to try this one since it was just 1 exit down from me. First off let me say the shopping plaza that it is in is suspect would never go there at night. Upon entering I noticed a fridge that use to hold drink but was now empty with grim all in the inside. I tried to ignore thinking maybe a soda busted and its in the process of being cleaned. Theennnn...... my eyes took to the kitchen and noticed it was filthy there was built up grease on everything soon as I reached for my phone to take a pic a guy walked up and asked what I wanted. Before I looked at the menu I looked around at the walls and noticed they didn't have a inspection number. So I ask were is the score he said oh yeah they took it down but we are getting inspected on April 7th so it will be back up. April 7th (In my head voice that's on a Sunday!) I kindly told him I will wait until they have a score and I left. This was the worst pizza hut I ever been in, in my life 2 thumbs way down.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P1VZi73KdnC_S5QOAKgqvQ"
  }
}