{
  "lYdFtoXQHf8kzLW_WnF0sA": {
    "date": "3/27/2017",
    "text": "Rude staff and all 3 dishes we ordered were wrong. The menu stated corn tortillas and we got flour. Huge taste difference in my opinion. We didn't send them back as we were about to go to a show and didn't want to be late. We ordered guacamole to come out before our food and it came after. The drink I ordered tasted watered down. My main gripe was the attitude of the girl at the door and the bar tender who was our server. He started getting nice towards the end but it was too late. I think this place is more of a bar/ club so don't go here expecting good food or service. On the pricey side too, especially for what you get.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T9U3loGwWY1n0mIK-DJzNg"
  },
  "W50542ldDoPppD_9D9gnrw": {
    "date": "6/9/2016",
    "text": "Came here for drinks and dinner before a show. Sat outside and waited for a server for 10 minutes...nobody came. Went to the bar and was quickly served drinks. It was a subpar margarita, and that's being kind. We ordered the taco combo, and the bartender rolled his eyes and asked us not to order that because \"it takes him 15 minutes to key it in.\" Sounds like a personal problem? Why is it on the menu if customers can't order it? We ordered it anyway, and he was done in 90 seconds keying it. Not a fan of that kind of service. We won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UN0MdiMH5_jFT1HO4Uwmkw"
  },
  "kfYtGIcPtmD0sQMLMMLzIQ": {
    "date": "4/7/2018",
    "text": "this place was a lot of fun and i will probably be back, but you know i have to call you out on that man who stands in front of the bathroom and yells at you when you try to bring your drink in with you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DBrcVhd-mL13K6wYcLvtLA"
  },
  "yscRtGI09SPyzmYDYXHNug": {
    "date": "3/17/2017",
    "text": "DO NOT GO HERE! I know you feel like you should go here if you are at the music factory and need somewhere to eat before a show, but eat at one of Charlotte's other fine restaurants and DO NOT EAT HERE. Their menu looks appealing (although there are a lot of spelling mistakes) but the food is just okay and the service is HORRIBLE. If you have food allergies you are just going to be sick, unfortunately. My friend's food, which they said they could customize, was totally a lie and then they charged her for a $15 meal when they only gave her the chicken part. The waitress checked on us once, we had to go find her to get our ticket, and she acted like she did not know the menu at all. After we gave her our credit cards it took another 10 minutes for her to return. This place is not good, not agreeable, and not worthy of your time when there are other places in Charlotte that will treat you as a worthy human being.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f-jhh7jR6WK1oii4XVTKOQ"
  },
  "70FGY_-EDXl_qzm4mlgWLg": {
    "date": "2/5/2016",
    "text": "I had high hopes, but was extremely disappointed. I don't mind paying high prices for Mexican food, but it needs to be done well. This wasn't. It took an hour to get our food and arrived at the table cold, with 4 of the 7 orders incorrect. The drinks from the bar were not mixed well. Some of our tacos had nice flavor, but the mole was below standard. We informed the waitress and manager of the issues hoping to get things resolved to no avail. I don't expect free food, but when repeated mistakes are made you should attempt to fix it. My family owns a restaurant so I extend a great deal of grace to restaurants, knowing what a tough business it in. However, the problems tonight proved to be too many to excuse. We don't recommend this place and will not be coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UdHsWFf36UF58MJz9S_QDQ"
  },
  "hNWjZqKpTZ9Cfld1H6JBtQ": {
    "date": "10/12/2016",
    "text": "Great mixed drinks! We were there on a Friday night around 830 and the staff was a little slow at first but once we ordered, our waiter checked on us quite frequently. Guacamole had a little more onion than I like, but every place is different. My cousin and I shared a taco salad and it was more than the two of us could eat! The restaurant is directly above The Comedy Zone and gets a lot of business just after the show ends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "91eQDHPYhPtMZI7RWDI7Mg",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States. Table art!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/91eQDHPYhPtMZI7RWDI7Mg/o.jpg"
      }
    ],
    "user_id": "seNtsv2ZkwQ0urjsd6loNA"
  },
  "nEPU6ho4Ne_Nx9aC3WogdA": {
    "date": "12/17/2015",
    "text": "I had been to Texicali before and didn't think much of the food but it always had a great location and a cool set up. My girlfriend and I decided to give La Revolucion a chance because it was new and close by. After eating there, I had such a great experience that I decided I needed to write my first review. The food was terrific, the staff was great, the drinks were extremely tasty but you could definitely tell there was alcohol in them, and the owner was fantastic. He came out to greet us, explained they had just opened, what type of food they served, and brought us a complimentary appetizer. The meal was also extremely affordable. 8 tacos and another appetizer for $20! I wrote this review in hopes people would come back and give this great place a shot because I really hope it and the owner succeed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wJqMMHnw3TX67GoOky_pYw"
  },
  "e8TCPMzg_N8BjFvMu-hpvw": {
    "date": "10/12/2016",
    "text": "I work at Industry in the Music Factory, and this is the only place open at lunch time. Thank GOODNESS it's fantastic! From $2 taco Tuesday (my favs are Al Pastor, Carnitas and Campechana!) to naked burrito bowls and $5 margarita specials, you can't really go wrong on this menu. I've yet to be disappointed. Also, unexpectedly AMAZING french fries haha. Definitely happy with this go-to lunch stop!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "dCP3ToNIN1__bVLn_Ixu3w"
  },
  "_PufpISnGsvuEqLYkgB5NA": {
    "date": "1/9/2016",
    "text": "Finally a Mexican restaurant owned by Mexicans. The food is so fresh and tastes amazing. I had the Carne A La Mexicana and it was delicious. The environment is welcoming. I love how they play bachata and the best of Latino music here making it more then just a dining experience. I will be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mPSA7Qnn0f8QTVGN5m9f9g"
  },
  "h8crX7797KFjBuhmhhNUog": {
    "date": "11/26/2016",
    "text": "VIP service was non-existent. They stopped servings alcohol before 2am just to get home and didn't even acknowledge customers coming up to their counter. Worse service I've ever experienced after paying hundreds for VIP service. I'd give them less than one star if I could.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l3tlxUs1g4EKY4p1BxIpaQ"
  },
  "aKVIGFNXMI_50W0c7FI1Yw": {
    "date": "7/30/2016",
    "text": "If I could rate this 0 stars I would. The bouncer was horrible and said that they didn't think i was legal to get in ( I'm hispanic) , I had my ID, and told me to get out of the line and couldn't get in.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JZ-l3rvy4exjr1sd2WOwwg"
  },
  "YAnrYNaOInA0MWNeEUXB2w": {
    "date": "5/4/2016",
    "text": "Had the worst experience here. Me and friends came just to have wings and have a few drinks. It was advertised that they had 25cent wings and we had never been there so we decided to go there. When the bill came we asked the waitress and she said she didn't think that was the case but that she had another table ask the same question. So we said \"can you ask the manager because we saw it advertised for 25 cents\". We were very nice about it and the waitress was nice and there seemed to be no issue with her checking for us. Next thing we know the manager comes over saying \"my waitress said you are giving her a hard time\" and we all looked at each other like \"what are you talking about. We just asked her to verify the price of wings\". The waitress walked over and we said \"He told us that you said we caused a problem and we only asked a question\" and she said \"no I never said that!\" The manager then started raising his voice saying the wings are only 25 cents if you get fries. If you don't get fries they are more so we said that is not what was advertised and there was no wording saying that at all. He then got agitated saying \"well that's what the special is. Are you really going to argue with me over paying the extra 25 cents?! They are already cheap and you're already getting them for 50 cents\". We were so taken aback and could not believe this was the manager and that he was speaking to us this way. When he left the table the waitress apologized and said she was so sorry and that is the way he is. This was honestly THE WORST customer service experience I have had in my life! I would never go back here and unless the manager gets it together and learns how to treat his customers they won't be open long!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "A3HAPovq7wyFdcfyjiurdg"
  },
  "2hKD13lxwX89COBjxK4M9A": {
    "date": "3/1/2016",
    "text": "I went to La Revolution the other night after performing downstairs at the Comedy Zone. I've been a sporadic regular of this location for years (it is constantly changing it's name, theme, & menu). I usually go up with friends after a show but I'm thinking this may be the last time for a while. After sitting for 15min at a fairly empty bar & being passed by both bartenders multiple times finally one acknowledged me. I ordered my regular, vodka soda in a tall glass. She asked if I wanted a double, I said sure. I gave her my card with the order as I tend to do. She brought the drink (in a plastic cup?) with my CC slip....she charged me $18! For house vodka! I was shocked. I can understand if it's top shelf or even just premium due to the location but that was ridiculous. I asked the other bartender about it and I recognized his attitude from when I was a bartender (10+yrs). He acted like I was a bitchy customer. He said he'd make me a single & that she was doing her job by \"upselling.\" I understand the word \"double\" was said but usually it's not even mentioned when it's actually twice the price. 3 Stars bc the food is actually decent granted I'm not sure how expensive bc the Comedy Zone covered it. Wouldn't be surprised at $15 per taco.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "UlqQlOeIQOXZ1sU0WX04Bg"
  },
  "WL3JFJZmQJGs8Fa8aTgYdA": {
    "date": "5/23/2016",
    "text": "Confused staff, they didn't know who ordered what. Apparently they never heard of a table number system.  Took 30 plus minutes to get our drinks which were wrong.  Waiter didn't know the menu and didn't look like he was a waiter more of a guy that is helping out a short staff.  We ordered a mojito (on menu) to be told they do not carry Mojitos and was brought a drink (on the house) which was not what I would ever drink. And then on our bill they charged us for the drink! Been an hour and still have not gotten our food.  Got our food but was not what we ordered.  Yikes! We just paid for our drinks and walked out!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ESN7eynQKEAi5iq0DzYZYQ"
  },
  "_bXaYS5kvw3EfCLYcQu9Sg": {
    "date": "5/12/2016",
    "text": "The staff and environment was fine, however the food was bad, real bad, to the point, i couldnt even finish 1/3 of my entre. I would never go again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TMPDLgBzma2Nj1iBzhSoHQ"
  },
  "OROGejS486Yue5pOQY4v7g": {
    "date": "3/7/2016",
    "text": "Nice big space, plenty of room for dancing!  Evidently this is a big dance place for all different types of music on different nights.  I came in here before the Dropkick Murphy show and it was a little dead that early, but the bartenders were super nice and helpful with explaining the different options for tacos etc.    They have a great queso with chips and the salsa/pico or whatever that came with the chips (there were two) were really good!  I really don't do spicy well, but both of these were mild enough for me and very flavorful.  I had something with achiote which was delicious.  I'd definitely go again.    Oh yea, and they had Sweet Baby Jesus by DuClaw.  Yum.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "fQSnG67UyA9pjyl54FIrlA": {
    "date": "9/25/2017",
    "text": "1st off the Hostess was not pleasant. I felt like we were bothering her cause she was too busy talking to co-worker.  However our server was friendly and was not inconvenienced helping us.   We usually just come here to dance so we weren't really looking to have a huge meal.  Their Torta is huge! I would recommend ordering one if you never had one. Trust me you will enjoy it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QRkoTgPGllU_5pFv3ZpICg"
  },
  "220Th_BbPx4VXZJbuFjAnA": {
    "date": "4/12/2017",
    "text": "As someone who spent a brief period working at that beloved taco and tequila restaurant in SouthPark (you know the one), I can say that I know what Charlotte considers great tacos.   At La Rev, a la carte tacos go for around $3. Despite paying triple of what I would at Sabor for $1 taco night... I keep going back to La Revolucion! Here's the deal, the bartenders can't always distinguish what tacos are which if you order a plate of them, which I do. However, I can guarantee, the tacos that I order (ALPASTOR, CHICKEN TINGA, CRISPY CHICKEN, CARNITAS, CAMPECHANO, and 2 different fish tacos) are amazing! I've tried the Mole and the Lengua ones... wasn't a big fan, but that's a personal choice. The campechano is my ABSOLUTE favorite, followed by one of the fish tacos, and then the crispy chicken.   If you go with the knowledge that you will be served good tacos, and that service MIGHT not be the best, then I think you'll be very happy with La Rev!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SRmdUrORhvv-R608cfjCPg"
  },
  "KSBtPLnolrzBVVF6VfhOmg": {
    "date": "3/6/2018",
    "text": "Decent lunch menu.  Free chips and salsa is always appreciated!  Portion size was good.  Bar like atmosphere.  Service was okay....I would go again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H6S18IJBJqM_nZRNceTa0Q"
  },
  "Ho6JJyyllFKVzaQmJ_AJdQ": {
    "date": "1/27/2018",
    "text": "Waiter, food, drinks were all fantastic. Hostess was rather rude and made it seem like it was an inconvenience that she had to seat us...I mean, do her job . One bad apple doesn't ruin the whole bunch. Will come back again next time I go to a show at comedy zone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yQre5F82cqA_YrkHiVzlRw"
  },
  "xHhvF-f4dgowUN6VZttcpw": {
    "date": "6/28/2016",
    "text": "This is by far the worst place to eat in the music factory area.  I have been here twice now and both experiences are absolutely horrendous.  First off - the place was not even busy, maybe 6 tables of customers in the whole place at the time.  Hair was found in the queso.  We ordered margaritas and after 20 minutes i went to the bar to get them. They were given to me with melted ice, the wrong drinks, and tasted terrible.  When our food came - the wrong orders came out and one person never received her food.   I had to go to the bar to get our check paid because the waiter was nowhere to be found.  I will never return and I will advise any person that asks to never patron this place.   Absolutely terrible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "X-VwziqdQUuScI5yAlZ3_g"
  },
  "AXJoAdK7oon53hSIOHBG6Q": {
    "date": "9/25/2017",
    "text": "Average at best. I've visited several times for lunch and the food takes a bit, but we've always made it back in time. If you're on foot or don't have much time, it's a good spot to grab a bite to eat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qm3OqdoOpnPsQXMGpMHtEw"
  },
  "JG06RPCl3IAkR9G-cG8D5g": {
    "date": "4/6/2016",
    "text": "I know this place has been going through transitions. Maybe it's just the area. The tacos don't really stand out but the food is good and would recommend eating here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VFFXYCVgtvV-Q_RLeUs3cQ",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States. Chicken taco, shrimp, then carne asada",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VFFXYCVgtvV-Q_RLeUs3cQ/o.jpg"
      }
    ],
    "user_id": "FHiFWbXmqQ1e78GM8178Ew"
  },
  "UJYAl-inqms4PBP-glv3hw": {
    "date": "11/16/2016",
    "text": "Scrolling through the reviews, I can only chalk up the less amazing ones (one star? seriously?) to the transition this place has undergone. Our company moved in to Industry at the Music Factory this fall and nearly four out of five days a week (if not all five business days) we are lunching here. I can't speak to their after-hours vibe, but we have never been disappointed by the food or the service.   Their menu is expansive and varied, which is part of the reason that so many of us eat here five days a week and have not tired of it in months. You can get your standard enchilada fare or branch into Mexican omelets and even burgers. Their taco list is impressive and earned top ratings from Creative Loafing recently. My hands-down fave is the namesake Revolucion with steak, homemade guac and cotija cheese in blue corn tortillas. Their steak, pork and chicken naked burritos are magical and oh-so different. And their Mexican omelet or huevos rancheros are a welcome dish any time of day.   The staff have always been attentive right from the start, management is friendly as anything and the place is spotless with great decor. I am a La Revolucion loyalist for life!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d8l_aRRSxbPIow8-_da8aQ"
  },
  "bzTPc1CXLa5jw0gVp9WlIw": {
    "date": "2/7/2016",
    "text": "Many highs and lows would describe my recent trip to La Revolucion. I popped in on a busy Friday night mostly due to the convenience of its location near the Comedy Zone. When we walked in, we were a little confused if you were supposed to seat yourself or not. After a minute or so of us awkwardly lurking, someone came by to seat us. Just an idea, it might be helpful if the staff wore uniforms or matching shirts. I was hard to figure out who actually worked there because of the casual dress.  My mister and I were seated at a high-top table kind of in a bizarre spot near the front entrance door. I wish we would have remembered to take a picture before leaving because for lack of better way of explaining, this table was floating out in no man's land. From my perspective, it was freezing cold and drafty from being so close to the front door. My mister thought it was fine, but he is a caveman. Other noteworthy atmosphere points, the music choices were a bit strange. Ranging from what you would expect at a taco joint to rap to pop.   Our server was very pleasant, and she tipped me off to a drink special on their signature Margarita. Sold, don't have to tell me twice. Sadly though, it wasn't my thing. I like a tangy, sour Margarita, and this was more sweet. That is definitely a personal preference thing though. We split an order of fajita fries, which were great. Think of fajita toppings piled on fries drenched in queso. So bad for you, but so good. The green salsa that also came with freebie chips was also pretty darn good.   And, this is where things started to go real south (of the border? heh.). We each ordered 3 tacos from their expansive menu. Tacos are $2.99 a pop, which is pretty competitive with other places. However, the mister only liked 1 (carne asada) out of the 3 (other two were the trompo and  the carnitas) that he ordered. He didn't even finish or want to bring home the other two for leftovers, which is a great indicator that he did not enjoy them.   My order basically came out messed up. I ordered the crispy chicken, the rajas con queso, and the chorizo, and was only served 1 of those with 2 other ones that I didn't order. Once my plate was set down in front of me, the server was gone like a flash before I could let them know there was a problem. It took maybe 5-10 minutes for her to circle back. I ate the 1 correct taco (crispy chicken) in the meantime, and it was served cold and shouldn't have been. Once my server came back, she quickly apologized and tried to take care of the problem. She offered to place a take order for the tacos that I hadn't received and then I could eat the other two wrongly placed ones or not. Frankly, they weren't very appetizing looking, so I just left them on my plate. When it came time to cash out, I was charged full price, which I was fine with because I did theoretically receive everything that I had ordered.   While I was waiting for my mister to return from the restroom before we left, the manager or whom I am assuming was the manager (he never introduced himself) stopped by because he noticed that I didn't really eat any of my food. He did tell me that if I didn't like the food, I should have sent it back and not paid for it. Um, well I had already paid at that point... Anyways, I tried to explain the issue, and he did mention that they share a kitchen with downstairs (which I am guessing is the Comedy Zone) and that sometimes orders get messed up. He did offer me dessert on the house, but I declined because we were getting ready to leave at that point.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "x4Z01d3Qze86FY2YKvdeDg"
  },
  "Dy3qMdUaSm-vfuGGwCgtKw": {
    "date": "3/31/2016",
    "text": "Stopped in after work with friends and was very pleased with the service and food. I'm looking forward to taking my husband, who I am sure will love it!  I ordered a chimichanga that was delicious and huge. My friends had tacos, quesadillas, and burritos. We all sampled each other's b/c everyone was so delighted by all the flavor exploding in their mouth; we just couldn't help ourselves. You get a lot of food and the menu has a variety of options. I say if you like Mexican, you should definitely stop in for a bite.  CM",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "6M41nwDrOwRaFUIdzWl1pg"
  },
  "Qc45RNU5yGJ8O2eHxyxVMw": {
    "date": "8/27/2016",
    "text": "I ordered a torta and it came in a hamburger bun. So not impressed. I told the waiter the bun was soggy from the guacamole and he didn't fix it. When the check came it was not discounted at all. I could not eat it and ended up splitting my boyfriends meal, which was okay at best. I ate the fish out of my \"torta\" and it was flavorless.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8RMDangAJK37cMz3Jk4BNg",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States. This was my &amp;#34;torta&amp;#34;",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8RMDangAJK37cMz3Jk4BNg/o.jpg"
      }
    ],
    "user_id": "CdFeqAZWqtMNcGdsrjwh3g"
  },
  "1HyVCw7Vxg9DNpj0vwn5rg": {
    "date": "2/1/2016",
    "text": "Started off with the guacamole- not the best and it was really bland. Husband ordered 3 tacos - the steak was fatty and all tacos lacked flavor.  I got the bean soup- tasted like watered down refried beans.   I disagree with all other reviews. The food lacked flavor. The menu lacks anything creative.   Also too pricey.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "a7VZbLfTesoQFIwPdtBjRw"
  },
  "Lourp4jhgWPlx71Jm05axA": {
    "date": "3/29/2017",
    "text": "First of all the water with the slice of lemon was amazing. However the service was sub par.  I ordered two tacos and my order came out wrong. I tried to eat the one taco that came out right and it was nasty nasty nasty. The ground beef was very mushy and not good at all. Now when the waitress tried to correct the wrong taco it came out wrong again. I was on lunch and just gave up at that point. I would never recommend this place. From the service to the food it was gross.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VpeerEhU0G6dX4RGv3mpGA"
  },
  "JwP19jSPYs-2ZoE5kSFzkQ": {
    "date": "12/1/2015",
    "text": "Great Mexican restaurant at the music factory! Much better than the previous Texicali. The chef was kind enough to bring out appetizers prior to the show at The Comedy Zone. Also, there was plenty of staff on hand. I am looking forward to their taco Tuesday, since I work right across the street!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "laKWJTyWQup5M6F-W3APNA",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/laKWJTyWQup5M6F-W3APNA/o.jpg"
      }
    ],
    "user_id": "aEAW3_1oOn9P073RKIgdTA"
  },
  "DXZoP6ng7f1k42abvgBkvg": {
    "date": "8/17/2017",
    "text": "The tacos were quite good and my friends and I liked the service as well.  It was Taco Tuesday, so the tacos were on special so we hit them hard!  Great service and the Guac dipping sauce was awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "szAOu3y1yeXOedVCSxeVyw"
  },
  "EeyT5i4-uiCSUotd0Iqq5w": {
    "date": "5/4/2017",
    "text": "The only reason I'm giving this restaurant two stars, is because their food is decent. Customer service is atrocious and they may as well yell at the customers and tell them to get out. Every time I have been, they have left me standing there for upwards of 10 minutes. They have no business being in business. I could go on giving you reasons to take your business elsewhere, but I highly dislike complaining. The only reason I give negative reviews is to inform customers of poor service and as an attempt to hold businesses accountable, in hopes they will improve.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jopKFjHWkmuUzuxdwaxC8Q"
  },
  "7_R0J5ijgUyiz7F9S9-qJw": {
    "date": "6/6/2017",
    "text": "We came here before a concert. Our bartender was attentive and the food was quick and delicious. We'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zh8CWcqWT-oH7HQGudeUIw"
  },
  "JxgwToboqUezjHhbV3IUaQ": {
    "date": "12/9/2016",
    "text": "I'm a big fan of their food. I work in the same complex and eat there atleast 3-4 times a week. The food is pretty authentic. The staff is really good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "36bYTjRtUf_jq85xaCl9VA"
  },
  "FiIM07D9mdWbxIGbhPNSdw": {
    "date": "2/11/2017",
    "text": "I was very surprised by the reviews. I stopped by before a show at the Fillmore and I enjoyed my self. The food is great, the service is nice, and the price is good. Not the best Mexican food in Charlotte but definitely the best at that price point.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YHnQ32j4ZH1uML7-VZ57jg"
  },
  "tCD5txwtL0tzgetxz7ph0g": {
    "date": "6/2/2019",
    "text": "Negative star. Bouncer and manager are horrible and very rude. Was there for my birthday and had someone buy us a bottle but they wouldn't give it to us because the manager \"was not there\". I asked to speak to the manager and they said no. I've been there before but never again. Do not recommend. Go to tequila house. Over charged also.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GVF10Uds1QJ_j56H1hgCWA"
  },
  "1fuVeWNjpySs2sOfWx8eVQ": {
    "date": "5/6/2017",
    "text": "Enjoyed this place for Cinco de Mayo!   This is a large restaurant that seems to turn into a club on the weekends, as the waitresses begin to promptly remove tables to create a dance floor around 10:30pm.   The tacos start around $3 and the food arrived quickly. The only drawback was the drink specials weren't clear to every waitress so we received mixed information about drink prices.  Overall, I would probably give this place another try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9S3ba4b2YTI4Kh897jfRTQ",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9S3ba4b2YTI4Kh897jfRTQ/o.jpg"
      },
      {
        "img_id": "oY_m33-1Et8_tlM4il6zwQ",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oY_m33-1Et8_tlM4il6zwQ/o.jpg"
      },
      {
        "img_id": "XgqpJAcxP0OlDd_3zF0AFg",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XgqpJAcxP0OlDd_3zF0AFg/o.jpg"
      }
    ],
    "user_id": "cuHp8luhexZ8XP97885d8g"
  },
  "6dnU85MyGjiXEb6bcXh1BQ": {
    "date": "5/4/2018",
    "text": "Our first time here, nearly empty and we were seated all the way in the back near the restroom.  We then waited for 20 minutes, and no waiter ever came, not even for our drink orders. The worst part is, the waiter was at the table across from us the entire time, laughing and talking to a co-worker while they both looked at videos. We made some very obvious verbal complaints, like how we were hungry and wanted to order our drinks, and at one point, the waiter looked at us, and then back at her phone so we left. Terrible service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2xKyYRxczh98EsOigJC8fQ"
  },
  "4AcI1yXusc-ZdKtKbea_7w": {
    "date": "1/22/2019",
    "text": "Food is great, the drinks are well But the DJ could use some work, hasn't played bachata for a whole hour by my timer... and just watching people walk out while doing whatever he's doing with his phone",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RnEHe4CRjAFqn9jLRbPKIA"
  },
  "BwzuZS3qRXCi89oNo5m7zA": {
    "date": "11/12/2017",
    "text": "Second visit to La Revolucion on Sensual Thursdays.  Last time I came for a dance class but had to leave shortly after due to feeling like my eardrums were bleeding.  This time I came much earlier for dinner.  Based on previous reviews, I felt adequately warned about the poor service.  No joke--it was slow.  But we didn't have any taco mishaps because we didn't even get to the stage of ordering tacos!    We sat at the bar, as the place was pretty much empty other than the staff (also sitting at a corner of the bar).  We ordered two appetizers, chicken nachos and fajita fries, plus the margarita on special, lime, one salted one not.  The drinks and the food took quite a while to arrive.  We kept a menu, specifically telling our bartender/server that we wanted to order tacos.  But the appetizers were pretty big, once they did arrive, and no one came to take our real food orders ever, so eventually we just gave up.  We did have to request utensils and plates after the appetizers arrived, and interestingly they came in a pile all handed to me, not given to each guest separately, but when (four drinks later) I eventually asked for the check, that got processed in about 10 seconds flat.  After a couple of hours, we were also asked several times in short order if we wanted boxes to go, like they were trying to usher us out.  Which would have made sense if there was anyone waiting to have our table or even if there was a risk of someone wanting to step up to the bar for a drink--but there were fewer than a dozen people there for the next hour so I didn't see the point of rushing us, unless there was a dish washer in the back waiting on us to go home.  But that seems crazy because they serve food all night long...  I was pretty nervous about the food itself, due to other reviews.  But I would call it a solid 3 due to flavor, texture, and quantity.  Again, we only got two apps, so can't rate the tacos or funky burgers others have complained about.  Here's what I thought of the dishes we did try.    The chicken on the nachos was superb.  It was tender, shredded, and well seasoned.  There was a generous serving of it throughout the nachos.  The nachos also had a good sized scoop of guac, which was admittedly a little bland.  The black beans, olives, and salsa was clearly layered with the chips.  As I ate away the top layer, look!  More toppings!  Not something I find on most nachos, unfortunately, so this was really pleasing and actually kept us picking at the plate for literally two hours, long after the dish had gotten cold.  I also liked that the sour cream wasn't one big dollop on top--it was as if it came out of one of those condiment bottles for ketchup or mustard--nice even lines all over the plate, a little on every chip.  The beef in the fajita fries was not as good as the chicken.  The strips were long and there were plenty of them, but the meat was not as flavorful and the texture was a little chewy.  There was a good amount of peppers and onions, but I only ate the red peppers.  Why?  Well there were some green peppers and also jalapenos and I couldn't easily tell the difference in the dim lighting.  The jalapenos didn't seem to be cooked and I'm not a fan of fresh cut jalapenos, although the red peppers were nicely cooked--tender but not limp.  I loved the fries, though, and I loved the queso sauce, also seemingly squirted out of a condiments bottle evenly distributed over the fries.  These fries were the kind of fry that you feel like isn't just potato, but feels like it has its own fried skin on each individual fry.  It isn't crispy or crunch but is nice and firm.  Had a good salty flavor--not so much that you know they added salt at the end but enough that it was clearly in the batter and not a missing flavor.    I liked the margarita I had--it was tangy and flavorful, on the rocks and not blended, but the salt on the rim was like table salt.  I like my glasses to have a nice coarse salt on it.  Oh well, can't win 'em all.  If you don't like sugar drinks, though, you might consider half syrup half soda--which was requested from my friend and La Rev gladly complied.  I personally would have been happy with lime, salt, and tequila shots--if they had had real salt.  But I guess that's for another venue.  Two appetizers and six drinks was $52 pre-tax/tip.  That's on a no-cover night with awesome bachata playing in the background.  There was also a free bachata lesson by Rumbao, after which the music turned to kizomba for quite some time.   Eventually a bit more bachata, merengue, and even a couple of salsa songs came on.  But mostly back to kizomba.  There were at most 30 couples out on the floor at any given time.  It wasn't crowded but it was definitely moving.  When we left (not too long after midnight), I could tell that the music had slowly crept up to the point of deafness.  I couldn't hear normally for another 30 min.  Also noticed three tables with hookas.  Overall a great evening with Mexican food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qIS2CddqIhEZzwyZC9kk8g",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States. Appetizers after we got full and didn&amp;#39;t even get to real dinner. Chicken nachos on the left, fajita fries in the right. Would order again.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qIS2CddqIhEZzwyZC9kk8g/o.jpg"
      },
      {
        "img_id": "XLnGOLfRtbboN7IdoQi20w",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States. Margarita number two came in a mason jar. Everything else in a regular beer glass...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XLnGOLfRtbboN7IdoQi20w/o.jpg"
      },
      {
        "img_id": "jsBZWeimo9IVgWRyZjUXZA",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States. Sensual Thursday Latin dance night: kizomba, bachata, and a bit more",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jsBZWeimo9IVgWRyZjUXZA/o.jpg"
      }
    ],
    "user_id": "eqtEDyqn1kCXwlo2OKdW_Q"
  },
  "FBIrbrwXJL5sBlgfkohfJQ": {
    "date": "5/6/2018",
    "text": "I went for cinco de Mayo and they were great! Had enough waitresses and bartenders to keep the crowd satisfied. The food was great and came out fast. This was my first time here and I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kDppjkN7xIgxunSLfhYjpg"
  },
  "amkU-T8ogxoPIKSej41-ZQ": {
    "date": "4/5/2019",
    "text": "Food and salsa was awesome!!!! Would have been 5 stars but the service was extremely slow. Even though the service was slow our waitress was very nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "myaAUswLgPFhSRlOVYnuvA"
  },
  "Nj-g2rK3nVLreyNXJ4iPmg": {
    "date": "7/15/2017",
    "text": "After checking out the, EpicCentre in town, we came over the the music factory side of town.  We tried some tacos especially since they were under $3 (each).  We had a very friendly and helpful waiter/bartender.  The tacos were okay.  I may try mole on my taco next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qTbSsKcJUv1CYxyKT1LyDw",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States. Cancun fish taco and chacacon (?) shrimp taco",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qTbSsKcJUv1CYxyKT1LyDw/o.jpg"
      }
    ],
    "user_id": "DaUJvHMmKoDDT3vB_ltJ6g"
  },
  "sBqsbbKMeIECA8wUYrDZBg": {
    "date": "8/17/2018",
    "text": "So we came here to go to the comedy zone,but we were hungry and decided to eat here. Let me say from the moment we walked in we were greeted with the best service!! Our server was amazing as well, really attentive!! The food was DELICIOUS I ordered tacos a la carte and was NOT disappointed. My husband got one of their hand crafted burgers and devoured it. The guacamole was FRESH and delicious. We will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hDJiAloVuE6TpmSPiN_ciQ"
  },
  "o_JKN2eAjavZHPYHVtNZQA": {
    "date": "9/29/2017",
    "text": "Stopped here for the first time to catch a meal and some drinks before a show at comedy zone(connected to the restaurant). First of all some signs directing people where to enter would be nice. Multiple people went through the side entrance which was locked then had to go out to come through the patio entrance. Not a big deal but a simple sign that says \"enter here\" or \"this entrance is closed, use other entrance\" would be nice. The restaurant was empty, just one table seated and a couple people around the bar. First we ordered drinks( their signature margarita, passion fruit and mango margarita). Took 10 min to bring drinks out in a empty bar where you can see the bartenders dancing and talking instead of making our drinks .  Signature margarita was mine and it was pretty good. The flavored margaritas were way too sweet, as if they used too much syrup in them.  I ordered the caliente burger. Food came in a decent time frame. I LOVE spicy food and when I saw that this had jalapenos, a xxx sauce and under it said ***Very Spicy; I was pretty excited. Unfortunately it just take like a regular burger with jalapenos. Burger was cooked good, the bread was nicely toasted. Here's were it really went left. Took the first bite and I taste too much green( like grass) with a bitter taste. Looked on the burger and saw a BIG pile of what I first thought was cilantro,WITH THE STEM ON. This is a big no no! Was this suppose to substitute lettuce? They could of at least took the leafs off the chewy stem. So after taking it off the burger I looked at it and we all tasted it...even worse... it was parsley!  Parsley is a garnish, not to substitute a piece of lettuce on a burger. After taking off the parsley the burger was good, just nothing special. A friend of mine ordered nachos, they looked good and were a decent size.  Overall, service could of been better and food was nothing special. If I'm in the area I might give it another try and order mexican cuisine rather than a burger.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V89_xXo1z51Z-qI12FJJ4w",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V89_xXo1z51Z-qI12FJJ4w/o.jpg"
      },
      {
        "img_id": "pEnMxtKijpxhlj8RhOBJ0w",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pEnMxtKijpxhlj8RhOBJ0w/o.jpg"
      }
    ],
    "user_id": "SGTH6vBZibuM6FmzTFiqHw"
  },
  "rQsMvdb7zrtwnJPoSPYCSw": {
    "date": "2/1/2017",
    "text": "My friends wanted to come here. I saw the reviews and warned them but they still wanted to go. We had reservations for a party of 10. When we got there, we told the hostess about our reservation and she looked at us like she had no idea what we were talking about. In all honesty, I think there was a language barrier. We were all standing there for about 10 mins with no one telling us a status.   We finally get sat. I knew right away the experience wasn't gonna be good. There were 10 of us and they gave us 2 menus to share for the whole table. I have no idea why. They weren't even busy. They sat us at a table that could fit 8 at the most. Everyone ordered drinks from the bar and I got a non alcoholic drink. He doesn't bring it to me. We finally get to order. I ordered a fajita salad with shrimp. Comes with pico, fajita veggies and a good assortment of stuff. When I got my food there was fruit all in my salad as well as other items that wasn't described. There was no fajita veggies the the whole mix wasn't right. I questioned the server and he just about all the fruit and he made a comment about \"Oh, you don't like fruit\" and giggled and walked away. I pulled up the menu online and saw I received a mixed salad instead of the fajita salad. I told the server about it and instead of offering me something else or to remake it, he just takes my plate and walks away. Several people ordered different tacos and he couldn't tell which was what. So he pretty much just laid them on the table to have people figure it out.   The whole experience was awful. I will never come to this place again. Sad, because there really aren't any other options around. Ugh.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GoE9SQ_u4xEbFFZZiNwZHA",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States. Does this look like a fajita salad to you with all this fruit?!?",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GoE9SQ_u4xEbFFZZiNwZHA/o.jpg"
      },
      {
        "img_id": "fTvfVmyFWLJl_3M8dyN2xQ",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fTvfVmyFWLJl_3M8dyN2xQ/o.jpg"
      },
      {
        "img_id": "in4VkNBqi0bcx0dTlyx7uw",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/in4VkNBqi0bcx0dTlyx7uw/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "BsuexL7yh4aj39SUj_LL4g": {
    "date": "3/27/2018",
    "text": "I'm sick of people passing off nachos with queso or cheese sauce or whatever that is. It's not cheddar and Monterrey Jack as the menu suggests. As a dip, I get it. Fine. But as the cheese on nachos? No. Please no more. #nomorequeso #enoughisenough #stopthismadness  Otherwise place is nice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yorr4fbvqGH7bmICXWrM9A"
  },
  "FjwfEDFI2F6ALKmuWbHb1A": {
    "date": "2/14/2018",
    "text": "I ordered the veggie fajita and it was delicious!  It even had plantains in them!  The sides it came with was delicious as well.  My boyfriend had the chicken burrito and the flavor was poppin!  The free chips and salsa leaves much to be desired though.  The salsa was good but the chips tasted like it came from a store.  All in all, I would still come back here to try the other items on their menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hTjUo_DmadNEHfCVHJ-R6Q"
  },
  "l-lU5vYi16NIUV6cYRTa2g": {
    "date": "3/7/2019",
    "text": "Great food. Super terrible service. Waited same time to get check as we did waiting for table. About 25 min",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hh7gP9gNu3oX9H_XmCw_Fg"
  },
  "JXVIvB2ywlq380tv_nHKjA": {
    "date": "11/22/2016",
    "text": "With the addition of so many offices, how in the world does the Music Factory not have more/better restaurant options?! After a meeting at the Fillmore, looking for a place to eat, I was shocked to discover La Revolution is THE only place serving lunch at the Music Factory. We ventured in despite the poor reviews on Yelp. Should have known better. Service was slow. Food was unimpressive -- lacking flavor and cold. Worst of all, the server dumped about half a pitcher of tea on one of the guests I was dinning with and didn't discount or comp her lunch. *Sigh.* Customer service 101, guys.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "ZA94Ywnga-o1suJcIrwmVw",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States. $2 tacos on Tuesdays",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZA94Ywnga-o1suJcIrwmVw/o.jpg"
      }
    ],
    "user_id": "eVxYV4jI-618bnRCDniowQ"
  },
  "Ol55afderB_vURJ21T7atA": {
    "date": "12/21/2016",
    "text": "I like La Revolucion, it's not the best of the best Mexican in Charlotte, but it does the trick in a pinch.... and by I pinch I mean when I'm going to the Comedy zone or I'm in the area and looking for some tacos.   I've never seen it super full, but there's always a steady clientele. For lunch, one of my favorites has to the burrito bowl al pastor. It's one of the better dishes they have, make sure to get some extra chile verde sauce and dip all of the goodness in a tortilla chip. Mmmmmm.....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WzbiAVIgM4RCuEqNoS1Wcw"
  },
  "jCjwouqG3u96Jf0uign-MA": {
    "date": "6/17/2018",
    "text": "Good place to grab late night food . I wouldn't go unless I didn't have any other options though , not consistent enough for my liking. The Queso Fundido is really good when the add all the ingredients.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1hu6SGjXZb_BQbJkM8S_1g"
  },
  "Y7Snw6J3jTsU6zqlYWZi4A": {
    "date": "3/28/2018",
    "text": "In town for a short stay and decided to try out Tuesday Salsa/Bachata night. It was more of a neighborhood spot with a very diverse clientele. By 11pm place was getting filled and only 2 bartenders on hand. Overheard customers at the lounges asking for waitresses and they were told there were none. You had to keep pushing up to the bar to ask for drinks or food. What did me in was watching break dancers during a Latin trap set. I knew I had to leave by then. But I may go back on a normal restaurant day. LOL",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z6DE1m5mBDo2pX8SJToHGQ"
  },
  "LLIQr7mUbYbR1aoqj5O0mA": {
    "date": "5/6/2018",
    "text": "AUTHENTIC and delicious Mexican cuisine. Always fresh and hot. I usually go on Taco Tuesday and get the Cancun shrimp tacos, and I love their chips and salsa. Great customer service and always a great time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qxsZVBR1AEuMStHxr3UQjQ"
  },
  "U26xcSKrqLsGNZ7ACd9K0Q": {
    "date": "4/15/2017",
    "text": "My experience here was okay. I ate here before going to a concert at The Fillmore. The place was pretty empty for a Friday afternoon. I ordered the chicken quesadilla and a peach margarita. The food was okay, nothing spectacular. My margarita was good! Nothing about my experience at this place stands out, which is why I'm giving them 3 stars.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "wN-gArYrqcX9jxBjSV5t4Q",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wN-gArYrqcX9jxBjSV5t4Q/o.jpg"
      }
    ],
    "user_id": "sXccOuVx25toGWS86hS4XA"
  },
  "S5MAv4cjfvz7D7B6-6FPlQ": {
    "date": "2/20/2019",
    "text": "In the spirit of being completely up-front, I didn't want to come here for dinner.  I wanted to go to VBGB, but the concert was on a Monday night (2/18) at the Fillmore, and VBGB is closed on Monday nights... as we had  a lack of options, La Revolucion it was!  This place is very much a sporty bar scene with a Mexican flair.  I was seated quickly, and promptly waited on with a drink, chips, and salsa.  The chips were mildly stale, but the salsa was flavorful and decently spicy.  My husband and his friend arrived shortly thereafter, and we ordered food.  My husband and I ordered six tacos (3 each of 2 flavors) and our friend ordered a burrito.  Following another basket of chips (more fresh tasting this time) our food came out quickly.  The tacos were perfect... Small, about 3-4 bites each, but well made and tasty.  Our friend's burrito came out (mistakenly) in the form of a quesadilla.  No matter, he rolled with it, and said it was good!  This is a bar with decent Mexican food.  If you need a good bite to eat before a show, this isn't a bad spot.  I will say that our waitstaff was very eager and helpful despite the error in our order.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sl2R5RFdX1QBQX66T_IGwg"
  },
  "mJsAW85jlBsJcqWe9ugLig": {
    "date": "8/3/2019",
    "text": "Authentic Mexican!  The rojo sauce for the enchiladas is home made and not out of a can.  The shredded beef is excellent.  The Mexican corn was amazing.  The chips and salsa are on point! Everything was delish, and they have all you need for a great Mexican night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1I7WuFMfLOqtCe_MLD2jpQ",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1I7WuFMfLOqtCe_MLD2jpQ/o.jpg"
      },
      {
        "img_id": "Z3qNjo1-G4lkefr8YwDhaQ",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z3qNjo1-G4lkefr8YwDhaQ/o.jpg"
      },
      {
        "img_id": "u35ELbTypORS2JhVWmkpRg",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u35ELbTypORS2JhVWmkpRg/o.jpg"
      }
    ],
    "user_id": "vW1kHIcXk8ZWIlkXj9qKIg"
  },
  "9AZtNPuV4FAtIcd9RwTRBw": {
    "date": "8/8/2019",
    "text": "I came here for Taco Tuesday before going to a concert. The restaurant was empty so we got a table immediately and were in and out of the restaurant pretty quick. Tacos we're only $2 and they were definitely worth it. My fiance and I got a couple of tacos to share and they were all good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nPQb2Modp08EAxZDUaPKdw"
  },
  "WeTpKpI_gMf7I-FNE_xrMg": {
    "date": "4/22/2019",
    "text": "My fiance and I came here before a concert at the underground. We came here for taco Tuesday and it was amazing! There was no wait and the price is great for only $2 a taco. We got a selection for different tacos and they were all delicious. The chips and salsa were delicious! The waitress was extremely friendly and helpful as it was our first time there. We will definitely be back for taco Tuesday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vdWqkrjdz0oDKemETPUusw",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vdWqkrjdz0oDKemETPUusw/o.jpg"
      }
    ],
    "user_id": "g6zhMXgpLDbKAyyoHiNssQ"
  },
  "cq9IIAcHXeM2HJH8ew3aAQ": {
    "date": "9/30/2018",
    "text": "After all of the mixed reviews I was nervous to come here.  We had tickets to see a show at the comedy zone so it only made since for us to give it a shot for convenience.  Majority of the reviews mentioned issues with the service.  I made reservations online for 4 people at 7:15.  When we got there we were immediately seated and brought menus along with chips and salsa.  Our waitress was really attentive and checked on us multiple times.  I ordered the fajita burrito bowl with chicken.  The other people I was with got the enchiladas and a taco.    Our drinks and food came out in a reasonable amount of time.  Everyone said their food was good.  For dessert we got the tres leaches cake to split.    Overall for the location and service it met expectations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pJxavgIT6xGAXNLjEOX6Vw",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States. Enchiladas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pJxavgIT6xGAXNLjEOX6Vw/o.jpg"
      },
      {
        "img_id": "p4mcUfTGbHv6zT-bKDY8XQ",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States. Burrito bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p4mcUfTGbHv6zT-bKDY8XQ/o.jpg"
      },
      {
        "img_id": "OMSbqOfnr3fYlQwdywVfjw",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OMSbqOfnr3fYlQwdywVfjw/o.jpg"
      }
    ],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "GOsVbx_hJiDcBRjprj0x-g": {
    "date": "11/16/2018",
    "text": "I love Mexican food and I have also come to terms with the fact that good Mexican restaurants are few and far between in NC. Even with this in mind our recent visit to La Revolucion left a lot to be desired.  Let's face it, we went here because we were going to see a show in the area and the NC Music factory doesn't have a lot of sit down dinner options. When we arrived it was a mostly empty restaurant, which was a bad sign for prime weekend dinner time. We were escorted to a dirty table that was then cleaned off after we sat, which would be understandable if they were packed but it was empty. Most of the tables hadn't been bussed even though there seemed to be plenty of staff and only a few customers.   Our waiter was pretty checked out and absent even though we were his only table. We received water the fourth time we asked for it. Our first round of margaritas sat empty for a long time before he asked if we wanted another round. Side note - the margarita red bull beverage they offer is actually much tastier than you would think.   We both ordered chimichangas for our mains. Neither of us finished our meals which were unmemorable. The dish itself is probably as cheap as you will find in the area, $7 for a chicken chimichanga and sides.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YEzpdlDHw3ufKnvysGPjPQ",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YEzpdlDHw3ufKnvysGPjPQ/o.jpg"
      },
      {
        "img_id": "Dza51BLs3PC0g7sKK2kpBg",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Dza51BLs3PC0g7sKK2kpBg/o.jpg"
      }
    ],
    "user_id": "wbvjiDpw0FoZDeqbzAIcDQ"
  },
  "pqgqXf8bTNgrYhCQCd7vjg": {
    "date": "7/6/2019",
    "text": "Since I began working across the street, it hadn't really been a priority to eat here because It's the ONLY place open in the Music Factory for lunch and I don't eat a lot of Mexican. But 1 day I strolled over with a few of my coworkers for lunch. I knew this place wouldn't be that great because generally when you are offered a low selection of restaurants, they suck, because they don't have anything to compete with. This place was no different. We were seated immediately in an almost empty restaurant. Our server was all over the place, so much so that soon after we sat he admitted he was still feeling the effects of his previous night out. I actually respected the honesty, its not like we were in a 5 star restaurant. It's more a bar than a Mexican restaurant. Service though a bit disjointed,  wasn't bad. Our food was just ok. I dont eat a lot of Mexican so I feel it should've been great for me, but no just ok. I ordered the lunch special enchiladas. I wasn't a fan of the sauce so I scooped most of it off. It was almost sour. It's probably a slim chance I'll return unless it's a coworker lunch getaway.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xdW2zehpCYsdXCLnbYABeg"
  },
  "LriYjADtMMyTCrfzrda-rA": {
    "date": "6/1/2019",
    "text": "Would leave it 0 stars if I could because I didn't even make it in the door. Got to security and they wouldn't let us in because we have vapes. The very rude security guard told me to walk all the way back to my car just to put my vape in it. No thanks homeboy I'll just go to world right next door and give them my booze money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9_s-pcIgPF53smw-y95Q1Q"
  },
  "_AHD7y0t8IRmGrD6_QuxrA": {
    "date": "1/26/2019",
    "text": "Busy night due to the Pop Evil concert but service at the bar was great. Ordered enchiladas and tacos (carnitas, chorizo and asada) and all was fantastic. Nice spot for pre-concert food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L21t0lxH4gK9LmIsUXthJQ",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L21t0lxH4gK9LmIsUXthJQ/o.jpg"
      }
    ],
    "user_id": "lCRL4inyEgxXGLPiCJk1iw"
  },
  "0SpIdSovIr3g1EK9-CaOxw": {
    "date": "2/5/2018",
    "text": "It's Super Bowl Sunday! One of my friends decided to host a birthday dinner. La Revolucion used to be called Texicali, not sure what happened. My husband and I use to LOVE the food.   Only a few tables were occupied. I'll admit this place needs more employees! I didn't see anyone at the hostess stand, at least someone greeted me at the bar.   The food was good, I didn't have any issues with my order. Thankfully, I was able to watch the Super Bowl without some DJ blasting music during the commercial breaks! So apparently, tacos are $2 on Sundays (not including the ones with seafood).   I ordered three tacos, two Alpastors, and one Cancun. These Tacos were AWESOME! The Alpastor comes with pork that's cooked and marinated for 24 hours (according to their menu), it's topped with achiote chile and grilled pineapple. The Cancun comes with your choice of battered fish or shrimp, topped with spicy slaw and fruit salsa. I choose the shrimp which was amazing! I loved the spicy slaw and fruit salsa.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UGTQum1peLSeOZr08LERbA"
  },
  "F-13Nx-IX96o-HMk-YdhRQ": {
    "date": "5/4/2019",
    "text": "My wife had the chopped salad with shrimp and loved it, my meal was outstanding and the price was not bad",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LhOtzcoLGr13ZR96XlbYCg"
  },
  "GYUL49Jp-N284efkJPAXWA": {
    "date": "4/20/2019",
    "text": "I went here before a concert at a club next door and there was no wait! Our waitress very nice! We had a few problems because I told her that I am alley to tomatoes and she gave me some food suggestions had tomato so when my food came I had to get another order because she forgot the dish had tomatoes. On Tuesdays they have $2 tacos so I had 3 tacos and one beef all under $10 the food was okay nothing to rush back to",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFcLaJruy2kUgOOee6pvqg"
  },
  "p_iHk1IKfmipEgRwJQSg7w": {
    "date": "6/30/2019",
    "text": "I come to this club to have a good time dancing with my friends. However, the creepy old guys that just come to la Revolucion to prey on younger girls really ruins the fun. Also, the security guards and bouncers are rude! I was rudely dragged out of the club while dancing with my friend. I asked what was going on and why this was happening but the security guard said nothing. I find it annoying that I was man handled and just dragged out of the club without anyone telling me why. There could have been a better way to go about this situation. Such as, asking us politely to leave instead of grabbing my arm and dragging me out without saying a word.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "92EY4mhdRXXVI1P-gvIcuQ"
  },
  "a9IUrk9XesFrJviYSgfLAQ": {
    "date": "3/7/2019",
    "text": "The manager was more than accommodating to explain the discrepancy previously stated I am going to give this place another chance and will post an update After my next visit",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VNgJkrqe2k-js9J33y0Drw"
  },
  "tQ7RsY26BlK7lFIFZ-T0yQ": {
    "date": "4/14/2019",
    "text": "This is probably the best rating they can get. Very horrible service at night security guards are rude and not worth your money, I recommend to go elsewhere!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z3lQeQDkJa4EpCA5mlGbOQ",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States. Something similar happened to my friend at the same place.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z3lQeQDkJa4EpCA5mlGbOQ/o.jpg"
      }
    ],
    "user_id": "8HlEToR12rr2jfL7HhqCdw"
  },
  "OCbH1Lp6HNcxnRosRe9hvw": {
    "date": "8/3/2018",
    "text": "A friend suggested we try this place. I obviously had to check the reviews first and got super scared bc people don't seem to like this place. I was really hesitant to try it but she convinced me. BEST TACOS EVER!!!! I was beyond surprised with their tacos. I honestly have to encourage you to try them! Service is pretty much non existent and really does suck. But tacos are amazing",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-CIKKPeyjqN5SD7lVfIUZQ"
  },
  "OHpYg9ATgRYtZOYHFs4JSQ": {
    "date": "1/5/2019",
    "text": "Good food. Reasonable priced, great service. Nice atmosphere. Are here before a show at the Fillnore. Would come again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AX5HW8ghrBUNE705W2xf9A"
  },
  "8yLZwEqopj6Tiex9ZS-jtg": {
    "date": "9/12/2018",
    "text": "Excellent food and fun atmosphere! It's designed like an eclectic warehouse. The food is out of this world. Chips and hot salsa to start, and I got the carne asada chimichanga which was topped with the most delicious queso. Chimichanga had steak, rice, some veggies, black bean inside and was a great balance of flavors. Looks like it turns into a dance club later in the evening - I am here to attend the Comedy Zone which is attached. Fun evening out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gPJlBhUccZ2sFoKfxsSZSA",
        "caption": "Photo of La Revolucion - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gPJlBhUccZ2sFoKfxsSZSA/o.jpg"
      }
    ],
    "user_id": "2245wr8u1AG1I5PLXFUyhg"
  },
  "O13LDAODk8ZtwACUjOZaWg": {
    "date": "2/11/2019",
    "text": "Good prices. Chips and salsa are good. I got the fajita fries for lunch and they are delicious. Service was very slow even though it wasn't busy. I would definitely go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pGCREpkIq26-oMj9t73OVQ"
  },
  "h-keIiTHl1y0EUzMcNk7cQ": {
    "date": "5/2/2018",
    "text": "I've been to this place at least 5 times, during different times of the year.  La Revolucion can never get it right. This place caters to a Latino crowd. As a Latina, I honestly really dislike this place.  The AC system must need some updating because its always 100 degrees and they hire very mediocre DJ's. The bartenders are slow and  unprofessional. The bathrooms are small and icky. A lot of older men come here to creep/prey on the younger Latinas... you're guaranteed to have at least one creep scoping you out. The bottle waitresses are also terrible...my group ordered bottle service and came to find out one hour later no one placed our order... so nothing ever came. Hookahs finish, we tried to order one and all of their hookahs had been sold. They charge a cover, no one should have to pay to come into this sweat box. Is your hair freshly done? You will sweat it out honey. The VIP area isn't well attended to either, some people say they are buying bottle service and just take up the couches and dont buy anything.... which leads to a sweaty/crowded VIP area. If you're looking to dance some bachata/dembow - try some other options like Oak Room or something... La Revolucion is never a great time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "VVxDe3-2NdjFPRj1z8Fpgg"
  }
}