{
  "g4O6HWD_mLIgZxuwnQE2ag": {
    "date": "8/16/2015",
    "text": "Had lunch here yesterday. This is one of the best Chinese/sushi buffets, if not the best I have tried. The hot food I can't really speak on because the sushi was so darn good. The selections were numerous and fresh. They also have seaweed salad, squid and octopus salads which were all very good. Not your run of the mill buffet sushi by any means. Dessert was good with a selection of real ice cream that you scoop yourself. The restaurant is large, clean and newly renovated. Highly recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Wy4raFvOd8wYSZ2o9PJ-A"
  },
  "GWTQZpbTLFjOfSI-fGmTAg": {
    "date": "12/19/2014",
    "text": "After realizing that Tin Tin is a steep $23/person for dinner on a weeknight, China Buffet was our next choice for a friend's birthday dinner. For $12/person, you can't beat this place! Pretty standard Chinese buffet food, but it was tasty! I especially liked the lo mein and teriyaki chicken. I will be back, especially for the to-go option (4.99/lb for lunch, 5.99/lb for dinner)!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KKq9lAoj5r38RxLBabBY6A"
  },
  "VVfadr2O570VNpqK21-L3Q": {
    "date": "3/18/2015",
    "text": "Best buffet in Charlotte. I think the food is worth every one of your pennies. The soup was great n sushi was better than japanese upscale restaurant",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Bs7WECsQa-s3SVizN3RSbw"
  },
  "5EDk69SjlhLf3y_IoOY58g": {
    "date": "1/24/2017",
    "text": "Me and my children love to eat here. I am extremely sadden that I will never attend this restaurant again. I was humiliated by the staff and accused of lying over my own child age! They made assumptions as to my marriage status and discriminated against me over a something so ridiculous for charging one of my children as an adult. Let me say this first... I am a single, (OIF 2007 \"The Surge\") 82nd airborne veteran, and mother of 5. I work so hard that its a treat to take my kids out to eat from time to time. So what happened was I asked my 6 year old to get me the wait staff so he could fix my ticket as he charged my 12 year old as an adult. The next thing I know I have the hostess at my door talking about \"my husband\" said my child was 14 or 15. I have only come there with my friend (who paid) from time to time. But with that said... Its neither here nor there... So I went to speak more with this hostess. Now let it be known I have PTSD/ anxiety disorder and if you know what I am talking about you know how it feels to become so enraged at someone that your heart starts beating out of your chest and it takes everything within your being to keep you on the ground. So this emotion this lady evoked out of me as she continued to belittle me and I was in between trying to keep myself calm and argue my point. She asked me what year and I automatically replied with 2007 in my disorientation. SO then she threw her pad and paper... ridiculing me throwing her hands around saying you say this and that. Next time you bring a birth certificate and I give your money back. So I got extremely worse to wear I couldn't function. So the first thing I did was try to explain that I am a veteran with PTSD as I wanted them to make sure they understood me. I carry my veteran card with me so I pulled it out. I told her I have money. Money is not an issue, but my child is 12 years old. When I get to that mode its difficult to articulate. This was unjust behavior of management staff and it was sad that it was even thought as right to even hold an argument about a $5 difference and start a Trump birther movement in the Chinese buffet. To me it just means that we have been over charged the last few times we have came to the restaurant. Second, that they have no respect for veterans or single mother with children. They should have never have confronted a customer in the manner they did me. I will not attend this restaurant and if you have PTSD issues like me. I would advise you not to as well.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YffuTGcBBRi1vXoTzBdMMQ"
  },
  "Pm4y66dMF6XpxIn_WLWwzw": {
    "date": "8/11/2015",
    "text": "This place was underestimated from the beginning by myself and my bf. We got way more than expected and it was delicious! Timing is everything though, because my second visit flopped. (Visit was the same dinner time, both on a Sunday evening.) The food was mediocre, and drink refills were hard to come by our server. Still good rating overall! Customer service needs improvement, but maybe best out of 3?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tu8_eFKLVMz1UA6Z9r_-Kw"
  },
  "ZBjO93i65GmkGe3NyNbrlw": {
    "date": "6/25/2015",
    "text": "Very nice buffet, definitely better decorated than other buffets I've been to. There are a lot of options at this buffet but 1/2 was bland, cold or just plain not tasty. They don't have white rice or melted butter for the crab legs. They have a lot of sushi but some was lack luster",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2YHo8QtuRLgfNg7i91HKKQ"
  },
  "ONGWfaHz5PUMS8qiMw-0Tw": {
    "date": "9/1/2015",
    "text": "The place as clean and didn't smell Waitresses and waiters were friendly. The habachi needs improvement. The place is beautiful. I enjoyed the chicken and brocolli myself",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "leWXZgVg_Z-eKzUQUArP-Q"
  },
  "l3S3mSfJqPbLsssC_Mh11Q": {
    "date": "10/15/2016",
    "text": "I love going to this place.  First, the food is really great, and I love the sushi as well as the habachi grill.  There are plenty of different items to satisfy any taste.  Also, they are so friendly and accommodating, and treat you like a friend.  I just like being there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZNVAOD9mhGuDTyuGe2-XFQ"
  },
  "Q7fOxucfQ_Fw_AfdHl2aJA": {
    "date": "10/14/2016",
    "text": "My friends and I enjoy eating at the China Buffet on independence several times a month.  This restaurant is well decorated restaurant with its modern, clean and relaxing ambience.  The offerings includes many delicious Chinese, American and other Asian foods to choose from including a fresh salad bar, desserts and premium ice cream.  We often enjoy the wonderful seafood or duck soup that are prepared to order or pile up a plate for a fresh stir-fry from the hibachi grill.   The fresh seafood includes many varieties of shrimp, crabs, mussels, crawfish, etc. as well as hand-rolled sushi.    The friendly staff will ensure that your needs are well met.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rKzbpUvNUdk3hYZRp38f1g"
  },
  "6FFINSFBH4kgN_Aa9vszDA": {
    "date": "3/8/2015",
    "text": "I go here often.  It's a little hard to get to if you don't know the cut threw street. The decor makes you feel like your not about to go into a buffet. They have a lot of waiters or whatever you call people that refill your drinks.  The hibachi grill is nice. They also make soups, they're delicious. I really like the duck soup. So it is not just a buffet, but you do have to get up and order your food. I've had better buffet bar food.  There's also a sushi chef to take custom orders. I give it a 4 because if the value if your into that kinda thing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Da4v4Ny42Sb0h_eNn2KwIQ"
  },
  "9URi-4lj9K97LhOt0PsrqA": {
    "date": "3/22/2015",
    "text": "Nice selection of food. Sushi was already worth the 13 bucks dinner buffet. Thumbs up for the crawfish (best around feb-may). I like the made to order soups up near the sushi n hibachi area, the vietnamese beef noodle soup (pho) was pretty decent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0GIAHvDT2cFBIXAyFjVazA"
  },
  "kpe0_nRwxUzX9SOSZ56tiQ": {
    "date": "12/4/2014",
    "text": "This buffet was prettt amazing and they had a soup bar and the shrimp soup i had was fanominal. It is tricky to get to it but its totally worth it. I would recommend it and also their habachi is prety great. It was lovely and the decoration was very nice. Ibwill surely go again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pzXdW0IX3QLLtbAenLZdkQ"
  },
  "462vh8uCSazzB4FCH6e6KA": {
    "date": "9/25/2014",
    "text": "Honestly when my friend wanted to drag me here I was not down. But the inside is gorgeous and the food is legitimately good. They have a hibachi buffet where you pick the re ingredients for your hibachi and give it to the chef, which is awesome. Plus all of the rest of the stuff is pretty good too. Highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QWa95RO-yK51nVIeNnYzig"
  },
  "j8bGExKrxgd9M_62ZF1J1A": {
    "date": "5/12/2015",
    "text": "This was my second time to let them try and redeem theirselves.  But no luck the food was very bland both times",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ZgSJ9SqbH8AuYJDFc_cfQ"
  },
  "hpCKr6e75aA9PvgTd7OQJA": {
    "date": "2/19/2015",
    "text": "So bad, I'm sitting in this restaurant furious that food this horrible is even allowed to be made. Horrible service and horrible food. The only semi-nice part about it is the appearance.  The food was cold and looked like it had probably been out for hours. The food that we did eat was soggy and bland. We've lost our appetite after trying the first plate.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kCjWVS-yDZz_C4ZI7rIBLw"
  },
  "iJqMko7bFyYYPiG_ayfYaw": {
    "date": "2/10/2015",
    "text": "Beautiful artist and design work done on the part of outside and inside.  Buffet was just ok. Nothing special. Expensive for the quality of the food. Some of the food wasn't warm. Disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5w3JiWMzqXqO1NhxJH-TQ"
  },
  "X1mp-HMuh3OYbbasdZOshA": {
    "date": "6/24/2016",
    "text": "you're  crab legs are the bomb. I really thank your fried chicken  is the bom you have great service",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qqz4-niP3P7JWluBVU8rjw"
  },
  "YhmLhpx9XLM4tKAQMy8srA": {
    "date": "1/3/2016",
    "text": "Horrendous!  I did not enjoy one item I tried. Even the fried rice was bad. Thats a first, which I never thought was possible. The hibachi grill seemed promising, but I was so put off by the experience I didnt take the chance. My first and only time I will step foot in this establishment. Save yourself and go someplace else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xSeJbYFopAqBIuaaX83lTw"
  },
  "zDSCTxmFW25DEWAKqusRTQ": {
    "date": "7/25/2014",
    "text": "Great decor. Probably the best looking Chinese Buffet I've seen. Stick to the fresh items. The hibachi bar, soup and sushi. The other items have little flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VNIpqowkg-6BMaXblDNCGg"
  },
  "GpqNdcOQUOfDMQdkZP-xzw": {
    "date": "11/1/2014",
    "text": "This was horrible!!!! Most of what we tried was cold, not even warm, cold! Nothing tasted good. The meats were very fatty. We explained our disappointment at the front and they only discounted my meal not my husbands. We will not ever go back !!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9UHnAvQiZMWKXo532tdUNg"
  },
  "LolJoGek4E6Xl7ckOPfObQ": {
    "date": "1/13/2017",
    "text": "The building is beautiful and the staff is very nice and welcoming. The food is par/ subpar if you judge the look of the building you would think the food was 5star. It's decent at best unfortunately. 14$ for a dinner buffet...I'll take it",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gUUWbwzElOMnEW9aSqPXjA"
  },
  "-oii4fqHM8lxbVQfA99FWQ": {
    "date": "7/15/2015",
    "text": "By far my most favorite place to go to get a buffet!   The sushi is always amazing and so many different choices.   The buffet is always full and ranges from delicious general tsos chicken to pizza and chicken nuggets.   The hibachi is amazing you pick your own ingredients and sauce and they make it in front of you!   I've always enjoyed my food and service!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qW7sKc9PU2c4qdC7HppfuQ"
  },
  "AwwDw66utqRNVTQuoeR_Jw": {
    "date": "7/13/2017",
    "text": "Went here for dinner, ended up getting food poisoning. My friend didn't get sick and he didn't eat the sushi and mussels which I did.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hs7tktWaOePcy7cJCXUjtA"
  },
  "s4Pq0Vw2ErncdHLHpj1inA": {
    "date": "5/9/2018",
    "text": "First I want to say that the food and service that my kids and I received was very good.  This was not the first time that we had been here either and food and service has been very good each time we visited.  I was not planning on eating out, but I looked on their website (not someone else's or another coupon site) and saw that they had a coupon for 2 adult buffet $4.00 with purchase of 2 adult drinks.  I showed the coupon to the waitress that sat us down and she nodded and smiled.  After we finished eating a different waiter brought our bill with no coupon used.  I showed him the coupon and he explained that it was a mistake and it should have said $4.00 off.  I explained with no avail that I had shown the coupon before getting any food and that if I had known that it was only $4.00 off I would not have chosen to eat there.  He was nice as he could be, but it doesn't change the fact that I thought I was going to spend $20.00 I ended up spending closer to $40.00.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "plhZbVkn3-p8PpiZ4QAAjg"
  },
  "kov8hUy1hyFb0OwbHnvTEw": {
    "date": "1/12/2015",
    "text": "I can say without a doubt this is the best Chinese buffet I have been to. Certainly the five star equivalent of Chinese Buffets. $12.99 Sunday lunch/dinner includes fresh sushi that is surprisingly very good...go ahead, don't be afraid. I think my husband ate 19 pieces of Nigiri and he is still alive to tell about it :)    I will admit I am a little phobic when it comes to lots of hands touching my food ....but the space was clean, orderly, and all of the food very fresh. They were constantly turning things over and that made me feel good. If you just can't do the buffet thing they have freshly-made sushi (as noted above), hibachi, and even soups that can be made-to-order.    Note, This is a very kid-friendly restaurant and there were tons of little ones running all over...if that's not your jam I would stick to visiting when the kiddos are in school.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "58OQ9LQQ7EmqJzfUOKKa0A": {
    "date": "12/12/2014",
    "text": "Very decent for a Chinese buffet.  I think dinner was about $15-16 per person.  For the price I was hoping for crab legs but I didn't see any.  There were enough quality dishes to make up for that however.  There was plenty of other seafood dishes so I was happy.  The food was hot and the booths were packed.  This place is new and clean so that gets a few stars right there.  I definitely will be back but $16 per person makes this place more of a treat than a regular place for me and my girlfriend ($16x2 plus drinks, tax, and tip gets pricey....almost Tin Tin prices but no crab legs).  This place is worth checking out if you are on the fence, as far as I can tell this is the new place to try if you like Chinese buffets.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "TlX5pM_u-v57KErnTTNMAQ"
  },
  "1YICNMBB9nuc9QZKL56d5w": {
    "date": "11/17/2015",
    "text": "I'll start by saying I'm not much of a buffet person. I've always found them not quite clean enough...way too many kids messing with the food....so so good. But a friend had coupons and treated me for my bday.  I have to admit I was impressed with the cleanliness and definitely the food. Everything was good. The staff never let the food get too low before they filled up more. I had mostly seafood. The crawfish (in the shell) was tasty. I've never had it fresh like that. It's messy but fun to eat. The bourbon chicken was very tasty. The soft shell crab was okay. But I blame myself. I was so determined to get the little pieces of meat out of the crawfish, by the time I got to the crab, I didn't feel like messing with more shells. The soups and hibachi grill looked good but I didn't try. That'll be next time.  I got take out from the buffet and they charge by the pound.  4.99/lb. I found it very cheap considering how much I got. They have dessert also. Cookies, cake and ice cream. My only complaint with the ice cream was the scoopers were all in a faucet with running water to keep them \"clean\" I guess.  I know there probably isn't any other way to keep them clean if it's self serving but I was a tad grossed out. I saw remnants of ice cream in the faucet.  Other than that, I really liked the place and will go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZEkwF-tunP14EGQxyWsbMg"
  },
  "6-4dq2vbAuQQEdUPsjv0Cg": {
    "date": "11/5/2015",
    "text": "Great place for sea food. Doesn't have crabs legs but it has other variety of crustaceans. Delicious friendly staff I recommend it..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-5IjMpi31u9JEAR0TKawJA",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. China buffet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-5IjMpi31u9JEAR0TKawJA/o.jpg"
      }
    ],
    "user_id": "PCPaKq52-I5yUCkUBleL4w"
  },
  "KEN0hfRMJFEjcsOdOQSndw": {
    "date": "10/17/2017",
    "text": "Great selection, fresh sushi an pho, will definitely drive 20 min out of the way for this buffet! Drinks constantly refilled, better experience than going out to dinner at a regular restaurant! Great job!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKQojmjTcNtZoy8rG_MgaA"
  },
  "WjbVNJcq5tGEI7vD3RDU4g": {
    "date": "8/31/2016",
    "text": "Go only when they serve dinner cos the crab other else it not good. Not worth it. And the Mexican guys that do the noodles suck. I ask for hibachi sauce n he fry me plain noodle. Smh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YMdo0iqqi2POJK4lC-XAFA"
  },
  "WonQEtv_royYmdORimc8SA": {
    "date": "1/2/2017",
    "text": "Polite staff and the food is always excellent with a great variety of choices. Yum, love the hibachi grill and very casual environment. Thanks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qY6L1clDDuAkpWaTy662_Q"
  },
  "R925rygVNDjgwzazm5WDKg": {
    "date": "6/16/2016",
    "text": "It's pretty damn amazing. I come on week nights when it's not busy. Weekends are too lit for me. They have a little bit of everything. Stop by and check it out your self.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2bTq2TbCtahBMbMJg7UJDQ"
  },
  "8wh4c_x1SFaxiiXD1vmALQ": {
    "date": "2/2/2017",
    "text": "My first time at this location. This buffet was very clean and the food was not disappointing. It's your typical buffet selection with a few extra items that you don't see offered at the other China Buffet chains. The sushi selection was decent, but could use a little more variety. The staff was friendly and very accommodating. I called a day in advance to make reservations for a party of 30. We had only one waiter assisting us, but she was great! A 12% gratituity was added to the bill for a big party. I will definitely go back again in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "A2l6pDAwA5SkfuOd7E_npw"
  },
  "xFFnoQQ3ufOqx759t0iTbw": {
    "date": "7/22/2016",
    "text": "Best Chinese buffet in charlotte. Great variety, fresh hibachi grill option and pretty decent sushi assortment. I dig it. Price is average for buffets but it's legit. Definitely will be visiting again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "690UFAzaEqHX2tCfXP7cKQ"
  },
  "--kJsBVI1OkSma35ESe0qA": {
    "date": "5/19/2015",
    "text": "My friend and her Husband took me out for my birthday lunch and it was GOOD! Everything was yummy!! They had a noodle service where you ask the chef which number noodle you want and they'll prepare it within 5mins!!! They had such a variety of food from ribs, semi-tradition to seafood to sushi, mouthwatering. I had a plate of sushi-wow, pretty good and they tasted fresh. I ordered Spicy Beef Noodle, this was just tasty and hity spicy spot! :)  I enjoy the service, all the waitress were very attentive and the atmosphere was great. I'll be coming back again soon! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qQ4AdzMdhaJgJbHMEytFHA"
  },
  "uXcxQBPR91O--BIumWVwBg": {
    "date": "10/28/2015",
    "text": "One of the better buffets in town. I love the hibachi and sushi. Haven't had the soups. They always have a good selection of different and sometimes weird foods. Try the octopus, it's good. But they do sometimes have the soggy General tso's, and Sesame chicken problem, and sometimes you will find cold food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hn1dSryI9tmYKt6HyQqJqQ"
  },
  "XuBZ7uNPm7cnmNrSaiVJtw": {
    "date": "2/3/2015",
    "text": "Had dinner their last and it was hands down the best chinese buffet I've been to in Charlotte so far. The place is beautiful and spacious inside. The hostesses and wait staff were all very friendly.  I don't think I've ever seen such a large variety of food before than was here! Seafood, sushi, classic chinese dishes, hibachi, dessert and even some typical American food.  The sushi was wonderful, the hibachi was far better than I would've expected. Egg rolls, chicken dishes, lo mein and  fried rice were all exceptional. Like any buffet though, there some dishes I tried that were getting close to needing to be replaced, and therefore weren't as great as could be. Overall, for $12.99/person (for 2 people my totally bill was $32 incl. 2 drinks), I was beyond impressed and will definitely go back! They also do buffet takeout by the pound, only $3.99/Lb for lunch and $4.99/Lb for dinner!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DC1772GRp5oq4piYaHnUQ"
  },
  "Mscyj0cjcBTXXCuHFLz80A": {
    "date": "9/23/2015",
    "text": "Very good & Clean. Food was very fresh and always hot. The bathroom could use some attention because it wasn't clean but it wasn't dirty. Other than that. I'm in love!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4on3BU0p5yNOFkYaMZiwIQ"
  },
  "zeLq1dUYhpDyfIqpNlou0w": {
    "date": "7/3/2015",
    "text": "Usually this place is fantastic but service was definitely not up to par this evening.   I usually get takeout sushi from the buffet but when I arrived the sushi buffet was about 75 percent empty.  I asked the sushi chef if they were making more sushi and he looked at me like he really didn't care (there was probably a language barrier but the 7 empty plates and me pointing at them should be a universal understanding).  I then asked the hostess she looked at the bar from 30 feet away and said they were making more.  We sat for about 10 minutes waiting while they rolled sushi.  They finally replenished some but for a buffet I had about 5 choices out of a normal 15.  It really wasn't busy although it was dinner time.  I will be back because this was a first time issue but hopefully it doesn't happen again.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRdgtUB8d2xZOQDlvK-LdA"
  },
  "s1x1tg_ImJKiXoVXD_ancQ": {
    "date": "1/6/2016",
    "text": "A surprising find. We had a coupon from their mailer. Quite a variety of food. I would have liked to try more but you can only eat so much! Everything was hot and fresh. The staff was very accommodating and attentive to our needs. The bathrooms were horrible and even after complaining the conditions were not addressed... That was a real downside. Over all we were pretty pleased with our experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yz19KQs8Ncb6fmg2SxjnhA"
  },
  "QW2203QyKeibxSmWXDvY7g": {
    "date": "3/17/2016",
    "text": "We were out of town for the day.  Discovered this place on Yelp while leaving the Southpark Mall.  Immediately I viewed the pics patrons took on previous visits.  The decor was nice and selection was familiar with unique items.  I loved the whole sushi bar, fried rice w/ cabbage, coconut shrimp, beam sprouts, ragoons, etc.  Everything was flavorful and good quality.  The atmosphere is quiet yet you can hear the Asian music well.  Our lunch was under $20 if not mistaken.  I always wanted to find a good quality Chinese Buffet but seemed rare.  Can't wait to eat here upon visit Charlotte again.  I hope the location near University is as good since we are usually visiting that end of Charlotte.  Be careful finding this location as it's right off the freeway!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DaUJvHMmKoDDT3vB_ltJ6g"
  },
  "g8FMZ4S9y0nFDYqiV8jtHg": {
    "date": "6/30/2014",
    "text": "For a Chinese buffet, this place is as pretty good as it gets.  China Buffet just opened on Independence Blvd where an old Olive Garden used to be.  It can be a little tricky to get to, but it's worth the stop.  They've made some HUGE improvements inside and out, giving it a beautiful, modern appearance.  The restaurant was very clean inside, and a lot of details were put into the decor and dining rooms.  The most imaginative is the entrance to the restaurant where it looks/feels like you're standing underneath a starlit evening sky.  The doorway leading into the restaurant rivals PF Chang's as well.  The food offerings were pretty extensive and flavorful.  I sampled several items and nowhere near tried even a quarter of the items on the multiple buffet tables.  There's something for everyone, including kids who may be fussy about foods.  The sushi offerings were greater than most Chinese buffets; there were more unique offerings than the traditional California roll.  And I didn't even get to touch the big salad bar or the made-to-order Hibachi option!    The price was pretty reasonable for dinner, too, considering all of the items that China Buffet had to offer.  Everything was great, and it's probably the only Chinese buffet in the Charlotte area I'd consider in the future.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DFCgj5fbdRn21YbaciBPaQ",
        "caption": "Photo of China Buffet - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DFCgj5fbdRn21YbaciBPaQ/o.jpg"
      },
      {
        "img_id": "FXvvd4cjI9OFi38To81buQ",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Entrance",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FXvvd4cjI9OFi38To81buQ/o.jpg"
      },
      {
        "img_id": "Eyoe2IUQM1UEnkKbnw_4Iw",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Main entrance/waiting area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Eyoe2IUQM1UEnkKbnw_4Iw/o.jpg"
      }
    ],
    "user_id": "_uqIpl5tzucKuIlZZPBZRw"
  },
  "MceO6L30gfxmpQBNdGFFBQ": {
    "date": "5/23/2017",
    "text": "Excellent selections and reasonable price! Has noodle area and make noodle in front of you! Habbachi area! And a decent sushi selection with nigiri for lunch buffet! I wish I live closer to the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Wuw3Cf8JI3vqywAi352irA",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Looove their sushi selection during lunch!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Wuw3Cf8JI3vqywAi352irA/o.jpg"
      }
    ],
    "user_id": "F7tnylvLI_5KZVWs9PUirw"
  },
  "XCoc4BuFefKVep3b6VtzIQ": {
    "date": "1/17/2018",
    "text": "The Sushi is fresh and really good! Pork Fried Rice, Fried Fish, Fried Shrimp, General Tsos, and Sesame Chicken is what I have had and it's all good. Very affordable prices too! It's my new go to place! I enjoy the to go take out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MhfuBoOywWZxmQWximmFvg"
  },
  "L7IkaCkc6m99560Fw2QXGw": {
    "date": "6/14/2018",
    "text": "You guys have obviously never had a good Chinese buffet. Picked over and not fresh. Chicken was disgusting.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLdbZ1DwLjeRXCatsrN_1g"
  },
  "cHlqOqvUgm8PYlNMqPHr8w": {
    "date": "2/11/2018",
    "text": "Took a party of 8 for an 18-year-old's birthday dinner. Had to stack empty plates on a table nearby. Never asked for drink refills. Sushi bar was dismal, on a Saturday nite no less. Food off steam tables okay but nothing to write home about. Cold shrimp on the salad bar was very good but not worth $13 a plate by any stretch. Will not return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SKq4IVrR9KKNh9cwNxtlqA"
  },
  "0H1KaypH3vlbMtF6RIZcAg": {
    "date": "8/6/2017",
    "text": "This is my favorite Chinese buffet in Charlotte. You want pho... they got it. You want sushi... they got it. You want hibachi... they got it. I get takeout from here all the time. A little sushi, seaweed salad, rice noodles with shrimp and vegetable, and throw a few dumplings in there for less than $6! That's a good lunch! The already prepared dishes range in variety from blue crabs to pizzas. I tend to stick to fresh raw items like sushi and hibachi. Great place for big parties and the wifi is stable.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "DSu4b_Ywc3ggFT8WiZWWsg"
  },
  "4uazeBveYxx31grEmscnaA": {
    "date": "6/20/2015",
    "text": "Yet another buffet. Yet another mediocre meal. I think I see a recurring theme at buffets. They pour their money into design with things like statues, running water, or other trivial things to set the ambiance. Then, the food. Sure they have a nice variety of food, but what about the quality? I think there's a formula into opening Chinese buffets. You must be wondering, why do you go to these restaurants then? Good question, I think it's so I have a scale of what other restaurants can do.   This is another one of those Chinese buffets that follow the nice ol' formula that I've seen fail time and time again. Starting off, they do great, but after a while it just starts to be a let down. I had about one plate of food (if you read my reviews you know why) and well it was okay. Nothing special. Very mediocre.   They have sushi, hibachi grill (which is like Mongolian style, but they just use the hibachi grill... In that you pick what you want, hand it to the cook, they cook it, then you get it back), \"Chinese\" dishes, desserts, and some other frivolous things, pizza, Mac n cheese, etc.   Final thoughts: expect grand ambiance and design, and mediocre food. Hey, but for the price... It's a winner compared to other buffets. (12.99 on a Saturday night)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9Z1dcoZrwn8Ul9JTnjjug"
  },
  "zMIQqrZ8JGXzC6k_khugLA": {
    "date": "7/12/2016",
    "text": "I went into this experience not very excited, as Chinese buffets aren't really my thing. But, the things you do for love I guess.   As far as buffets go, this place seemed pretty clean and the staff were friendly. My favorite part was the scoop your own ice cream section where they had a whole tub of mint chocolate chip waiting for me. Just glad I didn't know about this little section before my meal. I am a child.   I pretty much stuck to the salad bar and sushi. I was impressed with the sushi selection and they had someone rolling it right there. There was also a hibachi station where you bring the chef the ingredients you want.  I thought most of the hot food items either had a weird taste or texture so I ended up wasting a lot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QkhRTrURcY3DW0BLLFPsIw"
  },
  "J1BgXUMRMwkVpWm0le4kRQ": {
    "date": "3/2/2015",
    "text": "Went here a couple months ago when they first opened . Large selection, loved the noodle bar , but won't be going back until there sanitation grade is an A",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vlSMvY_M5K4DPMg9n-d0-w",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Beef pho",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vlSMvY_M5K4DPMg9n-d0-w/o.jpg"
      }
    ],
    "user_id": "lUXifKGBbbRUNxaPnuekXw"
  },
  "3PDxOmMOzrlpHPSG9tJdVg": {
    "date": "4/7/2017",
    "text": "My boyfriend and I go here everytime him or I are in town. This place to me can kind of b3 a hit and miss at times. The last time we went this week it was kind of a miss. Didn't enjoy it as much as I did before. However I did enjoy the station were you can  create your own noodles.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VrOnOhc7vavGLl5waYG4JQ"
  },
  "gFjMLEADtDjCKf6-hQt7aw": {
    "date": "2/18/2017",
    "text": "Teriyaki chicken tasted like rubber. Water tasted like kerosene. Very expensive for a buffet..more expensive than Golden Corral.. and mostly seafood.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "knRW5Dvq_sBgTSU8BwN_aw"
  },
  "ALmDKMny5eBd-Gxo35rH7g": {
    "date": "4/6/2016",
    "text": "Be careful of what your charged. They put things on the lunch buffet with little cards that say dinner only. The same things that other buffets have for lunch, like crawfish. Pick one up and you're charged dinner price. And even if you don't they still try to charge dinner pricing. They tried twice on me. Don't  go. Food bland at best.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M0cI78odeq_GKqLzk8sIrw"
  },
  "EkZtaLYcHOtHx06sFkmFwQ": {
    "date": "12/18/2015",
    "text": "This seemed like a good idea from reading all these reviews. I was looking forward to eating thier sushi. After my first dish trying out a few types of the sushi I got up to take a look around what else they had and realized my stomach was hurting. I took a small plate of a few things and sat down across my husband who looked at me and said he is so bloated he can barely eat. He mentioned that many of these places but baking soda in the food to make you feel full and not eat as much. I hadn't heard that theory.... But the way my stomach felt, I thought for sure something was wrong. I left there so bloated, without being able to eat much. Perhaps it was because all of thier food is covered in thick, heavy sauces, but either way..... Save you self and go somewhere else. It's not worth the $12.99.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "T8smF5-uhJB1rt6tjSx4kw"
  },
  "AICxwdsXDKgIG_IqFIOwjA": {
    "date": "11/23/2015",
    "text": "At first, I thought this buffet was awesome sauce, but then I walked around and realized that it was similiar to all the other Chinese buffets I've been to.   Why does this get 4 stars then? Asking the important questions. The sushi selection is great. They have a wide variety of sushi that looks like it could come from a sushi restaurant. The sushi is what earned this establishment an extra star. Just a side note- if you like wasabi, get extra. Their wasabi is so weak here, I barely tasted it. Where's the kick?  Aside from this, you have your traditional buffet food. Dessert section looked good but ended up being disappointing. Egg tart tasted gross and not fresh. I would stick with ice cream.   Service was fine! They were attentive to when we needed refills and cleared our plates often. I may or may not be back- depends on my mood.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "SJEr0t98Op8WDVjhttkKLA"
  },
  "cPlgjWloOmUDyQbrRlpKrg": {
    "date": "1/2/2016",
    "text": "So i read the reviews and went anyway.  But, if I could rent a time machine I'd 1) Kill hitler and 2) go back in time and tell myself to not go to this restaurant.  It is an experience that I wish I could erase.    Everything tastes like limp soap.  The sushi is ok (but if you're dropping 12.99 for Sushi you could do better somewhere else).  The hibachi bar was promising, but the meat on the bar is frozen and meat that goes from frozen to cooked tastes horrible.  I literally had nothing there that I enjoyed and it made me feel horrible.  Don't go.  It's easy to read reviews and go, 'Ill take the chance.'  but I promise, it'll have you wishing for a time machine.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-J3QBdHPqofO40pc6hq3xA"
  },
  "AR2Wc2juwml-vD1lz5n1jA": {
    "date": "4/25/2016",
    "text": "Located on the expanding Independence expressway, the parking lot can sometimes be difficult to get into, but the overall location is fairly ideal. The decor is modern and comparatively stylish, there are no cheesy Asian wallpaper or cheap paper lanterns. It is kept neat and clean and the service is decent. The regular buffet selection is pretty good but the hibachi selection is even better. Their chefs are willing to cater to reasonable requests. Don't pile items on your plate during your first pass just based on looks. Take small samples and find out what you like best. The staff is very efficient at removing your finished plates. I recommend the grilled salmon, the crawfish, the Maryland-style crabs, the grilled pork chops and the beef with broccoli. The mussels are okay but very small, the BBQ ribs are adequate and the frog legs are not bad, but also not great. Taste everything before you season it. A lot of the grilled meats are already a little salty. The sushi is very good for a buffet-style restaurant and continuously prepared throughout lunch and dinner. The tempura and California rolls were fresh and the spicy salmon and tuna were good with some wasabi and soy added. The seaweed salad is excellent and they have a couple of sashimi options as well. The sushi is not as fancy and first rate as a proper sushi restaurant, but if you are craving a lot of sushi at a baseline price, I definitely recommend it. They also offer a take-out option priced by the pound. Stay away from heavy sauces and bone-in meats and the cost will be comparable to standard takeout.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9z3_pRYNskvaOd1ANr7pWA",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Sushi @ China Buffet - Mix some wasabi with low-so soy sauce to go with.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9z3_pRYNskvaOd1ANr7pWA/o.jpg"
      },
      {
        "img_id": "W5GCGBM17rb2LgDAwx-mKw",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Sushi @ China Buffet - mix some wasabi with low-so soy sauce to compliment.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W5GCGBM17rb2LgDAwx-mKw/o.jpg"
      }
    ],
    "user_id": "NerUzfgpX9mOKlXF_vocSw"
  },
  "ZNvhQ2fbOvB-QVa2lKVyfg": {
    "date": "3/2/2017",
    "text": "Everything is great here all the food is fresh and clean. I always end up coming back here when in a pinch.   The only bad comment that I have with them is not the food but the way they calculate the check.  I have coupons for $1 off from yelp. But they take the $1 off after they calculated the tax and everything. Note: you are not supposed to do that. You are supposed to take $1 off the menu price then calculate the tax. I mean it's just $.10 difference. But it's just a matter of ethics and doing things the right way",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m-2KR6qlnAwsPiK9l2C6kw"
  },
  "CeiJzWJisMNUY4-XUa95FQ": {
    "date": "6/6/2017",
    "text": "Hidden gem on independence! Best Chinese buffet I've had in Charlotte. Hibachi made to order from the buffet, huge variety of sushi and endless normal buffet option. They also have hand scooped ice cream along with cheesecake, chocolate cake and many other dessert options. All for $12.99! Such a great deal with great service. This will be our new buffet spot. (And that's coming from a staunch Ru-San's buffet supporter.)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4EeFkGb293dGW5h4fKqDng"
  },
  "m6SyDJVWbCRv719FrCaFEA": {
    "date": "12/25/2015",
    "text": "Out of all, the many.... Chinese buffets, I have had the uh... Uh... I have visited, I hate this one the least. The made to order Lo-Mein, is pretty nummy, a bit on the salty, msg side but nummy. The salmon is also eatable, salty, Yes but this IS Chinese food. Everything is a tad salty, jaja. The vegetable fried rice has always been decent, along with the spring rolls, green beans, and fried plantains. Oh the French Fries were surprisingly crunchy. Meow.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q3WZjM3B2shhctyc9-eYyQ",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Buffet variety",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q3WZjM3B2shhctyc9-eYyQ/o.jpg"
      },
      {
        "img_id": "2sjxPx0HftArkbIQIRUOvw",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Off the grill Lo Mein",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2sjxPx0HftArkbIQIRUOvw/o.jpg"
      }
    ],
    "user_id": "3d83My4k2eKHVSM1fvLERA"
  },
  "yVuBdIt_qBGHR9jwmCVQTw": {
    "date": "8/19/2018",
    "text": "Its okay. Your normal asian buffet.  Some options a bit on the salty side i.e. Bourbon Chicken.  But I do like that they have a habachi option right there so that you can choose your noodles and choose whatever vegetable and protein options you want and they will cook it up right in front of you",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cQUngSwwIjuHd743ytACCA",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Buffet for dinner, anyone?",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cQUngSwwIjuHd743ytACCA/o.jpg"
      }
    ],
    "user_id": "V7bGim4D9ctlyxcOAir6GA"
  },
  "AcMxew0npMbaMwKT9wRW-A": {
    "date": "3/14/2019",
    "text": "Delicious food with low price. What else I can except? Plus this is the first Chinese Buffet with Pho inside! I ate 4 bowls myself!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k2keWSo6rqlD-DzrchN2wg"
  },
  "_EjeYmrbf4naprxaLijU4Q": {
    "date": "11/4/2018",
    "text": "Very nicely decorated and very nice and attentive service. Best crab rangoons I ever had. Very good selection of food. One of the better Asian buffets I have been to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qgKiTLD6zeawLGZJtWE6iQ"
  },
  "HwgCi-UMmP4YN0ZtMHtZbw": {
    "date": "3/29/2018",
    "text": "I have been going to get take out from China Buffet once or twice a month & have enjoyed it greatly. It was kind of like my monthly treat meal.  UNTIL ONE DAY... I got a rare Friday off and I decided to fill it with a bike ride, drinks & China Buffet. The day was lovely and dare I say one of the best days of my life. Then when I broke into my China Buffet take out the food was so awful it completely took away all of the joy that had filled my heart.   The Chicken was so rubbery it didn't even taste like meat from a animal that exists on this planet. All the sauces were watered down. Noodles & the rice tasted like styrofoam packing peanuts. WORST EXPERIENCE I HAVE EVER HAD WITH FOOD IN MY ENTIRE LIFE.  Definitely ruined my entire day and that's saying something because my girlfriend totaled her car later on that night. But after I explained what China Buffet did to me she said, \"I'm so sorry this happened to you\"  I have not returned since then and I will not until a representative from China Buffet personally apologizes to me. Also I live just around the corner so I drive by China Buffet on a regular basis. And my hate runs so deep I curse directly at the building (a inanimate object) every time I drive pass.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "690lClPHEn8UaSy0S0HWPg"
  },
  "H6q4P7i1kn4kssJ42RMOOQ": {
    "date": "3/23/2018",
    "text": "This Chinese buffet has mostly standard fare but done quite well. Some of their sauces are a tad sweet, however. That usually indicates that the sauces are pre-made. They have more items than most Chinese buffets because they have four buffet tables plus sushi. They also have some items you don't usually see on the dinner buffet such as cheese baked mussels and fried crab clusters. They replenish the buffet often. You can tell that they take pride in making sure the food is fresh! The sushi is very good and they will make you any sushi you want. The service is fast and friendly. I'm rating it four stars instead of three stars because they keep the buffet fresh and the sushi is great. All in all it's a very good Chinese buffet in the Pineville area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_CQetImJGo97dAIM0fjsSA"
  },
  "qv-JcTsQTGAPVcdV-TzqKQ": {
    "date": "10/10/2017",
    "text": "What can you say about a Chinese buffet. They're typically kind of all the same and equally delicious. This one happens to be right around the corner from my house so I've been quite a few times. Never disappoints, always good food and friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x8e1Cc1lh835Q1CpHAD0RQ"
  },
  "3_i32cV4hYmHOQ4o26Kiwg": {
    "date": "11/3/2018",
    "text": "Terrible, terrible, terrible. Nasty environment when I went, dirty tables everywhere.  The food had been sitting for a while it was not fresh. I encountered numerous pieces of gristle. Would not recommend or return. This is why I do not frequent buffets, poor quality food. I knew better...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eN12VACxEYX7OsPRz_yzVA"
  },
  "YKBQUxLAUAxYZF8N0L_2Ng": {
    "date": "3/18/2018",
    "text": "Needs help, service is great, food is not. Cleanliness is sketchy at best. Chinese cooked by a Latin cook, he is a great worker, but ingredients lack in everything. Pass by if able. Not worth the price.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tI5zrmPe5-sRqdE8iSl4yw"
  },
  "4TcUAOe5O_yfQFjzYv8JHw": {
    "date": "1/2/2019",
    "text": "Great nice surprise!  We have been eating at many Chinese buffet places across the country.  This is the best in terms of value.  We had lunch here, less than $10 per person with great variety of dishes including fish, shrimps, scallops, eel ... they also have high quality ice cream selections, which we really enjoy.  We will go there again for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PdA_PUFlpbl22sj7CtyJNw"
  },
  "3Vsg81TDng5nZwzInduJRw": {
    "date": "10/20/2018",
    "text": "Very good food and service they get A from me and they are also very clean. I have seafood allergies and it was not a problem at all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l9HeGzL6TNh-7euR32vhLw"
  },
  "pmx1HpW_HIq2faTxifqm8Q": {
    "date": "10/15/2018",
    "text": "Worth every penny for the fresh hibachi, sushi, and pho bar. Everything else is pretty typical for a Chinese buffet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dnDkPwxpmGqX2terX5t7yg"
  },
  "6LeOP2URU8KSNW3sB5hXdA": {
    "date": "10/29/2018",
    "text": "Been here a few times places usually relatively clean food isn't always the freshest not a bad place to go for the price but there definitely are some other options specially in this area",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wYp0fu4nmBYNY6HzhbxnXg"
  },
  "mlenWDTsEaw-T5iw3H2Mzg": {
    "date": "1/16/2018",
    "text": "The only reason I didn't give this 5 stars was the missing selection labels on half of the items. But I'll chalk that up to a lazy worker of the shift and move on.   I liked the Hibachi food (though some WRITTEN instructions on where to stand and how to order would have been nice). I liked the cooked sushi. I wanted some cold sushi, but it appeared you needed to order it and I didn't have a list to pick from. I liked most things I took from the hot Chinese food section. I tried some unknown dishes just to be bold about it and they weren't to my liking. But everything I was familiar with tasted great!  VERY reasonable pricing and the wait staff were quick to clear our dirty plates. All four people in our party left bellies filled and happy. 4 stars earned.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OFh0f5zmSZCVs38OW6w3cw"
  },
  "Rq2AZpDfeCaYWa3LsvO6FA": {
    "date": "11/24/2017",
    "text": "Dinning for thanks giving lunch. noodle soup was great. Sushi was so fresh !!  Seafood and ice cream also great too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oRJKgWuGY1OMqB9uHynSLA",
        "caption": "Photo of China Buffet - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oRJKgWuGY1OMqB9uHynSLA/o.jpg"
      }
    ],
    "user_id": "V54WLWBEIU2DrpeGOhwvlA"
  },
  "f7m1q5cV9FXlJ21MAa459w": {
    "date": "4/4/2018",
    "text": "Absolutely horrible.  If you are in the mood for vegetable lo mein that is literally cabbage & onion lo mein then this is the place for you.  Sesame chicken was incredibly dry.  (How is a dish with sauce DRY??) Save your money and go somewhere else",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eH4g0GBISUG4mo-3FL7RaA"
  },
  "vb4UvYC4o9_yG1YaUf1euQ": {
    "date": "5/11/2017",
    "text": "Came here on a Wednesday during dinner time. The buffet had a good variety of selection but you would have expected more buffet lines bec of how huge the building looked from the outside to inside.  Food to me was not good and most of it looked like it was sat out there all day. The only thing I've enjoyed were the fried wings.  And sadly, all 4 of us that dined in had a very upset stomach and had to run to the bathroom later that night. Another bad part of this experience was as I was leaving the restaurant the hostess (that looked like she could be the owner of the restaurant) dashed right in front of me to greet the customers that walked in while I was holding my almost 2 month old baby! No apologies, just rude!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "861VsknkUj86-FDXNMyebA"
  },
  "U5EeuUs8OpsCglL3lyzapg": {
    "date": "11/24/2017",
    "text": "Have a lunch with family.  Fresh sushi and fruits.  Sushi chef and habachi chef so nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ss1SAzrABVHuyuCg9eGKLg",
        "caption": "Photo of China Buffet - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ss1SAzrABVHuyuCg9eGKLg/o.jpg"
      }
    ],
    "user_id": "VTZyEmcTBxG9--RyiyVQoQ"
  },
  "wpl-FS2oRIAcgP68UvODKg": {
    "date": "4/4/2018",
    "text": "Do not go there for the sushi! It's probably been sitting there for hours and God only knows where the fish came from. The staff is very nice but the food is horrible!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RiNf3bBQ_LoLJFPgFj-_ng"
  },
  "Wug4M4usThqll7xRCIs-TQ": {
    "date": "5/14/2016",
    "text": "I love this place. They have a great variety for a reasonable price. I love the sushi! Always fresh. My favorites are the sushi, noodles soup and crabs. I think it is a great price for the options they have.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "awzDFSj-fDa7UAGBr_O52Q",
        "caption": "Photo of China Buffet - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/awzDFSj-fDa7UAGBr_O52Q/o.jpg"
      }
    ],
    "user_id": "gN2Kf9f9pdpIfaOt42gWeA"
  },
  "yYv4U-CBpbgOgWpKZ3IM8g": {
    "date": "4/24/2018",
    "text": "The decor awesome. I've eaten here 5 times and was never disappointed. The food quality is good and the taste is excellent. Not too pricey for such a nicely decorated place. my servers were all very good. The place is very clean. Finding the entrance was the hardest thing with a bit of a walk around to it and that oddly placed wall outside... But it is definitely worth the effort.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2zbvNec-hdz25huaZpLVAQ"
  },
  "gCetxGu9s90LaTO-rOMvXg": {
    "date": "3/14/2019",
    "text": "Found this place looking for a spot that had pho! While the service was absolutely fantastic, I can't say the same for the pho. The noodles, vegetables and meat were great quality but the broth was bland, colorless and overly greasy. Lacking the signature spices that go into pho I left here a little disappointed however I would happily return for the other dishes!   I'll update on the other food stuff when I return!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7YZ9-buN4RMh3ymKd70OCg"
  },
  "z2RQRdWhXEjZScfN7cHRyw": {
    "date": "7/2/2019",
    "text": "Decent for a Chinese buffet. I've had better and I've had worse. This one was definitely in the A-OK range.  Seated quickly and off to the buffet, there was a good stock of plates ready. The steam tables were low on some items and it seemed like the kitchen was more focused on platters of delivery items being cooked and foiled up then placed on trolleys and taken out. This continued for about a half hour and then things improved some.  I managed to stick to a keto-in-spirit eating program by avoiding the noodles and rice and battered. I did one trip to the hibachi that was mostly beef and onions and peppers, but the chef overcooked them to beyond well done. The beef turned tough. The sushi selections looked good and not all of them were covered in sauces. Some basic sashimi items there were nice.  I skipped dessert and did not drink soda. $14 or so was fair for the amount and the quality of food. They also have a free wifi.  My waitress kept my water refilled and cleared dishes promptly. When it was time for the check, she processed it quickly there too.  [Review 11334 overall, 1111 of 2019.]",
    "rating": 3,
    "rated": {
      "funny": 8,
      "useful": 18,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "R-MUJegoAncxQVQ3W21N0g",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. China Buffet in Charlotte NC",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/R-MUJegoAncxQVQ3W21N0g/o.jpg"
      },
      {
        "img_id": "DH7d_ZxM0xADaOfBEaFIzA",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. China Buffet in Charlotte NC",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DH7d_ZxM0xADaOfBEaFIzA/o.jpg"
      },
      {
        "img_id": "YQfVSjpvSi_aGnUjkhn5Uw",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. China Buffet in Charlotte NC",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YQfVSjpvSi_aGnUjkhn5Uw/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "wbPDiRPt0JpG2ijr1edA2A": {
    "date": "7/30/2019",
    "text": "If you want to feast/gorge on multiple dishes - Chinese, seafood, ribs, fish, sushi, salad and even ice cream. This is your place .  It's clean and the workers are attentive and friendly . You can also have some hot or sweet and sour soup. You'll definitely leave with a full belly... and probably feel some guilt if you partake too much .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zy03I5QV6MTTfmlnCEUF6g",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. August 2018",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Zy03I5QV6MTTfmlnCEUF6g/o.jpg"
      },
      {
        "img_id": "JhtMlGXukI7Mv_rWVfSNqg",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. August 2018",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JhtMlGXukI7Mv_rWVfSNqg/o.jpg"
      },
      {
        "img_id": "5qdrjyO7afsS4HPrNvYKqg",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. August 2018",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5qdrjyO7afsS4HPrNvYKqg/o.jpg"
      }
    ],
    "user_id": "JU54PFtLnY-zZweOrxsmvw"
  },
  "wNPCGeKKukWCt8o7SaaN0A": {
    "date": "8/21/2019",
    "text": "My family and I have been here more times then I cant count. I think the sushi in this place is so good they need to have a separate sushi restaurant.  I love the blue claw crab they serve, that is probably my favorite thing besides the sushi.  The place is clean and the food is hot. Sometimes depending on the day and time, the food can get empty and you have a wait until they fill it back up, but other than that a great place for a large party and if you have kids that like to eat...come hungry!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yAR8BR4pkduzqwiKG670gQ"
  },
  "H8v2V-yhMU1UG693zQ37oA": {
    "date": "7/19/2019",
    "text": "This restaurant is huge with tons of seating available. The buffet has the food typical to an all you can Chinese buffet but with many more options. My family especially likes coming here for their fried blue crab which is not that common to find. I also enjoy the hibachi section, bring cash if you would like to tip the chefs here. They have a hibachi bar where you add whatever fresh veggies and meat you would like and then the chef cooks it for you. It has that nice sear from the grill and obviously very fresh! I didn't like the udon bowl I got here and for the most part their seafood is hit or miss. The squid is usually very rubbery. But other than that the food here is fairly good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vDyo_Vink7VVrdDP0pQy1g"
  },
  "jqdMSKusgiZgkq29veK_fg": {
    "date": "7/17/2019",
    "text": "If your looking for a cost effective all you can eat asian buffet for lunch, China Buffet is a great deal for the money, $9.99 at lunch and includes everything you can eat. They had a variety of asian dishes, including traditional Chinese, some basic sushi and sashimi and Korean BBQ style (although after gathering what you want cooked you hand everything to someone and they cook it then hand it back - you tell them what sauce(s) you want). Even saw people having Pho soup made. Exterior of the building can use some maintenance but the inside is well laid out and everything is easy to find.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RWDZMPlz61PuER2fdipTKw"
  },
  "wHXxEdgG8UHQ3Y-N5vdBwA": {
    "date": "8/24/2019",
    "text": "I would not give them this one star, I went in for carry out I was looking at the menu and ask the lady that if they had chicken and rice combo and she said the restaurant across the street has combo we dont have that, they need to put her cleaning tables, she is not professional at ALL, I spent over 30.00 and she didn't want to give me any silverware or duck sauce, she had an attitude when I ask for fortune cookies and she gave me ONE and it was STALE!! This is not an elegant place like they try to make it, the lady at the register messes it up completely, I did not sit in there and it and I will definitely no be going back!! the food was NOT GOOD ON TOP OF THAT!!The AMAZING WOK IS WAY BETTER good atmosphere and professional people, should have went where I knew better that is what I get for trying to give other people business!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k5tfr7-JdA2s31SZZ6H3vw"
  },
  "Xj1oIuVkbKoQZAQMxvF0jQ": {
    "date": "4/1/2019",
    "text": "Eat the noodles and hibachi.  The items on the buffet bar are cold and not very good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gNuhV1lthYup7gKbwsl8rA",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Shrimp Noodle Soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gNuhV1lthYup7gKbwsl8rA/o.jpg"
      }
    ],
    "user_id": "Vwju35E2KfIkuGPF-1eQ7A"
  },
  "tQL5_U2Ypq-mouxqW47YLg": {
    "date": "6/8/2019",
    "text": "Really disappointed. Food had been sitting out and not  replaced for fresher trays. And the $4.00 off coupon is misleading. Just get water and don't use the coupon, it's cheaper.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5npViXk9KR1ioHF_IDeN-A"
  },
  "zUrJ9TvkzA3huYL6R7sOAQ": {
    "date": "6/25/2018",
    "text": "Drinks with colleagues turned into a mistake on Independence. Seriously, after a day of not eating and a few beers down we thought a Chinese buffet would be a good idea. Not expecting authentic Chinese food or even good food, but we did expect it to be edible. This place was not clean and the food was practically inedible. Managed to eat some sauteed string beans, mushrooms, and soup but everything else looked highly suspect.   Save your money and go somewhere else. Too pricey for the low quality of food.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "TWQ4bxTnfz40cZMFCE2W-g"
  },
  "3KWavoDmeCkrP9A2rETc8Q": {
    "date": "8/7/2019",
    "text": "Fried blue crabs were fantastic, so were the stir-fry shrimps and clams.  The rest were just so-so.  If you like noodles, have them cook it for you via 'hibachi', so it would come out freshly cooked however the yellow noodles were stale.  Just so-so buffet except for the seafood.  We were orverchaged too, had the 11.99 for 2 people.  We had the 2 off coupon, yet for some reason, after having paid, we realized they did not took it off, despite telling us it was.  Dishonest!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdNaUCqAisngYjamZJU4LA"
  },
  "DJYBSGS_HoqC0bSMG_Lx5w": {
    "date": "11/11/2017",
    "text": "Lol the $1 ofd total bill didn't quite work, not that they didnt honor it but i didnt even get a chance to try...they brought out the bill unexpected.  With that said, this place is solid for $12.99. Someone on here said just the sushi is worth the price, well said! The sushi chef here is very good, some great rolls like rainbow and nigiri. The noodle soup was ok, didnt taste that great, only tried the duck noodle soup. The hibachi has only noodle for starch, but has scallop(small), shrimp, beef, chicken etc. Hibachi tasted good, lot of sauce option. I likes the garlic sauce. The seafood soup makes me question where the seafood is. Has frog legs, steamed fish, crabs, this awesome mousse for dessert that comes in strawberry and chocolate flavor.  The only down side is it is right on independence and mannn it's hard to turn in when traffic is going so fast. Their plates have the restaurant logo and the entrance is nice.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8zpZLEWweD0Tp6wLTzlZsQ"
  },
  "BNF1f6BrKW3Wznp5ovHCfA": {
    "date": "11/20/2018",
    "text": "Ahhh!! Alright this is one of my fav buffet I have been too, czo they have all the soups here (hell yess) and which is so worth to go here. Pho soup taste so good and fresh also Ofcourse different kinds of varieties of food in here. Worker are nice and friendly... pretty clean as well. Ps- this is the first buffet ever that they serve pho noodles soup . Do check it :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H-OZU44HUgpJJHTGeJuTdg",
        "caption": "Photo of China Buffet - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/H-OZU44HUgpJJHTGeJuTdg/o.jpg"
      }
    ],
    "user_id": "RpwYRO739ozXFGh3QapTDA"
  },
  "Rd5N8jkN6fsQvQq3EPabDQ": {
    "date": "3/28/2019",
    "text": "We always come here. One of the better buffets in Charlotte. The servers are never swarming you like many buffets that think you will just fine and dash. Hibachi chef is always nice. They serve duck here so I come here. Sushi is pretty on point for the most part and they also have a soup station",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "48PXTiNRMlIlELvGII3R6g"
  },
  "DkfYKsF2MMkoinQe-9lhzw": {
    "date": "6/21/2019",
    "text": "Their soup bar's noodles are very stale, but they have good broth. The buffet itself is nothing impressive, and the sushi is definitely frozen fish, but if you want sushi for a cheap price, it's a good deal. Everything else is your typical Chinese buffet style foods, lots of fried foods and honestly not really worth the stomach cramps after.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vpa0Df-ZDgNMzdUtjCl_Og"
  },
  "cW6UhX4sdXUqBrl4omR6IQ": {
    "date": "9/29/2018",
    "text": "We wanted this to be our next Chinese buffet spot but was underwhelmed by it all. I get it, Chinese buffets aren't always the best but since losing the one we loved it's been hard to find one good enough to replace it. There was ample selections and the sushi was pretty good. Worth getting the fresh hibachi section. It was worth the try but can't claim we will be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TJ5rIrvfv4gsPLK-OBC3_A"
  },
  "0jKFx1dv59mIHdpO2jx90Q": {
    "date": "2/8/2018",
    "text": "We were looking up different Chinese/American buffets in the area awhile back and came across this place.   This is our 4th time eating here and a first for dinner. We really enjoy this place. It's definitely worth the price you pay for. And service is great for being really busy after 7 PM.  The buffet is good, the soup is good, and the Sushi is fantastic.   Definitely recommended if you're in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6Moef5lE-j371xByl3VpHg",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Sushi is really amazing!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6Moef5lE-j371xByl3VpHg/o.jpg"
      }
    ],
    "user_id": "r4bjoPReQeHgWYaKxMom3g"
  },
  "eOAfVI9DUDexUO8f6544xw": {
    "date": "11/11/2018",
    "text": "Well. This used to be a place we stopped in to for lunch or dinner when on this side of town, however this visit was a 1 star visit. Whoever the manager is, a lady, refused to take off my lunch that I didn't like. I tried to explain that the chicken was slimy, and left the entire meal still sitting there. Not one of those \"I ate half, now I don't want to pay for it\" kind of situations. Now, the dish was $7.99. Not something I can't afford. But the best part was when she came to my table, and said \"it's your fault for ordering it. We make it that way and everyone likes it. It must be that you're the only one who doesn't.  I can give you half price but that's the best I can do. You ordered it\"   Wow. That was the last time they will ever see me darken their door. However. Not only was this a typical Sunday Buffett atmosphere where the crowd was thick and the team looked stressed out, which I'm normally okay with, just this alone tells me I'm probably not the only one who gets this royal treatment. No longer do I recommend this location. They couldn't spare $7.99, to take off a silly little plate their customer didn't like. Here, it's the customer's fault if they pick a dish they don't like.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jmS4UmDKDyqs_UOZj5vdLw"
  },
  "bUOyAKbnFu8LLdjQli1tjw": {
    "date": "4/18/2019",
    "text": "One of the best buffets in town very good prices for dine in or take out (i do both) alot of food to choose from and it always fresh once a pan is empty they refill within minutes",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1AdPBObwpWFTPjOgxNvqwA"
  },
  "1PqaygHTSERvc-P_KK7yMQ": {
    "date": "4/8/2018",
    "text": "What I liked: A lot of food options (and fresh sushi) for a very cheap price. They also had a pho/noodle bar but I didn't try it because I wanted to fill up on the sushi.   What I didn't like: The sushi chef wasn't putting out any new rolls at a sufficient rate... When I first arrived there was a moderate amount of rolls and good variety. As time went by there was less and less sushi available because people were getting it, which makes sense. But for some reason the sushi chef wasn't making any more! I thought that when the sushi supply was low, he would make lots of new fresh rolls but after 30+ minutes, nothing happened. Second, the seafood options are meh. The clams I had were great, but the squid was so tough and nearly impossible to chew enough to swallow. The cheese concoction on the mussels was also very weird tasting and I couldn't eat it at all without feeling nauseated.   Overall, I'll probably be going back again for sushi cravings when I want to eat a lot for a cheap price, but probably earlier so that I can get more of the sushi before they run out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IZN3kSUna3S-7KM-rn00bg",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Cheese-mussels, clams, squid",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IZN3kSUna3S-7KM-rn00bg/o.jpg"
      },
      {
        "img_id": "C-58jH_yKsAs1DLAasx8tQ",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Miso soup (i added green onions)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C-58jH_yKsAs1DLAasx8tQ/o.jpg"
      },
      {
        "img_id": "-n4kjYIFookeeOyhh7-5tA",
        "caption": "Photo of China Buffet - Charlotte, NC, United States. Assorted sushi &amp;amp; nigiri from the sushi bar.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-n4kjYIFookeeOyhh7-5tA/o.jpg"
      }
    ],
    "user_id": "mPt5YTc64Mab-4iVbKUNHg"
  },
  "J0f7OUIcrQclFWqt2HPW6Q": {
    "date": "7/26/2014",
    "text": "Nice evening meal here...lots of fresh fruits.  Nice made to order soup bar..  the blue crab are fresh and tasty.  Even salad selection is healthy.  I really enjoyed dip you own ice cream and deserts also very good.  plus the restaurant is really beautiful and new...clean goes for the best reason to try here!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Lh361K2gGDXH5-917P7sQ"
  },
  "XblcrzdcuQ3M5M7GZsZfOg": {
    "date": "8/8/2015",
    "text": "We have a big family and the little ones are picky. This place had something for everyone. Very clean and service was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MtHNx5YzBs2yMwDdQ__I-Q"
  },
  "WKrYYERFwAi3CNgCRa0RXg": {
    "date": "4/23/2015",
    "text": "Best sushi in town, better than Japanese upscale restaurant, it was already worth the 13 bucks dinner buffet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QQ0pSnikd_-2m-Z37vMUxw"
  },
  "5Oe80Kr6KAqAfyoZNS75Rg": {
    "date": "8/5/2014",
    "text": "Initially I was super disappointed because we've waited for a really good Chinese buffet to open up. Hibachi is great but the service is really bad. China Buffet is beautiful and great service but the few times we've been there the food has been cold or almost empty trays. We gave them another try and this time we went for lunch instead. the food was so much better and I love the fact that they have a variety of food. Thoroughly enjoyed the mango and love the fact that they serve Pho! Better safe than sorry and go for lunch when everything is the freshest:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Ap-Uh72qy1IiVwIhQWOew"
  },
  "vrUrEbRcm3zGHdOfFD7RKQ": {
    "date": "5/10/2015",
    "text": "very good food and plenty of choices.  the most important thing is the price  !  very affordable!  the only thing i dont like is the traffic on independence blvd!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x6tABqnqkWPdY6_zcnWJ6Q"
  }
}