{
  "50N2jr-bbtDJfHKysaBDMg": {
    "date": "11/19/2017",
    "text": "So disappointed! I was hoping to have a new Pho place closer to home but I haven't found one yet. I ordered the pho. My husband had the bun. Both were bland. I was not impressed with the spring roll either. They served them with a duck sauce? instead of nuoc mam which I had to request. The sauce had nothing in it! Perhaps fish sauce with the usual ingredients (garlic, daikon, sugar, lime, etc.) would add more flavor to all their dishes.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hgWmZXmxG90Zt7Hm0OWqKQ"
  },
  "sOJ0ewxPW5zmJc9qv8Vu-w": {
    "date": "11/3/2017",
    "text": "Some people leaving these god awful reviews are idiots. Ok, yeah they just opened so there are a few kinks that need to be worked out but the food is DELICIOUS. But what new establishment is going to be perfect. It's a family owned restaurant! Cut them a break and try them again before posting. Like really? You're mad because you didn't get a napkin with your FREE appetizer?! You were already mad when you walked in. The space is beautiful, the staff is nice and  I love that you can customize your pho and rice bowls.  I had the shrimp and rice and it was so good. Next time I'll try the pho when it's not so hot out. Great addition to the Steele Creek area! My new fav Vietnamese spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SmyQZ4JuIUWRgmK9AB17hA"
  },
  "8joQoVrxC0P-Q1kgT9EfuQ": {
    "date": "11/23/2017",
    "text": "I was on my lunch break and thought I'd give this place a try. I love Pho so this was right up my alley. It was good and filling. The wings were very good. We will try it again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P7GuJYe8x7qwMm0bveqwJw"
  },
  "F_1uIjOrkzND2jxSvMvtdw": {
    "date": "1/10/2018",
    "text": "Love this place! Best Pho I've ever had and it's reasonably priced. Will always recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R6PmPLil44iQZqAUMdWEQA"
  },
  "8LCyZ0uzBoM8CgcqPU9-xA": {
    "date": "11/13/2017",
    "text": "First I walk inside the restaurant it look nice. I am really happy this place was open. I order bun thit nuong with egg roll. When I got home open up I see really thick pork chop. Really? I order that nuong not pork chop. Well I still try it out. Meat no good. Fish sauce really no flavor taste like fish sauce add water. Restaurant look nice. Service ok. Food 0 star.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oxX48UjMBGFSpgHmVTwmXA"
  },
  "Ai-byqbK4Gz-g1QYbm9M0w": {
    "date": "12/1/2017",
    "text": "I cannot express how delicious the soup is. Do yourself a favor and get a pho with round eye and meatballs. It is ridiculous how tasty it is. I have searched high and low for a good won ton soup and this is about the closest thing I can find. I'm excited to try the wontons when it becomes available. Service is fast and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aThc7WsRQXRbemwJxgbicQ"
  },
  "kwZzpDIZR7UuWkcW_D2MJw": {
    "date": "12/22/2017",
    "text": "Ordered mixed seafood pho and it was excellent flavor was good and the small bowl was more than enough couldn't even finish. I also had an order of rolls that came with peanut sauce all very tasty. On my way out I asked about hot coffee since it was a cold night in Charlotte and I was out of town. The lady came out the door and told me that she could make some for me I was so appreciative it was also very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6RgyuFERUX1QtAwbdnk3zA"
  },
  "CPSt8CRrE4YN_osO6YNuew": {
    "date": "11/2/2017",
    "text": "I was at the nearby Lowe's and just noticed the sign for Mr. Pho. So decided to drop in for an early lunch. The decor was very nice compared to other Vietnamese restaurants. I had the Chicken Pho and the broth was great! They only had white meat in the Pho and my preference is dark meat and would have preferred a mixture of white and dark meat. I'm probably just nitpicking as many Pho places only use white meat as I'm guessing that's what most patrons want? The complimentary spring roll was EXCELLENT! I'll definitely order that next time. Looking forward to trying other dishes and super excited Charlotte has a new tasty Vietnamese restaurant in this area of town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "odWyrjG1wRcP_Vn87KN5XQ"
  },
  "mbVk7owuZtR3fz_tCc_H0w": {
    "date": "11/11/2017",
    "text": "I love pho and wanted to give this new place a try. Well let's just say that I never ever not finished a bowl of pho. Especially on a cold fall day like today. We were greeted and seated quickly and the atmosphere was good. We ordered two appetizers and one each bowl of pho dac biet large and a regular bowl of bun bo hue. I was disappointed when the waitress brought out the pho and bun bo hue without any vegetables garnish, a key ingredient with pho! The very little helping of veggies garnish came about 3-4 minuets afterwards. Starving I started on my pho still waiting on the appetizers. The broth was mediocre at best with very little meat. It lacked the deep richness good pho broth has. After 15-20 minuets goes by another waitress asked if she could take my 70% uneaten pho away so I asked her to cancel our appetizer since we never got them. Then 5 minuets later I was told by the owner or manager that she never even relayed our appetizer order to the chef. I asked for the check and paid was when the only water refill was given which I kindly told him no thank you! Disappointed!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QNWx3IWnzuYCS3LclhNdeA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QNWx3IWnzuYCS3LclhNdeA/o.jpg"
      }
    ],
    "user_id": "fjPKSFoDZhk3lg59N35Jbw"
  },
  "dxo6JFCMCZTZ8QVp-7yjHw": {
    "date": "7/22/2018",
    "text": "Best food, and the nicest people! We tried a handful of places before this and now this is the only place we go! They are always amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZxToftPy71EWs_n0WYxAGw"
  },
  "UK4-Bp7hXmsSBBW6tkyBOA": {
    "date": "5/29/2018",
    "text": "Food came out quickly & everything was so tasty! The service was exceptional! Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TvlQRtJqDwFLHS_tKwyEJg"
  },
  "APro2T-4Wyl5r3l0fCp6pg": {
    "date": "5/28/2018",
    "text": "Food was very fresh and the staff was friendly. So far, best pho in town. We ordered the vegetarian pho with tofu, stir fry beef and vegetables and avocado smoothies, one with boba.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w7czXjGvUtyj3P3ia0Be2A"
  },
  "xT-zDlgPXVPXIj5sNQp2CQ": {
    "date": "12/30/2017",
    "text": "This is one of the best meals I've ever had!! I'm a vegetarian and came here based on a yelp review. I'm leaving the country tomorrow from the Charlotte airport and I am staying at a hotel near the airport. I came to this place and they gave me a vegetarian menu. I opted for the vegetable soup. They had some fake chicken and beef for vegetarians, but I like straight tofu. A nice woman who may be the owner brought me a spicy chili paste to try. It is homemade. I cannot say enough good things about it. Really, it is absolutely amazing one of the best things I've ever tried in my life.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2yZwKiTd1nzdZ3qS7Sx15g"
  },
  "diaclRC-iETxnv4WKsYaAQ": {
    "date": "5/13/2018",
    "text": "Love their Bean Curd shrimp cakes, pho, bun cha ha Noi and their desserts the Tri color yum! The place is really nice modern and clean too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-r1b00Ud5BkGKTmei7cHOQ"
  },
  "JHjfAHL9hGhbuG73syNRHg": {
    "date": "11/4/2017",
    "text": "The spring rolls and peanut sauce were fantastic. Everything was wonderful and freshly made. The menu has a lot of create your own options for those who are just starting out with Vietnamese food or for the less adventurous/picky eater. Beautiful inside and friendly and attentive staff. Will be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2nuacy9Sgwgd1j4Nkai2NA"
  },
  "Rb5Uvxo1C_mrJFui1CO2Ag": {
    "date": "4/29/2018",
    "text": "The spring rolls are very fresh. The chicken pho is really good. I just found this place as my plane was landing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oEgSxhztIzV_ROh4t53cEA"
  },
  "cGl3TxJRRDBsUqZ1-e9zlg": {
    "date": "12/2/2017",
    "text": "Excellent food and ambiance.  I highly recommend these guys if you are into Vietnamese food.  Pho and Spring Rolls were excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rDUxstWvH7NJyKkrmBH1vA"
  },
  "KcbOmtKPlUjfEtOQtJFQig": {
    "date": "3/6/2018",
    "text": "My Co-worker and I come once a week. The pho here is probably the best in Charlotte. The broth here is extremely flavorful. The staff is very friendly. I highly recommend this to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7WC9PGTqV9xZdvj5LkKkWA"
  },
  "xtFTbcLBgQjuUVgHjgfQrQ": {
    "date": "11/21/2017",
    "text": "I saw a Grand Opening sign while passing the store and I had to go in. The food was great, employees were very nice and the price was reasonable. I really enjoyed it and I hope this place grow to other places and I hope it will stay in business.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S63YCJkt_U6aGQXnMiea-g"
  },
  "rxDP-m2CE5fGmWMZ6Woa-g": {
    "date": "3/15/2018",
    "text": "First time here and I'm super impressed. Great ambiance, great service, great food. Can't ask for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O8euGtn92zjgnykHKeEBAA"
  },
  "Xn-w80G8tB9ntLrZwMDETQ": {
    "date": "12/12/2018",
    "text": "Got some take out steak and brisket pho on a snow day. Thought the broth was pretty good however, the amount of meat and noodles for a large was less than I am used to from other places. That being said, I would still come back because the broth wasn't too salty and had a pretty good flavor compared to other spots nearby.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t7Mo8-Co7Rde3ZQITqOJjg"
  },
  "1dcN-P8CiQWVruHhU6neQw": {
    "date": "11/10/2017",
    "text": "Had pho and bun no hue. Both were good and came out quick. Also got Che to go. Happy with our visit and will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qAG9cYOkKNDVU_DsF9pBHw",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qAG9cYOkKNDVU_DsF9pBHw/o.jpg"
      }
    ],
    "user_id": "l1T-o_mIfFTSj20krijRMw"
  },
  "F0-pRQqttu0YAjAmTSpUsw": {
    "date": "3/6/2018",
    "text": "my food is ok. I wanted a green tea but no one asked if i wanted anything to drink. Servers want to be elsewhere... so do I honestly. There is a small restaurant at Ayrsley called Pho Ngon. They are much more welcoming and attentive. That's where I'll spend my money in the future!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vZgPM99DcqgIgN2hGhEuqw"
  },
  "6uAacNo0HQHVp_Bv7bCpHA": {
    "date": "11/7/2017",
    "text": "I was actually excited to try this place out, but I must say I was pretty disappointed. The spring roll was too plain, the waiter did not once come ask us if we need it anything or refill our drinks and the pho large looks like a medium. I order the Vermicelli bowl to go and I'm not sure if the sauce was put on the noodles (which is a big no,no) or what, but I don't see it with my noodles (missing main ingredient). The only good thing that I had was the egg roll. It will probably be my first and last.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xqdBHRpCkZO1c52-KoHYdw",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xqdBHRpCkZO1c52-KoHYdw/o.jpg"
      }
    ],
    "user_id": "-UT7YMNOnK0LbbbVa6b_Dw"
  },
  "f7eUanhFzX4Mb3IlqtFUcg": {
    "date": "6/7/2018",
    "text": "Fresh and delicious! Warm and inviting the food here is so flavorful! My favorite place to go for vietnamese cuisine! Excellent customer service what's not to brag about this place?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nxQu8EY3IAm5yLUqGuGg2Q"
  },
  "67FDQbaVpSUD0vRhCOv4Kg": {
    "date": "3/25/2018",
    "text": "Always consistent food, quick and service is good. Chicken soup my fav! Spring roll is super yummy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ud36ls68b3oqPLkbPY4QWg"
  },
  "zahFG6AuoIFyNK2q_8hNbA": {
    "date": "4/17/2018",
    "text": "Loved this place! Staff was very nice. They showed me the right way to eat vermicelli noodles and it might be my new favorite Vietnamese food. Don't be shy with the sauce in the little black dish! Pour it all over the noodles. The sauce and the meat is where the flavors at. I got beef, shrimp, and chx. Definitely coming back for seconds.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cf2v9VwGYqnb7-etAb3zWw"
  },
  "d52KDEHUUBKMrqh1zQOANg": {
    "date": "5/24/2018",
    "text": "My favorite place by far in Charlotte! I try to come here at least once a week to have their delicious seafood pho. The staff is nice, the venue is clean, and the food is always amazing! Everyone should definitely check them out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FBooXooYncNgwy5C8S6EsA"
  },
  "72SeTLNWpf7i4v4j0la7nw": {
    "date": "5/20/2018",
    "text": "Been multiple times and have never had a bad dish or a bad experience. The pho is some of the best I've ever had and they have a great coconut and red bean drink. You can tell they put a lot of heart into their food.  I would highly recommend their house chilli sauce, makes siracha look weak and has a great lemon grass flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VdZZUplFjZ0qTI9CVq1_2A"
  },
  "nZuOTqRzOE8H9fCGzyZkZQ": {
    "date": "4/11/2018",
    "text": "As a vegetarian I really like Vietnamese food. My favorite dish is the rice vermicelli with tofu. The rice vermicelli is a light fresh dish, but Mr. Pho makes the vegetarian one more that a gross stir fry. Most Vietnamese restaurants put fried tofu but not the weird sauteed mushrooms. They really do a poor job on their vegetarian dishes.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UTF2z73Zx12J9U1S2Fb3AQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UTF2z73Zx12J9U1S2Fb3AQ/o.jpg"
      }
    ],
    "user_id": "2sZdkxxbxPUxDNQqE6LYKA"
  },
  "9thtrBmBgmlbgrrHlxi01A": {
    "date": "11/5/2017",
    "text": "This place just opened so I was expecting top service from here. The atmosphere was cool. Met some new people because of the closeness of the tables. I ordered the seafood noodle soup and...It was very salty, had little flavor in the broth and lots of salt. The young lady next to me said she likes hers like that; however I enjoy more flavor than salt. I do not eat meat and occasionally indulge in seafood. Sad to say I did not enjoy it or the newness of them forgetting to bring things to my table. Will probably try once more for a vermicelli dish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A54nBxtPwOuZBkYdVIW3OQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Relax atmosphere",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A54nBxtPwOuZBkYdVIW3OQ/o.jpg"
      }
    ],
    "user_id": "SVTbyckAlbQGDjICm5alhQ"
  },
  "d7DUIxL3kp17pWNQKmES7w": {
    "date": "3/2/2018",
    "text": "This pho wasn't the best but it wasn't bad. Portions were huge as it usually goes with pho. The beef in mine was pretty nasty, very fatty and just gross, I had to take it all out. I had an appetizer of wing which were pretty good, the sweet chili sauce served as dip was really tasty. The decor is also pretty nice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8OgNiQjpakO5DN6d2FR2Ng"
  },
  "gGnoiYsOPEMrrlkVOY4PYg": {
    "date": "3/27/2018",
    "text": "Not impressed. Pho noodle soup was bland. I ordered a combination plate with a shrimp cake that was soaking in oil--unlike what was pictured on the menu. I told the wait staff and they wouldn't correct it. There were 2 other parties dining at the restaurant when we were there, not a good sign. I would not return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S6pdDSiOjWcHDLFnAHHxMQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S6pdDSiOjWcHDLFnAHHxMQ/o.jpg"
      },
      {
        "img_id": "_ayG_XEzkuQwOJMAi8L1eQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_ayG_XEzkuQwOJMAi8L1eQ/o.jpg"
      }
    ],
    "user_id": "NxlXKvrA82OS65AbEFQb-w"
  },
  "qhvm2wxJermwb6gFKvxOTw": {
    "date": "10/29/2017",
    "text": "As if the Pho wasn't amazing on it's own but they have exceptional customer service! If you enjoy pho be prepared to be blown away with this restaurant. I will be returning shortly for my \"pho fix\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SHuCgxfJAx36_U4-MAbXgQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SHuCgxfJAx36_U4-MAbXgQ/o.jpg"
      }
    ],
    "user_id": "uEO-FvFSPXr4TSusDwxl8g"
  },
  "-_I6tbEn3EXSrAcqYGz1nw": {
    "date": "10/28/2017",
    "text": "Great option for pho in Charlotte. Nice upscale atmosphere with quick and friendly table service. Since it was opening day, it was definitely crowded so the wait was a little longer than usual for Pho. But when it arrived, the broth was clean and flavorful. I also had the fresh spring rolls and a Vietnamese iced coffee which was strong and tasty. Sits in a nice location just off 485. Definitely look forward to returning here for authentic Vietnamese food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DgHVgDJ0W35p_DA2uVwOhA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Peanut Sauce was very unique! We definitely liked it!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DgHVgDJ0W35p_DA2uVwOhA/o.jpg"
      },
      {
        "img_id": "ZybVWkGO0tToInLm4yJEBQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Beef Pho",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZybVWkGO0tToInLm4yJEBQ/o.jpg"
      }
    ],
    "user_id": "tLUiIANb6B3KUsdoCeNhdg"
  },
  "qKbJDaDuKf7KvJpUkUgDQA": {
    "date": "9/19/2018",
    "text": "Tried the pho to go today after a friend's recommendation.  It was very good at a good price! Cashier was also very friendly. I will be back to try more dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9fiYdaN_PerXL4a-YXf59g"
  },
  "LD5NT8C24j8jQm2X63bZBg": {
    "date": "10/22/2018",
    "text": "Watch out with you money to don't get over charge,yesterday we have table with 5 and 1 kid and we paid all 3 separate but when I paid my food I was the last one and the lady charge me $15 tip witch we ready have it in Cash to give it to the server that don't even come to our table ones to ask if we need anything and plus the old lady very rude,I will never come back here pho real service or other Vietnamese restaurant definitely have better service then here and they never try to take you money wit out asking.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ff51jDC0CK5JKP9pQMiUYg"
  },
  "cNrEIIz6aextjfqBwPgXpQ": {
    "date": "10/14/2018",
    "text": "Pho Cali was closed on Sunday so my man suggested that we come here & what a great suggestion. The servers were very polite. The restaurant is really clean & the food was outstanding. I would definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dHvwQWnPpDScivHzBXNgag"
  },
  "E5XXcYst8p2W3xgvDlKVkA": {
    "date": "1/12/2018",
    "text": "So awesome to have an authentic Vietnamese restaurant in South CLT! The food was awesome - the spring rolls, Pho Ga and Spicy Beef Soup were so flavorful. The service was wonderful and the owner, Emily, helped educate us about the right food to order! We will be back again and again for this Vietnamese comfort food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kA5x_o_QA7zSOj8iCEUilw"
  },
  "MyJIKDMjEqU6o-ePsFW5VQ": {
    "date": "1/1/2018",
    "text": "Omg I loved it. One of my favorite Pho Spots ever! I get Pho in every city I go to and ib really enjoyed this place! I highly recommend. Clean and nice atmosphere, friendly service and great food. We'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rJiQ0IfG3_mzFjB_TGC5_w"
  },
  "hREb0XultNFmpQJJHpKHnQ": {
    "date": "2/20/2019",
    "text": "Food was good but the prices are a little high for the portion you get . Spent 20 on shrimp rice and shrimp roll on myself .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_JWE3_jdZz6xRmWEXphtg"
  },
  "4fZC8fyc8xyDRX-PX1XV9Q": {
    "date": "11/3/2017",
    "text": "I'm from California and came to Charlotte for a family reunion on the the weekend. My family was craving for some Vietnamese treats and luckily we stumbled  Mr Pho at their grand opening. I'm Vietnamese and come from California so... Vietnamese food expert here :)  We came to the restaurant after their lunch hour but still, the place was packed! Overall, we had a good experience. Yayy! First,  I'm surprised that their food is quite authentic and taste very similar to my go-to Viet food in where in live in San Jose.   I order a regular Pho with slice rare steak and beef balls. The steak was cooked well enough but still hold the soft/tender texture. The broth was so rich and flavorful that it was a blast of flavors in my mouth when I sip it. It is a must! It came with fresh beansprout, basil, jalapeno, and lime. Really good! My mom order the vermicelli with grilled shrimp and pork. She liked it very well! We also ordered fresh spring rolls with fresh shrimp/pork and veggies inside. It was very fresh and I could tell it was freshly made, not premade and microwaved! The service was decent. Waiters are attentive and food come out very fast. I would come here again if I will be in town and would definitely recommend Mr Pho! If you aren of not sure of what to order and confused about the menu, ask away. They did a good job advertising their food selection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tbRIS_aRgDkrnUIqATp6rg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tbRIS_aRgDkrnUIqATp6rg/o.jpg"
      },
      {
        "img_id": "dfnGycXpYAaOvZQSk5RWig",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dfnGycXpYAaOvZQSk5RWig/o.jpg"
      },
      {
        "img_id": "i7ACRySEfgA0aNp4L4kL7Q",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i7ACRySEfgA0aNp4L4kL7Q/o.jpg"
      }
    ],
    "user_id": "XInj5ZP1kzc_gsvjB9bB7g"
  },
  "3xEdax3L1Qcmj7EJ9tRhZA": {
    "date": "5/29/2018",
    "text": "The best Pho!!! Beautiful decor, clean, and fast service.  The owners are very involved and want to make sure you were happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g7pu5m6pYgqmvCu_XTdilw"
  },
  "3GX_68jv1DK8uiT-VoOZ7w": {
    "date": "5/11/2019",
    "text": "This is the place I go to when I want to feel happy after I eat. The pho is amazing, it's like a warm hug. The ingredients are fresh and the food is always perfect. Appetizers are delicious and I always enjoy the sauces and dips made in-house. (My kiddos really love the wontons).  The staff is always friendly, courteous and quick.  This place is a hidden gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3DG_t41SeVjD2kM1Krr9A"
  },
  "cxpuT4eIYZ94AuUXE7JiNg": {
    "date": "1/2/2019",
    "text": "My new pho place that I go too that's close to home! Great service, great good, and great atmosphere!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "auVg-kPtQUGmkw6HOhWVGA"
  },
  "9lMbhqRWv8MpEmTzXKsJkw": {
    "date": "10/18/2018",
    "text": "SERIOUSLY AMAZING!!!!!! My fiance and I have been looking for a delicious pho place in clt for years now and haven't found one. I'm born and raised here and couldn't find a place with amazing veggie pho. Their veggie pho here is absolutely amazing, the flavor is so rich and you can taste the freshness. I asked the manager how she makes it, she said she uses all fresh ingredients and no powder like most places do, you can just tell!! She is so so kind, the staff is amazing, we've been here twice in two weeks. Their chicken pho and grilled shrimp is phenomenal too. The manager told me to try their veggie chicken stir fry, looking forward to trying it next time. Love this place and absolutely recommend it! For the longest time I was making veggie pho at home, never again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7yUsYxnfE9Y-nTHJ1P9bFA"
  },
  "KlW7Bv8s0x3d9wvgStudYw": {
    "date": "11/8/2018",
    "text": "This is my favorite place to get Pho!!! It is absolutely amazing & the service is wonderful. The speed is quick and efficient and I have never been disappointed. The fresh spring rolls are delightful! You have to try this place if you are near the area & are looking for a soothing bowl of pho. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qmTbvICfyLQW1yT-AsPZTA"
  },
  "RQ-EUYmFsxWTifCj1zaUjw": {
    "date": "8/25/2018",
    "text": "This place is really delicious! The shrimp cakes were fabulous and the home made chili oil was top notch! I would definitely eat here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0F1beE7s15gWySCsda6drA"
  },
  "zXNoyj0Emp63XJckd1HBDA": {
    "date": "9/5/2018",
    "text": "Had a taste for pho and saw that this place was new and thought I'd try it out. The atmosphere was very welcoming. Looked very upscale but the price was just right. The Pho was amazing! Full of flavor and the rice noodles where cooked just right! I Definitely will return in the future!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "djfHeSApIYQjUv-zEmOUvw"
  },
  "53yC5-1lZNSAOh-VTCB3gQ": {
    "date": "11/2/2017",
    "text": "I ordered lemon wings.  Tripe with rice noodle soup.  Chicken with egg noodle soup.  I paid for my to go order when I placed the order.    A young lady brought me my to go order and hesitated.  She asked me if I had paid before she handed me my order.  It was clear she was concerned about her payment.  I responded yes and toot my order to my car.  I briefly checked my order before leaving.  I did not have my wings.  I returned and the lady did dot apologize, she told me I left without allowing her to give me the wings.  What?  I explained the lady who confirmed I paid should have confirmed I had all my food before she gave it to me two bags.  I got home to find the chicken did not have lemon flavor.  My tripe soup did not have tripe!  I called the restaurant to express my disappointment.  The lady explained my my tripe may have shifted into my noodles and the chicken had lemon powder and that is why  I could not taste the lemon.  Really!  Later, I did find the teaspoon of tripe that was hidden by the noodles as she said.  The food had no flavor.  I told her I was very disappointed and I would not return.  I hate not giving a good review, but this was was not a good first impression.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "zYkqUJQn6vQJTvdqH2L4hg"
  },
  "fztYIyjG5nHSPlQl4BzT5w": {
    "date": "9/27/2018",
    "text": "This place is amazing. I was skeptical to try this place at first because I'm vegan. When I arrived I immediately let the waitress know that I'm vegan and asked if they could accommodate me. She said of course and gave me a separate vegan menu. I was pleasantly surprised that the food was delicious. I've been to other places with \"vegan\" options and they are subpar. But Mr. Pho is the best hands down. The restaurant is clean, the staff is friendly and helpful, and the prices are reasonable. I will definitely be a regular.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GkFG2e5wsr0xOZ6m2dgUeQ"
  },
  "VNYbV4WHEoylZraX4Q0MOA": {
    "date": "11/1/2017",
    "text": "Saw the sign about Grand Opening while going to store nearby. Decided to stop by and get some takeout. It was about 7pm tonight. Saw a sign for free egg roll and drink because of the Grand Opening. Oct 28-Nov 3. We are very familiar with Vietnamese food and order grilled pork with rice, egg rolls and chicken wings. Did not get our free drink for take out, but no big deal. Beautiful atmosphere and ambience. We just felt that instantly, the staff was unprofessional in dealing with customers as they did not seem to know how to welcome customers. But hey, we were for the food so we tried to look over that initial awkwardness. When I placed the order, the Vietnamese lady only spoke Vietnamese to me. I had no idea what she was saying ... Looked like it was owned by a lot of older people which is fine ... But maybe not many even spoke English? After the first lady took my order on a sticky yellow note after I pointed out what I wanted of which was written only in Vietnamese? She went and spoke to an older woman who told me I would get a free egg roll with my pork and rice order. I said sure! Order came out rather quick which was great.   I just also disliked that the women who worked there constantly spoke Vietnamese loudly. What if other Vietnamese customers are there and hear them talking crap about customers? To me, I felt I was in a nail salon where the Vietnamese talk about their customers. Just being honest.  Anyhow, the food? Egg rolls were not good nor were they fresh. Looked ugly and tasted like they were refried egg rolls. The egg rolls had no flavor except saltiness. Meh, unimpressed. We ate it in the car so didn't get to take a picture of the order itself. However, you will see it in the order with the pork and rice. As for the wings, unauthentic. Tastes like wings from any restaurant ... Just salty with a fried chicken powdered coating. Had egg roll sauce from a bottle as dip? Unimpressed. It was not authentic Vietnamese wings ... I go to a Vietnamese restaurant to get authentic Vietnamese food, not American style wings. Then down to the grilled pork ... The pork itself tasted ok, however, they were extremely skimpy on lettuce/ vegetables. And look at the picture ... The dipping sauce has no garlic, no cucumber, no carrots, literally just tasted like watered down fish sauce with some sugar.   The food quality and presentation did NOT match the beautiful new restaurant. The restaurant looked upscale, but the food was anything BUT that.  I haven't tried other foods, but this will be my first and last time. Service not good. Food was disappointing. Go here if you are close by and have no other choice, but there are definitely better options elsewhere with better quality and portions for the price.  The only reason why they get two (2) stars if for the beautiful restaurant. Food, nothing special.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8y5h4QWEtUgyZtt3Gzipww",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Nice ambience.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8y5h4QWEtUgyZtt3Gzipww/o.jpg"
      },
      {
        "img_id": "jgWDc-xt0z_s0Aw_WmxIqg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Girl packing our order",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jgWDc-xt0z_s0Aw_WmxIqg/o.jpg"
      },
      {
        "img_id": "rI8K8wREqjMbhiDb35dWWQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. The egg roll was the free Grand Opening egg roll. Not tasty. Refried egg roll. Where are veggies? More lettuce please! Skimpy. Nasty sauce.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rI8K8wREqjMbhiDb35dWWQ/o.jpg"
      }
    ],
    "user_id": "ayiUK5_sE0gds5s4JidWrQ"
  },
  "0wMYRfcAMpFBm53bmMdbew": {
    "date": "7/10/2018",
    "text": "Top pho contender in charlotte area. I was impressed and did not expect mr. Pho to be this good.  Fresh made chili oil and cilantro served on the side was a good sign to start. There are only 3 worthy pho spots in Charlotte, and this is definately one of them.  One rare attribute to good pho spots is one a modern restaurant setting/ nice design and feel.  This a great place to bring guests while having really good pho.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fSQQnznP-4kUKA_oFsmulA"
  },
  "zhIAArNAjp1dggvnK4xb2Q": {
    "date": "9/2/2018",
    "text": "This is probably a review after a ton of visits I had with Mr. Pho. I finally feel like the great experience about this unique and authentic Vietnamese restaurant, need to be spread out to everyone else. The lack of pictures about the dishes is because we (my homegirl and I) couldn't wait any longer as soon as the foods came out, and somehow it's the same every time we are here.  Having a nice presentation themselves, the foods are very authentic in the flavors and rich in quantity. Timing was also an important factor but this restaurant has it all. Our go tos are seafood udon noodle soup and grilled chicken with white rice. On the chicken specifically, I LoVE it!! Bonus: they have sweet frog next door! Yall!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ku3vEQoy858ezVjOkda11Q"
  },
  "K2NH5bBZ0xt6lRBmDWxApA": {
    "date": "10/31/2017",
    "text": "Pho is probably my favorite food.  Not the best pho I've had but it's worth a try.  The menu is really big and plenty of soups.  From bun bo hue to bun rieu to different regions of pho (north/south).  It's a bit fancy and pricey for pho but I understand the pricing.  I got the pho dac biet (special combination pho).  It was flavorful but I like Pho a little bit more home made.  More fat and a little bit more greasy.  These guys really know how to make restaurant quality pho, which is expected since you're going to a restaurant lol.  My wife and I will definitely be back to try their bun bo hue and other dishes. If you live in south Charlotte go give this place a try",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "83mFs_8BVhwhR20G-up6Bg"
  },
  "2ki7nKlgAj8GpU-ij7L3EQ": {
    "date": "4/5/2018",
    "text": "I've been going to mr pho since they opened. The are great and have amazing service. Tammy is always very welcoming and knows the menu forwards and backwards and can answer any questions. They always time their appetizers with the main dish perfectly. My favorite dish there(to date) is vermicelli with chicken, shrimp and egg rolls. Also try their tiger beer!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HjUA08YIjawspE9_N5T8bw"
  },
  "PPuYVmsJ1_A3ZBbRYvKdRw": {
    "date": "11/24/2017",
    "text": "The food is delicious...the service is quick, what more can you ask for. I usually come here once a week, I'm determined to try every shrimp and vegetable dish available.  I'm glad Mr. Pho is here, this area was in need a  new restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VBHutnR8DrRJFGbocqtFTQ"
  },
  "2faDRHsN19mUe8qdJacaKg": {
    "date": "4/5/2018",
    "text": "This is a great place. My favorite dish is the vermicelli. Everybody is nice and welcoming. Really great customer service. The restaurant is very nice looking inside. Sometimes I have a hard time in Asian restaurants because I don't really know what food I'm getting but this menu has a lots of pictures with really helpful translations. The staff also knows the menu very well and can answer any questions you may have.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4K-ywvRLTUi_ySDpYPAtQw"
  },
  "v78QnQElcnpi4MsD0OgbPA": {
    "date": "10/28/2017",
    "text": "I'm so glad Mr. Pho is finally open! I went in and the service was excellent. I ordered the Pho Ga (chicken pho), the chicken was super tender and the broth was so tasty. I'll definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nUnkEio7z4QolgKrriiPLg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nUnkEio7z4QolgKrriiPLg/o.jpg"
      }
    ],
    "user_id": "hNFBDrlXome8kDuhLL4V2A"
  },
  "xKDSLU-tsvjkVK5s3SS_2w": {
    "date": "7/22/2018",
    "text": "Always great food and great service! This is the only pho place we go in town after trying 4-5 other places.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ofy1M95zGvoY2RwM2vgoIw"
  },
  "P7yCd3AMMuuzeqgDPf00vw": {
    "date": "6/17/2018",
    "text": "I popped in for dinner on a Friday night. The place was busy but the service was quick and attentive.   I started with the Vietnamese egg rolls. They were delicious. They arrived crispy and hot and I love the dipping sauce that comes with them.   I kept it simple with dinner and ordered the Grilled Pork Vermicelli. Oh my goodness. It was perfect. And it's a good size portion, definitely enough for two meals.   I'm looking forward to coming back and trying more items from the menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "cakC_PyPfkWZQiapegsG4w": {
    "date": "5/25/2018",
    "text": "Great food and service.  I got the wonton soup.  The description said it would come with rice or egg noodles.  I didn't specify that I wanted egg noodles, and the server didn't ask, so I got rice noodles.  I ate everything in my bowl, minus the rice noodles.  I didn't leave hungry.  I'm glad a restaurant is filling in this spot that seems to be cursed with keeping tenants.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f-xci4TXGxxE62BPmSpVFg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/f-xci4TXGxxE62BPmSpVFg/o.jpg"
      },
      {
        "img_id": "0dTOlYP0h-CSB4gX7dHVog",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0dTOlYP0h-CSB4gX7dHVog/o.jpg"
      }
    ],
    "user_id": "S_khmVj6bZDWDNjztq3fjQ"
  },
  "3ZT6rUFdhE0UOUNnETFU1A": {
    "date": "11/1/2017",
    "text": "We've got a new phenomenal Pho restaurant in Steele Creek and I am super excited!! The location is great and the inside is beautiful.   For some reason I really wanted to go to the opening and the food lived up to my expectations!!! This may be the best tasting Vietnamese food in the Steele Creek area.   We did come super late and had to wait. There were a few hiccups because it was the opening but the owners son came out and spoke with us. He thanked us for visiting and that service and speed would improve. He also stated that he was from San Fran area of Cali and that his mom was trying to bring more of the west coast to the east coast!!! I'm sooo excited. The chef also came out because we had a mix up with the rice dish my sister ordered.   Everything we ordered was tasty. I ordered the Mi Hoanh Thanh and the broth was good. The wontons seemed a little cold but overall I was satisfied. My sister loved her Fried rice with Pork and Shrimp dish. The Pho broth is amazing. It's the prefect blend of spices. Not to heavy on any of the particular spices.   Mr. Pho is my new go to for Viet food in the Steele Creek area!!!   Mr. Pho 8156 S Tryon St, Ste G Charlotte, NC 28273 Saturday October 23, 2017 8:30pm",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "i9tqJ70a_VCGghzK8N_Bzg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Menu 10/17",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i9tqJ70a_VCGghzK8N_Bzg/o.jpg"
      },
      {
        "img_id": "047IEZN3U30TeBL_51G-3Q",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Menu 10/17",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/047IEZN3U30TeBL_51G-3Q/o.jpg"
      },
      {
        "img_id": "t7Pgkc5nz3SA0Vbw6IQKKg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Menu 10/17",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t7Pgkc5nz3SA0Vbw6IQKKg/o.jpg"
      }
    ],
    "user_id": "12iozmUYN_gvAng9kMLs_w"
  },
  "z3AeGEE_2foahYsoyq7oQw": {
    "date": "11/7/2017",
    "text": "While I'm sad Noodles and Company closed, this restaurant is a much better addition to our restaurant scene.   We came here for lunch and I was more than impressed. The service was pretty fast, the food was delicious, and prices were reasonable.   We got two Rice Vermicelli Bowls - one beef and one egg roll. This is one of my favorite Vietnamese dishes that I've ever had. It was all fresh, the flavors worked great together, and it didn't need an overpowering sauce to taste delicious. They were light and fresh -- I will probably get one every time I come back. They bring you egg rolls as a complementary appetizer which are phenomenal. We also got an avocado smoothie which was delicious.   This is a much needed addition to the restaurant scene in the area! Come support a great Vietnamese restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rN2YGm4OxUt1v7lAkhkptw",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Avocado smoothie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rN2YGm4OxUt1v7lAkhkptw/o.jpg"
      },
      {
        "img_id": "GIPgPUUYuDCZ0D1uidiXUQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Beef Rice Vermicelli Bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GIPgPUUYuDCZ0D1uidiXUQ/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "Vrxjzd43ZPDweir51fDvzA": {
    "date": "11/6/2017",
    "text": "My husband and I are in this area a lot and noticed a new restaurant was opening and could not wait to try it out. When we arrived, we were sat right away. The staff was very nice and attentive. The food came right away. The menu featured a good amount of food and we were pleased with the options given.  We started our meal off with some fresh spring rolls. They were tasty and some of the best we've had. Next we had some egg rolls that were apart of the opening weekend promotion. They were really good as well. Once we decided what we wanted, I ordered the steamed rice with a shrimp cake and grilled steak. The shrimp cake was good but not something I think I'd order again. The grilled steak was awesome. It almost had a Mongolian beef taste to it. The steamed rice was cooked to perfection. I had pineapple coconut smoothie with tapioca pearls that was really tasty and they served water with a hint of lemon that tasted fresh. My husband had the steamed rice with grilled shrimp and grilled steak. He said the grill shrimp were cooked perfect and had a great flavor. We both agreed on the grilled steak being our favorite of the meal.   The decoration is nice and modern, they have plenty of tables that would fit up to 6 people and the place was very tidy.   We cannot wait to come back and try more food, especially the Pho. The couple that sat behind us ordered it and spoke very highly of it. We have been looking for more Pho places in Charlotte that are actually good.   ..... So my husband and I decided to go back to Mr Pho after two days of our amazing experience to try their Pho.  My husband ended up changing his mind and he ordered steamed rice and steak and I went with Eye Round steak Pho. The food was amazing as the previous time, but we did not get the lemon water and the service was not got at all.  Took over 10 minutes to someone come to take our order and they went first to a table the got there way after ours. My husband food came after 7 minutes and mine took 11, which was fine Due to the lack of service this time I had to take off one start but we will of course be back and see what kind of service we will have next time, because I am convinced the food will be amazing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UCvlpd4SGw2ggK2p0EJsXQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UCvlpd4SGw2ggK2p0EJsXQ/o.jpg"
      },
      {
        "img_id": "lx-5kWVqLk7_SGy62lwGLA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lx-5kWVqLk7_SGy62lwGLA/o.jpg"
      },
      {
        "img_id": "r_7NZlHE3tN1z18-TR28YQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/r_7NZlHE3tN1z18-TR28YQ/o.jpg"
      }
    ],
    "user_id": "0mRh6teyYn5n1AmN3fYvZw"
  },
  "4iQOWFbHunyiiPjzr7X79Q": {
    "date": "10/28/2018",
    "text": "We came to Mr. Pho on a Saturday and was pleasantly impressed! Zero wait, with a friendly and attentive staff. Items that I tried:  - Cha Gio (egg rolls):  Warm and crispy, just how I like it, with a yummy dipping sauce. We ended up getting 2x orders. - Spring rolls:  Fresh, good - Pho Hanoi:  My first time having pho this style, the beef was delicious with just the right tenderness. The broth was perfect (not too overpowering or oily like I've had at other restaurants)    - Banh beo:  My first time having this dish as well. I really enjoyed it! Delightful combination of chewiness, crunch, oil, and sauce, at the perfect size. -  Smoothies:  I tried the Avocado and Red Bean smoothies, both were very tasty. Not too sweet as they used natural ingredients.  Highly recommend. I'll definitely be back :D",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VVMBCxSju-2KM_Q0JQW4bg"
  },
  "URqWbs6grAk1tz3EIZa8XQ": {
    "date": "4/20/2019",
    "text": "Awesome authentic food and really good service. Pho is excellent and the homemade chili oil takes it up a notch. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0FL8mfX6QnbKK37yrOCwEA"
  },
  "bTKKtcSIL8f3Tq98o1JC_w": {
    "date": "10/10/2018",
    "text": "Fast friendly service at lunch time. I only had one PHO recommended by my server which was pretty good. Big menu with lots of other items, I'm sure anyone could find something to satisfy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "b3LSV6P9IbKoELcHj1uUIg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. P02 large",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b3LSV6P9IbKoELcHj1uUIg/o.jpg"
      },
      {
        "img_id": "G6C6rC_oATy1PKk1BZppYQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/G6C6rC_oATy1PKk1BZppYQ/o.jpg"
      }
    ],
    "user_id": "1rVdN-wzIeYWZG1yR0dkhQ"
  },
  "hND9gdtCjE4Q2bjE_rxrwA": {
    "date": "4/17/2019",
    "text": "Recently moved here from California and was a bit worried about finding my Pho fixings. Mr Pho staff and quality of food is great and Consistent !! That's all Pho should be, good and consistent. Stay away from the other Pho spots in nearby area - El garbage. Trust me",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lx_TL7fvvCHHqoVrz1TAOQ"
  },
  "TYnerQlI0GHw4ZCxrPmBUw": {
    "date": "9/8/2018",
    "text": "Absolutely love this place.  The soup is amazing and the restaurant is clean.  As long as they're in business, I'm a weekly regular customer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0vur82IJO_RfjUDiQJAsfw"
  },
  "8D8v9rgv4whYh2xlWcFQgw": {
    "date": "4/3/2018",
    "text": "I came to Mr. Pho because Doan's closed on Tuesdays and I'm so glad I did! Being Vietnamese I'm super picky of where I get my pho and bun bo hue. I got bun bo hue and it did not disappoint. When it came out it didn't have much color in it like most restaurants but the flavor was so authentic! It had everything a bun bo hue should have (see pic for details). Could have used a lil more variety on the veggies that went with it though. But overall, it was very delicious! I got a che/dessert togo that the owner recommended that has not been on the menu yet. Very delicious! Prices were very reasonable as well. Hope everything will stay consistent. I will be back to try other stuff on the menu.   Food- 5/5 Service- 5/5 (came on a Tuesday afternoon)  Price- 5/5",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nZrQ6-50lZ5orTGybzNe1g",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Bun bo hue. 5/5",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nZrQ6-50lZ5orTGybzNe1g/o.jpg"
      },
      {
        "img_id": "w-cedJyuNJb7BYgljKvbFA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Sung sa hot luu. 5/5",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/w-cedJyuNJb7BYgljKvbFA/o.jpg"
      }
    ],
    "user_id": "L4rS8kw_1bOhEMnbNCNTDg"
  },
  "wJ6smfiB29HmPvpJ6rPMkg": {
    "date": "8/11/2018",
    "text": "Delicious, flavorful, savory pho. Not sweetened like at some new places I've visited lately. I had the Pho Tai. Each of us got our own plate of super fresh vegetables for garnishing - bean sprouts, cilantro, Thai basil, lime wedge, and jalapeno slices. Water was brought to the table when we sat down. The staff is very friendly. Everyone seemed happy that we were there. Booths and tables are available in a large, comfortable dining room. Large menu with options to build your own entree of popular Vietnamese dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PuMpr2BOalgD6jMfxFAY3g",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Very fresh toppings for pho.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PuMpr2BOalgD6jMfxFAY3g/o.jpg"
      },
      {
        "img_id": "_n8b_vxbLF2OXLs0wTJ2EQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_n8b_vxbLF2OXLs0wTJ2EQ/o.jpg"
      }
    ],
    "user_id": "yp0ARvJpE020PAJ2kMNshg"
  },
  "bSLeJ-eSYhbfieyr49AKug": {
    "date": "4/14/2019",
    "text": "Rainy day after an all-night drive = perfect Pho opportunity. Found this place based on Yelp and I had high expectations.  Place is cookie cutter and has a large menu, but I went straight for the Pho Tai.  Large was 10.95 (Large is the size Pho should be!). First concern was when I asked for chili paste and the jar provided was putrid - hadn't been stirred in weeks.  The fixings for the Pho arrived and the bean sprouts were browning.  I could pick up a musty, basement smell so I said \"hell no\" and went for the basil, jalapeno, lime instead.  Pho broth was average with a shortchanged serving of noodles.  The tai was the cheapest middle school cafeteria meat they could find.  As I write this I am considering changing to a 1 Star but I am almost 24 hours out and didn't get sick, so there you go.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bolrcCp6f_KhEJTdJABv0A"
  },
  "l_MSkK1VlAQ-7hR3c3MxtA": {
    "date": "12/10/2018",
    "text": "My favorite place to get pho in the steele creek area, especially as the weather is getting cooler! The beef broth always tastes fresh and well-seasoned. They also have good options for vegetarians. I've gone with a couple vegetarian friends and they loved the faux meat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mIheH6mWYtfIGd0GB2mVZw",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mIheH6mWYtfIGd0GB2mVZw/o.jpg"
      }
    ],
    "user_id": "Hv_DVMSDM7DBlt99CN0zaQ"
  },
  "yWB0dhCnqW4b7GyN0vKLPQ": {
    "date": "1/22/2018",
    "text": "Place is clean and has a contemporary look. I had the wonton soup. The wontons were very tasty. The dough was different but not bad. The broth had flavor but lack a bit of salt. They had all the fixings to add to the soup so it was good. The Thai tea wasn't that good. It was a bit watery. Overall it was a good meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3MaBR2M6mGiCLw4jGPCEbA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3MaBR2M6mGiCLw4jGPCEbA/o.jpg"
      }
    ],
    "user_id": "KZV8cpBu4Ax1bZMucV3_Ww"
  },
  "ZQaf7F4EioXzevPPD7iK3w": {
    "date": "8/24/2018",
    "text": "I recently ate at Mr. Pho's and I was really impressed. The food was very authentic and had great flavor. It was a bit pricey, but I would go back. The atmosphere and decor was amazing. I was not expecting that out of a strip mall. From the outside you would never be able to tell. The service was great too. I think I will definitely be back. I had more spring rolls on my plate ( it actually comes with 4 ) I forgot to take the photos before I started eating. Both dishes come with rice, however I chose to omit the rice in mine. I recommend the beef stir fry over the chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ULvr3Fca6tKCJjlGc5QwrQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ULvr3Fca6tKCJjlGc5QwrQ/o.jpg"
      },
      {
        "img_id": "d_FKB6SIMQO4zeflzhhrGg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d_FKB6SIMQO4zeflzhhrGg/o.jpg"
      },
      {
        "img_id": "vCTllfZdgWd-ywbfBS01JQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vCTllfZdgWd-ywbfBS01JQ/o.jpg"
      }
    ],
    "user_id": "cDQOBMLRThq8VqeziGT65g"
  },
  "Ds7-f9nrNQjFk0z_7KpC3Q": {
    "date": "11/5/2017",
    "text": "Pretty under whelming Very thing was very bland and under seasoned  The fried eggrolls were too greasy The Pho was very ordinary and disappointing, not 10 dollars The Hanoi was the tastiness item The Bun Thit dishes were pretty sad as well,    The meat dry and under seasoned  The wonton soup was bad, dont order  Was really hoping for this place",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nvvqXIwpL_z3JUYjMdGdMQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nvvqXIwpL_z3JUYjMdGdMQ/o.jpg"
      },
      {
        "img_id": "W8pag2hUP_nzIUEGWINorA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/W8pag2hUP_nzIUEGWINorA/o.jpg"
      },
      {
        "img_id": "0AIrQlAqz72n_cy6RuT6cA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0AIrQlAqz72n_cy6RuT6cA/o.jpg"
      }
    ],
    "user_id": "2_OP4c5pIQcM6u4JhBNlDg"
  },
  "EdCUDVJKNYZrdpMo0qs2_Q": {
    "date": "7/27/2018",
    "text": "Service is a bit slow.  Double-top table stools are uncomfortable, no foot rest.  Update July 2018:  Service speed is much better now.   Good use of space in the restaurant.  Folks on the wall may feel a little close to those on other side though   Was served the complementary appetizer with no silverware or napkins. Update: no more complimentary appetizer  The spring rolls, I swear, have meat in them-that may be a first.  They were cooked well but pretty standard frozen/fried product you can get at a grocery store.    The small pho was just the right size for me.    However I was not impressed at all.  The flavor was pretty much beef noodle.  The meat portion was also unimpressive. I've had much better pho at 3 or 4 places around this side of Charlotte. The small plate with basil, sprouts, jalapeno and lime was pretty sparse.    Update: shrimp has been over cooked every visit, to the point of being tough.   Chow mein noodles are supposed to be fried, were soft and over-cooked as well.  Server said they use chow mein and Lo mein interchangeably.  Wut??  Not a terrible place to get pho, but much better options are available. Update: pho has impoved to tasty, but not 'best in Charlotte's by any means.   (And if this place is the best pho you've had in CLT, you really need to get out more!)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vTDIfVV-JFfyc6XZMkpk-g"
  },
  "hWpderLylYdOItFL7_T_wQ": {
    "date": "10/28/2017",
    "text": "Went for the Grand Opening, Had high hopes, very nice atmosphere and great service from when I walked in.  I asked for a to go menu and since they didn't have yet she gave me 2 menus to take to car.  This place was off to a great start! This is where they earned the 1 star.    That's where it ended......my \"to go\" dinner was a huge waste of money.  In fact, after getting the food home and trying it (which I REALLY wanted to like) I had to put a frozen pizza in the oven.    Perhaps it was my mistake for not getting the Pho, but here's my review of the non-Pho dishes we tried/  1) Lemon pepper wings: RAW! And no lemon pepper flavor.  2)Pad Thai (medium spice), no spice, no flavor, and gross chicken chunks.  You know, the weird bites that you can't chew and end up politely spitting out into your napkin.   3) Chicken/beef rice plate: more gross chunks of chicken that I couldn't even find a decent bite, and I've now learned that beef can also have creepy gross pieces that you can't chew.   I thought Yoshinoya (west coast) used the absolute lowest quality cut of beef/chicken but Mr Pho you've impressed me (in the wrong way) by finding an even lower quality of meat!  I hope the Pho is better, but doubt I'll be back to try it considering there's an excellent Pho restaurant in Ayrsley, right down the street.  (And I'm skeptical that the Pho uses any higher quality cut of meat...)",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eshlGiy0rw-lfrheI0TnEA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eshlGiy0rw-lfrheI0TnEA/o.jpg"
      },
      {
        "img_id": "Z_L3oOiXlOqfKy5GO6jyvQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z_L3oOiXlOqfKy5GO6jyvQ/o.jpg"
      },
      {
        "img_id": "JJLtKFi4O_4crED27NkPEQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JJLtKFi4O_4crED27NkPEQ/o.jpg"
      }
    ],
    "user_id": "bE7H1qUmqXbC_FQtvn5b1g"
  },
  "nrXDeVNvVujbmAuIg1Parw": {
    "date": "6/5/2018",
    "text": "Tried it for lunch after reading good reviews, but I cannot for the life of me figure out why. First, they got rid of the vegetarian menu which is whatever, so I ordered shrimp fried rice, which was the least offensive thing I could think of. It was over $10 and I assumed that meant it would be a big portion. Wrong. It was a small amount of rice and was very sloppily put on my plate. Taste was good, however, if you don't mind de-casing and cleaning your shrimp as you eat them... the score was a 95, which is only a little below what I'm comfortable with. So now I'm just hoping to God I don't spend the next 48 hours puking my guts up, as I'm already unsettled.   We'll put the cherry on the cake by adding that I had to ask for the check and to be able to pay. Was never checked in on, water never topped off, nothing. I tipped, but only because I'm not an as*hole. Won't be coming back, tbh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xiZ81ktpw2dWNN4xpQXJog"
  },
  "APFgBuAd0KVrteagxOOJrQ": {
    "date": "3/15/2019",
    "text": "We went for a late lunch and both of us were craving Bun.  It was our first visit but definitely will not be our last.  Upon entry the restaurant was clean, bright and replete was with wonderful aromas of authentic Thai cooking. The food was absolutely delicious, well prepared, beautifully presented and reasonably priced. Our server was great.  The restrooms are clean and nicely accessible for wheelchair users.    So delighted to find this hidden treasure! Well worth the trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CyPxyx2oq8-5u8dMlDM2YA"
  },
  "PUG83HY92N2zKCJOjxteiQ": {
    "date": "3/4/2019",
    "text": "Wanted some pho on a cold rainy day. And Mr.Pho provided that.   Customer service: 5/5 great. Very prompt and check up on us often   Food: 4/5 pho and the wontons with noodles was great.. The fried spring rolls was a little doughy.. Wrappers is too thick. Couldn't really taste the fillings.   Ambiance: 5/5 quiet but busy. They keep the place clean and up to Sanitation code.   All in all, they are good with what they do. Provide good food and great customer services.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8DBWVID76vEqR1UXXeLhKA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Good ole pho. Comforting",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8DBWVID76vEqR1UXXeLhKA/o.jpg"
      },
      {
        "img_id": "ezsCu1WiLo9TY8TghtbtCQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Wonton with noodles soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ezsCu1WiLo9TY8TghtbtCQ/o.jpg"
      }
    ],
    "user_id": "jcURiDqCLY7AOqo8KClJnQ"
  },
  "onWy9YzqadiwhB1Xri0xXA": {
    "date": "8/10/2019",
    "text": "This place has the best Pho I've had in the Charlotte area. The broth is very aromatic & requires little to no addition, sweet chili sauce is available & amazing if you chose to use it. I'd highly suggest visiting at least once If you're a fan of Vietnamese cuisine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D0aYkdipYLDmm7F_0iXJvQ"
  },
  "LxAvrA-YuoC6LJlWuJSNiQ": {
    "date": "8/8/2019",
    "text": "I must say first time I ever had Pho Hanoi style and it was amazing hope to be back for some more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TvL_cNWfG2ClIrFG0qT0HA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Pho Hanoi and the seafood noodle soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TvL_cNWfG2ClIrFG0qT0HA/o.jpg"
      }
    ],
    "user_id": "df0Ypvy5xiK_Oml4Rlvy9Q"
  },
  "ATxnVlQ77_mD8-nCPzv_Nw": {
    "date": "7/18/2019",
    "text": "I found Mr Pho on Yelp after a long and exhausting day at Carowinds. We arrived at the restaurant not knowing they were closing in less than 20 minutes. The food was absolutely delicious. I ordered the large bowl of pho and grilled pork with eggroll bun bowl. The staff were nothing but friendly and accommodating. I love that they made us feel comfortable and didn't rush us. The food and service was above and beyond our expectations even my 9 year old son begged to go back the next day. Food on both our visits were delicious and satisfying. We will definitely be making a stop at Mr Pho next time we are in the area. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6JMPiiWTgsXmqDgOovG8Yw",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6JMPiiWTgsXmqDgOovG8Yw/o.jpg"
      },
      {
        "img_id": "R1KPdqd1TtJN8SlF3Oitkw",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/R1KPdqd1TtJN8SlF3Oitkw/o.jpg"
      },
      {
        "img_id": "HG5nCuPEdLEOAV-uy-5duA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HG5nCuPEdLEOAV-uy-5duA/o.jpg"
      }
    ],
    "user_id": "heOFhEa1y1vLX2E9iWungA"
  },
  "5-L3mXBKOT_U1bE3EJCOFw": {
    "date": "6/11/2019",
    "text": "The place is beautiful but really not that's great food wise. The broth was bla and I ordered egg noodles and got rice. It was ok, but not the best food wise",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5keMAmic7zzrnM5mVefBw"
  },
  "FEaezrrNdiuhzLI7aMZlYA": {
    "date": "2/19/2019",
    "text": "Got take out here tonight. Wanted to try their seafood chowmein. It's one of the most expensive items on the menu but the portion size was on the small side. I'm still hungry after I ate it. Flavor was on the bland side but i had sriracha at home to make up for it  I'll update the review next time when I try their pho. Overall it was ok.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cFwn-Lv9b3B83debhyRnFQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Seafood chowmein",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cFwn-Lv9b3B83debhyRnFQ/o.jpg"
      }
    ],
    "user_id": "EzMbKvgxMTxNtRBlSZcBFQ"
  },
  "7u4jTwSdFFZhNr32IhhWxg": {
    "date": "1/16/2019",
    "text": "Came here for dinner on a chilly night, perfect weather for pho. I was seated immediately. I had a small bowl of pho #2 (eye round steak, well-done flank, lean brisket, tendon, and shredded tripe, $8.75). I love that the menu comes with so many pictures because it is very helpful with figuring out what to order. It is especially helpful for those who have never had pho before to figure out what type of meat they're ordering with their noodle soup. The beef broth was very tasty, however, I do wish that I was given less broth and more noodles and meat instead. I was getting full from drinking all the liquid instead of the noodles and meat. Water is served in mason jars, which I think is a neat idea. The water did not taste great though...",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "goMbhkCtGknDcIjTSAfr8Q",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Pho menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/goMbhkCtGknDcIjTSAfr8Q/o.jpg"
      },
      {
        "img_id": "XJXFsn4yIQh2T_jun7-HKw",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Appetizers menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XJXFsn4yIQh2T_jun7-HKw/o.jpg"
      },
      {
        "img_id": "y8LQQxlssdazb-NTXsEMqA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Vermicelli menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/y8LQQxlssdazb-NTXsEMqA/o.jpg"
      }
    ],
    "user_id": "URWpOVK9fAmpQvntMa9LOQ"
  },
  "QMM3f-4BbOnTeIKu7zIM7w": {
    "date": "5/18/2019",
    "text": "All I've had as a dish here is the pho but it's Mr. Pho so I think I can get a pass! I usually get the beef combination and ask for chili oil on the side so I can make it extra spicy. I love my spicy! My room mate loves their lemon pepper chicken wings. I have had them twice they are alright. I've been to many Vietnamese restaurants in Charlotte, though this isn't my favorite pho place in Charlotte BUT it gets your fix in and it's good. I definitely am a regular here now. I keep coming back for the pho since I live down the street. There are two other pho places near by that are a little closer to me than this but in my opinion this one is better. I live a little further for this place over them any day. I also gave some points for their customer service and their decorations/vibe of the restaurant. They are always super nice and it's very clean.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H2cSIpX1ZT8hS_Tm4J3tNg"
  },
  "3luJMokrcMA3ZrzDwb__6A": {
    "date": "7/16/2019",
    "text": "I really like this place!  I've only gotten take-out but I def plan to bring the family in to sit down soon.  The service is kind and quick and the food is gooooood!  Reminds me of my favorite Vietnamese place in NY.  Will come back again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KoeaAoWHqbLC8UltuyBl3A"
  },
  "Zh5UPSG-zeLSgteMezsDbw": {
    "date": "5/12/2019",
    "text": "We came from out of states and my boyfriend suggested a pho place for breakfast. Found this place on yelp and decided to give it a try, pleasantly surprised! People are very nice here, foods are amazing, they even have their homemade hot chili sauce that added more flavor to the soup! Definitely recommend this place to anyone who wants some hot noodle soup for brunch/dinner! One suggestion though, maybe use non-take out cups when serving drinks? Other than that, everything is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sMjUimTynX5w827zyes1oQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Wonton noodle soup, yum yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sMjUimTynX5w827zyes1oQ/o.jpg"
      },
      {
        "img_id": "ainSHb8yss-qaPxz9iIyRg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Seafood noodle soup! Yum!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ainSHb8yss-qaPxz9iIyRg/o.jpg"
      },
      {
        "img_id": "T_aLHgu05yiyKC5DdWXa_Q",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Bean curd shrimp cake! Awesome!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T_aLHgu05yiyKC5DdWXa_Q/o.jpg"
      }
    ],
    "user_id": "1UwHUg5l8Zd7KfJd87HQGw"
  },
  "velDTyAFq49JAqjRNDJbVQ": {
    "date": "1/30/2019",
    "text": "Wanted to try a new pho place that I haven't been to and so I gave this place a try. First impression was that it was a nice place with nice modern decors which I appreciated. Ordered eggrolls for appetizers, Thai tea, and the pho special #1 (large).   The eggrolls were crunchy on the outside and the flavor was decent. The only thing was that I could tell they were frozen because it was still somewhat raw inside and you could still taste and smell some of the uncooked wrapper.   Thai tea was nice and sweet which is how I like it, I just wished they didn't put so much ice in it.   Pho was a let down. That's why it's a 3 star review. If you're into very light and not so flavorful broth, then you would love it. For me the broth didn't have any complexity and dimension to it. It was very plain and simple (in a bad way). The meat portion was a disappointment and definitely not worth the pay.   Overall the visit was decent. Customer service wasn't bad, but would be nice to at least have them stop by and asked if the food was good or not. It's just a nice courtesy as a restaurant.   *Coming from someone who has tried a lot of pho places in Charlotte.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TQLPc3o2vAHrtFbk9Vt08w",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TQLPc3o2vAHrtFbk9Vt08w/o.jpg"
      },
      {
        "img_id": "ltNBKZVXzFH5W8qGid65xg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ltNBKZVXzFH5W8qGid65xg/o.jpg"
      },
      {
        "img_id": "mPofkjighuFv9DrhwY874Q",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mPofkjighuFv9DrhwY874Q/o.jpg"
      }
    ],
    "user_id": "InReO2pm2hC9kk54UkHAyw"
  },
  "eYzTGZkp6BR5lyOhYCldrg": {
    "date": "11/15/2018",
    "text": "This was a pleasant surprise. Never had Vietnamese food before so I thought I would give it a run and it ended up a good experience. I was pretty conservative with the order only because I had no idea what to order. Got the grilled chicken over vermicelli and it was delicious. I really liked the way they prepared the grilled chicken and appreciated the high quality of the dish. Very Fresh. Also overall Quick, clean, and tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_mjBOuG96BZLG6W6-wPNJA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Grilled chicken over vermicelli, dumped that sweet chili sauce all over it!!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_mjBOuG96BZLG6W6-wPNJA/o.jpg"
      }
    ],
    "user_id": "_hNLwpzJlhwLLsg9lprSCg"
  },
  "uhqJDuoKNLgvsJfUp1Xolw": {
    "date": "10/16/2018",
    "text": "First visit to Mr. Pho (10/16/18).  They get two stars for the nice restaurant decor and good food flavor.  If you enjoy paying high prices for small plates of food then this is the restaurant where you should eat.  This would have been a 3 star review if the portion sizes for the appetizers, drinks and entree's were good but unfortunately not.  My son decided to try the egg soda, he said that it was good but for $4.25 we should have received more than a 6 oz size cup.  I started with the Vietnamese egg rolls and again good flavor but they were too small for $6.25.  They lie on the menu and put 6 egg rolls but really you only get 3 cut in half.  Then my son ordered pho special 3 with the beef tendon and said that it was good but again high price and barely put any beef in the bowl.    On to my entree.... I ordered a beef, shrimp and chicken fried rice and again good flavor but small portion size for $13.  Only had 3 small shrimp and a few pieces of beef and chicken.....this is the first time that I have ever eaten at an Asian restaurant and had shrimp in a fried rice with the tails left on.  No one wants to have to dig shrimp out of their fried rice and clean them....ridiculous.  Too lazy to clean the shrimp before they put them in the fried rice!  Asked for a soda and of course like everything else it was small and overpriced....a can of soda for $1.50.  Waiter was blah and not friendly.  Long story short this is an overpriced restaurant where they give you a small amount of food for a high price.    Underwhelmed and will not return!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uI9PPlC5v0dnQpR48kf7EQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Vietnamese egg rolls 3 tiny egg rolls that were supposed to be 6, expensive $6.25 overpriced!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uI9PPlC5v0dnQpR48kf7EQ/o.jpg"
      },
      {
        "img_id": "QS2iGuTNyCn7E2ZgRknzTg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Pho bowl with beef tendon.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QS2iGuTNyCn7E2ZgRknzTg/o.jpg"
      },
      {
        "img_id": "IlVyNUQEUSHyMRNRIPHQ4g",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Pho bowl with beef tendon.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IlVyNUQEUSHyMRNRIPHQ4g/o.jpg"
      }
    ],
    "user_id": "OoGzz5hV54aeuTi1g_YLPg"
  },
  "u-DmaPBwIpoLlcgu8_A_JA": {
    "date": "10/28/2018",
    "text": "Came back for the one year anniversary. The service has gotten substantially better and the food quality is still the same.  I ordered the Pho Hanoi but with Pho Saigon. Hit the spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Nws1eJmh7B85kQ6HD_w9cQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Pho Hanoi Broth with Pho Saigon Meat",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Nws1eJmh7B85kQ6HD_w9cQ/o.jpg"
      },
      {
        "img_id": "EIzPzmyV5UY3oKalK8bONg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Pho Dac Biet Bo Vien",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EIzPzmyV5UY3oKalK8bONg/o.jpg"
      },
      {
        "img_id": "HDZqxQAJtcVwH8mWQzvTSg",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Bo Luc Lac (Shaken Beef) with Garlic Rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HDZqxQAJtcVwH8mWQzvTSg/o.jpg"
      }
    ],
    "user_id": "KsF2wEv1f4cF878hLjME0Q"
  },
  "PzElEptG3tAwOmE89QGplg": {
    "date": "4/15/2018",
    "text": "First time stopping in here. I will update my review after a couple more visits. I am sure I will visit again.    I had the vermicelli bowl with grilled chicken. It was perfectly light with a nice mix of spice and cool front the pickled veggies. The staff were very pleasant and helpful in choosing the best menu selection.   Tables and space were spotless. Quite impressive for a new location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EYf6RqJSOFYMVd-rITiQKQ",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EYf6RqJSOFYMVd-rITiQKQ/o.jpg"
      }
    ],
    "user_id": "rK-vIBZ90hieDots3Clc4g"
  },
  "a1oARztnftfWkabJEvW1ig": {
    "date": "1/4/2018",
    "text": "On a cold day (yes, it gets cold in North Carolina), we headed over to Mr. Pho for a soup dinner. I was pleased to see that they do have a lot more than just pho and a variety of those too. Chicken, various beef soups and a whole stack of rice and vermicelli dishes too.  Service was okay. They were clearly overwhelmed by the number of customers but the staff was trying hard.  The only thing that was a little confusing was paying at the end which involved knowing my table number since no actual check was presented.",
    "rating": 4,
    "rated": {
      "funny": 23,
      "useful": 36,
      "cool": 30
    },
    "photos": [
      {
        "img_id": "x9fkoVkhz_9UT52sagQNuA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Mr. Pho in Whitehall, Charlotte, NC",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x9fkoVkhz_9UT52sagQNuA/o.jpg"
      },
      {
        "img_id": "zILHcXdcaTFykqZNk0-35w",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Pho with bean sprouts and basil and cilantro added then some hoisin and sriracha",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zILHcXdcaTFykqZNk0-35w/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "U0-Lhn5bHbw-bfkTqR43Vw": {
    "date": "2/18/2019",
    "text": "Plentiful servings of broth and great flavors. Sometimes they are a little skimpy with the sides and noodles so be sure to ask for extras.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lGs3VHkhDkoR1Jh0dv443w"
  },
  "gG17l20Tws1J73_cjvTwNg": {
    "date": "1/4/2018",
    "text": "Woohoo!! My first 2018 review. Thus far i've visited Mr.Pho twice in one week!!! Yes! I'm addicted.  So clearly it's colder than a penguins butt outside. Why not cozy up with a large bowl of Pho! I've had this restaurant bookmarked, and I couldn't wait to visit.  Mr.Pho is located in the Whitehall Commons Shopping Cente, next to Chili's Bar & Grill.   My first visit, I arrived on New Years Day for lunch. Only three tables were occupied, it became busier later. There's no hostess stand, someone from the register will seat you. Overall the restaurant is clean and well kept. You can see inside the kitchen (a little) floors and counters are clean. A++!!!  I hope they hire more staff. During both visits, I witnessed customers asking for more water, the check, additional napkins, a beer once or twice--that was clearly forgotten. The few people on staff were running from table to table. I'm sure this is overwhelming.   The menu offers plenty of options, which is great for customers with a limited pallet.   First visit:  I ordered the \"Lean Brisket\" Large, which was a great option! This Pho comes with Lean Brisket and noodles. The Pho comes with free side toppings ( Thai Basil, 1-lime wedge, bean sprouts, 2-jalapenos, mint leaves, and cilantro).   Second visit:  I ordered the \"Pho Special 3\" Large. Another great option! However, the meat has more fat.  This Pho comes with well-done flank, lean brisket tenderloin & shredded tripe noodle soup. The Pho comes with free side toppings ( Thai Basil, 1-lime wedge, bean sprouts, 2-jalapenos, mint leaves, and cilantro).   Vietnamese fried egg rolls - DELISH!!!!  Will I come back? Well Duh! Great food & prices, plus I live insanely close by!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "UGTQum1peLSeOZr08LERbA"
  },
  "4ROOYcTDBF4x1wpNuDuHtw": {
    "date": "8/26/2018",
    "text": "I came here with my friend today because I was under the impression that they had bun bo hue chay. My friend is a vegetarian so I wanted her to have a chance to try bun bo hue. When we were looking through the menu, however, all the vegetarian dishes were gone. The photos on here of the menu is accurate except for the vegetarian portion of it is missing. We thought we would have to leave but our nice waitress went and got a separate menu for vegetarians. So if you're a vegetarian, you need to ask them specifically to give it to you.  I got a bun thit nuong which was a good portion size and tasted great. The price was about $9 which is decent. However, there's nothing about it that made it special or stand out from the other ones in Charlotte until I tried the lemongrass tofu. My friend ordered that and it tasted AMAZING. I don't like how the lemongrass tofu is at Vietnamese restaurants or even how we make it at home. Too bland. But this one tasted perfect. I'm prob gonna order it the next time I come here. I recommend meat lovers to try it too.  Overall, a very nice restuarant that I think everyone should give a try. The design and decor of the place is very beautiful as well. The wall is a beautiful painting of Da Nang, Vietnam where my father is from. My parents know the owners though I do not know them myself. Very lovely family from what I've heard which shows from the positive and friendly environment of the restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P7U3kIb9rPIgfQiJnCfhBA",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P7U3kIb9rPIgfQiJnCfhBA/o.jpg"
      }
    ],
    "user_id": "WWA35zmBGs4CDKk_FKuGvg"
  },
  "ejQ-hY-sHNcAfOAOkTOdtg": {
    "date": "11/12/2017",
    "text": "Came here couple days ago with my mom, i had the pho # 1, it was delicious. My mom also had the Bun Bo Hue and she love it. This will be my favorite place to go when I craving for Vietnamese food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VZp_draRtM_cVZLgns7ixw",
        "caption": "Photo of Mr. Pho - Charlotte, NC, United States. Beautiful interior",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VZp_draRtM_cVZLgns7ixw/o.jpg"
      }
    ],
    "user_id": "q40hSMda-Cv-h9GzFmH3yg"
  },
  "BNKFS_ZKKqhT5f5z2FhJ7w": {
    "date": "11/24/2017",
    "text": "This place is straight trash. GARBAGE. Never go. Food was warm at best. Got the pho and bun bo hue. Both was trash. I looked the waitress dead in the eye and asked her if the bun bo hue was good, she answered with a straight face \"best in town\" Jesus I would hate to taste the worst in town if this is the best. The best part of my meal was the fact the owner came out and asked if I wanted to change my dish because she could see I was unhappy. I doubt anything else here was good so I declined and politely ate more in front of her. Honest recommendation? Buy a plane ticket go to Vietnam, and order food there. That would probably be worth the price of not eating here and having to deal with this awful taste in your mouth. Coffee was good, small portion, no meat. Decent service",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fBfLhOGKSSZpZkCN_i5-KA"
  },
  "cxYf9SlinDqP-EJT31MJug": {
    "date": "10/29/2017",
    "text": "Honestly, I want to love this place for its convenience but I can't. We came in for late dinner around 8:50 pm on their grand opening. We got sit right away. The waiter took our order immediately in the rush. About 15 mins later brought out our complementary eggs rolls. I was plain and had no taste. Well. It's COMPLEMENTARY.   Here are the part that they should earn 0 star:  The silverware was visibly dirty with oil residues that had to replace and still looked dirty.  Our food came out AFTER 3-4 tables that came and ordered way AFTER us while we had been waiting for roughly 1 hour. The waiter was once apologizing for the mess up that the cook did. Per say, it looked like \"family friends\" tickets got to place ahead of \"regular paying\" customers.   Food FINALLY came, my pho was cold and much much oily in the broth. It didn't taste anything like Pho HaNoi as I had tasted many times before. The other pho was hot but still no taste and very oily.   For this kind of food and services, I will take my business as far as a could.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4cTFnFeWMOQ_djICE6ZJqw"
  },
  "0VZAeytzM7Fqwoenml6Ngw": {
    "date": "5/21/2018",
    "text": "My favorite new Viet restaurant. I love the Banh Beo, got it every time I came. I also love the Hanoi pho - being that I am from Hanoi, I recognized the broth was very authentic. And the Bun Bo Hue was delicious, had huyet in it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DGzcVSgy5rsPXPTQ-N5m9w"
  },
  "5iqMeyF8MTrnC7r-UcsdvA": {
    "date": "2/21/2018",
    "text": "I will be back! Fresh & Delicious!! The restaurant is very nice and clean I enjoyed the summer rolls and the beef pho",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YdwN0gGUYfmUobijvGp1xQ"
  },
  "Xu9vvXRP8Le_779tBGJqfA": {
    "date": "2/14/2018",
    "text": "Just moved here and thought I'd try this place close to my job. Glad I did-Bun just how I like it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fLnpAKjQfkLRWIgl6YxvUw"
  },
  "3-lvVNMjoRDjhR7h4P2tfg": {
    "date": "4/16/2018",
    "text": "I love Mr. Pho!  I've done take out a few times, but this weekend I went in to eat.  Very clean, very modern.  Attentive staff and generous portions.  I strictly go for the pho ga, but my spouse loves the spring rolls and the vermicelli bowls.  I hope they succeed and stick around.  So convenient to the house.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2vjeAfsXKeKhmbqS-pv36Q"
  },
  "BoL4YbUdYHXKjP6F6oDB5A": {
    "date": "12/13/2017",
    "text": "What a great spot for dine in or carry out!  Everything tastes fresh and the service is fast.   Ask for the vegan menu!  It isn't on the regular menu, but they have lots of tasty options on a separate menu!  Been here twice now and the food and service have been excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PsWXW9uZwWd9eXMKdg6SWg"
  },
  "6WwP1O-lgO7vux_ifaGUOA": {
    "date": "4/1/2018",
    "text": "I have been to a few Pho places around Charlotte and this is definitely my new favorite. My team and I went here for an early lunch on a Thursday and service was great. I thought the pho was perfect (not overly spiced yet not watered down) and they are generous with the meat and noodles provided. Some got the vermicelli which they said was fantastic. We also got the strawberry bubble smoothies. I'm pretty sure it was fresh strawberries though the straws given were a little small for the bubbles. Overall, I'll definitely be back (and maybe next time I'll try their build a pho bowl)!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HsiWbsS56WPyi0x3Kv_Epw"
  },
  "pIb8QBzahaEWop8Qg9LeEg": {
    "date": "3/28/2018",
    "text": "This restaurant is one of the best places for Vietnamese food this side of Charlotte. The service is speedy and not bothersome, but also not distant. The food is spectacular and the drinks, as a person new to this food, sound weird but are wonderfully tasty. I definitely recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ksW3Y2y_tRlf2EkYxXet2g"
  },
  "2cjqvSAN-Wht-wzbNneJoQ": {
    "date": "2/8/2018",
    "text": "Best pho in town. Vietnamese fried rolls are the best thing on the menu.  Friendly staff and ask about their house made sauces.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ooVF5iuNAquTmL9xYhMFmQ"
  },
  "X0utsfMv9-z2BfdqWyHDxg": {
    "date": "10/28/2017",
    "text": "Best Vietnamese food in Charlotte!!! Definitely coming back! So happy to have an authentic Vietnamese restaurant to go to when I'm in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hm4HNkuteY0yapOmlyXhPw"
  },
  "WYAZjLzEh49EmNmS_aOhUg": {
    "date": "1/12/2018",
    "text": "So glad there is finally a good and modern pho place in south Charlotte! You won't regret it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FHKw_ueB5P2BDlQirT8ilQ"
  },
  "eESg73BdEiZWFcCkjEiYKA": {
    "date": "1/6/2018",
    "text": "First time trying this place with my boyfriend.  Food was mediocre but service was crappy. We walked in at about 8:15pm, we were aware they close at 9pm. So we made sure to order quickly. Right when we walked in, an older woman approached us and asked, \"to go?\" (What the heck?!) I said \"umm no, we'll be dining in.\" We get seated and the waiter appears with waters about 3 mins in. Mind you they weren't busy at all. We both order combination pho (mine was a small and my boyfriends a large), spring rolls, and Steamed rice cakes.  My pho had so much noodles in it that it soaked up almost all the broth. But my boyfriends pho was portioned well.  The rice cakes were definitely not fresh because they brought it out way too quick and I know it takes a little while to make them. Plus it was cold.  Spring rolls were fine.  While we were eating we noticed they turned away 3 potential customers even though the open sign was on. I mean, at least turn it off if the kitchen is closed. The waiter never came to check on us but were quick to bring the check as well as pick up the check. We asked for more water but the waiter never brought it.  Moral of the story, don't go to Mr. Pho \"late\" or they'll give you lousy service.   Side note: Why have bottles of Hennessy on display but don't serve liquor?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l4CG9s5A-7Xg8cbLcUjr5Q"
  },
  "ofVC8KkI0kdfcNf7FrT2mQ": {
    "date": "12/31/2017",
    "text": "I have many Pho noodles in authentic Vietnamese town in DC.  This place is just as authentic.  Clean new place and visible kitchen.  Friendly and fast service staffs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-pEisCxCICFfRPS4s9bPxQ"
  },
  "6ZzRbRtsah2dEOANpkEqBw": {
    "date": "12/4/2017",
    "text": "This restaurant is a rare find with fantastic food. Ask for the vegan meals (off of menu), beef lemongrass with rice was cooked to perfection. Staff are very friendly and attentive, would highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4zB_4kxopXMEubxMrr2MZg"
  },
  "sFH4_o-Z50M3O5UZrsxeRw": {
    "date": "12/20/2017",
    "text": "It was my first time there, me and a couple co workers decided to try them out actually. Soon as we walked in we were greeted and seated right away (no wait time). The waitress was pleasant and explained everything we needed to know(we asked questions). The food was made promptly so it was served hot and the flavors were delicious (i will be back) at the end we got rang up and the owners (i think) came out and spoke with us and gave us some background of the company and how long they had been there (6 weeks).... needless to say we will be back!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9QUvBkBgoddUzxpbr2zpw"
  }
}