{
  "isAxKWae-BTi2703wbWpcQ": {
    "date": "6/29/2014",
    "text": "Really good place to go to lunch during the work week. Healthy options that are tasty, and a nice patio to eat on if weather permits. It's unfortunate that it isn't open on weekends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2ITw2Gp8WFz8huqIv30-A"
  },
  "EtYLwVUoXHIbG-JFKoh2RQ": {
    "date": "8/7/2013",
    "text": "Went here on a weekday night. I didn't like it and I probably won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MOOsVHT6KrM8x-MBYOUNQg"
  },
  "Px-oClHzjoaYv7DUQpuWLA": {
    "date": "10/26/2010",
    "text": "This place is downright bizarre.  it's run by the same people who run Greek Isles, which means most of the menu is Greek with some pasta and \"creole\" items.  I say \"creole\" because there is like 2 items on the menu that are supposed to be New Orleans style and those at the tables around us who ordered the special (chicken creole) left most of it on their plate.   I had a caesar salad and it, I kid you not, comes out in a mixing bowl.  it's huge and really a total waste of salad because it would take 3-4 people to finish one.  I barely made a dent in it.  The salad was just alright, nothing terribly impressive.    During the week it's full of blue shirts watching ESPN.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "NmC_ZemjAQ6TvzgeaAuTmA"
  },
  "xVU7lWJsnYOgZD8vEVV1ig": {
    "date": "4/21/2011",
    "text": "The French Quarter is one of the best restaurants in uptown Charlotte. I worked for the Charlotte Chamber for 13 years (it is right around the corner) and used to eat there at least once a week. Now my office is right off of Morehead Street but still get up there at least once a month. The prices area affordable, food is always good and the service is on spot. Not too many places uptown that you can order and eat with in one hour. Even if you have to wait you still make it out within the hour. There is typically is a line around noon, get there around 11:45 and you will be all good.  Steve Caldwell",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fj_OzdrK65enTXFBpFV3BA"
  },
  "Md_UjlYoCwfMopgFPUh1zQ": {
    "date": "2/4/2016",
    "text": "Recalled how great their Thursday lunch special was so called in my order for pick up.  Crowded as usual which is fine...used to that but got dark meat instead of what I had requested and potatoes were not great...felt like someone new is in the kitchen.  Too much sauce on brocoli.  Maybe it was an off day...sadly I can't make it there often so was disconcerting.  Good price and very sweet tea.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OCQ5GZ_EfwDfPvpio5NKOg"
  },
  "A5seMfw9DZyJxn-C4gO2QQ": {
    "date": "1/18/2011",
    "text": "I wish I had an option for 2.75 stars because I do love this place but not sure it gets the 3 stars.....The specials are always 'just fine' such as beef tips and rice.  The gyro is fine, nothing to write home about.  I always get the club sandwich when I go here and never can finish it (it comes with a ton of fries to share...)  The prices are very reasonable and the staff is super fast and efficient.    I guess what bugs me about this place is the consistency of the quality....leaves something to be desired at times.  Such as weird brown lettuce on the taco salad, overcooked meat on the gyro....it is almost as if the menu is too big and they should cut back and improve the quality of several best-selling items.  Overall I would say A-OK!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "htiVdsiY_rBmJc65aZ3YAA"
  },
  "fSERz1ykgr7vhDSFDqhftw": {
    "date": "8/16/2010",
    "text": "solid 3.5.. Went to the French Quarter for Dinner Friday before a concert.  Very pub-like - kind of has that neighborhood bar feel to it. Upon looking at the menu I wondered \"What kind of restaurant IS French Quarter?\" I wasn't sure what they were trying to be as they had pub fair, Greek, Mexican, Creole/Southern ...it was just an odd mix and right away that had me wondering.  Against my own better judgment I went for the salt and pepper wings. I decided on this for one reason only as that was dubbed their \"famous\" item. I figured if it could be famous it had to be great right? Let me first say I am a harsh critic of wings (having lived in Buffalo) - but salt & pepper wasn't exactly Buffalo style so I thought these could stand a chance. I was wrong. They were terrible! The wings were crispy but lacked flavor. ( the ranch paired with it was great though) - I decided to ask for some Buffalo sauce as I didn't want to be eating globs of ranch. I was really surprised with how great the  Buffalo wing sauce was!  All in all I think I will branch out and try something else next time-but I wasn't disappointed..  Also, it was CHEAP - $15 dinner for two, really can't beat that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "TZhxaMxPsBGsmxcMzwWrnQ": {
    "date": "8/29/2013",
    "text": "Disappointing!! It is 9pm and we can't get a burger... Because they don't make them this late --- what? We left the Panther's game early! Oh well. We're here and it will be the last time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IyFht4oJcwgYqr0xoS3dpg"
  },
  "ps0Iy4H-UczJ3ZdSeTJV2A": {
    "date": "1/20/2010",
    "text": "On my first day working in CLT, my team member raved about this restaurant and their daily lunch specials.  Sooooo, the Shrimp Creole, in a nutshell is one of the Tuesday specials. Its pretty much rice (that's not cooked all the way), embryo shrimp (of the frozen kind from your local grocer), and red spicy sauce (umm, creole sauce?). I tried my best, but I could only eat a 1/4 of the plate, and really that much b/c I was hungry.   We were seated quickly and the food came in 6min....so I was able to make it back to the office ontime. Guess that's worth 2 stars eh?",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "uO6th8EuZPQipjNIluS1pQ"
  },
  "ypyB4fd4iqq2n7TPcxXRbA": {
    "date": "7/19/2013",
    "text": "Have been coming here for years and they are always spot on!  Service is always fast and the food is consistent. They run these daily lunch specials for around 6.50-8.00 and that includes your tea. Try the Baked chicken on Thursdays or my favorite is the Blackened fish on Fridays. They do a pretty good happy hour as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sISTLrV0oueKdFxG7lrjFw"
  },
  "aYQ8UToXqVOV0K3gHqe2DQ": {
    "date": "1/11/2015",
    "text": "I'm totally confused. It's called French Quarter, giving the southern-Nola type food idea, owned by Greek people, and called French food. I looked at the menu and saw more Greek options than Nola/French inspired. In fact there was like one \"cajun\" option......So why be deceitful? Being from Louisiana I'm always skeptical of french/cajun restaurants but this one didn't even try! Sorry....not falling for the trick.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9h0rrZBoY1kZXs3YTAv4qQ"
  },
  "DBvn8zZzcH9-K_I8sFA_FQ": {
    "date": "4/17/2013",
    "text": "Great place to go for lunch and/or after work for a drink and yummy food! Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JncMCwvwKhqIrMpiYU_5SQ"
  },
  "4X8R4BPNj1hbLISAf0kxiw": {
    "date": "5/21/2015",
    "text": "Love this place for drinks special and just to hangout on a low key evening after work.  Love the waitress Jennifer, she is amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tXKgLMjeQJEuRIZ03XKWjw"
  },
  "jUwSl2vJ83BY52eZNaxNrA": {
    "date": "10/10/2011",
    "text": "Fun if your looking to party but not if your looking for a True New Orleans style menu. The was only one \"creole\" dish on the menu and the rest of the menu was typical bar food.  However, the food was good and there is a decent beer selection (unless you are looking for \"Abita\" which is a NOLA beer...)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qI2I6gNtkIrLijgsJ-YX6Q"
  },
  "P2K0pvtQ4QzsH6K4NuHSGw": {
    "date": "3/12/2012",
    "text": "Get there early for lunch or be prepared to wait. The place has the feel of a frat bar, but it's not. Their world famous baked chicken was good but nothing earth shattering. All in all good experience and will definitely go again next time I'm in Charlotte.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxtUuGNCk3W6xPWtUwvyDg"
  },
  "mNFDa1FBPto3quFhk7GGsQ": {
    "date": "3/20/2013",
    "text": "The Monte Cristo sandwich is balls to the wall amazing!! I'm always trying to eat healthy during lunch but I just had to have it!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KtOwowEsu20iQj46xzPnjA"
  },
  "DPKglZmlVDvt3YHRmfTqiQ": {
    "date": "6/30/2012",
    "text": "The staff rocks (and they tell me the food is good, too).  Forget your plans; you could wind up staying here all night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8FQbM_kXBnqXHTYT2Xj0Ng"
  },
  "RnEUNb75RqCvXO3lH8XX_A": {
    "date": "7/28/2011",
    "text": "Not a bad little pub. Had the sliders, salt and pepper wings, and mushroom burger -- forgettable, but good. The fries are what I will remember, and come back for.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fvj9dV4e6Fu5T5tM98dCVQ"
  },
  "dugpNpgcHCzm1wcju91B6A": {
    "date": "5/2/2008",
    "text": "Great place to grab lunch on a beautiful day.  I had the French Quarter Salad w/ grilled chicken and it was fantastic. Service was good and the food came relatively fast for a lunch rush. The best part of the experience was eating outside on a beautiful day, when we went inside to pay it was pretty loud.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n2spaSaPmLc_0HregfzjHQ"
  },
  "SqWwZgUnqiccsmHLDDy4iA": {
    "date": "10/20/2009",
    "text": "When I worked in uptown Charlotte, this used to be my lunch spot once a week. I used to go on Mondays, less busier than the rest of the week and get there before noon to get seated promptly.  Service: Fast and polite, the couple that runs the place are always charming and aim to get the most people in and out with a smile  My favs to order: red beans and rice (monday's) grilled chicken breast sandwich chicken salad sandwich sweet tea cajun fish special (friday's)  Ambiance: It is a bit dark inside and table are tight but the food and service totally makes it worthwhile.  I miss this place during my lunchs in NYC!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "edCPA-6lvh5wqclDBZPggQ"
  },
  "CwyPU3TFxFxIdBA0N7-dFA": {
    "date": "5/12/2016",
    "text": "Middle of the road lunch place..nothing more nothing less, French quarter salad is alright",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c_vwdEGXm57ASJvMK4ob4w"
  },
  "sbMEflkdMTnM_vmXuaj58w": {
    "date": "1/16/2017",
    "text": "Of all the restaurants in the courtyard, this is undoubtedly the least impressive.  I wouldn't do it if I were you.....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v9FT1O5vdOHlzOYpyc-Y2w"
  },
  "hEW1PTtguTyxx39YZwTklw": {
    "date": "10/2/2013",
    "text": "The in-laws were in town this past weekend, so we decided to show them the newly opened Romare Bearden Park. The park was a lot of fun and after checking it out we decided to stroll over to French Quarter for lunch.   I had high hopes for French Quarter, given my love of Uptown restaurants and my affinity for Cajun-inspired food, but I have to say both the food and the customer service was a major letdown.  Our server was not very attentive, forgot what we ordered, brought our food out without silverware and took several minutes to provide us with silverware so that we could actually eat, and failed to refill our drinks. The restaurant was also FREEZING... last Saturday was literally the nicest day of the year and they had the air on what had to be 65, totally unnecessary!   Once we were finally able to eat our food, it was a) cold from us not getting silverware for a few minutes and the restaurant being crazy cold & b) not that great. The gumbo tasted like it came from a can and the mashed potatoes tasted like they were instant.  If the food and service wasn't enough to leave a bad impression, the restrooms were disgusting and there was no toilet paper. I will definitely not be returning to French Quarter... which is a shame because they're in a primo location!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_siniUb8CoN9of4mhAtj_g"
  },
  "42v5gRQtpS1ngarHezFEfA": {
    "date": "7/15/2010",
    "text": "Just had lunch here with a coworker.   Place was packed with a capital 'P'.   We probably had to wait some 15 minutes to get a table.   Once we finally did, I ordered the Monte Cristo while my friend had the Gyros (not very Cajun, I'll give you that!)   We both had sweetened Ice tea to drink.      The ice tea was very very nice.... Best ice tea I've had in quite a while.   Granted, it was sweetened, so that could have something to do with it.  Monte Cristo?   Damn!   I'm not a connoisseur but this is the best deep fried French Toast Ham & Cheese sandwich I've ever had.   Yummy!   And it cost me all of 10 bucks.   Well worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jX52sZoojxyYV2viWNyO7A"
  },
  "BwvobmuKMZXEyfHN9oE7zw": {
    "date": "4/18/2015",
    "text": "My family and I stopped in to grab some food and catch the Caps game. I was kind of shocked by how empty it was for a Friday evening, but I liked the mellow atmosphere. The service was fantastic and the food was typical bar food. Nothing to rave about, but it did the job. They have a great local beer selection, which was cool because we came down from MD. I  went with the chicken quesadilla app. Filling, but no guacamole, so kind of a buzz kill. The Garlic fries were bangin. Saturate those babies in ranch and you'll die happy. A great spot if your looking for sports, apps, and craft beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k6C0Gr6IMKIemkKJjGDsUA"
  },
  "iq3qhtvOonOPGM-Q7gwa3w": {
    "date": "10/17/2012",
    "text": "A staple in terms of lunch place diners in the downtown Charlotte area.  I finally got my first trip here the other day and was amazed at just how packed out this place got.  Shoulder to shoulder is the best way to describe it and that's a con because of the terrible acoustics when it's that crowded.  That made for hard to hear conversation and hard to really get engaged with my girlfriend during lunch.  That stunk so I think I'll come back at an off hour some other time.  The tuna salad sandwich I had was fantastic and delivered to the table in lightning speed.  The service was good but don't be fooled they are obviously trained on getting you in and out here during the lunch hour.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "Sv_RJZQ0vBioa8-AEJLruw": {
    "date": "9/16/2017",
    "text": "I have ate at allot of NY Greek diners and I can honestly say this is the best Greek food I have ever tasted! I ordered the Greek salad and added London broil, minus the croutons, pita, and carrots as I'm limiting my carbs. My boyfriend had the Gyro and she crab soup. I tried his food too and the flavoring was totally hitting it on every taste. The marinade on the London broil was outstanding, my salad dressing rocked, the Tzatziki sauce is absolutely the best I have ever tasted, it was so fresh and cucumbery, the feta was like goat cheese, real Greek olives, and even my peppercinni was uniquely the best, some kind of spice was on it, cucumbers nice chunks with no after burp. The cook even came out to ask if everything was to my liking as I had ordered off menu. The she crab soup, a delicious creamy dream, with a perfectly balanced delicate undertone of Cajun heat! I stumbled on this place by chance and will definitely make the drive into Charlotte deliberately for the French Quarter, as long as there's not a game, lol. My water was never empty, and the service was stellar!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gk4p56k95LOjCEzuT6_zTA"
  },
  "olkTnI8myVyNgiuWkBe1lA": {
    "date": "2/19/2015",
    "text": "Went here on a work trip. We were looking for a quick good spot and this place was perfect. Loved the chicken pita and my coworker loved her grilled chicken sandwich. Service was wiki and really nice!!! Definitely recommend this spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sWsutP1HVUmzHIZqxl4TQQ"
  },
  "fSmgfeQtIfpkk9Rut0uubQ": {
    "date": "5/13/2012",
    "text": "Good daily specials for lunch and excellent portion for the price you pay. Service is also always spot on. If you work uptown, this is one joint where you can sit down to have a meal and be back at work within the hour, as long as you work within walkable distance from the restaurant. Gets busy during lunch, so I would suggest getting there a little early - has limited outside seating as well.  I, for one, love the Friday special - Cajun grilled fish with rice and beans. Can never clean the plate unless I starved the morning of.  Not quite the authentic French Quarter food, but still a decent place to have lunch at in uptown. Would have rated higher if food was more authentic instead of being ordinarily good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wvma7t8p3sXk_0fKxyam8w"
  },
  "_RFKC6ZOm4IE2L-b6yqZsQ": {
    "date": "4/24/2015",
    "text": "Totally hit or miss.  We used to love the salads here, but too many bad experiences lately,  It's obvious sometimes some of the stuff they serve is leftover/reheated from the previous day.  Not acceptable...esp for a $10 salad!  We finally need to throw in the towel on this joint though...not only does the price seem to change depending on who rings it up (and its always more than what the online menu says it is), but last week we got take out salads again, and they were the worst yet!  We can always tell when they don't serve us fresh pitas, but these were SO bad, we could see just how stale and old they were just by looking at them.  Could not believe they actually served them to customers.  Disgusting.  AND, the chicken was dry and definately not freshly cooked.  I will pass on last night's leftovers from now on.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XjC2e2R78vr7SyU6yXg9rw"
  },
  "4y0CY26UmFmHIid7_PzZEQ": {
    "date": "2/6/2015",
    "text": "Have never had a bad meal here. Don't be thrown off by the name of the place as its definitely not French! Basically, it's an American Bistro/Greek menu but the price is right and you can't go wrong w the timing and the service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PQPPGZ6vOs3DZaayAG1eGw"
  },
  "7BDhI6u_kQ-1FUBEjyHLbQ": {
    "date": "12/13/2011",
    "text": "Good place to go for a nice bite to eat..  Check the daily specials.... (lunch).... good food all around.  (A bit pricey) for what its worth.  A little tight if you plan to sit down during lunch. You will have to go outside to exhale.  Service is prompt Call in service is as expected  I onced ordered a buger, fries and drink... tab came to almost 10 bucks. I don't know if I would call that a bargin. (the burger was fine but NOT 10 dollars FINE)  During the summer months when its warmer (who am I kidding, its Charlotte, it may be 80 mid Dec) they have a few tables posted up outside where you can sit and eat, sit and eat and watch other patrons from several other food places walk past, or sit and eat and people watch or be watched... ekk ekkk ekkkkk!!!!  Try it out... Fridays... \"SHE CRAB SOUP\"  CHEERS'",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xhlcoVm3FOKcxZ0phkdO6Q"
  },
  "l1duSXDHfmdiOl54EbyRbg": {
    "date": "7/16/2012",
    "text": "I have been here three times now. For some reason a lot of my coworkers really like it. It's a popular lunch-time destination.   They are known for their southern, Louisiana style dishes. I would say it's just pretty typical, heaving-tasting foods. Their gyros are not bad actually, but the creole with shrimp and blacken fish I had as a lunch special were just too salty and heavy for me. I'm sure some who love their soul food would appreciate it, but it wasn't for me.   It gets pretty crowded during lunch hours, and the spaces are quite tight.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dozxQ9MFDSLCuvcmt1Wi5g"
  },
  "r2Kwu2kFl7Kuuj069FRV7A": {
    "date": "5/14/2012",
    "text": "I do miss working downtown since this is a nice spot to get some after work beverages (or 10).  Very laid back, no frills atmosphere to this place with an eclectic menu so I am sure there is something everyone can find to eat here.  Location, helpful staff, and tasty food/drinks makes me give this place a solid 3 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "8EP2lXP76zJ2f1Yy6N10Fw": {
    "date": "8/8/2008",
    "text": "Salads are good, but this place's secret is their Thursday special, Baked Chicken.  French Quarter is busy for lunch every day.  Indoor seating is limited, but creates good atmosphere for this place.  They are usually open before Panther games.   Tip: To avoid the weekday lunch rush, I recommend arriving no later than 11:30 a.m., or you'll stand in line to get in.  They offer outside seating when the weather is nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EyaluppfmU_oI5pb2jF1TQ"
  },
  "A5uiptYQ0UVE8VAy9JxgNg": {
    "date": "9/28/2014",
    "text": "Great spot for a quick, cheap lunch uptown. The daily specials are great as you get a full meal including a tea for around $10 with tip and tax. The restaurant is unbelievably fast as I don't think I've ever waited more than 10 minutes before. The Shrimp Creole and Baked Chicken my 2 favorite lunch specials.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cEnN_26ZLSXtHIwVfiDMqg"
  },
  "NkuyqTYKgw3tpz0SCDQjiQ": {
    "date": "8/30/2011",
    "text": "If I cant think of a better spot, I go here.  The food is decent... not French, not Cajun/Creole, but there is decent variety (as long as you aren't a vegetarian.... though the Portabella Pita is quite good...)  It's not a bad place, there are just better spots downtown.  It just seems like the ownership is going with the flow instead of making the bar a better place than it currently is.  It is NOT a place I would go to unless I was on a quick one-hour lunch from work.  They don't have draft beers worth mentioning.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jw4VhSK3Gj_8zhMlBssDYg"
  },
  "eDbtUAXK4VsYvD7bMNxocg": {
    "date": "4/24/2016",
    "text": "First off, there are not many french options when I went which was odd... but the Monte Cristo was fantastic, the service was supa slow though",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dF_ukUvOl3C9M1WIBXkbxw"
  },
  "_K1tPk-x2tNVNxc8hsiuhA": {
    "date": "10/24/2011",
    "text": "When I worked Uptown, this was one of the regular haunts for me & my co-workers because it is inexpensive and offers pretty good variety.  I woulldn't consider this place as a cajun/creole place but the food that they serve is typical American-Greek fare with a couple of New Orleans style dishes thrown in for good measure.  Usually the specials are pretty solid.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "Li--RKXAmRnZ1xAVajLfpg": {
    "date": "3/6/2014",
    "text": "Had the Thursday lunch special of baked chicken, mashed potatoes, gravy and broccoli and it was very, very good. Portions were good size and the food was HOT. Very friendly staff and great service. I'll be back.  Bargain for the price!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KY-xBTsqH--frE-OYA67ig"
  },
  "za7Rce4jsNg-GbZIEOKukA": {
    "date": "8/30/2017",
    "text": "This restaurant isn't the worst but isn't the best either. The cons are poor parking, there is a parking garage close by with very limited spots. The service was lacking at 230-3 pm on a Wednesday. The manager doesn't take concerns very well.  The chicken jumbo takes like it is Cambell chicken soup.   Pros. Other than the one problem with the soup the food is good. The Chicken on Pita and the Monte Cristo were both delicious.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNraSVQtPHI_vMFfd-oJAA"
  },
  "hOSJtOsCT0UpEpcxqZ6pTg": {
    "date": "7/7/2017",
    "text": "OMG!!!! The Monte Cristo is out of this world!!!! The ingredients do not sound like they fit together but the flavor explodes in your mouth!! If you have a chance to visit, do it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ZhlgKxHksspVR-9KBotLQ"
  },
  "CkfGP_BeQw3uvnxf8FFSJQ": {
    "date": "8/11/2017",
    "text": "First time here. Try the she crab soup if you're here on Friday or Saturday, and the Cajun Salmon is excellent. Great service, friendly waitress, and the food was top-notch. Good beer selection as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TnIRFi3Dlx8OYwULoI5APw"
  },
  "LYAZ0mKw2DQY0T7Em4TnoA": {
    "date": "9/5/2013",
    "text": "I enjoyed my dining experience here. The salt and pepper chicken wings were excellent! They brine them in vinegar and garlic for a few days, then deep fry them and season them with salt and pepper. It was simple and delicious!! I'll definitely be back for them.  We also had an order of Greek fries, which are potato wedges seasoned with oregano. They were also good.  They weren't exceptional (like the chicken wings), but they were tasty and a good accompaniment to the wings. One member of our party ordered the nachos, which were average. I wouldn't recommend them.    We sat outside on the patio, which was very pleasant. There are a bunch of bars/restaurants on this little strip and it's a bit secluded. So, it felt like we were in a small neighborhood, not in the middle of uptown.  I definitely recommend sitting on the patio if the weather permits. The inside seemed a bit dated and stuffy.   Our waitress was very friendly and she knew the menu well (which I always appreciate). We went on a Wednesday, so the wine was half-off! The selection is limited, but I enjoyed the discount.    I definitely recommend this place. The chicken wings alone are worth the trip.  The restaurant is also located across from the new baseball stadium for the Charlotte Knights. Stop by before or after a game!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7KnJi1ctQbHvHYAZcfZ1jQ",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Salt and Pepper Chicken Wings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7KnJi1ctQbHvHYAZcfZ1jQ/o.jpg"
      },
      {
        "img_id": "Cpwx2ZYBVldXzSMcKyPSgw",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Greek fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Cpwx2ZYBVldXzSMcKyPSgw/o.jpg"
      }
    ],
    "user_id": "pvE2Z9B7ouoYY_mW1qzT1Q"
  },
  "XllxcbNVHvk7kQj_ulcQGg": {
    "date": "12/22/2017",
    "text": "It's 9:30 on a Friday night uptown. My boyfriend and I were walking around looking for a good spot to stop and eat. The hours say until 10, so I assumed that we had time to order food. As we were being seated by the host, the waitress loudly said \"Are we still serving food?\" Hint number one that she clearly didn't want to be there. As we sat down, she looked over and rolled her eyes. Hint number 2. At this point, I decided it was time to leave and I made sure to let the host know why as we were walking out the door. It was my first time here and I was looking forward to trying the food, but sadly, she ruined it for me and I probably won't be back, horrible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "akKWkunkl9KM7AJ6mpx5vg"
  },
  "r6lyximZTajSkdB7U-wOKA": {
    "date": "8/26/2016",
    "text": "Fast and great service... Good bar/Greek food... Great music selection... Will return",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yQFjxJ0z-gKwDdSR0n57Iw",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Steak burger with fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yQFjxJ0z-gKwDdSR0n57Iw/o.jpg"
      },
      {
        "img_id": "sn9prTOvcvotqaWsci64iQ",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Salt and pepper chicken wings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sn9prTOvcvotqaWsci64iQ/o.jpg"
      },
      {
        "img_id": "tS2mtixFy2SeSWdQYb8euw",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Chicken quesadilla",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tS2mtixFy2SeSWdQYb8euw/o.jpg"
      }
    ],
    "user_id": "Zk4l0en7h8ChooGnQFZhXg"
  },
  "NtJYnfXXzGCPw3RnQzIDMQ": {
    "date": "5/31/2016",
    "text": "Ok so we stopped here after a walk in Charlotte. It's not bad. First let me say if you want friendly service this place is probably not for you. If you want a good burger than your in luck. It's inexpensive and good. We sat on the street which was nice. The fries were a little spicy so if your stomach can't handle a little spice then avoid the fries. All in all, I give this place 3 flushes. The service could have been a little better.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "boye8_mRbZ7wmyDTgfVK7g"
  },
  "_QjWspQ8RQZU4DtadXnIDw": {
    "date": "9/29/2015",
    "text": "Food is good for the low lunch/dinner prices.  Service is excellent and location is excellent.  I have no idea why I haven't tried this place sooner.  I ordered te London Broil and I was pleased.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1jbAZCXnpbO1GmjhXvO7Ew"
  },
  "WYMGB_8zsoTh4E_6ZtXoQg": {
    "date": "10/22/2016",
    "text": "My wife has been craving a Monte Cristo so we found this little dive. Nice place, staff was very nice. My girls each got a Monte Cristo sandwich and my son and I got a steak sandwich. The sandwich was good, but my recommendation. Some Salt and Pepper or some other seasoning. The Monte Cristos was pretty good, but not what she was looking for. The search goes on...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IyrjxKqxICLGEJ-CcVvCPA"
  },
  "_x-odtpx5tICOg9upSgDJQ": {
    "date": "5/30/2016",
    "text": "Not really sure why they call this place The French Quarter. Nothing about the menu items say Louisiana or French Quarter. The decor has slight hints of Bourbon Street. My family ordered the bacon burger, chicken fingers, and a Greek wrap. No real kids menu.  The food was very tasty, waitress was very cordial. Nice place for basic bar food.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P3GGU17nRPTvqP7RYZ6zqQ"
  },
  "dT75cJ-1QOxB0Q49bIhNhA": {
    "date": "2/5/2016",
    "text": "A co-worker and myself stopped her for lunch.  After inquiring about the daily lunch special, we decided to order it. When our food arrived the lunch special was not as the waitress had described. She then got mad when we had told her that this isn't what we ordered and she was very rude. As a part owner in a restaurant myself her attitude and behavior was unacceptable towards the paying customer.  We decided to just pay for it an leave. The bald guy at the register was very rude and was not friendly at all. He has no facial expressions when you greet him or will ignore you when speaking to him. All in all bad experience will never go back due to the rude staff.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "74cGq7BPtKjKe8YMyaj-6w"
  },
  "HFWyuIjNIeKINqP-i2yvhQ": {
    "date": "8/27/2017",
    "text": "We were just walking around Charlotte visiting several bars and saw a Chicago Cubs flag on building a block down, being from Chicago I wanted to check it out hoping maybe it was a Chicago or Cubs themed bar. It wasn't very busy and we sat at the bar. We ordered 2 vodka and soda with house vodka. I asked the bartender if this was a Cubs bar and said no, I mentioned I found it odd since there was a Cubs flag out front, she stated she had no idea about the flag. She honestly had no personality, typically a bartender will try to engage the customer in a little talk, unless they are busy of course, but all she did was serve the drinks and walked to the end of bar and just stand there until someone needed something. We finished our drink and asked for our tab. It was $12.50 plus tax for each drink, we were shocked my gosh it was house vodka. A real rip off.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8WH9UGeFtDHzHPvK5HoylQ"
  },
  "s9NrjmeIJxsf0133GJZ1sQ": {
    "date": "6/18/2016",
    "text": "Went on a Saturday afternoon.  10 people in the whole place with 3 servers, but impossible to get a glass of water. Food OK.  Got the London broil sandwich but would not get it again.  Decent bloody Mary.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DcMgYpNEVUa4BrSdd4jaWQ"
  },
  "RUWdg7wwwrVupOuudfhkcw": {
    "date": "9/17/2016",
    "text": "Great local bar with very fine bloody Mary's and a very welcoming and able bartender.  Great vibe.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HfORoc5ilYMOiVIWxH7BRA"
  },
  "5L-g_NQRBtzPJvihj9_1eA": {
    "date": "7/24/2014",
    "text": "Very confused by this spot.  When I lived up town (2012), I remember this place being very different.  The location is so so amazing so I hope they really step their game up. They are right across from the brand new park Uptown.  They advertise their dishes to be \"comfort food with a touch of cajun\" but that really doesnt come through at all.  It is simply a Greek restaurant called French Quarter.    Having said that, they do have very good daily lunch specials and numerous local beers on tap up at the bar.  I have stopped in here a few times for a quick lunch while at work and ordered the chicken tips.  The best part was the gravy.  Everything else... so-so.    -Ian M.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KsK2VrCDys9hzpT5JMkkNw"
  },
  "JhOkzvuOaT5GuMjE5v4Sug": {
    "date": "10/11/2011",
    "text": "A friend and I stopped in here earlier this year during a festival uptown.  The place was packed but it was sort of between shifts so we were seated quickly.  Our server was great and very efficient.    The food is typical bar/pub fare, nothing I would really consider to be associated with the real French Quarter but what we ordered was good food but nothing you couldn't find any any other neighborhood pub.  But the prices are very affordable here, even for the drinks are affordable and they don't try to be pretentious here like many other places uptown.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "-7fKMFHwhDJnATitVXoRvw": {
    "date": "4/10/2016",
    "text": "Wasn't overly impressed with the food or beer selection. Being named \"the French quarter\", my husband and I were expecting French inspired food. It's run of the mill pub like food. I had the grilled chicken gryo that was ok and my husband had the corned we'd sandwich. Both looked delicious as they were served to us but there wasn't much in the way of flavor.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhbSzQfGKkB7_CON8ShmWw"
  },
  "bZTjKZoud2WY8ufHQwtHDA": {
    "date": "9/27/2015",
    "text": "Love the area this restaurant is located.  Unfortunately we didn't get to spend much time, but will definitely plan to do so when I return to the city. This restaurant was okay.  The food was pretty good. We sat outside amongst smokers...unfortunately.  The inside appeared small and extremely casual.  The waitress was very friendly and helpful with providing the popular and her fave dish on the menu. I ordered the gyro and ate it all! The fries were pretty good too.  They say they have the best burger... I will have to put that to the test next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CQg84-mqDgnMCeaA7dGMlw"
  },
  "Jk_kpVRdMI0PEcm4d8K-Qw": {
    "date": "5/3/2016",
    "text": "Food was very good. Service was friendly and fast. Great draft specials. Prices seemed reasonable. Also, this place is located in a very nice area. Would recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XklmGyWQfa3a04ibKvjMqg"
  },
  "abZ3qHDhGde9nboEtZfgag": {
    "date": "11/16/2016",
    "text": "Stopped in for a quick lunch and beer with a friend. They have specials pretty much any time you are there for food and drink. They also have  different food specials for each day of the week. They are all listed on the menu so you can plan ahead if you want to try something out. We went on a Tuesday and the specials are new Orleans themed. I expected this place to bigger but it is pretty small, though can fit a lot of people. It was pretty quaint though. I was a little disappointed at the menu options. This is mostly a salad, sandwich, and burger place. Our server was very attentive and friendly. The staff sat us right away as well and they were super nice too. Food was ok but I just got a club sandwich and fries. Friend for a burger and salad and said it was alright too. Would come here again if looking for somewhere fast and close, but I'm new to Charlotte and have so many other places to try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KHbnJXr3gx4-JfI5U00YCg"
  },
  "rzNjuUlni_VTeBrkIGfFeA": {
    "date": "2/17/2019",
    "text": "I think this is your typical bar food and could improve some of the quality. The ambiance inside is cool but comes across a little dirty at times",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "23ru7_FeiKitUEbwCnuSeQ"
  },
  "mdo_jToxYIbMmTB0KRajOA": {
    "date": "5/2/2018",
    "text": "We were greeted by a happy wait staff and treated to a free beer -for a tip- and were able to get a table outside in just few minutes.  My friend and I ordered the London broil pita tziki sauce-recommended by our waitress. The meat was very tender and the entire meal was great! Will definitely be back!  Oh and the ladies room was neat and clean!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4p4EvAaKxD03gH2V8NAt-g"
  },
  "YGabexTYtY0d8CDne-u1Cg": {
    "date": "5/22/2018",
    "text": "Good food, great staff, good prices! Got the portobello sandwich with an extra side of tzatziki sauce to dip my fries in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vlhng-D0BXblW3PpVypQBg"
  },
  "3EAc77gbnQUPxaOeh_3FbA": {
    "date": "3/28/2016",
    "text": "Eh nothing crazy here. I came to French Quarters on a Friday afternoon for happy hour last week for the first time. We asked to sit outside and were provided menus. We were just ordering drinks, but I glanced over the appetizer menu. There weren't many options and not 1 dip on the menu!! What!! Dip is life! But like I said, we were only getting drinks.   They had HH specials- $5 house wine (originally $6) and Moscow Mules for $6. Our server didn't come to our table for about 15 minutes. She didn't seem too interested in working. We all ordered the mules and a glass of wine, which took another 10 minutes. I don't mind waiting, but they were not busy. The drinks were good- the outdoor area is nice- not sure if I would return. I'd pick Valhalla over French any day. Hands down.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "EtFYEN0sbxkZOOt3DE7vWg"
  },
  "KE2SuXhbttlWr6fA8t_cfQ": {
    "date": "4/8/2018",
    "text": "Very cool hole in the wall bar. Our server was very friendly and the food was delicious. I had the po boy sandwich. It was yummy and the cajun sauce was the exact amount of spicy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qfeSW466X3KudeTTTo9rcA"
  },
  "XraqTNNHE_cOgkpJhbP1mg": {
    "date": "3/24/2018",
    "text": "It's good - the food is especially good, and reasonably priced.  If I have an issue, it's with the service - inconsistent and hard to predict.   Appetizers and food come out at the same time, so you end up with a table full of food that you have to race to eat before it gets cold.  The food is actually good enough that I put up with the service - so, it's definitely a keeper, just don't be surprised when things go a bit off the rails...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5l81-VVaykyvfW85Mt6kLw"
  },
  "b0xlv66a0QrHlcXeB1Jh7A": {
    "date": "8/4/2018",
    "text": "We walked in at 10:40 and sat at a table right next to the bar. Waiters and waitresses walked past us repeatedly and we finally went up to the bar to get our drinks. At 11:02 I went back up to the bar to inquire about getting food and was told they stopped serving at 11 to which I replied to the bartender that we had been sitting at a table right across from her for 20 minutes. She called out somebody's name and I told her not to worry about it cuz I was so pissed off with her attitude she also mentioned that they are not a 2 a.m. bar, and with her attitude I could see why. The owner or manager came over a few minutes later and offered to buy us a shot for our troubles. At first we said no but then we were like screw it. I doubt I will give this place a second chance as it was obvious the waiters and waitresses did not want to serve us. They did wait on a table directly behind us and quickly got them menus and served them. Just overall crappy service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FeCsroX40iVjMWi3IIOvoA"
  },
  "y1iL1QT5zQajX8SZvMO69Q": {
    "date": "11/8/2017",
    "text": "The best part about this place was the great service. The owner, his son and our waitress were extremely attentive . The food is definitely on the heavier side but it was good. I would definitely recommend trying it. Its a small place but it has a line out the door on Sunday. My boyfriend had a fried sandwich and I had their version of the Reuben. The prices were extremely reasonable. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cxjqM4Ps4FSrK3Jmgi1vqg",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cxjqM4Ps4FSrK3Jmgi1vqg/o.jpg"
      },
      {
        "img_id": "UiLpyJY_QfIEtd0Lk-_72A",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UiLpyJY_QfIEtd0Lk-_72A/o.jpg"
      }
    ],
    "user_id": "yI84m9JznF40H4PNXrm0_w"
  },
  "5H33_vOpcii9nKxaoph3Kg": {
    "date": "12/31/2016",
    "text": "Visited for a quick meal before the Belk Bowl.  Service was great.  The Host was right on track getting us in and seated as soon as possible even though it was a game day crowd and they were extremely busy.  Our waitress was good and friendly.  We had 4 people in our group and we had a variety of burgers and sandwiches and everyone was very pleased with the quality and taste of the food.  Corned Beef Sandwich was excellent.  Only complaint in the whole meal is that the Burger Bun kinda sucked.  Crumbled and fell apart.  It was a great tasting burger too so it made me sad that the bun sucked.  I'd recommend this place.  They had a great beer selection too.  I had a Jalapeno Pale Ale from Birdsong that was pretty unique.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Tt1dTSOElHOhyJXKvmoWtQ",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Tt1dTSOElHOhyJXKvmoWtQ/o.jpg"
      },
      {
        "img_id": "3GKDx7iKDgCORC3APF9Liw",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Cheeseburger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3GKDx7iKDgCORC3APF9Liw/o.jpg"
      },
      {
        "img_id": "xbHxxrm68J0cntQf23tszQ",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Bacon Cheeseburger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xbHxxrm68J0cntQf23tszQ/o.jpg"
      }
    ],
    "user_id": "TlgI6AkLasd8f4cXkK4xbQ"
  },
  "o2hDkNipuw10TGTLTKlIEA": {
    "date": "7/23/2018",
    "text": "Really fantastic lunch specials during the week! I went today and had great spaghetti and garlic bread (comes with tea too!) for $7.75. Honestly, for Uptown, that can't be beat. My friend had the jalapeno burger and it was also delicious. This place has the best fries. And homemade ranch dressing that is also very good. For uptown it's quick, reasonably priced, and of great quality! I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vce-6Mgk1QKmfELEAmNM2Q"
  },
  "HtEYjcADAKle8nW12khnfQ": {
    "date": "7/10/2015",
    "text": "Visited on a Friday for lunch to try their blackened fish and it was just ok...nothing special.  What was worth the visit was the RED BEANS & RICE!   It was delicious and we would go back just to eat that again.  I ordered the chicken pita with fries and it was ok, nothing special either but I would get it again if I had to come for lunch.  The crab soup was not the best, but the service was fast and on point.  It is worth maybe giving this place a second shot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3Qze3a6u7q_0hYwXJCycjQ",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3Qze3a6u7q_0hYwXJCycjQ/o.jpg"
      },
      {
        "img_id": "g1YA0DFEDykojYd_g3uEtQ",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/g1YA0DFEDykojYd_g3uEtQ/o.jpg"
      },
      {
        "img_id": "ACtf7a64AAuMG4OHZq6OIA",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ACtf7a64AAuMG4OHZq6OIA/o.jpg"
      }
    ],
    "user_id": "vW1kHIcXk8ZWIlkXj9qKIg"
  },
  "Dfxzt9TuwZb2poAi6bXuNQ": {
    "date": "11/10/2017",
    "text": "Really chill place, good service. The name is misleading to be honest- it is more Greek than Cajun. Still, we had a good time and will likely go back. Good beer selection, we didn't try the food, maybe next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kce-SJA1tmxb_uRGAsHbew"
  },
  "TTFKFAjOj4EtGingVYZfHA": {
    "date": "6/1/2018",
    "text": "Was here for lunch. On principle, I absolutely hate restaurants that make you wait \"until your entire party is present\" before seating. I think it's obnoxious and pretentious. Especially for an establishment that's really just glorified bar. And equally especially if it's just lunch and not busy. (At least 3/4 of the tables were empty). The food was ok. They got my order wrong twice. Waitress had to prove to the kitchen that she placed the order correctly by showing them the ticket (apparently they don't believe their staff.) The only reason I gave this three stars instead of two, is the waitress - she was very sweet and apologetic. I likely won't be back - so many other options.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWrTNeqCFPzerg2xQKjEZw"
  },
  "EVfZVmY-tgYyB032CLMHvA": {
    "date": "9/19/2017",
    "text": "A great little restaurant with quick service, a great spot for lunch during the work week. My favorite items on the menu are the steak sandwich (to die for) and the she crab bisque which they have on Fridays. The salads are simple but still very good. I would recommend for a quick bite to eat but definitely not for a nice dinner out. The bar area is also very small but old school and gives the entire restaurant a cool vibe. Definitely resembles an eatery in the New Orleans area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8Ia8e6wLJ45ByYTXM1YNw"
  },
  "J-48BqzPZ7kdwAa_xLj8Uw": {
    "date": "9/30/2017",
    "text": "Coming in to enjoy a leisure lunch with my wife and left completely disappointed.  We ordered the gumbo only to have the server explain to us that the kitchen guys said they were not making gumbo today. Ordered the Monte Cristo and clearly asked \"does this come with fries\" told yes. Sandwich comes out with fruit. When I ask the server where are my fries she replies \"oh you wanted some fries\". She then brings out the fries and CHARGES me for her mistake. My wife had the chicken quesadillas. Not a great selection at all. Not a lot of flavor. Just cheese and chicken. When it was time for our bill, we alerted the server to the issue with the fries and she acted totally clueless. We thought we may have found a diamond in midtown Charlotte but what we found was a cubic zirconium. If you are looking for great New Orleans style food, DON'T eat at the French Quarter, eat somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ROzbmJSZRF2cuV1_BgDBFA"
  },
  "O61NuP13uWc4LM11Yrs1Wg": {
    "date": "8/7/2017",
    "text": "I recently started working uptown and I wanted to find a local place to hang out  after work some nights, I found this little gem.  On the corner of Brevard Court and Church Street, this place is simply amazing!  I'm on a budget, so 3.50 pints on Thursday night is exactly what this girl was looking for.  The bartender, Libby, knows what I want when I walk in and I've only been there few times.  Great service and excellent prices!  I love this place!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n13yLog03Eu_427Mk-5XkA"
  },
  "AqzV9PXxHcOitoja4i0hig": {
    "date": "6/23/2016",
    "text": "We stopped by for dinner on a Wednesday - pretty quiet inside. We were intrigued by the Beef Tips special on the board outside, as we enjoy some New England Steak Tips and thought this might be similiar - wrong. Turned out to be  more like stew beef over rice, not what we were expecting but also not notably tasty. It was served with big broccoli stalks randomly covered in cheese - also not my fav. The saving grace of this meal was the Salt & Pepper Wings. So good! I asked for a side of hot sauce in case they were bland but it wasn't needed. Super crispy and tasty, I might go back again just to have those. The wings saved this from being a 2 star adventure. Service was OK, could have been more on-point given how slow they were that evening.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bbyfh_r6niYXuTpSaE4FxQ"
  },
  "eA2-nCHBnE_K41zjhtO6dw": {
    "date": "9/7/2017",
    "text": "Okay so My family and I are out enjoying the Romare Bearden Park Sunday around 9:15 p.m.and decided to grab a bite at my Favorite pizza joint. No way. The restaurant was closed so we strolled into French Quarter. Very tight when you first walk in. We were immediately greeted with a warm smile from the bartender. We were seated in the back where we could see the fireworks from the baseball game. Ordered Wings and the Monte Cristo. The waitress was nice. Food came fresh! Best Monte Cristo ever. Wings very crunchy. Waitress not very attentive after that. Matter of fact she never came back. Poor service Great food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5r2Va0_BNjeHBiCGOF49Fw"
  },
  "D-fI8W0OoNE_QQTS7oeZCA": {
    "date": "11/11/2017",
    "text": "The French Quarter is the worst restaurant I've ever eaten at in my entire life. The half pound burgers aren't half a pound. The fries weren't good. The jalapeno poppers were still frozen in the middle. I guess the microwave wasn't working very well. They didn't have 2 out of the 3 soups featured on the menu. The Greek salad was very mediocre. Our server didn't serve us. He was busy hanging at the bar and watching tv. We had to get up and go to the bar to give our order and had to do the same thing with our check when we wanted the change.  I've hung out here at the bar before and it was great but whatever you do, don't eat here. They only serve food gratuitously. It's not something they really care about. Quality is horrible. Anyone who says the food is good here doesn't get out much. My expectations weren't high because it's bar food but don't waste your time or money eating here. There's too many places uptown that care about your dining experience to patronize this place for anything other than the bar. Stick to drinks French Quarter. You suck at food- you can't even do bar food well.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iLLOvsUduPZs7P3ld_zaCw"
  },
  "FqrndyfDyGSWZl58NT8QPA": {
    "date": "9/12/2014",
    "text": "Came with with friends during lunch. Very busy with short wait times. Very loud too. Difficult to hold conversations. Seating too close together.   Waitress was polite and very attentive. I had the Friday special- salad and cup of lobster soup. Very basic. Soup was mediocre. Definitely not homemade.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eBoyunRiJb-QzwQbv1-1bw"
  },
  "7YCamwHW9ZvNJkl5r3Sang": {
    "date": "7/22/2019",
    "text": "We stopped in for a lunch while in town it was extremely busy because of the event in town for the soccer match and the park across the street the Romare Bearden Park with all the actives for the match. We got seated right away and the waiter was very busy but acknowledged us then was right over to take are orders we both ordered the Gyros plate with fries. The Gyros plate come with a pita for the gyms meat and served with fries, everything was good and fries were very very good! Serves was great especially since they were so busy, not a long wait either, place was very loud but we knew that with it being so busy.  The decor would make you think you were eating in a pub in Europe very cool place.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_RYVN2fKWZ_pgWXTL7Ykcw",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Gyros plate with fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_RYVN2fKWZ_pgWXTL7Ykcw/o.jpg"
      }
    ],
    "user_id": "v73Wcorml6AXZlBbCYLq8A"
  },
  "o1Qp6FzAjVeDXfxnRmXUxQ": {
    "date": "5/25/2019",
    "text": "This is a lovely place. We came here during the work week for lunch. Fortunately we got here early because by the time we had ordered, the line to get in was out the door.  Our server was a very nice woman who had worked there 20+ years and it was apparent that she loved her job and loved her customers. She was elated, in fact, that it was our first visit there so she excitedly explained the menu to us. While we were waiting, a gentleman at a nearby table told us that he was a regular there and made some recommendations. I loved the small town feel of the restaurant how everyone knows everyone and you're greeted with a genuine smile.  Food portions were plentiful and I have to say, this was a welcome surprise in the midst of the uptown business center.  This is definitely a place I would like to visit whenever I am in uptown for business. Food was seasoned properly and cooked exactly to perfection. The chicken here is to die for. 'Love this place!  I can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TsKeGaVVmS2lS6bks5ZLw"
  },
  "scoiQ8Ru2I3VQWmfMLVLrA": {
    "date": "8/15/2019",
    "text": "It's been a while since I've been here and I came in for a late lunch today, around 1:45pm. It wasn't crowded so my coworker and I were seated immediately. We both got the Thursday Baked Chicken special that was advertised on their sign outside. Service was incredibly quick and I swear our food came within 10 minutes. It was great because I was starving! Food was delicious and I definitely got hit with food coma afterwards. Paying for your check is done at the bar near the front door so you can get up whenever you're ready.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kTuSYemeuJ6dGFH_KZjwpw",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Baked Chicken Thursday Special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kTuSYemeuJ6dGFH_KZjwpw/o.jpg"
      }
    ],
    "user_id": "5TnAqnaiUl_cwYYHrIV78w"
  },
  "oEGQbsqgx8PAY5p_E3q2fQ": {
    "date": "8/28/2019",
    "text": "Fast service, good beer selection including locals on draft. Burger was well seasoned (ordered it \"spiced\"). Chicken quesadilla was a tasty appetizer. The grilled chicken was decent as well. Only complaint was the burger was a touch dry and took a while to get our check.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HmwTFXzGpLp-3NLtv0okVA"
  },
  "i9XeJr0ka4BoyVwOI1KQrA": {
    "date": "2/17/2019",
    "text": "We walked around a bit and ended up here because it didn't seem crowded which was a plus. The food was okay the server was nice, very delicious fries with seasoning. The wings were just okay nothing to rave about but good food to eat.   But putting the food aside let me tell you that bathroom was so clean. And smelled great not to mention the soap smelled just as good as the bathroom lol. I know that's weird but a nice clean bathroom in a restaurant or bar is a wow for me, because of the traffic it gets",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LlxrhIjLd1PNYVK9ys3AZg",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LlxrhIjLd1PNYVK9ys3AZg/o.jpg"
      },
      {
        "img_id": "CdKvxofIW87LfdOEDSpFjw",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CdKvxofIW87LfdOEDSpFjw/o.jpg"
      },
      {
        "img_id": "td_abSP5UVhlITudVk2SCg",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Plain wings with buffalo sauce on the side.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/td_abSP5UVhlITudVk2SCg/o.jpg"
      }
    ],
    "user_id": "4qYuZmlndclYBVy7o_xokg"
  },
  "m99aS2qwR44L8MJw_Ii7Lg": {
    "date": "5/12/2019",
    "text": "Every time I visit here I order the Monte cristo so I may be biased by saying it's the best thing on the menu. My husband loves the gyro and ordered the mad Greek which as he puts was v good. We ordered light beer and hung out for a bit before enjoying the Charlotte Shout festival. This is also usually one of our stops on the St. Patrick's bar crawl and it never disappoints.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4HnBtvmOqC6oE0XCOI635Q",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4HnBtvmOqC6oE0XCOI635Q/o.jpg"
      },
      {
        "img_id": "sSrGFaOfdS75-ORV5Sjufg",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Monte Cristo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sSrGFaOfdS75-ORV5Sjufg/o.jpg"
      }
    ],
    "user_id": "lpcYAvuU6ljcJ7jtFUE_Tg"
  },
  "27cxavA4GF9iCvQA0IA0dQ": {
    "date": "5/19/2019",
    "text": "3 stars because it's okay, but not anything special. My boyfriend and I were visiting Charlotte for a few days and decided to check it out. Fun atmosphere and great location for sure. Prices are moderate, service was okay. I ordered the portobello mushroom sandwich and my boyfriend got the London broil pita. Both meals were tasty but not outstanding. Fries were underwhelming. Worth checking out and sitting outside so you can people-watch since it's a busy and happening area!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sYpbqcE70naz-Zemr2ZN4g"
  },
  "hlTFN22mHwQ4qNouVHCLCQ": {
    "date": "6/1/2019",
    "text": "Great place! It was a busy day but the bartender was still so calm with us and nice!  I really appreciate that! I will def be back again! I had a Cajun chick wrap but I substituted portabella for chicken! Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j7MO14T45ho_zcWLiazJ5A"
  },
  "T4uffbAOYgX6aAqFNh0XcA": {
    "date": "7/10/2018",
    "text": "French Quarter was a little dark and divey but it has character. It's an older bar, but was a great place to go and watch the World Cup. Even though they were busy, the service was still great! They have a lot of local beer and a typical bar menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PyUQkVgBMj69d-yWdqA4Gw",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PyUQkVgBMj69d-yWdqA4Gw/o.jpg"
      }
    ],
    "user_id": "2NKOI38yFcoAWkDEBZDq1w"
  },
  "7T46wYuF3ndv6bu8EJvMgA": {
    "date": "12/10/2017",
    "text": "Was uptown Charlotte, going to a show, and wanted a quick bite.  Unable to decide, and this place not showing up on Yelp, and other search site.  We were on our way to one place, then I saw the blue awning, and decide to go to the French Quarter.  The place was hopping, and we were seated quickly .  Service was good and so was the food.  Why the four stars is because  of the owner and his son--really nice people!  They take a lot of pride in their place, very personable, greeting everyone. It was warm and inviting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g_18R3yrD5vPXoOqMweW8Q",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. French Quarter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g_18R3yrD5vPXoOqMweW8Q/o.jpg"
      }
    ],
    "user_id": "SVndZxvQAnZ59AT9xLckRg"
  },
  "WQ4ly5ko_1hpKi9er-_00A": {
    "date": "4/22/2017",
    "text": "Excellent Fare in a Friendly  Atmosphere  Came down to visit the Latta Arcade/Brevard Court and while we were here, to grab a quick lunch on a beaufiful Saturday. After walking up and down the venue and reviewing a number of tempting menus, we decided on French Quarter.  The narrow confines of Brevard Court does remind you somewhat of the narrow streets and alley of the French Quarter but the comparison stops there. Nothing on the menu to suggest anything from Bourbon St.  Still a nice Greek/American menu with something for everyone.  Walked in and were seated immediately and were given our choice of where to sit. We picked a table by the window overlooking College Street with Romare Bearden Park immediately across the street.   Both our host and server were great and efficient along with the young man I assume to be the manager.  From the menu I chose the Corned Beef Sandwich with Fries. The sandwich was excellent and one of the best I have had in a long time.  The French Quarter Salad is worth the trip itself. Large bowl lined with Pita's with and a mound of lettuce in the center and not just lettuce but a bounty of tomatoes, cucumbers, large fresh Croutons and an incredible amount of Chicken.  My wife always complains to salad that are just about all lettuce and maybe one sliver of tomato but not this time.  Fun spot to hand out. With construction and  Jazz festival at the Park, parking can be a bear but we ended up in the parking garage next door.   Three of four blocks from Bank of American Stadium, one block from the BB&T Ball Park and within walking distance of a number of Arts Venues and Museums, this could serve as a good place to grab a bit when you visit downtown.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 12,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "ajP26hSVy6ygTqoBPRzKAA",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Brevard Court leading to Latta Arcade with French Quarter on the Right",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ajP26hSVy6ygTqoBPRzKAA/o.jpg"
      },
      {
        "img_id": "wQQrrS5UqJngTYIfq4Q_Mw",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Entrance",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wQQrrS5UqJngTYIfq4Q_Mw/o.jpg"
      },
      {
        "img_id": "MBIFyJ8FLst13sNCTm3c3Q",
        "caption": "Photo of French Quarter - Charlotte, NC, United States. Outside Dining",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MBIFyJ8FLst13sNCTm3c3Q/o.jpg"
      }
    ],
    "user_id": "GGTF7hnQi6D5W77_qiKlqg"
  },
  "fIkAszoSKlgVcSbgAW2jLw": {
    "date": "3/23/2019",
    "text": "The burgers are great! Hearty. I had the mushroom. My kids had the jalapeno and the bacon burgers. The beef was juicy. I asked for it spiced.  I am glad I did. Total home run! I'll be back to try other menu items.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nv0XZPzysLgNKfZ-ofH6kw"
  },
  "gyBfYM-fzpbdT4tdbld8wA": {
    "date": "3/7/2019",
    "text": "Baked chicken lunch is outstanding even comes with tea. Can't beat the price, usually I don't like baked chicken but this was absolutely delicious!! Potatoes and broccoli were great too!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LruRPzJ1nOS3_04LV1HAUA"
  },
  "pMeP4UipEzdPo_4h6qzw1w": {
    "date": "10/25/2017",
    "text": "Closed super early like 9pm on a sunday... and plenty of bars were still open for drinks and football. Average food meh drinks.  Food 3/10 Service 2/10 - Heather is great! Parking 1/10 Location 9/10 Music 3/10  Would pass and go to the other bars in the quarter",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LRgGFFhWOc1PlNKKeTGKgQ"
  },
  "6vOXUAG6ciUNAEGB38QQ6Q": {
    "date": "3/31/2018",
    "text": "My husband and I visited the French Quarter a few weeks ago on a gorgeous day outside. We went for an early dinner, hoping to avoid big crowds -- it worked! We were able to get a nice seat outside and enjoy the beautiful weather. The staff was friendly. No downsides to that.   The three-star rating is really all about the food. My husband got some salmon which was beautifully cooked, however, the rice he got on the side was completely flavorless. The beans in that mix as well or underseasoned. I ordered the Cajun pasta with chicken. They did a great job of blackening the chicken, however, again the rest of the dish was underseasoned. The sauce was too runny for my taste and overall I felt that I could have made that same meal or better at home.  I think if you're coming here, you're coming more for the atmosphere and the bar. You won't find a gourmet meal at the French quarter. I think we expected this, but were still hoping for more with the food. There are plenty of other Cajun restaurants that would trump the quality of the French quarter.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "poFYRAnPpvrLaYJSZ3lvrA"
  },
  "7BIE4bznke7qOBLQtmJ9_A": {
    "date": "11/19/2018",
    "text": "This place has been a staple of my weekday lunches, particularly the baked chicken special on thursdays. Great portion with a quarter of the chicken white or dark, mashed potatoes with awesome gravy and broccoli which comes with hollandaise. I usually tell them to leave it off since I don't care much for it. Honestly this special is so good that it's the only thing I order here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eoT6J9-w3MGrRZxPQlJGxg"
  },
  "DHoWN_Vprq1k7vSGW2RjDQ": {
    "date": "8/5/2017",
    "text": "Hanging out with friends in Uptown and decided to stop in for food, drinks and reprieve from the Charlotte heat.  We were greeted immediately upon entering by a very nice and pleasant bartender who directed us to seat where we wanted.   After being seated, our waitress came by to offer water for the table and take our order. Great start so far with service and hospitality.  We ordered 2 hamburgers one plain and the other with bacon cooked medium. Nothing worst than having a dry burger. I personally ordered the steak sandwich with a salad and Stella's for the table.  We weren't happy with the burgers coming out more well done than medium but they weren't horrible either just a burger. Our waitress mentioned the burgers are typically made medium unless otherwise requested. The steak was also ordered medium which came out more well done so it was a little chewy. Otherwise our meals were fine and the fries with the burgers were apparently a hit lol.  Overall, we will give this another try since our service was great and good wasn't horrible. I have to mention my steak sandwich was served without lettuce/tomatoes although the menu mentioned it. We also had to get our own napkins but again the service was actually good lol.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "09KPCp9W_NalQga28aPd2Q"
  },
  "Zx_Gv5Bg0Qg01Go36wRQTw": {
    "date": "6/23/2017",
    "text": "Let's set the stage for my state of mind on my inaugural trip to French Quarter.   Some combination of delirium from hunger (I hadn't eaten a solitary real food, unless wheatgrass and jerky are real foods)  and general anger from having to work an actual full day on a Friday compelled me to wings.   I recalled a claim on the side of a wall at the latta arcade that this place had the city's best of those. Game on.   French Quarter is one of those places that's description will change based on whom you ask about it. Some will call it a quaint little spot in the heart of the city. Others, a cool dive with a solid gimmick. Here's my take. I walked in and immediately felt like I'd walked into a \"confederacy of dunces\" era speakeasy (literary reference game over 9000). Very old New Orleans vibe. A little dark, despite the huge floor to ceiling windows and open door, but that's what happens when you enter a place with that much wood and stained glass.   Let's talk service. There didn't seem to be a hostess or host to greet you at the door, and the bar was full, which is to be expected for a Friday happy hour. One of the wait staff - the little blonde one - saw this and made haste to seat me. The other one served me.   I always take note of how long it takes to get your order in, and from there how long it takes the kitchen to hop to. they were especially on the ball. I only had to wait the exact amount of time it took me to peruse the menu and make selections to put in my order    The food seemed to be out at the very moment the thought seed was planted in my head that I was waiting for my food.  It was out quick is what I'm saying.   I have to mention the steak. It was puzzling. Don't get me wrong, I was satisfied with it, but I have to note that they add this steak sauce. You're either gonna love it or hate it. Me? The first bite was remarkable, full of flavors that my brain wasn't ready to experience. I made an audible exclamation. Every other bite was conflict. I know I didn't dislike the sauce, but I also felt like I could very quickly grow tired  of it. I kept taking bites, compelled to come to a decision.  Long story short, I finished the steak.  The wings. They came out mid steak. It was at this point I noticed the sun. He was on the wall, cutting his eyes at me. He had an American flag print on his face and color changing lights. I don't know why that caught my eye, but I appreciate art installations, so bonus points.  The wings. Alright, so the claim that these are the best wings in the city is heard to quantify. I got their famous salt and pepper wings. They have some really funky bleu cheese dressing. To me, that's a good thing, suggestive of the house made quality of all the food. I'll admit, the crispness, the size, the flavor despite their simplicity (not to mention how well they pair with that funky funky cheese sauce) make these some solid A to A- wings, but I'll need a bigger sample size before I can crown them.   Definitely recommend if you're just looking for a nice place to share a couple drinks and eat some wings with friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mXM5Q3ZGMATqd9iv-YXx6w",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mXM5Q3ZGMATqd9iv-YXx6w/o.jpg"
      },
      {
        "img_id": "eSbcb8cTwlsrqtWUcVVLcw",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eSbcb8cTwlsrqtWUcVVLcw/o.jpg"
      },
      {
        "img_id": "qRmCjfrQ4xc9F05J1o9xBg",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qRmCjfrQ4xc9F05J1o9xBg/o.jpg"
      }
    ],
    "user_id": "sY3sHDwBDNwqxnImXXA-nQ"
  },
  "bBYAUwCbdbDgB0GFdDkOlw": {
    "date": "3/22/2018",
    "text": "Go here almost everyday for lunch, the service is quick and the staff is always so friendly! Tuesday's with the chicken creole is my favorite day to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "owC7XElbzDTX0mka_1dKdw",
        "caption": "Photo of French Quarter - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/owC7XElbzDTX0mka_1dKdw/o.jpg"
      }
    ],
    "user_id": "RPuFCkU9SV9MShZLJy6GpA"
  },
  "7Pf1mVOarY4rVRWL4nvJgg": {
    "date": "6/16/2017",
    "text": "We stopped by here for a quick drink and snack before the baseball game on a Tuesday afternoon. The outside area was crowded but we managed to grab a seat outside! It was nice weather and the waitress was attentive! We orders the London Broil Pita and the Monte Cristo with Greek Fries. The Monte Cristo was to die for, it is basically a ham and cheese sandwich deep fried topped with powder sugar! Definitely a different type of sandwich but so worth it! They also have a $3.50 Local Draft for the Happy Hour Special on Tuesday!   So bottom line, get the Monte Cristo Sandwich & a local beer!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JlTEv3ZAHTCDvt94fOjWOQ"
  },
  "67SWztM9COA7yQx2Sdu7rw": {
    "date": "12/16/2010",
    "text": "Went here on a football Sunday and I was told that the menu was reduced to be quick and more American. This was a disappointment to me as I would not mind waiting for some good French cuisine. I ordered the only traditional plate left on the menu, avoiding the burgers and fries... it was good but there are better places and better food. I don't know much about about French food so I was curious. The music was too loud an rappish (or R&B) so, although I dined alone, I would imagine it would be difficult to carry a conversation. The staff was friendly and service good but that is not enough to bring me back so I will not repeat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s6CBjsZqkf6pvAv0R5GQ1g"
  },
  "gCbrchFUZYJqACUIgTCjfQ": {
    "date": "6/23/2010",
    "text": "Dropped in for lunch with a friend while in Charlotte on business. Very loud, but good service and a very tasty Monte Cristo sandwich.. but very loud.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uf8KJbcR71hIPoq6nwnBlA"
  },
  "ke6p7ylJ2jrTJadrgQPWDg": {
    "date": "2/27/2010",
    "text": "This place is always packed at lunch so go early, late or plan to wait! Their weekly lunch specials are probably some of the best priced around. My personal favorite is Thursday's baked chicken w/broccoli and cauliflower and mashed potatos. Portions are large so ask for a box of you eat light. In the warmer months they have outside seating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RuvLkPnze0GFDuM1AvEoBQ"
  },
  "HJyFm4QZT3zF2HvNtvqyiA": {
    "date": "2/14/2013",
    "text": "Good food and fast service from friendly staff for lunch. My glass is rarely empty.  They have great specials for lunch everyday but my favorite menu item is the Fench Quarter salad.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hjOq68c6gRlfgHQKD69OrQ"
  },
  "q_-S6NGZXvSAQ_vQl3-uSg": {
    "date": "12/10/2009",
    "text": "I have had the baked Chicken (Thursday special) and it is WONDERFUL!. A great change from all the chain and fast food restaurants downtown. It does get very crowded and little awkward when it is that way.  The food comes fast and is delicious. I have only been here for weekday lunches, usually Thursday. My coworkers love the other specials too.  If you are looking for a change from the everyday, this place is a great one to start!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R_OBuIC2yBtn5jeOfI_vuw"
  },
  "UMFiVeNVoK8CUxar5EZl1Q": {
    "date": "5/7/2011",
    "text": "I try to go to the French Quarter once a month to eat. I wish I could go more often but I do not work downtown. The food is fantastic and the price is very reasonable. The ambiance is great, as it is in a courtyard and has good outdoor seating. I would highly recommend anything off the menu, but the tuna, hamburgers, Monte Cristo sandwich, and Greek salad are my favorite. I took my husband there as we were tailgating for a Panther game and he tried the hamburger and was licking the the packaging he said it was that good. One of the best lunch restaurants in Charlotte!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HpVm-yJUWBvarZAlo9_-xw"
  },
  "Ajzgqia8h58U1gVEvajPew": {
    "date": "3/27/2011",
    "text": "Visited on Friday 3/25 for supper. I was really looking forward to a good Cajun meal. Out of fish on a Friday????  Are you kididng? And, crab soup so salty, was not edible. The waitress, who was really good, did not charge for it after complaining. Rice and beans pretty good, and wait staff quite attentive. I really did expect better. Will not be going there again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9cwC-zXHHCu9Pjn3310smw"
  }
}