{
  "2rq8_Ah2kYBAd7zH6qOf9A": {
    "date": "11/23/2014",
    "text": "Really nice place. Great beer, including cask. Also, really good food. Only a few items to choose from but they are all done perfectly. Definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1g6fQ6WwI1o4jVzZMlqiAA"
  },
  "y6_KNkfrQcD7I1K00BRTZg": {
    "date": "1/23/2015",
    "text": "We went here for lunch and were utterly disappointed. I can't say anything for the beers, but do NOT order food from here.   The exterior of the building had all the looks of a chill hipster pub with the brick exterior and large industrial wooden door. The inside had a chill music selection.  However, the food was terrible. The chili tasted like they threw ground beef in tomato stew, while the hummus had no flavor whatsoever.  They could of got better hummus from Sabra. As for the potato salad, the potatoes were not properly cooked (underdone, and difficult to chew) and the actual potato salad was bland at best.  Overall, do not eat here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r7Sx3IsyeR75i9MGc4zA2Q"
  },
  "efCnNNr1H1xqk-DNce08hg": {
    "date": "9/19/2014",
    "text": "I was surprised when I was told that I had to try the oysters at Growlers.  It just didn't seem like the type of place where one would get raw seafood.  But I can honestly say that these are some of the best oysters around and they may be the best in Charlotte.  However, I definitely recommend sticking to the Canadian variety.  We had some of the sounthern oysters when they did not have the northern ones available. They were just Okay.  I can't say that much else on the menu appeals to me so I basically come here for an oyster appetizer and then move on.  The oysters have generally been well cleaned, but I did have one disappointing experience with a dozen. Perhaps someone new was doing the shucking.    The beer selection is not extensive but I can always find something that I am eager to slam.    My only real gripe is the seating.  It can be awfully tough to find a spot.  But hey, I guess that is a downside of being a cool spot that people want go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjTG24J-UT3vs2fuwTJ9vw"
  },
  "AG0eqeCo5l9njNaS4s_t3A": {
    "date": "8/18/2014",
    "text": "The flight of beer was a nice selection. I did enjoy the Jalapeno Pale Ale. However, the food choice was small and, while very good, didn't fill me up. I would go again, but have different expectations.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nKtsz0z3ewu8CoN2_2l7kg"
  },
  "CQyux24Q9xLAZFRPisB3_Q": {
    "date": "1/24/2015",
    "text": "Great spot in the neighborhood. Everything I've had is tasty as shit, plus they have Scrumpy's Ciders. Seating is a bitch though and standing anywhere feels like you are standing in a crowded hallway.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SQFraRaDIfpJ6-lPD9AuKw"
  },
  "4QP7qjhPTsqnSbws2fDRCg": {
    "date": "4/3/2014",
    "text": "$20 for a dozen Atlantic oysters on the half shell. Not too shabby, Charlotte! Jam packed on a Saturday night, but it cleared out a bit by 9:30 or so.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vT2ZGDysgDUDWd3m9xA06w"
  },
  "JRA4zgJI4WnEYMKo3D8uqw": {
    "date": "2/18/2015",
    "text": "Great place! Good ambiance, Great beer, you gotta check it out! Great bartenders and friendly staff, who can help you w/ your beer selections. Very knowledgable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dUvNutFPeLcgWZOSuXxcUA"
  },
  "klqhMetsacnW3CMqT_kF7Q": {
    "date": "6/8/2012",
    "text": "I really,really want to give a 4 star but the acoustics are deafening... and they weren't helped by the annoying cackle of a \"joyzee\" girl... I really don't mind loud places but WOW! Sound waves crash and ricochet...  The food is excellent bar food with healthy choices and great brews...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-v1I7ZE9qecJmSCSUo9wCQ"
  },
  "9FlOEeuy9qChdeDKtda3YA": {
    "date": "5/9/2011",
    "text": "I have to say- I love Growlers.  I especially enjoy Growlers on a rainy Sunday after brunch. It is the right setting for bad weather. It is the sort of place that you want to have a few pints and sit there for hours while discussing current events- or how much you hate the Fat City condos.  The food is absolutely delicious. My personal favorites: The beer cheese and pretzel appetizer and the homemade french onion dip. OMG. To die for.  The beers change on a regular basis- so you never get bored. By far the best beer selection in NoDa.  They have TV's- but the TV's don't feel intrusive. A touch of class.  The only negatives: Not impressed by their fancy popcorn.  One time (out of many) we had very bad service. It was SO COLD inside- yet the waitress insisted on keeping the door open. People kept closing it and commenting how cold they were- but the waitress didn't care. Horrible costumer service. Mind you, this is one time out of many that were fantastic.   I highly recommend it. Ohhhh- and the brats and oysters are also tasty!  FYI- I have seen a lot of children there during the day. This is nice because it gives a pub-like atmosphere to it. This is negative because you have to be cautious of not using curse words.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "aSiDSB43CPHwyE3LACuMvA"
  },
  "MApmgLANObOcHF-FUDvnTA": {
    "date": "5/4/2014",
    "text": "Found this place on a list of pretzel joints in charlotte, pretzel was good not great and actually my least favorite of everything we ordered.  Mustard was better than the beer cheese also.  This place shines with it's homemade sausages, we tried the beer brat and the sweet Italian both were fantastic and could tell they were homemade, they fell apart as soon as you started chewing them and they were delicious.  House cut fries were also very good, potato salad was ok but needed salt.  Beers we tried were good and service was excellent on a packed Saturday night.  Also recommend the root beer float shot.  This is a tiny little place but definitely worth a trip if your in noda.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dxzc-gfybDMmctqamPeWtg"
  },
  "O5j_upcYqNnKDDubBPV9lA": {
    "date": "3/25/2012",
    "text": "Came here recently on a Monday night.  It wasn't packed but it wasn't empty either; this was part of the allure as we walked through NoDa deciding on a drinking establishment.  Sat at one of the big family style high tables in the middle, and sampled some regional beers.  The bartender was very nice and brought us out several beers for us to try before deciding, and also gave us a basket of  complimentary organic popcorn.  I tried to order a food item of whose name I cannot recall at this time; but I was sad to learn that the oven was broken, oh, it was a pretzel!  I couldn't have a pretzel because the oven was broken.  This was sad.  All in all, nice vibe, laid-back place with a good beer list and reasonable prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eGniBrSezbr5ev7t-NXLnQ"
  },
  "63GZmpee_b6xbbE33tl2aA": {
    "date": "3/5/2011",
    "text": "Growlers Pourhouse Round Deux:  I swear that I didn't mean to spend 6 hours at Growlers today.  It just happened...but I'm glad it did.  After my last experience at Growlers I wrote a snarky and somewhat scathing review of my time there.  I don't know if all restaurant/bar owners (or employees) read Yelp reviews of their establishments but Growlers certainly did.  I promised Jeff that I'd visit the bar again and I did much sooner than he probably expected.  Here are the changes from then until now:  1) Upon first visit the beer menu board was nearly impossible to read.  First, the writing was much clearer on the board today.  The best addition is that there are beer menus printed out that list the tap number and the corresponding beer.  I noticed that one tap in particular had both the beer that was on tap and the beer that was in the on-deck circle.  Pretty cool.    2)  The waitress that I had during my first visit was surly, unconcerned and unknowledgeable about the product she was selling.  When I bellied up to the bar today MacKenzie was right on top of things.  She definitely knew her stuff and offered suggestions.  At shift change I was lucky enough to have Drew behind the bar.  Gotta say that he was considerably less attractive than MacKenzie but definitely spoke my language when it came to beer.  Both were the type of bartenders that should work selling craft brews.  Top notch all around.  I didn't see the server from my original visit during my long stay today.    3)  The beer was skunky and metallic tasting during my first visit.  In an effort to perform an experiment properly I drank 7 different beers (6 from the regular taps and 1 cask) to make sure that a good cross section of the lines were tested (a good excuse to drink more).  Absolutely no taste issues today.  I let Drew know that I was the jerk who wrote a sarcastic review of the place, etc and he told me that they were having some problems with the lines at one point.  Perhaps my first visit was during that time.    4)  OK, so maybe the homemade pretzels looked and tasted like Super Pretzels, but let me tell you that the hot dog at Growlers pretty much kills every other hot dog on earth.  Have you ever seen real meat juice come out of a hot dog before?  Right.  You haven't.  That's because you haven't had this dog.  I think it has 3 different meats in it (all real meats people--no snouts or holes in this sausage), which means that there's one meat for each meal.  That's right--this is the food for all occasions.  I'm not kidding.    If you read my first review you're probably wondering:  holy @%$#, man!! How could things change so quickly?  Maybe they didn't.  Maybe  Growlers had an off day.  Maybe my first server really was a teenaged Claire Danes.  Maybe the beer lines were having a bad day.  Who the hell knows.  All I know is that I spent 6 hours in a bar today when I had other things to do and I loved every minute of it.  Well, except the part where I saw how poorly Bobby Hurley has aged....  Jeff, Drew, MacKenzie, et al I loved my Saturday at your bar.  I'll do it again soon.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "05A1WpXkjCbVHCodTSc6sg"
  },
  "p5oqh9grVeTvswePl8Ptzg": {
    "date": "6/29/2014",
    "text": "Many of the NoDa businesses are friendly for women by themselves (waiting for those always late husbands) - Growler's is especially friendly and welcoming to everyone. We all wish they were open earlier on weekdays! That's why they don't get 5 stars. Try the chorizo tacos - economical and pretty much the best darned taco I have ever eaten. Simple and fabulous - spicy but not anything to scare the spicy-wary. Woo-hoo! Oh, other food is also good - they make the sausages there, and the coolness of that...very cool.  They carry lots of beer, I don't like beer. But their house wine is very good, and they carry stuff like Pimms so you can get your English Garden Cocktail on - I told you it was chick friendly!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jzTNpdn1hy8Nr6wooFy5SA"
  },
  "l5uZTTbrwsAyVmhiUwZhzQ": {
    "date": "12/11/2010",
    "text": "A five-star bar, a two-star restaurant.  As a place to hang out and drink great beers, this is the place to go. It's got great atmosphere with fantastic, difficult-to-find microbrews on tap. There's always something new to try and I don't think there's anywhere else to find growlers and cask ales in Charlotte. It has a great neighborhood vibe I love.  But as a restaurant, it just falls short. Sharing an owner and (I've heard) kitchen with Crepe Cellar, you'd think the food would be tops, but it falls short, not just of its sister restaurant, but of bar food in general. Service is slow and just not on top of things. The last time I went, we ordered the hummus and two paninis. We sat there for more than half an hour before the food showed up -- the hummus along with one of our two sandwiches. We sat there for another 15 minutes before the second sandwich showed up, missing the bacon I had requested. The server offered to get me a new sandwich, but by that time I was starving and ate it anyway. The food is decent, but nothing special, and served in paper baskets instead of on plates, which detracts from the atmosphere and is wasteful, as well.  Next time I want to grab a drink with some friends, Growlers will be on the top of my list. But when I just want to grab a bite in NoDa, sorry, but it isn't going to be here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "uIu2oifqdP1VJe7bYLJ6ug"
  },
  "iPomjUih-kI6GgcpwX2vbQ": {
    "date": "11/29/2011",
    "text": "Service here has been very spotty in the past. It can take awhile to get the attention of the bartender, and they often have to run nextdoor to get different types of beers etc.   The prices are also a bit ridiculous $19 for two pumpkin ales?! I mean the sugar-spice rim is amazing and all but wow these are wine prices!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "0NfBUoifA6qYvGXaYJDQ5w": {
    "date": "3/28/2011",
    "text": "Cool joint - love the NoDa area, all the bars and restaurants around here.  I like the \"warm & rustic\" feel of Growlers and look forward to going back and trying more beers next time. Have not tried the food yet....",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rZz4yI1JrHWlqfGwlNs7fQ",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. sorry the pic is a little dark...",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rZz4yI1JrHWlqfGwlNs7fQ/o.jpg"
      }
    ],
    "user_id": "1gEx8Si6rkStWBp_IXnGCw"
  },
  "XZghM4Px7VXuSBmTMGiuZQ": {
    "date": "12/4/2011",
    "text": "I like Growlers. But I almost never go there. That usually means I WANT to like it more than I do. Unfortunately, the beer selection - while top notch - is pricey. And while there is technically table service, it's a pretty informal system of \"grab an open table and hope a server comes by.\" (Try the beer cheese and sausage - it's a small menu but excellent)  It's a great atmosphere in a great neighborhood and worth checking out. If the beer were priced better this would be a regular spot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hdslUsIs0D5tt8jUA4UCRQ"
  },
  "EJo82NoEwHf58DwTUt7mNg": {
    "date": "5/13/2013",
    "text": "This is our favorite go-to place.  It's small, so it gets crowded fast, but they have a great selection of beers of good food.  We've tried everything from fries to the fresh oysters.  The service is the best part.  Everyone is just nice...it's kind of refreshing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V-vHgpadQSrsRE4ReGhEPQ"
  },
  "_l_-2v2yJDw0CBxu0e1B4A": {
    "date": "2/16/2014",
    "text": "Absolutely love the setting. Feels like an old pub. The food is great- notably the Reuben and the fries - oh the fries! Great beer selection. Only downside is there isn't enough seating....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Su3bABshklCd_h8DJ2DQIQ"
  },
  "3Ua7YGB9xj5zOVm6HcKm7A": {
    "date": "1/20/2011",
    "text": "Love this little place in the heart of Noda. The beer is outstanding, ambiance is quaint and Alex, is the best waitress in town.  Seriously, she is amazing and always accommodating. Her warmth and charm alone are reason to go back again and again.  If you have been and had her as your waitress there or at crepe cellar, you'll know what i mean.   I would've given it 5 stars if the food was better.  Not that it's bad, but it's something i can do just as easily and possibly better at home.  If you're in need late night though, def. try it out.  I'd recommend the smashed club panini.   Aside from the delicious beer, a must is the root beer float shot - it used to be their Friday night special and it is divine!   Be sure to make Growler's a stop during your stay in Noda - great place to hit before or after a show, hang out all night or while you wait for a table for Cabo  :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "d2F1gKyvH_cf19ivqysoXQ"
  },
  "G0MVEjMKFIrXL0S6gzLeXA": {
    "date": "8/31/2015",
    "text": "This is a great place to come and hang out with your friends in the NoDa area. They have reasonably priced beer, and run specials throughout the week on different items. One night is wing night --- and man are their wings good! Nicely sized and sauced to perfection. They also have various oysters if you're looking for your fix. There's always a good crowd here, but I've never seen it over-crowded to where I didn't want to stick around.  Don't forget to do your oyster shot before you leave!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4-Oh0TN8-b9gj12_VUZmAw"
  },
  "p4YK1nkEv1XTNxbbtqCl6Q": {
    "date": "11/3/2016",
    "text": "Nice little place. Decent beer selection. Bartenders friendly and helpful. Best Reuben I have EVER had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sZXnrZbJVmD9vTU_8XlJAg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Ommegang Great Beyond was awesome",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sZXnrZbJVmD9vTU_8XlJAg/o.jpg"
      }
    ],
    "user_id": "4ANknpkDot2bdjgy3t_L_Q"
  },
  "7wLQC_U1_qKt03c_6syOaQ": {
    "date": "6/23/2014",
    "text": "We stopped here on a recent trek with the Party Pedaler.   While we only here long enough to gulp down two beers, the service here was far better than many other local watering holes.  Our server (I think her name was Brianna) was amazing and very attentive.  Anytime we needed something she was right on it.  The beer selection was great with many of the local breweries represented and many different styles to appeal to everyone's tastes.    The crowd was very diverse as well.   I'll definitely have to come back here in the near future.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "6MxLdmACzrYjOIWXq9mlEA": {
    "date": "12/1/2016",
    "text": "This place is as solid as it gets for a quality neighborhood pub with quality booze and food. I would love to see them change up their menu a bit but food is good. Simple menu, simple beer menu but very good. This place employs a few extraordinary bartenders that can make True craft cocktails. Don't think that \"Growlers\" is just about beer. I love asking my favorite bartender to \"make me something special that you think I'll like\". I'm never disappointed. Awesome cocktails are there for the taking. Great bourbon's and bourbon bartenders.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EgYw1Ij8_42XzxJqPlZoZQ",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EgYw1Ij8_42XzxJqPlZoZQ/o.jpg"
      }
    ],
    "user_id": "lPHq4Ff2js8pPWlzq5GXBw"
  },
  "zFslxbesFE4XFWuBaQ7D_w": {
    "date": "4/18/2015",
    "text": "They caught us on a trip to Cabo but couldn't take the hour long wait, so we wandered across the street to Growler's--we're glad we went.  $2 PBR pints, $3 tacos and wonderful sausages says \"we must go back!\". Only let down was the Korean BBQ taco was tough and dry, but tasty.  I liked the M-n-C and the beer brat.  Service was prompt and efficient, seating was a breeze.  I even lucked out on parking!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CjHWRUKXhhley9N9NLS07Q"
  },
  "wjpUCSZ_F2fqweU8SdHSVw": {
    "date": "7/18/2017",
    "text": "Found this place by accident and have been frequenting ever since! GREAT service, fresh oysters brought in 3x a week, and the food never disappoints!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5KxNbi9LJ8_mY7SOA8pYSA"
  },
  "2TSppK5PVrybd-XvSc2njw": {
    "date": "4/2/2016",
    "text": "Nice, cozy atmosphere with a good selection of brews. While making your stops through NoDa it's definitely worth checking out and having an oyster shot! Can't recomend the food though. With sausage/brats being a staple on the menu I was hoping they would be much better than they were but just came out dry and bland.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HRIW-x7ahwfVmytIu2keHA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. More tolerable than they appear!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HRIW-x7ahwfVmytIu2keHA/o.jpg"
      }
    ],
    "user_id": "eLahsUiYTNR8dn6vlUQMXw"
  },
  "lxXvWRE1BlXKUFcsaORmRg": {
    "date": "8/16/2017",
    "text": "Probably the best bar food I have had. Nontraditional food and decent prices. Waitress sucked, but bar tenders really picked up her slack. I was impressed. Check the menu out, seriously!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iAEdtGt4zspHSNvpFaUvbA"
  },
  "QeYKR64oVM93N5lt-QQfuw": {
    "date": "10/15/2015",
    "text": "Worst bartenders inNoDa! How can you not know someone is is at the bar????even 3 deep, I know bar tending is not not just a art but an ability   Third time we've been here (on accident )",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "OaDKFv9zEeJZYZUXF0GBtg"
  },
  "q1Wyf0ZB9xiYb54_CyBq_g": {
    "date": "7/15/2017",
    "text": "Hidden gem, best place on North Davidson!  Food is awesome, drinks are awesome, vibe is awesome.  Poutine, pork belly and chicken tacos, and mac and cheese are amazing.  People who work here are really great, love the music, and always have rotating beers on tap.  Only qualm is it's super small so if it's busy there's literally nowhere to stand but if it were bigger it would take away from the vibe so I wouldn't change a thing- plus the way noda is, all places have to be small so I still give 5 stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZKchuGa8wm5zkYcD8OmI0g"
  },
  "t2vKU3qTYcu1Y-3wdRQ20Q": {
    "date": "8/30/2012",
    "text": "I like the bar itself and they have plenty of tv's.  The booths & tables are nice.  The popcorn & chips w/beer cheese are delicious.  I had the hot dog and was disappointed.  It had a great texture, but it was so salty I only ate half of it.  The bun was nice and soft.  They only have the stone-ground type mustard.  I love the beer flights you can get and they have a great selection.  I will visit again just because I like the chill atmosphere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h1F9MlZHvsxKl2xYZEpq6w",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Beer flight!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h1F9MlZHvsxKl2xYZEpq6w/o.jpg"
      }
    ],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "tC6l-fnkJOHRBa306UyrAQ": {
    "date": "7/3/2014",
    "text": "Nice selection of beers on tap along with your standard canned and bottled options. Unfortunately, there are not many choices when it comes to seating, so you either pull up to the limited amount of seats at the bar, one of the side tables, or the large picnic-style table in the center.  I only popped in to have a quick drink before the Yelp Summer Soiree so I didn't get to sample any of the food except for the complimentary popcorn available at the bar.  If you are a beer novice, they allow you to sample so do not be afraid to ask!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SBi0TYUSIrct8WSTyK6DFg"
  },
  "NvwEJMl43i6t4GHRL5MucQ": {
    "date": "6/19/2017",
    "text": "My favorite spot in Charlotte to hang out for a drink and a plate of fresh oysters.  Rotating local beer selection and laid back atmosphere thanks in no small part to the super chill staff who take good care of regulars and newcomers alike.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zW2EYiTddo8WSeAOqjhsqA"
  },
  "lEMssnUcAfuxZAcwOdlXnQ": {
    "date": "5/17/2016",
    "text": "Delicious. Both the Korean and fried chicken tacos are amazing.    New Jersey oysters are also a must.   One star off only because I prefer lower abv IPAs and not many on tap.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ib3SgdxxY5sggxqbMMtzWQ"
  },
  "QAMHJUOHDU4mnP-3rgk8UA": {
    "date": "11/12/2013",
    "text": "Great beers, great food, good location.  A little pricier than most of the other spots in NoDa but you get what you pay for.  This place isn't that big, especially if you're here for food.  There is a table or 2 to you right when you walk in, a huge bar on that side, one big community table in the middle, then maybe 5 or 6 other spots on the left side.  That doesn't keep me from frequenting this establishment, I just use it as a bar with food instead of a restaurant with good booze.  As far as food goes, they have their own oysters, nuff said.  Farm to fork at its finest in NC.  Match that with a great tap list and I'd say this place is worth the visit right there.  I hear the sandwiches are what they're known for but I've only had a bite of one.  The pesto portabello was pretty spot on, with roasted red peppers and goat cheese.  I have had the chorizo taco's and liked them but I was about 6 or 7 beers deep and would have thought a chorizo sausage straight to the face was the best thing I had ever eaten.  The pita and humus, beer cheese with fries, and pretzel are my normal go-to's while having a couple beers.  I guess I should try more food.  The kitchen is open till midnight so that shouldn't be a problem.  Ohhhhhh, the booze.  Always a great tap list.  $1 PBR Mon-Fri  is really the only \"special\" but I don't even consider that an option with the diversity they have on tap.  With 14 rotating taps and a diverse line-up you just have to go see it for yourself.  I'm an IPA drinker and they always have 2-3 good ones, but this place helps me spread my wings.  Seasonals, browns, Belgians, stouts, etc.....  Something for everyone.  Also, the first Tuesday of every month is a real treat.  Beer ED with samplings/pairings on the house.  Something different every time.  If they had a $3 pint night or even just a cheap special every night I'd give this place 5 stars.  See ya there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "wnFWoQ63F9-ohUQ-C0AeIw"
  },
  "wNc0qgIO9sjBm0nAj1Ltdg": {
    "date": "5/19/2016",
    "text": "Stopped in for our first time on a Wednesday night for dinner and was pretty happy with our choice! Wednesdays there are canned beer and wing specials so my husband got the wings. I ordered the Reuben sandwich w/out swiss. Waiter was super nice and attentive as was all of the staff we encountered. I loved the sandwich, it came out perfect but he wasn't a huge fan of the wings. I tried one, it wasn't bad just nothing special. The fries are great tho.  I'd reccomend Growlers and will definitely be back in the future!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EC2FyPHaSpGOS-tjLXYssw"
  },
  "s_7bPHH8YBWfSA3i6ONYkQ": {
    "date": "6/4/2017",
    "text": "A NoDa staple. The selection of fresh oysters is the best in Charlotte. The guys behind the bar are friendly and remember your name after a couple visits. They have creative shot specials and an extensive beer selection. The owner is great and has done more for the NoDa culinary scene than anyone! You won't be sorry you stopped by.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LAPtCqwKRhCZxU7Lno_rRw"
  },
  "OaAg3d1mBVQVDVYK5rSqlw": {
    "date": "7/21/2015",
    "text": "we sat at the bar and were instantly acknowledged by the bartender. when the 2nd bartender returned from the back room - he too immediately greeted us.... and that's how the evening started. and it got better as the time went by. Good conversations while still being attentive to all the patrons - thats a sign of some top notch bartenders...  Then there's the food which to call this bar food would be insulting. This was food food - from a skilled kitchen. Our brats and sausages were large portions and tasty. The sides were very tasty. My buddy ordered a Titos and Club and it was with a fair pour and a fair price that it was delivered.  my soda pops of preference wasnt on the menu there - so she hooked me up with a nice NA beer. It was a place I can see myself returning to when I next come back to NoDa. In fact, I'll bet its the first stop....4 stars well deserved.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5soJ5WtBqB8yfxKz5VD2rg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Italian sausage n peppers",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5soJ5WtBqB8yfxKz5VD2rg/o.jpg"
      },
      {
        "img_id": "jrAWor7LMEku3TSpCJ3nGA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Great sides",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jrAWor7LMEku3TSpCJ3nGA/o.jpg"
      }
    ],
    "user_id": "OFh0f5zmSZCVs38OW6w3cw"
  },
  "nI6IktYEBHJTIDlog-AzXA": {
    "date": "1/28/2017",
    "text": "Food was really good!! The reuben and and the club are absolutely awesome! My only complaint is the sandwhiches dont come with a side and the tiny ass side of mac n cheese is $4!! Really wish i would have known ahead of time. The people that got fried got a good portion, but the mac n cheese should have been $1.50 max.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gAORnKkyEJqyCmauTY0yJA"
  },
  "b4ROAoYQiVVZAN_aCxKGQg": {
    "date": "1/23/2011",
    "text": "I went to Growlers today to watch the disappointment that was the Bears game, it was pretty dead in there except for a few randoms at the bar and a big party smack dab in the middle of the place. Exposed brick wall with a small bar area and four to five booths, for some reason I thought it was going to be larger than it was (that's what she said) but it was a pleasant atmosphere. We were automatically greeted by our server who asked if we've ever been there then continued to tell us about their beer, food, etc. I thought it was really interesting that they make their own sausage there-you don't see that too often and I am intrigued by the process.  They have a nice selection of beers on taps varying from IPAs to pilsners to stouts plus some with high alcohol content (7 and 10.3% I believe). I have a Living Social deal for there for $30 worth of food and drink, which is awesome. I love bargain booze!  We got the dip platter to start out with.  They have a dip platter for $13 and you get to pick three dips off of their menu, we picked the pimento cheese, real french onion dip and roasted vegetable.  *Pimento Cheese dip. It tasted good but it wasn't the traditional creamy pimento cheese dip that I'm used to. Plus the tortilla chips didn't hold too well when you scooped it up.  *Real French Onion Dip. I am still wondering what makes it \"real\", this was my favorite dip. I love the minced onions in it and the chips served with it were perfect.  *Roasted Vegetable Salsa. This was second runner-up and packed a lot of different flavors. We asked the server what it included because we couldn't tell what the distinct flavor was and she said it was probably the variety of peppers used in it (poblano, jalapeno, bell) and coriander. My mouth wasn't on fire but I sure did enjoy the flavor  We had a Turkey Apple sausage to split afterwards along with a side of purple slaw (I dare you not to sing Purple Slaw to the tune of Purple Rain if you order this) and mac n cheese (thanks Melissa B for the suggestion!!)  Alright, lets talk sausage (that's what she said-ZING-again!). So it's homemade and it tasted that way consistency wise. It had more water or whatever juice is in the sausage casing  (please don't tell me what it is if you do know what said juice is) than I cared for. Plus when you took a bite into it, you couldn't separate it with a simple bite, you had to gnaw at it and shake your head a bit. Very Neanderthal like. Thank god I wasn't with a gentleman caller b/c it was not a pretty sight. Regardless, it was tasty just a little difficult to break up.  Purple slaw was good--more vinegar based than mayo but could have used more herbs or spice.  Mac N Cheese----ooey, gooey delicious. I added some black pepper to mine but it was the perfect combination of cheesy goodness and cooked pasta,  All in all, I will be coming back to Growlers for sure. We had all of that plus a couple of beers for $30. You can't beat a value like that!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "37yGZ_yppBr4aPD-omu1Bw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Pimento Cheese dip",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/37yGZ_yppBr4aPD-omu1Bw/o.jpg"
      },
      {
        "img_id": "3AMSIr1fj7ie_YlL6rBbJw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Real french onion dip",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3AMSIr1fj7ie_YlL6rBbJw/o.jpg"
      },
      {
        "img_id": "wlin8ECB9kqjsDsOI1o8Yw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Roasted Vegetable Salsa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wlin8ECB9kqjsDsOI1o8Yw/o.jpg"
      }
    ],
    "user_id": "l-tDF960t9BakjyH34XfTA"
  },
  "rxDLkaiZbPBLSoWFR5fzLg": {
    "date": "5/26/2018",
    "text": "To be honest I had very high hopes for this place. I came here with my fiance after stopping at other local places in NoDa because we just moved here. We came in and seating was hard to come by, which was no big deal because they were busy but once seated the service was not nice. We ordered some drinks from the menu, both of us are over the legal drinking age. And were definitely looked at suspiciously because we look young. We just graduated college, yes we look young, also we have out of state IDs, not our fault. Whatever the reason,  we were looked at and uncomfortable about the situation although they had already brought the drinks. Overall, service is not great but the appetizers and drinks were good. Probably will not be back however because of the service and poor treatment of customers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XqG3cau667jN8rskwuMtjQ"
  },
  "5tvjuwpMXmHGS1Ea15TIJQ": {
    "date": "7/22/2017",
    "text": "Best staff in NODA.  They are honest about the beers based on your preferences, mix good cocktails, and are generally just happy likable people that give good service.  It gets a bit crowded on Fridays, Saturdays and some random weekdays too and has a great vibe during the slower days of the week as well.  I love the old wooden door that is now a large table in the middle of the place, great style.      Beer selection is always well varied and it's rare I can'y find something I'm happy with.  The food is great and some of my favorites are the pork belly tacos, the reuben, broccoli slaw and french fries, best in the neighborhood.  One of the few places in town with cask beer and a real beer engine. They sell a good bit of it so it's always fresh.  Check out the specials on the off nights, really good deals.    If you are looking for a Cheers, this might it.  Had I not recently moved I might not be writing this review as I didn't want this place to get any busier.   I almost forgot, the oysters are fantastic and a surprise for this place.  Would never had guessed it.  Get an oyster shot if you're brave enough, they are outstanding.  Oh, did I mention free popcorn too?!?  ***  I live in the middle of NODA and have been everywhere in the neighborhood many times over the past years. These reviews are a culmination of lots of visits so it's more of a consistency rating than anything.  If you are going out in NODA I've got reviews up of all the places in the neighborhood if you're looking to compare.  ***",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y5SL5PaMqZDyM-4PAq5NJw"
  },
  "9tqDwGjcrJjBd_RWHt2oZg": {
    "date": "2/27/2017",
    "text": "Growlers is a solid NoDa spot. The ambience is really cool. Someone mentioned their awesome door! If you haven't seen it, make sure to check it out. Pop in for their awesome beer selection and stay for some food. Their food menu isn't super extensive but all goes well with beer. I mean, they are a Pourhouse!  Pros:  + The serve POUTINE (a.k.a Gravy Fries), which is surprisingly difficult to find down south. It's served with covered with gravy, cheese curds, and bacon. They definitely don't suck.  + Cask conditioned beers! Another hard thing to find in Charlotte. Some think of them as \"warm\" beers, which isn't totally False. Cask conditioned beers are served warmer (closer to 45 degrees) but its to keep the beer alive!  Cons: - Limited seating. The space isn't that big and tables are hard to come by on Friday and Saturday nights.  - Parking sucks. Not really their fault, but it makes it difficult to access during peak times. I can usually find parking in the neighborhood or at the YMCA.  - Service can be inconsistent when it gets crazy busy. Be patient. These people are working their butts of for you!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "PVyZXgOkVtnU6966FDFhuw"
  },
  "1CIcUXP7qJQlzwXzA-9ulw": {
    "date": "4/10/2016",
    "text": "We wandered NoDa for a bar that wasn't too crowded to watch the Final Four.  To our surprise, Growlers had a decent amount of TVs all over the place, so it was easy to watch the games.  The service was great, too. When we sat down at the long table in the middle, a bar tender immediately came running over to get our food/drink order.  Even when it got crowded we still received the same level of service.  We did order some crispy chicken tacos, which were great, but we were primarily there to get drinks and watch the games, so the complimentary popcorn they gave us was a nice touch to keep us snacking throughout the night.  Growlers was a nice place to watch a game.  I look forward to going back and trying more of their food and beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LwvPZ1bQt5-Zl1xxPberVQ"
  },
  "ZF0ZRd2FVk1RLJcgn8DnTg": {
    "date": "1/15/2017",
    "text": "We had a great experience here. We had some time to kill and decided to come here. We went to the bar and immediately got served. We all got our drinks in less than a min for a party of 6. They do serve popcorn which is nice but super salty. Bartenders were really attentive. We didn't get any food this time but were all really happy with our drinks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "aVePlXfqB8pcsEKCCMIO7g": {
    "date": "11/21/2015",
    "text": "We came here just because we were waiting on a table at Crepe Cellar and then we ended up getting full on bar snacks! We tried the fries, the wings, the pretzel, the fried chicken taco, a portobello sandwich and the chicken skins. I would recommend getting two tacos and a beer to anyone coming here for a quick bite to eat. The fried chicken taco was the best thing I tried. The wings were ok, I like wings fried hard and these weren't. The fries were good but not a must. The chicken skins I would skip - kind of gimmicky and $7. Our friend had the sandwich and the pretzel and he didn't say anything bad about them and finished both. I didn't expect to like this place because it was dark and packed. They've got booths but you kind of seat yourself? The waitresses were all \"in a mood\" like they were mad they had to be there. Not really a welcoming vibe.  As for drinks, funny to see a shandy on the menu out of season but I would recommend the Shandy the Elder. Really refreshing and light - I'd drink another anytime!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 11,
      "cool": 5
    },
    "photos": [],
    "user_id": "mcJ-A0OGmiWZGBbdWPMfrw"
  },
  "25ziG1PEskOYHuppZzBqnQ": {
    "date": "1/18/2016",
    "text": "Growlers Pourhouse Tasty bites, killer draft selection. I was walking through NoDa (the cool little neighborhood off North Davidson) heading towards NoDa Brewery, when I happened to walk by Growlers Pourhouse and I decided to skip Brewery hopping & just get a flight here. There are over a dozen microbrews on draft, from near and far, as well as a few \"cask\" beers and a long bottle list. Apparently this place made Draft magazines \"Best Beer Bars\", well you can bring your non-beer-drinking friends as well because they have a full bar that includes a few of my favorite (whiskey) things.  To my surprise I found a great bar food menu also! I love finding clever goodies wrapped in tortillas!  The menu is limited so don't expect a full blown entree, but between the appetizers, soup, oysters, tacos etc. nobody will go hungry. Try the \"root beer float\" shot.   I ordered 1 pork belly taco & 1 fried chicken taco. Friends had the poutine & the pretzel, they were meh. By far the favorite of the night was the FRIED CHICKEN TACO! Prices are reasonable. Pints are $5-6 and a taco is $4. My flight was 4 (5oz.?) pours for $6!! Total $14 +tax.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_csrQ5Q5JqtKRK_kn6fELA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Draft list at the time",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_csrQ5Q5JqtKRK_kn6fELA/o.jpg"
      },
      {
        "img_id": "y1M0j7SPqhV7yM2d65B6Aw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Whiskey selection",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/y1M0j7SPqhV7yM2d65B6Aw/o.jpg"
      },
      {
        "img_id": "ln6_Fv3mZ956ro3ZDlXfUA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Flight &amp;amp; tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ln6_Fv3mZ956ro3ZDlXfUA/o.jpg"
      }
    ],
    "user_id": "7xN_4bfFlP-ExM_MjFEiBA"
  },
  "f4vQLLzoJskV9rjkHSWodA": {
    "date": "8/12/2017",
    "text": "Not sure how this gets any stars. I was in at 2 on a Saturday afternoon,  it was not crowded and I just wanted a growler filled. The woman behind the bar was not knowledgeable about the beers, but more than that, did not know how to fill a growler. She complained that I had brought my own, and on the first try, filled it with partly the beer I asked for, then topped it with a different beer (to do that, she had to disconnect the filler tube and then re-attach it to a different tap. Hard to do mistakenly, unless in a trance...possible I guess.) Sorry.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q5UDOawpMtt9jpXr7W7Rzw"
  },
  "npi3c4Ru3b93gH_geUe7rw": {
    "date": "1/22/2014",
    "text": "Beers. Lots and lots of beers.   This is one of my favorite spots in NoDa. I used to live a block for here, so I pretty much lived here as well. Almost didn't move because I didn't want to be so far away from this place.  What to get: all of it. Menu is great. I love the beer brat and juniper berry kraut. I also have a love affair with oysters. Here you can get farm to fork North Carolina varieties as well as daily Atlantic varieties. Or... get an oyster shooter. Sometimes you need vodka with your oyster. Reuben is tremendous. Wings are pretty yummy. I haven't really been disappointed in anything I've ordered.  Ton of great draft choices that change often. Go here in the fall for a pumpkin beer. They do a cinnamon sugar rum. Hello lover. They also have fun shot selections like root beer float. Different specials every day.  Seating is kind of limited here. There are bar stools, a giant table in the middle of the place and a handful of booths along the wall. Parking can also be tricky in NoDa on the weekends. I recommend parking on Yadkin. Just be sure not to park in front of a driveway. You will get a ticket.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AQkkOU9zBJPTGEypljanOw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Root beer float shots",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AQkkOU9zBJPTGEypljanOw/o.jpg"
      },
      {
        "img_id": "36LHXxpxsYXTeC5qbjMpug",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Housemade chorizo taco",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/36LHXxpxsYXTeC5qbjMpug/o.jpg"
      },
      {
        "img_id": "MRAt73vwhGSTITpgZB2lEw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MRAt73vwhGSTITpgZB2lEw/o.jpg"
      }
    ],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "2uspk8sBl7gNzXmzfUAXFw": {
    "date": "9/13/2016",
    "text": "I enjoyed a few pints at Growlers pregaming for a show down the street.  Enjoyed watching SEC Football at the bar.  Had the GPH Ale, which is an english style pub ale.  Served room temp.  Enjoyed it, but went for a ice cold gose afterwards.  Enjoyed everything I had.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "6u82x6PkhQD2zm6Qa3mxCw"
  },
  "XTZxXUSwwQ6s03Kx0HVHCA": {
    "date": "7/29/2016",
    "text": "In the heart of NoDA, this place is a staple. The beer list is always changing and they make sure there is at least one type of beer if not more. The specialty cocktails are amazing recipes. My favorite is the spicy margarita but make sure you tell them light on the jalapenos because the last few sips will bite you. You can also partake in an oyster shooter, a tiny meal in itself. The pretzel and beer cheese is on point.  All the sandwiches have special twists to them that do not compare to others (sriracha Russian dressing, fig balsamic vinaigrette, gruyere cheese).   The atmosphere is casual, with fun music and tv's always on. The front window table is a great place to sit and people watch. And last but not least, the staff are just the best!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JG2CbDrrsOyldqCn62exuw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JG2CbDrrsOyldqCn62exuw/o.jpg"
      },
      {
        "img_id": "pYTJzfTW738A8nT1kMEoHg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pYTJzfTW738A8nT1kMEoHg/o.jpg"
      }
    ],
    "user_id": "FazG38Q6K8eE1qicOVJ4pA"
  },
  "bt_rZrCrWiDyZ7dpRz4r8Q": {
    "date": "5/6/2017",
    "text": "Hipster vibe, which is cool if you sipped your first boozel in 2014. Otherwise, average service. Cool vibe but weird culture. 4 stars for the spot, 5 stars for drinks and food  hip hipster hooray",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V-6s3XKWZc0ztnMl1NIRQg"
  },
  "X6Y0zDL6sYcWcqONOsesnQ": {
    "date": "7/25/2018",
    "text": "My husband and I stopped in yesterday, July 24th, around 5:30 and sat at the bar...we waited 20 minutes at what point we had to get HIS (PAT) attention.  The place had maybe 12 people and that's including us, so it wasn't really busy.  Another 10 minutes go by and I finally decided that my presence there meant nothing to Pat and walked out to him saying he was sorry but he was waiting on shakers from the dishwasher.  I said it was unacceptable that I needed to wait for a 1/2 hour for anything.  If this establishment is into craft drinks then there should be a handsink behind the bar so you dont need to wait for the \"dishwasher\" to clean your glasses.  I am a previous bartender/server for 30+ years.  Others around us also commented on his inability to communicate with his customers.  Apparently a bad day for him that made me kind of grumpy for a while after leaving.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z4UJy2N470gCEEZPzk9JEA"
  },
  "jStFqkjO34YZZ6C6_0CDmA": {
    "date": "6/5/2018",
    "text": "If you're looking for a neighborhood bar with a great selection of food and drinks where the staff get to know, you, this is the place.  The bartenders are the best in town.  Dan, Jordan, Brett, Staci, Hunter... They're all great.  They have a reliable rotating selection of drafts and keep a couple beers on cask (though we all wish they'd bring back PBR on draft).  The food is great. Oysters are excellent, I love their tempeh tacos and mac and cheese, and they have $7/doz wings on Wednesdays.  This is a place that I'm comfortable coming to alone to grab a bite because I know I'll always see a friendly face behind the bar.  The only gripe I have is the smell that comes from the shared kitchen with reigning doughnuts.  I know they're working on correcting the problem but you really do come out of the restaurant smelling like a fryer. I know several people that won't go to Growlers for this reason.  That being said, this is the closest I've come to finding a bar like Cheers and the smell won't keep me from coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9a9TVjB7Hm4BORu3On9cUA"
  },
  "uXr8TzdsAVoTmJOXTLrSJg": {
    "date": "4/13/2018",
    "text": "Rudest staff and management I've ever encountered on all of my extensive travels throughout the world. Don't bother.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EgBdYlL3UAZZfdIV12EbbQ"
  },
  "jGohfLfkS8waGEbT3XIReA": {
    "date": "3/12/2014",
    "text": "I came here on a Saturday night for dinner.  I think this is much more a beer spot than a food joint since there weren't many people eating, but I was laser-focused on one thing - oysters.  I ordered a dozen mixed oysters and a pretzel with beer cheese.  The oysters were small, but quite tasty and I didn't get a single shell, which tends to happen with the oyster places around Charlotte.    I don't drink beer, but \"when in Rome\" so I ordered a beer.  It was really good...and this is coming from a wine chick.    The bar was packed, but it's what should be expected from a beer pub on a Saturday night.  Even with the crowd, the service was great with no complaints.  I will return, but maybe during the week when it isn't so busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4CRUEjvGSHyh72Nx-3Jw1w",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Oysters and pretzel with beer cheese.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4CRUEjvGSHyh72Nx-3Jw1w/o.jpg"
      }
    ],
    "user_id": "mBuhgyQ6Wix-1CKMJHbQag"
  },
  "npUYeICQGZLDXy9Q2jh_Mg": {
    "date": "11/7/2016",
    "text": "Cool place with large front windows!  Allows you to see what's going on outside.  Not many TVs here so I wouldn't recommend going there to watch a game.  Good brews on tap and the bartender was very helpful in helping you choose the right one.  I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wkIHGdNJKTMaEYTX53BQgw"
  },
  "kjGmop-JPDfJbx1OlYZCUg": {
    "date": "4/27/2018",
    "text": "Was told by a bar tender at another restaurant that Growlers made the best Oyster shooters.  She was right and they do make a great shooter so go get you an Oyster shooter they are terrific!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9Mj6pd3f4N3VXFp_36K5Q"
  },
  "25n9cIJ0AHCIyKgiH0YZAg": {
    "date": "5/30/2016",
    "text": "Seriously great spot for a late night bite with friendly staff and tons of drink choices.   We stopped by on a Sunday night at 10 and the kitchen was still open and the drinks were still cold!    We sat at the bar and got some beers and then ordered the cheese tray straight away. It came out pretty fast and was surprisingly awesome. Four kinds of cheese, and crostinis. The only down side Was they didn't tell us what cheeses they were. I ordered the Ruben and a side of fried. It was toasty, and flavorful with stringy gooey cheese. It was delicious. My boyfriend got the pork belly tacos and I will say I was surprised they had them. But he loved them, chewy, crispy and flavorful. And my brother got the blt which had homemade mozzarella on it. He said it was awesome.   All in all everything was great is recommend it to anyone hungry late night or anytime.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "OWAJHLaGTLJ0FSzenCrPwQ"
  },
  "Twb-DlTwpgSLQHIBSUMZ0g": {
    "date": "11/6/2012",
    "text": "Well hello cute little beer bar you.    I have nothing but good memories and thoughts about this place.  Sunday afternoon....hanging out with great friends....and my new favorite seasonal beer that they offered.  It was called *tearing up* Punta Pumpkin.  I wanted to jump in my glass...and do a lazy river float as I sipped on it. And then licked the cinnamon sugary goodness off the rim.  O.M.G.  Loved it so much, a friend brought me a little glass of that sugary goodness because I licked the stuff off the rim too soon.    So good.  Such a nice way to spend a sunday afternoon!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "XkMtv3p65y4tVD85-6kXAA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Unta Pumpkin",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XkMtv3p65y4tVD85-6kXAA/o.jpg"
      }
    ],
    "user_id": "NeOIp8tz0kfxtmA8YUPmJA"
  },
  "zC_EmrdYsVgiwn877fvoFA": {
    "date": "1/22/2015",
    "text": "Still a great place with a cool vibe. Now open during lunch hours, i'm a huge fan of their Veganator, vegan sausage topped with peppers and onions with an order of fries. Still a nice selection of beer. While they don't have 100 taps or whatever, they have a good variety. They also have some bottles and cans of beer, so if nothing else appeals to you, you can get a Jam Session and be happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jm67TDhh8t1VHPACeORuOg"
  },
  "C1n13Fw6VQzhtxIQ1RFFAw": {
    "date": "3/19/2011",
    "text": "By far the best place I've eaten in Charlotte. You would think from a bar the real deal would be the beer, but don't be fooled this place has awesome food.  I had two different types of sausages which were incredibly fresh.  They were paired with sweet potato potato salad and their home-made potato chips.  I also did a beer tasting of 4 beers on tap (the bar tender also let me try their barrel brewed root beer).  Everything was superb.    Coming from San Francisco, I didn't think I'd find an eclectic bar in the outskirts of Charlotte but Growlers Pourhouse in NoDa is the real deal.  If you want great food, great beer and a great place to hang out you must try this new place.  Go Here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kmkzLWme6y4uD5qMPcw-4g",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Just awesome",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kmkzLWme6y4uD5qMPcw-4g/o.jpg"
      }
    ],
    "user_id": "Uyyjtzt8lPzD4fQdyarbgA"
  },
  "pscuSFMNmd377xbPQEUa6Q": {
    "date": "1/24/2015",
    "text": "So excited to see this place is now open for lunch.   We just had the tacos and they were fabulous!  This is a great spot to get a bite and a beer!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cv3hfMYPTmSU9KRhDqpVvA"
  },
  "91WDTcR-zA20nVQOyjBogA": {
    "date": "1/31/2013",
    "text": "Great place to start your night.  The concept is awesome, great beer and bar snacks. I particularly love that they have nitro beers which not a lot of places are willing deal with outside of Guiness.  The beer prices are going to be on the higher end so just a heads up.  We always come here while we put in our name at Crepe Celler and it's a great start and transition for the night.  It gets a bit crowded, so I find I have a better time standing up and working the bar than the whole booth / waitress situation.   Fantastic spot in the heart of NoDA.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hv7SaaVxhnn7Xpl_bO8HEQ"
  },
  "e0H7ZuH9Koo5IoAqjt4C7g": {
    "date": "10/22/2016",
    "text": "Very comfortable and a nice selection of craft beers. Also sampled the specialty margarita with a twist of pepper. Excellent!  I will be back to try the oyster shooters. Yum!  Bartenders were very attentive!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_4lK5V7Z7vpVzVd_EKkFVA"
  },
  "XOO6hgDVs0ag2afYO537Pw": {
    "date": "4/5/2013",
    "text": "Excellent atmosphere but they didn't have a single beer on tap that wasn't an IPA. Why do that???",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sGLXOyhjL_MO95IBxFBG5g"
  },
  "U0BjYTCG01BU1TRYZ36eAg": {
    "date": "10/28/2015",
    "text": "The oysters are great and the beer selection is awesome. You can't go wrong if you like Oysters and beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jzBDTzyVn8v7fAQQb9yf6Q"
  },
  "Uz9ew91U7QITZsStMtrZeQ": {
    "date": "12/30/2012",
    "text": "Two breweries and a food truck later, we were fortunate enough to find a parking spot in NoDa and rushed over to get some hyped pretzels with beer cheese from Growlers Pourhouse.    When we arrived, the place was packed and not a spot in sight was vacant.  I did a quick recon of the perimeter and aside from a hipster plagued communal table, there were only a handful of other tables that would hold the group.  My friends decided to hang by the boss Christmas tree and claim rights to a table in the corner.  Unfortunately, the sorority chicks holding it hostage would not end their conversation and step off, so we had a bit of a wait while they finally lost their wind.  While the others counted the number of patrons with mustaches, I decided to get a pint from the bar to tide me over until situated.  The wait wasn't too long, but when I order a couple measly $2 PBR pints from the bartender, she gave me a very sour face and heady as hell glasses.      It took about 15 minutes for the gossip girls to take a hint, but when they finally did leave we didn't exactly get immediate service after seating ourselves and clearing the table.  Actually, throughout the night  we never had one specific waitress/server, it consisted of 4 different people swinging by occasionally and they were all synchronized to not wait on anyone very often.  A quick thirty minute adventure turned into a ninety minute excursion from lack of seating and spotty service.    Regardless, Jay Z was playing most of the night with a Kanye West song thrown in the mix.  The atmosphere was laid back and had a few interesting characters creeping around the scene to observe inbetween bowl games on the big screens.    If you're looking for a snack, fo' free, just ask for the complimentary popcorn from their machine behind the bar.  Straight up movie theater quality!  When the pretzels arrive, so ended the grueling moments of anticipation.  The bartender delivered fresh pretzels with great chew and sharp rock salt sprinkled on top.  The beer cheese is given very generously and their house fresh ground mustard does wonders drizzled salt side up!     Aside from the pretzels and PBR pints, everything else was over priced in my opinion for what they had to offer.  The craft brews averaged about $6 alone.  Overall, I would go back just for the pretzels and that joyous beer cheese!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UFhRZ6J2XIlO8gq5rvUDJQ"
  },
  "93EF730CTHDEcYuuOpU0yg": {
    "date": "10/31/2016",
    "text": "It's a nice place to hang out with a couple of friends and grab some drinks.  The food in general was ok but I had the pork belly tacos which were amazing. Everything else was just ok.  The bartenders were nice. It's a small, cozy, chill type of spot.  Oh and parking was a pain in the butt, so manage your expectations when it come to that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nrXoCy3h1UUcw7z2l8BYTQ"
  },
  "598h2syINN2Prc9ea0UZmw": {
    "date": "5/11/2015",
    "text": "Neat little place to hang out in NODA.  Cold beer, friendly waitress, street side location.  Limited space on the inside.  We were there on a Friday afternoon which wasn't crowded.  But I can see if it was a busy night, seating would be at a premium.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y2_5RGgWFBvCQH3r_ZOo0A"
  },
  "G8QR1lv1R4ksQGvFAsEnzw": {
    "date": "8/28/2015",
    "text": "Growlers has by far one of the best atmospheres in Charlotte. It is also one of the only places that you can get oysters from different areas of the country all in one place. Their \"bar food\" is always tasty and their weekday specials are another great reason to stop by. The craft beer selection here is always changing and their prices are pretty on point with anywhere else in the area. If you haven't been, you're missing out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aK99XES2p7yNyWKpJjpxkQ"
  },
  "TObO0zP8m2PARZbgo0vbqQ": {
    "date": "4/13/2015",
    "text": "We usually go there to feed our need for oysters.  They usually have good fresh ones from various parts of the country.  The staff are knowledgeable about each style and can lead us in the right direction.  PBR is very cheap and that is quite alright with me.  They do have other beer selections that they change every once in a while.  Their dogs are really good as well.  Plump, juicy, and full of flavor.  Dining area is pretty small so you either have to wait for a spot to open or be lucky enough when you walk in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-C0suJCZXOM93IuqIBaOew"
  },
  "zox18kO4DPTU5RebMqA3jA": {
    "date": "8/29/2014",
    "text": "You know it hurts me to even say this because a lot of my friends like this place and that's why I came.  We weren't greeted at all just told to sit wherever... not a smile was cracked in our server's face... also... I ordered 4 each of their daily selection which they only had 3 regional oysters to choose from besides their house... I was given a dozen on their HOUSE oysters but she \"allowed\" me to have 6 oysters of what I wanted and ordered... I paid for the dozen that I didn't order and only ate half of it... WEIRD, it should have been the other way around... The sausages need SEASONING bad... it was OK... I had to ask her if we could order our dinner after she walked off with the menu and never came back.  And I like this neighborhood... but poor experience....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "feTakdJt-j3vu6gWPDHt0w"
  },
  "63WtAnMTRE6vYS6NEilk6g": {
    "date": "7/18/2012",
    "text": "Good beer selection, including taps and casks. I haven't seen cask beer outside London, and was pleasantly suprised. The bartender was chill, knew his beer, and made sure we always had a drink. The place gets busy, so I'd recommend sitting at the bar.   They serve food until midnight on the weekends but realize, this place is a pub and it's kinda a bar scene on the weekends. Little loud, few drunk douches spilling beer, etc.  I'd recommend going during the week. BEER TASTING TUESDAYS!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H8O67dKe62p2CNsrxN_u6g"
  },
  "98F6sulgwfS9ZYxFU64wDw": {
    "date": "8/22/2012",
    "text": "Can't believe it has taken me this long to review Growlers. Though NoDa has added several new watering holes, Growlers is by far my favorite. From the free organic popcorn, beer cheese and array of beers, it's definitely now a NoDa staple.  Came in with some friends on a Tuesday night and grabbed a booth. All of which are fashionably adorned with vintage, wooden doors. Started off with the chips and beer cheese. Pure, bar-friendly heaven. How you could say no to this glorious treat escapes me. So good. Followed by Growlers' incredible popcorn, I was a happy camper. I don't know what it is about their popcorn, but goodness gracious it's amazing.   I ordered the beer brat with juniper kraut. Can't say I was in love with it. Pretty salty, bun was really soggy and the kraut was just....kraut with juniper berries. Not a bad combo, just needs some tweaking. My wife tried the pimiento grilled cheese. Not too shabby. A little on the weak side and piled with pimientos and scallions. I'm a fan of subtle pimiento flavor, but it was still sufficient.   The bar also houses a \"beer engine\" that has been refurbished from 1936. One of the coolest aspects of the establishment, in my opinion. Makes me want to slick my hair back, wear a bowler hat, and wear suspenders. Another fun fact is that Jeff, one of the owners, is a Cicerone. A certified beer guru. One of the few in NC. Pretty much he knows everything there is to know about beer(s). This place: legit.  Best humdinger of a win? $1 PBRs. My hipster counterparts would rejoice with me and joyfully raise their glasses. Cheers for cheap beer, says I. Even if it is hipster champagne. I'm a happy camper at Growlers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "Gdpy1UEKmdxWhh9Jgt-eJw": {
    "date": "12/11/2014",
    "text": "Nice selection with a good portion of the taps dedicated to local brews.  Service was very attentive.  This was a great place to wait for a table to open up at Cabo across the street.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uPtcm-krVuWIyY4UIJqDFg"
  },
  "y7g5Ov4DuSHB5YhvavSsgA": {
    "date": "4/23/2015",
    "text": "This place is not bad.  I love that they have broccoli salad as a side option. It was delicious.  I ordered the club sandwich and I had no complaints.  A great beer selection too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Byjn24Jhcq_Gl6QkjSdlPw"
  },
  "cRpvkLkZOvKIC8Cz0U5pXg": {
    "date": "12/26/2014",
    "text": "Small pub with pubstyle food.  Nice selection of beers & fresh raw oysters - need I say more?  They make their own sausages here.  They were good, but we did have to ask if they were truly cooked as they seemed a bit pink.  Waitress had asked the cook and they said due to curing methods, it may seem pink, but assured they were fully cooked. Friendly wait staff and super quick service. Menu is rather limited so in my opinion, I'd come back again for lunch or late night pub eats, not really for dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T7cnnho7h6NHpgiFGcKong"
  },
  "fg88JUkcPAnV1ZjCVu48Nw": {
    "date": "9/10/2011",
    "text": "I stopped by this past Tuesday for the monthly beer tasting.  My 1st visit and the place is tiny.  I think they have room for maybe another table if they like to... but space is definitely premium.  I sat at the bar and had a glass of the pumpkin beer (came highly recommended by the 2 guys next to me).  I'm no beer expert and I'm one of those people who can actually drink a domestic light beer with glee, but I have to say it was one yummy beer.  The best part is the cinnamon sugar rim...  I was literally licking the heck out of the glass.    I didn't eat here, but checked out the menu.  Not the widest selection but I guess it is a pub.  I got a taste of the sausage they were passing around and it was very good.  Next time I'll have to try out their hot dogs.  They also have pretty serious oyster offering.    I was impressed overall.  It's a niche place for NoDa (which is hard to have a niche in this area).  And their 1st Tuesday of the month free beer tasting is also easy on the budget and a great social event with a friend or 2.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "M4yYtAXehUzaHB1ghl6EXg"
  },
  "RFIIldDbJ2k1p2sNPjAACw": {
    "date": "12/31/2014",
    "text": "Great service with a laid back atmosphere. They have oysters from all over the country which are served very cold and satisfying. We made friends by sitting at the communal center table which was crafted from an old sliding barn door. They also have a lot of local beers to choose from. A great place to wait for your taco reservation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0zWAeCchSNEJX6aNxJm7eQ"
  },
  "VEMocRccKvo-847rgJNmbg": {
    "date": "3/16/2018",
    "text": "I have only gone here to sit at the bar for drinks and small bites, but it's always been a good experience. Very friendly service and the raw oysters are usually very tasty. When my husband and I go we usually tried a few different oysters and split another appetizer. We don't live in NoDa, so I don't go here often. But if we have plans that day that will land us in the area, we try to stop in for a bit. It's a neat little place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dOtx0WaYK95xdCMalSWwCw"
  },
  "EkH71p3c7WC1X_69ZPIUCg": {
    "date": "5/2/2017",
    "text": "This is one of the places that I almost don't want to review because I love it so much. It's definitely one of my favorite spots in NoDa. Two years ago, my friends and I wanted a really relaxed New Years Eve night and we decided to post up at Growlers. We were not disappointed.   The atmosphere is casual and fun. The beer selection is huge (both on the tap and in bottles and cans) and they have a full bar as well, for those who are not beer drinkers.   The food is exactly what you want to eat when you've been tossing down a few bites. I have a lot of trouble resisting the beer brat with kraut. But when I get really sauced (yes, us classy ladies can get there too) I go for the Poutine. I mean, who doesn't love fries with cheese curds covered in gravy?  If you're of strong will, or just really want something fresh, they do also have multiple styles of salads.   I love the cozy feel of the place. Due to its size, it can get very loud on a Saturday night when it's packed, but I'd take a small loud bar over a huge loud bar any day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "o2pZO42pH0_xXrcRYG31xw"
  },
  "Q3e-E39NHCfA7zM8JN5Ovg": {
    "date": "10/17/2018",
    "text": "Love the neighborhood NoDa so much and now Growlers!! I went here on a bumble date and had a great time. As a beer girl this is perfect place because they offer a great selection of craft beer AND all of their food is designed to pair perfectly with it ! Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D78dSOPkrvlaq-HpHDqFKQ"
  },
  "Kjf_r6Jvs_J9H-BWDIcjCg": {
    "date": "5/8/2018",
    "text": "Tindr date appropriateness - 4 out of 5. Afternoon date would be perfect. Later at night it might be too busy and crowded.   Came here for a drink during a Tuesday afternoon. A lot of the bars in the Noda area don't open until 5 pm, but this one opens at 11:30 AM except Monday. There were only a couple other people in the bar, but the vibe was welcoming and chill.  Nice bar, feels like an interesting mix between trendy and dive bar. There is seating at the bar as well as booth/tables, but as it's a small space I imagine it can fill up fast.   The specialty cocktails have fresh ingredients (lime juice was being hand squeezed), there's a beer tap list, and in general the liquor selection is large. Menu is nice for such a small establishment - tacos, sandwiches, oysters, sandwiches, sausages, salads, and snacks and sides.   For my peeps on restrictive diets:  (This is not reflected in my rating, it is purely to help those of us on restrictive diets find places to eat and get drunk. My reviews reflect gluten, cow dairy, soy, sugar, starch, and sugar free). The bartender Ryan was VERY accommodating in finding something for me to drink that isn't just a vodka soda water. The lime and lemon juices are fresh squeezed with no additives. The flavored vodkas are infused. He was able to make me a citrusy drink that tasted so GOOD. It is very rare to find a bartender who's willing to figure out a fun drink. Food wise, the oysters are definitely an option, but without the cocktail sauce. They have free popcorn, but it's crazy salty so I hope you like puffy ankles. A salad could be put together with a bit of work. They do have goat cheese which can be substitute for the cow dairy. Tacos will not be possible as the tortillas are flour.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Av4sSs7YFelN8KOpKCcHzA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Av4sSs7YFelN8KOpKCcHzA/o.jpg"
      },
      {
        "img_id": "jgObxwZhJclhlqTKvXXLiA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jgObxwZhJclhlqTKvXXLiA/o.jpg"
      }
    ],
    "user_id": "dgCWESOiqDcr9-_i1rdpeQ"
  },
  "NTJCyv4D9-hyQQlrGraifA": {
    "date": "4/4/2016",
    "text": "I really like the feel of this cozy NoDa bar. It's small, so it can get a little packed late at night, but we got there around 8 on a Saturday night and sat right at the middle table, which gave us all good views of the TVs to watch the Final Four.  I ordered a Serrano Pepper Margarita and a Drunken Sailor. Both cost $10 and were just okay...Not terribly surprising given that this place is better known for its craft beers.  Regarding the food, nothing on the menu really piqued my interest, but the free popcorn was nice. The service was very prompt...perhaps a function of sitting dead center.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GJTsZEBmTdG02o60-jF00Q",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Drunken Sailor",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GJTsZEBmTdG02o60-jF00Q/o.jpg"
      },
      {
        "img_id": "PGKjeA8tygS-Dx7Nm0VEtw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Serrano Pepper Margarita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PGKjeA8tygS-Dx7Nm0VEtw/o.jpg"
      }
    ],
    "user_id": "SjvZj-PpWRQr7TLKS7T1Rw"
  },
  "QjMohix-4JWzc2m64zvECQ": {
    "date": "12/16/2017",
    "text": "As a resident of Charlotte and an occasional customer of Growlers, I was HIGHLY disrespected and embarrassed in front of the whole bar by a waiter. Came in with 6 of my friends as well as hoping to speak to the manager about a possible Corporate Event to be hosted at Growlers in the following months, but instead was yelled at about a bottle of Corona that was left outside that I had the respect of bringing in for the good for everyone's safety. Instead of a question by the waiter I got initially attacked about our friends sneaking in a bottle in front of my friends and strangers. Instead of quietly confronted, we got told that we were denied service. Many regulars of Growlers that are my friends will be let known about this unprofessionalism and arrogance of this bar.  Not to mention menus were THROWN at as instead of greeting us.   Hope this helps you next time you walk through the door at Growlers.  P.S. what bouncer doesn't know the full name of the manager at the spot their employment? #sketch #stayaway",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5SMzB2Z3gftxfLNoNn6dMA"
  },
  "695C_M9K6oaJVBXr-CizGA": {
    "date": "9/18/2018",
    "text": "Was very pleasantly surprised by how good everything was here. I had brisket tacos. They were flavorful and not overpowered by extra ingredients. My fiance had both types of oysters they offered, and was very happy with their taste. Ryan was very knowledgeable on his whiskey and introduced me to some new things, and was extremely passionate about what he was doing. I will definitely be returning, frequently.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XfNlZFlcago4XXHTdWeU7A"
  },
  "E3gXMyzVX9QOZ63UCK-_qg": {
    "date": "12/12/2016",
    "text": "Growlers has a decent selection of craft beers and is a solid joint to grab a drink.  Unfortunately, I have had issues with the service both times I have been here. Both times the bar seemed rather understaffed, with only one waitress/bartender on duty the last time I went. We sat at the bar and didn't receive service for about 10 minutes because the only woman working was serving those in the food area. During my previous visit, we waited even longer and repeatedly had to flag a waiter down to ask for water, the check, etc.  After two bad service experiences, I probably won't come back to Growlers. There are plenty of other options in Charlotte for a good craft beer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hh1M-3aDJZVTwwYYy9AnA"
  },
  "k0yHFBQLu5NSC4E8k0zq9w": {
    "date": "3/26/2017",
    "text": "Cool bar in a neighborhood that everyone loves. Bartenders are helpful and will offer up suggestions. Prices are fair. I've heard the food here is good, but I have not had any myself. I'll save the fifth star for that.  Good selection of beers, full bar (oyster shots flowed). At some point will make it back to check out the food scene.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdJ5RyU4nUWj8bceNxLrZg"
  },
  "OREQxeGtaJcZUYXEWPYWXQ": {
    "date": "11/18/2015",
    "text": "Visited Growlers Pourhouse to watch the Panthers defeat the Titans, 9-0!   Likes:  The food, I ordered the Carrot Ginger Bisque and Red, White and Green Salad and both were delicious Good beer selection  Dislikes: Parking Size, it is a bit small but luckily we were able to get seats at the bar The bartender was the ONLY person working in the restaurant, he did a great job but who schedules that on a Sunday when the Panthers are playing?!  Overall, chill spot with good food and drinks out in the NoDa area.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "E3AVh1NNhmMV4-XXtKZM_A",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/E3AVh1NNhmMV4-XXtKZM_A/o.jpg"
      },
      {
        "img_id": "64RhHHzawz5RVBRgZLr91A",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/64RhHHzawz5RVBRgZLr91A/o.jpg"
      },
      {
        "img_id": "ikjN1K8H9GfsLEY4k2WnZw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Carrot Ginger Bisque",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ikjN1K8H9GfsLEY4k2WnZw/o.jpg"
      }
    ],
    "user_id": "ePm0UDfRzThVIsIK5gSp1Q"
  },
  "lCQh43GvKztnGDVBcLj7Gg": {
    "date": "11/2/2016",
    "text": "I went to Growlers last night to check out Beer Education, a special event taking place on the first Tuesday of every month starting at 7pm. It's on their website, but the information about it is a little vague, so I had no idea what to expect. When I got there, I grabbed a table and asked our waiter how it works. In short, Growlers provides everyone in the bar a small pour (~ 4 oz) of 4 different beers from a featured brewery. They don't come all at once - you get one at a time. With each pour, a beer expert from the distributor gives great information about what you're trying. In short, my first Beer Edu experience was the bomb. The featured brewery was Ommegang in NY. If you've not had their beer before, I recommend trying it. They were all delicious and unique.  I also ordered some food because it was dinner time and I was hungry (borderline HANGRY). I really wanted a salad but I didn't want to commit to the full-size salad. Thankfully, our server allowed me to order a half salad and he charged me accordingly. I thought that was awesome! I got the salad with goat cheese, cranberries, and candied walnuts with a sherry dressing. It was delicious. I also ordered a side of mac and cheese. The mac and cheese featured curly noodles in a very thick cheese sauce packed with good flavor. I really enjoyed it. It was heavy, so I'm glad the side was portioned appropriately.  It did get very crowded and loud, which was not awesome for small talk with my friends. I think it was in part because of the Cubs / Indians baseball game. Bless our server - he was trying to keep up with the bar and tables, which was difficult because it got so crowded. I'm hoping this is a-typical. I am definitely going to Growlers again, and I'll be back for another Beer Education for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rmZ9gUyoGHYSsGkg5mzZHw"
  },
  "fqJl8GKXEix5EAFUudnKUw": {
    "date": "9/3/2016",
    "text": "I honestly can't understand how this place has 4 stars. There were few things to like.   To start I can tell you I loved the door. It's very unique. The place is quite small. It's essentially a large room with 4 booths, one large table with high tops and barstools at the bar. That's it. I don't mind that very much either. It made the place pretty intimate. I also liked the bar and the beer options as well as the wings. However, the wings were spicy despite asking our waitress if they were since my boyfriend doesn't like spicy food. The fried chicken skins were not what I expected either. They are chicken skins that were battered and fried but they weren't crispy like I thought they would be. It was quite unappealing.   Lastly, we ordered a beer brat. Nothing to write home about either. My boyfriend practically didn't eat. Mind you, there really isn't much to order as far as food goes in the first place. We just paid $32 worth of a very unsatisfying meal.   Why the 3 stars, you ask? The place was clean, the other waiter/bartender was very nice/attentive and mixed up what looked to be great drinks. The place actually seemed like a great place to hang with friends and have drinks but I will honestly not be back unless we're just going for beer.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "CyNuYGfdwwRimLZE8Yxm0Q",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Chicken wings.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CyNuYGfdwwRimLZE8Yxm0Q/o.jpg"
      },
      {
        "img_id": "d7pR29w8AusBFghp7jN9kQ",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Fried chicken skins.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d7pR29w8AusBFghp7jN9kQ/o.jpg"
      },
      {
        "img_id": "0mz2Qs4qBYdH5NNtejsUNw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. The whole place is pretty small. A total of 4 booths, one large table in the middle and the rest are barstools.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0mz2Qs4qBYdH5NNtejsUNw/o.jpg"
      }
    ],
    "user_id": "hO7NoN7bBAc7E0tr4Ge0-g"
  },
  "_IsOP5uBx2aNhfaGf7FZlw": {
    "date": "6/21/2018",
    "text": "Great atmosphere & friendly staff. Went for Father's Day & was impressed by the beer selection. I saw on Yelp they (once) had a vegan sausage & was very disappointed when I arrived that it was no longer on the menu. I settled for the tempeh tacos with no aoili. They were bland so I had to spice it up with mustard. Rest of the family enjoyed their meals. My tacos were not terrible, but they could of used something else like avocado, BBQ tempeh or basically anything to give it flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SXE2X0FOHJDgQSRFFVSuug"
  },
  "dhbp-kxsSyj2EeYT46movw": {
    "date": "4/7/2018",
    "text": "Get rid of the huge black guy who sits at the door asking for identification. His attitude is WHACK. We came in for drinks before dinner. We never experienced a bouncer there before, so we walked straight in. He then screams \"hellooooo IDs please\" and nicely rolls his eyes. BAD FOR BUSINESS. We immediately left. Get him out of there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SMqZH0m4M9Leooo6nCswKA"
  },
  "WmBwQRcyKLT9UdndztwCUg": {
    "date": "7/7/2017",
    "text": "They close at 2am, we went there at 11pm with the empty stomach.  Walked in the establishment and stood there for 5 mins as we are transparent.  The guy who works there walked past us 4 times in which gave us no eye contact, no smile, and no acknowledgement.  He look like he has been working 12 hrs straight with no breaks.  Their food may be good, but we probably wont be back again.  Took my money elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "X7IrHlZnjjTmzC3kB-nafw"
  },
  "SrnM4hkXTMy91Gjs132GNw": {
    "date": "11/3/2016",
    "text": "The service here is really good, the decor is modern rustic, but most of all: the drinks here really hit the spot! They're always thinking of cool new drink concoctions, which is why I like this place so much! My current seasonal favorite is their pumpkin Moscow mule -- a combination of my two favorite things that I wouldn't have thought would taste so heavenly together! These are dangerous though...I can easily down 2 in a wink!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Cubou1IYD4HW5N26frpb1w",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Their seasonal Pumpkin Mule is so delicious you&amp;#39;ll drink two before you realize you&amp;#39;re probably more tipsy than you planned!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Cubou1IYD4HW5N26frpb1w/o.jpg"
      }
    ],
    "user_id": "8JiNjuhu1J45St3mEoQCfg"
  },
  "FmM4P0s5CrVLJDFTaf6sgg": {
    "date": "11/2/2016",
    "text": "We came here for Tuesday night Beer Education: a rep from a craft brewery comes and you get four tasters of their beer and get to learn a little about it. The event started at 7 and we arrived at 6:45 and had no problem getting a table. The brewery rep was from Ommagang and we tried a wit, a sour/brown hybrid, a triple, and a DIPA. All free!  We also ordered food. I had the portabella sandwich (portabella, red pepper, pesto, cheese), which was perfectly grilled and pressed and was very tasty! But for $8, I thought it was a little over priced considering it didn't come with a side or anything. My friends each ordered a half Red, White, and Green salad, which is listed on the menu as a whole salad only, but the waiter was happy to accommodate the request for a half portion for half price.  Unfortunately, by the time our second tasting came by, the world series had come on TV and the bar got really crowded. The announcements about the beer were hard to hear, we could barely hear each other from across the table, and they were severely understaffed for the crowd. Our poor waiter was also serving as bartender, so we didn't see him much and had to track him down to get our checks. I'm hoping this isn't typical on a Tuesday night, especially during Beer Education, so I'll have to give it another try another time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "azpZPrb02xWYI_S0MYfIGA"
  },
  "K5gMOFfhaIOlULDLAM0zwA": {
    "date": "5/15/2018",
    "text": "Go here if you'd like to spend the rest of your evening smelling like a giant, greasy donut. Growlers was easily my favorite bar in NoDa until Reigning Donuts opened. Hunter, Brett, and Jordan are great bartenders and I genuinely miss going to my favorite neighborhood bar. I refuse to go until they fix the ventilation problem. I had to have my clothes dry cleaned and my purse smelled for weeks. Growlers, FIX THE ISSUE!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gjerSA7ICihWPmv5lNrIfw"
  },
  "uEc5p-t1xyEVUicgsq1oFg": {
    "date": "4/20/2016",
    "text": "Such good oysters. We got a variety of tried all 4 types. My least favorite were the NC oysters which I believe is their own oyster farm. Those were tiny. The best were the oysters from NJ. We requested melted butter. We also got a side of mac n cheese which is the best I've had recently.   Cons: Popcorn (complimentary) was stale and extremely salty Service was rude -completely impatient, and just really rude Fried chicken skins were a dissapointment  I did find my new favorite beer there! Wicked weed lunatic blonde :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Y0_ugDi4yN-VBtCUAiuBSQ",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Oysters from NJ - the largest ones with melted butter on the side",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y0_ugDi4yN-VBtCUAiuBSQ/o.jpg"
      }
    ],
    "user_id": "dM44l_t0nxuge7pxDBpuHA"
  },
  "xZPeBrvvdcxF-5BH6YdRzg": {
    "date": "9/6/2017",
    "text": "Really like this pub. Came here for a work trip samples the menu: wings ( Thai spicy goodness) , Reuben sandwiches,bar brats, Italian sausages and gravy fries. Gravy fries not my favorite it has bacon beer curd cheese and gravy. Located in NoDa neighborhood plenty of boutiques and cool murals to explore before or after",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7gg29jxOEulX5m6f1mWaqA"
  },
  "PKofhGKGq_AJOs0Y3SqGFg": {
    "date": "10/20/2010",
    "text": "I love love love this pub!  I wish I lived closer to it so it could become my local regular spot.  The service is friendly, the environment is great, and the beer is delicious.  Not to mention the banana pudding!  The service we received from the bartender Drew and from the chef, who came out to the bar to chat with us as well, was outstanding.  Growlers is definitely one of my new Charlotte favorites, and I look forward to introducing more people to it.  I can't wait to go back (again and again).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q04iF2rt0jD209jL7Nr3XA"
  },
  "INOloeecVxX-TDAsSJ9OVQ": {
    "date": "1/4/2011",
    "text": "Well, I would love to say I could share the same glossy review of this place as many of the other people. I love NODA so I hate to bash any business there, but.... This service in this place SUCKS!!! I had actually gotten the same review from a friend that has been there 3-4 times. I always like to give any place my own personal review form my own experience there. Well, we walked into Growlers around 9:30pm on a Tuesday night, and we got one of 3 available tables left. Our party of 3 people sat for nearly 20 minutes and didn't get any service the whole time!- A guy from behind the bar walked out to 2 other tables and even made direct eye contact with us and quickly glanced away and continued to ignore us! They were not busy at all, and there were 2 servers and 1-2 people behind the bar! Bad day or not, I have alot of friends in the food/drink service industry, and taking care of customers are the only real way you are gonna bring home any money. We weren't looking for pen pals or facebook buddies, we just wanted a freakin drink! The NODA area in Charlotte is just not the place for snobby establishments with servers that only like to cater to thier \"regulars\" or friends (especialy a newer business that is trying to make it). Anyways, I heard good things about thier beer selection and good food. Too bad my first experience lived up to the crappy service rumors.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q3L8xhjwOyG5FTAEtQNE1A"
  },
  "p7KlEieMARBCoOsjHtHiIg": {
    "date": "1/26/2011",
    "text": "Good local pub. It is very small so don't think a huge group of people can fit in here without irritating the rest of the patrons. They have a good selection of Micro-brews as well as domestics. F.Y.I.. if you order a Miller High Life they give you a Champagne glass to drink it from. I have tried the Grilled Pimento Cheese sand which as well as their Nachos. I was satisfied with the sand which but very unsatisfied with the nachos. I feel that I could've eaten better nachos from Taco Bell. It was a lump of ground beef (at least that's what I think it was) and some sour cream, cheese and jalepenos. I did not try their sausage but I hear that's what you should eat. I'm personally a little leery about homemade sausage from a pub. I will say that the atmosphere is very cozy and you could definitely linger here a while. Just eat before you come.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XcFm9v7a1UgCaLn8zCNltw"
  },
  "vLPZEz1QEowJPfvlJR62GQ": {
    "date": "1/2/2012",
    "text": "This is one of my most favorite neighborhood spots but tonight was a huge let down.  I frequent this place quite often whether it being before dinner or after dinner drinks.  Tonight my buddy and I went in for some of the most delicious brews to watch some of the bowl games but we were met with some horrible service.  The bartender/server was more than less attentive to our table and looked like she was more interested in talking it up with her fellow coworkers.  There was several times she walked passed our table and scoped our situation out(situation being that we were bone dry) and she paid no mind.  We then took ourselves to the bar and received the same amount of service there from the same employee....don't get me wrong I love this place and the beer selection along with the atmosphere just tonight was a huge set back for me going in there on a Monday again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9UUPWcIwtatA1imI5bVBAQ"
  },
  "0KCalBdLnCKW6CGZbek6HA": {
    "date": "9/10/2010",
    "text": "My hubby and I had a good feeling about Growlers from the moment we walked through the large authentic-looking antique door.  We really enjoyed the old school pub vibe this place gives off.  All of the table tops and bar are made of old wood recycled from factories.  This gave it a cool cozy feeling.  They have a decent selection of beers and I was excited to find out they currently have an orange blossom pilsner from Thomas Creek Brewery out of Greenville, SC.  I fell in love with this beer months ago and haven't been able to find it since.  We ordered \"heavy\" italian sausages with chilli, cheese, peppers, and onions.  The toppings were scrumptious but the sausage itself tasted a little off.  Overall it was still enjoyable.  Our waitress was great and very knowledgeable about the different beers.  Her descriptions of the beers were quite impressive.  Growler's has the potential to make the list of bars/restaurants we take visitors to.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6zKKjiC-W0L0IOyF-FZ7uA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6zKKjiC-W0L0IOyF-FZ7uA/o.jpg"
      }
    ],
    "user_id": "AwrTMmmK0xu-bFK4Bkd9Xw"
  },
  "08DiNdc_XylMVh9etlL5YQ": {
    "date": "1/14/2011",
    "text": "Not a huge fan of \"gastro pubs,\" but this place is pretty cool. Really enjoyed the fancy beers I had and the atmosphere. Very friendly & knowledgable bartenders who took care of us quickly even though they were slammed. Haven't tried the food yet.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "411MfS_Bl8E2A8NiG8CIbQ"
  },
  "n84O5vVXbcIPT7tC9ZWvkQ": {
    "date": "11/26/2010",
    "text": "Nice place with a good American pub feel (as opposed to being yet another want-to-be English or Irish pub). Big tables for large groups and nice big flat screens to watch sports games. Probably the best selection of beers that I've seen on the east coast. If I'm ever in Charlotte again I'll definitely be stopping by.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dkuLd0aTIhP5p7RsjuDdGA"
  },
  "YkmA2WdcteA6L-KvbySmzw": {
    "date": "1/10/2011",
    "text": "Its a great neighborhood bar! I love NODA either way. But I was introduced to this spot while I was out on a date and I have become a fan. Thanks babe, you know who you are. There are plenty of beers on tap from all over. I have very little experience in beer/microbreweries, but that's not problem for the novice. The Bartenders are very knowledgeable and if you like a beer, the menu list where it is from if you would like to do a tour of the company sometime...yaya Hefe Weis!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m2hvbZeSChqHY_aAbswX4w"
  },
  "DE8dlyEPANdymZ5TsxSBPg": {
    "date": "4/13/2012",
    "text": "All I have to say is: beer cheese and chips. You will have a higher standard of bar food after experiencing Growler's. I am no beer connoisseur, but there is always a great selection, something for everyone. Casual atmosphere - but come on the wrong (or right) night, and you're surrounded by hipsters. Sometimes live music, sometimes a DJ, always a good time and great service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tXII4ynOqIfo0H0TvjGygg"
  },
  "1y3ksSCoiSjVBwADcI9jJQ": {
    "date": "4/21/2011",
    "text": "This is where I go to drink good craft beer in Charlotte. The bartenders are extremely knowledgeable about their brew and will critique their characteristics with you as if it were a painting. Their taps are constantly revolving with great beer, which always brings pleasant surprises that I otherwise, would never have found. Growlers has that sophisticated neighborhood bar feel. Oh and food is great too! Def check this place out...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "e4YDUaSxu6806-MoAMi-xw"
  },
  "w-sXUfGq4iOXCEigCY5zsA": {
    "date": "8/13/2013",
    "text": "Let me begin by saying I didn't have any food here..so I'm not sure how fair it is for me to give them a review, but whatever. The service was top-notch. The bartender was incredibly friendly & very knowledgable. Their tap selection was not incredibly extensive, but that being said, the ones they did have were very wise choices. Also everything was very fairly priced. I had my first oyster shooter of my life here. And although it was a little rich for my pathetically sensitive stomach, it was awesome. As I mentioned this was my first, so I was unaware of how they're normally made. Growlers' starts with a fresh oyster, topped with pepper absolut (vodka), cocktail sauce, lemon juice, & fresh ground pepper all mixed together. It was by far the most flavorful shot I've ever had. Apparently many places make theirs with crappy beer, yuck! After such a divine beverage experience at Growlers I cannot wait to come back & try some of the food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FtHEH8uAV3AQBoHwUw-HfA"
  },
  "kdJucBOpkSWJW6uNLqBtmA": {
    "date": "3/25/2012",
    "text": "We'd been looking forward to trying Growlers, especially the Reuben in the Observer sandwich contest. We went at lunch time and had terrible service!! The place was full , but not packed. We were never offered menus and were ignored even though we were sitting at the bar. I guess if you're not in the cycling crowd or a regular, they don't want you in there. After 30 minutes we left.... Hungry!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H9pp3z4TcWEmaToUEsicwA"
  },
  "sI-HnW2QOTaf9uhe7eaERw": {
    "date": "6/2/2011",
    "text": "Food was awesome great atmosphere gotta check out their brunch on a sunday.....and the hot dawgs are made in house.....yeah",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ZlBgVsg4Jw_S8LrjtlQ2w"
  },
  "Y9uANcqXUxLCjyY-xKKGnw": {
    "date": "11/1/2011",
    "text": "I have only been in Charlotte for a few months, but I have been to Growler's 3 times now for their monthly Beer Education Night. It is becoming a favorite monthly event for me.  The event is not just a lot of fun, but it has really taught me so much about beer! I have found that the staff is kind and friendly, the food is great (they stuff their own sausages) and the beer is always part of a great selection. I can't say enough good things about this place. They know their beer and they know 'em well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oY2tisf4tfWdUG7KSFRTsw"
  },
  "5Ttci-bV2wmWco8fntlIfA": {
    "date": "3/29/2013",
    "text": "Great find in the heart of NoDa. Crowded on a Thursday a night, good mix of crowd. Good beer list, but not so much on the spirits.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nUbGsWwqyrLyUwyU4QsSSw"
  },
  "uz4Rx445xkhlG4shCvKR7Q": {
    "date": "6/11/2011",
    "text": "So I dragged some friends here while we were all visiting from various parts of the country... 'figured the boys would appreciate the \"bar food\" & beer... & meanwhile I would get some really GOOD food (as per what I surmised from fellow yelpers) & also get to watch the nba finals.  Well... can I just say my expectations were far surpassed!!    To start the place had a fantastic vibe to it: welcoming, comfortable & yet still appealing to an eye that likes design... & as far as those who run the place... AWESOME folks!  Drew took great care of us... made excellent recommendations for both food & beer.  The beer selection had something for every taste & the food was incredibly fresh.  My hubby chose the sausage platter & Drew suggested the hot dogs (they make them fresh)... it was the best hotdog either of us had EVER   had!  I am a sucker for both pesto and portobello mushrooms... so I had the pesto portobello panini on marbled rye & I was not disappointed... but after trying the hotdog... the next time we are in town... hot dog it is!!  I also had the sweet potato potato salad... really nice... first time for me to have sweet potato in \"salad\" form.  At the end of the meal I wanted just a taste of dessert & REALLY wanted the banana pudding with irish shortbread.  Since I only wanted a taste, I threw it out to the group... trying to get others to agree to help eat it.  They all declined.  Drew told me to just get one & he promised they all would join in.  THANKS DREW!  Oh & DID they EVER join in... they ate like starving monsters!!  I was only able to snag 3 spoonfuls (literally).  This was not what one expects when they hear \"pudding\"... it was more like hot smashed banana over shortbread with fresh whipped cream...and IF you like banana... I HIGHLY recommend it!     Everyone left happy as clams thanks to this awesome establishment!  Looking forward to another trip to Charlotte in order to eat/ drink here again... & to try Jeff's other place next door (the Crepe Cellar)... whose menu looks fantastic!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kr7NKWAaSDskgC-kxu6AJA"
  },
  "2SoWyegTGbXM8OL1Xo28tA": {
    "date": "2/18/2011",
    "text": "I've been to Growler's twice now and have had a pleasureable experience both times.  I dig the atmosphere and am a big fan of the warm beer cheese dip.  The first time my fries were fresh and hot, the second time, not so much.  The oysters were good though small and pricey.  The hot dog is fantastic w/ their house-made relish. Nice beer selection on tap.  We will go again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jHKeOgT8ZRTXk3Q8XQ7uhA"
  },
  "-ePGHE6s2w6dJeZ0mH1byQ": {
    "date": "7/7/2011",
    "text": "Reviewers said order pretzels and hotdogs. Ordered them excitedlywaited. Then twenty minutes later was told they were out of both. On a Sunday at 6. With six people in the place. Worst service ever.....shift change and was forgotten in the process. Had to go to bar and ask for drinks then for the check. Turkey sausage was cold and on a cold bun. Very disappointed.....never again!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WVyIMqFvQHvhbPCztRbL_Q"
  },
  "jWHyBkhkiiwMAO2s5GoTTA": {
    "date": "10/21/2010",
    "text": "I've not eaten there in about a month (I have stoppped in for beers/drinks and have never been disappointed, (but the comment on CASK ALE being in a pitcher in a frig....WHAT!!??@?!@)), so I can't comment on the food recently, but judging by these posts, there's quite a few serious complaints about the shrimp and the service. Same complaints on both fronts: shrimp are small/slimy/taste-smell bad and service is rude/non-existant/slack. The shrimp problems's easy to fix: get bigger shrimp and boil 'em longer w/better seasoning. The help problem is a bigger question, like I said I've never had bad service but have dealt w/mostly bartenders. And I have noticed that even when its crazy busy, there does seem to be a lot of standing around, or else Chinese firedrill type stuff where someones running around trying to match food w/a table. And there IS one waitress there who I've seen/been waited on at other places who wears her attitude front & center, so I'm betting the customer altercation someone mentioned was her's. C'MON GUYS, you run a fabulous place next door and have a great start on a great idea here; fix the food issues and get your managers to get control of some of your staff!!!!!!!!!!!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "OrDjTUUA8z8p-FJQ5OjNag"
  },
  "Nx7Mb-2xHuJ3XLTm7lMzdw": {
    "date": "9/23/2010",
    "text": "What's there not to love about this place? Went on a weds night about 1030 and the bartender and one server easily accommodated my party of 11 folks with enthusiasm. Maybe they were slow? Who cares, I hope the attitude is like that no matter the night or time. A local buddy suggested a specific dog off the menu (sorry i forget, long night...)The bartender said they were out of that one but I'd probably like the Texas sausage dog with pepperjack infused inside it. 1. Thanks for not telling me \"sorry about your luck\" and leaving the menu minefield up to me. 2. That dog was delicious. The sides of sweet potato salad (yes, actual sweet potatoes) and baked beans I had were great too! Happy with the service, happy with the food. Even the homemade rootbeer float shot was fantastic. With homemade rootbeer, what?!?! I definitely plan on going back next time I'm in Charlotte. Great needed addition to the NoDa 'hood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "VknBCo2BW6RoX8I0-Ss6pA"
  },
  "NppugH10CbFGHY8RpiN9MA": {
    "date": "5/22/2011",
    "text": "Growlers has good atmosphere, homemade pretzels with delish dipping sauces (who knew?), and a good selection of beers on tap.  Gets a wee bit loud with the music on the intercom, but overall, a great place to get a group together in Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S8E5vntpTPWHEjDgF4S0pw"
  },
  "D_PfOj17lOdMV2-kfqjQXA": {
    "date": "9/23/2011",
    "text": "Great food and beer selection. The service was inadequate.  They really need to reevaluate the level of service they are providing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-6TbWMyaZJOBfRJqbZk2_A"
  },
  "v-1LTI6q-sALI1nrj6-R3A": {
    "date": "6/26/2019",
    "text": "Haven't been here for awhile so stopped in tonight for some food and beers. Bartender was a total a**hole. Usually great food, drinks and atmosphere, not tonight. I won't be back, there's so many choices in Charlotte these days. No reason to come here and deal with rude service. Not so trendy anymore!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m5kmMpAwrFPBBnX1YIU1Ag"
  },
  "lWNLQSPFUam08NZTDW1PMA": {
    "date": "10/27/2018",
    "text": "So.....  what's new with Growlers???  Still awesome - great selection of beer and drink, along with awesome food.  They haven't really changed up the menu much....  but to be honest, they're doing what they do really well - so why change a good thing?  Today, our bartender chased us down for a block because I left my beanie (or as some would say - toboggan??) at the bar.  He didn't have to to do that - but it shows how these people care.  We will keep coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vfo-9gJjyi1_S9au98zYGw"
  },
  "zWaXRxeW9aR55V4Tdtn_9A": {
    "date": "7/31/2018",
    "text": "Let me start by saying if I could give this place 10 stars I would so here goes nothing 5 x 2! This is truly a diamond im the rough. Its small in size but absolutely amazing. The ambience is perfect and oh-my-gosh the food is superb. My daughter took a bite of her BLT and was in love. I cannot say enough about this place. Everyone was friendly, helpful, and prompt!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UmsHHXMwv7vByHnbW42kGQ"
  },
  "Q3ltD1zwyzD1YaEIQUE7yQ": {
    "date": "3/21/2017",
    "text": "A quick beer here at Growlers ended up including a half dozen oysters and a Korean pork taco. I'm not sure how that happened. My mouth just ordered delicious things and I just ate them.  It's a neat little spot, lots of bashed up wood and it's kind of dark. A neat spot for an afternoon of day drinking, perhaps. Or just a cool hangout here in NoDa if you're looking to try something other than a brewery.  Yep, they make drinks here and there's a draft list of about a dozen or so local beers.  Cool spot.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "tjVwDKGyg4iV-fWzttunuw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Six very nice oysters at Growlers in Charlotte",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tjVwDKGyg4iV-fWzttunuw/o.jpg"
      },
      {
        "img_id": "1aMjQ6S1UkLrVHYP31WQOA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Korean Pork Taco at Growlers in Charlotte",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1aMjQ6S1UkLrVHYP31WQOA/o.jpg"
      },
      {
        "img_id": "TGJ6r1OqsEtOtrB7fvBVLA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Growlers Pourhouse in Noda, Charlotte NC",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TGJ6r1OqsEtOtrB7fvBVLA/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "vqtchAq6kUvsLDt6p3L1Ew": {
    "date": "7/14/2018",
    "text": "Charlotte native currently living in DC. Im in town visiting family and decided to support some of the local businesses on Davidson. I've heard this place is a decent spot for drinks in the NoDa. Here is a $10 pour of Pinot. I was definitely disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OPHYc3Tsy1BT1dQm-OI4Mw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OPHYc3Tsy1BT1dQm-OI4Mw/o.jpg"
      },
      {
        "img_id": "EiZTDqtM_jr-GQgx9qNY7g",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EiZTDqtM_jr-GQgx9qNY7g/o.jpg"
      }
    ],
    "user_id": "32jEaSJAin3gN4MHXTUN3w"
  },
  "0o8R7DuRFa_izM7WX5okAw": {
    "date": "4/2/2019",
    "text": "Living in the neighborhood, I must say this was only my third time here. The food is good, the drinks are on par with the neighboring choices, but the customer service is just short of being complete trash. The last two times I've gone with a group, we all walked out feeling the same way. Each time ordering more than just drinks and treated as if we were bothering the service staff. Don't have a self-seating establishment if it's a bother to leave the bar- walk 15 steps and serve paying customers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IquQKsGBNFf2JEhKr29tVA"
  },
  "aU35GXbi8PPA7dbh0qPNJQ": {
    "date": "3/2/2018",
    "text": "I had the Sangria and the apple pie whatever drink!! BANGING!!! I was toasty when I left!! I'm definitely coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KDTS_GPqIhAv6gdZ23LzHw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KDTS_GPqIhAv6gdZ23LzHw/o.jpg"
      }
    ],
    "user_id": "T4AuRPINgYyHREFfpSEzYg"
  },
  "XBHw8Q1T9TlMdpSpTqi3xg": {
    "date": "9/18/2018",
    "text": "What would we order again? The Reuben Pork Belly Taco - order at least 5 they are so good! Fried Chicken Taco Baked Beans side (contains meat)  What we wouldn't order again - Brisket Taco - not sure why just didn't like it Brussel Spout Salad side - too much dressing  And I love smelling the donuts.  They make the best donuts next door!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g4KtDgbJaIHlLUFCs54tIw"
  },
  "GAlU9GnJvCPhcAvxxM79Lw": {
    "date": "1/26/2019",
    "text": "Horrible customer service. Felt very unwelcomed and waitress was so rude. If you're from out of town, do not come here especially if you're a POC. Tried breaking the ice with asking about the name of our alcohol and she responded \"I don't know. You ask for the cheapest and that's what I brought you.\" We were in and out in 10 minutes. We had high hopes seeing the amount of people but it sure felt like they did not want us there. Beware.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "72zDaYdpETWX0NqdWx2g2Q"
  },
  "S8C4B1ZiYwf85ETP1eiKfA": {
    "date": "1/18/2018",
    "text": "Growler's Pourhouse has been noted time in time again to have one of the best reubens in Charlotte. I had to try it for myself - it was without a doubt the most overrated sandwich I've ever eaten.  I was excited to stop into Growlers as part of my reuben adventure after all the hype I heard about this particular reuben (and seeing in mentioned numerous times in the Charlotte Agenda). I don't think I could have been more disappointed.  I'm all about creativity for a chef - it's great to deviate from the classics and find a new combination of flavors to fall in love with. I tend to do that every single time I cook. I know this was the idea when they decided to use juniper berries in their red cabbage kraut, but the sweetness of the kraut overpowered the rest of the sandwich in a very negative way. The corned beef was pretty good, the cheese was non-existent, and then bread was way too thin leading to being under-crisped and quite soggy on the bottom. If they had used standard kraut on this reuben (which pretty much makes it a classic reuben, which I understand they were trying to avoid), it was have been a pretty good sandwich. But the sweetness provided by that kraut just didn't work on the reuben.  I understand the people at Charlotte Agenda think this is one of the best sandwiches in the city, but it wasn't even in the top half of the reubens I've tried in Charlotte.  As a side note (after I posted this review) I received a message from Growler's and very much appreciate that they reached out just to let me know they appreciate the review and were sorry I didn't enjoy the reuben. I'll likely be back to try  something else on the menu instead.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7_lV2MDzsYBkZDJ9W7-sPw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. The reuben at Growler&amp;#39;s Pourhouse - vastly overrated",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7_lV2MDzsYBkZDJ9W7-sPw/o.jpg"
      }
    ],
    "user_id": "cEnN_26ZLSXtHIwVfiDMqg"
  },
  "w24BsI-lZEVyKZTzd3LONg": {
    "date": "6/1/2018",
    "text": "I used to LOVE Growlers and would go at least once a week for YEARS.  I love the bartenders, the beer selection, the cocktails and the food (although the new peanut hummus is NOT good & the salads are ridiculously priced).  That being said - I have only been to Growlers once since the opening of Reigning Donuts.  Do NOT step foot into Growlers if you don't wish to smell like a giant, greasy, fried, not-even-good donut.  I made this mistake once and had to immediately go home to shower and had to get my clothes dry cleaned.  The smell is disgusting and sticks to EVERYTHING.  I will not be back until they figure out some ventilation system that actually works or the donut place closes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "9lVm8Lqz0X9anpG1LqoxGA"
  },
  "SXCZTLuUNwsiwtDEfzpWNQ": {
    "date": "1/25/2018",
    "text": "This is a great place to stop by in the heart of NoDa. Full bar with a great selection of beer and liquors. The food is great as well. They draw you into the bar with the smell of the popcorn machine they have in the corner--and keep you around with the affordable food options. They have a daily assortment of oysters which is really cool and the staff is incredibly friendly and knowledgeable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z_HF-s0YwzWW9qr8w8Fjsw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/z_HF-s0YwzWW9qr8w8Fjsw/o.jpg"
      },
      {
        "img_id": "5mTaReptSxkWyPW30cCdBw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5mTaReptSxkWyPW30cCdBw/o.jpg"
      }
    ],
    "user_id": "ehqxXKlMjg0H3FkxCySXiA"
  },
  "5x0Hz-OiIzg25VuHw6xtHQ": {
    "date": "1/22/2017",
    "text": "Oyster shots!!! Yes!!  I love oysters shots...they are so delicious.  I have been coming to this bar for a few years now.  They actually have a good selection of craft beer..which I didn't really notice until recently as I only popped in for an oyster shot or two.  It can get packed and seating is sometimes limited.  I have never eaten here..so my experience is based only on drinks and service.    Service is good...they servers do the best they can, in my opinion..sometimes it is difficult to give everyone the attention you would like when it gets crowded and overwhelmingly crazy.  Understood.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_0JQZ83ZLKamFemK8V6NXg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_0JQZ83ZLKamFemK8V6NXg/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "4mubOP6USLIYTxGnu1l5Dg": {
    "date": "12/29/2018",
    "text": "If they gave an award for the rudest waiter, the guy last night would win hands down. This guy is always the absolute worst. If you hate your job that much dude, please leave. Every time we go in, he is walking around with a scowl on his face & will ignore you & make you feel very uncomfortable. We love the food here but, probably won't be back because of this waiter/bartender.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "60kcMpfsS-bsf61Wbu0nlw"
  },
  "BxYaBNibYHkikHAyf8u4Hw": {
    "date": "10/25/2018",
    "text": "Had to update the review since the new donut place does interfere with the smell of the place. Also the wings aren't seasoned as well. Still one of my favorite places in Charlotte. Hopefully they do fix the smell it is a very strong scent that sticks to you.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "uS3rS4CJSWLebU2_-aV7sQ"
  },
  "F2Faq8HgTfIiqiF4Z9dLFw": {
    "date": "10/25/2016",
    "text": "I fell in love with this place and would definitely come back if I'm in the area.  They offer great variety of craft beers and house made cocktails. They have flight option, which includes four different kinds of beer from their menu. I recommend trying it if you don't know what to get. You can even sample before getting a whole glass. The pumpkin pecan mule is delicious, refreshing but not strong.  I didn't have the chance to check the food out but it seemed pretty good from what I saw on other people's table   We sat at the bar and really enjoyed our conversation with the bar tender. She was really friendly and helpful, recommended us a few places to try in the area.   I really liked the ambience and definitely recommend this place for a date or chilling with friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7a5BnjvhYuB6aLXmvQkWIw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. On the left is the Peach pecan mule and the right is the flight of four beers",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7a5BnjvhYuB6aLXmvQkWIw/o.jpg"
      }
    ],
    "user_id": "du9DdBdEG8gkfxivYGn4JQ"
  },
  "L3z_AVar5v8ngvIoUIm3EA": {
    "date": "9/26/2017",
    "text": "A pourhouse indeed!  Belly-up and take your pick of a variety of great beers on tap!  It's dark...looks dank...feels warm. There's a mishmash of locals and the patrons range from their twenties into their 40s and 50s.   Enjoy a booth along the wall...join the community table in the middle of the room...or belly-up. There's limited space...but you'll be fine if you get in before the late-night begins. You're certain to enjoy the other patrons as well. A generally great vibe can't keep its mits off of Growlers Pourhouse.  Try: The Founders DKML  Avoid: Expecting to find a seat on late-night weekends",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cx4-WfPgm1Jxurtd83I83g"
  },
  "2Ds3Lo5FNbWDSHTKina4WQ": {
    "date": "1/28/2019",
    "text": "Good food, good drinks, good people! Attended an office holiday party here, Beth the bartender worked her butt off for us, she was super attentive to our group.   It's also a great place to post up for a Sunday Funday and catch some football games. I was there two weeks ago on a Sunday for a Bell's draft release and caught some of the playoff games. So glad to have this place in my neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pUCfJ8HbmQrfxiob4p53zQ"
  },
  "WWZLQo4yI8iozhuxgu9n6g": {
    "date": "5/28/2018",
    "text": "Stumbled in here because our planned location was closed by the time we made our way from my favorite brewery down the street. So happy we did!  Ordered the pimiento cheese app, reuben and wings. All excellent! We will go here for dinner again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zbsLBD0AynOvmJGARkTSLA"
  },
  "8W4QnXFakVIZ_AgVhq6RfA": {
    "date": "4/14/2018",
    "text": "I've lived in Charlotte for almost 2 years and I'm ashamed it took so long to try this place out. We tried it Thursday for lunch and it was great. My girlfriend and I both had the Reuben. It was hands down the best Reuben I've ever tasted. They had a great beer selection as well. The bartender was very knowledgeable about the different beers (I told him I was interested in trying a new style of beer) and let us try ones he thought we would like. The next time your in the NoDa area stop in and have some lunch and a few beers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_HPeXaYPxC6wlsuEK-8YEQ"
  },
  "3xcwA-1B9LEA9lg1cfYXmw": {
    "date": "4/5/2015",
    "text": "oysters were good, I had a smashed club sandwich, nice portion.  Beer selection covered a variety of style and origins.  Visited on easter sunday, plenty of seats for us to choose.  Staff attentive since it was pretty slow.  An up and coming neighborhood it seems.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dsSVUtdLHtJ6XNgdWpBi5g"
  },
  "8Zs3uvpg-Lg4uOxlUzoYZg": {
    "date": "11/12/2012",
    "text": "First time at Growler's was on their Beer Education Night that they host on the first Tuesday of every month.  This was a treat because the chef from The Liberty was also there with an assortment of pickled goodies to pair with our samplers.  My girlfriend and I had a blast talking about the beer and the pairings with others at the bar and ended up making some new friends.  Also, LOVED Steven-the bartender- who made the BEST Old Fashioned (the cocktail) I have ever had.  Steven--the muddled fruit and rye whiskey was PHENOMENAL!  Thank you!  I will be returning soon!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VP0jOO0u-z0JIxZ52bQtJw"
  },
  "xU_kE3US4o-BvDZsuW6y5w": {
    "date": "10/13/2012",
    "text": "Love this place! Great beer selection!! We had dinner at The Crepe Celler then can here for a drink (same owners). This place has a great atmosphere and friendly staff.. Perfect place for beer enthusiasts!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O-nb7z-iqeXGT1i-98HvUQ"
  },
  "Y915u0neioSPRbwh1ndhEw": {
    "date": "3/6/2015",
    "text": "Only had their Reuben and sausages but both were excellent - can't wait to try other items",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IiptgRufX7_HizT8JCD4fw"
  },
  "rkLfk-TUYKptrSsMVUGVEA": {
    "date": "6/15/2015",
    "text": "Decent beer selection. Bartenders are pretty bad to be honest. They rarely smile or talk to you, even had one who after I ordered a drink for my date, made a different drink entirely. Do yourself a favor and check out the other spaces in NODA. This place is way over rated.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5w2NPG-2wyGielcrAh__qw"
  },
  "7Y9rZiHe4ac4tOyG48lGPw": {
    "date": "10/19/2011",
    "text": "Bottom line, I like this place.  The interiors are fully of big chunky wood furniture that give it a old feel.  The food is brought out tapas style and overall I've never had anything bad here.  My girlfriend and I usually munch on the mac and cheese (YUM).  They also sometimes hold Beer 101 learning events here so that's cool too.  Right now (October) they have a pumpkin ale that incorporates a glass pint with cinnamon sugar around the rim (like a salt/sugar margarita).  Probably my favorite beer of the season.  I highly suggest you try out Growlers for a cozy, cool spot for a bite to eat and good spirits.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "e8ja5EUjM0JExwFy9wpe9A": {
    "date": "5/31/2012",
    "text": "Great food. Great beer. Horrible service. The two blond bartenders seem to loose focus on the reason why they are there.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lnp5qQ5_dpp49Ci7kWjIRg"
  },
  "dAd7AfyigxpH83EKQB5tJg": {
    "date": "10/27/2010",
    "text": "Best neighborhood bar in Charlotte! I'm in here two to three times a week and not only is the beer selection great (CVB Pumpkin is yum!), the bar staff are amazing people! Thanks Drew and Colleen for making us feel at home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z-mIptnsjqdiRkQW4Zq_bg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Grooooowwwwwwlers is awesome anytime! Head to NoDa for A great Howllowen!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z-mIptnsjqdiRkQW4Zq_bg/o.jpg"
      }
    ],
    "user_id": "8AdQca4DDkBvtx4BhGPMCA"
  },
  "tNNAQybTSKRRsDOnBE9D2g": {
    "date": "7/3/2012",
    "text": "After The Blind Pig, we headed to Growlers for our next stop on our NoDa pub crawl on 6/30/12.  This small place was jammed packed when we got there, but the servers at the bar were quick about getting our orders filled.  Very good variety of draft beer options, but the best part was the oyster shooters, which other than an oyster, I am not clear on the other ingredients.  Kind of tasted like a bloody mary with and oyster in it.  We headed out of Growlers pretty quick, but I would definitely return for some food and drinks, probably at a more quiet and less busy time if that exists at this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GqJRlbga27rUpolN-SP9Ig"
  },
  "g2B89Ht5kLswBm8ggVLrKQ": {
    "date": "11/30/2011",
    "text": "My review should really just go something like this: NOM NOM NOM GULP GULP GULP NOM NOM, but I'll get a bit more descriptive for my fellow Yelpers.  Like almost everywhere I go, I had a LivingSocial deal to Growlers Pourhouse. I pretty much only bought it because they had soft pretzels on the menu and I'm a huge sucker for soft pretzels, but I sure am glad I did! Growlers does not disappoint. The crowd on a Sunday night was, um, eclectic? But what do you expect at a bar on a Sunday night? The service was fantastic, thanks to the fabulous Colleen and kitchen staff. The food was actually surprisingly good too, and boy was it cheap! A huge pretzel is only $3.50 and a trio of delicious dips and whatnot is $13. We literally ordered more food than two humans could possibly consume and BARELY used up the LivingSocial deal. The pretzels left nothing to be desired and were soft and salty and awesome with the beer cheese. The pimento cheese and chips was also incredible. As a recent convert to the wonder of pimento cheese, I can honestly say this was one of the best I've had...but that could have been the beer talking.  Speaking of beer, man do they have a good seasonal selection with extremely reasonable prices! I can't remember what all of the beer specials are on a daily basis, but I do remember that on Sunday nights PBR is $1. ONE DOLLAR YA'LL! Say what you will about PBR, but it is a truly refreshing beer...especially when it's only $1 for an entire pint of refreshment. They also have a lot of really good local and seasonal beers, for relatively reasonable prices. I believe my Rogue Hazelnut Brown was $5.   Overall, I was very impressed with this place. Great service, awesome music (apparently it was impromptu 80's night), cheap beer, and totally decent bar food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_r97WFqU9dj0_QgwbiISxQ"
  },
  "NIQSpy_C8gwN6M4QTI4sbw": {
    "date": "7/27/2011",
    "text": "Grabbed some beers with my girls after a long week. Growlers has an amazing ambiance. If you are looking for that pub feel this place is perfect! The beer selection is fantastic! They ran out of Bells Amber while we were there, but that gave me the opportunity to try some other ones I wouldn't have gone for. We split a dip sampler which included humus, salsa, and beer cheese. The salsa was pretty spicy for my taste, but amazingly fresh! We will definitely be back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "jVuyNd_1xknblSSBQYNAEw"
  },
  "9mlnUzJexbItSFZLx9G_lg": {
    "date": "6/3/2012",
    "text": "I want to love this place. Atmosphere is warm and friendly and the interior is attractive and sophisticated without being pretentious. Great beer selection...especially draft beers. (founders, noda, dogfish head, etc) Unfortunately, the service tonight was painfully slow. We waited over 40 minutes for our food on a very slow night. Once we.got our food it was 25 minutes until the server.showed.back up. Seemed to be an issue of being understaffed. The shrimp was slightly undercooked and the brat bun was stale. Hope to have a better experience next time. The place has a lot of potential.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "autNAJmn50rrMiq4qTbGhg"
  },
  "I8KKJsmKLA48lTvTVM2L2g": {
    "date": "3/21/2012",
    "text": "Love this place.  great food and beer selection. great rustic atmosphere.  definitely  try this place if in NoDa.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JhFK9D3LYl23Se3x4oPUxA"
  },
  "3fEOyocEuA3b93h9CGTl6A": {
    "date": "2/1/2011",
    "text": "I really wanted to like Growlers.  i'm a huge beer nerd and they have nerdy beer, so you'd think it would be awesome, but no.  The service was absolutely horrible.  The girl didn't know anything about beer (our friend wanted something similar to a belgian and she couldn't even come up with any sort of answer)  and every beer tasted skunky, something must be up with their lines.  There was one other table of folks and a few people at the bar and our glasses were empty for at least a half hour.  We ordered pretzels and they were akin to those frozen grocery store pretzels, not a fan.  We left as soon as the beer tasting was over and headed to Jack Beagles.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "NmC_ZemjAQ6TvzgeaAuTmA"
  },
  "e6zFpK_gCrEcHR2D0NnKUg": {
    "date": "5/16/2014",
    "text": "Casual but nice bar with a very chill crowd, good quality craft beers, and unique food menu that includes house-made sausages and a few varieties of oysters on the half shell. Great place to go in the NoDa area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "abqwHM7qfq6UZVdXeJkaMg"
  },
  "iunfBHxJ3tzYi9172IfX4w": {
    "date": "11/11/2011",
    "text": "I've been meaning to get around to Growler's for a while and finally got the chance to spend an hour or so there last weekend.  The beer selection was good, as anticipated, though a little pricey, as anticipated.  The food was good as well.  I had a delicious brat and sweet potato salad.  I was hoping for a little more personality in the place, but there wasn't anything too unique - dark wood, dim lights, booths, tables, chairs, chalkboard menu - you know the deal.  It would be a good place to stop for a drink or two while you are in NoDa but I wouldn't make it your sole plan for an evening out.  Tip: if you get a seat near the front windows you can have some good Davidson St people watching.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f47N37WU1_PsQKxvZdaTwA"
  },
  "35IL0D8_zMQ2siNMiUMOsQ": {
    "date": "10/31/2010",
    "text": "What a great spot!  I have been wanting to try this place for a while and I really like it!  Great feel, cool bar and great beer selection.  Got some Old Chub, the PBR shrimp and some mac and cheese.  Soo delish!  I saw other reviews where the shrimp were not good that day, but we must have hit it on a good day!  Huge delish cold shrimp served with cocktail sauce with a touch of horseradish...so good, great app to split with two people.  The mac and cheese is fantastic, it is a white cheese and big curly noodles with parm on top.  A touch of pepper in the mac and cheese makes it feel like home...yummmmm!!!!  I will definitely be back - we were out with those apps and two Old Chubs for 22 bucks!  Not bad!  :-D",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "htiVdsiY_rBmJc65aZ3YAA"
  },
  "f3wiLEwMHfnN_pLsNcVpXg": {
    "date": "10/19/2010",
    "text": "Please do not serve me mealy shrimp....  I live in NODA and I really want to start to like the places in my neighborhood so I don't have to drive far and can walk!!   Came in and sat up at the bar. The front door is really beautiful (Old, wooden, big) the rest of the decor is kinda like whatever...doesn't really look finished. Nice girl behind the bar, asked her about some of the beers she let me try two one being the Cask beer, which surprisingly I liked but I would've liked it a little colder. I know, I know I'm a silly American!!    We started with a pretzel that was barely warm, but the mustard was good. Also had the homemade chips with beer cheese, the chips were good but the cheese had a weird texture and was again not very warm. We then moved on and had the peel and eat shrimp, they came in a pint glass and I could smell them from the window that they sat in for a while....they were bad, WARM, mealy, fishy, and mushy!! I took them and put them about a chair away from me because I thought I was going to get sick from the smell! In an attempt to get the shrimp flavor out of our mouths we decided on the Italian Sausage with onions and peppers. NO flavor at all, and once again not very warm!! This time being because the servers were busy standing there talking and not ready to bring us our food...they all were staring right at it and continued to talk, then walked away, then came back for it! Very frustrating, I almost got up to get it myself! I mean that way I would have had it when it was hot.....well maybe!!   This place had maybe 5 people in it so not a very busy night I just thought that with it not being busy it would've been better....I was wrong! The only saving grace to this meal was when we got our check and it was thankfully not that expensive!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "SCqaYcRbmXKm6vgyMeIYfg"
  },
  "L2ES2TPvf4KfELeDe9d3fg": {
    "date": "8/21/2012",
    "text": "Cool place in the NODA area of Charlotte with approx 15 beers on tap.  Neat decor with dim lighting and old doors reused as tables.  Most interesting aspect for me was the four cask tap handles behind the bar.  Only two were in use the night I went but it was really cool to see them and drink some cask beer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zalj5Hsxbsga8xPecZ_8Og"
  },
  "NTo31rTv8JMfalwa6oowmA": {
    "date": "7/13/2014",
    "text": "All about the details. Great beer selection, free popcorn and great food. Also, the bartenders are very attentive and do the little things like scratch off beers from the menus if the keg is gone (imagine that idea!) so people won't get their hopes up on something only to find out they don't have it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i3MUxHkVs4iGUwUpi6td6w"
  },
  "JLbLqupDKzLa5lLZ51XY2Q": {
    "date": "7/13/2019",
    "text": "Been here twice for two occasions and am a little mixed.  Whats good: Reuben is INSANE. Would go back any day for this and the beers were solid.  Whats not great: When it gets busy at night, the bartenders get cranky and rude. They barely even acknowledged us and then when we asked to close out immediately they got angry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P01S4NjVZe6E56Ov-WWomA"
  },
  "h3PVazzs3ruOPxKNKqoU7g": {
    "date": "8/15/2019",
    "text": "This place is cool.... for the tacos. I wouldn't think to get tacos at a place like this; however, I highly enjoyed them more than the fries and wings.   My friend and I asked for our wings to be cooked crispy. I haaaaate woogly skin. And what kind of skin did I have on my wings? Woogly.   I ordered the jerk and the flavor was good, but I guess they weren't jerky enough? My friend tried one and she said they were okay. I tried her spicy wings and they were meh. I make better wings. She also had woogly skinned wings. The spicy wings are not spicy... at all.   The Poutine is okaaaay. I shared a basket with my friend and she liked them, but they were missing flavor and salt IMO. I think the gravy wasn't executed well and/or there should have been more bacon. And the cheese curds should probably be cheese sauce. Perhaps this would have added more salt and a little flavor (if the quality of the cheese is good) to the fries.   The tacos were fabulous for $4. My fave was the Korean pork belly. There was broccoli on the taco. BROCCOLI! But the flavor was awesome. The other taco was aight. It was just meat and salsa, but it was a whole lotta meat. Kind of reminded me of the roast beef sandwich at Arby's which I don't like. But I'm only referring to the ratio of meat and sauce.   I'd go back for the $4 tacos. You really can't beat that price for what you're getting.   Also! I'd bring my own bottle of water. What is it with people putting their bare fingers on my straw???!!!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vtFu4EMUKMgdXEB5dmtlOg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Poutine (Aka Gravy Fries)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vtFu4EMUKMgdXEB5dmtlOg/o.jpg"
      },
      {
        "img_id": "_vxInBOooOf-kY_TrfjRQA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Jerk Wings W Celery &amp;amp; Blue Cheese (1 Dozen)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_vxInBOooOf-kY_TrfjRQA/o.jpg"
      },
      {
        "img_id": "aBSFkKITgo0qSQ87e5RjqQ",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Korean Pork Belly Taco  AND   Brisket Taco",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aBSFkKITgo0qSQ87e5RjqQ/o.jpg"
      }
    ],
    "user_id": "yy7shAsNWRbGg-8Y67Dzag"
  },
  "zY_ekutXfa_IIruBBqbTPg": {
    "date": "8/13/2019",
    "text": "Some girlfriends and I recently came here for a weekday dinner. Two of us shared the poutine fries. I had the chicken taco. One of my friends had the hot wings (she asked them to be extra crispy) and a salad. My other friend had the jerk wings (request for extra crispy) and two tacos (not chicken but I can't recall which ones).   The tacos were amazing! We loved them. I liked the poutine fries better than my friend (although I think salt helped them). The wings were rubbery and definitely not extra crispy.   Before my friend and I decided to share the poutine fries, I asked if I could order a small order of fries and pay an upcharge to make them poutine fries. I was told I could not. This perplexed me. They have the ingredients and I was willing to pay more for them. It didn't seem like a crazy request to me...    *shoulder shrug*  I'd come back to this place for the tacos but otherwise, I wasn't wowed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pgQ_kYzZsy55mlOP3ex3Dg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Fried Chicken Taco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pgQ_kYzZsy55mlOP3ex3Dg/o.jpg"
      },
      {
        "img_id": "a640OIezF12V7cNq4zQcnA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Poutine (Aka Gravy Fries)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/a640OIezF12V7cNq4zQcnA/o.jpg"
      }
    ],
    "user_id": "QGKOTCbS-gpAMWPADGmf0w"
  },
  "hZZyQnE9oRHA2IhhEZMGxQ": {
    "date": "5/14/2019",
    "text": "I'm always in search of a good reuben and had heard good things about the one here.  Came in on an early wknd afternoon and it was not very busy, so we sat at the bar.   Bartender started off a little distant and a bit annoyed, but after a bit warmed up. So not sure what that was about, just happy it wasn't that way the entire time.  I was a little disappointed in the draft beer selection the day we went as there wasn't a lot of diverse options, especially for a place called a \"pourhouse\" and they were tapped out of a couple of options too.  The reuben was decent, but not amazing and for the price, I will be honest that I've had better.   So, all in all, an ok experience, but I'm not racing to go back any time soon. Might stop in again when in NoDa to try some other food & drink options.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "efMDfLm2k7LY6l5sg4t8fQ"
  },
  "oygx0uImL8W33BIyhszkZQ": {
    "date": "5/20/2019",
    "text": "This was my second time here. My friends and I decided to stop here for a drink and some snacks. Not sure what the bartenders name was but he was super nice and friendly. They have a nice variety of beers on tap. I decided to get the Anderson Valley Melon Gose. I have been on a sour beer kick lately and this was one of the best ones I have ever had. For snacks, we got some free popcorn and oysters. The popcorn tasted like it had been sitting there all day but we still ate it anyway. I am a sucker for oysters and they were so tasty. We got 2 dozen and asked them to mix them up. My friend also got the bologna sandwich and said it was absolutely amazing. I would say the only downside is that this place is kind of dark inside. If you're looking for a chill place to grab a bite to eat and a drink, I definitely recommend this spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "REheBJIp8f42B8ehom3mWQ",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/REheBJIp8f42B8ehom3mWQ/o.jpg"
      },
      {
        "img_id": "nMjADFF6cVYs-URYsqBFWQ",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nMjADFF6cVYs-URYsqBFWQ/o.jpg"
      }
    ],
    "user_id": "lbrm2WkPTTUKvpBXDaoZgQ"
  },
  "ZHB8X4w6MAw9RmZinjHS2A": {
    "date": "11/19/2018",
    "text": "This was a cool, cozy bar to hang out and grab a drink in before our show at The Evening Muse. We were happily surprised to see a cask ale available on draft. It was a double cream stout and at $6 we were happy with our choice. Most beers on the large chalkboard posted were between $6-8, a little more than I like to spend but worth it for the atmosphere and location. Service was attentive and quick, I waited just a few minutes. There was lots of seating options at the windows, bar, tables, and it was very full but we luckily found 2 seats. The front door is one of the coolest parts, definitely enjoy swinging open the medieval door. They offer wine, mixed drinks, and food as well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 12,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "jVF9rKcqifg0HxmA5Q2GYA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Inside is warm in winter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jVF9rKcqifg0HxmA5Q2GYA/o.jpg"
      },
      {
        "img_id": "9RJy2tePugqD4pzgKxKyVg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Bar menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9RJy2tePugqD4pzgKxKyVg/o.jpg"
      },
      {
        "img_id": "ul3VdnEbbH8dTQ_EspAIbw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Cask $6 bells cream double stout",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ul3VdnEbbH8dTQ_EspAIbw/o.jpg"
      }
    ],
    "user_id": "i_EASSNcEqc1JrfdBjBeVw"
  },
  "19M4RMt5SAV8sFLqpvweUw": {
    "date": "12/12/2018",
    "text": "A NoDa staple! Growlers carves it's own profile here in the hip neighborhood of NoDa. Lots of wooden and cozy features inside. They have booths and tables and a nice long bar.   They have a solid amount of taps plus a very unique old beer engine that churns out rare and one of a kind beers a lot. They have a different beer choice for everyone plus a full bar. Tons of events happen every week here so check their social media!   Everyday they feature oysters and different specials. They offer free popcorn too if you're just in for a drink. Growlers is owned by the same folks beside them at the Crepe Cellar. And now they have a wonderful small donut shop in the back for dessert after dinner!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tHVaQJWxIkMO0DamWIuJzQ"
  },
  "6b_Aq5-xASuPaMC7DvpXWQ": {
    "date": "5/19/2018",
    "text": "This is a great place to catch up with friends over a drink and food. The space is a little small, but cozy.   I know they are known for beers, but I opted for a sangria which hit the spot. It was fruity, but not too sweet.  They also have wine and mixed drinks.   They have a small menu, but everything was good. My friends ordered a cheese plate to share which had a nice variety. Another friend had a Korean taco which was jam packed with meat. And I went for the Fresh Off the Cobb Salad. I devoured it. Nice crisp lettuce, corn tomatoes, blue cheese, bacon and a roasted tomato ranch dressing. The dressing was perfection and complimented the salad.   Service at the table was a little slow, but staff was still friendly. There's something for everyone here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "svClxOLnyBtQMbXkjuPbKw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Korean Taco",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/svClxOLnyBtQMbXkjuPbKw/o.jpg"
      },
      {
        "img_id": "JwShmJ-xySyw20jqAkNAWg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Corn off the Cobb Salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JwShmJ-xySyw20jqAkNAWg/o.jpg"
      },
      {
        "img_id": "AbhgfwiFQ6G4way9V75U2g",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Sangria",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AbhgfwiFQ6G4way9V75U2g/o.jpg"
      }
    ],
    "user_id": "0cG35-H4SbjjTTSlNoK3fw"
  },
  "Gc5EuYyeIpNChVuc0cDijw": {
    "date": "4/8/2018",
    "text": "Review is strictly from bar.   I was really pleased with the ambiance this place had to offer. The exposed brick walls and backlit bar offered a super low-key aesthetic. Their gothic details throughout the bar (like the castle looking door as a table) was very fitting and eye catching.   The location is great for drinks before dinner (or drinks AND dinner.) The bar itself is small as is seating, but there TVs if you want to watch sports. The menu seems geared towards bar food.   Their beer list was excellent in regards to variety! I was overly pleased when I saw a unique Allagash beer on the menu (whereas most places are choosing the brewery's \"bread and butter\" sellers, Growlers chose a coffee porter from Allagash that is nothing short of perfection. Props to Allagash, and hats off to the person who orders beer!) There were other beers on the menu that also caught my eye, and the prices were what I'd consider normal for craft beer.   Our server was attentive, always sure to check if we needed anything.   Looking forward to another visit.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9eLqUaMDZDEyfMgtSdmsRg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9eLqUaMDZDEyfMgtSdmsRg/o.jpg"
      },
      {
        "img_id": "v73ATw9teImP7iGkWenkwg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v73ATw9teImP7iGkWenkwg/o.jpg"
      }
    ],
    "user_id": "sgeY29fgFqACCiUtSH1MOw"
  },
  "LWu02Ui9DDQfYn0jWqeZ5g": {
    "date": "2/23/2019",
    "text": "I've been coming to Growler's for years but after recently moving into the neighborhood, it's become one of my favorite to-go places!   I prefer to grab a seat at the bar to hang out and because of that I'm always talking to the bartenders - and I've gotta say Beth is always such a sweetheart! I'm honestly not sure where these bogus negative reviews have come from - she (and the rest of the guys) are always on top of filling drinks and making sure you're taken care of. Now if y'all could onlyyy have more sours, I'd be a happy girl :)  Also, must try: pork belly tacos and finish your night with the best donuts in town at Reigning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "boTE2Y0VFTmvuCpoZW7zVQ"
  },
  "D0_S6yqsuw_gkxX9Jwt0WA": {
    "date": "2/6/2019",
    "text": "Stopped in for a pre-dinner pint on a recent business trip. I didn't order food, so I cant speak to that but it's a cool atmosphere with a decent drink selection. The stickers on the door boast this place as being rated top 100 beer bars...which seems like a stretch. I wouldn't rush back but I wouldn't avoid it either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_pKoTtEvpjOivhhRbhfgmg"
  },
  "y4tJxsczLx3dnFuvhGtzmQ": {
    "date": "8/2/2019",
    "text": "I eat here constantly. Friendly staff and good food. Occasionally we will order something that isn't perfect, but that's like 1 out of every 12th time. They have some fun stuff on the menu. It's worth trying something new when you can! Thanks for always being a consistent lunch bite for us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9mA_pUn2JeKl4-C6Ozo7A"
  },
  "rT6xnxYKuDjPheUQqVmoDQ": {
    "date": "1/8/2019",
    "text": "The ambience, location, and draft menu are great. The customer service...non existent? After being seated, we were handed menus and told they'd be \"right with us\". We waited, and waited, and waited. It wasn't even too busy - we were seated right away. It was almost as if the staff didn't know your name or face you were forgotten about.   The worst part is we live in the neighborhood and this was our third time there -- SAME EXPERIENCE EVERY TIME. Our hopeful naivete has yet to pay off as we'd love for this to become our go to spot. Maybe fourth time is a charm?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "T8bRSvpbgdhdjZ5HKce6Ag"
  },
  "fpZUI8a70PkqR0Ki5b_UuQ": {
    "date": "5/20/2019",
    "text": "Nice place, a little small but not crowded on a Monday night. Interesting neighborhood kind of bohemian up and coming. This place is on a corner with a nice view of the street. Recommend the beer brat and fries, both are good. Beer's great, too, nice selection of taps, cask and cans/bottles. These guys know their beer!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rMFHDrlY5lunmA4QWYQZgg"
  },
  "S4jx0d4NmZX88O2W972_gQ": {
    "date": "1/31/2019",
    "text": "This is a great place to go for a chill night and you want great food and drinks!!! The only thing I would Change is the customer service I felt like the waitress was a little standoff-ish but other than that the food was great and I enjoyed the environment",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "abn-W5UCnL0O0t4M9v6tCQ",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/abn-W5UCnL0O0t4M9v6tCQ/o.jpg"
      },
      {
        "img_id": "nhEJoT-1VG_0CYwt9v4YKg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nhEJoT-1VG_0CYwt9v4YKg/o.jpg"
      }
    ],
    "user_id": "f9dlTbGbJZlXOp9FC1nVUw"
  },
  "bcHUEpqHlbRiDfly3KlR_g": {
    "date": "1/28/2019",
    "text": "Hands down, the best bologna sandwich I've ever had. Don't let the pickles fool you, it's delicious!   This place is a hidden gem in NoDa and we'll be back! We came in a few Sundays ago for their Bells Hop Slam early release celebration and had a blast! Awesome staff and Beth was a GREAT bartender! Football, cold beer, good food.. what else could you want!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uGxNae__usK7nxmNQi9QFA"
  },
  "OV0vayA8fkWAYMwDrpRPUA": {
    "date": "2/4/2019",
    "text": "Growlers pour-house is a must in Noda. Super friendly staff and amazing Poutine! We visited with a large group but were definitely made to feel at home. Our waitress walked us through the menu and made the BEST suggestions (the poutine and fried chicken taco alone will mean I'll be back).  I'm not a big beer drinker but the majority of our group took suggestions and were not disappointed. (I had the sangria). A great place to chill with friends after a long day, casual, laid back and a cozy \"pub\" atmosphere. Perfect for anyone looking for a low-key night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B3qHk-YUOdQOKOh-gYUGOw"
  },
  "KeNlJTHweobPIx8i3I6BZA": {
    "date": "6/26/2019",
    "text": "Bartender is a major jerk.   Terrible customer service.   Not sure how they keep customers.   I won't go here again - food is good and used to be a really good place.  Too bad bc its a great location.   Staff shakeup is needed.  Bye bye GP.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-WHpE3nN9a2gSNBATpNdpg"
  },
  "z-voiV_QkYW5s8_05Q1s7Q": {
    "date": "4/2/2018",
    "text": "My husband went for dinner Friday evening with my parents in NoDa and wanted to grab a drink while waiting for another restaurant. This place was pretty perfect. My dad had been before and recommended it and I'm glad he did.   I got the Penicillin cocktail- sweet and refreshing. My mom and husband ordered another craft cocktail (dark cherry rose manhattan I believe) and the bar was out of the specialty bitters, so the waitress offered a few alternatives and both my husband and Mom were satisfied. My dad tried a beer from Wooden Robot he hadn't had before (as always, WR is my fav). We also got on the house popcorn, a cheese tray, and an ice cream cone - because why the heck not.   Service was quick and great (guy who brought the tab even brought waters just in case we wanted to sit around a little longer). They knew they were busy but were in no rush to push us out.   Definitely recommend this place for a cocktail/beer before or after dinner... or stick around for their food menu because that looked pretty good too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uCAOZSm9uOs7iT1uPIHJug"
  },
  "allNirqm0lzDWtnpwS3iYQ": {
    "date": "2/12/2018",
    "text": "This is a great place for both food and drinks in Noda! I scheduled a happy hour here at the request of a friend and I'm really happy I did.   They have a wide variety of drinks. For those that don't like beer, they have cider and a full bar as well.   Their food was the start of the show for me. We got the fried balogna sandwich and the Reuben sandwich at the recommendation of a friend. Both were amazing! I had never had fried balogna before, but this was delicious. The broccoli salad was good as well.   I would definitely come here again. There was a lot of good looking food on the menu that I would love to try!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "emenNUIhDht9QyQsWxoz-g": {
    "date": "9/12/2010",
    "text": "I was expecting more testosterone, for some reason - maybe ze German influences had clouded my hopes. But the massive door giving way to raw materials and polished concrete, the sausage party menu, the pulls meant to be grasped by some village-conquering Viking with a serious thirst, it all blended into comfy, impressive, trust us to serve you top notch beer-chic.   Oh, you wanted a nibble too?   Have a (CLT's first!!!) beer/cheese pairing party. We have 5 varieties to sample, a beer for each delicious slice. Served with crackers, honey and a comb, this could be din-din if you lean more toward a liquid diet.  Yeah, we have pretzels and mustard. The 'zel isn't homemade, and you need to order it salt-light, but tastes straight off a best-case-scenario corner cart in NYC, slightly sweet, charred, soft and chewy. The mustard, ground in back, impressive.  It's a bummer they felt a lack of confidence in the crowd this place is built to serve - we don't need the thrill of a game to coax us into dropping cashwads on really good beer. But there they are, the bet-hedgers - TVs every 5 feet.   Beer cheese needed a kick of mustard, tabasco, something. Chips came out a tad cold.  Who cares. Prost!",
    "rating": 5,
    "rated": {
      "funny": 8,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "whqfWVBj4x5EDboIVDOymQ"
  },
  "jcQ-2Qs8PMI9CgTEalmyVg": {
    "date": "8/26/2010",
    "text": "In the ever evolving NoDa neighborhood, the space that used to be Niche and was Mamalu's before that, Jeff and Paul bring you Growlers Pourhouse.  On the corner and next to their other incarnation, the Crepe Cellar, GPH is a guy's bar that is girl friendly.  The old world charm starts as soon as you walk through the huge antique Chinese estate door and it continues as you belly up to the bar next to the 1936 beer engine tapping cellar temperature craft beers.  The chalkboard menu next to the bar lists the craft drafts by genre and it is hard to ignore the local staple, Pabst Blue Ribbon.  Especially with it being $1 on weekdays and $2 on Friday and Saturday.  That beer special alone should keep the lights on.  The other chalkboard on the wall boasts the origin of their oysters on the half shell.  When you order food, they bring you an old spice (not the afters shave) box that houses your hot sauces, napkins, and crackers.  The menu starts with the lighter fare such as chips and dips, truffle popcorn, and a few salads and then takes a turn with the oysters and peel and eat PBR shrimp.  The meat of the business seems to be the sausages and brats though.  From the potentially gut ripping chili cheese dog with peppers and onions to the Veganator option there is something for everyone.  I had the turkey apple sausage with the house mustard and it was quite tasty.  The dessert portion of the menu is just as fun with marshmallows made in house for smores and nanner puddin'.  The place is peppered with flat panel televisions and has the potential to be the place in NoDa to watch football on Sundays.  If only Jeff weren't a Cleveland Browns fan...",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 12,
      "cool": 8
    },
    "photos": [],
    "user_id": "IBO0RWBMGbGziHUVq-j0IQ"
  },
  "-VskTMSLsfW-Lobwfq_MJA": {
    "date": "8/30/2010",
    "text": "Those craftbeer signs had my curiosity piqued for a while and I was beginning to wonder when they'd reopen this space in NoDa. I'm very glad for this addition to the area! Growlers has a great atmosphere that just engulfs you right when you walk in through those awesome wooden doors. From the exposed brick walls, to the beer tap lined bar, to the cool tables in the middle, Growlers is a great place to hang out with a pint of good beer. Place was packed on a Saturday night, but service was still prompt and friendly. Only got to enjoy a few beers, but will def be back to try some of the food. And by food I mean cheese. I love cheese and beer.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 7
    },
    "photos": [],
    "user_id": "53QaFbmZojYK0vv3RQagcw"
  },
  "cidddiJ_zDtDkSSKkgnJMw": {
    "date": "9/12/2010",
    "text": "When I was reading the Yelp! reviews for Growlers before we went I got the impression that they must serve really amazing sausages and oysters because everyone was saying that's what they got. What I found our band of merrymakers got there was that the reason everyone had ordered these items is that they make up at least half of the Growlers Menu. There is a munchies section and a dessert section, but if you are looking for dinner (as we were) you are pretty much getting a salad, a sausage or oysters...or some combination thereof.   Luckily, they DO serve really amazing sausages. I had the beer brat with juniper kraut and, with the addition of a touch of spicy mustard which they brought out with our food, it was absolutely delicious. My roommate had the turkey apple sausage which came with relish and I am told was also tasty. One of our friends got the Italian sausage and peppers as well as 6 oysters on the half shell (I couldn't hear when he ordered so I cant tell you what variety). He's not much of a talker but I think the fact that none of his food survived speaks well. The fourth member of our party had the hummus and seemed to enjoy it.  But you aren't just going to a place called Growlers Pourhouse for the food. You are going there for the beer, and I doubt you will be disappointed. The back of the menu lists what they have on each of their nine taps, each representing a different style of brew. Oh and they tell you what that type is, so if you aren't familiar with the particular selection you at least know what to expect. Draft brews are all fairly reasonably priced, coming in at between 4 and 6 bucks each.  The atmosphere is classy, but not so much so that you feel out of place digging in with your fingers. Our waitress was an adorable combination of enthusiasm and information. Growlers is a must try, and if you love beer, sausages and oysters a must frequent.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "FXPGGtOlCawxz5Uw5DNF3A"
  },
  "-Na3cVgiVO-3vdDM26nitQ": {
    "date": "1/17/2011",
    "text": "Really like this place--a good place to go with a group or 4 or 5 if you can snag a booth.    Due to recent \"bun in the oven\" issues, I can't comment on their beers, but I can say that they have an excellent cask root beer on draft (Yes, on draft!!)  I actually thought I didn't like root beer, but gave it a shot one night at Growlers when I decided I couldn't drink anymore ginger ale.  Turns out, I just hadn't enjoyed a premium root beer product before, so Growler's really changed many years of thinking for me on that beverage.  Kudos for that.  I had their chips with cheese sauce one night, and it was just \"meh.\"  However, the first time I visited, I fell in LOVE with their banana pudding, and now I order it every time. It is large, heated and perfect for winter days.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FSw3Kk2Ssn6vUe9asc5vsA"
  },
  "ESIMWJZaiv-CEAJq0vnprw": {
    "date": "10/11/2010",
    "text": "I had really high hopes for this place, but really was just not impressed at all. Came in around 6 on Sunday and sat at the bar, it was very quiet. After a few minutes the bartender came by, we started w/some beers. We then decided to try the pretzel and beer cheese and chips. The pretzel was nothing I haven't had before, if it was served warm that might have helped, the mustard was good though and not spicy like advertised. The house made chips and beer cheese were decent.   We then tried the PBR shrimp, ick. I was excited at the size of the shrimp, but that soon faded when I tried them. Not fresh, mealy tasting, and some of them were so slimy that I stopped peeling and passed on eating anymore.   We decided to try a sausage. We went for the Italian sausage with peppers and onions and a side of the broccoli salad. I kept waiting for the intense flavor I usually get from Italian sausage, but it never came. It was really blah and the only saving grace was the flavor from the peppers and onions. Broccoli salad wasn't bad. We had thought about getting smores but saw them served to another table and it didn't look great so we passed.   There were 3 people working and at one point we saw our food just sitting in the window while all 3 employees walked by it, seemed strange considering there was only about 5 of us in there.   Definitely a disappointment, we would have loved for a new favorite in the neighborhood, but it really was just meh. I'd probably go back for the beer only.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Szle_N5FSs4Q7odfyd4P7Q"
  },
  "usSeg9jCd_jHXGGXWly2Iw": {
    "date": "12/13/2010",
    "text": "I came here on Saturday night to try and unwind from a stressful day. I arrived at ~midnight so I can't say much on if its usually crowded on Saturdays because, well, it wasn't. The bartenders were friendly and the beer selection was pretty damn good.  I had a white Belgian ale for $5.50 which isn't too badly priced (but a dollar more than I would have guessed it to be). I'll definitely be hitting this place up again.  Nice atmosphere and the general crowd in the place seemed nice. Makes me feel like I'm back in NY.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "52BSd0kY8AndWPrybOMMsg"
  },
  "V2L-vMhZb2EZMBv-vmSypw": {
    "date": "2/25/2011",
    "text": "First... 2 stars = \"Meh. I've experienced better.\" and I have...wish I could have gave it 3 stars.  Me and my son visited Growlers on a Friday night (2/25/2011) and we got there early, I'm glad because seated is very limited.  We checked out the beer menu (I'm a beer geek) and liked what I saw, very good selection.  I ordered a cask Victory Harvest Ale my son a black IPA...after they gave us the wrong beers we swapped...not sure what I ordered is what I got...either way my beer was not a PBR so I was good.  We ordered the pretzel only to be told they were out....ok, how the hell are you out of pretzels on Friday evening at 5:30 pm when you open at 5:00???  Seriously???  So we ordered the nacho's...they came out looked great, good taste but WAY more chips then toppings.  Actually, after we ate maybe 25% of the chips the toppings were gone and we didn't eat the rest.  Next...I ordered 2 sausages and 2 sides, the sausages were Italian and turkey and apple...both were very good.  My side were mac and cheese and chips.  The chips were very good...a little burnt which I like but the mac and cheese was PLAIN no tasting noodles and cheese.  Seriously, I had to go back and re-read reviews about how great the mac and cheese was and ask have these people ever tasted REAL mac and cheese??    Needless to say we left I guess 80% of the mac and cheese on the pate as it had no taste at all.  Next beer order was for me Hercules and my son a Yeti...both served proper and timely.  We then ordered a hot dog since our server said they were so good..and it was.  Made on site the hot dog was what we should have ordered from the beginning.....sparse on the sides but very good flavor.  I liked the place and the beer selection, but I cannot grasp how you could be out of pretzels on a Friday night 30 minutes after you open...that is poor management of a high profit, easy to make iteh and that baffles me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4jT8k_MRplRfjIYU8qFPIQ"
  },
  "NEwLb4INYuL7_Gces7hTjA": {
    "date": "7/4/2011",
    "text": "My favorite bar in Charltote. This place is small but has THE BEST panini's in the world!  They have a mean reuben and a very tasty pesto portobelllo & goat cheese panini! Love em! 15+ beers on tap and a few wines too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ib2r9DvScgfeHQkjPP3qEQ"
  },
  "y2aif76-zCGBVsKbNAn5ZQ": {
    "date": "8/30/2010",
    "text": "Crepe Cellar folks opened up a pub right next door. Small place, but it works! Walked in and sat at the bar and looked up at the chalkboard for the beer selections. Yes, an official PBR joint, but what place in NoDa isn't! That said; I went with a dark porter based on the recommendation of the bartender. It was served in a PBR glass, so it was the best of both worlds. Took advantage of the homemade menu and order the brat w/kraut. Topped it with their homemade mustard and downed it with a pint. Perfect afternoon! I'll be back soon to try many of the other beer choices. Beer lovers will enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "cwmjb-x98PK8ahAZGLWJdg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Yep...PBR on tap with lots of other great beers!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cwmjb-x98PK8ahAZGLWJdg/o.jpg"
      }
    ],
    "user_id": "c8cur4lMkQsHoUEqm-qwxg"
  },
  "AXxdRdx6ZLtFxRmqUahNag": {
    "date": "10/20/2010",
    "text": "Finally!  In every town, I'm always on the look-out for a great pub-style place - it has to be small but not tiny, have an interior with lots of character (exposed brick, dark wood paneling), a great beer selection, and a menu with decent non-meat options.  It's OK if it's got TVs for the game, but they can't be too obtrusive.  In Raleigh, I've got Mitch's.  In Columbia, I've got Hunter Gatherer.  Finally, finally, finally, I've found my Charlotte bar.  Growlers is all but perfect.  We went for the first time with a group of five and sat at one end of their wooden castle door table that could easily seat 15.  The bar tender willingly put the S. Carolina game on the TVs, and our server was clever, attentive, and supportive.  He fetched us a growler and carefully poured our glasses for us.  Among our group, several ordered the pretzel with spicy mustard; some ordered the italian sausage; some ordered the mac and cheese; some ordered the veggie sausage; and I got the poblano hummus.  All of it was great beer food, and the hummus had spice and flavor.  The pretzels are hot and soft.  One of the best part of the evening, however, were the dessert s'mores - a do-it-yourself special with the marshmellows drenched in grain alcohol and then set afire.  We ordered two and got our fingers gooey and chocolatey.  A few days later, we went back - just the two of us and a friend.  We sat in a booth this time and had pretzels and beer.  We had equally attentive service (granted, it was a Monday night and the place was pretty quiet), and the music was at a low enough level that it was easy to have a good conversation.  Thanks, Growlers.  I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "m74Y1rKAWoz_HvHRCEVbbw"
  },
  "Rylx-U3T6rsMq1bUZXEIug": {
    "date": "7/5/2011",
    "text": "My boyfriend and I were in town from Escondido, CA and were happy to stumble into Growler's and find that they had Stone beer on tap - a little piece of home! We only stayed for one beer, as their kitchen had already closed (midnight) and we needed to go find some grub. But the pint of Stone Smoked Porter was all that we could have hoped for. There must not have been anything better on TV at the time because they had some lumberjack competition showing - a little weird.  Customer service seemed to be a little lacking, but we weren't expecting much.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eVXKf3ZmUYOpW0f8DSk74Q"
  },
  "UJ9DT0-EeMr-vkOZrtGp3A": {
    "date": "12/6/2013",
    "text": "Yay!  A bar with awesome beer on tap and GREAT bar food!!!  They really have a sweet selection of beers to choose from and the food is truly good!  I had a BLT that was SO tasty!!  And...they have 21st Amendment beer on tap from SF, so I am a HUGE fan!!  Friendly bartenders and patrons - I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aND1424xk2CHyfilxZU69w"
  },
  "fooxwbyMpMtYRJf_1qtyRQ": {
    "date": "1/20/2011",
    "text": "Love this place! I was a regular at The Flying Saucer until my ex got the place in our divorce *g*...so I can attest that I like craft beer. Have not been disappointed ever with the selection and quality. Had some nice single-malt whisky nightcaps as well! Every time my friends want to go out, I try like anything to steer them here.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gnnbCcXZUVdu1FZWTcuhRg"
  },
  "v7MKExUd6OtCQU7NaBQDHA": {
    "date": "4/1/2013",
    "text": "Another NODA disappointment. Came here last night with a friend for a drink. It was Easter Sunday and nothing was open so I headed over to NODA. It took light years for the owner/ bartender to serve us and when he did, they were out of the reds I wanted. Friend was mortified by the house white. I'm keeping my butt Uptown 'til NODA business owners get some class.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fvj9dV4e6Fu5T5tM98dCVQ"
  },
  "vWm6T3DxeWLi_9Gj07PLwQ": {
    "date": "6/10/2013",
    "text": "Great atmosphere, decent beer list, and phenomenal service at Growlers Pourhouse on Saturday night.  Buck took care of us while we sat at the bar and was one of the best bartenders I've ever had.  I left wanting to be friends with him!  He offered tasters of any beers we had questions about and obviously knew his stuff.  And he just seemed like an awesome guy.    We snacked on some popcorn and ordered the soft pretzel with beer cheese.  The soft pretzel was delish (and one order is enough for two) but the beer cheese wasn't anything too special.  The beer list has some room for improvement but maybe I'm just spoiled.    When I'm back in the area, I'll be back at Growlers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r8Trb1164K98yHiOimj5Tw"
  },
  "AGw6GeAGQFGGAfTmnEOrzA": {
    "date": "3/7/2011",
    "text": "I have been meaning to try this place out for a while, glad I finally got around to it.   Growlers is situated in the hipster-ish-y area of NoDa. It stands out from the rest of the local shops with a big 200 year old refurbished wooden door with steel hardware, I am told it is from an old Chinese compound. The atmosphere is rustic, with the exception of the TVs that line the walls.   When we went in it was pretty busy, but the service didn't seem to suffer for it. The server was with us quickly and our beers were served promptly. The server seemed to have a good grasp on the beer menu, and was able to offer up some suggestions. Quick, friendly, knowledgeable service.   The menu is great pub, beer food. They make their own sausage and brats in house. The food was really good (Try the Reuben). They have about 15 beers on tap and an old hand pump cask engine (from 1936 I think). Their beer menu rotates fairly quickly, and always has several different styles represented; unlike some places that will fill their tap list with all IPA's and Imperial Stouts...   All in all, I really liked this place. Reasonably price, good food and good beer. What more could you ask for?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-EWQZjRHAKMddHW_dZTvdw"
  },
  "O2sARy20AyXjROkdJX-wIA": {
    "date": "10/18/2010",
    "text": "Wow, the power of Yelp.  I wrote that review and within 48 hours received an email from a concerned lurker.  He directed me to contact the owner of the Pourhouse, which I did.  I received a VERY nice email back which did demonstrate concern for the customer and a commitment to excellence.  I will probably return :).",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QPAYoCViLuEK-UtCsiLLIA"
  },
  "JpVBg2E-7O5j_riXX-l_pA": {
    "date": "11/1/2010",
    "text": "I don't know what it is about this place but man oh man do I have a good time.  Give me a pumpkin beer in a cinnamon sugar rimmed pint glass SOLD!.  This is definitly my new favorite Friday/Saturday Night  hang out the people are cool the bartenders rock and the atmosphere is just plain cozy.  I'll be checking think place out more often and will be back to review the food :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJafm7vGSkUI5ocgYkCWkA"
  },
  "iUu9gLo8hCNLvAPyHVHEDA": {
    "date": "8/2/2011",
    "text": "Ive been working in the service industry for YEARS in Charlotte, both in retail and entertainment, and one thing I have learned is NEVER underestimate your client.  I went to Growlers on a Monday night, which happens to be more of a hipster/rocker crowd.  I am a successful professional who loves to enjoy the company of a variety of people, and also love to spend my money with good friends.....  ....so I was shocked when I waited for (literally) 5 minutes at a bar with 7 people (or less) for a drink, while the male bartender slowly took his time putting away the glasses, counting the drawer (at 1:20am), and straightening his bar without even awknowleging my presence....until a group of 5 rowdy guys came to the bar.  He lifted his head, and saw them first before even looking my way.    AFTER he took their order,  he walked up to me to take my drink order, I said \"Oh, thats fine....you can serve their drinks first....I've only been waiting to give you my order for 5 minutes.\"  In response, he laughed and walked away.....  LUCKILY, a very friendly female bartender was attentive enough to pay attention.  Since I had already ordered a shot and beer earlier from her, she was happy to recify the situation and smooth things over.  I tipped 110% of my bill and left a note for her other bartender to \"pay attention\".  I wont be coming back EVER again...even though the female bartender was fantastic.  As a gay advocate in the community, I've been used to more hospitable and accepting treatment/service around Charlotte.....apparently there are still places where clients get overlooked.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i8_11A2Q1qa-iFZOkiSS6g"
  },
  "xqoN1bEPFGazUQ0svsF2Rg": {
    "date": "8/17/2017",
    "text": "This is the cutest place in Noda. Awesome beers on tap and super unique space. It has a very cozy feel and laid back vibe. When we have people visiting from out of town, we always bring them to Growlers. Great food as far as bars go too. Definitely a great place to check out if you're in Noda.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dg18qrtwLDaL_KSzJnFzTw"
  },
  "v0U1cZv6QW8qkFm7voWvNw": {
    "date": "4/2/2015",
    "text": "Love love love growlers. Great location in NoDa! The vibe in here alone makes it worth hanging out. Low lights, casual, lots of mod - rustic accents. Of course the drink selection is great, and they offer beer cocktails. Very creative and a conversation starter. The food menu has changing specials, and it's always delicious.  The last time I was in, I saw something that really made this place special to me. An apparently homeless man came inside in a wheel chair. The staff responded like he was an old friend. They assisted him inside so they could fill a popcorn tray for him and helped him back to the place outside where he enjoyed telling passersby that he loved them. The sensitivity of the staff makes me proud to support growlers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tHDIUAz-XhQgF-WDsSGBMw"
  },
  "qwx0fH8nV0rdvLwE_BRT4A": {
    "date": "10/28/2015",
    "text": "Had the club, bf had the Ruben. Both were amazing!  We split the putine, and oh man is it good! Also had the brownie, such a treat.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "hn1dSryI9tmYKt6HyQqJqQ"
  },
  "_eh60BfAfuhPP6orhBdgaA": {
    "date": "6/22/2017",
    "text": "Oysters were fresh and delicious! Very attentive bar staff! Love this spot! Definitely worth checking out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ee7T7a7GR-rH0CyTTZcqXw"
  },
  "vxXlrexDMmMPe78ym34biQ": {
    "date": "7/1/2016",
    "text": "We absolutely loved this place!! The food was great! The beer was cold and also great! The oysters were fresh and amazing! But most of all.. The waitress was the best!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j7zOZVBJrD-Kvux1j43ZlA"
  },
  "bjb7EkR7hc5F39hfChEc2Q": {
    "date": "10/10/2015",
    "text": "This bar is a great spot for having a chill bar night. I really enjoyed the atmosphere with a rustic look and good craft cocktails list to choose from. You can actually hear yourself talk because it isn't too loud. This is a great place for low key bar night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jAyyJTO2z3a-rLGnsVjHpA"
  },
  "WnDuKsmIO-7j7ZU_F1suQQ": {
    "date": "6/6/2012",
    "text": "I'm addicted.  It's safe to say.  Growlers has the best beer selection in NoDa and is now on my leaderboard!  I must admit, I wasn't a huge fan the first couple times I went, but the beer always kept me visiting.  I then learned of their 'Best Sandwich' per Charlotte's March Madness Sandwich bracket with their Reuben.  It beat out one of my favorites (Beef On Weck at Lebowski's) so I just had to try it.  Now, it's my go-to.  This sandwich is incredible.  I took my wife and buddy last night and they concur.  The way this one blends together is magic.  I also highly recommend the pretzel.  These are the only two things I eat when I go now.  Start out with a nice stout beer and the salty pretzel, and end with the sandwich.    Try it, even if you aren't a huge Reuben fan.  I wasn't and this one has me visiting at least once a month.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zvFeFboNMXqes2x5yqxpYw"
  },
  "AGPUWJac06w_8F-2n9CY8Q": {
    "date": "10/13/2016",
    "text": "I originally wrote a review about experiencing bad customer service from this bar. I gave this place another shot after the owner reached out to me. It gave me hope that things would be different the next time around. It definitely was!! The customer service was so much better! We had a great time and I would definitely go back again. The owners are definitely invested in making this a great bar/restaurant for their customers! You should definitely give this place a shot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lw1BZS1zAQXCUcAuEOeA_Q"
  },
  "gWFdZYALS9S9WtH3r03tyg": {
    "date": "11/2/2015",
    "text": "The place was sooo tasty. A dozen oysters, hot wings, french fries, beer and oyster shooters. We did not consume a single thing that failed to exceed my expectations. I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bb7_YUrOMYlRtIXC3izjjA"
  },
  "SMfPfLDV5wxtFH0iWpfUeg": {
    "date": "6/4/2013",
    "text": "I'm  a frequent visitor here, usually once a week, and on a first name basis with one of the waitresses over there and one of the chefs. Got to meet one of the owners of Growlers a couple of weeks ago too, Paul, who was friendly and came to our table to make sure everything was up to our expectations. He casually informed us that he has a boat that he and another gentleman own, and they harvest they're own oysters which are served at Growlers. This particular oyster hasn't been in stock for a few weeks but I'm on the lookout for them and from what I hear, they usually go pretty quick and and are generally the first kind they run out of. I recommend getting a dozen each of the different varieties of oysters they have to find your own preferred oyster.  They're served on the half shell on ice with lemon slices, cocktail sauce, and another tangy/spicy sauce ( not sure what it is). I recommend the Nelson Bay oysters from North Carolina. They're quite a bit smaller than the East Points from up North, but they've got a lot more flavor and salt. The Reuban sandwich here is pretty darn good.  I order it with extra sauerkraut, and purple slaw. It comes on toasted Marble Rye . Very delicious and better than the ones that come from chain restaurants....my only complaint is that all sides are extra. I've also recently discovered they've got this really tasty, creamy, and very addictive beer-cheese that you can get  when you order either fries or a warm pretzel. I could eat that stuff right out of the cup...no pretzel necessary. :-) The Beer choices here are pretty good. They've got quite a few on tap and the selection is always changing. That is great for people like me who like to experience a new one every time I visit.  I love this place. I'll keep coming here as long as they're open and the service stays at the level its at, which means, Lindsay & Justin can never leave! HA HA!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "MDZba22g5kUsZF0BMcA8YA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Oyster Variety",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MDZba22g5kUsZF0BMcA8YA/o.jpg"
      }
    ],
    "user_id": "Shyhxt1sAabdO-7bmrBNrA"
  },
  "yuBIaExkbC-sv-hepRsNZg": {
    "date": "3/17/2012",
    "text": "It's hard to believe Growlers Pourhouse used to be Niche Mkt.! It's really neat how they transformed it from a retail space into the local watering hole.  The outside & inside is really nice, full of hardwood & earth tones.    As others have noted, it does get pretty busy, between folks hanging out long term & those just in for a quick drink.  While I haven't tried the food or beer, my boyfriend seems pretty happy with the beer selections.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "exEElE4pG-ZwoCMwoYddeg"
  },
  "I55tQqSx9Bf8LTnHjR7-5A": {
    "date": "4/16/2014",
    "text": "A group of 5 of us walked over for a drink while waiting on our table at Cabo Fish Taco. There weren't any seats for us, but plenty of floor space, and two huge TVs over the bar to watch the first Final Four game.   They have a lot of beers, which for beer drinkers is great. You can get a pint of PBR for $2. However, they don't have any ciders, not even one :(. They have a fully stocked liquor bar, but in line with Noda pricing can get expensive.   They have popcorn available to snack on, or they have a full menu which we did not partake in because of our dinner plans across the street.   The bartenders were super nice, and even came back out from behind the bar to ask us if we needed any refills, which I thought was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7JLpACO44A3xVXnOt1Z_A"
  },
  "iHdI_BEwJQ_FbpRWBUnFHw": {
    "date": "6/27/2015",
    "text": "Growlers is to be commended for their oyster shooters, seriously, primo. Let's take a minute to talk about their service... I will use an analogy, their service = getting crabs, uncomfortable and inconvenient. Other than that I say go for it.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "m3MyALz2wAW_T91-8GeT2w"
  },
  "TxvdMpyjfpTpp-W7tM7rBw": {
    "date": "2/27/2013",
    "text": "Considering price, this is a great place to start your night off before you become too intoxicated and cannot appreciate the design of this place.   Starting at the entrance with its large wooden door, it's definitely a no thrills bar that has a great feel and a warm environment.  People aren't going here to show off or be pretentious, they are simply going to a local bar where they can enjoy a good time with friends over beer, wine, and cocktails.  Also, one should take note of their food offering because it is definitely better than what you would expect from bar food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "kVbx7_6D5MmUJTEaKeiNkQ"
  },
  "myYNE--sLFGeIDRY9RX0NA": {
    "date": "12/26/2015",
    "text": "Love the ambiance and the food! Unfortunately our waiter was horrible!!! He did not care about our group of friends at all. He wasn't friendly what's so ever. He ended up forgetting my meal but I didn't even want to mention it because he was so unfriendly. 1 out 3 serves that we encountered was super nice, we actually wished he toke care of us. We did tip him since we are in the service industry but thinking back on it, we shouldn't have. Overall the food and drinks were great, but the service was horrible.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8OyuhBvMIHTTETny5ZPmA"
  },
  "1D63EupFojp5jEMX5ZDfWw": {
    "date": "12/9/2015",
    "text": "Great for grabbing a craft beer. They are always packed. Just ok in the food department, but if you like bar food, you're all set.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XPlJeS2OJ2198VuVdkk73A"
  },
  "BJlZZyDWqMDZL4yeqIYkGQ": {
    "date": "1/16/2011",
    "text": "Stopped in here for lunch and a cold one on a Sunday afternoon with the wife. I think NoDa has the makings for another gem in this corner spot.  Started off with the pretzel and (on the recommendations  of other Yelpers) went with light salt.  What came out was hot and tasty- soft on the inside, just enough salt on the outside.  The side of stone-ground mustard was right tasty too.  $3 may be a bit high for just one, but then most of the brews from the tap will run about twice that.  The stars here, from what I can tell, are their house-made sausages.  The wife and I tried the two-sausage meal with 2 sides.  We went with the sweet italian and the turkey apple.  Both were tremendous.  Moist inside and we got these wonderful chunks of spice and crumbly ground pork in the Italian.  I could have had several.  This particular meal didn't come with buns for the links, so no comment there, but you can pay extra for adds ons such as chili and slaw.  For sides we had the bourbon baked beans and the broccoli salad.  Both were tremendous- beans had just enough flavor to keep them from being drab and broccoli salad was moist and flavorful throughout.  This was always one of my grandmother's side dishes for family dinner and the Pourhouse did a nice job making me remember it- little bits of broccoli with raisins, red onion, and bacon, all mixed in a sweet mayo dressing.  Yum...  We also tried a side of the house-made chips.  These disappointed.  Cold (as though made a day earlier) and they came with no dipping sauce at all- we asked and the bartender said he have to check next door.  If anyone is listening, I recommend they be fried fresh to order and served with ranch or bleu cheese.    Now I realize it was NFL play-off weekend, and the big screens had the games going everywhere, but there was only the bar keeper to serve the entire dining room.  The poor guy ran his tail off without a moment to catch his breath.  We were patient, but this was unacceptable.  They could easily have used a server for the booths and large center table (which were filled) to keep the masses beered-up and full.  We would have tried dessert but for fear of the wait for the bar tender to get back around to us.  Seems like others were frustrated too.  Beer selection on tap is plentiful and seasonal, but there are some standards you can count on, like PBR drafts for $1 during the week (Mon - Thurs).  They also have a bike-in on Sunday with $2.50 Fat Tires.  I could easily throw a few back here on any given night.  I don't know that I would call this place a gastro-pub, but they will definitely fit the spot for a quality casual bar meal with a cold one to wash it down.  I just hope they get some more help to keep up with the crowds!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ExA35HDha2z9m6orYf7I5A",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Lots of taps.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ExA35HDha2z9m6orYf7I5A/o.jpg"
      }
    ],
    "user_id": "AwyM03qzhwgyskBruurWQw"
  },
  "e5jbs2dhrj4Nf3WggZTU8g": {
    "date": "1/25/2014",
    "text": "Wish they have more wines... BUT still my favorite spot in noda:) small and great bar; feel like I'm in some  bar in big city.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GImC7D_cZVU35awbNFUBaw",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Had 50 oysters.. yummmmmmm",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GImC7D_cZVU35awbNFUBaw/o.jpg"
      },
      {
        "img_id": "luGMkFofOweJAlPNoSQRdA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Oysters....so fresh:D",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/luGMkFofOweJAlPNoSQRdA/o.jpg"
      },
      {
        "img_id": "OmdT_MmWOJM69geRAzqGyA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OmdT_MmWOJM69geRAzqGyA/o.jpg"
      }
    ],
    "user_id": "mGWcD7gVqC6wvkxvv99chg"
  },
  "t7nnjX9_DvG5fjIJDA5WMQ": {
    "date": "1/18/2016",
    "text": "Wasn't really impressed with the food. Maybe it's a great bar at night but we had wings and they kind of small and too crispy and just and mediocre sauce splashed on top. The gravy fries were ok. I ordered and side of backed beans and bartender/waitress forgot about it, not a huge deal but worth mentioning. I had higher expectations with some of the other great restaurants in the area.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "olnURYahtnDiA05-DUxMzQ"
  },
  "ufUbqs5LgEDVGX_GkBmQcA": {
    "date": "8/29/2010",
    "text": "Cask beer, you say? Indeed I'll have a pint! While I'm no ale aficionado, I was really excited to hear about this sweet new pourhouse (with cask beers and 1930s growlers) in NoDa. Naturally, hubs and I dropped in for a quick pint and bite to check out Growlers.   I love love love the feel of Growlers, with the exposed brick on one side, cask ales, laid back approach and teeny space, it's definitely a place you want to keep coming back to. Service was friendly and knowledgeable and the bartender helped me choose my ale of the day - the Orange Blossom Pilsner.   As previously mentioned, I'm not a big beer drinker but I really enjoyed my pint. I dug the orange essence and the smooth finish. As for the food, I only tried the beer cheese dip - which had great flavor, I just wish it was a bit thicker. Being that I went to school in Madison, WI I'm pretty picky about my cheese...especially beer cheese!  Overall, I'm really excited to come back to Growlers. It's a great neighborhood bar with a super cool concept and interesting menu. Looking forward to my next trip...word on the street is that the bread pudding is amazing!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 12,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "tsmXkR10oKFTShQi9b4Q3A",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tsmXkR10oKFTShQi9b4Q3A/o.jpg"
      }
    ],
    "user_id": "qlC607Cyp0Mj91vDFvkp3Q"
  },
  "wQ3oGVtQKaz6L4l-ZI2UNg": {
    "date": "7/27/2015",
    "text": "Oysters and Beer.  Seriously, that's all you need to know about Growlers Pourhouse. There's really no other place like it in Charlotte where you can get some seriously high quality Oysters on the half shell with a fantastic selection of Craft Beers rotated regularly.  I usually start my visit with ordering a dozen oysters split evenly between the varieties they have on menu (usually four different). Then depending on which one I like the most, I'll order another dozen (or two) more! My only gripe about their Oysters is really just the mignonette is very basic, mostly just vinegar with minimal seasoning.  For those who want something more than just Oysters (which is beyond me when they're available :P), their other menu items are great. From their Sandwiches, Chili Mac, fresh Pretzels, and Sausages, this is a place that obviously takes their food seriously.  The only downside to Growlers (for me, because I'm an old fart now) is that past about 6P it becomes your typical Noda Bar Scene. Lots of college kids and very, very loud. I won't hold that against this place though, it is what it is.  So between a great place to get some good food, good beer and to socialize, there is little this place doesn't offer.  Oh, and as a side note, I'm not sure what they put in it, but their free popcorn is freaking AMAZING.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uYEMjOZ37TMvy3YhCY-I1g"
  },
  "de2_d6HpbV_4DXaFtSsB-w": {
    "date": "11/4/2015",
    "text": "First Tuesday of the month is beer education. The free samples of beer are wonderful, the education on the other hand is a little lacking. First time we went years ago learned so much, second time a little, this last one just told us what the beer was and nothing about it or its brewery at all. A fun event and a great hang out place just wish education was back in beer education. Be aware website says 7pm normal doesn't start until much later than that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aDOwZ4yttdbULgJp2A01kg",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States. Half the Queen City Crepe with fries.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aDOwZ4yttdbULgJp2A01kg/o.jpg"
      }
    ],
    "user_id": "07fvGXQhmO24Qm5GAPfFIQ"
  },
  "LpTRTFWNeGhCQl7-ezNaDw": {
    "date": "6/30/2015",
    "text": "Growler's Pourhouse won the 2012 Competition for BEST SANDWICH IN CHARLOTTE by the Charlotte Observer Magazine, so naturally I decided I would have to see what all of the fuss was about. There were plenty of other amazing sandwich's in the competition but the Reuben at Growler's Pourhouse came out victorious among all other sandwich's in the Queen City.   For $8 I would have preferred the sandwich come with some sort of side item but with that aside... the sandwich rocked. The picture on the Growlers website shows a reuben stacked high with ingredients and although I found mine to be a little less impressive than the picture above I did find it the best reuben I had ever eaten (also the first). The corned beef, sriracha russian dressing, swiss cheese, purple slaw, and juniper berry sauerkraut on marble rye bread was one hell of a marvelous sandwich creation.  I can't say quite yet that its the best sandwich in Charlotte but the Reuben definitely brought a smile to my face :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pS03ZJBfVmjFOEDweTViOw"
  },
  "nq4zHhXwI4V0aIo6iETpEw": {
    "date": "1/11/2017",
    "text": "Bartender was terrible.  Had no clue what the specials were.  He said,\"same low prices as every day.\"  Luckily we can read and saw the specials on the menu.  Food was good though.  Just couldn't get a drink, the tab and he was still too busy on his phone to run our card.  But the food came fast and was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0cdU_YvYgF5lAQ6bdX9HHA"
  },
  "zc4EVwNigbykQhPl23P27w": {
    "date": "12/15/2016",
    "text": "Visited for the first time earlier today and had a great experience.. Bartender was cool and super friendly.. Great service, we will so be back.... First Thursday of the month great specials after 5.... Check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CLk6Nue9yMXDHpM09b6x2Q"
  },
  "oyFB59v027YZBA48R92f8Q": {
    "date": "9/9/2010",
    "text": "house made dogs, brats, mustard PBR and fancy beers smores for three dollars",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "6uSz-fW_eF62Nol1FvpJEQ",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6uSz-fW_eF62Nol1FvpJEQ/o.jpg"
      },
      {
        "img_id": "sTnTS-2KedX03D2897aiFA",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sTnTS-2KedX03D2897aiFA/o.jpg"
      },
      {
        "img_id": "o5LKK_c2U5AyspiehN9vUQ",
        "caption": "Photo of Growlers Pourhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o5LKK_c2U5AyspiehN9vUQ/o.jpg"
      }
    ],
    "user_id": "Bsbumyr3Of8BauN2URK4bg"
  },
  "NBQ87Z5WvAfK4ZFzYmnm6A": {
    "date": "5/24/2016",
    "text": "Growlers is a cool spot with great service and a solid rotation of good beers.  The food menu is limited but very good. Best Ruben in Charlotte.  A good scenes on the weekends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "2UvarhsTmzHD3iDDhfafWA"
  },
  "X_9dSIlSuLpuIOde3gNZQA": {
    "date": "9/15/2017",
    "text": "Just got a tattoo and walked into the first spot we found around the corner.  What a gem!  This place has an awesome aesthetic, very cool space, big wooden booths and stools and semi-industrial high ceiling.  Amazing array of beers both on tap and in bottles.  Asked the bartender to make an off-menu cocktail and he obliged with not only a smile and 'no problem' attitude, but made a fabulous drink just like I asked for.  Outstanding service from a very personable bartender/server.  Hubby got a few local brews and enjoyed both.  Bartender gave an honest opinion when steering us away from one beer choice, and we respected that.  Free popcorn was fabulous, and we also ordered a bologna sandwich to share.  Served on grilled sourdough, it has gruyere, pickles, onion straws and spicy mustard.  It was cRAzY good.  For us, just a smidge heavy on the mustard, but still an absolute must-try.  A total savory flavor explosion!  Would absolutely be regulars here if we lived close, but we were just in town for the weekend.  Definitely go here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t98RT_BtJhUK2Y682g1Rmg"
  },
  "3a8kfNUtyV4WrMOQudCVPw": {
    "date": "12/4/2016",
    "text": "Great spot to just relax and take the edge off - Sunday's are best no crowd and plenty of room to enjoy the afternoon. Local spot with relaxed environment which is  complimentary of the area. Stop and enjoy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "giVkQwTwQI32hsqaeAT57Q"
  },
  "Bul6GEi11pOdBNXqZZw-8g": {
    "date": "11/3/2016",
    "text": "Love this place! Good food and great beer selections. During the fall and winter you've gotta try the imperial stout by terrapin. Strong chocolate favor yum",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MlhCUi0mqIi--pWlw30iKA"
  },
  "hv6gp7EhoTLl5rLTvUktOw": {
    "date": "12/22/2016",
    "text": "One of my favorite neighborhood restaurants and bars in NoDa. The bartenders are knowledgeable about beer, professional, and can also mix some awesome drinks. The food is great too. The customers are generally interesting and nice as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WIMLBjZfk2zMqIEdJjS3KQ"
  },
  "Qx2CBXmYdJSj6LweyFyV1Q": {
    "date": "7/5/2012",
    "text": "Disappointment  Disappointment: 1.  failure, defeat, frustration. (<a href=\"/redir?url=http%3A%2F%2Fwww.dictionary.com&s=cb986ce1d1305975050c9b6fc52d71cb541f85ee64d957c865cfb7a1efc44b71\" target=\"_blank\" rel=\"nofollow\">dictionary.com</a>) Revenge: 1: to exact punishment or expiation for a wrong on behalf of, especially in a resentful or vindictive spirit:   Those are the two words: disappointment and revenge, that describe my current state of mind as I compose this review of Growlers Pourhouse in NODA.  I feel nothing but utter disappointment with every aspect of my experience at Growlers tonight.  I came home and instantly began writing this because I feel the need to exact some minor sort of revenge for the disappointment I felt, and paid for tonight at Growlers.  This is one of those rare experiences in which my feelings and rating for this place started high, but dropped the longer I was there.  I'll say it all started well, we came in, the decor of the place strikes you immediately.  This place has the feel of a classic English pub.  Not many television screens.  Not very big inside - essentially, its nothing more than one big room, with the kitchen being in the back.    It took my buddy and I an unusually long time to place our orders.  He ordered the Cornbeef ruben, I ordered the wings with a side of ranch instead of blu cheese.  I know, I know, I should have gotten a sausage, but I had a bunch of brats, hot dogs and sausages yesterday on the 4th of July!  The meals arrived soon thereafter.  The first thing I noticed was that though the wings smelled great, they looked horribly under-sauced.  You know when you look at the wing and you see entire sides of plain, fried, chicken skin, well that my friends is UNDERSAUCED.  Problem Two: I was given blu cheese instead of the ranch I asked for.  Not only that, but it took a long time for one of the bartenders to come check on us and for me to finally receive a ranch.  Problem THREE: The wings were horribly overcooked or stale, or old or some combination of all three.  These are unquestionably some of the worst wings I have ever had!  Overcooked, dry, undersauced, not meaty, etc, etc, etc.    I wanted to go tell the cook back there, \"Hey! Listen buddy, you can't serve wings in this town that have been sitting under a heat lamp for five hours, NOT properly sauce them, charge $9 and call yourself anything other than a colossal disappointment!\"  You want more issues?  Well, you're in luck, because when we finally got our tabs, I was charged for a $5 Ruby Lager, when I order a $1 PBR!  Do you see what I mean about it getting worse the longer I stayed there?  This place was a total waste of $19.24 that I will never get back, or otherwise be compensated for.  I will never have the chance to personally tell the management how disappointing the whole experience was, mainly due to the fact that I will NEVER be back.    All I could think as I was leaving was that I will have my revenge on YELP, in this review or the next...and for whatever its worth to you out there, I feel much better having shared my Disappointing experience with you.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "R_wlZO-jKFGEVJnSfWISqQ"
  },
  "nKYSw8b96ajZ7csNL4i1tA": {
    "date": "7/11/2015",
    "text": "When you go somewhere that advertises they have the best sandwich in the city, naturally you want to order that sandwich.  I'm a huge fan of Rubens so was excited to try this one. I was not disappointed and would definitely get it again. However, my friend got the BLT with mozzarella and I almost think that one was better.    All in all the food was decent. The only downside is Sides were a la cart so for eight dollars you only got the sandwich.  Drinks were reasonably priced and the atmosphere was great to catch up with friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S3WEyscGeMGW4xTqJHEZ_w"
  },
  "hCBnlbLz9H-jN0xusKUaqw": {
    "date": "9/17/2012",
    "text": "Beer and tasty snacks?  I am there in a heartbeat.  Growlers has been on my radar for a while now, I had never had an excuse to make it over to NoDa to try it.  It was early Friday afternoon and we were hoping to make it right after work since it had been a tough week.  Unfortunately they only open until 5pm, but it was gorgeous outside where we were able to catch up and enjoy the weather and all that is NoDa.  Once inside, we grabbed a booth and started with some seasonal brews.  Definitely a unique selection here (compared to the usual).  We also ordered some nachos and eventually dinner.  I tried the turkey sausage which was gone in 60 seconds... I think consuming good/high gravity beers makes me turn into the cookie monster (except cookies is rather a loose category - it encompasses all food).  I even asked for a serving of complementary popcorn.  OH!  My sausage came with a side, so I went with the mac and cheese.  I couldn't quite put my finger on it but the cheese was definitely no run-of-the mill cheese mix.  I appreciated the quality and effort in all the food that was offered here.  The servers were nice and we left the place food of beer and food.  Great way to start a weekend after a rough week!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "XRp2wszf4Plm5NDbpTm80g": {
    "date": "10/28/2014",
    "text": "Overall a positive 3. Pros: Friendly, knowledgable staff, great bar selection, warm and intimate feeling (as long as there isn't a game on).  Cons: Food can be hit or miss, too many TVs really ruin the relaxed, personal vibe. NoDa has plenty of places to watch games - I think this spot could get by with one or two TVs, with subtitles on instead of the volume cranked up. No outdoor area or tables where you can enjoy your drink... Or escape a loud game if you want to have a conversation.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPfybPoiiJdEOTocF027dQ"
  },
  "qVPrTrMe3DMc3umiOQlkVw": {
    "date": "1/15/2013",
    "text": "Pretty awesome door. Lets just start off by saying that. I came here after some time at Salude. We came here to get a beer, and well this bar is well exactly what it is a bar. I really enjoyed the style and the atmosphere as there are a lot of college attendees. It's quite crowded, as I'm not used to being in a packed atmosphere.  This is a good place to go with friends or to go meet new people, but for me it's not the most amazing place that I would go to if I had a night off. So, therefore, my thoughts on this place: Not bad. Not amazing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9Z1dcoZrwn8Ul9JTnjjug"
  },
  "ghDFAdv4e_fL3wZYspq4mA": {
    "date": "3/3/2016",
    "text": "First time in Charlotte and was looking for a quick lunch. I came for the oysters and wasn't disappointed. Great Canadian oysters! They have an impressive craft beer list, cool staff, and delicious food. The place is just cool, the decor, the bar. Great find. Strongly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DOjW-ViaEr7KeAn6LO5tcQ"
  },
  "J_PWMyvR9RUfGsw1kARmRg": {
    "date": "10/23/2014",
    "text": "CVB Pumkin Ale comes with a cinnamon rim!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0QREkWHGO8-Z_70qx1BIWw"
  },
  "pjLqvr-5ANI58pv7ajiXOw": {
    "date": "7/27/2016",
    "text": "Had such great service from Jordan today.  She made such a fine French Press for me while I was working on my laptop and had some great recommendations on the food menu.  Even being the only bartender/server with a good amount of people in there my glass was never empty.  Ask for her by name and definitely get the French Press.  It's so ca-ute.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AH9g73vtkhzfA1BZFwzuWw"
  },
  "aBR2uuyFyXGH8_wYfS9q-A": {
    "date": "2/9/2015",
    "text": "Showed up late on a crowded Saturday night. The staff did an awesome job serving us. We had a large group so that couldn't have been easy.  We ordered more than drinks we also got food. Once again couldn't have been easy.  I ordered the Reuben which was touted as being the best in town. I must say I can't think of anyone having one better so I'm inclined to agree.  Solid outing and will gladly come back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "690lClPHEn8UaSy0S0HWPg"
  }
}