{
  "wy6-9Nq1fBInKMLHFR4N9w": {
    "date": "12/23/2013",
    "text": "When I want a burger & a shake with no fuss & a bit of nostalgia, this is where I go.  Lots of folks angst over the Penguin vs. Diamond vs. whatever debate, but let's keep it simple.  If you want a local spot, with a good ambiance and a great meal, this is it.  Their charbroiled burger is bar-freaking-none.  Grab some fries and a milkshake and you've got yourself a meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "r_dKh4X6WQZDvvcXOy2Yiw"
  },
  "lwbRtoSmog9OpjLqbRwJRg": {
    "date": "1/30/2014",
    "text": "Mr K's is a legendary notch in Charlotte's belt - specifically Southend - and is a cultural phenomenon. Enter and you will automatically be taken back to the old days - think 1950's classic diner, with all the goodies.  Awesome burger? Got it. Excellent fries and onion rings? Yes.  But the real reason this place keeps me coming back is the soft serve ice cream. It is absolutely phenomenal. Never before has vanilla ice cream done so much for me.   Mr. K's is an antiquity, but still delivers like its 1955. So pay it a visit.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DiKHjE69RiGneNqmgEtDzA"
  },
  "zygdzuf85gDlxfoIShfFZw": {
    "date": "5/12/2017",
    "text": "Drove about 1/2 hr to get here for lunch and this was the worst meal ever! ordered a grilled chicken sandwich and the chicken was so tough I couldn't even chew it! Will not be back EVER! Wasted time and money!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lcLqW08Pi3DBcFbnbnWzgA"
  },
  "s3Ux0YM-5_fzat7t99Yp0A": {
    "date": "12/31/2011",
    "text": "Cute burger joint in South End directly off South Blvd. The parking lot fills quickly, but you can easily find parking off a nearby street.  On a sunny day, enjoy sitting outdoors. Their patio table and chairs reminded me of my childhood with the solid round metal tables with attached seats and umbrellas. The service is very friendly and they are quick on their feet.   They serve feel good food! Order a side of onion rings and wash it down with a milkshake and you've got yourself a content afternoon! Now the onion rings aren't the golden, flaky rings I'm accustomed to...they are more of a neutral tan, but held together well (more like a cornmeal crust). Nonetheless, they tasted okay dipped in ketchup. The garden burger was good and the condiments were stacked high (love me some crispy iceberg lettuce). Now the milkshake was more milky than thick ice cream, so it was more beverage-y than dessert to me. Overall, I enjoyed the nostalgic-like experience and I think that is what makes this place desirable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Reuq65EOFI938Yg8xgff9g"
  },
  "7oSwVq6hXaDuDfEX1rn3Nw": {
    "date": "6/14/2013",
    "text": "If you know me well, you know my favorite milkshake is a Butterfinger milkshake. I don't know why...it could be the teenage summer I spend drinking one a day...but anyway, when I want something cold, delicious, and slurpable, I always opt for a Butterfinger shake.  And that's where Mr. K's comes in. Holy goodness. I haven't really tried anything else on the menu, since we usually come just for dessert. But the Butterfinger shake with hot fudge is a force to be reckoned with.  Service is speedy, and friendly enough. Nothing over the top. It's a TOTAL old-school burger joint and you can see the flat top sizzling when you order. I always see tons of people enjoying standards like burgers, fries, hot dogs, and the like.   It's adorable when older couples, who likely have been patrons since the place opened in 1967, walk in and order \"the usual.\" Makes my head spin with happiness.  Go to Mr. K's. Do it. Go for dinner or a shake. And be happy.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "jfaz1aQqnkbtzQfQyCE8IA"
  },
  "5zGOevRjGqsbBm2QfsPbCw": {
    "date": "2/12/2015",
    "text": "If you're looking for a locally owned, friendly, old fashion place for a burger, hot dog or ice cream, this is the place to stop!. I've done their dogs, burgers and corn dogs so far. Still haven't actually had the ice cream. Go figure. Inexpensive but good. Friendly and fast. When I get a craving for a good grilled dog, this is my go to spot. I'm a fan for sure!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "na1ZD7bFvAUHXiV61CrCDw"
  },
  "pyW5YsTVaj0yZUb8kGziDw": {
    "date": "6/10/2014",
    "text": "Great for burgers,  dogs and ice cream.  Reminds of a mom and pop place from my home town that was only open in summer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lKEeO2cIvuuchxzRBbmHRA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Burger and rings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lKEeO2cIvuuchxzRBbmHRA/o.jpg"
      }
    ],
    "user_id": "gRkhaXNXQOjOCvRfIiaqww"
  },
  "RXbK6Poho8NoDIJf2Xs7gg": {
    "date": "12/31/2013",
    "text": "Omg, if you come here, GET A MILKSHAKE! It was sooo good. You can choose which flavors you want, and they have some mix-in options as well. It was so creamy and delicious. Man, now I want one.  The food is good here too. Their burger tastes homemade in the best way. Fries were good too.  Prices are good. Service is good. The girl who helped us was nice and helped us out with all the random questions we had (Yeah, we were kinda being tourists asking what's popular, etc). Parking can be a beezy if you come when it's busy. But you know what, I would totally go through that mess of parking, if it meant I would get a delicious Mr. K's milkshake at the end of it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pJlvY0SNHsAnxR6VQg7Rdw"
  },
  "MFw-w6_D_gOF-1yjc8bVrA": {
    "date": "1/27/2017",
    "text": "Awesome hamburgers and milkshakes. Feels like you're traveling back to a 1960s diner.  This is what dilworth and south end used to be like",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uzpKcG1VoRC-MsMKojOedg"
  },
  "sHRrczVBwFsjSRSjp_HhVw": {
    "date": "9/13/2013",
    "text": "I had a craving for an old fashion shake.  I have been driving by Mr K's for awhile. It seems pretty busying during the weekend.  I stopped in during the week. I am happy I did. The place has the old greasy spoon feel with out the grease.   They had a multitude of options for a flavored milk shake. I went for the blueberry.  YUUUMMMMM  This is place you want to go for a good old burger, fries are icecream and milkshakes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "apwx9mVErPHhQgxFnlvcjA"
  },
  "-MbfB-9nTMLSAfcVm6Mlqw": {
    "date": "8/24/2012",
    "text": "Soft-served ice-cream anyone?   Everything about this place screams child-hood for me! I used to live in the Dilworth area and Mr. K was the only place I knew for homemade style burgers. Me and daddy used to walk to this joint for a quick bite and leave with ice-cream on our walk back home. Thankful for a place like this.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "861VsknkUj86-FDXNMyebA"
  },
  "HoSJBCCyl1hntF2rzsj3XA": {
    "date": "4/2/2010",
    "text": "When I was a kid, it was always a bonus when we got ice cream and it turned out to be soft serve.  It was my favorite!  I still love soft serve ice cream.  I have driven by Mr. K's and never had any inclination to stop.  I thought this is a Charlotte institution, I need to go get an ice cream.  I dropped in and got a small chocolate/vanilla swirl cone. I sat outside the stoop of Leather & Lace, I could hear their music blaring.  I was imagining the haggard ladies working during the day and the beer gut men drooling.  South Blvd isn't just for breakfast anymore.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 6,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "2wInlfHAq92IOGjngW0uUA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2wInlfHAq92IOGjngW0uUA/o.jpg"
      },
      {
        "img_id": "VUfot9rbXy_EsdCEmsxxsA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VUfot9rbXy_EsdCEmsxxsA/o.jpg"
      },
      {
        "img_id": "J1_-TbuH7Z8waLojwXiEMg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J1_-TbuH7Z8waLojwXiEMg/o.jpg"
      }
    ],
    "user_id": "Bsbumyr3Of8BauN2URK4bg"
  },
  "QcCr4pwMSVCLvhH_UAOsHg": {
    "date": "5/27/2012",
    "text": "Mr. K's is a welcome summertime (or anytime spot) in Southend. This joint beckons no need for an introduction. They've been serving ice cream for almost 50 years!   Stumble in for a burger or a milkshake in the dog days and you can't go wrong. You'll be hard pressed not to think back to the good ol' days when you were a kid. Walking into Mr. K's is like walking into a museum. Lower ceilings, tiny booths (good enough for one person on each side, haha) and an old school shotgun style exposed grill top. Familiar smells and hard to choose on lunch or dessert!   Mr. K's makes a mean milkshake, though. I've been in here a handful of times and always have left with a milkshake. Chocolate and strawberry are always choice. Thick and good to eat with a spoon or wait for that perfect melty consistency and stick a straw in it.   So glad that a staple like Mr. K's is still kicking since the 60's. Now that summer is starting once more, can't wait to head in for a twisty cone or a gigantic milkshake!  Thanks, Mr. K's!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "rP2U5YYtrN9_hLy3Duu0Ag": {
    "date": "10/24/2016",
    "text": "Cute, charming and family owned. Great burgers for a good price. Fries are solid. Onion rings are think and yummy. Of course, you've got to get a shake. I asked them to mix in bananas and peanut butter into my chocolate shake. Such a cool little joint.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4XuN4nl3iElKq45ks7exZg"
  },
  "y5DniOHk9JTr3qbb_1p-cA": {
    "date": "8/7/2015",
    "text": "Went here for the ice cream per a recommendation and I was disappointed. Small amount of ice cream for more $ than I expected. I'll have to try something different next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lOKYlcYfRc5_3lnijW_yZQ"
  },
  "ubEZrqICWlrc6N-971xJ-A": {
    "date": "9/6/2012",
    "text": "Mr. K's is one of those places that I've often passed and never visited. Recently, we decided it was time to rectify this, so we stopped in for a meal. The interior of the restaurant doesn't look like it's changed much in the past 50 years, except for the rather odd prominence of Panthers memorabilia in the decor. I find this to be kind of cool; your results may vary.  On the food: The burger was good, probably the best fast-food burger I've had in a while. However, I was disappointed in their supposedly-famous onion rings. They were bland! I have to take a star off for that, since they're so prominently advertised.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2m2MNnlOdofofmUs-hYTJQ"
  },
  "cxgHXJip4lVMjeCCEbJspg": {
    "date": "6/18/2012",
    "text": "Trying to figure out where to eat for lunch during week takes creativity.  After realizing I never tried Mr. K's, which supposedly is a staple in Charlotte, I decided to make a quick pit stop last week.  It's good to know their air conditioner works well... cold air blasting in the tiny joint.  Looking at the menu board, all I could think of is... DAMN this is not cheap.  $4 for just a cheeseburger?!  Oh well, too late to leave now.  So I tried the Homestyle cheeseburger, Carolina style ($0.50 for the chili) and an order of fries (another $1.90)  I asked the nice lady what's the difference between homestyle and non-homestyle, and she said it's seasoned and made from scratch.  But should all burgers be  seasoned?    Final verdict: it tasted ok.  Nothing out of the worldly awesome.  Fries were just frozen fries.  For almost $7, I would have wanted more",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "M4yYtAXehUzaHB1ghl6EXg"
  },
  "vtpwxiwFhuEUWQKpHynmKA": {
    "date": "2/16/2015",
    "text": "This is a must do place in Charlotte. Very friendly. Low prices. Interesting Panther memorabilia.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U0NPWxHx8MEG-nbBS4ejPA"
  },
  "weXaXg-hC7F6fw5pAMVFvA": {
    "date": "7/12/2012",
    "text": "I wonder who Mr. K is, all I know is that he makes a pretty good burger. The joint is super tiny and filled with pictures of family trips and what not along with random things. I like that, full of personality.  We were greeted and our orders were taken posthaste as we entered. Well unfortunately that's where the speed tapered off. It took a while for our burgers to arrive and get to the table. I really liked the fact that they grilled the buns thoroughly so you get a nice crispness to the burger, but the patty was just a bit bland. If someone is here they aren't exactly looking for the healthiest option so don't be afraid of the salt and pepper I say! Fries were good and hot, so were onion rings though like Faith says not what I was exactly expecting.  I enjoyed the meal here and at a fairly decent price point of about $10 it is similar to 5 guys but in this case you get to support a local business that has been part of Charlotte since forever.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zZYHZwmBl9Af4pI-aLXBFA"
  },
  "hzBsEcyGnUo2x3j7gUiRZw": {
    "date": "3/10/2015",
    "text": "This place is great. Burgers taste like you grilled them in your backyard. I feel like 5 guys tries to make burgers like this but fail. I ordered the cheeseburger all the way, with onion rings for lunch. So good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dM44l_t0nxuge7pxDBpuHA"
  },
  "mgIKoW9NtQdGD6ZlhMk4UQ": {
    "date": "10/23/2014",
    "text": "This place is right outside of my work so I pass by it all the time. There's Chipotle right next to it ( the only Chipotle in town if I remember correctly), and I always go straight to Chipotle in stead of this place.   And you know what, after trying Mr. K's today, I will continue to choose Chipotle over Mr. K's.  I order the Big K's burger and Homemade onion rings. The food is not anything special, definitely not as good as Five Guys. Beef patty tasted bland and without condiments I wouldn't able to push it down to my stomach. Onion rings is a little overfried, and overpriced (more expensive than a beef burger? and only has 8 rings in it? really?).   I see this place probably is recognized for its sentimental value and not really the food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CjmLZRV31UE4P8TPT1tQwA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Took this picture while my mouth&amp;#39;s watering",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CjmLZRV31UE4P8TPT1tQwA/o.jpg"
      }
    ],
    "user_id": "Exgv16k04jwqvIRxbLNYMg"
  },
  "vGpQ9tg0GJVxGZHx7BkcUA": {
    "date": "4/25/2016",
    "text": "I hit Mr. K's about once a month. It's typically a choice between here and Zack's when I want a \"mom and pop\" place burger that has a real grill flavor to it. The fries were not salted much if at all today but the burgers are always consistent. The toppings are fresh and crisp and the onion bun was perfectly heated to a very light crisp. I added a peanut butter milkshake (first milkshake here) and was hoping for a thicker consistency with actual pieces of peanut butter in it but it was over blended for my taste. It was basically milk by the time I finished my burger (the air temperature was only in the low 70's). I think Cookout has definitely spoiled me for super thick, flavorful milkshakes. I think I would like to see more of a combo lunch pricing as you'll be close to $10 for a burger, fries and drink at Mr. K's. (versus about $7 for Zack's combo special).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_qBIkjABbFWxkknjc_qn-g",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Mr. K&amp;#39;s regular cheeseburger on an onion bun.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_qBIkjABbFWxkknjc_qn-g/o.jpg"
      }
    ],
    "user_id": "S-aWpC4zwEiypgmY98nsvg"
  },
  "_gxOi3jUePGq6IIpvfAv2Q": {
    "date": "1/4/2018",
    "text": "Probably my favorite hamburger spot in Charlotte. Ice cream is always great, and the frings option is amazing. It's another frills hamburger but also doesn't rely on chili to make a good hamburger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LsMcMEIPj1birjWYBsztFA"
  },
  "LZkhXdl9vLy_rsNaus2txw": {
    "date": "7/16/2013",
    "text": "I awoke today, with a craving for a charbroiled Mr. K's burger - so I made the one hour drive to the Queen city.  I arrived at 11:30 AM, and there was one other diner in the building.   This time, I \"went for it,\" and ordered a Double Mr. K burger, onion rings, and a large Coke - \"whoa Momma,\" as Bart Simpson used to say.  The drive to CLT was definitely worth it, because nobody does charbroiled burgers like Mr. K. Also, NO ONE is as friendly as the man himself. The staff is amiable and eager to please. Two open cash registers speed order entry.   Burger? Delicious, period.  Onion rings? Ditto. Plus, the stack must have been six inches tall. Perfectly cooked and super crispy - yum.  Coke? Super strong, just like \"old timey\" Cokes, when the bottlers actually used cane sugar,  like they still do in Mexico. The small ice nuggets made the Coke almost like a Slurpee - ice cold, and really good.  Price? $10+, but worth it. One hour drive, one way - worth it. Shoehorning my car into one of the minuscule parking places - worth it.   Negatives? A new employee rang up my order incorrectly at the register, but the lady doing the cooking caught the mistake, so it's all good - no harm, no foul.  The bathroom was clean, but it was probably 120 degrees in there. The bathrooms are outside and around back. The men's restroom was locked, but the ladies' was open. LOL.   I was impressed that there were so many regulars stopping by. I swear I wouldn't have been surprised to hear someone shout out, \"NORM!\" The employees knew what the regulars wanted to order, before they said anything - impressive.  Mr. K's has been in business for decades for a reason - the food is a throw back to the carhop days of the 50's and 60's, when restaurants took pride in their food.   Final thoughts: thanks for the great lunch, Mr. K. - I enjoyed my meal! Summertime is not complete without a visit to Mr. K's in Charlotte.   PS: If I lived closer to Charlotte, I would stop by here often for Mr. K's wonderful swirl ice cream cones and fantastic, thick, milkshakes. Proper!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "4FE8md9fMr_jZFNbcOmHsQ"
  },
  "V15AsX9Zakgi0o-FMvh-Zg": {
    "date": "4/13/2013",
    "text": "Hello Friends,  An angel spoke to me in my dream one night saying, \"Gooooo toooo Mr. K'ssssss\" No wait, that may have been a ghost. Probably was a little more Angelic. Man I gotta stop eating so late. But anywayyyyyyy  I woke up ran a few errands. Then that voice popped back up. So I made my way on over to this Charlotte Staple! If I'm not mistakin Charlotte has its share of Mr. K's, Mr. C's & a few other letters. (I remember Mr. C's on the West Side. But I digress)  In trying to find out who has the best burgers between Mr. Ks & Zacks. I walked in was happily greeted. Took a few ticks to see the menu. Then decided on the Double Cheese Burger on Onion Bun. Whaaaaaddd!! It was pretty good goin down. Later that evening I was going through while it was coming back to life in my belly. I'll try it again Just to give them the benefit of the doubt.   They have an GiNormus amount of frozen drink combos. I'll have to come back just to get my crack at it!!  Now maybe it wasn't an angel. Hummm. Well anyway like I typed. I'll give em another shot & update my review once done.   TTFN",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "1O6LOxbLB8KgMG4x94w53g",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Italian Ice!! We accept CC!! Wanna buy a shirt??",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1O6LOxbLB8KgMG4x94w53g/o.jpg"
      }
    ],
    "user_id": "xhlcoVm3FOKcxZ0phkdO6Q"
  },
  "B7sb557Hxbrx6F95BK-hxw": {
    "date": "11/22/2015",
    "text": "My sister loves this place and now so do I. The food is great but what I love more is how sweet the girls are. They are so kind and I love the fact they remembered me when I came back. I love how fresh their food is. Made to order. Real and simple ingredients makes the best food. They make the best burgers and shakes. And I love the fact they are so quick and don't have you waiting forever...even when it's packed. And it's always busy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fxUh4h9t3xltCTinzrjqPw"
  },
  "sgRst9nhedq-7cxTkE7Kpw": {
    "date": "7/10/2016",
    "text": "Who closes on a Sunday afternoon? We went at 3 and it was already closed. There were other people coming into the garage and saying the same thing.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "l6jrqB95P4alQkRHq9OWnw"
  },
  "yfnmA2MKmzd5mxi5HP-bsw": {
    "date": "7/7/2015",
    "text": "Mr. K's makes me happy. Good place for burgers and onion rings. The fries are outstanding, too. Personally I love their Italian Ices. They have a lot of flavors that are sure to satisfy a sweet craving on a hot day. Another reason I love them is their fountain drinks. The ice is the crunchy kind that reminds me of my favorite childhood ice cream and burger place back home in Indiana. And what's more? The prices are great. Skip the fast food chains and go local with Mr. K's, you will be glad you did!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z2zr-N5lg8bOTM8Cv-yvrg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Cherry Italian Ice... Delish and so refreshing!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z2zr-N5lg8bOTM8Cv-yvrg/o.jpg"
      }
    ],
    "user_id": "swUxTfJ96XZJ0ufmljJiXQ"
  },
  "NQMWfU7mQmYXXTHu5FyD8g": {
    "date": "10/26/2016",
    "text": "Best ice cream, hot dogs, and hamburgers in Charlotte!! The friendliest and quickest service you could ask for. My absolute favorite local spot. A must for any Charlotte resident or visitor!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JItlug9VxvJkQv9oZ6MFjQ"
  },
  "xiVSaaV6UPcbHnSdnZRiyQ": {
    "date": "9/29/2014",
    "text": "Honestly, second favorite burger in all of charlotte area.   First favorite is Zacks, as it will always hold a place in my heart. But Mr. K's is the mistress. And a damn beautiful one at that.   There's just something so breathtaking about the way a single establishment can stay successful even when there is a Chipotle right beside it, and a Bar in front of it.   And let's not forget the Double Big K cheeseburger, with a side of cheese fries and a good ass banana blueberry milkshake. We all know why you came here. And it's calling your name. So do like I did, and follow the sounds of your stomach over to Mr. K's on South BLVD.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1A5psFp5co83P00gOSwmlQ"
  },
  "mRB3iLNUw0WAo0UlqeSGAQ": {
    "date": "8/27/2016",
    "text": "A very good place for soft serve icecream! The butter scotch is my favorite. 1 star off for environment, no air-conditioning is absolutely a turn off...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QV74UAkmLaaZbnOMf934jQ"
  },
  "OSspTWyp3mE1uB1kdHhdgw": {
    "date": "6/7/2017",
    "text": "I go here a lot! The burgers and ice cream are amazing! One time I went with my boyfriend and they wrote his and hers on our food and they remember us whenever we come in!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tSssyWdbaDOf_IfvnO3hjg"
  },
  "ABbVSzVpNizhUb-rNpx4bw": {
    "date": "10/8/2012",
    "text": "Walking into Mr. K's made me feel warm and fuzzy.  It is just a happy place and I imagine I would have been there every weekend if I was a teenager in the 50's/60's.  I don't know if I have earned the right to review this place completely though because I have not tried the ice cream or burgers.  We had a couple chili dogs and some fries, both were very good and the chili was clearly homemade and fresh.  The place was packed, which is always a good sign but it also made it a little awkward when trying to stand in line to order.  I felt like I was hovering over others but had no choice!  Small ceilings, narrow walkway and being 5'11 made for an uncomfortable setting.  However--cool place and I am glad they are still doing what they do best without charging an arm and a leg.  Well done.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TB9ibgXVrq1B7-fajbsu8g"
  },
  "2n_M0o8ueyku8dy69dh27w": {
    "date": "8/16/2014",
    "text": "Good dogs and chargrilled burgers. Brings back memories from my childhood getting food with my dad. And the prices are just right. I will be coming back here often.   I had a chili cheese dog. The dog was boiled and perfect. I then had a bacon cheeseburger. Chargrilled tasted so good. Also had fries on the side. And the fries were... fries, nothing special.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "DHBSDuE0dCNIMUCUkri7Xg"
  },
  "6vDmACyGAEpsMhVu9JljEw": {
    "date": "1/5/2012",
    "text": "I have a very large soft spot for locally owned and operated restaurants. And this is exactly what this place is. There isn't a large parking lot or fancy entrance when you walk in. As soon as you walk in you find yourself in a tight, but yet roomy diner. Don't expect the fancy decorations or big puffed booths. You came here to get your food and eat. And that experience is worth paying for (and by paying I mean little).  Nothing fancy on the menu, yet they maintain an interesting blend of options to keep you coming back. You have your burger and hot dog combos and the daily specials on their own whiteboard. The food is all reasonably priced and a combo can run for about $5.50.  I came during dinner and found the place filled with construction workers covered in paint to parents eating with their ketchup faced children. I find this to be the real magic of the diner. A place where the white and blue collared can eat together without that feeling you get in some other places meant for a particular cohort. Finding a seat wasn't a problem though, so if you want to grab a seat and eat, no worries. I can imagine during the non-winter season that many people will want to eat outside on the picnic benches before catching the light rail uptown.  The hot dogs and fries didn't give my taste buds anything new to think about either. There really isn't anything special about the food. It's the atmosphere and price you go here for. It's quick and pleasing service. That feeling that these owners actually give a two cents about their restaurant and reputation in the community. That's why you go here.   I have yet to try their seemingly famous ice cream, so I will update when appropriate. Four stars for quality and service. Sure it isn't the best food, but it's local and a part of Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 14,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "BXGXJx7yt6D8i7YQfznSSw",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Hot dog all the way w/ fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BXGXJx7yt6D8i7YQfznSSw/o.jpg"
      },
      {
        "img_id": "hfBclKbnawCQAbOIee5mGA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Panorama",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hfBclKbnawCQAbOIee5mGA/o.jpg"
      }
    ],
    "user_id": "xDtS2iKsJuVUVzB2YhfPsg"
  },
  "9Y-9iS-eoymU-stxyJHI0A": {
    "date": "9/14/2016",
    "text": "As a 7th generation Charlottean, I never pass up an opportunity to go to Mr. K's. Half of the fun of this restaurant is the incredible and friendly staff. Mr. K's is definitely a Charlotte staple and a must visit. Don't forget to get a soft serve vanilla dipped in chocolate ice cream cone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K-aWPIKDGUD7dUqYTNf_PQ"
  },
  "cGyr_EFAwwvEt-EqewWIBw": {
    "date": "3/3/2015",
    "text": "Always hits the spot! It's like being at my country hometown #BurgerSpot at lunch when I was in high school ... Good memories .... Fresh hot fries and homemade burger :) And they know my name....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0HTOGPJQ88lrgxVtn_NH8w",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Sorry I couldn&amp;#39;t help taking a bite before snapping a pic!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0HTOGPJQ88lrgxVtn_NH8w/o.jpg"
      }
    ],
    "user_id": "2R2y1Q6vn2lUibmIZDO8Zg"
  },
  "KnAxtTSBmM___Gmze5Cmyw": {
    "date": "10/25/2014",
    "text": "Woohoo finally I got to try this place! Loved my cheese burger. Had a BOGO coupon for and entree or sandwich my boyfriend and I shared it. We got two cheese burgers, one basket of onion rings (not the best) and drinks. Overall my experience was great. I look forward to going back here",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UGTQum1peLSeOZr08LERbA"
  },
  "j0sYFPFU9vtOtJ3hfnFA3A": {
    "date": "10/4/2012",
    "text": "This is really bad, I been eating here for the last 3 days. It's soo good and addicting. What make it even harder for me to resist is, I work not even a 1/2 block away. Nooooo I DONT work at Leather & Lace. Even if I was, they will fire me because I'm heading to looking like a balloon. Last 3 days, I had the Mr. K's 1/4 lbs cheeseburger on white bun, grill onions and lettuce. Very simple burger yet juicy and nicely done. I totally agreed w.Jimmy D. on the time it took to bring me my food. However, that I don't mind because my burger alway come hot and bother. Fries are hot and crispy. Customer service were on point and sweet. I will definitely be back here again. Hopefully not tomorrow or the rest of the week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5zcDRYnEnEAtPhJhZkAjZQ",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Must try their Big K burger. So yum..",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5zcDRYnEnEAtPhJhZkAjZQ/o.jpg"
      }
    ],
    "user_id": "jcURiDqCLY7AOqo8KClJnQ"
  },
  "oGlNOedel3RJ8E8stYd77A": {
    "date": "10/6/2011",
    "text": "Review #300  Why oh why have I only recently visited this Charlotte fixture.  I drive by it constantly but yet I never stop.  Well I am a Mr. K's virgin no more.  I finally stopped and am so glad I did.  I used to love these types of places when I lived up north.  People would wait in line for the goodies places like this serve.  While there was barely a line here, I was greeted immediately as I entered the building.  The smell of burgers and fries filled the air and it was intoxicating.  Thankfully, I had been good and just eaten a salad which was my reason for splurging for ice cream for dessert.  So as a virgin, I asked what they would recommend.  Of course they suggested a cone but I was getting it to go and didn't want to mess up the car.  So I opted for a milkshake of two of my favorite flavors...chocolate and peanut butter.  It was mixed well and the flavors did not disappoint  I was only disappointed in the thickness which only tells me to get the extra thick next time.    This is a tiny place with a small kitchen area on the inside wall of the building.  Tables line two of the other walls and there are tables outside as well so they make use of every inch of space.    The only thing I could see that would make this better is to have a miniature golf (putt putt) course adjacent -- which is something I remember from growing up in PA.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "SccbdaJMJkmq0_aAaOPbWw": {
    "date": "9/6/2009",
    "text": "I went here when I was home this past weekend, and I just have to reiterate how worthy of 5 stars this place is.    Best Burgers in Charlotte!  I don't care about any others!    I took my boyfriend, a die-hard Penguin person, to Mr K's and he had to admit it was amazing!  You just can't go wrong!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "RtNC8Uf-TYicZ4VccC9U-A"
  },
  "AY1_31oxu2tJOjrw3jM90Q": {
    "date": "11/5/2014",
    "text": "Good food, service and environment. This is a whole in the wall place but worth a try. The hamburgers are legit and the fried chicken sandwich is mighty tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qNSrUmf4RFsNqdMCeKI7Ow"
  },
  "uB3wxiWhWv86dFmnDSTYJA": {
    "date": "10/7/2010",
    "text": "Greasy, quaint goodness!!! I visited Mr K's on a long bike ride and treated myself to a large vanilla/chocolate swirl cone for a whopping $2.00.  It was creamy and sweet.  The staff were exceedingly friendly, its no wonder they've been in business for 40 years.    I love a no-frills kind of place like this, Charlotte has too few of them these days.  If the wholesomeness factor is too much, you can always go to Leather and Lace next door!  Or vice versa....",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "7IZQ06zkYSCLQM4JU9kFvg"
  },
  "ELlBcB53maHFsYqAMILclw": {
    "date": "8/20/2010",
    "text": "When I see an old school place that I've heard has been around for millions of years, OK more like forty, I expect something great.  Mr K's is just not what everyone says it is.  Best burger?  Far from it.  It is an old school joint, doesn't have a bathroom!  I went with a friend and we had  burgers, frys, and onion rings.  The food is just typical and nothing good about it.  The burger tastes like a burger you would get it at a hot dog stand or the state fair.  The fry's were just normal fry's and the onion rings were over fried and bland.  Parking is horrendous as the place is always packed,so some people must love this place.  I hate to knock anything but I just expected better.  Again I did not have ice cream, maybe that makes up for the lack in the buger department",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "jcocUbSjVPDDUZAAMJ8oJQ"
  },
  "_xC3yWUPxD_qg3Qf8UD3pA": {
    "date": "11/8/2008",
    "text": "Mr. K's reminds me of burger joints back home in Chicago. They serve great and greasy burgers and fries. My favorite menu item, however, is their milkshake. It's good if you need some quick unhealthy food, but I should warn you, it's not THAT quick. I've had to sit there for a while waiting while they made my food. Still, it's fast enough and I'd rather have my burger made to order. Oh, and don't forget to bring cash. They don't take plastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0TMixxb4cA7fqvGT5UeQqg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0TMixxb4cA7fqvGT5UeQqg/o.jpg"
      },
      {
        "img_id": "lcSCd-bIjdgp778nyPzOJA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lcSCd-bIjdgp778nyPzOJA/o.jpg"
      }
    ],
    "user_id": "aYF3NR0KpOkPfMbWIrFzmg"
  },
  "r5GpNQRvSIxJljalXwCg1g": {
    "date": "11/27/2013",
    "text": "Mr. K's is the real deal.  A small town burger, fries, and soft ice cream like I used to get as a kid.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nQK_6zbjDX_WXcIh0c5I0w"
  },
  "3M-cxI35kWO-MQHelFX_9g": {
    "date": "11/3/2012",
    "text": "Some of the best fast food burgers in Charlotte, always consistent in taste and has yet to disapoint after a number of visits. If you want some good food quick on this side of town then this place is definitely worth checking out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RLm9kmhWrABs_UrdLOajJA"
  },
  "AMJ5l5bXFunGaAQ6uLX0YQ": {
    "date": "11/18/2010",
    "text": "The best lunch spot in Charlotte. Friendly, family atmosphere. Great food, exceptional service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hemDAJuG9VnsEv2sLNqmig"
  },
  "fS3l982Lk6Uq6DSsHGndTw": {
    "date": "6/12/2013",
    "text": "Soft serve craving and it hit the spot! Cute lil drive. Reminds me of the small town burger and milkshake place back home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9JxXUd0JxIY9ZbFCstS42g"
  },
  "Pgp6hiS26bGYDIbgyn7A1g": {
    "date": "7/21/2012",
    "text": "Great burger joint.  The hot dogs are amazing too.  Soft serve ice cream is the BOMB.  And the owners are the NICEST proprietors in Charlotte.  Just go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9cbv35PWZ5UwvSxAmaJKHg"
  },
  "hF6smMs_eWDQlUixh4NQ_w": {
    "date": "2/22/2012",
    "text": "Stopped by this joint for a casual lunch and thought it was delicious! Sure, you're ingesting around 9000 calories, but its worth it. The burgers are really good and you can top that all off with some soft serve ice cream afterwards. Though I do love the experience of dining out at fancy restaurants occasionally, I can also appreciate when you have a good old-fashioned burger place with cheap delicious food and quick service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Yjtonc-ptwKoJljMSvH2g"
  },
  "FN6uxk2MWu9ddXh5VGGXwA": {
    "date": "2/16/2009",
    "text": "Mr. K's is that typical little burger joint that has been around forever and really can't be beat for a yummy all-beef patty.  The burgers are greasy and awesome, and the cooks will gladly dress them up however you like 'em.  Since I moved to Charlotte, I have discovered that I really like chili on my burgers and their chili combined with warm cheese sauce is really the best.  It will drip down your chin and hands and you won't want to let a drop go to waste.  The onion rings are great, and you can get a combo of rings and fries (called \"frings\") if you are indecisive like me.  The milkshakes (extra thick please!) are to die for.  I usually stick with the standard vanilla, but they have tons of other flavors ranging from chocolate and coffee, to strawberry and black cherry.  Hit the ATM on your way because this place only takes cash!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qJ4joNpHxfN80Ae0oBTzbQ"
  },
  "XulhoLUbIVenBs5RsN6npg": {
    "date": "1/4/2010",
    "text": "Great diner feel and cheap prices.  If you live in Charlotte you have to try it out at least once.  Easy to park.  Great burgers and fries.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ot0QRLc_8O1gnAHrJRlh8Q"
  },
  "cNHgkW3MRFVhgnG4PFMDRA": {
    "date": "9/1/2008",
    "text": "Crusty burgers,homemade onion rings,soft serve ice cream,family owned and operated = awesome. This is one of my favorite lunch spots in Charlotte.If you've never been your missing out on another of Charlotte's great local landmarks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "buRSVDKXhHX3dyy9dgv37Q"
  },
  "SW2eEWI9Y-8HR7Bv37LQrw": {
    "date": "11/5/2006",
    "text": "This is a small grease pit that is perfect for a quick lunch or dinner featuring burgers, onion rings, and milkshakes.  Open five days a week for lunch and dinner- this place gets very crowded at lunch, so it can be hard to find somewhere to sit or park ( they share a lot with the nursery on one side and the strip club on the other).  This is a favorite for take-out, and if the weather is good enough you'll see trucks filled with construction workers who drove over for a quick bite.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TQXtrSpsUyvHMriX8hvNWQ"
  },
  "89qx70amY1FwzTXjqVrrMw": {
    "date": "1/19/2018",
    "text": "Definitely better places to get a burger in the area. Sandwich was pretty sloppily put together with a big chunk of onion and tomato. Meat was too thin to be put on a char-broiler, i.e. burnt. Wish they didn't use the outside of the onion for the onion rings. Fries were redeeming and good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkmRuHP2jOpGwvKRKuF1ug"
  },
  "51MdvsoNXkAeiVl7JNBGdQ": {
    "date": "1/24/2018",
    "text": "The burgers are good but not out of this world or anything.  A small french fry is a bit bigger than a small order from a fast food restaurant but at a cost if $2.20 each, it's overpriced. I've not had any other items on the menu so I can't speak to them. Go for their ice cream and bypass the lunch fare.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "smNH7VoP8GI4RMpkM3JFLw"
  },
  "sgdP-2v3YyP5pvpUlIERjg": {
    "date": "2/17/2018",
    "text": "Yes, it is a little mom and pop burger joint. I was excited when I arrived. I walked in, and saw the menu. The menu is pretty detailed, you can basically have a burger with anything you want. I ordered cheese fries, a regular burger (Big K burger) and after purchasing that, I realized they had dark chocolate milkshakes. So I purchased my milkshake in a separate transaction. They gave me my milkshake, which, was pretty okay, it clearly soft serve chocolate and chocolate syrup.   My order was up, and the cook called my name out, but began to take the food back, thinking I am trying to get over on him and take another order. \"Oh, I didn't see a shake on your order so I...\" and I said to him \"Yeah, it was a separate transaction...\" That kinda left a bad taste in my mouth.   So, my food, sadly, was disappointing. The cheese fries were not very tasty. They are shoestring fries (Not good for cheese fries). They are put in a cup with cheese all over them. But the problem is that the fries taste like absolutely nothing, as they are not seasoned. As for the burger, it was the same thing, NO SEASONING!   So, for 11 dollars, I can go to McDonalds, where they at least season their food. Very Disappointing experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rdqV5xGceaCP6dFPViBa6Q"
  },
  "HaywwJS1Oe2ZYtDgmxklAw": {
    "date": "6/3/2017",
    "text": "It's one of my favorite places in Charlotte. The food is inexpensive and you get what you pay for. What I love is the soft serve and the delicious drinks and desserts made with the soft serve. My usual go-to is a strawberry banana shake, which is my favorite shake in the city. They do some great cone dips as well if I'm feeling like a throwback to my childhood.  Head there, get a $3.50 sandwich, and something great made with the soft serve. You won't regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SEW_Ej5nXB2MxXMWQSaljg"
  },
  "EShSx7XJ9EpYAQgrWewRrA": {
    "date": "7/11/2015",
    "text": "I feel lied to. We were traveling on our honeymoon and staying in Charlotte for a couple nights, and popped onto yelp to find a place to eat dinner that was good, a local favorite, and on the cheap end of the spectrum. We excitedly hurried to Mr. K's after reading reviews.   The location is interesting, between a Chipotle that I should have eaten at instead and a strip club that may have also had a better burger.   The decor in the place was uniquely Charlotte, and Panthers fans will approve.  The food was pretty bland. I ordered a double K burger, and my wife had a cheeseburger and cheese fries.   Burgers had nearly no flavor, and had to be doused in condiments and toppings to really eat. The cheese sauce for the fries was fairly watery and bland.   Fries were OK, nothing special.   My wife paid extra for bacon on her cheeseburger. Up until today, I didn't know it was possible for a piece of bacon to make me want to want to be a vegetarian.   All in all, I regret driving past McDonald's to get here.   After dinner: I had a sundae and she had a banana split. Though OK, I expect better from a place billing themselves as an ice cream location. Not any better than soft serve at Dairy Queen.   3/10",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ifxtASYX6s651cAHFQp4Fg"
  },
  "7-pArymh_O3QCD0679TwKg": {
    "date": "3/31/2015",
    "text": "I must have just not ever hit post.  There is no way that I have not reviewed this place before.  A big K, onion rings, and a shake.  I've been doing it since I was a kid.  This was literally the place where I realized that some places were just better than others in the foodie world.  This no frills diner that is located next door to a strip club may not look like much from the road, but do yourself a favor and just go have a bite.  If you're looking for healthy food, go across the street to Luna's.  The Big K is pretty much their version of the Wopper.  Its just better.  If I just left the gym, I might make it a double.  They have plenty of other options in general such as chili dogs, as well as diverse daily specials.  There isn't table side service, but the service is plenty friendly.  Give it a try, you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 7
    },
    "photos": [],
    "user_id": "wnFWoQ63F9-ohUQ-C0AeIw"
  },
  "C8W7ac4xFycGMizCmo3hNA": {
    "date": "8/23/2017",
    "text": "Southend wouldn't be complete without Mr. K's! This establishment is super tiny but the food is so fresh and delicious, I doubt you'll care. The burgers and hotdogs give you this feeling from your childhood that reminds you of the taste of backyard barbeques; the charcoal flavor, the fresh cut veggies, and the fries topped with house made chili and creamy cheese. I've never had a bad item from Mr. K's. Every time we go, I always get a dipped cone too! They'll dip your ice cream in chocolate, butterscotch, vanilla, cherry, blueberry, peanut butter, or one of their many other flavors, and the sauce will form a hard shell around the ice cream. It's such a cool process and the soft serve ice cream is so amazing. This is a great place to take your family or hang out with friends. Would recommend to all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "o6qCnAM4X_DJEP9pkO4abA"
  },
  "1wQ9mZhN4hx3rVqFsufvmQ": {
    "date": "6/3/2018",
    "text": "Great food and great ice cream i highly recommend  the people are very nice and the burgers are amazing their fries are good too I'm big on french fries and they were really good don't miss out on this",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_K0dWWvW3opmHx_OsFfcg"
  },
  "T6qJMfnoWFrKIkcF6wIFYw": {
    "date": "4/6/2015",
    "text": "Oh Mr. K! You leapt into a sunny Charlotte day. Cone craving cacophony, small swirl in a patented EAT IT ALL cone, which of course I would. Two ice cream worlds collide and integrate. Drip, drip. You were so thoughtful to put a plastic sleeve over the cone to catch the drips. Lip lick, smick smack soft serve goodness...",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "l46oARPxihhrP9JKzEDJeg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Small twist with leather and lace in background",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l46oARPxihhrP9JKzEDJeg/o.jpg"
      }
    ],
    "user_id": "5jJjY5_R06Og56VfjIc66A"
  },
  "Hib4tsatvTSB_-5w7ynHeQ": {
    "date": "4/24/2018",
    "text": "Mr. K's has been around forever. Great local burger joint with tasty burgers and excellent milkshakes. Although Mr. K might not be behind the counter any more, his family still is. (Hi George!!) They still remember my name every time I go in. I go here, take my kids here, and make sure that I take my friends here if we're near by. The food + the people + local business = happy customer for life.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LZllm-gVajYGBEYvycs9Hw"
  },
  "nsUZZYkmYSsB0DGpOkytWA": {
    "date": "6/8/2016",
    "text": "Everything a family-run, local restaurant should have.  Char-grilled burgers, hot dogs, and chicken and plenty of ice cream and shakes for afterwards or a hot summer day.  Very kid friendly and kid approved.  They have picnic tables for outside seating too.  A Southend tradition since 1967.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uGEbzHFJhVPAEn6EYHELMQ",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uGEbzHFJhVPAEn6EYHELMQ/o.jpg"
      }
    ],
    "user_id": "hbEqDiqZIB7co2T9hW6vMw"
  },
  "8RI-lqy24LUZJADBNPzkiw": {
    "date": "8/17/2014",
    "text": "Their sign mentions ice cream and onion rings, but I go for the burgers. The place feels like a diner, but you order at the counter then find a seat. If you can find a seat. There is seating outside, but August in Charlotte does not always make a comfortable outdoor eating environment.   The burgers taste like they are grilled in your backyard over a charcoal grill. There is a list of toppings on the menu board, ala 5 Guys. But for a couple of dollars less than 5 Guys, and just as good. I haven't tried other selections on the menu, it's a double Mr K with lettuce, mayo, grilled onions and jalapeno peppers each time I stop in. Keep it up Mr. K!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "QYcB-lFKjeBubZ8s4zfPXw",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Crunchy fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QYcB-lFKjeBubZ8s4zfPXw/o.jpg"
      }
    ],
    "user_id": "uT-yzDkY79szXYNWk7zDzQ"
  },
  "6YKds6QBWAEG0CtgqKaJNg": {
    "date": "12/20/2014",
    "text": "The best food The best family run Very quick service I am a regular Come eat here and discover the taste of that good old grill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ojh_NSV9kgzDizSRgxoOFA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Amazing taste and quality.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ojh_NSV9kgzDizSRgxoOFA/o.jpg"
      }
    ],
    "user_id": "b0Bd9SyjfJ3QT42fQIovXw"
  },
  "yNI0r3zoYvUkHiJljimF2A": {
    "date": "6/29/2016",
    "text": "Absolutely LOVED my Double Big K...the toppings were fresh, the patties were cooked to perfection, loved the fries, and the pineapple shake was great for the heat today. The bread was toasted on the flat top I'm guessing...and I loved it too! No frills, just a very good, well done burger. I like it like that. I am always on a diet so they won't see me too often, but I am counting the days till cheat day arrives already. LOL! Keep it up Mr. K! We'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PYPoxV6ghVGhjMJqW0oFEQ",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Close-up!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PYPoxV6ghVGhjMJqW0oFEQ/o.jpg"
      },
      {
        "img_id": "ZKCHJONpbJEynVFDnDlgOA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. This looks so good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZKCHJONpbJEynVFDnDlgOA/o.jpg"
      }
    ],
    "user_id": "SerdK2DW_2R7z1b9WU97fg"
  },
  "ItMqaix1C3j9ZuBnS1x4rA": {
    "date": "4/9/2014",
    "text": "Sometimes you walk out of an intense yoga class feeling all great and think wow, I want to go eat something bad now. That was my Tuesday. And this was my naughty transgression.   I love this place. It doesn't matter how awful of a day you may be having... you walk into Mr. K's and immediately feel happy. This place has been family owned and operated for more than 45 years. All of the warm fuzzies.   My go to order: chili dogs. Make sure to have them throw the dog on the grill. Love the chili and it's always the right amount.  Milkshakes: Jebus. Fantastic.   Fries: I'm not the biggest fry person. Yeah, I know. I'm weird. However, this is a place where I will order them occasionally. Translation: yes, they are pretty tasty.   The special this week: Sloppy Joe's. Pretty good... but it was no chili dog.   The parking lot can be a little challenging sometimes. Take a deep breath and embrace your patience. South Blvd can be a nightmare sometimes. Taking a left out of the parking lot can be impossible. I usually don't even attempt it unless it's a really off time of the day.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 1
    },
    "photos": [],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "aRdyE3ISBSx00asg_vJilA": {
    "date": "10/1/2016",
    "text": "Love this place! Hands down best burger in Charlotte. I always get the Big K burger! Place is a landmark in Charlotte. Your whole in the wall burger shop! Great location. Easy ordering & food is made fast!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zXnCL2sr3RDjtaTKHdyewg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Huge burger! Delicious! Big K burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zXnCL2sr3RDjtaTKHdyewg/o.jpg"
      }
    ],
    "user_id": "J_AxHiGeVpkyftWXOf0IvA"
  },
  "BYaWBoLxyY2Rbe2oydps_w": {
    "date": "3/11/2017",
    "text": "I have been going to mr. K's for over 25 years now! The best place to go for milkshakes and hot dogs hands down. If you're  new to the Charlotte area you must try this place. It will become a favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bN7kWBqb8c9n1k_pHFg_QA"
  },
  "5ylJ_v7VjrcSk04N5BxU_g": {
    "date": "4/9/2016",
    "text": "Whether you're in the mood for a grilled or boiled hotdog, a flame-kissed burger, onion rings, or a soft serve sundae or Italian ice, this is THE place!! Excellent service and great food is always a win-win.  It's never easy to decide if I'm getting a burger or a couple of hotdogs, but whatever I decide, I always order frings (half fries, half onion rings) and a chocolate peanut butter blitz. I can truly say I've never been disappointed every time I've visited and I always bring my family or friends here when they're visiting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ehUIsmNgA8WfiN5X2bVbGQ"
  },
  "5mels3_13MyQGecDsd6tFA": {
    "date": "1/21/2014",
    "text": "Ah, what's not to love about a good ol' Charlotte staple?!  It was about time I made it in here; I'd bookmarked it months ago and literally drive by it all the time. So let's just say I was more than pumped to finally give them a try.   Based on previous reviews I was ready to be amazed. And they didn't let me down! Mr. K's is said to have some of the best burgers, fries and milkshakes in town. After you fight your way to a premium parking spot (be warned parking is extremely limited) the diner itself is small.  You walk right into the grill and counter where you order. There are a few booths but when this place is super busy I'd say plan to either wait for a table or get it to go!  But a plus is that they do have some outdoor seating which I'd definitely recommend for the warmer months.   I ordered a chili dog, fries and a chocolate milkshake. I just can't think of a better combination! Seriously.   Chili Dog: Delish! Just enough chili and toppings to NOT leave the bun wet. You can get slaw on your dog but I opted out of that, I'm still not a fan of slaw. (I know, I know since I'm in NC I need to get used to it)   Fries: Dropped HOT each order. They were hot crispy goodness. Just like they should be! Next time, I'll have to try their infamous onion rings.   Milkshake: Creamy. Chocolate. Goodness. Yep. Order it every time. They have a good amount of variety of other flavors if chocolate isn't your thing but I'd make sure not to leave without having one.   It was a pretty good meal. I enjoyed it and left satisfied. I can definitely see myself here a few times in the upcoming months!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 5
    },
    "photos": [],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "PzNpyHcHIKokJd9b_yufMw": {
    "date": "6/20/2016",
    "text": "One of my favorite burger joints in Charlotte!  Mr. K's has been serving Charlotte since 1967 delicious foods such as burgers, hot dogs, ribeye sandwiches and ice cream.  I ordered the Double BIG K burger, fries and a grilled hotdog!  Delicious!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fxb3rDT2cxb_T_8F-LHx5w",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fxb3rDT2cxb_T_8F-LHx5w/o.jpg"
      }
    ],
    "user_id": "ghk3rjz3Qp4H8z2gyZXaEA"
  },
  "1rlY1XfSNwmISFK7xBGA-Q": {
    "date": "7/5/2017",
    "text": "Mr. K has been standing long at their corner for what seems to be generations. Charlotte's Southend has gentrified nicely to incorporate a younger crowd as we all as more contemporary, hipster small businesses.   Mr. K shows that if you do a few things extraordinary, your business won't be pushed out from gentrification. I did not get the southern comfort foods of burgers, fries or onion rings, but instead I got the chocolate dipped ice cream cone. It was delicious from beginning to end. It also has a little plastic drip cup thingy to prevent excess ice cream from dripping over onto your hands. I haven't had an ice cream such as this in a long time.   If I am ever around, I will have to stop by and try the mouth water hamburgers and fries. This place is old fashioned, but it does what it does extremely well.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ASYOxNP3asl5sPaoVtZvew"
  },
  "jESHM4sv7XNt-eET4xo0vg": {
    "date": "6/28/2016",
    "text": "We came here for dessert only. I will definitely come back for lunch or dinner. They have a great selection of sweets. I got the snowball which is Italian ice with soft serve ice cream. They have a decent selection of flavors. It was refreshing and delicious. My husband got the soft serve with butterfinger toppings and he loved it.   The parking lot isn't very big. You really can't miss this place. It's right next to a strop club.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "gGTgIf7HqungMRRUi7ZGeg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Bubblegum snow ball",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gGTgIf7HqungMRRUi7ZGeg/o.jpg"
      },
      {
        "img_id": "i496i7HFYVW33V1z4UAzig",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Soft serve with butterfinger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i496i7HFYVW33V1z4UAzig/o.jpg"
      },
      {
        "img_id": "3LxKx4vQDsjAAmMS_S4bcw",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Cherry snowball",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3LxKx4vQDsjAAmMS_S4bcw/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "NgqE0qYqWpwlpv2ZTrUfdg": {
    "date": "8/30/2017",
    "text": "This a nice mom and pop shop, it's right next door to Leather and Lace. They are popular for ice cream, hamburgers and fries.   I had a veggie burger with onions rings. The ring onions were ok but very grease and no flavor(I had to add salt something I normally don't add to me food). I should have gotten fires. The veggie burger was good.   The staff was nice and friendly. The restaurant is small but they also have tables outside with umbrella covering most of the tables outside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xEupSNbB6H8fomOjK65fgA"
  },
  "pRNWk6MpnvvpAYJkce_3gw": {
    "date": "8/17/2017",
    "text": "If you want a good hamburger and fries from a family-owned business that will treat you right - this is the place to go.  I've been stopping in here for several years and always been treated well and enjoyed my meal.  Thanks Mr. K's!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q-P89U4PeJUWpy5z15Afgg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q-P89U4PeJUWpy5z15Afgg/o.jpg"
      }
    ],
    "user_id": "u8HPA-jU1njsPPAI_anMgA"
  },
  "Cdq5w3YSULpvKtIo-2onug": {
    "date": "8/15/2018",
    "text": "I needed a cheaper place to eat since I had a big crowd with me. I had the grilled chicken sandwich which was small but tasty and shared some fries. Kids enjoyed their burgers and my daughter also enjoyed a vanilla ice cream cup. Our only issue was the horrible rotten smell similar to raw sewage that suddenly came over the entire dining area. I am still unsure of the source of the odor, but all of the customers were aware of it. It eventually passed but it was not pleasant at all. They also forgot one of the items in our order but quickly made it right. Very limited seating in the dining area.  Parking was not easy here, we had to squeeze our SUV into a tiny unmarked area out front.  Overall a good place to eat on the cheap.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-MWFYgryK4-lepVw_CKEEw"
  },
  "RemoIMxIifCNBkGR-zk06Q": {
    "date": "5/13/2016",
    "text": "I really love Mr. K's not only because it's so conveniently located next to my apartment complex but because it has great food and ice cream.   I've only been a handful of times but each time is really great. The soft serve ice cream is delicious, I mean how could it now be! Of course I always get my favorite, vanilla with chocolate dip!  I could eat it over and over again every day.   We recent went for some food too. I got a cheeseburger and the frings. Whoever came up with the frings was genius....perfect combo when you can't decide between onion rings and fries. The cheeseburger was really good too! Got it with cheddar cheese, onions, lettuce, and pickles. Everything tasted really fresh and right off the grill! And to make it even better, it's super cheap. The burger was like 3 or 4 dollars!   I love that the whole inside is dedicated to the panthers. They have pictures everywhere. Supporting the panthers, of the stadium before and after being built, memorabilia etc. It's a really inviting atmosphere, especially if you're a fan! I always look forward to going back to Mr. K's and getting my usual and now I'll also look forward to getting some new food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AoIFHDL44BdK5CdOAH9tQA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Two burgers, fringes, and coleslaw",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AoIFHDL44BdK5CdOAH9tQA/o.jpg"
      },
      {
        "img_id": "lbzU56uKyvYBAY_Y66kFOQ",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Cheeseburger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lbzU56uKyvYBAY_Y66kFOQ/o.jpg"
      },
      {
        "img_id": "3WEJZE5l4UA3Pevj7MqRTw",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Frings-onion rings and fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3WEJZE5l4UA3Pevj7MqRTw/o.jpg"
      }
    ],
    "user_id": "JY_--xgbF2WYzGywcFKf0A"
  },
  "nA9vYTdwEOvJMfbIQ3widA": {
    "date": "8/24/2018",
    "text": "Visited again today with my husband and granddaughter.  This is the type of place that your offspring will always talk about, and that is fast becoming obsolete in today's food culture.  Order at the counter and food delivered quickly to your table.  We ordered burgers for us and a hotdog for the 2 year old.  The burgers here are SO GOOD!  Hot off the grill, toasted buns. We're didn't get the onion rings this time, but they are phenomenal.  Baby is lactose intolerant so no ice cream this time.  This place is the real deal and a great local treasure.  Long live Mr K's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KVJygO2pwg1RKFH4TLCcxg"
  },
  "1i0wEdBjgOeZ5uFqDxS4wA": {
    "date": "12/16/2015",
    "text": "I suppose it's a Charlotte thing, and many of the reviewers grew up coming to this place over the years, so the attachment runs deep. To someone like myself who doesn't have those memories, I was truly let down with this place. If I had just decided to stop in and give it a try, I just would've chalked it up to a bad choice. But I had heard other people suggest the burgers here. Three of us ordered burgers and fries, no one was happy. The fries didn't have much salt and were very crispy, too crispy. Most of them stayed on the tray. We all ate our burgers, all agreeing that even Five Guys would've been a better choice.   One person said they would rather have McDonalds burger. Now, I wouldn't go that far, but I was underwhelmed. I ordered the home style patty, made on site. The party itself was good, but the buns were awful. Flattened and hard. The service was warm And friendly, but I won't return.  My daughter did enjoy her brownie sundae, though. It was huge.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LLZGKgk_jTcHZbap1b2MMw",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LLZGKgk_jTcHZbap1b2MMw/o.jpg"
      },
      {
        "img_id": "gfn26xnp9axNqaUil-mZwA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gfn26xnp9axNqaUil-mZwA/o.jpg"
      }
    ],
    "user_id": "7U3H1iJZ04FbadJtt2Npjg"
  },
  "8ohIchUo87nQrEig_G-psA": {
    "date": "11/2/2016",
    "text": "I'm giving Mr. K's four stars because of one reason and one reason only. I felt the food was a little bland. But the service is always good and that ice cream is awesome. Also their onion rings or something to note!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "x8e1Cc1lh835Q1CpHAD0RQ"
  },
  "aiNqvU7p95M-2ZXtWfMIgg": {
    "date": "5/31/2018",
    "text": "Never have had food here but I love their soft serve ice cream. When I first moved to Charlotte my mother swore up and down about their ice cream and it turns out it was True.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RPuFCkU9SV9MShZLJy6GpA"
  },
  "FgnBK6fGzK-EHnL6nbjQvg": {
    "date": "12/30/2018",
    "text": "Small and quaint, however the food did not disappoint.  Very affordable food and great quality.The burgers were fresh and made to order and the ice cream was simply amazing.  My family and I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NW6u0HIPC2QVyeOP7-rwqA"
  },
  "GJB8Pe7Vof2iTfUIfs4M6w": {
    "date": "9/22/2017",
    "text": "My husband and I adore Mr. K's and can see why it's been in business for 50 years. It features good old fashioned burgers, fries, and desserts and an affordable price. The Peanut Butter Parfait was delicious and I crave their burgers often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u3wTe3DwUqlIChWpSkUEiA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Peanut Butter Parfait",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u3wTe3DwUqlIChWpSkUEiA/o.jpg"
      },
      {
        "img_id": "a5nQFZgsKM9mM0mH0Ur_Pg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a5nQFZgsKM9mM0mH0Ur_Pg/o.jpg"
      }
    ],
    "user_id": "qOmoXOH0CIoQ7otppgaUmQ"
  },
  "HMNMM-4636RoK1YfxHdFuQ": {
    "date": "10/29/2017",
    "text": "My pecan ice cream was good. Nothing special but good . Parking was easy and accessible. The lady was helping me choose was friendly. Good experience. Will be coming back to try the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C_U3EYQM7tvRUQO3YcChew",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Butter pecan ice cream",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C_U3EYQM7tvRUQO3YcChew/o.jpg"
      },
      {
        "img_id": "W6x-Bd6e-5CKtarXyQ0Piw",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. 1 scoop butter pecan ice cream $2.67",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/W6x-Bd6e-5CKtarXyQ0Piw/o.jpg"
      },
      {
        "img_id": "HvDatiBHk2y9uO5L7OgL3A",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HvDatiBHk2y9uO5L7OgL3A/o.jpg"
      }
    ],
    "user_id": "YwHyerL4q1HwWXGnBjrirA"
  },
  "fo8yglXw3956fPcJlFPrfQ": {
    "date": "5/27/2016",
    "text": "This has been a stomping ground for me and my friends for many years.  The staff feels like family and makes you feel welcomed.    The food is typical diner fare with some differences.  I have sampled many dishes from the hamburgers, hotdogs, ice cream, milkshake, fries and onion rings.  I can speak that each is delicious.  Nothing fancy or imaginative but each is prepared with care.  This is the perfect place to indulge in greasy and sweet food.     They have many different types of sweets from milkshakes (so many types), soft serve ice cream, dipped cones, sundaes to just name a few.  I would recommend this place to anyone that wants to indulge and experience Charlotte first hand.    Details: Inside and outside seating can get busy, bathroom is located behind the building, perfect for families/friends, parking is limited but can park on street.  does accept credit cards now use to be cash only.  Pricing - A+ Setting/Layout - A Staff - A+ Food - A Sweets - A+ Clean - B+",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0jWJf6HatekqHqgFfjrrcg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. View of Sweets menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0jWJf6HatekqHqgFfjrrcg/o.jpg"
      },
      {
        "img_id": "jhGyTUYAePAxWQSgPIyAdQ",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Delicious Saturday Meal",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jhGyTUYAePAxWQSgPIyAdQ/o.jpg"
      }
    ],
    "user_id": "71x3rmehhpB5Gmd4PifIVA"
  },
  "tyQvRY0BGt6v1z0JobEdFQ": {
    "date": "5/23/2017",
    "text": "It was alright...I heard so much about this place and being a burger fiend I had to stop by...it was just ok...",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "a_1V82FzpRkYI1tMsBqUiw"
  },
  "udvVZ1k-ZKdLkw4Ms2ISvg": {
    "date": "5/18/2017",
    "text": "Stopped here for lunch, my mom used to bring me here for ice cream when I was little after getting an allergy shot.  I had the Big K and onion rings. The onion rings came wih onion ring sauce that was better than Outback's.  They were SOOO hot and fresh.  The burger was stacked and I had banana peppers and bacon added.  Super filling super satisfied!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f_kHHaMymjHXXRSJsLa9PA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Big K with added banana peppers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f_kHHaMymjHXXRSJsLa9PA/o.jpg"
      },
      {
        "img_id": "5H7r-SG_Zvi1hb200w1-IA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Onion rings with awesome sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5H7r-SG_Zvi1hb200w1-IA/o.jpg"
      }
    ],
    "user_id": "pOAOkXP-_TEOj6v0Z0BBew"
  },
  "aTyctMUTefr9l4V7Q5WGBA": {
    "date": "3/16/2014",
    "text": "Coronary burger with a side of frings. Of course, the burger loaded and on an onion bun because... why not?  The burger was excellent. Decent beef in there and cooked properly. Cheese, onion, tomato, ketchup and mayo. All the proper toppings for a proper burger.  As much as I wanted to have one, I opted to skip the milkshake. Maybe next time, I'll drop the fries and go with the shake instead.  Service was good. Be warned that they put a lot of ice in the sodas, but they do give free refills.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 10,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "V4ZbkrhIbXzm9T-uZrv41w",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. The sign out front",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/V4ZbkrhIbXzm9T-uZrv41w/o.jpg"
      },
      {
        "img_id": "g2Makynu3pTYJo431FsYgA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Cheeseburger and frings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g2Makynu3pTYJo431FsYgA/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "fJf7x8G7r_gRf-aGaWReAA": {
    "date": "9/22/2018",
    "text": "I frequently stop here on Sat...But today will be the last time...The blonde manager( which I've never noticed until today) Had an attitude because I changed my mind 1 min after I ordered!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QX5RBcDH6ZhenLJ_MyN57g"
  },
  "JimuEGgPR-FhLFnzSDwibw": {
    "date": "5/6/2016",
    "text": "This place is pretty awesome and just makes you happy when you step inside. Family owned for a long time and a Charlotte staple!  We can here the other night as my hubby was craving ice cream after I cooked dinner....not sure what it is about craving sweets after a home cooked meal but it's definitely a thing!   Everyone inside is super nice! I got the small swirl cone and my husband got the medium chocolate dipped in peanut butter. The dip was so awesome. They had chocolate, PB, Butterscotch and Strawberry. Love that they gave us a little sleeve so the ice cream didn't drip! Didn't get any food food but everything smelled awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Hw5riZfnB-B7G79vBTOssA"
  },
  "f638iuap5qeh_3fuSfbg3Q": {
    "date": "3/8/2018",
    "text": "Not a fan of this place!  I've heard a lot of people talk about it how old it is and how great it is and I  did not like to food at all",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j7cJN9xwO9ZUvHQhFRP7Mg"
  },
  "lfNZYYigKXMp1ciGkh3e6A": {
    "date": "4/26/2019",
    "text": "Yummy! Had a craving for soft serve and this place took care of it! I got the strawberry shortcake which was fabulous! My mom got a small soft serve cone- delish. Plenty of ice cream for the money!   Con- the parking lot is pretty bad. Watch for pot holes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IvRfqyZVPbdrAHmLc478iQ",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Strawberry shortcake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IvRfqyZVPbdrAHmLc478iQ/o.jpg"
      }
    ],
    "user_id": "LhaAilhWwkgJV4L3SXy1zw"
  },
  "ejfGVUuPVCdIXWVMLsOOwA": {
    "date": "7/11/2019",
    "text": "This place used to be great. Unfortunately, this recent attempt to visit will be the last. We walked in at 8:46 on a Thursday and received an ugly stare from a male employee. A female employee then pops out from behind the counter and tells us they're closed.   We only came for ice cream and specifically got our dinner to go to get there in time without waking in 5 minutes prior to their closing. They have a giant decal on their windows out front that says they are open until 9 PM. They tout soft serve which is not a labor intensive food.   This is the kind of thing I'd expect from a McDonalds ice cream run, not from a local business that's been there for 50 years. It's a quick way to lose business, and unfortunately they've lost ours. If you don't like your hours, change them.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2tdU9vdKHFJ7Qh4A6cSVeA"
  },
  "V-mDjDNGxrTSAXDZUO5DmQ": {
    "date": "3/27/2019",
    "text": "Love it love it love it !!!!!  I like a grease joint where i can get the perfect handful of fries and a tasty burger. The ice cream just adds to the charm. Mr. K's is fairly nostalgic for me. It reminds me of summers of the jersey shore and grabbing this kinds of treats at the snack shack on pool days.   The food is simple and good. No major frills, bells, or whistles... just plain delicious food... delivered in a flash.   The staff is fairly friendly too... more than some of the patrons. (antiquated thoughts I suppose) Seating is limited inside... pletny of space outside... but I dont think the CLT community has moved to shared seating or community... but you can always ask and offer extra seats at your table to others.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DdeLZ-vF-TiILcUInFnIBg"
  },
  "abGRHpOE08Z2jQIl_mVFZg": {
    "date": "8/17/2019",
    "text": "Very yummy! Love the retro vibe of the place. I got the peanut butter parfait. Can't wait to come back and try more dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9rEu3K70B2FWsYA6Ra8JQw"
  },
  "gAbgctfEcl0ryUl1ugs_ig": {
    "date": "6/27/2019",
    "text": "Ok, I get that they've been in business for 40+years and that it's a huge memory trigger for people. With that said I'm like \"eh...\" The Service was impeccable, the staff was attentive, courteous, well knowledgeable and fast. The place was full, not cramped or slammed which is a good thing as it is a tiny... tiny place. Got a burger, onion rings and a cone. Good, not spectacular but good did the job filled me up. I went and now I can say I went so there you go. The soft serve is very good but all soft serve is.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nqzrDPWV4kIUonjUXKdC7w",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Burger on an onion bun and onion rings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nqzrDPWV4kIUonjUXKdC7w/o.jpg"
      },
      {
        "img_id": "3vq85s7lhe0dPi-zrEd_FA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. First time here, so we&amp;#39;ll see.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3vq85s7lhe0dPi-zrEd_FA/o.jpg"
      }
    ],
    "user_id": "tC4CCS-pXhm6MPlbrgJjSg"
  },
  "kLRROouWgPyUKkxbw28CKg": {
    "date": "2/4/2019",
    "text": "So happy to have made my way from Concord to visit Mr. K's over the weekend.  Always a fan of these older mom and pop restaurants and Mr. K's did not disappoint.  I had to ask the difference between the regular cheeseburger and the Mr. K burger and was told and ounce of beef was the difference 3oz Vs 4oz.  You can choose the type of bun white, wheat, or onion.   The Mr. K is topped with your standard offerings of Lettuce /Tomato /Onion.  I opted for a Carolina style with chili, onions, and slaw.  The chili was a great topping but the slaw was a bit sweet and runny for the burger.  Fries and Onion Rings are solid options here but the star of show were the rings, scratch made unlike the fries which were frozen shoe string fries.    Look forward to my next trip to Mr. K's and will try the soft serve or shakes.  Food: 4 Sporks Service:  4 Sporks Atmosphere: 4 Sporks  Local Beer: 0 Sporks Value: 4 Sporks",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KoJ63m2027WRikplKWh7EA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KoJ63m2027WRikplKWh7EA/o.jpg"
      }
    ],
    "user_id": "qZuKmM78JxB15KEb_ukj3Q"
  },
  "ZtI19kueOCu2NtD72RwZ3w": {
    "date": "7/28/2018",
    "text": "Mr. K's is one of my favorite places to go to for a quick burger and fry or milkshake! Their milkshakes are one of the best in Charlotte. Their soft serve ice cream is also the best. Super hard to find soft ice cream in Charlotte but this place has it down pat!   Lots of flavor options and different varieties for ice cream. Hard, soft, milkshakes, Italian ice, etc.. super big menu and prices are great!   The chicken tenders are my personal fav, nothing tot fancy but just so darn good. It's a quick spot with very friendly workers. A long running business that is truly so good!  Their hours are very selective. They close by 9pm on Friday, close by 4pm on Saturday and closed Sunday's. Thursday nights and Friday nights are the busiest but quick moving in there.   Highly recommend for food and ice cream!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6e8ioVjYDMqhoYQadzdY1A",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6e8ioVjYDMqhoYQadzdY1A/o.jpg"
      }
    ],
    "user_id": "f6oyZA1DUdVEqewR95TSdA"
  },
  "_iAcYcK-8TRBsk9fg5lc-A": {
    "date": "6/11/2018",
    "text": "Finally got to try this place out for lunch last week. We are always searching for a cheap, good burger place. Also it was hot so ice cream was a must!   The place is small and a diner like atmosphere. The parking lot is small, but we didn't have an issue finding a spot at 11:30 on a Thursday. The employees were super nice and welcoming and were ready to help us decide what we wanted.   The menu ranged from milkshakes, soft serve ice cream, burgers, hotdogs, sandwiches, onion rings, fries, and bacon cheese fries! From what I saw, they don't offer any combos. So the main thing (burger) and sides are separate. So even though the prices are reasonable it adds up quickly, esp if you want a drink. I ordered a single patty burger and French fries with a cup of water for about $6.70, then got a small soft serve cone for $2.39 (without tax). My co-worker got a single patty burger with cheese fries (an insane amount of cheese in there!!) and a drink that was a little over $11. People have said this is a super cheap option, but I think after you get a side it ranges into a slightly more expensive place. Compared to other south end places it is on the \"cheaper\" side.  I got a burger on an onion bun, which was tasty but the bread was a tad thin and made it a tad difficult to eat the burger. The fries are simple but very tasty!! I got grilled onions on my burger which were super juicy. The flavor was ok, but I bet they'd be better as the onion ring. Finally, you can never mess up soft serve ice cream. Delicious!   Overall, definitely a place to check out. Some days you need good \"bad (unhealthy)\" food. And if you want to make it worth it, this place is great! I will definitely be back and try the bacon cheese fries and onion rings!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "49NNUmF6VewbKJDGfP4ebQ",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Cheese fries. Layers of cheese throughout!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/49NNUmF6VewbKJDGfP4ebQ/o.jpg"
      },
      {
        "img_id": "cJsmNCX0u9zOfOwI3v_1bg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Burger with small fry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cJsmNCX0u9zOfOwI3v_1bg/o.jpg"
      },
      {
        "img_id": "ZjzINoYHhcwkn2YJSePlGg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZjzINoYHhcwkn2YJSePlGg/o.jpg"
      }
    ],
    "user_id": "yG5GBPaHFSqSllss_3VqGQ"
  },
  "mDqR2CwN6qGOso5eRhTmMA": {
    "date": "3/26/2019",
    "text": "My coworkers and friend just so happened to mention Mr. K's today in two separate conversations, so I knew it was a sign for me to go there for dinner. I was craving a good burger and it hit the spot. Went all out and threw in a Butterfinger milkshake for good measure as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "YscjZezxLirEjK_bK82uAw"
  },
  "ZvZzEZWgViuq9nd0v80ZsA": {
    "date": "7/12/2019",
    "text": "So good! Ordered a hot fudge brownie sundae and the wife ordered a peanut butter dream parfait. You have to check this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AXnZ8_rFOuw7EZfczz857w"
  },
  "hrIffh-7WSweKP7n_sYJ0A": {
    "date": "8/2/2018",
    "text": "We pulled into a beat up parking lot but didn't allow the looks to discourage us. We walked in where the man behind the counter was cookin' up burgers and fries. It was more of a burger joint than an ice cream place. I saw a sign that said \"we have mango soft serve\" -I thought \"oh wow my girl loves mango perfect.\" I asked for a sample. It was pretty good but I had my heart set on chocolate soft serve. SURPRISE!! They didn't have chocolate today only mango and vanilla. So much for the soft serve. We were extremely disappointed but my signed did manage to order a small mango.  So unless you want to come mainly for food and the ice cream is a bonus then you will enjoy it. Needless to say we are off to find another ice cream place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "auUceOuvLEYyCG8tJMGqtA"
  },
  "H8oeMMauT5hidCo0D9MR6g": {
    "date": "10/10/2017",
    "text": "A True Charlotte gem. I love this place. Most likely you've driven by it without stopping. It's right in Southend, across from Atherton Mill, next to Chipotle. It's a mom and pop shop--with a small parking lot and an old-school feel.   The interior is small, but they have fit as much seating as possible without it being too stuffy. There are plenty of outdoor seating options as well. When you first walk in the counter directly in front of you is where you'll order, pay, get your ice cream and watch your burgers being cooked! That's right, the grill is right out in the open. It's a genuine diner experience.   Mr. K's knows how to make the originals, and they haven't tried to steer away from that. Go for a burger, fries and shake. You won't regret it. I love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ehqxXKlMjg0H3FkxCySXiA"
  },
  "erFLYqNtwKrEfW-S2crO7g": {
    "date": "3/13/2019",
    "text": "Really great burgers and shakes, but honestly, I go for the onion rings. These are the REAL deal, with flaky, hand dipped batter, not that nugget rock hard stuff that resembles stucco. Burger is always perfectly cooked, and slightly pink on the inside of the patty--no matter how busy they are--and delicious, instead of thin, gray cardboard you usually get. I love that they will make any combination of shake you want--I asked for a chocolate-strawberry and they were happy to oblige for no extra charge.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mKfNH_IlFBjCviTi8Bi9Lw"
  },
  "TVdy2usJ3zk3bUeLiOEW-w": {
    "date": "5/16/2017",
    "text": "I finally got to try this place and I was so glad!  I went on a Monday evening and it was packed!!  The people  just kept piling in.  There was a bit of a wait on the food and to order in general, but that was to be expected.  The service was good and the cashier was patient being it was my first visit there.  I had a cheeseburger, onion rings, and chocolate malt with oreos.  Everything was delicious and even better than I had hoped.  The prices are fantastic and I fed three people for $21 WITH desserts!  You really can't beat that.    They had so many wonderful dessert options, I can't wait to come back and try them!  I had a really good experience.  And I KNOW I will be craving that cheeseburger again soon!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "iO6ZLayvxn8mr_-U2gz0Fw",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Cheeseburger on onion bun",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iO6ZLayvxn8mr_-U2gz0Fw/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "7yeb2yfR3pIUfEwKmI0fRQ": {
    "date": "9/22/2018",
    "text": "It has been over 30 years since I visited Mr. K's. Honestly, I forgot about them and happened to drive by at lunch. So very thankful that I stopped in and had a burger and onion rings. It was EXACTLY what I remembered from my first few visits several decades ago. I saved the location on my phone and I can guarantee that I will be back, very, very, soon. AND, this is the best place to find soft serve ice cream in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R2Ag0uBbhb4n8y1VeAMmzw"
  },
  "zbU4jqYMF1246ooqpLaJVg": {
    "date": "7/1/2018",
    "text": "Mr. K's is not going to be the \"best\" of anything you've ever had, but this place has the aura of an institution.  Charlotte is a relatively young city and is a bit lacking on landmark type restaurants.  This place fills a small part of that void.  It's in a poorly maintained parking lot off a busy stretch of South Blvd. and next door to a strip club.  The building itself shows its age, but that just feeds into the experience.  Once you go inside you see Mr. K's for what it is:  a simple, no frills place to get some old-school american food, ice cream, and milkshakes.    The italian ice and soft serve are what I get the most, and I am always very happy with both.  The soft serve is above average compared to what you get most places.  It is super creamy and always hits the spot on a hot day.    Burgers and fries are simple and satisfying.  Pricing is more than fair.    Always looking forward to my next trip to Mr. K's.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fv0nwcqNSsbm3kUiX5Ijkg"
  },
  "x-mkN67v9KUWa7SyXvk1xQ": {
    "date": "6/6/2018",
    "text": "Highly recommend trying Mr.K's if you have not already. I realized I had been passing this place quite a few times before I realized it was there. I would recommend going during off-hours considering their parking lot is not the biggest and it can get very crowded inside. However, the wait for your food is never that long.   Their menu has a huge variety and their prices are ON POINT. You don't see prices like these anymore. They have been in this location since they first opened, so it has a quaint old-timey feel to it.  It sells food similar to that of any fast food restaurant but Mr.K's is much better quality for a lower price. I've gotten the standard burger and fries before and they were great! Not something to rave about, but definitely not a waste of time or money.   HOWEVER, if you are ever in the mood for ice cream or a milkshake YOU NEED TO GO HERE. Their milkshakes are TO.DIE.FOR. My personal favorite is their hot-fudge milkshake, that literally gives me goosebumps, it's that good. I've made many of my friends try this place solely for their ice cream and they are mesmerized by how good it tastes.   Definitely give this place a try, you will not be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AQ5R3cUUBiRkYGlgmY1nDw"
  },
  "4UmAp1dYapykPnNTiVlQYg": {
    "date": "3/6/2017",
    "text": "How have I lived in Charlotte for four years and not been here till now? This place was amazing. Granted, it's a no-frills, straight forward burger and dog joint, but it definitely fits the bill when when you want that old-fashioned, roll your sleeves up and get messy burger.   There's traditional burgers, dogs, that you can add your Own flair to with tomatoes/lettuce/onion/ etc. or you can jazz it up with some chili, bacon, or mushrooms. There's also fries and onion rings or you can get a combo of \"frings\". We went with the fries and they  were thin, delicious and not too greasy.   They also have some delicious (sounding) desserts. After the burger and fries, I didn't have any room for ice cream or Italian ice, but it's definitely on my list for a future visit.   Word of advice- you don't need a large soda. They offer refills. Rookie mistake.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6vpCwyelANbdhPsE8npHKw",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Cheeseburger with chili and lettuce. Fries in the background.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6vpCwyelANbdhPsE8npHKw/o.jpg"
      }
    ],
    "user_id": "RBNPf_GF8dWlWPxWvkyJXw"
  },
  "J469R9t58xyQYD00eFxNpQ": {
    "date": "3/5/2018",
    "text": "This place holds a special place in my heart....I love the handspun milkshakes and the burgers here are top notch....and let's not forget you can get you can get your hot dogs boiled....not too many places offer this option.  I would definitely recommend coming here with friends or family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gRRDzxER0YrxtHN3kYsUmw"
  },
  "LrByV8kD6JXw1jl8KM-iFw": {
    "date": "10/11/2017",
    "text": "I really like this spot. the down side is the thing I come here for are the hot dogs, but the are very small. You can get a jumbo but its 4 bucks. The upside is they are really good. the company offers milk shakes and burgers as well. its small in size. Not to crowded during lunch like Zacks . I randomly come here its not my go to spot but it will hit the spot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Lcm0ZKTOp8vPaqLaNZ_XNw",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Lcm0ZKTOp8vPaqLaNZ_XNw/o.jpg"
      },
      {
        "img_id": "i96axWVhz29YjvtskwgzUA",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Loader regular dog",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i96axWVhz29YjvtskwgzUA/o.jpg"
      },
      {
        "img_id": "92OB3B60tSl2YX1u7Rydag",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/92OB3B60tSl2YX1u7Rydag/o.jpg"
      }
    ],
    "user_id": "R4J6GaAsIR6PakJOnHNZVg"
  },
  "PwcCULIBeEvsQplvpcCtsQ": {
    "date": "12/27/2010",
    "text": "I've been to see Mr K several times. Each time I have had a great experience. Eat in, take out; ice cream or burgers...no matter, all good. My favorite is the brownie sundae for scream and the Mr K Burger all the way for my dinner fix. Gotta have the rings as well.   Your typical old \"soda shop\" style place with a few fountains, flat top grills and small booths. They only take cash, but no worries as there's an ATM on site. The staff is always s delight and I enjoy my experience every visit.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "c8cur4lMkQsHoUEqm-qwxg"
  },
  "R3_tAVLoe1snaY_KRWZZkQ": {
    "date": "3/31/2014",
    "text": "I frequent Mr. K's all seasons, I'm not biased towards summer. Amazing ice cream of all sorts and even some creative options (like the snowball, which is sno cone meets soft serve) too. My favorite (no surprise here) is the peanut butter dream. Thank goodness I can walk to Mr. K's from my house to work off some of those calories. (Who am I kidding though, I'd have to run a marathon to work off the peanut butter dream!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "flz-ymsTSzM9ACOV2JyU8g"
  },
  "4a_G81i_7Z910ULDam1-Jw": {
    "date": "2/14/2016",
    "text": "First, the title of the place is a bit misleading. It's not a drive in. The burgers are ok but, not my favorite. The best reason to go here is for the milkshakes. Yum! They have butterscotch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CF7DFd6gra2t7LIUiS6YZw"
  },
  "83gWaHh9STPQEm2lVQnMbQ": {
    "date": "2/6/2011",
    "text": "Mr. K's is a Charlotte institution. My boyfriend grew up in the area and frequented Mr. K's with his brother, so was very excited to take me there when I first moved to town. Since then, we have been multiple times, and every visit is a wonderful experience.   The tiny restaurant is a greasy dive with the best onion rings in town (as the sign proclaims) and delicious ice cream desserts. Everyone who eats burgers comment on how good they are; in my case, I can vouch for how great the chicken fingers are. The milk shakes are to-die-for and come in so many flavors they rival Cookout. The brownie sundae is also a great sweet treat option and with a scoop of ice cream covered with chocolate and caramel syrup and whip cream.   The owner has been there cooking up the food every time we've gone in, and the employees are always very friendly and accommodating. The best update to the restaurant is that it now takes debit and credit cards, so you don't have to worry about stopping for cash if you're like me and only carry cards.   We highly recommend Mr. K's and think everyone who lives in Charlotte should check it out.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4oSao9GTLxFTurp9NFpE4Q"
  },
  "EZsQYS0F5Svcy7ybZxU5Dw": {
    "date": "7/11/2010",
    "text": "Ah, the sweet, sweet aroma of burgers and ice cream in one. Such an aphrodisiac.   Even though Mr. K's serves up some tasty burgers and fries, I'd much prefer to spend my time (and calorie allotment) on the sweet treats.  Mr. K's is such a Charlotte staple - an old school joint with greasy eats and amazing ice cream creations. Don't expect to grab ridiculously upscale and creative ice cream creations here. Instead, on the sugar front, Mr. K's serves up incredible milkshakes, soft serve and sundaes - the brownie sundae is my personal fave. It's a large portion of creamy vanilla soft serve with a sizeable brownie topped with a massive amount of chocolate and caramel sauce and whipped cream.   The employees here (especially the owner) are extremely kind and always seem very welcoming to each customer who stops by. Be sure you bring cash, as Mr. K's is cash only. I'm a big, big fan of Mr. K's and I'm always looking forward to my next cool treat from this famous ice cream joint just down the street.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "qlC607Cyp0Mj91vDFvkp3Q"
  },
  "VKr7T23iD1bc4eR0N8Yn0Q": {
    "date": "8/19/2010",
    "text": "Mr. K's is a classic drive-in, serving your standard fare of burgers, fries and shakes.  Anyone expecting something classy is going to be sorely disappointed.  You come to a place like this for comfort food, not high dining.  I ordered a burger and fries and while they weren't exceptional, they were tasty enough for a quick lunch.  Two of us ate here for a grand total of $9.  I can't wait to come back and try out their soft serve.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "xZT6tGmYpVSveRduSW75Mg"
  },
  "LR_Ya9XxyRgF92B2kmmghA": {
    "date": "9/27/2013",
    "text": "Haven't eaten the food here, one day I will, but for now I'll stick with the best milkshakes in town. Banana + Caramel = Pure Bliss",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ueOovL4C5FJ6SVyrvV-Tww"
  },
  "GwmBvG5Nq6y5YOYDKtU80Q": {
    "date": "12/23/2012",
    "text": "I love Mr. K's!! I have been coming here since I was child and it is still my favorite place to get a Carolina Style (chili, slaw, onions, mustard and mayo) burger! I mean... It's the best!! They toast the bun which is a special added touch! I've seen this place grow over years and love the new addition of added seats and now accepting cards is really helpful! I'm usually too full for ice cream or a shake but they are so tasty they are worth a visit here for themselves.  In my opinion, Mr. K's is the best place to go for good ole burger!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "O-nb7z-iqeXGT1i-98HvUQ"
  },
  "CV2MPqH9V9V1WU59v2e_BQ": {
    "date": "3/27/2010",
    "text": "An authentic 50s diner; appealing, if you like vinyl. The simple red-white-and-blue menus slightly predate the Grease-era diners. You can almost feel the postwar optimism, if not the ensuing decadence. This may be the last restaurant in Charlotte - nay, the developed world - that primarily uses styrofoam cups. They have enormous stacks of these planet-killers all over the shop, presumably in imitation of the landfill that they are destined to become.  I see reviews touting this shop as a cultural landmark hailing from a bygone Charlotte. I understand the sentimentality. Charlotte loves to replace its history with ugly glass-paneled sky scrapers and something ought to be saved, but I'm not sure that this is the nugget I would choose.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "8-c_N_vSkwVieg8sHn_Ppw"
  },
  "gPFLIiW-O_Acw7EHcXi09A": {
    "date": "6/17/2015",
    "text": "Delicious, cheap, no frills burgers. Nice family that runs the place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bPD81iTD394hjbVp2g4aGg"
  },
  "RfFuueUt_rW8sDOLlDnbyg": {
    "date": "5/3/2011",
    "text": "A True diner experience. The food is what you'd expect from a mom & pop place and the staff is incredibly helpful and friendly. The burgers and onion rings are my favorites and if you are dying for some ice cream on a hot summer night this is your place to go. They serve soft serve ice cream and it is very kid friendly. George, the owner, will cook anything on the menu to your order with a smile and a friendly hello. I love this place.   You can't spend time in the Queen City without having a Mr. K experience. It will keep you going back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqNz_fSAHXEV9z_S8EFivw"
  },
  "s8Yi7p5quIkViZM0K8ykTQ": {
    "date": "6/23/2012",
    "text": "If you want a delicious burger and shake, Mr. K's is your spot.  I tried The Penguin, The Diamond, Big Daddy Burger, all of those places, and all are good, but Mr. K is my favorite.  It's a simple, but delicious, tender burger. Go Try it out!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CMaYFUj_JtvzP2vMbh-uHw"
  },
  "At3Gw0n5tvFW52315GBcyQ": {
    "date": "1/25/2011",
    "text": "What hasn't already been said about Mr. K's?   A short walk from our apartment off South, The Boyfriend and I keep kicking ourselves that we waited so long to visit Mr. K's. As it is, we keep going back since that first time, loving the freshly-made-to-order burgers, sweet cones and staff that (depending on who's there, of course) remember our names and orders.  Although I'm sometimes tempted by the specials (though have never made it in during a Mushroom Burger week, which could be a game-changer), I inevitably always go for my standby, burger perfection of a Big K with bleu cheese, grilled onions and various accoutrements.  So delicious and reliable, always perfectly cooked and outrageously yum. The Boyfriends likes cheddar and bacon on his. We split the fries, which, yes, are frozen, but are always freshly cooked and solid.    The simple pleasure of a vanilla cone to conclude our meal is rarely matched, even when we're strolling back home with them in 35 degree weather.  It is clear to see why Mr K's is a local Charlotte institution, and I can only hope that it will continue to be for many years to come.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T6953RKf_xLbtmndOWIGdQ"
  },
  "OFP0pt6E-p_f_XszJLSq7Q": {
    "date": "9/29/2014",
    "text": "dogs just ok, nothing special and same with the burgers.  would have been higher rating but the service was terrible. made my order wrong then tried to tell me that's how I ordered it.  then the fix was to just scrap everything off and give it back to me. longevity doesn't mean u get a free pass on service and quality.  Zacks or any other place for that matter is a better option. didn't try the soft serve but I'm sure it's ok.  guess I won't get the chance.  disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mi_LJxA5hI3jwb2t7HmZew"
  },
  "pczTu50SPkh3bEyr0vBVkw": {
    "date": "8/11/2013",
    "text": "Mr. K's has become a guilty pleasure :) Great burgers and Fries. Their ice cream is a great way to top it all off. This reminds me of a burger stand from back home in NY. Great throw back kind of atmosphere, casual and friendly staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gML6KwdcEIRkF6T86i6Shg"
  },
  "mvtQSNTnBASzcnQnQItSKA": {
    "date": "12/15/2009",
    "text": "I'm a little biased as I've known Mr. K and the family since I was a kid. That aside, I have to say that they have the best hamburgers, milkshakes and service in town. Standard order for me is the Big K with mustard and ketchup, fries and a cherry soda. If I'm feeling like a big-timer, I'll end the meal with an extra thick, banana milkshake....gutbuster!!   The burgers are patted out thin...have a smokey flavor and are done on the flattop...I like my Big K w/ just mustard and ketchup, but have to admit that ordering it like a hot dog is another pro move (chili, mustard and onion). I love their fries and am not a fry guy...also not an onion ring guy, but they regularly win best in Charlotte. As a young lad, my ice cream order was always soft serv dipped in chocolate and rolled in peanuts....the best!!!! I don't know why I ever graduated to milkshakes but alas...the only better shake that I've had is at Tony's in Gastonia....and not willing to make that drive for a 1/2 point difference in a shake :-)  Long live Mr. K's!!!! (and it's next door to an institution....how can you go wrong w/ the L&L staring at you)",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "21QNv2Y-DJv6KC8JaT38fg"
  },
  "QmZ_k-exc7-omNJ3rVdurQ": {
    "date": "1/29/2009",
    "text": "\"Here they come on the run with a burger on a bun And a cold dab of Coke on the side, Oh, your taste they will tickle with a cold dill pickle, And all of their potatoes are fresh fried fried fried. Their burgers can't be beat 'cause they grind their own meat. Grind, grind, grind, grind, grind.....\"  My apologies to the Flintstones, but somehow Mr. K's reminds me of that jingle sung by Wilma and Betty. Mr. K's may actually have been around since I was a kid, so I guess that's why I'm reminded of the way burger joints used to be.   That's the way Mr. K's still is. Burgers that taste like beef, crispy fries with a slight taste  of salty burger-grease, onion rings with real onions inside (if you can't make up your mind, order \"frings\" and you'll get a mixed order of rings and fries.... heavenly), and homemade shakes. The cholesterol might stop your heart, but at least you'll die happy! Mt. K's is a piece of Americana to enjoy today and remember for a lifetime.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "G24i0CV2pOHoi-JTjCejaA"
  },
  "b0wSc4D3S_8brhVa88h05g": {
    "date": "4/3/2015",
    "text": "What a Great place. We went to South End to check out some of the design shops and saw this. Like a throw back to days gone by. The Shakes, Burgers and amazing Onion Rings. Cash only who cares I'll bring a bag of it next time",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1NF0TwI96XLAH9w2xzN2g"
  },
  "zeGL-Dzb29BFYZ272tuX6A": {
    "date": "8/4/2011",
    "text": "I didnt think this place was anything special. My extra thick chocolate shake didnt even pop the vein out on my forehead. I also didnt find it to be very chocolatey. It's like they put the soft serve ice cream in a cup, blended it & served it. I noticed they had a ton of flavours. My friend's son had a peach one & said it was pretty good. I guess on a warm day & if this is all that is around I would return.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6OsqYvCScSAcqP9jQcOAlA"
  },
  "FTQ05GXTTxFNSwWTfmWUxw": {
    "date": "7/30/2011",
    "text": "since there are so many reviews about this place, this is all i will say:  first time eater, life-long lover.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UVHmn4-9yKV28L0JUjieSQ"
  },
  "oH2YEaJSZBb5_t5c3VbhQg": {
    "date": "3/10/2015",
    "text": "Good hot dogs, burger just ok but they do have wheat buns which is a rare find.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "66Clm9PflKrplfrXzwgqWw"
  },
  "9bJEx8SsbhjF1B9Be1bAHg": {
    "date": "6/26/2015",
    "text": "Got a couple burgers & fries with my fiancee',  food was right,  & friggin awesome!!  Didnt take very long,  the chef seemed on point,  got busier as we were leaving,  saw she had 6 burgers goin,  buns toasting on the grill with toppings already added,  seasoning salt,  texas pete, ketchup & mustard all at the table,  all full,  season salt was a nice touch,  drowned my fries in it cause u dont get that a lot,  all in all,  quick,  very, very good food,  & i dont like enormous burgers i cant finish,  just strait up hit the spot,  very happy belly,  cant wait to get more honestly,  very solid food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mlkjInlCWNKGub5VwD9MVQ"
  },
  "rhzs9i8Q3CipLtFS1Az--g": {
    "date": "6/23/2015",
    "text": "Me and my husband visited this place for the first time this weekend. We both just really wanted some ice cream so we both ordered the brownie sundae. This was the WORST mistake ever!!! It was disgusting, mainly due to the fact that the brownie was really hard as If it was frozen. The spoon wouldn't even put a dent into it! My husband had the same complaint. And when we told the staff about our issue they just seemed unconcerned and responded with \"oh that's why I order it without the brownie\" and \"the ice cream made the brownie hard\". Both of these responses were unacceptable!! This place literally put a bad taste in my mouth!! Never again!! That was my first and last visit. Plus the booths, tables, and chairs were nasty and old!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "APfow8oInbgHsXpu67vGdg"
  },
  "iN4rtNxZpG0_O6kO66xbsw": {
    "date": "8/7/2016",
    "text": "Some of the best burgers in Charlotte.  Easy to find, good ice cream and fries.  Low prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RFZ_Bnjpg_JOn50LP0Yqsw"
  },
  "DmebFiT77OqabqFN_a0jQg": {
    "date": "4/11/2015",
    "text": "Nothing special.  We ordered hot dogs, onion rings and shakes.  The hot dog was ordinary nothing spectacular to write about. The onion rings were even less tasty. The shake was not bad. The service was great with good attitudes. The only reason I would try this place a second time is to try a burger.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fg5-XX6a10nD51kiy1vdCg"
  },
  "nbPcKXCj7L_L-J-HSXedIA": {
    "date": "5/1/2015",
    "text": "I went there first as a suggestion from a friend.  This place is awesome! Especially in the summer when you can sit outside.   The staff is always friendly and the food is always goood.  I love that they have italian icees.... those are my fave :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TS5wQ_Gii3IMpUQIgb4Q7Q"
  },
  "1TQGrFA7E8JvuK1TAfLLnQ": {
    "date": "10/10/2012",
    "text": "Just stopped in for an ice cream cone with my friend!  We both got dipped vanilla cones....she got blue raspberry and I got the dipped peanut butter.  They were both delicious.  (And cheap!)  I feel like so many places mark up ice cream cones for no reason at all!  This place also reminded me of the burger joints where I'm from in Upstate NY.  You see them cooking on the grill....order at the counter and they bring it over.  It's a pretty small space, with outdoor seating.  I didn't try the actual food, but if you are looking for some greasy, cheap fare in South End check it out!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HZc-l7hEkl0SIqCH8swQtw"
  },
  "NCNb-jue71xEUOq6TlZEcA": {
    "date": "10/1/2012",
    "text": "If you want soft ice cream and fried food, this place is pretty solid...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LwvPZ1bQt5-Zl1xxPberVQ"
  },
  "_vi6TyUZj2gcUXlG7QJhsQ": {
    "date": "6/27/2016",
    "text": "Good soft serve, not bad prices at all. Service is friendly. Their food is pretty good as well. But the ice cream is definitely their high point.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1xqyzC665jy86RzuPYfdjg"
  },
  "Fzpnv3LUSYkLvhZM5w9JRw": {
    "date": "1/29/2015",
    "text": "These Mr K burgers are the shit!! I literally sat down ate 1 and had to go get another when I was done. Amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U5wRsVHJz0VklzmQ3WBXVg"
  },
  "BVO4tv_3F7761g9_UROorQ": {
    "date": "11/2/2014",
    "text": "Great soft ice cream. Good place for a hot dog and chili and super quick if you are in hush",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Xei3jQ4FjwEUxsBe0ovSg"
  },
  "peXeXjsfAZbslTkbYb7gaw": {
    "date": "8/8/2012",
    "text": "Went here a while ago while walking around Dilworth/South End area. I remember hearing about this place (thanks Yelp!) so stopped in to see what is was about. Friendly servers and good meal overall. Place is pretty small, so don't plan on bringing a gang-load of folks here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KUwmXka6hNDZ7wNP-_rIRQ"
  },
  "JgobqMoS3ST9RoI8TeNkqw": {
    "date": "8/26/2012",
    "text": "A truly unique place, at least by modern standards. Mr. K's is the traditional 1950s drive-in: basic (and tasty) grill menu and ice cream. What's more, they aren't a modern recreation that tries to emulate the style: this has been a family-owned Charlotte business for 60 years.  The food is pretty awesome diner/drive-in food. With that said, it IS drive-in food (since some of you expect a 4 diamond experience everywhere you go). Grilled buns, fresh veggies on your burger or sandwich, and they were fairly quick, too. Decent fries and decent onion rings, not the best but far, far from the worse I've ever had. A nice assortment of ice creams, dips, and sundaes are available, too.   It's small on the inside, but that's reflective of the times. Back then, Charlotte was a small city, not a national player, so establishments didn't have to consider a large number of people. They still have the red picnic tables out front and the booth seats inside. I'm not a big sports guy, but I was impressed by the Panther's memorabilia on the walls - it's more Charlotte history, than sports history. Blueprints to the Panther's stadium are framed and on the wall, along with a shovel from the groundbreaking and the building permit that was displayed at the construction entrance. How cool!  The only True \"cons' I would give are, honestly, out of their control. The parking lot is really small and the neighboring businesses have the potential to attract a seedy clientele (but why would the kids be out that late, anyway?)  This is another Charlotte staple that no person can claim to be a native Charlottean if they have never visited.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNsOssYIr3EzAoJAPBerqg"
  },
  "ZcwO-D6jZ-0RDb1_gGYC1g": {
    "date": "10/7/2009",
    "text": "This is the second time I've been to Mr. K's after it was highly recommended by a friend who grew up in Charlotte.  The burgers can be served as Big K style (1/4 pound) or Homestyle (1/4 pound but with house spices, including garlic and other \"backyard burger\" type spices).  I got the Big K meal which included fries and a drink.    The burger was pretty big and nicely cooked.  I actually saw the meat; it appeared freshly hand-made and it was cooked only after I ordered it.  The toppings on the burger (lettuce, onion, tomato) were surprisingly fresh.  The taste of the burger reflected the above and, not surprisingly, I noted it distinctly lacked the \"manufactured\" taste characteristic of other fast food restaurants like McDonald's et al.  The fries were just \"average\" but acceptable. The drink had \"shaved ice\" in it which I love, but if you are getting this to-go, I would recommend getting \"no ice\" since there wasn't much liquid in the regular-sized cup with ice.   I got a milkshake; I made it a vanilla-based shake with banana in it \"just like they did in the old days\" according to the nice lady behind the register who recommended that I try that flavor and topping.  It was great and I could sip on it on my way home because they provided a straw with a wide enough opening for the pieces of real banana.  If you like vanilla you would love the shake!  I'm more of a chocolate person, but this shake was really good.    Of course Big Daddy's burger (another great establishment)  is more \"gourmet\" for lack of a better word, but this is a different category of restaurant, with a much different price schedule, so any comparison would be unfair.  If I ever need a quick lunch or dinner at a great price, this is the place to which I would return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XHx7KujMlZPMfc85lrTFVw",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XHx7KujMlZPMfc85lrTFVw/o.jpg"
      },
      {
        "img_id": "aRDIninA5FQumeJpktDlPg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States. Banana shake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aRDIninA5FQumeJpktDlPg/o.jpg"
      },
      {
        "img_id": "5kv03ofID7yCaiq9-5YgQg",
        "caption": "Photo of Mr. K's Soft Ice Cream &amp; Drive In - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5kv03ofID7yCaiq9-5YgQg/o.jpg"
      }
    ],
    "user_id": "3dCytTjgvgCv3tbv1qm-hw"
  },
  "OPTQX2hxfl7ujtOW_N_p9w": {
    "date": "5/7/2016",
    "text": "Awesome food although a bit pricey for me a burger combo $10.18. Dang but a really great burger and awesome staff to go along with it",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "deDKuGUwObBfRzJMQBONDA"
  },
  "X1zDyqePLlI8hx8LTds6TA": {
    "date": "12/8/2013",
    "text": "This little Charlotte institution has been serving up burgers, onion rings, and soft serve since 1967! Still family owned and run :) Prices are fair and you always get service with a smile. The parking can be nightmare-ish during busy times but don't let it deter you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PVyZXgOkVtnU6966FDFhuw"
  },
  "9gXszmCNkE1ixpM0VUpQ4w": {
    "date": "7/12/2014",
    "text": "OMG... Forget the low carb diet for the day!  The turtle parfait (needs whipped cream!!!) is the first full size ice cream I've had in over a year and I ate the whole thing! Crowded.... Parking lot was full but well worth the wait!!!!!  A new favorite must stop when in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8JBLIweuvwALCljWJIy4sA"
  },
  "78Ki9Ae7QWK56d-sGxjmYw": {
    "date": "7/26/2011",
    "text": "Super friendly staff, amazing milk shakes, and one of the best burgers I've ever tasted in my life.   Oh and it's cheap, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "O4hS3xBc6kt_1dpKqDOsLw"
  },
  "WbxgWhHA62DvB2X3d-hxVw": {
    "date": "1/3/2014",
    "text": "This place is a classic!  It's my go-to spot for a good old burger and fries without all the chain foolishness.  This is the real deal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "r9M3FeNR7k9-Lvl13xXMUw"
  },
  "RGShRO6jAPpmMu1niTypgA": {
    "date": "6/15/2011",
    "text": "Salty burgers and onion rings right off of South Blvd.? On a sunny afternoon? Count me in. Mr. K's is that beloved burger joint that so many places try to be. Tile menus, squat booths, soft serve machine (worth a few stars for accesibilty), and a sense of history: you know there's some stories with this place, and based on some of the restaurant goers and wait staff, I'd say they have some stories, too. Though the lady at the register was a little short with me, my waitress was helpful, and the service is slick.  While the burger isn't worth an essay, I was really impressed with how good the toppings are. The tomato was thick and seemed like it should be there, even though it slid off of the bun. The burger meat itself has that classic taste I had forgotten about.   I got some onion rings on the side, and though they weren't as moist as I would have liked, I think they made good friends with the burger.  With a much more extensive menu (and a reasonably cheap $6 lunch), I think it's reasonable to expect some more future visits, especially since I have yet to try the ice cream. And due to the complaints on Yelp reviews, they now seem to take debit cards, an added plus for those strapped for cash.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "uDdY9ozJx92rGR13QxyuhA"
  }
}