{
  "MIywN2JAwCu4DLLmeh1MhA": {
    "date": "5/14/2013",
    "text": "Thai Lite (Charlotte style) - I should have paid attention to the reviews by Donna D from Hi and Paul S from Chicago, those who mistake this for five stars Thai really don't know better.   We had lunch here twice. The first time I thought the soup were really quite good. We ordered  Crispy basil duck and a lunch special which was nothing special. The duck dish was tasty but I was disappointed it was made of shredded duck meat reconstituted into a largish ball. I gladly paid the dinner price ($19) to order what I wanted, but I expected better. This domestic obsession with \"boneless\" dishes is really annoying the foodie in me.   The second time we were served what I'm pretty sure was a Japanese soups: rice chicken. Not a bad chicken soup but that's NOT what I go to a Thai restaurant for. We had the Panang curry, which was OK but not rich in flavor, not close. I'd label it as sweet and mild sauce over tasteless shreds of pork.   The other dish was Pad Ma Muang/Cashew Delight which they claim to be stir-fry in a *sweet & chili sauce*. It was NOTHING of the sort, instead it tasted of soy with strong dash of \"liquid smoke\". The thing is I've OD on freaking Teriyaki and grew to hate it many, many moons ago.  I didn't send it back only because it was lunch time and besides it's not my job to teach them difference between Japanese and Thai cuisine. Those two do not \"fuse\", they are so dissimilar as to be contradictory cuisines.   I haven't found a really good Thai restaurant around here, and I lost faith I will.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZvmC522FAwxt8qT1jxqliw"
  },
  "UAOS1EziyNqYAgkuzd5NFQ": {
    "date": "3/3/2013",
    "text": "I really want to like deejai and I've been four or five times to try to build the relationship that just isn't there. Every time I've eaten here the server doesn't write down my order and, predictably, messes it up big time. And then offers nothing more than a \"sorry.\"   These have all been simple orders like pad Thai with chicken, pad see ew with tofu, etc. One time the pad Thai came out at the highest spice level because, according to the server, when I didn't specify the heat level he just assumed I'd want it as spicy as possible. My dish originally arrived much later than my husbands and then by the time the server brought out a revised dish (the first one's spice was UNBEARABLE), my husband had already finished his dish and what was supposed to be a lovely dinner together was, well, ruined.   Another time the dish I ordered with tofu came out with chicken. I told the waiter server this and he apologized and asked if I wanted him to send it back. It was almost 10pm on a Friday and the kitchen was closed so I said I'd just deal with it.   In my opinion, when these type of thing happen, the restaurant should offer some kind of peace offering - a coupon, discount, free drink - something! Deejai did not and with prices like that, it simply isn't worth it for me to keep trying to love it. Sorry, deejai!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tDTiluHziUK1Wt4Jm9A6UQ"
  },
  "SR2ToQ18l_pQBcVT5cVftQ": {
    "date": "11/23/2015",
    "text": "I love the food! I really love the Pad Prik Chicken with rice noodles (it's freaking amazing) and there are a ton of other great things you can get at DeeJai as well. If you go eat there you won't be disappointed.   My only problem is when ordering To-go it seems like half of the time no one at DeeJai answers the phone. This has happened to me at least 5-8 times over the past 3 months. Then, when I drive there and place my order in person I have to wait for an extra 15-20 minutes to get my food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OdGoSdi8xO8zLuYII-gnrQ"
  },
  "ZNFdwTlW7aTs8PSIBfvAWw": {
    "date": "5/25/2012",
    "text": "Deejai Thai has stolen a piece of my little Thai-loving heart.... and soul. I've ventured in a few times, on a whim, and have always found something worthy of plate-cleaning.   I've ventured in only for dinner but would happily oblige a go at the lunch menu. The location tends to be a bit finicky with parking. Get here for dinner during a 7pm or 9pm movie at The Manor and you'll be hard pressed not to find parking along one of the neighboring streets. I've made the mistake of trying to fight for a parking space in the lot outside. You may find yourself up against a few soccer-mom buses. Savvy?   Either way, once you find yourself inside of Deejai's dimly lit and relaxed dining room, it's all downhill (in the best freaking way possible).  Staff is always very welcoming and quick to seat you. There is lovely seating along the side of the building and great on temperate evenings. Candle-lit dinner seekers, this is your area. Very romantic and sometimes rather quiet despite resting so close to Providence Rd.   Here's my recommendation:   Basil Rolls. Filled with basil and shrimp and accompanied with a light and perky plum dipping sauce. I'd drink the stuff if I could....that may be a little audacious, but it is really good. You get two with each order so maybe ordering a few plates for your table is in order. You won't regret it.   Pad Thai. Bet you didn't see that one coming. I've always loved it at Deejai. Sweet and balanced with sour from lime wedges. Tender rice noodles and filled with veggies and tofu. You can get tons of other proteins in your order. Duck, though pricey, is definitely worth the venture.   Curry Fried Rice. So filling. Generous portion of rice and vegetables. Wonderful yellow curry flavor and the eggs are a wonderful addition.   DESSERT. This is the coup de grace on your appetite. Ready?  Mango with Sticky Rice and Ice Cream. I died and went to dessert heaven the first time I had this. Sweet, hot, cold, chewy, creamy, melty, fruity heaven. This is the perfect balance of textures, temperatures and flavors for a dessert. I'm not typically a dessert person, but this beats the pants off anything else I would choose to end my meal. Well done, Deejai. I'm a believer.   Deejai has an expansive menu with wok options and sushi. I've yet to try these but plan to in the near future.   Price point is rather fair. My wife and I can eat here for about $30 (including dessert but not drinks).   If Thai is what you're seeking, Deejai needs to be on your list.   Cheers!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "EBxeerAdxhTINKrztnlOFQ": {
    "date": "10/18/2015",
    "text": "For a small place that fights for parking with the Manor Theater, it's well worth getting in here. The food is always good, priced fairly and the service is prompt. Plus, it's one of those restaurants where you feel it's as clean where you can see as where you can't. I've never had a less than good experience here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qm0T53k2BZ3MCqomZxfZJQ"
  },
  "vfOKWs4WOuaKKr08ZJz_6Q": {
    "date": "2/28/2015",
    "text": "Just left here some minutes ago,,, nice staff and decor.  But the food was not up to Thai standards. The drunken noodles, Basil fried rice we ordered wasn't great. I'm sure they could do better with the taste in the future. The food tasted more like Japanese cuisine.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wMG4LsqYBeWjCVNWfZHDRg"
  },
  "hhW5tkr6AVORVLxLHHsEhQ": {
    "date": "6/3/2015",
    "text": "Love love love this place! Everything about it, food, atmosphere, service is all wonderful. This is my go-to when I'm craving Thaj food and I will be in soon! Pad see ew is awesome as well as fresh rolls. Have never had a bad meal here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SsJWF2sydv8WI0zHy8IgJw"
  },
  "aa3bIPt8M5fXfunHmMlsgQ": {
    "date": "11/11/2012",
    "text": "I really enjoyed our Deejai experience.  At first I was a bit skeptical because the place was so crowded and it took forever to get a seat... we learned our lesson and will DEFINITELY book a reservation next time. Deejai is a TINY restaurant and is very crowded because the food is the bomb, so take my advice and call ahead!  Once we were seated the experience was truly top notch. They had great sake (I've never had bad sake, just to be fair), Thai beers on the menu, great spring rolls and some mouth-wateringly good entrees.   I ordered the mixed vegetable dish with chicken (I think the Thai name for it had Ruam in it, but I honestly don't remember). My fiance ordered a chicken curry dish that was spicy and absolutely delish!  We'll definitely return, but next time we will be armed with a reservation :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_siniUb8CoN9of4mhAtj_g"
  },
  "TFNFy8YbqsPx94I-0zuDBA": {
    "date": "10/21/2010",
    "text": "Had dinner here tonight.  Definitely a fan!  I ordered the drunken noodles with chicken and asked for a \"level 3 star\" spiciness.  I've always wanted to try the place since I didn't know what it was when it first appeared next to the Manor Theater.  Truthfully, my group of friends were supposed to grab a quick dinner and then a movie, but the movie ended up being sold out- we decided to have a nice dinner instead.  Wait staff was really nice and kept the water glasses full the whole time we were eating.  Especially needed that water with a level 3!  I usually don't go for spicy, thinking that the heat will ruin my experience with the food, but tonight I felt adventurous and it paid off in the end.  It was an overall nice dinner experience with good wine, conversation, and of course food!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "In2DQ8BiDx2BeUAuti_lIw": {
    "date": "6/15/2015",
    "text": "I've been to Thailand and had Thai food, and this does not do it justice unfortunately. We had the Tom Kha soup, which was way too salty and sour. Normally it's a little sweet with the coconut milk and savory with prawns and mushrooms. It just wasn't good. I had the Pad Thai with shrimp. The shrimp were way overcooked and the pad thai was not good. It was really sticky in consistency and the flavor was not right. My husband had the mussaman curry with chicken, and we realized it was basically peanut sauce. I think the service was great, and I was happy to see the Singha and Chang beer, but the food was way overpriced and just not good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0Qmo0G67GLrmUK3dNB2Uw"
  },
  "imzvLjS0EMpTrtHm3dYReQ": {
    "date": "10/16/2012",
    "text": "Great service, very good food, nice layout... I am a repeat diner who loves this local restaurant.   The staff genuinely appreciates you being there... wow... no sales/food pitches, good recommendations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-v1I7ZE9qecJmSCSUo9wCQ"
  },
  "bbZDDXAjoIRPNPk-QLzL0w": {
    "date": "5/30/2012",
    "text": "We were craving Thai, but rather than head up to the usual Thai House, we opted for the conveniently located to our location at the time, Deejai. As a bonus, they do have a lunch coupon in the Entertainment Book and 10% off mobile coupon on the Entertainment App, not much but i'll take any amount off of delicious food. There was mild confusion using the mobile coupon, but they were friendly and accepted it no problem.   i strayed from the Pad Thai, and went with Pad Prik based on the awesome description. \"Oooooh! This is so spicy and healthy that there must be some mistake because the flavor is awesome.\" It's True, it was delicious, probably could have went up one on the spice scale, but overall it was really good. Devoured the entire plate.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Jm67TDhh8t1VHPACeORuOg"
  },
  "kGQEFMrc8ygAYcVVr-jiBw": {
    "date": "2/14/2011",
    "text": "Hands down. Best Thai in Charlotte. I brought family from out of town here for a quick lunch, they were blown away with everything; food, quality, quantity, service, price, etc.   I've been here prob a dozen times so far. Panang Curry (level 3 or 4) best curry I have ever had. Spice and flavor is perfect.  I only wish they weren't closed from 3-5pm cause that always seems like when I am near there and craving Thai.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BIJvgssm_jR6NXgfSXdxkg"
  },
  "f1g2IUYBBoRve-mUmdrPwA": {
    "date": "6/29/2012",
    "text": "Overall, I was very pleased with the food, service and atmosphere here. There was some great live music (a guitar player/singer playing some old blues and jazz), and the decor was very nice. It was almost too dark though.  To start, we ordered the Hiyachi Wakame (seaweed salad), the spring rolls, and the basil rolls. The seaweed salad came out served in a large martini glass, which was a nice touch, and was quite tasty. I also loved the spring rolls. I can't say what exactly was unique about them, but both the rolls and the sauce were fantastic. The basil rolls were also pretty good - pretty much the same as you get as most Thai restaurants.  For entrees, we had some sushi - both the yellowtail and tuna - and the Spicy Lemongrass Pad Takrai. The yellowtail was great - I would go back just for this, and the pad takrai was good as well.  I will probably come back next time I am in town, even if it is just to enjoy the music and some drinks.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iJp3Wu-pYl7osiYqz1Gv7A"
  },
  "-mqmVJoLXNK29zJFrUlCIw": {
    "date": "9/10/2016",
    "text": "service is fine, but the food is not so thai authentic.  i need to try different places.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EXifazKlbxICEemphLtGOQ"
  },
  "EyYq-Xx6K6AqnDk1zut3oA": {
    "date": "7/25/2015",
    "text": "A good Thai restaurant but way too expensive for the quality of the good. There are other, better restaurants in town",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RSN20ppkoFKuX3N2dWMAyg"
  },
  "T9By4aGXFPH1FNO4ZUKNtQ": {
    "date": "9/16/2014",
    "text": "It's between Deejai and Basil for the best Thai in Charlotte.    I love this place.  It has a nice decor which is tough to find at Thai restaurants.  I really appreciated the variety that the menu offers.  For example, being able to get some of the better sushi in Charlotte while at a Thai restaurant really allows you to get a good mix of flavors in one meal.     The prices are probably a buck or two higher per dish than most Thai restaurants and it's totally worth that modest premium.  I expect I will continue to come back here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjTG24J-UT3vs2fuwTJ9vw"
  },
  "0DEgd2lMnyT9NffDt8-aNg": {
    "date": "1/22/2014",
    "text": "An incredibly disappointing meal. Pad Khing with beef had absolutely no ginger (or flavor in general) and had the taste and consistency of microwaved lean cuisine. The only flavor to the Prik Pao with chicken was the red pepper/chili oil, which, to its credit, made it slightly more palatable than the Pad Khing. The vegetables on both dishes were soggy and flavorless. Likewise, the fresh rolls tasted like they were rolled the day before, with wilted lettuce and a rubbery wrapper.  We ordered relatively simple dishes. The food we received suggests that the quality of the ingredients and the skill of the cooks are both woefully lacking.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "mr1zIOplkF8ji0JKrA1J9w"
  },
  "DRjdJV3l-DjMjmZzggZACw": {
    "date": "7/10/2013",
    "text": "Had a great dinner here! I got the shrimp and avacado salad which was fresh, flavorful and light. Others at the table got the chicken pad thai, scallops and a beef dish, and everyone seemed quite happy.   My only complaint was our entrees came out before the appetizer sushi. We were told that there was only one sushi chef working, but we shouldn't have been charged in my opinion.  Great food though, will definitely go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b8zc2fFY8uGp3vAPBrihRw"
  },
  "rKT2T7Es-dMHg2Xcr85pYg": {
    "date": "8/7/2012",
    "text": "This is the only Charlotte restaurant I crave consistently even when I'm not pregnant.   When my husband and I first moved to the area three years ago, my first task was to find the best Thai place. After trying a few different places, I stumbled across Deejai due to a movie showing at The Manor and haven't set foot in any of the other restaurants since.   I schedule every possible lunch date and dinner date at Deejai. When family comes from out of town, we go to Deejai. When we order takeout for a night in, it's Deejai.   I'm rambling.  Why do I love Deejai? First of all, the lunch options are one of the best deals around. Most of the more popular meals are under $10 and come with a sample appetizer and soup for free. Meals themselves are cooked to perfection, whether meat, vegetable, or noodle. Their spices and flavors are always spot-on.   My favorite dishes are the Pad Thai with Chicken (the staple of every Thai restaurant) and the Yellow Curry. My husband has tried several entrees and now ends up getting the Panang Curry most every time we go in. If you're looking for an appetizer, do yourself a favor and order the crab rangoon- it is never greasy or soggy like you'd find at most Asian places. The chicken satay is also incredible- but that might be my partiality to the peanut sauce that comes with it!   I might keep rambling, so I'm going to force myself to stop now. It's just that after living in several different cities I know how hard it is to find a Thai restaurant that consistently delivers over and over again and Deejai is IT.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7hbYRZQbpJOd16oGTn_nGA"
  },
  "rsXZPIMqBQYYhqzyhtbm6Q": {
    "date": "5/23/2018",
    "text": "Good thai food, standard menu but one of the better thai restaurants in the town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sAEcEpxXA5KE9Ydy5ALbXQ"
  },
  "Ik27RMyTPXby43ABhaUeVA": {
    "date": "9/1/2017",
    "text": "Y'all. The Panang Curry is wonderful, but order a 1 or 2 spicy level unless you're crazy like me and think you can handle the hotness of 3. It's on a 5 scale. It is so good and full of flavor, I just wish I had ordered it a little less fiery so I could fully enjoy it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XycJQy50-yePXFN16TRRJA"
  },
  "dvPaZabjKqxH2HOf3D7FeQ": {
    "date": "4/8/2017",
    "text": "The drunken noodles were great, as was the crispy duck. The pad Thai is way to sweet but most likely an adjustment to a more American palette and the country club atmosphere of the area. The rice was way to mushy and likely the same rice used for sushi. Yuck...a big misstep for a Thai reataraunt.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "g9vXqwigTq21GoeY-Z32dg"
  },
  "SjkAHiU5q22mnStC3u2sTA": {
    "date": "5/21/2015",
    "text": "3.5 star if I could because it just depends on what you order here.  Food:   Must get- thai ice coffee. Almost as good as vietnamese coffee. Tom Kha soup was the best I've had! I don't like the soup too sour and this place has it down! Panang curry was good but we got 4 pepper thai spicy and it was really spicy. I love spicy food but it was too spicy for me. I would get it again with a 3 pepper level. I also love the shrimp pad Thai here!! It's one of the best in charlotte. Only if you get it with shrimp though. I got the tofu pad Thai once and it was just mediocre. It's like they use different sauces. Shrimp pad Thai was more orangey in color. Tofu pad Thai was more brown, and too sweet.   Don't get- tofu pad Thai. Thai fried rice was not good. Rice were sticking together like sticky rice and somewhat chewy. I don't recommend it.   Ambiance:   Very cozy and dark. One time, the booth we were sitting at was so dark I couldn't even see food. I had to ask them to turn on the light. It helped a little.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VqGyG7TkRKNUgQMXeU5N_Q",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Sooo good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VqGyG7TkRKNUgQMXeU5N_Q/o.jpg"
      }
    ],
    "user_id": "L4rS8kw_1bOhEMnbNCNTDg"
  },
  "UQuMjQYsJykTSkSFjomoWw": {
    "date": "6/2/2017",
    "text": "My wife and I love Thai. When we moved to CLT we tried a hand full of places and Deejai is by far the best in the area. Some folk are comparing and rating this place to Thailand which is a bit unfair. Compared to other places the great CLT area this truly is as good as it gets. We've been about six times now and have yet to be disappointed. Of our favorites, we love the red curry and drunken noodle. My wife has celiac and they can make the drunken noodle is gluten free for her (the curry is also GF). We like the heat and usually request heat level 4 for just about everything that is spicy. Their sushi rolls are great and fresh. The portion sizes are more than adequate; we always have left overs. This is a great place for Thai. Go and enjoy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pvT7zLtjbQfwkZyWFsocwg"
  },
  "kWXSIL3UoFHMshpUf2VhNQ": {
    "date": "6/8/2014",
    "text": "Overall Rating: 3.75 stars...Rounded up tp 4.  Another first time place checked off my list! Came here on a Sunday eve and was the first custoner ofvthe nite. A very sweet  Thai server greeted me and let me sit anywhere I wanted.  Since it was my first time here, I asked her to go over the menu and make some recommendations, which she happily did.  First recommendation was the Beef Satay app. She said she preferred the beef because of a special marinade they use. My GOD were they ever good. Super tender and flavorful with that unctuous peanut sauce. Great beginning!  Here's where I totally go overboard! I ordered 3 entrees because I just work that way. Besides I need to get a good representation of what this place is all about.  I always get the house special fried rice so I ordered their curry rice with beef at a 3 out of 5 heat scale. It was excellent! Great flavors and to me the perfect heat.  Because Pat my waitress recommended the Pad Thai that's what I went with. Got it with sgrimp and chicken. To me this was not the best I've ever had. While it had the sweet heat going on, for some reason the shrimp imparted a slight fishy flavor to the noodles. Hummmmm, still trying to understand this dish. The pad Thai at Thai Taste to me was much better.  Finally I ordered their Massaman curry w chicken. Ok so I'm not a carrot lover. I know....weirdo for an alleged Foodie. But this dish was like half carrot! After moving them off my plate (for safety reasons) I attacked the dish. The good: very tasty. Coconut milk and curry....whats not to like? But the bad: chicken was somewhat dry and there just wasn't that much sauce.  Overall a solid Thai meal! Very friendly and attentive staff. I was hoping for stellar but got good. I guess that's ok.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QlvZWSQy6b125ip5zKKiYg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Beef Satay w peanut sauce....phenomenonal!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QlvZWSQy6b125ip5zKKiYg/o.jpg"
      },
      {
        "img_id": "Zo9h4QPONuNAeM2H1H7RuA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Massaman curry w chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Zo9h4QPONuNAeM2H1H7RuA/o.jpg"
      },
      {
        "img_id": "O8rceU1cJnHkDmhqYserKQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Curry Fried Rice w beef....Yummy!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O8rceU1cJnHkDmhqYserKQ/o.jpg"
      }
    ],
    "user_id": "QYobbHEmhLGuS6QDqVRTLw"
  },
  "q0enbRcNm7cNLAVvKYaQpw": {
    "date": "3/22/2018",
    "text": "Food ambience and everything was good,,, but there is no point if the dish u ordered is not cooked properly!!!ordered a chicken wok dish but with raw chicken !!!! Very disappointed !!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uAlDRN2F6qWLpDVZGjl1ZA"
  },
  "gC7cJni7mhUrLxWUnJ_ONw": {
    "date": "7/2/2016",
    "text": "Some good, some not so good. We finally made it to try Deejai after a recommendation from a friend that led to the purchase of the Groupon. We started with the spring rolls which were bland and not very good. Next we shared the samurai roll which was unique and my husband really enjoyed but I didn't find overly exciting especially for the price of $16.99. The star of the meal was the entree. I had the green curry with chicken, a creamy, spicy and rich dish full of flavor. I would definitely go back for that and skip the appetizers. My husband had the basil chicken which he described as \"pretty good\" and not as spicy as expected. Our waitress was new and overly apologetic for not knowing the menu and the restaurant itself is not the cleanest. I might try takeout next time and just get the green curry!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K3dbJiJdzPICfp_NpyAP3g",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Samurai roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K3dbJiJdzPICfp_NpyAP3g/o.jpg"
      }
    ],
    "user_id": "GyJf71ss616pHZrFZpL42g"
  },
  "rmET8hO9caar-mhFKMumwQ": {
    "date": "4/15/2015",
    "text": "We went to Deejai Thai last weekend in search of a flavorful dinner and they were able to provide exactly what we were looking for.  We decided to sit outside to enjoy the lovely NC spring weather in their side patio - and we were both impressed on how much they had done to make their little space relaxing and elegant. Our drinks came in trendy mason jars, and my Thai iced tea was the perfect drink to enjoy outside!  We started with the Jeeb Sai Moo / Curry Pot Sticker, which was served in a light curry sauce, but there wasn't much seasoning on the filling of the pot stickers, which was disappointing.  My main dish Pad Kra Prao/spicy Basil chicken was fantastic! The portion that came out was more than filling for dinner and lunch the next day. The menu listed this item as \"spicy level 3\" but there was more basil flavor than spice. My only complaint with the dish was the half shallot randomly in with the ground chicken and other chopped vegetables. My boyfriend ordered the green curry, which he said he is often unable to find at Thai restaurants in Charlotte. We will definitely return to sample more items off of their menu. I would also recommend this location for those unfamiliar with Thai food, since the menu has extensive explanations for each item and their descriptions are full of personality making for an interesting read. For example the Pad Prik is described as \"oooooh! this is so spicy and healthy that there must be some mistake because the flavor is awesome.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yrHMnZyY-IdpVN7kjlulMg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Dumplings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yrHMnZyY-IdpVN7kjlulMg/o.jpg"
      },
      {
        "img_id": "Hb25xDcXO3q2Q0MC1lrNhA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Basil chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Hb25xDcXO3q2Q0MC1lrNhA/o.jpg"
      }
    ],
    "user_id": "wbvjiDpw0FoZDeqbzAIcDQ"
  },
  "T1oFIqITsxxBT7gcZRj8dg": {
    "date": "10/2/2017",
    "text": "This is my favorite restaurant in Charlotte. Great curries, soup, Pad Thai, and even the sushi is  first class. Order food at a #2 spice level unless you're a professional. So glad they opened another restaurant in No Da.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7W4zzGbqwcU3M59azWVEiw"
  },
  "WQrts8a3CjokpL43TRjIsQ": {
    "date": "4/17/2017",
    "text": "Compared to the food in Thailand, this would only earn one star. That's a tough comparison, so I'll also put it up against the Thai food from my hometown (Baton Rouge) where Deejay would still fall in the mediocre bracket. It's probably the worst of the four Charlotte Thai restaurants I have had so far.  I'm still searching for something that holds a candle to my two favorites back home where the Thai ladies serve truly authentic food.    I'll give Deejay one nice comment...the quality of the ingredients was good.  We started with the Basil Rolls which, aside from the Thai Basil leaves and plum sauce, was super boring. I know the point is for these to be refreshing, but I found that they contained too much of what seemed to be iceberg lettuce.  My husband tried the Panang Curry for his meal. First red flag should have been the questionable tone we heard when we were specifying hotness. Really? It's Thai curry - you HAVE to decide how much pain you want. We requested medium hot, which had no hotness whatsoever. Maybe Thai hot here in Charlotte would render a dish with some heat.  We loaded the dish up with Thai chili paste when eating the meal at home.  I normally go for green curry when trying a new place, or maybe some Tom Yum to start, but I was feeling really chill the day I ordered and went with Pad See U.  I've had this other places and the real star is usually high quality rice noodles which is balanced with a dark soy based sauce.  It's for the non-adventurous type, kind of like fried rice, but it was just what I was craving that evening. The dish I got was like my failed attempts to replicate the dish at home....maybe worse. The noodles were tiny fragments. They likely came dried in a Thai Kitchen package. The sauce was a yawn.   This is just another one of Charlotte's over priced Thai places, so I'd suggest moving along to the next option on your list of places to try. We won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hvBKJ3DDyShxlKZxdl9gag"
  },
  "nup_dJLod8byogBk1TU3dw": {
    "date": "5/16/2017",
    "text": "We were in the mood for Asian, so thought we'd try something outside our usual. We ordered the three amigos sushi which was good so we were expecting good things for the main courses. I had to send back my cashew chicken. I am not sure if it is the sauce or something was left on the wok but it tasted funny. I got the pad Thai which was extremely sweet and I wasn't a fan of it. Not at all what I was expecting. My girlfriend ordered the mountain beef. It was just okay, but also a little on the sweet side. We won't be coming back to try again.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "e1p2_W06RPhzxAHJT3OqZA"
  },
  "8V6iso1m-uIPNJ7Gl2DYeg": {
    "date": "3/30/2018",
    "text": "Fantastic Thai food and reasonable prices. Did takeout as it's a little out of our orbit, but can't wait to try again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vq7xZtfZnJOgnYXDwgjZcw"
  },
  "3IkREOVBD7fw2lKt_6TcIg": {
    "date": "6/23/2017",
    "text": "Local favorite. Really never go wrong here. Love the seafood coconut soup in hot pot to share.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7GIcGERUfVvOx_TNYomGcA"
  },
  "bVbBs80P8K39yBwsTwtzsA": {
    "date": "10/25/2016",
    "text": "I went here for my birthday during lunch and had pad Thai. I really like the Windows and I love the mango sticky rice with icecream. Overall the food was 8/10. I wanted papaya salad but they told me they didn't have it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "saEOb_kvl0baQosLWaUX8w",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/saEOb_kvl0baQosLWaUX8w/o.jpg"
      }
    ],
    "user_id": "0NGNAwzi-NCQlz9WTfS_vw"
  },
  "MpdXQ5pcRsnztI3gu5xjvw": {
    "date": "2/2/2017",
    "text": "Best Thai lunch in Charlotte. The food is great, the staff is attentive and the atmosphere is so much better than the Thai Taste on East. You're not squeezed right up next to neighboring tables and the lunch specials include a cup of soup and crunchy wontons with chili sauce. Delish!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "v4qYCluN4apCE3BxKBIa7A"
  },
  "OTtQ9zftBJAsXia6ffXfrQ": {
    "date": "12/20/2015",
    "text": "I have to be completely honest here. I've been to this restaurant several (ok more than several) times and I've only ever ordered one thing... With that being said, I can really only rate this place off of my addiction and love for their Yellow Curry Shrimp. Strange I know, but I would bathe in this dish if I could. There is something about it that I just can't seem to want to try something new and I like trying new.   What else can I tell you about this place? The service is good and I highly recommend the Yellow Curry Shrimp. Oh! And the Thaitini because Thai iced tea is ridiculously good and mixing it with vodka is like making it my birthday present.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "b-46h9GeYHXEjCq1DWIP4Q"
  },
  "QAY79H3pkQl2tyZXhF-cQQ": {
    "date": "2/27/2014",
    "text": "I tried the sushi this time, which are pretty good. From the taste to the whole plate set up. The servers are very nice, but I think they need a couple more server on the floor.  I would like to go back to tried the Thai section...",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EOOv0aTn11EGUu6VoXa6Ng",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. And she got her flower",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EOOv0aTn11EGUu6VoXa6Ng/o.jpg"
      },
      {
        "img_id": "jrGP8rmxS8rbatubm2_Prg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. She liked it lol",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jrGP8rmxS8rbatubm2_Prg/o.jpg"
      },
      {
        "img_id": "Bzv04j1Vx9KUy2jRbX26rg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Crunchy roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Bzv04j1Vx9KUy2jRbX26rg/o.jpg"
      }
    ],
    "user_id": "sUh8f9Ez1h6tSINztKG0lA"
  },
  "31CI7v0Oe9e1RWASDvlNyA": {
    "date": "6/23/2016",
    "text": "Came here for a I'm-too-lazy-too-cook-tonight meal with my girlfriend and I'm really glad I did.  Rolled up around 6:30 and was able to come right in and order, but by the time we left around 7 the place was packed. It is definitely known around town as a great spot.   As for the food, the flavor was off the charts and the portions are a good size (aka. you won't leave hungry).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KR0F61xjOdb6FqAxuwlNBA"
  },
  "e_6D_qVP8_EADwP5DIjsiw": {
    "date": "2/13/2016",
    "text": "I love the food here. It is consistently delicious. The flavors are full and complex. The rating for my review is solely based on service. I have been here twice in the last few weeks and both times waited at least 10-15 minutes for my order to be taken. Once was a larger party and tonight was my family of three. Neither time has the restaurant been at capacity.  Once our order was taken service improved primarily from the manager checking on our table, not the server. This is not unusual but more the standard I've experienced here. If I didn't love their food, I would not come back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lKGcE8lWfVGcKwN95nUIBQ"
  },
  "-Cz5I1gxflyTJUC1ja-hvA": {
    "date": "6/27/2013",
    "text": "I'm torn.  The food was really good, the service was lousy.  Had lunch there with a friend, and the place was full of business types (like us) on their lunch hour.  While all around us were served, we waited, and waited and waited.  We were never asked if we wanted to order anything to drink, although a server plied us with water.  After 30 minutes, and after all the tables around us, who came in after we did, had gotten their food, we had to flag down a server and ask where our food was.  His response, \"They're working on it.\"  No apology, nothing.  And once the food came, no \"How is your food, can we get you anything else?\"  Nothing.  Plus, we had ordered lunch specials, which I would assume are prepped and ready to go, precisely because so much of the mid-week lunch crowd is pressed for time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8SLdn76FoGpOX5CbxFw4zg"
  },
  "NB9N49l7I6CZbDG5Lbd5cA": {
    "date": "12/23/2010",
    "text": "I love coming here with my lady. It's inexpensive, has generous portions and is amazingly delicious. The staff is ultra friendly and accommodating. Of the Thai places I have tried in Charlotte, this place is far and away the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xd9x0neKgYW_ja5XtXWbg"
  },
  "3jCla2Rqn8Xl4l_PN5NY6w": {
    "date": "7/15/2012",
    "text": "So, I purchased a Living Social for Deejai and was excited to stop in for the first time.  While the food was pretty good, I think this might be the worst service I've experienced in Charlotte.  It was Saturday and pretty busy, but that's no excuse.  We were seated and sat around for a while before anyone talked to us for at least 10-15 minutes.  It's not good when the server shows up and the whole table orders drinks, apps, and their entrees all at once.  Food took forever, but it all came out hot and delicious.  I'm not a Thai connoisseur, but I thought it all was good.  I can usually give the service a pass when there is good food, but it was just so glaringly bad that I won't be back.  I had to ask a different server for the check.  She mentioned to us, 'Oh your server must be cleaning in the back.'  What? Really??  I knew they were closing the kitchen down, but c'mon man!!  It wasn't split right so I had to get up and help her split it at the register.  That took forever and it felt awkward standing at the register trying to get the check split correctly while our original server finally popped her head out from where ever she was 'cleaning'.  I'm surprised I even left a tip I was so annoyed.  This experience might be an exception, but I definitely won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W9_D98atQWeuQCO_pV2apQ"
  },
  "tQKDZoxKVkUW1-r8m7e_Eg": {
    "date": "4/3/2010",
    "text": "I have been here twice now, the first was for dinner with friends and the second time was for lunch by myself. Service both times was great! It runs as more of a Brigade type system with multiple servers arriving at the table at different times during the meal. All were quick, quiet, and efficient. During lunch, a nice steaming bowl of crab soup and two crispy fried crab wontons arrived immediately after i sat,  as an \"Amuse\" and both were prepared wonderfully. It was a nice Welcome. Lunch was Great, the Basil Rolls were 2 large lettuce, shrimp and basil stuffed rice paper rolls, served on a plate with a plum sauce and small spoon for drizzling. There was also a nice layer of crushed peanuts on top of the plum sauce. The Pad Thai came out shortly after I was finished with the appetizers, but not too fast and was HUGE! I asked for it Hot (as thier options are Mild, Hot, and Thai Hot) and hot it was! It was a flavorful spicy which really made me yearn for the next bite. Temperature was perfect, I even had to let it cool for a minute before diving in. Lunch cost $12 and I had 3 very large courses! I was shocked! Dinner was great as well, My two guests both had beers, as they have a wonderful selection of Thai Beers. We shared the Basil Rolls and Curry Pot Stickers and an entree each. One of my guests ordered the Pad thai Mild because she doesnt do spicy very well, and had a fantastic meal! In the end, $57 was the total and again, we were thrilled! I have a feeling I could eat there everyday. Oh, I forgot to mention the ambiance was great, not \"Overly Thai\", but classy, sophisticated and Sirius Coffehouse on the Sound system. I would reccommend to ANYONE!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OxotAxEJpj627-RJev70-g"
  },
  "5iGC3gjL89C_-qf6pqLWEQ": {
    "date": "3/12/2011",
    "text": "Yummy! Love the Mountain Beef, Pad See U, and Tom Yum Soup with shrimp. In-dining experience is GREAT and makes for a nice casual dinner date but take out during the week is my favorite. Easy parking, punctual service, coupons, and hot ready to eat delicious food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mhbKjTqtVVUG5rbP5T7LDg"
  },
  "WrKZcpb9qsAKzmDwOXV3RQ": {
    "date": "10/28/2009",
    "text": "Were heading to Zio in Elizabeth and passed Deejai. Zio was closing early, so we go lucky that Deejai looked so inviting from the outside.   The staff at Deejai welcomed us in. Definitely had that family feel and attentive service. I guess if you or your family own the restaurant, you don't close early and turn away paying customers.   In keeping with theme of trying different; had the Pad Kra Prao/Spicy Basil. The ground chicken intrigued me and was a nice touch that balances the crispy green beans and peepers nicely",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "STdq6TzDVyHFtBLeDsaX9g"
  },
  "VB-j0711xxp9Gzn3s3aSrA": {
    "date": "3/26/2013",
    "text": "A great place for Thai in the middle of town. It has a great atmosphere. I highly recommend the drunken noodles and all the curry dishes are great. The papaya salad can be hit and miss sometimes but everything else on the menu is pretty consistent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tyn65EfcNkvLwsGaX4sSpQ"
  },
  "ZX49QEj0zGW6GHorbcfBjA": {
    "date": "12/31/2009",
    "text": "We tried this new Thai restaurant for carryout on a Sunday evening since our fav - Thai Orchid - was closed.  We ordered a smorgasbord of appetizers.  Very good food and an exceptional value.    Larb, Namsod, Tom kha seafood hot pot, Chicken satay, and Basil rolls.  All were really good and well-prepared.  The place has a hip interior and the prices are the best I've seen.  I'll be back next time I make it to CLT!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u1C6Qf5DN5qoqlPFAaSr3g"
  },
  "lQFb8LIO_edxr1YaEjnRbQ": {
    "date": "2/26/2012",
    "text": "A decent asian fusion restaurant that I would probably go back to.  I ordered the Pad Ma Muang with medium hotness.  It had a nice combination of flavors but the serving temperature was more warm than hot.  My date ordered a sushi plate that was excellent in both taste and presentation.  The service was decent even though it appeared to be a very busy evening.  Overall I was impressed enough to try it again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UnvHZqIpeRwWQq9D9QAaNQ"
  },
  "naZwjdhFJ4S60VnYexr41g": {
    "date": "3/6/2011",
    "text": "Unimpressed. We ordered takeout from here on valentine's day. Portion size left much to be desired. The chicken in both our pad see ew and panang curry was very dry and chewy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f5nwpbiVSWO7JBPQqzwrlA"
  },
  "RVQzCzbp9xscGKoaMvs9OQ": {
    "date": "2/14/2010",
    "text": "we went tonight and it was great. we were seated right away. the ambiance is modern but not too stuffy. the prices are not overwhelming and food was some of the best i have had since i have been here in CLT. Our whole meal for two with two apps and desert was $45 not bad.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UsL1xPAd82NEFQszM1hCyg"
  },
  "sRgsUeXeX_exqP_Ao_Ch2A": {
    "date": "5/2/2010",
    "text": "The best Thai in Charlotte - have ordered take-out every week for the last month Panang Curry and Pad Prik are fantastic.  Prices are fair and the take-out service is friendly and quick",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aF_5_II0kPGaq4Sq9LXNhA"
  },
  "gMUkaBWtLimM67sijDz7JQ": {
    "date": "6/21/2011",
    "text": "i have been here a handful of times and always enjoyed it but forgot to review it. ive pretty much just stuck with standard thai fare @ deejai thai and it never disappoints, solid pad thai, VERY SOLID green curry, i like hot food and 3 star isnt hot but their thai hot can remove the skin from your mouth and have you ordering glasses of milk so be careful.  i had one of their flounder specials one night and it was devine, spring rolls and great, green papaya salad is spot on (very traditional thai salad and amazing if done right).  the people that work their are friendly and nice, they do a great job with take-out BUT BUT BUT they have crammed too many tables onto their dining room floor so if you have more than 4 people there, i think, is only one table that can accomadate your group and elbow room is @ a premium when they are packed.  other than the tight floor i really like deejai thai.  its a great place to go when on a date or with another couple or foursome.  reasonably priced, nice atmosphere, and great locale.  this is probably the 3rd best thai place in charlotte, the first two are dynamite so dont let that 3rd ranking fool you and thai food is my second favorite cusine so im eating it all the time.  deejai is good, go try it",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ArVGblHkSUrdrZT90LgSFw"
  },
  "Ac7wSyBngT1xrtHTTX22eQ": {
    "date": "11/16/2010",
    "text": "got take out here twice when they first opened.  again, small portions and not at all spicy so i havent been back.  also pricey.  if i ask for thai spicy i at least expect to see some bird chilies in my food.  i have a thai cookbook so i guess i should just start making my own although its never the same.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uxEMWBh6GneKEKCxnLnNcA"
  },
  "LWKe3MRNsgH26By9U1J5sQ": {
    "date": "4/21/2018",
    "text": "This place is amazing.  We have been here several times with different people.  The crab ragoon is fantastic. The lettuce wraps are very good.   Every dish we had was very flavorful. Huge portions.  Service is excellent.  We have had several chicken dishes, seafood, and beef.  Can't wait to go back and try other menu items.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OYT85xcaEzWR572LvQI7IQ"
  },
  "ygsuNTVZOc-Fn-0VQS5B8A": {
    "date": "8/24/2017",
    "text": "Food at Deejai is really good. Tried the spring rolls and pot sticker appetizers. For dinner I had the Nuer Poo Kao/ Mountain Beef. Portions are big. So expect to take a leftover box with you.  They don't take reservations for a small group of less than 6. I'm going to return to try the Pad Thai, or one of the curry dishes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t9wA4FKkE0f9N8DBieR5EA"
  },
  "9H9DRFpId_E44cr0i70Y4Q": {
    "date": "5/20/2017",
    "text": "The service was good but I wasn't a huge fan of the pad thai.  The chicken had a very distinct taste as if it was a seperate dish, instead of it being part of the dish. I also had thai tea and that was very sweet.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kEXrz3qVvee9L1ojeYOwmA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Pad Thai with chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kEXrz3qVvee9L1ojeYOwmA/o.jpg"
      },
      {
        "img_id": "mtHBzVP_s2oQRMdeILUk2w",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Thai tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mtHBzVP_s2oQRMdeILUk2w/o.jpg"
      },
      {
        "img_id": "yT6k4rrfko7ux_gzkv-XGQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Thai coffee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yT6k4rrfko7ux_gzkv-XGQ/o.jpg"
      }
    ],
    "user_id": "IEpLv-OdPcFwJC5CGnVE9g"
  },
  "uZCefTnnQA_zUi_N4f-IfQ": {
    "date": "9/29/2018",
    "text": "Terrific meal at Deejai.  My Panang Curry was delicious and my husband's lemon grass chicken also very good.  We had spring rolls before our meal which were crisp and hot with a sweet/spicy hot sauce that was marvelous.  Meal was timed well too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ObDUX7BZ_h0AaWwlx4yCWQ"
  },
  "jMiUKYDocD_MDv9RN8EuYQ": {
    "date": "3/5/2018",
    "text": "The food was great as well as the decor. We happened to go on a night that they seemed very understaffed so our hope for a quick dinner turned into a 2 hour event.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ePJWHIUdMN5xFaH7nQ2TpA"
  },
  "HAl_Ri5dFqBJW1cDY4AIdg": {
    "date": "2/16/2018",
    "text": "AMAZING! Three of us had lunch we all left happy with wonderful tastes in our mouth. If we lived in Charlotte we would be regulars here. It is definitely one of those meals we will think back on in a couple months and wish we didn't live so far away.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GJxX0j9DLVbNhE-oo_P1tQ"
  },
  "ykRGfgq7zBGE_-4C5U_I7Q": {
    "date": "3/23/2018",
    "text": "Really tasty Thai food! I ordered delivery with Postmates, the chicken veggie stir fry and chicken fried rice. Both dishes were really good! Stir fry had a lot of flavor.  Light on the chicken on the fried rice but so delish!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "19yq7CXRE5NFuf5Ddjmp0g"
  },
  "e5aLW0oH6RG9WF43qIbrwA": {
    "date": "1/26/2018",
    "text": "I have gone here several times and love everything. The curry potstickers are by far my favorite app! I've tried a range of their food, from noodles, sushi, curry and other appetizers and I haven't had anything I didn't like. My go to is usually the yellow curry. It's so good! It's definitely a go to spot for me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ON0jdQyZH9H3laAvP4eXfw"
  },
  "VyRZTXdWQdIXo3xqaVH0Ig": {
    "date": "2/9/2018",
    "text": "We were seated promptly tonight, staff was very efficient, food was very good, i had pad prik and springrolls, wife had thai jerky and basil fried rice.... she was hoping for more veggies in rice... otherwise, all was good.... best ive had?, no.... top 3?, yes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X5i5YBiPK4gK47LHOQD1eQ"
  },
  "NbZ7vwbVXSBIGXY_fRzfog": {
    "date": "5/20/2017",
    "text": "I've had avacado salad and spring rolls in this place. Spring rolls were okay not particularly tasty. Avacado salad was not good, parts of the avacadoes were dark and shrimp was about to go bad. Servers were nice but I won't be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YP-S90PdljH3lgB7vZlIlg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Avacado salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YP-S90PdljH3lgB7vZlIlg/o.jpg"
      }
    ],
    "user_id": "ioToIUNvNHzFnBLMXpqyww"
  },
  "5F4BWi4GBYrNjOtO68Cqkw": {
    "date": "12/27/2017",
    "text": "Mediocre, was. Or that impressed with the tick noodles and flavor. In my own opinion, basil was way better...even if it was more expensive",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YCS0Jj6BFzXpFVCElHn9Ew"
  },
  "YYufWs7NS5GXqZfd8EX3bQ": {
    "date": "8/25/2016",
    "text": "My favorite thai place in CLT. Super friendly staff, nice quiet environment where you can enjoy conversation. I love all the buddha art around the restaurant. You can't go wrong with the panang red curry or basil curry.   I took a large group and everyone enjoyed their food. No complaints for a tough crowd!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 10,
      "cool": 6
    },
    "photos": [],
    "user_id": "aDApcTFMWehnSXgbg49TPQ"
  },
  "mmRigP9r4I3Dm5NSqlQ6aw": {
    "date": "1/27/2018",
    "text": "Ordered take out tonight with high expectations. The place was super crowded and I heard from a few friends they think this is the #1 Thai restaurant in Charlotte. Another friend had the red curry and it was great, but my pad Thai was one of the worst I've had: extremely dry with basically no sauce.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QeJwFy399JW8iFrc0DE4qA"
  },
  "OcNDMUDbJoJE_nmsF2yveA": {
    "date": "1/13/2017",
    "text": "Great service,great curry dishes and friendly atmosphere. The portions are generous. I love their pad Thai.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3eGYUk1lm3ChCJohJQHwA"
  },
  "595eT-aXaUB5qn1ZGgQpNw": {
    "date": "12/19/2017",
    "text": "Love Thai food here! But just don't order sushi, at least not for lunch. My samurai roll was oozing with cream cheese, like I was eating a bagel instead of sushi. I couldn't finish it. They very graciously took it back and I asked for simple spicy tuna roll in its stead. And regretted it; not fresh at all. Same with Eel. My friend on the other hand cleaned his plate of green curry. Lesson learnt.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I-_2PyrFgWTXhXQPrxc5mQ"
  },
  "uQ0foo-ec5KjWqrlIyuArg": {
    "date": "6/26/2013",
    "text": "My Man said: \"I think we found a new spot for us.\" He loved it. I had the Pad Thai with chicken... Wait... let me start from the beginning. I had a $40 groupon and was taking my Man out for the Dave Chapelle show later in the evening. For the appetizer we had the Larb. It was really good and pretty filling; so you can imagine when the entrees rolled around; we were getting to the \"stuffed\" stage.   Larb: The mint and the freshness of the raw cabbage really brought out the flavor of the turkey and other spices.   Pad Thai: It was a little sweet for my taste. Now this is the first time I'm having this dish (and I love me some curry) but decided to try this staple and it was aight. I think I'll stick with the curries.   Now my man had the winning dish out of the two: Pad See U. It's funny when you eat with someone and they order what you should have had. I wish we could have switched dishes at that point. It was really filling and had that salt element that was missing from my dish. Of course he wasn't willing to give this up; but he left it at my house when he came in... so let's just say it was immediately gobbled up the next day. HAHA!  Dessert reminded me of Chilis Chocolate Molten Cake; and it topped the meal off.... I have a sweet tooth.   All in all... it was a delicious meal.   Service was definitely on point. I would say we had at least 5 different people either checking on us, bringing our food and refilling our waters. Interesting....  Oh! AND one of the waitresses was nice enough to move us (without me even saying anything) when we were originally sitting next to a large family with a baby. I like babies; but we were mad close to them... I didn't want a side of baby with my food and I wanted a more intimate setting... The booth definitely served this purpose.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mNuFuzk85_lj44UzhHmVSw",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Chocolate lava cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mNuFuzk85_lj44UzhHmVSw/o.jpg"
      }
    ],
    "user_id": "yy7shAsNWRbGg-8Y67Dzag"
  },
  "5aiVJpsYsBlwTufcJF-qXQ": {
    "date": "12/21/2017",
    "text": "This is now my favorite Thai restaurant. I Maid reservation with Jai for 40people on Sunday evening. She and her stuff performed excellent service. Jai took in her hands to prepare menu for us. I didn't have to worry what all 40 people gonna have that would satisfy them. Jai went above n beyond. We all enjoyed great good n great place. Words r not enough to describe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U0JSGYv_L-ioHArCCXcgfg"
  },
  "D8tU_zLBQw2zLfFylokuQQ": {
    "date": "10/18/2017",
    "text": "By far my favorite Thai place in Charlotte and believe me I've been to A LOT. The Pad Thai is my go to and the flavor here is perfect. Make sure you stop in for lunch for the complimentary soup and fried wontons and chili sauce. You'll catch me here on Wednesday's when the soup of the day is the Tom Kha. I've been coming for over 4 years and they remain consistent. They remember my order and by they I mean ALL the servers. I don't even have to speak. Try it. You'll fall in love!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YMGmyPOU65SMs4H60ltYiw"
  },
  "XBG5nmevU-VMcMyzXe7fXA": {
    "date": "12/23/2016",
    "text": "I'm from SEA and let me say this.... this place ROCKS!  If you like authentic food, eat here. If you don't care for good Thai, don't ... because this place only serves great Thai and has amazing service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rmLQgGRsQ1zZBaWkgR3TeA"
  },
  "Wuxd0pK2o02mB3lUirfMYQ": {
    "date": "12/2/2014",
    "text": "I had this place bookmarked for a while and finally today we came to try it! It's totally worth the drive because the food is amazing! I would say it is the best thai food in Charlotte!   I had a thai tea, it comes in a mason mug,it has a slightly herb like ltaste but it's still good, not overly sweet like other places.  They also have sushi here, my bf ordered a shrimp tempura roll, it's pretty good.  We ordered panang curry,green curry and pad thai for our entrees.  While waiting we were served a bowl of heartwarming chicken rice soup and some fried wontons. The lunch portion is huge!  The pad thai is excellent ! Right amount of sweetness and taste just the way I like it !  Both the curries taste wonderful, the green curry is a little bit spicier than the panang,I would say our curries are about mild-medium spicy and I'm pretty sure you can ask them to adjust the spicy level.  The service is ok, our servers didn't really talk much, though he did remembered everything we ordered and special instructions like I don't want bean sprouts, and he's there when we need something.   We really enjoyed our meal here! Thank you Deejai thai and thank you Yelpers for recommending this place, I haven't had really authentic and good thai food in a while.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "eDuEs0ItedQ-SmJCbWn7Lg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Pad thai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eDuEs0ItedQ-SmJCbWn7Lg/o.jpg"
      },
      {
        "img_id": "xKZ_mIvAs2m8fZUV_v5tuA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Panang curry",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xKZ_mIvAs2m8fZUV_v5tuA/o.jpg"
      },
      {
        "img_id": "XLuwDgh2V8zxl2uHguRZEg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Green curry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XLuwDgh2V8zxl2uHguRZEg/o.jpg"
      }
    ],
    "user_id": "8i04GQgUY3g8q2iw7mewIQ"
  },
  "csV36QQi31GsRQH8yRCLtQ": {
    "date": "6/23/2011",
    "text": "Exceptional Entree - Spicy Thai Basil with Asian Eggplant, Beef added!!!   Tonight for Dinner first there were the appetizers:  Pot Stickers (fried not steamed Dumplings in a sweet Curry), Beef Satay with Peanut Sauce (Deejai has my favorite Peanut Sauce).  Jai  (the Owner) recommended Satay with Beef (last Year not tonight) and I have been getting the Beef almost every time.  I like the Chicken Satay very much and you can get a Combo Satay (may not be on the menu).  The entree was Exceptional and Inspired a new list for any Entree this AWESOME ... ready here it is \"Chimpballistic\" Sensationally Exceptional Entrees - Here is the rundown on this one - It is Rich in Flavor Complexity though its makeup is simple (no clowney extras): Garlic, minced Hot Peppers (level Two spicy was perfectly HOT), Thai Basil, Soy Sauce, Oil (just enough to cook it in - Not noticeable in the dish at all!!!), Asian Eggplant (the long Beautiful purple kind) and I ruined it for the Vegetarians when I added Beef (not listed this way on the Menu).  Dessert:  Mango and Sweet Sticky Rice  with Ice Cream, topped with Sesame Seeds!  Excellent!!! A  Tracy Chapman song was playing (not \"Fast Car\") and it sounded like some new R.E.M (maybe) also.  They usually have some music I like here!  Tonight was my 29th dine at Deejai and 8th time this year!  Their service team serves the whole restaurant and inspired my \"Smooth Operations\" List!  They are that incredible!  Modern - Modern - Modern!  The Decor - The menu - Deejai adds a modern twist to many dishes, so if you want more traditional Thai - ask someone what to order (not me I have my mouth full)!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "lhMcLXdnznbDJO8PrLsoQQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Beef with Thai Basil",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lhMcLXdnznbDJO8PrLsoQQ/o.jpg"
      },
      {
        "img_id": "AI7V-w72ipA1LVKhqBrmag",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Egg Drop Soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AI7V-w72ipA1LVKhqBrmag/o.jpg"
      },
      {
        "img_id": "HqJMlNwyyQCrx2yM2NcdJA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Jasmine Rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HqJMlNwyyQCrx2yM2NcdJA/o.jpg"
      }
    ],
    "user_id": "Ug0ujy9-jd0Oc2nk3KIotA"
  },
  "n5hder2zovvXWPIAZ3gSFw": {
    "date": "6/30/2013",
    "text": "This was a wonderful surprise. My parental units were tired and asked if I would bring home some grub. I wasn't in the mood for the usual pick up and take home - so decided Thai and something on the way to get my girls their dog food as well. So Yelp pointed me this direction.. They are def on my de-lish list.   I was immediately greeted once entered. I sat at the bar, ordered a chardonnay while I looked over the menu.   I ordered the Basil Fresh Rolls, Tom Kha soup with Tofu, Pad Thai Beef and the green curry with tofu as well, this was plenty of food for 3. I even had left over's for the next day  Man, it was damn good! It is a bit pricey, but worth it! I will be going back for sure!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "oWxy_YR6n2w8e9L00hxhPw"
  },
  "m6j__LDwl__NGGrJXwjv6g": {
    "date": "8/5/2013",
    "text": "Ordered take out from here recently. When I got there I was handed a bag that was tied at the top. I paid and went home. When I got home I found there was no rice to go with my panang curry. Without rice, panang curry to me is really expensive soup.  So I called back and after a little back and forth they had someone drive some rice to my house.  They did the right thing and the food was delicious. So nice to have a restaurant that cares about their customers in the neighborhood and that happens to make really really good thai food.  I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "f8yvzivBMBPbavj-ijtnXg"
  },
  "gGucQCyOilCHfRO9EFtQjw": {
    "date": "2/17/2016",
    "text": "The best Thai food in Charlotte, hands down!  The Staff is absolutely wonderful and spicy basil is even better ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Q5XHMBVccAuo3lDCy4hyg"
  },
  "X6gR0Yhvg_38uRyPJlhXIQ": {
    "date": "2/3/2016",
    "text": "Service was at best slow, calimari undercooked, Tom Yum was good.There are better Thai restaurants in Charlotte",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DOUzp4AXOv7UVxlbQzMnAg"
  },
  "DRK9CIMTh4eBQwt2qk2eww": {
    "date": "3/26/2011",
    "text": "Oh my Thai!  My first experience with Thai food was wonderful!  From the chicken satay appetizer to the green and red curry chicken to the mango sticky rice...I was a fan from the first bite of all of it!  Deejai Thai is simply but attractively decorated and the atmosphere is cozy yet family friendly too, we saw a wide variety of patrons in our visit.  I loved the tabletop fresh roses and super cute black and white lanterns!  We started with a chicken satay appetizer with a wonderful peanut sauce and a relish like mix of cucumbers and carrots that I really liked!  Chicken was perfectly grilled and the combination of the dips was great!!!  My date ordered us the red (medium hot) and green (medium) curry chicken so I could sample both and I enjoyed them both very much...deciding that the red was indeed my favorite of the two.  The jasmine rice was different and flavorful, and a nice balance to the heat of the curry chicken.  My nose did get a little runny at first, but oh my goodness it was worth it and the heat was not overpowering, but just right!!  The peppers, eggplant, green beans and of course chicken in the red curry sauce were just delicious!  The green curry was yummy as well and I really liked the flavor of the veggies in that sauce.  We finished the meal with mango sticky rice, which was delightful and suprising...the combination of warm sticky rice with toasted sesame seeds topped with ice cream and served with mango...wow...I loved it!  Service was very friendly and our glasses never got even close to empty!  I would most certainly eat here again!  My first visit to Deejai was wonderful!!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "_bUuvS_C0p42oyO7Lm8Irw",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Loved the tables!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_bUuvS_C0p42oyO7Lm8Irw/o.jpg"
      },
      {
        "img_id": "KGg6RvskAkBS637rCWgWeA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Red churry chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KGg6RvskAkBS637rCWgWeA/o.jpg"
      },
      {
        "img_id": "UVlU91P_6MwavWVW9FFXFQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Green curry chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UVlU91P_6MwavWVW9FFXFQ/o.jpg"
      }
    ],
    "user_id": "Ox0Nic-2-6pb7V4jyi9iFA"
  },
  "fYwm0vwnpAFAo3YFJLl5Fw": {
    "date": "7/18/2013",
    "text": "Gotta love Thai food.   Went to Deejai a few months back with the wife. It was our first time and we enjoyed it. Back in VA, my parents are big fans of Thai food so needless to say we kind of overdid it. But once the Thai craving presented itself we had to give Deejai a shot.   The atmosphere is nice and I recall it being pretty crowded on that random weeknight that we went. The service was very warm and attentive too. There wasn't a wait, but it was very lively on that particular weeknight, but the service was still great.  Now onto the food. one word: delicious. I had the Tom Yum soup, we split some spring rolls, and my entree was the Pad Takrai, a delicious, spicy beef dish. I love spicy and it was terrific.   You have to give Deejai a shot if you're a fan of Thai food. They have sushi too, but I didn't try it so I can't comment. But it's really good food and great prices and attentive service.   A+",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RsmcsC_A1shrZPt3l0DzGQ"
  },
  "R66zDAxN4Sbbru8fGdhabw": {
    "date": "2/26/2011",
    "text": "I had heard so many good things about Deejai and have been wanting to try it.  When a friend from high school was in town and suggested Thai, this was my opportunity.    When we got there around 8:30pm on a Saturday, the place was full but we were seated in the basement which has quite a different atmosphere than upstairs.  Upstairs seemed noisy and busy whereas downstairs was more intimate with mood lighting and \"Chill\" music playing.  We were both quite impressed with the atmosphere.   The food was amazing.  I had an Asian lemongrass entree which was spicy like I like it.  Normally, Thai restaurants can be hit or miss  with spice levels but at this one, I ordered a 4 star dish and it did not disappoint.  In fact, the spice was not apparent at first bite but it lingered which is exactly how I like it.    The only thing I could fault Deejai on is the number of choices on the menu.  It was very difficult to make a decision.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "gChhgZf0OpTHUOPOT4dg_A": {
    "date": "10/25/2013",
    "text": "The Tom kha gai soup was good.  Really liked the pad thai with tofu. Big portion. The peanut sauce was good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bf_A0HJBAe3s_v7CVqij4A"
  },
  "3QmhPW6pSsAcskklri1-OQ": {
    "date": "2/19/2013",
    "text": "For quite some time now, Deejai was one of those places that I \"almost\" got to on several occasions.  As a long time fan of Thai, I was excited to finally dine there with my dinner group.    I loved the atmosphere, but I guess now that I'm of \"a certain age,\" a little more lighting could help me read the menu, even though I begrudgingly now carry reading glasses in my purse.  Alas, no meekrob available so I opted for Crab Rangoon, another favorite starter. I settled on Beef fried rice with yellow curry for my entree. Both entree and starter were delicious.  My entree contained healthy portions of beef and chunky tender vegetable slices, exactly as described in the menu.  Our group had a great time, and next visit I will definitely be trying another dish on what I consider to be a very large and varied menu.  Hope meekrob is available next time!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "n0vd4u0jNR5_A92j5xSyqA"
  },
  "I8Si8dykbxElDjs4EeCQZw": {
    "date": "8/9/2014",
    "text": "Deejai is a cute place, nice ambiance, great for a romantic date. I got the roasted duck with curry sauce which was pretty good and my waitress was very attentive.   My only criticism are the very dim light, it was very dark and almost impossible to see the other person's face until they put some candles on the table.   Regardless, i enjoyed it and will come back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fpS84y0mYBGDDIO3BeegHw"
  },
  "c_gthQpCrFQOXZN5iq_8iA": {
    "date": "11/25/2015",
    "text": "This place has gone way downhill in service and quality of food. We sat at the bar for 15 minutes waiting for a reservation.  We were never asked if we wanted to drink or they could help us.   Our reservation was at 7:30, and we didn't sit down at a table until 10 of 8. Service was extremely slow. Ordered a glass of wine, a beer, and an appetizer.  The wine came out almost right away. Got the appetizer, and was still waiting on the beer until I mentioned something to him. Before we even got our drinks or appetizer he was rushing us to place our order for dinner.  Once we got our dinner, he never checked back until we were almost done. As I was finishing my dinner he started clearing the plates and both of our glasses. He asked us if we wanted anything else, & I said I guess not. I was expecting to see a dessert menu but he was too busy trying to finish up his side work.  You screwed up the bill then tried to blame it on us. He didn't care as he was trying to get out of there for the night. That'll be the last time I eat at this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XHn1VRAW_vThZ_nPg7pDkg"
  },
  "w9BxryhiLpSErDYQc7x_wg": {
    "date": "3/13/2016",
    "text": "I had the Pad See You, contains beef, chicken and broccoli , very good taste, they don't have much wine selection but I found one not too sweet in their menu. Service was not super great but I'm sure they can improve it, not bad at all. Had the fresh rolls as well - yummy. I like everything about this place. They would get 5 starts f their prices were different, maybe? Maybe that's just me. Overall I do recommend this place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jdqBm5QFJ98s022LwG37Jg"
  },
  "e9uvrqIeqNLi8kEVYk0E6Q": {
    "date": "8/12/2015",
    "text": "If I didn't have a Groupon I'd only give it 2 stars. Small hole in the wall in a strip mall. Hair in one dish which ruined dinner for one person. Food was tasty but not for those prices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLdbZ1DwLjeRXCatsrN_1g"
  },
  "zvydKt_Tm3ihJHGppeHbPw": {
    "date": "8/17/2015",
    "text": "The drunken noodles with Chicken were amazing.  Even better the next day when eaten as leftovers.  Great, fast service. And the sweet Sake in the pink bottle (not sure of the name) was the bomb.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SzLONGTgUVYOrBBUxfd93w"
  },
  "p4-EJc7rlGkxljL0FRAv9g": {
    "date": "11/16/2016",
    "text": "not authentic thai food, just average, parking is not easy due to lack of spaces",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AWNwZ42MoSRJ8D73m_sLxQ"
  },
  "BsCI6uP_LzGZD1Yu-35w0w": {
    "date": "2/18/2013",
    "text": "The Pad Thai was a 6.5/10.    GOOD: Perfect consistency..its not dry, no food coloring, you can taste the tamarind sweetness, and they used the right size of noodles.   BAD: Lacking the chillies!  A real Thai chef/cook can make your PhadThai mild, medium or spicy--kinda like a salsa...not just a sweet noodle. Also it needs a little of cilantro & more bean sprout. Oh, and they  put shredded  carrots and purple cabbage on the side.  Tom Kha Ga  6.0/10 Too watery, needs a bit more coconut milk, and sourness. not a single stalk of lemon grass nor galangal  It has been my experience here in the South, the short time I've been here, ..that Asian ( Especially w/ Thai, Japanese..Vietnamese) food are served with much modification. I understand the need to please non-Asian cultures, however, we are not showing the real Thai dishes, omitting the chillies in Thai Food is simply not an authentic Thai Food anymore. But then again, some people can not tell the difference because they have never had the authentic ones.    Ambience was pretty though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5OACIiRjRzZUR1TWSXNAng"
  },
  "TlqJ4Km6UgaJzr9gwfnZog": {
    "date": "2/17/2017",
    "text": "Odd hours but great food. Didn't realize that gratuity is included in the check until a bit later than I would have liked.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DKTtYxpMlyForpRPmwiOxw"
  },
  "06KYYrAeNgpOAB-ibMBbaQ": {
    "date": "10/22/2012",
    "text": "Deejai, I want to love you. I do. Sometimes you take me in your arms and give me what I crave. Other times, it's like you aren't even there, like you don't care any more. I deserve better than this, but I keep coming back to you.   It's embarrassing when someone I care about comes into town and it's my responsibility to take them to a favorite local place and really show off what Charlotte has to offer. And I bring them to, say, Deejai Thai. We order. We get two bland dishes. We send them back and reorder, and get 1 amazing dish and another bland dish. I can't keep going like this, Deejai. I need someone who's there for me all the time.   I want to give this place a 3, earned wholeheartedly by their curries, spring rolls and their drunken noodle. They are hands down the best in the area. But without the support of a good Pad Thai and many other dishes, I can't reasonably give this more than a 2.   Stray not beyond the confines of those few dishes, for you will wander into a world where taste, spice and flavor have been forsaken. And you will be sad, and embarrassed if you've talked the place up to an out-of-towner.   Celebrity most likely to enjoy eating here:  Charlie Sheen: I imagine he'd be too drunk to care about the blandness of the dishes.   Half hour to live and I have to get my last meal here:  The drunken noodle never disappoints.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "zfpZc8e5WR2fEyKSyVRI8g"
  },
  "xF33GQ_hnZ3A5uStTTrHDw": {
    "date": "6/7/2013",
    "text": "I went to Deejai Thai for dinner yesterday and really enjoyed it. I decided to go with the Lemongrass chicken and it was spicy but mouthwatering. I opted for noodles rather than rice and it wasn't a problem. The dinner portion was a great size for $12.99, and it would be enough for leftovers (though I'll admit I ate the entire thing). I also tried a bite of the Pad Prik which was slightly less spicy but very flavorful as well. I loved all of the veggies in both dishes- they were plentiful but light at the same time.   We started with spring rolls and basil rolls- both were tasty- but I don't think I am as big of a fan of basil rolls as some of the other folks here though as I could have gone without them.   The atmosphere is nice & clean, and the service was good as well.   I will definitely be back to try some of their other dishes. Great prices and delicious food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "07urou7mHIJ-xpP390Nxrw": {
    "date": "6/24/2016",
    "text": "Used a Groupon with a bunch of friends. In a major lapse of judgment, I forgot to make a reservation for 9 people on a Saturday night. Fortunately, the staff was very accommodating and pulled together 3 tables within about 15 or 20 minutes.  My fiance ordered the Mango Salad and I ordered the Spicy Crab Avocado Salad. We also shared a Scallop Lovers specialty sushi roll. For dessert we ordered the Mango Sticky Rice.  The best dish by far was the mango salad. We ordered a 5 spiciness (out of 5) and it was legit spicy. It was delicious and our mouths were dancing long after we finished. It's rare that we find sufficiently spicy food when we eat out but this place wasn't messing around. Others at the table couldn't handle the spiciness, but that's their loss!  The spicy crab avocado salad was very good as well, but it was way too small for the $10 price. The seaweed salad was dressed to perfection.  The scallop lovers sushi roll was a bit of a disappointment. It tasted good, but the scallop inside the roll was dominated by the taste of the fried scallop on top and all of the sauce. It wasn't worth the $16.  Finally, the mango sticky rice was only average. The rice was yummy and the ice cream was an interesting touch. However, the mango wasn't particularly fresh and there wasn't enough of it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BC7kyV4D3G4GdiINztltBQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Mango Sticky Rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BC7kyV4D3G4GdiINztltBQ/o.jpg"
      },
      {
        "img_id": "dJ78ZRWFM-rOszNwO6JSyA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Scallop Lovers Roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dJ78ZRWFM-rOszNwO6JSyA/o.jpg"
      },
      {
        "img_id": "VhCaz7PRsATkJBmSpIgPgg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Spicy Crab Avocado Salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VhCaz7PRsATkJBmSpIgPgg/o.jpg"
      }
    ],
    "user_id": "SjvZj-PpWRQr7TLKS7T1Rw"
  },
  "cK-BK4PaS_ZIqRpEklduug": {
    "date": "3/9/2017",
    "text": "So I was in the mood for some Thai food but did not feel like taking my usual hike over to Thai Taste, so I opted instead for Deejai. I was in the mood for some Thai fried rice and after looking through the yelp pictures came across a pictured of \"curry fried rice\". In the picture it look delicious and so I made my selection.  I placed my order to be told that they did not serve curry fried rice. Knowing that sometimes reviews mislabel their food selections, I said \"ok well I'll just take the Thai fried rice with tofu\".  25 minutes later I went in to pick up the food.   Parking was kind of a pain, but I was able to score a place in the back lot after patiently waiting it out for a few mins. The place was booming, crowd was a mix of young and old, and inside was traditional yet modern.  I picked up my order and went back to my car. Something told me to check my food before I sped off, and once I did I was confused. The appeared to not have been fried at all, there were no carrots, scallions, cucumber, etc. and tasted as it appeared, flavorless.  I immediately went back and showed the front seat rep and asked \"Is this what your fried rice supposed to look like?\" Confused she mentioned that it doesn't look that way and called somebody to assist me.  The next person came and I showed him the same thing. His first response  was that that is hie their regular fried rice is. I asked where are the additional ingredients and that is traditional to Thai rice and he mentioned that if I would of ordered basil fried rice I would have gotten more. There is not any mention of basil fried rice on the menu, nor was what I received worth the nearly $15 I paid. I kindly asked for a refund which he graciously, without any arguments provided.  So just a word of caution for anyone ordering Thai fried rice, make sure you clarify what exactly you are getting, otherwise you will be faced with disappointment  and confusion like I was.y",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yuR_Bma8pQoyHO-hsLHUzQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Thai Fried rice w/ flash + tofu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yuR_Bma8pQoyHO-hsLHUzQ/o.jpg"
      },
      {
        "img_id": "OY0hT9jvNI9syfBZ1KgJRQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Thai Fried rice w/o flash",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OY0hT9jvNI9syfBZ1KgJRQ/o.jpg"
      }
    ],
    "user_id": "lV21MwucXDdG35AicQWldw"
  },
  "_Ba-DsXONpzVhCYQeuQyMg": {
    "date": "6/2/2018",
    "text": "The quality of food is below average for a Thai. I'm sad to fin that the service lacks too. I didn't have tableware, at no point did I see my server until I asked for the check, and I had to go to the bar to get more water. This was a terrible experience.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6aOVBadSpOISo2BKF9EPuA"
  },
  "-B7VsurNkjPUdHjwBIFz8A": {
    "date": "6/17/2018",
    "text": "We gave this place one more try and had the exact same issues as our last visit- mediocre food (some highlights, but not enough) and not so great service.  Ended up waiting to get a even though it wasn't crowded - the wait was more about lack of attention to arriving customers. Service was very slow and My noodle dish was just ok, hubby's basil chicken was definitely the highlight. My shrimp were way over cooked, not near enough veggies on the dish and the sauce was overly sweet and one note. Appetizers were decent, got the dumplings and a roll. Overall not worth coming back - 2x and your out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hIHqsskaLCBSgUzBePus8w"
  },
  "k7Hl1xzfwCAWyKRL1jP-IA": {
    "date": "7/25/2018",
    "text": "The food was delicious. I got the calamari appetizer which was delicious and enough to feed a family. I also got the chicken pad Thai which was very delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z24fmOQoQ0RTjtieeudiqg"
  },
  "woItclcYSqApFK05CMwiJg": {
    "date": "8/25/2018",
    "text": "We've been to Deejai Thai a handful of times and each time better than the last! The food is great, atmosphere is beautiful and the service is second to none! Whether it's a date night or your in-laws coming to town, I'd highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gMB0_OdKhCFfSjM_occ76g"
  },
  "SeyxTopNdK06ycg8O2e_Zg": {
    "date": "12/7/2016",
    "text": "Visited Deejai for the first time with friends on a couples date night. Was able to find a cool Groupon so why not try it out right lol.  Food was cooked well and it was very delicious. They have the typical array of curries and the calamari was pretty good. I judge a place by their calamari .   My friends being it was our first time asked our waitress what would see recommend and she seemed to give us a weird stare that lasted a few seconds. Maybe it was her way of thinking but the way it came across was almost rude or bothered. She eventually told us what is popular based on other customers but said she didn't eat the food here which almost sent up red flags but she could have been vegetarian. Anyway moving on.  Our food and drinks were well prepared so for food & drinks I would give Deejai 4 stars but for customer service it's more of a 2.5 or 3 stars. We didn't feel like our waitress was very friendly and don't recall her smiling once. Another thing that bothered us was, the restaurant was closing in 30 mins and she basically told us we couldn't order any more drinks and we felt like we were being pushed out.  My review is strictly based on food & drinks but feel the service could have been much better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "09KPCp9W_NalQga28aPd2Q"
  },
  "0q-LIb4s-7E-EGO_Vc06Dw": {
    "date": "7/26/2018",
    "text": "Mediocre food and service. Plastic bag piece found in girlfriend's dish, which they treated like it was a normal occurrence. Would not recommend.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R7AeNQhTDJLQtYY5uUNiLg"
  },
  "Z17FVGuKTlc3Fbqa51rLfg": {
    "date": "9/30/2015",
    "text": "This is my second time here and I can officially say, I'm a fan. Both times I have used a groupon, which makes it a great value. While it is small, the vibe is cool. We went on a random Tuesday night and they had a lot of people dining there.   I had the chicken pad thai. I like it spicy and I liked that they adjusted the heat to individual requests. My boyfriend had the drunken noodles with beef and loved it. We both shared spring rolls as an appetizer and they were delicious and very fresh.   My one complaint involves the Tuesday and Wednesday \"half off wine\" that is advertised. Only certain wines are included in this. We chose a Riesling, which the menu listed as $25 (so half off would've been $12.50). This was the only Riesling we saw on the menu, so we went with it when our waitress mentioned that the Riesling was included. Our total for the bottle was $15. So either they increased the prices on half off night or they sell you bottles that aren't even listed on the menu. Not the end of the world, but deceitful nonetheless.   We liked this place, although I can only see us going here with the groupon since it can be overpriced. Overall, it was good and we will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1YQp3v12LMLWuM5fXwlmdA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Half eaten chicken pad thai",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1YQp3v12LMLWuM5fXwlmdA/o.jpg"
      },
      {
        "img_id": "_K4z9q-oCAc-A7BS-m1wdA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Half eaten beef drunken noodles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_K4z9q-oCAc-A7BS-m1wdA/o.jpg"
      }
    ],
    "user_id": "QGKOTCbS-gpAMWPADGmf0w"
  },
  "mvcXNNQKOrCjkU7_vimWCA": {
    "date": "12/29/2018",
    "text": "I ordered the Pad See U and Curry Pot stickers. Pot stickers were decent but the Pad See U was so dry and flavorless and the vegetables tasted dirty. Gross. Smh. I should have just went to basil Thai (my fav Thai restaurant) but I wanted to try something new. I regret it. If you order the Pad See U make sure you ask them for extra sauce so it isn't dry. It's still tastes gross though.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s4VN0vjTP92YakNNeGEhJg"
  },
  "xiuUGY3v_dyAJhGl9dNQlQ": {
    "date": "11/29/2017",
    "text": "We've been to Deejai Thai and ordered out on a few occasions now. The service is always with a smile which is so important to us. The pad thai and drunken noodles are delicious! Although the sushi isn't too memorable, it was still crisp and tasty. We will continue to frequent the restaurant!  Cons- parking is difficult but we've never had a problem finding a table. Nice atmosphere for friends, family, or dates.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lRdg9vgkRbX2RH2vULmelw"
  },
  "8dCilnoDQmaTF_0zUXnQFw": {
    "date": "10/23/2017",
    "text": "Ordered the spring rolls to start off with. The dipping sauce was just okay, but the rolls were pretty tasty. I got the chicken pad Thai and it was great. The portion size was huge, especially with having the appetizer before so I ended up taking half of it home. The outside patio was nice since the weather is changing and there are plenty of seats out there. The pad Thai ended up being great as leftovers, as well, which doesn't normally happen. Would like to try more off their menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zJMYjYMaj7wERK-uH2gfPw"
  },
  "4mk-3wqeH3OlG5laD9UqbA": {
    "date": "8/3/2018",
    "text": "Did not put all ingredients in sushi as what was listed on the menu. Had to return my food for them to add ingredients to sushi. They said the sushi chef doesn't always use all of the ingredients. If you're going to have a sushi menu, you need to honor what you said was going to be in the roll. Isn't that what sushi is all about?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "4BkhAnDY3yYbPhGl2fAL8A"
  },
  "MH7aH2XM-ArAbB0obV5WvQ": {
    "date": "12/28/2017",
    "text": "We went there today based on a recommendation and it was great.   Sat at the bar watching a bowl game and had Pad Thai along with the lettuce wraps   Thai and Chinese beer too.  It is a 30 minute drive from Waxhaw and was worth it!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KnxqatEsSIXYlkjg-vHYRw"
  },
  "rI8XNGG0y4RB1sER4yPfRg": {
    "date": "10/1/2016",
    "text": "I give this place 3.5 stars. We were seated right away and decided to ordered drunken noodles with shrimp and panang curry with chicken to share. We opted with their recommended spice level, a three. Wasn't spicy at all! Next time going with a 4 or 5.  They use a different type of noodles for drunken noodles, I'm used to the recipe calling for flat rice noodles. I believe they used udon. The dish had great flavors but too many bell peppers. Best part was the shrimp. Really big and was cooked right. The panang curry was okay, could've used more spices. Service staff were friendly.   Reason why im giving this place 3 stars is the taste of the food, lack of heat, and was on the pricier end. I can definitely find hole in the wall Thai places with really tasty dishes in la or NYC for cheaper.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UBgCakfSD9KIDxp3K4S2fQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Drunken noodles with shrimp",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UBgCakfSD9KIDxp3K4S2fQ/o.jpg"
      },
      {
        "img_id": "OvG0dtOKMxQDqxdcANGkWg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Panang curry with chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OvG0dtOKMxQDqxdcANGkWg/o.jpg"
      }
    ],
    "user_id": "1fyzWwIyoGcjWEIeXwxjsA"
  },
  "jVzksu41MSNAsND4S9BvuA": {
    "date": "10/8/2017",
    "text": "Ok guys lets talk about the Red curry here. WOW! I mean this little spot is amazing me and my wife came here the other day for lunch and i had the chicken pad thai and she had the red curry and i should've ordered hers. Great food, service, atmosphere etc..Great place to have a good meal and a drink! Thanks guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7laUpzZ1127tAipFa6iXLw"
  },
  "7GeKf0e0aTu-mzttjxpleA": {
    "date": "5/8/2018",
    "text": "Great food! Thai fried rice was amazing. Will definitely eat here again when back in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TB7ThRACZzSKISfEh9oj2w"
  },
  "Kv-QDycnPzX6hszUf_Mp6Q": {
    "date": "7/20/2017",
    "text": "Nice little Thai place on Providence Rd. in Charlotte. They have a sushi menu too but I went with lunch special, Pad Woonsen w/Tofu. Served with a small clear soup and crispy wontons.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qA7KHEuHFGWKdRN0nYx13Q",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Pad Woonsen",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qA7KHEuHFGWKdRN0nYx13Q/o.jpg"
      },
      {
        "img_id": "B4nb02ZLzRzTPooa1XbPrQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B4nb02ZLzRzTPooa1XbPrQ/o.jpg"
      }
    ],
    "user_id": "YecQ_S3DAIA3Ah196UG-bw"
  },
  "hl3hhDhcytDgqiEQ_olwRw": {
    "date": "5/9/2015",
    "text": "Service here...  Is top notch!   Wait staff is friendly, helpful and service and facilities and presentation is quite nice too.  Drinks!   Good bar, we tried and now LOVE a fantastic Chinese beer, Tsing Tao Beer. It has a crisp finish and is very refreshing.  IMO, the ice tea should be skipped in lieu of something bottled.  My companion liked his Pinot Grigio.    Food: I was torn with the rating, because I simply didn't enjoy the food.  I ordered the Deejai Gai Krob which is very similar to Sesame Chicken. The waiter warned that it was sweet, but it tasted exactly like chicken stewed in ketchup, SALT, sugar, and barbeque sauce.  The three spears of broccoli, carrots and baby corn were served iced cold and completely flavorless with rubbery grains of white long rice.  My companion ordered the Green Curry which was really, really spicy and prepared with a strong coconut flavor.  He really enjoyed it.    I have two issues with the way the restaurant is run, here they are:         There is very little customizations allowed.  With the exception of how spicy you would like certain dishes, they won't allow you to have noodles rather than rice as the starch in your entree, or any other customizations.  If you want fried rice, you must order a dish from the menu with precisely that. Don't even think your request to swap different vegetable out will be entertained.          Second, there are only three dessert selections.  I ordered the Chocolate Lava Cake, which was the best part of the meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EPUqlVy13zuzD44oHhsjzg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Chocolate Lava Cake...  @Deejai\r   Beautiful and the best thing on the menu.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EPUqlVy13zuzD44oHhsjzg/o.jpg"
      },
      {
        "img_id": "HAthwqyX7hHcchnHObsI2w",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Deejai Gai Krob, in the background is the Green Curry.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HAthwqyX7hHcchnHObsI2w/o.jpg"
      },
      {
        "img_id": "DD9hc3PNM6QcwVKWoSc5Fw",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. We tried and loved this Chinese beer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DD9hc3PNM6QcwVKWoSc5Fw/o.jpg"
      }
    ],
    "user_id": "_-gnSzjvS0lAwuvpUdJoyA"
  },
  "fs6OzMAM29HPjWz1PW4pLw": {
    "date": "10/24/2017",
    "text": "My new favorite spot in Noda! Found it about a month ago and have been back every week. Highly recommended the boat noodles...bone marrow broth, pork rinds, meat balls, yes please!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r8cQKezvh8PIf0Q1rrXNVA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r8cQKezvh8PIf0Q1rrXNVA/o.jpg"
      }
    ],
    "user_id": "8Sa6qlER9nHolEiC01mSAQ"
  },
  "tcJSSHFDW8hWRxh7h0Sbvg": {
    "date": "8/22/2012",
    "text": "My favorite restaurant in Charlotte. Consistently delicious and the service is always super sweet and helpful. I always get the Pad Prik Duck or Shu She Salmon. Their sushi is also very delicious, I love the Red Dragon Roll. Atmosphere is casual yet romantic, and the live music on Thursdays is very good. LOVE it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LXJ1F3fCZqlLHeJfAhhxRQ"
  },
  "e4XmeUPnra7wcujxf20-kQ": {
    "date": "7/14/2010",
    "text": "Stopped by here last night for a little take out. My wife and I love Thai food (I recently came around to it). Walked in the door and was pleasantly greeted by the hostess who immediately took my order and gave me some great advice on the menu and what's popular, especially as it relates to the spice level. After ordering she offered me some water while I waited. The vibe in the restaurant was energetic and busy. My food arrived well under the 15 minutes that was expected.   Once home, dove right in to the basil rolls and they are great with a tasty sauce on the side. Ordered the chicken pad thai (spice level = hot) and the pad prik with shrimp (spice level = medium). Taste was good...enjoyed the pad thai more as the pad prik was hotter than I liked and the pad thai was not as spicy. Overall...solid thai restaurant if you're in the area of Providence Road.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c8cur4lMkQsHoUEqm-qwxg"
  },
  "jHzTAsLqGa5F58HRYg6srA": {
    "date": "8/6/2014",
    "text": "One of the best pad thai in town! Their sushi selection and other entrees are also just as delicious. A little pricey and very busy and crowded in the evening, but it definitely is one of my more favorite Thai restaurants in the Queen City!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A2l6pDAwA5SkfuOd7E_npw"
  },
  "TWq1KHD0cvMeXkenzcSjIg": {
    "date": "10/31/2012",
    "text": "Love this place. I eat here with friends a lot. Tom Yum Soup is fantastic with butterfly shirimp. Pad Thai is good too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZswLOFmc0wtrCtBYAOwmDQ"
  },
  "1LbzWOAPcok5OGRGg-PC_w": {
    "date": "8/4/2012",
    "text": "We got to the restaurant around 8 pm and hostess took us to our table. No one came to the table to take our order or give us water for 20 minutes. We actually had to go back and ask the hostess to get us a server. Once we order our food it took another 45 minutes to get out food. We ordered pad see u and some flounder dish that was listed as their specialty. Food was below average. Once we were done eating, we had to wait 10 more minutes to get our check and after we got the check we waited another 10 minutes to see if they will come pick up our card and process the payment. We finally gave up and went to the front of the restaurant and gave it the hostess. Terrible experience. I will not be returning to this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jTj-puIiEH7pQ_Zgf8DyRQ"
  },
  "pcrX3lT90YWtacFYct5zog": {
    "date": "4/17/2012",
    "text": "Awesome menu. Hubby and I had dinner with another couple recently and we all really liked their food a lot. We like that they ask the level of spice before they serve the food. I loved the green curry because it was packed with vegetables and lots of sauce. Hubby got their pad thai and he loved it. We will definitely be going back for more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AIOgdR48J3zgLruPRbtLFw"
  },
  "NcFcs23iN6n39tqfdUX63Q": {
    "date": "4/9/2012",
    "text": "Had the lemongrass chicken and it was amazing. Good service, good atmosphere, good price. I've been to many a Thai restaurants (including the actual country) so my standards for Thai food are quite high, & Deejai's did not disappoint. $11 for a nice portion of lemongrass chicken & rice. I got it Thai hot as well, which can be risky cause it will either come out covered in chilies or not hot at all, but it was the perfect amount of spice. Can't wait to go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IU3bIiX6mqk3ElmRZQfnWg"
  },
  "fSGhTIMN-UwUslcRQwp8iA": {
    "date": "11/7/2014",
    "text": "The food was excellent and our waitress was great as well. The problem came at 10:15pm when we were not even halfway through our bottle of wine and they turned the lights up. For the next 30 minutes while we felt forced to chug our wine, we continued to get stares and one waiter even jiggled his keys for the entire time until we got up with half full glasses of wine left and he swooped in and cleared our table before we even left the restaurant. Experience was great until 10:15pm when we felt unwelcome which ruined our opinion of the restaurant. It's too bad!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NkPNiF_9j6f0EpQ8QrHzEg"
  },
  "UEqr6aKwt5wQRumW9wLHfQ": {
    "date": "8/2/2014",
    "text": "This place was our regular spot when it first opened. The food was consistently great. We had the larb, ginger herb chicken and the sea bass tonight. The food was good. The larb was great but I expected more from a $32 sea bass! This visit was a letdown.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGNghQmR8SyGYAc6eOUJQw"
  },
  "geIh8aXoOgNCcyE_roxSgA": {
    "date": "9/2/2011",
    "text": "I'm a really picky eater, and in my quest to become less of a pain when going out to eat with my friends, I'm sampling as many different foods as I can from cuisines I've previously ignored.  One of these is thai food.  I don't like pad thai and I don't like peanut sauce, but most of my friends are super into it, so I decided I want to be into it, too.  A quick poll on twitter told me I should try Deejai, and I'm really glad I did.  First, to break the ice, I got crab rangoons, which aren't on most thai menus.  These were some of the best I've had...unbelievably light and crispy and creamy, little parcels of crabby goodness.  Next my companion ordered us two bowls of tom yum soup.  I navigated around the chunks of tomato and mushrooms and chopped scallions to the spicy, red-dotted broth.  Delicious!  There's one thing I know I can order now.   For my entree I got the panang curry, asking to sub out the bell peppers for zucchini (I told you I was a picky eater!) I was wringing my hands with worry that I wouldn't like it, but as soon as I spooned it onto the sticky jasmine rice I was sold.  Success!  I like two things!  That's more than enough!    My companion (not a yelper) ordered the yellow shrimp curry, 5 stars thai hot.  Supposedly with chilis but I didn't see any, and he said it was \"white people hot\".  I tried a bite and even I didn't find it to be all that hot.  This may have been due to the fact that we were the last customers of the night, because I've heard that they don't skimp on the heat.    A word about that: Even though the restaurant was empty and we were the last customers and stayed a little past closing time, the service was really friendly and fast, and our water glasses never went empty.    All in all, I'm glad I got to cross thai food off my list of culinary adventures, although this is by no means our last dance together.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "dfYRsyixtlseDnFWpmCGYQ"
  },
  "LHYXDUjgJOimf6HgIVLYmg": {
    "date": "3/27/2012",
    "text": "Food is good but the service could be better. I feel like the layout of the restaurant makes me feel elbow to elbow to strangers next to me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e_Z6CAHitJQYa5GfC4rmFA"
  },
  "zkIbjS3MiGcQpiroT2LMWw": {
    "date": "8/13/2014",
    "text": "Went here on a Saturday night and we got seated immediately in a booth. Fantastic as some places require long wait times for drop ins. Great menu as it had something for everyone's preferences. In fact, the dishes could be swapped out fairly easily for meat or tofu. I got the tofu curry and the tofu was VERY well cooked. Perfect taste and texture. The dish was 3 out 5 spice level, but that wasn't too spicy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z3Z4Gb8Z8Ecm9fNQMg3wAg"
  },
  "VD1BV76H32SA_fosrFqE4w": {
    "date": "8/9/2014",
    "text": "We love Deejai!!!  We go there a couple of times a month.  One of my favorite dishes is Vegetable Lovers and add Chicken and ask for Pad Prik sauce with it.   It has great vegetables like broccoli, snow peas, baby corn, zucchini, and cabbage.  Their food ranges from a 1 which is not spicy and all the way to a 5 which is extremely spicy.  We always order our food at a 3 which can be very spicy.  Loved their brown rice with our meals.  My children love the Panther Roll (sushi).  Also love the Pad Prik dish and Pad Thai.  It has great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wy_cMB1UE6xND7R1kBdy7A"
  },
  "hUohgUQc12arqeA5Trn7hg": {
    "date": "4/12/2013",
    "text": "Used to think Thai Taste was as good as it gets in Charlotte, then it was Basil's. For the price point, Deejai Thai is the best in Charlotte. Basil's is great but not your average night out pricewise. Amazing Thai food, ambiance is not pretty good. Wine list could use some help but they let you BYOB and charge a small corkage fee.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lIbiaNdjywC-sxA-rBileg"
  },
  "get6tnrvTv7SpmfktN-amw": {
    "date": "10/13/2010",
    "text": "Love this place. Friendly service, GREAT food, and really nice atmosphere. If you live in Elizabeth, walk over for dinner and then catch a movie at the Manner theatre. Also, try the Thai iced coffee. It's delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wYPwbbIS9q9puGf51Zslyw"
  },
  "Wnj5HetJ9saKsqu_dMuLWA": {
    "date": "5/2/2011",
    "text": "We have had multiple visits to Deejai and they are always on point. They did change their menu a bit and I liked the older menu better. The green curry - Thai spicy is amazing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8vfbA76TY8lR_7femAPtVw"
  },
  "4D4JjhyrJOVhSvcZ8Ruh5w": {
    "date": "6/26/2011",
    "text": "I'll be honest, I've been to DeeJai several times now as a different Thai Place than the usual Thai Taste on East Blvd - and though I enjoy the food, I was never overly moved to actually post a review. But last night, we booked the private room downstairs for a special dinner celebration for 25 people - and everything was great!  There was no charge for the dining room, the service was excellent, and the food came out fast (note, that we were recommended to sit down to eat after 8pm when that the main dining room slowed down). We were able to arrive early to set up and decorate, start the party early with drinks and mingling before the 8pm dinner. They were very accommodating and checked in on us often during the cocktail hour.   As for the food - I stuck with my usual Lard Nar, which is always delicious, but my friend ordered the Mango Salad - and I found a new favorite! Several of the guests ordered from the sushi menu, which is a great option for mixed tastes (seeing as how we had such a large group).   The server not once made a mistake, and we even split the checks - all without a hitch.   Great food, service, ambience. And yes, I was moved enough last night that I ultimately made this post :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bexgC3sZQaEJMTfmFSutRg"
  },
  "tKyl0QVgNJYupBDIiu1PhQ": {
    "date": "11/19/2012",
    "text": "Really fresh and amazing.  Lunch service is great with the free appetizer.  Great ambiance and a really cute little patio area.  LOVE!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fr9v4lBUzyAPx4eJfUkYyg"
  },
  "PNDoIpro6ISURD-6J03FyQ": {
    "date": "9/20/2010",
    "text": "Best Thai in Charlotte!  Better yet!  Best Gluten Free Thai in Charlotte.  Be sure to talk to your server to help, as they do not have a GF menu.  Their Red Curry is off the charts.  If you can, order it with the Pad Thai noodles and shrimp.  They now serve sushi and you gotta see it!  I haven't weened myself from the curries yet, but when it comes out, the sushi looks like a Picasso painting on a dish!    The atmosphere is dimly-lit, chic and casual to business casual dress.  My only negative about DeeJai is it is pretty quiet and the tables are close.  So, if you talk loud and have nosey neighbors, you might begin to think there's an extra set of ears in your conversation (one of my pet peeves).  Full bar and the bartender (Mel) is serving up drinks, with personality, to ease the spice on your pallet.  Hands down, best Thai in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fh39DlcdY815hl7zi59xVw"
  },
  "O_IljVe-p_evHU_hh-eUKA": {
    "date": "9/13/2010",
    "text": "The only reason I'm giving this place 2 stars instead of 1 or 0 stars mainly due to how good the food is.  Unfortunately the service was TERRIBLE.  First we arrived and they didn't have our reservation.  We had a party of 10.  Then after being seated we waited for over 15 minutes and we still had not yet seen a waiter to take a drink order.  My husband had to get up to get someone to come take our drink order. Drinks then did not come out quickly or even all at the same time.  Some of us in our party were waiting for 15 minutes after the initial drinks were brought out. Now let's get to the dinner.  My husband and I ordered the Pad Thai and their Sea Bass in red curry sauce to share for dinner.  The Sea Bass could be prepared two ways, either steamed or pan fried.  We ordered Pan Fried.  When it was served it was steamed.  We informed the waitress she suggested we try it and see if we like it otherwise she would take it back and get us the Pan Fried Sea Bass.  We both took a small bite and decide we did want the pan fried.  It was sent back and within 5 minutes our Sea Bass was delivered back to us.  The brought the SAME one that they took into the kitchen and just threw on the pan.  We know this because the same two corners we took a bite out of were still gone. We complained to the manager and all he did was grab the dish and take it back.  No appology nothing.  By the time our new Sea Bass was delivered the rest of our party had finished their dinners and we were no longer hungry. We got no apology, no explaination, nothing. Waitstaff is very slow, and management is lacking.  The only HUGE saving grace of this place is the food is VERY GOOD.  If they could get better management and train the wait staff better this would be a great resteraunt. (Keep the chef!) I\"m doing take out next time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KUi5iBeXN6Xk0eKUukKJkw"
  },
  "k2ffjUcfTKHK7BzZut5Jpg": {
    "date": "1/22/2014",
    "text": "This is my favorite restaurant in Charlotte!  They never disappoint and there is something for everyone on the menu.  Pad Prik is my favorite entree.  They can adjust the spiciness of any dish to your liking. I definitely recommend this place, especially for a date!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lxo21BGi-e3Ho8fz_DtViA"
  },
  "nOvGRe_g8a8SJO8i1TIUdA": {
    "date": "11/7/2015",
    "text": "My favorite  restaurant  in Charlotte. Try the mango salad, any curry  or pad thai dish, and also they have fantastic sushi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6TFZfnKTe5qsO5MOp6nZng"
  },
  "5n-fXmtSAZY68CttVVj9mA": {
    "date": "12/21/2015",
    "text": "Hands down the best Thai food in Charlotte. Can be a little on the pricey side, and service is hit or miss, but the quality of food is always excellent. Must try the green curry and Thai beef salad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ifNxRfY9eiE-AzSdRQS1WQ"
  },
  "-LrfrN2xxOXfj8PykNNo1Q": {
    "date": "11/10/2013",
    "text": "My wife, 16 month old and I dined in on 11/3/2013. All 3 of us got bad food poisioning within a day. The little one started throwing up in about 4 hrs. Food was tasty but the service was not good. I will never go here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-p7rX7z1Mx1YFX009Tq4dg"
  },
  "cqhe_mF_wcZ27O81pqH8mA": {
    "date": "1/8/2014",
    "text": "Pros: -The food tastes good... tastes.  Cons: -I always feel terrible the next day. No matter what I order. This is not something that happens to me at any other decent Thai or Sushi restaurant. -Sort of expensive for what I feel I am getting. -Service has never been good. I have been there four times and every time my food has come out incorrectly (I am not picky, I order straight from the menu, nothing weird). One time my friend and I ordered the same thing, and mine took 20 minutes longer to come out, and even then was wrong! How hard is it to get red curry with chicken?  Go/No-Go: I will not be returning. If you want good Thai food, drive a few minutes over to Thai Taste; if you want good Sushi go to Ru Sans or one of the many other restaurants in the area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3nsMwcftirYRa1TX6QHrWg"
  },
  "YMBzik-JjwUA5qwL3rqrLQ": {
    "date": "10/30/2012",
    "text": "Deejai, how I love thee. You have, by far, the best Thai food in Charlotte. As much as I enjoy eating within your walls, I like doing take out even more. This past Sunday, we feasted on your Drunken Noodles with pork (Pad See U), Ocean Roll, and Green Curry with Duck. Holy moly. Everything was amazing, but the green curry put me into food heaven. I want to bathe in it. I've never been disappointed with you and can't wait to go back soon (ALSO, I love that you always have coupons on the back of my Harris Teeter receipts).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SB7Dd-10J_t6fgA8BMa_-Q"
  },
  "-MgUUyEIRqmR14YJ5jGWKA": {
    "date": "10/13/2013",
    "text": "Very hard to reach by phone to place a to go order.  When I arrived, you could not even get in the door, because people waiting for to go orders were standing there blocking the entrance (and the stairway to the bathroom), and the cashier could not be bothered to ask them to move a few steps to the empty bar area. The dumpling were falling apart, completely undercooked, and a total waste of $7.99 (for 4 very small ones).  The spring rolls were extremely greasy, and contained nothing but cabbage (and a lot of oil).  The red curry was fairly good, but the meat was tough and overcooked.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_EUYpuwoLSdGyluDLtUI8w"
  },
  "pQn2zhZLaNdMr_yYPs6DWw": {
    "date": "6/15/2010",
    "text": "By far the best Thai food I have had in Charlotte...I eat here for lunch at least once a week or more. The prices are unbeatable for the amount of food and everything is made to order no frozen vegetables here.   You can get a lunch here dining in for under $8 and they bring you free soup and a free taste of an appetizer. They switch it up all the time and I love that I get to keep trying new items.   I haven't been out to eat here for dinner yet but I never stop craving the food. Spicy and delicious. For something light try their Thai beef salad. My absolute favorite dish is the pork pad prik...the menu items all list suggestions of what type of meat to try with each dish, but of course you are free to order whatever you would like ... and you can't go wrong with any of the curries either.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "xJafm7vGSkUI5ocgYkCWkA"
  },
  "xTrAOdypAAbVGR7kzbEx0w": {
    "date": "7/16/2010",
    "text": "I've been interested in popping by this cute little Thai restaurant in Myers Park for some time now, so I was delighted when husband was in the mood for Thai takeout. This review is solely based on a takeout order, as we didn't have time to eat in!  We brought home the Basil Rolls, the Pad Thai (price level hot) and the Pad Prik (spice level medium). First off, the Basil Rolls were delicious! Hubs and I tore into those immediately when we came home. They consisted of fresh shrimp, sweet basil and bean sprouts wrapped in rice paper and came with a plum sauce for dipping. They were super light and very tasty. For $4, that's a nice deal. Two orders of these would be great for a healthy lunch!  My meal was the (spicy) Pad Thai. I decided to take a walk on the wild side and order it at this spice level as some of the reviews mentioned that Deejai's regular Pad Thai can be lacking in the spice department. Holy hot. It was tasty, but super spicy. Durr.   The flavors of their Pad Thai were good, but not great. The peanut sauce was a little too thick for my liking and some of the noodles stuck together a bit. I prefer a lighter Pad Thai. I will say, though, this Chicken Pad Thai only cost $10 and left me enough for another (quite large) meal.   While Deejai is not my favorite Thai place in Charlotte, it's fast, friendly and tasty!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "qlC607Cyp0Mj91vDFvkp3Q"
  },
  "kHLgb5vyQ912cfggtp_8Iw": {
    "date": "2/18/2014",
    "text": "Came in for take-out earlier tonight. Sat at the bar and waited. And waited. And waited. There were 4 or 5 men having a drink at the bar when I sat down and they all had full drinks. They were cashing out, so I understand that everyone might have been busy...but a \"hello\" would have been nice. The men at the bar left, and I was 1 of 2 people sitting at the bar. And I waited some more. Anyway, after a little over ten minutes, I flagged a woman behind the bar to ask for a menu and was finally acknowledged. My glass of wine came out fairly quickly, but it took her a long time to ask if I was ready to order, even after I was clearly done with the menu.  The wait for the food wasn't terrible. When my wine was about 2/3 empty, the woman who took my order asked if I wanted another glass. When I asked her how much longer the food would take. She said it would be a while. So I ordered another. The food came out *maybe* 5 or 6 minutes later. I don't have a problem with waiting for my food if there's a reason. But please don't knowingly tell me \"it'll be a while\" just to sell me another glass of wine.  Anyway, onto the most important part of the night: the food. I got sushi for my fiance, which he ate & liked, but didn't rave about. I've had the pad thai from here before (which I've always enjoyed), and I wanted something new, so I tried the Roasted Duck Curry. Pretty fantastic. My only complaints are that the duck was *very* dry, I asked for brown rice and got white, and that the sauce to food ratio was severely lacking. If I order a curry, I obviously don't want soup (which this most certainly was not), but I'd like to have enough sauce that I can taste a bit in each bite. Generally, the lack of curry sauce made the whole dish feel dry and a bit boing. Still, the sauce itself was awesome and the vegetables were cooked perfectly.  Overall, I'm on the fence. I've been a waitress for long enough that the lack of decent service can make me never want to return to a restaurant. Is a few tablespoons of great curry sauce worth a bad experience? I never say never... but we'll have to see.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Az08Hs7uhDYW-9T-MYXChg"
  },
  "Z_-KLFnrl5xUYmR3-WYcKQ": {
    "date": "7/23/2011",
    "text": "Went here during restaurant week. Was it worth it? Probably not. Their appetizers were tiny (shumai or crab rangoon)-- we had both. The shumai was not warm and you only got 3 little ones. The crab rangoon was good, but how can any decent restaurant mess it up?  Then we had the entrees. This place probably has the worst pad thai I ever tasted. It was a reddish pad thai, which I have never seen. It just didn't taste good at all. The other entree we ordered was crispy duck which came in a red curry sauce. The curry was bland and the duck was a little overdone.  The food wasn't terrible but it wasn't good either. I won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k95_mG3E2hly-l7VKXTSMw"
  },
  "ZALOGG1O_yMkjJ_RVtcVAQ": {
    "date": "10/1/2011",
    "text": "Atmosphere is inviting and clean, service is friendly, food is high-quality.   I tried their current special Firecracker Roll- I assumed Firecracker would mean spicy, but apparently it means smoked or flash-cooked somehow. It was immaculately prepared and plated but there was a film of black on top that tasted to me like ash. The server took it back no questions and the sushi chef made me a Deejai Roll immediately, which was delicious.  The crab rangoon, spicy crab & avocado salad, and drunken noodles were also very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jRH9hDARKgc5F2pfOzUnRw"
  },
  "VLBNlnpH_hHFdIj1G6TjNQ": {
    "date": "12/28/2011",
    "text": "In my quest to find the best pad thai in Charlotte, I went to yelp for help and suggestions on where to go next. Reviews for Deejai seemed well so there I went!  I ordered the Spring Rolls for appetizer. They were hot and fresh when they came out. There were 6 pieces, about the size of my thumb each, they were laid on some lettuce strips in a small plate. It was good - they were veggie rolls - but they were a little too oily. Also, the sauce was too sweet so I had to ask for something spicy to dip the rolls in. The rolls were 3 stars for me.  Now comes the main dish. I ordered pad thai with chicken. It came in a large plate with a deep center. It was good, not spicy like that of pad thais I've tried elsewhere. And they didn't have a condiments tray, to put chilli or other spices in it. Also, as I ate, I found that some noodles were rubbery - probably those who got stuck in the wok and got overcooked that they still served. They were bundled up and were harder to bite/ chew through. That was a little disgusting. The chicken was cut too big to be eaten well with chopsticks. But at least it tasted fresh and clean. Pad thai was 2.5 stars.  Ratings Summary:  Service = 4 stars - The crew, Jessica, was very attentive to me and my needs. She was quick, and the food was quick enough that I didn't starve to death.  Ambiance = 4 stars - This is a very date-y place. It has dark lighting and posh seats. Could be for groups too. There was actually a table where 11 people were seated when I was there. Reservations may be required. It was packed when I came, and I sat in the bar instead because I didn't want to take a table for 4 for myself.  Food = 3 stars - It was a little too hyped up, but it was really just okay. Not the best one in town. Som's (my fave Thai place from my hometown in the Philippines) could easily beat that pad thai to the ground - and serve me one for 2 people at just $3. Deejai's was $10.99 + tax.  OVERALL = 3.5 stars  Would I go back? Perhaps. I'd like to try the other dishes like the ground chicken (Spicy Basil I believe). But never those items above ever again. And I'd probably only really come back if my meal was on the house OR being paid for by someone else :P",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ytYjYimaqqapf7CLPZ13Qg"
  },
  "4DpjpdAcdNeFLAp7Jnbh8g": {
    "date": "6/4/2015",
    "text": "The food was excellent but walked in at 2:45 and it was very obvious the hostess wasn't happy about it. She told me they closed at 3:00. I started to leave but they were open. Not at all welcoming. Won't go back, at least for a good while.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PvFN0cv2eBcEYhbqBhPGmw"
  },
  "CjQ8pYzhyo25PnTsOzzQjg": {
    "date": "6/24/2013",
    "text": "They have a great menu - one of the most expansive of all the Thai restaurants in Charlotte.   For example, where else can you find steamed flounder in a yellow curry, or fried salmon curry.  My favorite is the Soft Shell Crab in a Panang Curry which I had last night. Be warned though that service can be slow for dinner.  Lunch is no problem.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dms7MBnMKJo5-KYwf2qN0Q"
  },
  "pfcLNWdh-HsY_PpH3zkXgQ": {
    "date": "4/5/2010",
    "text": "Disclaimer - my experience with Deejai was take-out and not dine-in.  While trying to decide between Thai Taste and Thai Orchid with some friends, we decided to give Deejai a shot.  Here's my rundown of our experience:  Called in order.  Person that answered the phone and took our take-out order seemed to be annoyed that we called.  Could've been a bad day, but he was off-putting.  Items we ordered: Mee Krob - requested chicken mee krob instead of shrimp.  Not sure if this messed up the order but when we got it, it was cold and the chicken was really chewy.  This dish at Thai Orchid is cut up very small and easily wrapped in the lettuce.  We also got about 10 minutes away and realized that they didn't include the lettuce.  Turned around and went in to get the lettuce, they gave me a small chopped head of cabbage.  Went back in a second time to get lettuce and actually got it this time, although there were only about 3 actual leaves, and the rest was the inner part of the lettuce head that's unusable for wraps.  Jeeb Sai Moo/Curry Pot Sticker  - No complaints about these  Deejai Gai Krob  - No complaints about this dish, was apparently very good  Pad Kra Prao/Spicy Basil - No complaints except the person ordering it expected it to come on egg noodles and not with jasmine rice  Pad See U  - ordered one chicken Pad See U and one shrimp Pad See U with extra spiciness (two stars).  Chicken Pad See U was fine, Shrimp Pad See U was not spicy and the shrimp was rubbery.  Fortunately, there's a lot of good Thai restaurants in Charlotte, and I think we'll be sticking with Thai Taste or Thai Orchid from now on.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJbCkhIpU-i5xYx5wCAkkw"
  },
  "vbyun7lpxwos3riIvqDTFw": {
    "date": "10/4/2015",
    "text": "Yum, yum, yum! I can't get enough of this place. Love the Drunken Noodles and Mixed Vegetables. Atmosphere is nice, wait staff is friendly and very attentive, and the food comes out fast. Delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yF5hVcLOReTtqvK6ra5Zdg"
  },
  "ncQ659JXjoLbpQQ8im2IEw": {
    "date": "10/1/2011",
    "text": "This place was awful! I have never felt the need to write a bad review about anywhere I've eaten until I went to Deejai. We had 4 different people waiting on us who had no idea what was going on, not to mention how rude they were. It was way to crowded and uncomfortable. The worst part was the food, mine and my husbands entrees were both still mostly frozen when we got them, it was gross. I would never eat here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dd8F6GyExYFHhN4kDC5EYA"
  },
  "cYgYsoNuranYrdXexZvyoA": {
    "date": "9/22/2011",
    "text": "Huge fan of Deejai nestled right beside the Manor Theater.    My favorite dishes: Green Curry, Spicy Basil  They also have a large selection of sushi....try the Deejai roll wrapped in cucumber.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hwc9byKOUZbCPq_Hkc5SFw"
  },
  "ScOj4j_0I-VRYfeUrrwuLg": {
    "date": "1/10/2010",
    "text": "What a lovely restaurant.  It was really nice to enjoy great tasting thai food in a comfortable, classy atmosphere.   The service was quick and attentive- we had a really sweet waitress who didn't rush us when it took us awhile to decide what to order.  The food came out quickly- but not too quickly. I had the roasted duck in red curry sauce and it was divine. The spice and flavor in the sauce was too good, and the duck was just falling apart.  The dish was served with a variety of properly cooked vegetables- nice color and just the right amount of bite.  Nice by the glass wine selection, too.  The food, service, atmosphere, location... it was all spot on. Just the kind of restaurant that Charlotte needs. Go Deejai!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y6oa3XXUj9LBK2N32kEmGg"
  },
  "Senx-nMsSQv_Tl96976C_Q": {
    "date": "10/18/2018",
    "text": "Update: I've since ordered takeout another two times and had better experiences. Both times I ordered the Drunken Noodles with different protein and both times the noodles were saucy, flavorful and everything was cooked well. I think I will try their curries next!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PHgoZTMl9UxeZzwAejNlww"
  },
  "-lWUEl3TRXQUsjwnUDh4SQ": {
    "date": "9/18/2018",
    "text": "I had the Thai basil chicken and enjoyed the meal however I wish the chicken hadn't been ground and I would request that when I return. The flavors were spicy and very present, which I really appreciate in good Thai food. My husband tried the mountain beef because I told him that it was the most recommended item I saw when reading Yelp reviews. He was not disappointed! We will be back soon because we purchased a Groupon immediately after leaving!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_NpSl8OWMrQH45mfqia9zQ"
  },
  "fABeDyDJ3RtWjYYRgNnhgg": {
    "date": "3/29/2018",
    "text": "Thai food is one of my favorites. It's some of the best comfort food.   Since moving to CLT I've had a hard time finding Thai food that I really like.   Deejai is pretty good! I ate in the restaurant for the first time this week - I typically do take out from there.   I like their pad see ew and drunken noodles.   While I like their dishes, I wished they used proper noodles for the dish. They should be made with wide noodles.   This place can get super busy on the weekends so keep that in mind if you're planning to go for dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hr3iSHRh59DhFX8dn_UReg"
  },
  "zmEa00ucZBFaxnzZ5LV_wA": {
    "date": "1/3/2018",
    "text": "I have yet to find Thai in Charlotte that really strikes my fancy, but I did happen to buy a Groupon for this place during one of my Groupon buying binges. A lot of times when a restaurant is offering a Groupon they are either new and trying to gain traction or they are struggling to stay afloat typically because of execution issues. Needless to say my expectations were a bit low.   Luckily for me the food was on point! I might be wrong, but I think there used to be a different Thai place here or they had the same name but a very different decor 3-4 years ago, either way the food matched my memory as being delicious. Ordered a few dishes to share family style and had plenty leftover! Red curry, drunken noodles, and sauteed eggplant were the selections of the night.   Drunken noodles were really good (5 Thai Spicy) hit the spot, but honestly I prefer the flatter noodles to the chunky ones. Either way still delicious and exactly what I needed carb wise with all this cold weather! The red curry (recommended by our server) honestly left a lot to be desired heavy on the coconut milk and light on the spices and flavor. Eh...not bad, but if you cook curry at home or are experienced in Asian cuisine you won't be impressed. The eggplant was delicious, but I guess I was thinking more eggplant less meat. Admittedly probably my screwed expectations after eating so much awesome eggplant over the past year in China (Yes, I know this is Thai not Chinese, but they do have a sushi bar...so fusion?).   Either way, definitely worth checking out the food is great. The service on the other hand could be improved. Asked two different people the specials of the night before getting an answer. Additionally had to waive down the waitress to order drinks other than water. Come on guys, up sell me.... please?!?",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "TWQ4bxTnfz40cZMFCE2W-g"
  },
  "SMyom3Vjyozte3RgX58-Kg": {
    "date": "1/13/2018",
    "text": "Great Thai food in a homemade restaurant! I like their pad Thai entree with any meat or tofu.  The tofu is served with lots of vegetables--generous amounts.  The sauce is more orange based and savory. I think they have good appetizers also. I recommend the spring rolls or pot stickers dumplings--meat and dough are my happy place!  Their parking lot is tiny so sometimes I park by Panera and walk down.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CKRfBUqQGaVCYTKN5kDrzw"
  },
  "POrQQ4XXTdYEUmFokPXkWQ": {
    "date": "11/26/2017",
    "text": "4 friends first time here.  Using a Groupon, on a Sunday. Not that impressed with service.  Arrived at 5pm opening, seat promptly.  A couple tables already seated. Ordered Larb (chicken) good, but never seen it served with a slab of raw cabbage. Awkward to eat, and also served with lettuce underneath it,  lettuce got warm and soggy. Green chicken curry, excellent, shrimp and chicken pad Thai good but slightly dry, more sauce please.  Most disappointing was the coconut soup. Lots of cabbage, don't know what the obsession with cabbage is all about??   it did have plenty of  but the Bahn mi and soup  had NO cilantro!  When I asked for a side of it to add to both menu items that listed it, the server came back and said they were out!  Seriously, both items have cilantro as a Intercal part of recipe. And was missed.  Should have been told, so I could decide.   Appreciated the 96.5 sanitation rating.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bZ1K8se8VMg0cSBgCOW8zg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Pork Bahn Mi but more like a steamed bao bun.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bZ1K8se8VMg0cSBgCOW8zg/o.jpg"
      }
    ],
    "user_id": "8R7YQrcWqc72_IBbWgaJlg"
  },
  "InGJBgDGFJ8AbFHaUsLUOA": {
    "date": "5/17/2018",
    "text": "I have passed this place several times on my way in the Twin Manor theater next door in the same plaza. First and foremost I have to say the night that my friend and I came here the weather was PERFECT. It was about 80 degrees and there was a nice breeze. Naturally we wanted to sit outside, however I didn't think there was an outdoor seating area. I was wrong. They have the cutest outdoor seating. There are even fans outside which I'm sure help during the hot summer months. The patio is well lit with the cutest lights. There is chair and bench seating which I thought was cute as well.  I believe we got there about 90 min before they closed. The restaurant seemed pretty busy but not too packed. There was a large party leaving before we entered so I'm sure they probably took up most of the room there. Anyway, we asked to be seated outside and we were seated immediately. I liked that you could hear the background music outside as well. That was nice. We were given menus however no one came back to check on us for at least 10-15 min. Once that happened we ordered drinks. The drinks came pretty fast and were made perfectly. I had a drink called Orange Blossom I believe. To me it tasted like sweet tea with a kick. It was strong! I loved it! My friend ordered a different drink with pineapple and I tasted hers. AMAZING!   After getting our drinks we see our server for another 10-15 min or so. This made me a little nervous and worried the food wouldn't be good.  It didn't take too long for our food to come out once we ordered. I got the spring rolls which were really great. I also ordered the crunchy shrimp roll, which I thought was super small for sushi. It almost looked like grocery store sushi. I was definitely disappointed. I don't know if it's usually made this or if they were running out of food due to it being the end of the night. Either way it tasted ok but definitely not the best sushi I've ever had.   I'd come back for drinks and maybe an appetizer. But I wasn't impressed by this Thai spot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_mVg8S8XwpcP3oB3keL1Fg"
  },
  "jIktKeOSwxg405YOLoInCQ": {
    "date": "11/8/2017",
    "text": "I don't recommend this place. First time here and we paid an average of $16 per entree. We got two and both had to be adjusted at home to be somewhat correct. The basil chicken was steamed in a lot of liquid instead of browned. It was swimming in two cups of liquid and overpriced. Poorly made with a big price tag. I'm surprised it left the kitchen. The pad see ew wasn't anything to write home about either.   Can't speak on how it is to dine in, nothing personal, but skip this place for take out.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BfwFC1VF775P8BfECdDYWw",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BfwFC1VF775P8BfECdDYWw/o.jpg"
      },
      {
        "img_id": "6dSHSPKgNL4jnsMCbcAVHg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6dSHSPKgNL4jnsMCbcAVHg/o.jpg"
      }
    ],
    "user_id": "a-OYYZbtoUJ1wCN8qG_6iw"
  },
  "oxcdiVYyJFLWN70buB9x0g": {
    "date": "3/2/2018",
    "text": "My fraternity brother, Steve, was in town today from Greensboro and I had to figure out where to take him for lunch.  We were taking a tour of Charlotte and as we were nearing the famous Myer's Park area, I remembered that there is a Thai restaurant that I have never tried.  So, we popped into Deejai Thai. It was lunch time and there were not a lot of patrons.  It was a quiet day with nice soft music playing. We were quickly seated and served a complimentary bowl of soup and fried won tons, which were delicious.  Our entrees followed. I had the spicy Lemongrass chicken and Steve had the Basil Chicken.  Our tongues had to get accustomed to the spicy flavor (more than we expected), but we loved our dishes.  This restaurant has an urban feel to it, not an overly Asian vibe.  Everything about it suited our tastes, from the atmosphere to the service to the delicious food.   It's a good thing that this restaurant is next to the Manor Theatre as I already imagine going back for a movie and another Thai dish!  Two Thumbs up, DEFINITELY!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "BRNUiYpEGYVXpzls5hRg7w",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BRNUiYpEGYVXpzls5hRg7w/o.jpg"
      },
      {
        "img_id": "d7C-B-PULPQ176vYq16hMQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d7C-B-PULPQ176vYq16hMQ/o.jpg"
      },
      {
        "img_id": "ViqMhOhbvIi2g_qkoQyEug",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ViqMhOhbvIi2g_qkoQyEug/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "Lb-8wJzNLGAJpEnr7zgTMA": {
    "date": "1/9/2019",
    "text": "They gave me coconut soup when I sat down. It was fantastic, very flavorful. I ordered the red curry. Spicy and full of great flavor. Fresh vegetables abound. Nice atmosphere",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G23g0CCqyZB46CDsjgFK2Q"
  },
  "2e59mpjdr7X0VUKaKX8Ojg": {
    "date": "2/14/2019",
    "text": "I really don't make yelp reviews because the majority of the negative ones I see are nit picky and ridiculous. This is a bit different. I came in with my friend and her daughter. I'm allergic to shellfish but order sushi at many sushi restaurants in Charlotte (usually) with no issues. I ordered a roll with spicy tuna and what was said on the menu to be \"white fish\". We all received our orders and I noticed quickly what looked like crab on mine, I asked my friend to try it and she said it was indeed crab. My friend called the waitress over (later found out she was the manager). She asked what the issue was I told her she then assured me it was white fish because that's what the menu said. I nervously said \"well I'm allergic to the point I'll go into anaphylactic shock\" she said she'd talk to the chef and seemed to be annoyed. I could see all of this happening and the chef looked at me and too seemed annoyed. He fixed it again and when I got the right roll, my friend and daughter ( who was now asleep on the table) were finished with their food. I asked for this to be comped from the ticket, they gave me half off.  I told the manager that she didn't understand the severity. She said that's what she told the chef. Basically if you have any allergies I'd strongly advise you to not go here. I've worked in the service industry for five years, this doesn't happen.  I've also been to a restaurant where they too made a mistake but apologized and comped my meal. Mistakes happen and I'm not one to send anything back, if it's burnt or cold or something I can get over. But again this is not like that. Mistakes happen but this is a serious one and if you have a life threatening allergy you get it. If you're a manager you should too \"get it\"",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qtm4ivAsd2PsYSe2LjV5yA"
  },
  "Y-Gz00b6DfvkO6fjaCtpKA": {
    "date": "10/1/2018",
    "text": "Pad Thai with shrimp was really good and Crab Rangoon had huge chunks of crab that you could actually see in it! Ordered through Postmates and did not receive utensils - specify if you get takeout or delivery.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qQLXorbz9sNRCP-qUlqKuA"
  },
  "58B9H_6TUvcpOLEWG3E1qQ": {
    "date": "11/4/2018",
    "text": "I was really hoping for a better experience here! The service was the worst part of this trip. I asked the waiter if I could have an iced Thai tea with a shot of rum because why the hell not, right? So he goes to ask the bartender and comb comes back over to tell me that he said he wouldn't do it. Not that he couldn't, but that he didn't want to. Seriously? How hard is it to add a shot of rum to iced tea??? So I ordered a shot of rum and added it myself. The food was alright, not the best pad Thai I've had. The Tom yum soup was very good though. Probably not good enough to go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xNbEEcymPtaEPtFwewsqQA"
  },
  "nyG7jiJkbpf80bgwVvfQIA": {
    "date": "11/23/2016",
    "text": "The restaurant was in a good proximity to downtown but the parking wasn't spacious and will surely get filled up quickly during peak hours. The restaurant was a little too dimly lit and the restaurant didn't seem much spacious. Lot of little tables and small chairs seemed to be cramped together and the tables were so close that you could literally hear the other table. The interiors weren't too exquisite but just a couple of Buddha paintings and other Thai art. There was also a sushi bar and again, I found it confined too.  The menu was a one page menu but even now I wonder why they printed them in black. Added to the extremely dim lighting, It was an arduous task to read through the items. We came in for dinner and ordered some starters and our main course. I went for a wok dish - pad prik. All their food were tasting great. They were of good quantity and extremely delicious.  The only downside I found was the restaurant was a tad costlier for the ambience they provide. And the places was too compact and crammed. As soon as I finished my tasty food, I was glad to get running outside to get fresh air!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H0HHbXUY4aAdX2OSaO5_2A",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Wok dish - Pad Prik",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/H0HHbXUY4aAdX2OSaO5_2A/o.jpg"
      },
      {
        "img_id": "KR3UluNC_FlKouqFoh1idQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Fried calamari- the sauce was delicious",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KR3UluNC_FlKouqFoh1idQ/o.jpg"
      },
      {
        "img_id": "y-OM45Bt5HsZtnEeVRbsgg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Spring roll - forgive the bad picture, the restaurant was just too dim",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y-OM45Bt5HsZtnEeVRbsgg/o.jpg"
      }
    ],
    "user_id": "u-NbxbNdh7GZGnwxXUitYg"
  },
  "-wbBNGMb9RJ5kXJ_aLvBVQ": {
    "date": "3/2/2018",
    "text": "We were seated right away without a reservation on a Tuesday night. With the groupon the restaurant has been offering. My fiance and I have been wanting to try this place for a while now. I'm so glad we did. The service was quick and precise. The food was delicious. I got a scallop dish with pretty much Thai basil stir fry and my fiance got chicken panang curry. Both were amazing, I would say even more portion sizes than I expected. We also got the spring rolls for appetizer which normally comes with 2 but came with 4 for an unexpected surprise. They also have a large lot but shared with a small movie theatre and Panera so keep in mind when you visit, you might need to park behind the building. I am so glad though I found a great Thai place so close!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KHbnJXr3gx4-JfI5U00YCg"
  },
  "H63RaO5iWpZMAn7kC3tZAw": {
    "date": "11/28/2018",
    "text": "Tried carryout for first time.  Had a wine while waiting.  The wine ok but the glass smelled quite soapy.  As for my order, the spring rolls were average.  The Miso soup was good.  For the entree I had the Seafood Curry.  The mussels were inedible, the calamari and shrimp were tiny.  I couldn't recommend that entree at all.   I ordered brown rice but got white.  The food came out quickly, but, no offer for napkins or utensils.  Fortunately, I was able to round them up at the hotel I was staying at.  I might try them again, but, I think would be better to go vegetarian or something more Thai traditional.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQVGWvyihLdkPotPXh2w7Q"
  },
  "w_fOmk_wux8cCQo0428Hjw": {
    "date": "10/27/2016",
    "text": "This place never disappoints me.   Love the duck dish.  It s by far one of the best I have had in Charlotte.  Kang Dan Ped",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4twtH0kq90xRJszs8a2kOA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Kang Dan Ped",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4twtH0kq90xRJszs8a2kOA/o.jpg"
      }
    ],
    "user_id": "GSMFNKyjgfuG5Cxw3B5HLA"
  },
  "XfPJD49_SeO9w56fEgyeqg": {
    "date": "2/19/2018",
    "text": "Came for dinner with my boyfriend and his Dad on a Saturday night.   Started with tsingtao beers. Have to in a Thai place. Also had a rainbow roll and the calamari. Calamari was great, sauce on the side was creamy and spicy and great. Rainbow roll was meh, wouldn't get sushi here again, but I'm pretty picky about it.  Ordered the cashew delight with chicken, sooo good and so much food. This is one of my favorite Thai dishes so I've had it all over, very pleased.  Boy had Thai basil, was so good and spicy and also a lot of food (he generally doesn't leave food on his plate and there was a good portion left).   Overall very pleased, definitely would steer towards Thai dishes rather than the sushi.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lULgM3VoM1hF1aR7cDmz5A"
  },
  "eBA7jpDC1_23yXiAQRIyJA": {
    "date": "8/10/2018",
    "text": "Such a neighborhood gem.  Food is fantastic and a great feel.  Amazing bartenders and service.  Definitely a must-go for fantastic Thai cuisine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hJNOUUbk3t9-UYmCRaaLWg"
  },
  "wamaNCxZn0pIwuevZghIpA": {
    "date": "6/9/2018",
    "text": "Went for dinner and ordered aggressively for two: Chicken Larb Cashew Delight Duck Curry And the Rainbow Roll  The food was not that great to be honest. The chicken lard was good. I would get that again. Cashew delight was pretty good. Did not like the duck curry at all and as a sushi lover the rainbow roll was disappointing.   Overall was decent food but nothing stands out and would not go back. Highly overpriced for the quality and taste.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "OWVNQl6rgou9rAAHAm4sSQ"
  },
  "p3ZbuBZ7oBuT6YqBOhOYjg": {
    "date": "9/28/2014",
    "text": "Although I've only been once, I most likely won't be going back. The food was OK, but the flavors were nothing special. I had the Mussaman Curry for an entree and it mostly just tasted like peanuts. We had the Pot Stickers to start off, and although the sauce was delicious the dumplings themselves were a little soggy and lacked flavor. The other entree we had as the Pad See U, and that turned out to be overly salty. Maybe we just went on a bad night, but I was pretty unimpressed with the food we tried.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cEnN_26ZLSXtHIwVfiDMqg"
  },
  "FkbAnUZLKnnKpL5iNUi7pw": {
    "date": "11/22/2011",
    "text": "Went here for my first anniversary with my wife and immediate family - we all absolutely loved the place.   First off, the front staff was extremely friendly, and seated us immediately even without a reservation. Our server was super friendly, and was more than willing to offer jeer advice on which dishes to get. Heres a breakdown of what we got.  Pot stickers - fried dumplings in a sauce. The dumplings had good flavor, and were cooked well, wish we had more of the sauce with the dumplings.  Crab Rangoon - awesomeness, had two orders of these and they were devoured immediately. So light and crispy, absolute perfecton.  I had the spicy basil chicken. Very spicy, with GREAT flavors, and I loved that the chicken was chopped up. Had a little bit left over, and it was awesome the next day as well.  My wife had two big sushi rolls, I don't remember the names, but they were both excellent.  My sister had the pad Thai, it was delicious.  The BEST dish we had was the sea bass chefs special that my mother had, we all tried it and it was amazing, it was cooked to perfection, and tasted amazing, highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cR2q5lOfIljeKjQ35X63Qg"
  },
  "YuhuIQyRF0fkoXsPljFtPA": {
    "date": "1/20/2015",
    "text": "Really good Thai food.  Desserts were ok, I liked the fried bananas, though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jzAT5ROW5JzcX3WnXAxcYw"
  },
  "8pxAQqAbLaCR4whCUiGrQw": {
    "date": "8/20/2014",
    "text": "First time dining here, have passed by it many times. The food was excellent. I ordered the Druken Noodles w/beef..spice level 3, was just right for me. The staff and atmosphere was great too...will definitely  go back and try more options on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "99-1JQmf-STaiNLlUGwDRQ"
  },
  "jcf-8xxmUB8gBdmcDFdHQA": {
    "date": "3/12/2014",
    "text": "Great for dining in or take out. I wish they delivered, and I'll continue hoping. The basil rolls are fresh and delicious. The larb is crazy good and the perfect level of spicy. I order with lettuce bc I don't care for cabbage. The sushi is some of the best in town, but orders can sometimes take a while because they only have one sushi guru (at least from the times I've dined). My fiance likes their pad Thai a lot, and he's picky about pad Thai. I'm not giving 5 stars bc the menu is a bit overpriced. But it's excellent quality and in Myers Park.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6tdCcvKIRLJnfOaXgEqnJg"
  },
  "zD2h_0BgMlM6pU2iMRhc1A": {
    "date": "3/24/2013",
    "text": "This place is a gem! Unfortunately, I had to go by myself. During *lunch* with a LS deal for $40! Dangerous! Their prices were so reasonable that I had to buy 3 huge dishes with special ingredients to up the price. First I had the Penang Curry, and that was lovely. Then I asked the sushiya what roll I should get. He asked all the right questions and I came away with (I think it was called...) the Fire Cracker roll, which was...WOW. A feast for the eyes and a party in the mouth. I finished it off with Pad Ma Moung with flounder. Highly recommended! The servers are also very sweet and attentive.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "XM2AJHCBkQ7s845yOD330g"
  },
  "3UXmAFBfPqaQDDT-xj0Tdw": {
    "date": "9/11/2013",
    "text": "This place came highly recommended and the reviews seemed great. So I was glad when I saw a coupon for $40 worth of food for $20. (I should have known better) Wow, I didn't know that you could ruin Pad-Thai that badly. I should have known the place not going to be good when I ordered Jasmine Tea and he brought me a cup of hot water and a tea chest. I should have gotten up and left. At least I would have had a decent meal instead of the travesty that they gave us. My wife and I love Asian food. But to me this place doesn't even qualify as Thai. It's more like a fusion restaurant that tries to do much at once and does it all badly. The place is too loud, too cramped and the waiters need to take comprehension lessons. We asked for the Sushi special a Tsunami roll, we got the Samurai roll instead. The Pad Thai tasted like it was made by a kid that worked at Nothing but Noodles. I mean,\" Come on, this is the supposed to be the signature dish of Thailand.\" It's supposed to be full and flavorful tasting. It's not even supposed to look like pink, limp noodles that have been over cooked. ( The HORROR!) If you like traditional Thai food run the other direction. If you have never tried Thai or like typical mall food Asian fare then this place is for you because you don't know any better. What a waste if an evening! ddc",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jzy9P_PD89jzjd-PKcx62w"
  },
  "PJBlP8UiuF5yoA3yqatxMA": {
    "date": "3/29/2013",
    "text": "Only had a take out. Shrimp dish and scallops dish.  Shared for two people.  Rice was very good and so were the two entree's.  I would try again.  I live in SC.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "xABAy0m9ZAP2QjBvvILGQQ"
  },
  "uawATlQiw2PWuCj32dHl6A": {
    "date": "3/22/2014",
    "text": "I went to Deejai for the first time and loved it! I had the Papayan Salad and the Basil Chicken, both awesome flavor, incredibly fresh and delicious. Definitely my go to for Thai food!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v7krl6LikQ3lggtNxjnBxw"
  },
  "jc5wzTWfmhZCN1Y1V7v0BQ": {
    "date": "1/21/2011",
    "text": "Unrelated to this review...Thursday nights are underrated.  Or were they ever rated?  5 stars.  DEEJAI THAI.  The glowing neon letters make me feel like a mosquito.  You are just drawn to it!  I am no Thai aficionado, but I know that the Thai food that I have had, I have enjoyed.   I checked out Deejai with 4 other girlfriends.  This is the way to go for optimal sampling.  I began with the Paupia Sod or Basil Rolls.  These are the rolls wrapped in chewy clearish stuff.  I love these things.  I think what makes them so great though is the fact that you can dip them in basically peanut butter.  I had to ask for this on the side, as it is served with a spicy sauce.  Good, I just prefer the peanuts.  Give me a plate of peanut butter any day of the week.  My entree was the Gai Ma Kuer (Eggplant Chicken).  I am a huge fan of eggplant.  I just love it.  This was so delicious.  The chicken is diced up, taco style, and there are some great chunks of eggplant.  Portion size was filling, but let me just say I did not take home any leftovers.  I subbed brown rice for the jasmine rice.  A feeble \"healthy choice\" attempt.  $10.  I tried my friend's Panang Curry with chicken.  SO GOOD.  This is a milder curry, with all the sweetness of coconut milk that I just love.  The pad thai was also great.    Quick and friendly service, nice dimly lit atmosphere, and excellent food. I am sure you can get cheaper Thai food, but the prices I felt were reasonable.  For those sporadic Thai cravings, I will be back!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oz1Tz4LUlLw_UAgEkUiCvw"
  },
  "b8B8O_DWfnR4W7FEIy2Uwg": {
    "date": "2/8/2013",
    "text": "Yummmm...  Hands down the best Thai food in Charlotte.  Try the massaman curry or the sushi.  A must if you love Thai food!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "elznyrRU6DnAApKVVkaxZQ"
  },
  "6PAIFTsEZu5Mbp6AjGwylA": {
    "date": "2/9/2011",
    "text": "Went here for a birthday dinner with 11 other friends, and everyone had  a great time and good food!  Tried the basil wraps and really enjoyed them - we make these at home alot, but the sauce that came with them really kicked it up a notch (spicy thai chile).  I ordered the Pan Prik, level 4 hotness with prawns and enjoyed the meal - while I thought it would be hotter, the flavors were fun and the portion size was perfect.   The cons were that sushi took 45 minutes to arrive at our table (the waitress did warn those who ordered it) and their pricing was a bit high for some things I felt.  Their menu is large, the environment is modern but cozy. I would go back, but this wouldn't be the first place I'd suggest for dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "AWLMwFVdUCPtmo1IbQL3eA"
  },
  "FwYxjv5pvvjk1NHDpuFFfQ": {
    "date": "4/19/2013",
    "text": "Great authentic Thai food. I had the garlic eggplant and it was delicious I definitely recommend it. Also had the Thai iced tea and it was also good. Only complaint is the veggies on the pad see we could have been cooked more it was a bit on the raw side for me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "r0Mkz_1oE-aST35nZzGchQ"
  },
  "EqyX79wFN75rTssTmF2MTg": {
    "date": "1/12/2013",
    "text": "If you prefer sodium rich food then I would say this is your place! The food was more sodium based than the usual Thai spices I taste when eating Thai food.  The service was okay, and overall it was yuck!  If you want delicious Thai, I would recommend Thai 1st Bistro in Charlotte or Kanikai in Greenville, SC.  As a vegetarian they are more geared to accommodating the veggies and carnivores enjoy their dishes. Just stay away from this place or you'll end up drinking more water to clean out your system.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yfECTGBYb6IarwwNMm6zUA"
  },
  "lZ4K7bG4ien5eiBl7roSHA": {
    "date": "4/2/2014",
    "text": "Ambiance and decor is amazing as well as the food\\!! prices are reasonable. Great place for a  first date small group dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eV4YxrbLM9sLIKxkxb_ddA"
  },
  "1OO4q6u-4p7V1-gLw2TKuw": {
    "date": "12/15/2010",
    "text": "Thai restaurants in Charlotte are either over priced and average or just plain average!  Last week while looking for lunch off of our beaten path, I remembered Deejai.  The place I forget I want to try, and I'm so glad I remembered.  After walking in the door, and loving the enviroment, nice big doors, and windows,  bam, there was complimentary chicken soup and some kind of pork thingies. Neither which I eat so, I ordered some Tom Kha tofu soup and it was delicious.  Iced Thai coffee and some green curry tofu, freakin awesome and great prices!     I couldn't stop talking about this place, and how I complain about no good cheap Thai food in CLT, so we ate it again last night for dinner.  Two thumbs up is what I say,  PadTar w/ tofu, spicy, heck ya it's good. Service is nice and quick and the prices are extremely affordable.    It's so nice to find new things in CLT.-",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nucyf-86zyS76-7fn14HLA"
  },
  "qIIUSq_QlP09lgtFdDbfzQ": {
    "date": "4/10/2011",
    "text": "I have long noticed Deejai in the Manor Shops near Manor Theatre. But it wasn't until it was our friend's bday when we made it a girls night of pedis at Polished and dinner at Deejai last August. Hubby and I visited again recently on date night.    The ambiance is great- it's an intimate, perfectly sized restaurant if not a little on the tight side. The restaurant is simply but nicely decorated.  The service is good and friendly. It seemed there were regulars at the table next to us that got special attention from the managers.  The menu has some good variety to it; sushi which is good, traditional Thai menu items like Pat Thai, Pad See Ew, curries, etc. as well as some more fusion and innovative dishes, including some really interesting specialties and seafood specials.   The girls and I had the green papaya salad, which everyone loved (except me, but I'm picky), softshell crab, and drunken noodles. We also heard the halibut was fantastic.  The drunken noodles were so good (5/5) I got them the last time I went too, this time with shrimp and they were delish (too spicy for hubby though).  The softshell crab seemed a bit plain (3/5), but they were decent.      On date night, we started with the boston roll (4/5), then had the Pad See Ew and the drunken noodles. Unfortunately the Pad See Ew was terribly boring and bland. I thought maybe he was exaggerating and I tried them and he was right. (2/5)- they were dry and bland compared with what you'd get at Basil or Monsoon.    That said, we had a lovely time and we would return, just not for the \"traditional\" Thai dishes.  Go for the innovative seafood, or take a rec from the waitstaff. She recommended the beef and my husband wishes he had taken her recommendation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oInNoiunuDYWakwmvDiVVg"
  },
  "0F_3viWRilPVWNX0kTpBVw": {
    "date": "11/9/2010",
    "text": "Thai might just be my favorite of the international cuisines we have \"Americanized\" and adopted in the States.  Fresh herbs and veggies, delicate noodles and spicy sauces- what's not to like?  I'm happy to say DeeJai is a fine representative of the class.  I usually go here with co-workers for lunch.  Seating is pretty much always available and on nice days there are a few tables in a narrow outdoor courtyard.  Decor is modern but not over the top, nothing too jarring.  There is a full bar and now a sushi bar at the front end of things.  My only minor complaint with the setting is the constant playing of an \"all-acoustic\" Sirius radio station.  A little muted variety might be nice- I can only take so much Sting with my curries, after all.  The lunch here is a pretty good deal- compared to what else is in the area.  You get an appetizer (usually a single crab rangoon) along with a small bowl of a soup that changes, but no mind, it has always been tasty.  Combined with the main dish, you're looking at about $8-10.    There are a few standards here- basil chicken, pad thai, and panang curry, but there are also a number of entrees, including salads and fish dishes- you can be as adventurous as you like.    For me, the pad thai is NOT good here.  Maybe I've become too accustomed to Thai Taste and Thai House, but the flavor of of the Pad Thai here is way off for me, I avoid it.  No worries, though, because there are plenty of other options here.  My personal favorite is the panang curry with pork.  The curry is just right without having me breathing fire.  I literally try and scoop of the last of the sauce with my chopsticks.  My co-worker is partial to the spicy basil chicken, and it always smells tempting.  Both dishes comes with a generous portion of rice- not so with noodle dishes.  There is also a green curry and pad prik, both of which vie for my affection.  You get your choice of meat, or you can go vegetarian (not a bad choice).  Be aware this place is now closed on Mondays, sad but True side if effect of the current economy.  The new sushi menu looks very tempting, though I have not tried it yet.  The sushi chef stands around without much to do, so I can't comment here.    In all, this place is solid for both interesting entrees and some well executed favorites.  I give these guys a lot of credit, it's well-executed Thai without the crazy outfits or wall decor.  I'm all in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "AwyM03qzhwgyskBruurWQw"
  },
  "5xZk6JCOgGnpRzR0sdEAgA": {
    "date": "1/5/2013",
    "text": "Love IT. My favorite sushi place is Charlotte and great Thai as well. Is not a fusion place but rather both menus which is great. The sushi is very delicious with a light flavor and thin coat of rice and loTs of meat",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-HRYBiLS9NBBmPA3Ip7nTA"
  },
  "2SggvagpvldKB0mSBmV91Q": {
    "date": "7/6/2011",
    "text": "I've only eaten Thai Food once in my adult years and I have to say that my second time around was far better than the first.  Deejai is a quiant little restaurant with great accents and location.  Our server was gracious enough to explain to me all the different options and totally choose a dish that she knew I'd love....which...I DID!!!!  I trusted her and she did not dissapoint.  My Hubs is a picky eater, but has come to at least try new things and he LOVED his dish as well.  I got the Pad Khing Sod Ginger Herb and it was yummmyyyy!!  Totally sold on Thai food now and I think I'll only come to this place!  Love being a newby in the Charlotte area! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NeOIp8tz0kfxtmA8YUPmJA"
  },
  "BwTOfxY5TjJl1o_lgSZX8Q": {
    "date": "7/26/2019",
    "text": "SO GREAT. I had Red Curry with Shrimp. Yum.  SO GREAT. I had Red Curry with Shrimp. Yum.  SO GREAT. I had Red Curry with Shrimp. Yum.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xezeqU_U4ouYUS1BpO-zxQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. My beautiful daughter loves this place.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xezeqU_U4ouYUS1BpO-zxQ/o.jpg"
      },
      {
        "img_id": "nYDMBkg8B3hCErEgq2555Q",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Red Curry",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nYDMBkg8B3hCErEgq2555Q/o.jpg"
      }
    ],
    "user_id": "Lnp5qQ5_dpp49Ci7kWjIRg"
  },
  "0Q4ENRYHug76uQlypXS1sg": {
    "date": "4/25/2019",
    "text": "My daughter and I both got the Panang Curry, which was AMAZING!!  As you can see from my reviews, I eat red and panang curry in Thai restaurants when I travel.  I had the special with the fish of the day (Sea Bass) and my daughter had the seafood version on the menu.  I will definitely come back here!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Te0Xu6mAlJV0i7NIxDiAQ"
  },
  "resnooN8M3zbmsGccmSuPg": {
    "date": "3/29/2019",
    "text": "Went here tonight and ordered Duck Curry. What came out was gross. Not a thing in the fish that matched the description except pineapple. The duck was two microwaved and dry legs-thigh pieces that were so small they looked like a 1 pound chicken had produced them. Sauce had absolutely no flavor. And they were no tomatoes or basil but 16-20 pieces of broccoli, tons of carrots, and lots of little corn - none of which go into the fish. When I asked about it I was told the broccoli was relish for the dish.    They offered to remake. I just sent it back and had mango sticky rice with mango so tart and rock hard I thought it was blocks of lemon. So zero for zero tonight. Won't eat there again and DO NOT recommend. Avoid and go somewhere else. Less than 1 Star.   So why don't these restaurant serve what the dish is?  Truly they just throw old junk at you and see if you complain. What a ripoff.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "npiqEezAM7JA9V4xlphLsw"
  },
  "fbnuYcvR9f5jVxPmp7Plvg": {
    "date": "7/4/2019",
    "text": "I had a great experience at Deejai on Providence! Thai food is my favorite and until recently I had been frequenting another restaurant nearby. I think this place takes the cake however! The restaurant sits off of providence road and I wouldn't have known about it if it weren't for a friends recommendation. It's certainly a hidden gem. I ordered the pad Thai and requested level 3 spicy. The food was fresh and came out in a timely manner. BEWARE however, level 3 was pretty spicy in my opinion! My friends ordered the green curry, drunken noodles, and basil chicken. All of the entrees were full of flavor and delicious. I opted for wine instead of a cocktail but they offer quite a few cocktails. We sat on the patio and my only complaint would be that this area could use a bit of sprucing up. Regardless of that, I would give this place 5 stars. It's now my go-to Thai restaurant in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8rPaEC7Eh_xe43rdQPxW6g",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8rPaEC7Eh_xe43rdQPxW6g/o.jpg"
      },
      {
        "img_id": "m0LjmERZwW1wTUpcRCizPg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Pad Thai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m0LjmERZwW1wTUpcRCizPg/o.jpg"
      },
      {
        "img_id": "StXoilCgxdwdF0jRlWMTwA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Basil Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/StXoilCgxdwdF0jRlWMTwA/o.jpg"
      }
    ],
    "user_id": "aWXZ9elZ58HJlfyQS0yxmQ"
  },
  "XS9qPqzRbaNfPS9UyW6nXw": {
    "date": "10/7/2018",
    "text": "Spring rolls- fine, but not the best I've had. Sauce was disgusting.   Edemame- ok   Boston and spicy tuna rolls- my friend said these were the worst rolls she's ever had  Vegetarian with brown sauce- smelled and tasted fishy. Yuck!!   Tom ka soup with only broccoli- really Fabulous!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KHo3lc6SQmJtA1mUuGQLgw",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Tom ka soup with only broccoli- delicious!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KHo3lc6SQmJtA1mUuGQLgw/o.jpg"
      },
      {
        "img_id": "NWGcCE1l1PYpfcaB5ZZxNA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Vegetarian with brown sauce - absolutely disgusting! Smelled and tasted fishy",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NWGcCE1l1PYpfcaB5ZZxNA/o.jpg"
      },
      {
        "img_id": "X20UVsuV4HjbrPJqxBT1Mg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Boston &amp;amp; spicy tuna rolls - my friend said they were the worst she&amp;#39;s ever had",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X20UVsuV4HjbrPJqxBT1Mg/o.jpg"
      }
    ],
    "user_id": "T13IBpJITI32a1k41rc-tg"
  },
  "1bUnEn5Cbx5yiMDwInvxIg": {
    "date": "5/30/2018",
    "text": "This place has some heat! I like my food spicy and this place hit the mark. I got the mountain beef, it had a ton of flavor. I had never had it before and wasn't sure what to expect. I would get it again.   I also decided to try the Thai iced tea. It was different, was sweet but also had some spice (flavor not heat) to it. It was a great alternative to an alcoholic beverage which I typically get.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j0G649K9SVAmhki6pAhOWw",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/j0G649K9SVAmhki6pAhOWw/o.jpg"
      },
      {
        "img_id": "rk-sJZom3k9maFbzlihBfg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rk-sJZom3k9maFbzlihBfg/o.jpg"
      }
    ],
    "user_id": "p0a51bqoEPRhxPtieX_91A"
  },
  "YylI6txT5_a355ixfMSyXA": {
    "date": "7/31/2019",
    "text": "Great pad thai, great basil chicken, great curries, great sushi! My favorite place to get takeout in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-CshZA0cEDxQ0e9PForw8Q"
  },
  "CUeTs597gfTD0ytIgunYLQ": {
    "date": "6/2/2019",
    "text": "I love that owners refilled the planters at last. It makes all the difference in the welcoming feel of the the restaurant. Nicely done, Deejai Thai!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tY-zZ3MMBG7AF__8obdlXw",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. The newly filled planters at Deejay Thai are a HUGE improvement over the sad trash-filled planters that sat outside for so long.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tY-zZ3MMBG7AF__8obdlXw/o.jpg"
      }
    ],
    "user_id": "YkEhriZdM_eQ_ZMfob59nQ"
  },
  "UxPz5pmKUu_KsUhrDt5NJw": {
    "date": "6/30/2019",
    "text": "Deejai used to be my favorite restaurant. No More. The last 2 times I have been here it has been a bigger and bigger disappointment.   AMBIENCE  Today as we walked in, the place stunk stale. I saw that the thermostat was at 79. It took me (I kid you not) 15 minutes to find someone to talk to. The gentleman at the sushi counter did not understand English and so the lady standing at the reception instead of helping me directed me to our server - \"You are asking about the air? Please talk to your server\". I approach the server and she says Oh ya! Our AC is not working. No apologies. I ask if they have a room freshener and she says \"Just the one in the bathrooms.\" We stare at each other in uncomfortable silence and then I return to my table. No apologies. No \"I am sorry the AC isn't working. Let me look in the back if I have some air freshener.\" They were not even busy! We were the only people in there!   Now let's come to the SERVICE We have some dietary issues. Vegetarians who don't eat eggs - nothing unusual in this day and age. The server was Absolutely NO help in suggesting what we could get. We had questions about whether or not our sauce with spring rolls was vegetarian and NO ONE bothered to answer. The only answer we got was - \"I don't know\". The server didn't even bother to go into the kitchen and ask.   THE FOOD One of our dishes came with egg on top. The pad Thai was heavy sweet and flavorless. THAT was a major disappointment because Deejai used to have the best Pad Thai in town. The fried rice and the green curry were also average.   Overall- Not a good experience and I doubt I will return. The staff just did not give a DAMN about anything.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uXlBamOoX0GuHb-W47ADgQ"
  },
  "vRouwi1E18iBwHkhdWFMow": {
    "date": "8/23/2018",
    "text": "This is now my favorite Thai Restaurant.  Love this place! Amazing Thai food. Very authentic! Place is cozy and service is great. Definitely one of my favorites!  If you're unfamiliar with the dishes they will explain them to you and you can customize the spice level to suit your taste preferences.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SUNiu8HmVsnMBTOODfnf1w",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SUNiu8HmVsnMBTOODfnf1w/o.jpg"
      },
      {
        "img_id": "3QZSwJdB-scyESOSkI_DBA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3QZSwJdB-scyESOSkI_DBA/o.jpg"
      },
      {
        "img_id": "ikc55KRu4li9T96gSphFOA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ikc55KRu4li9T96gSphFOA/o.jpg"
      }
    ],
    "user_id": "BWMtteGOa6rntC1cc9dIDA"
  },
  "Q8fGr7Qc-KHlwkpJS0SDow": {
    "date": "2/10/2018",
    "text": "This had been on my list since I had heard it was one of the best Thai restaurants in Charlotte, so we finally decided to try it. Bonus: we got a Groupon for it.   For appetizers, we started with the spring rolls and pork sliders. I loved the spring rolls and the sauce they came with. I was a bit disappointed by the sliders. The inside was great, but they came on bao buns which are supposed to be soft and ours were very hard.   For our entrees we got the Spicy Lemongrass Beef and the Drunken Shrimp Noodles. Both were advertised as a spice level 3. I don't like really spicy food, but I thought the spiciness was a good amount. Neither of us liked the Lemongrass that much. You couldn't taste the Lemongrass flavor much. It was ok, but I wouldn't get it again. The Drunken Noodles were really good though. The shrimp was a little overcooked, but the sauce and noodles were a great combination. We both loved the dish.   We finished off with the sticky mango rice for dessert which I loved. My husband thought it was pretty good, but didn't like it as much as I did. The rice is what makes the dish -- it's sweet and perfectly cooked. The mangoes are a great addition. I wish you got a bit more ice cream with it though. It's a very unique dessert and I would definitely get it again.   All in all, I was a little disappointed compared to what I had heard about this place and I do think there is better Thai in Charlotte. I did enjoy it though and I would come back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B1Y4oV9da64_alS6rQVrRg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Mango sticky rice - amazing",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B1Y4oV9da64_alS6rQVrRg/o.jpg"
      },
      {
        "img_id": "pI24e4Bm-z-uhFRzl-z5lQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Drunken Shrimp Noodles - amazing",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pI24e4Bm-z-uhFRzl-z5lQ/o.jpg"
      },
      {
        "img_id": "IyHKtETYCZmycT9E13Rwfw",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Lemongrass Beef - just ok",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IyHKtETYCZmycT9E13Rwfw/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "x4-9k_9_gjwHSkihpsp36w": {
    "date": "1/2/2019",
    "text": "Disappointed.   It's very strange to me that the pad Thai here would be so different from their sister restaurant in Noda.  Heavy, sweet, and basically flavorless.   It was basically all noodles stuck together in a sweet heavy sauce.  Only saving grace was the shrimp.  Won't make this mistake again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "pcpeUWvktERfBUwyD3nOpg"
  },
  "xoS-TI4yfmEiTKjMmvst6g": {
    "date": "3/3/2019",
    "text": "WeIl I went back Saturday night and it was a lot better I got the red curry I can't say it was a culinary masterpiece but it was a good meal. The shrimp was pretty good. The restaurant looks really nice, service is great and the staff is really friendly. Saturday night the hostess was 100x times more professional. The chef definitely just makes whatever he wants as it's not traditional. My friend says it's a fusion but it just says Thai restaurant. Easy parking.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qL0zMJRDgA5OWW0S6CLlNw",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Drunken Noodles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qL0zMJRDgA5OWW0S6CLlNw/o.jpg"
      },
      {
        "img_id": "It7Zx6lARMgnqhoDUtejMA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Red Curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/It7Zx6lARMgnqhoDUtejMA/o.jpg"
      }
    ],
    "user_id": "lQMA0SMZAI7UfpUbuCcuBQ"
  },
  "JvRxHgfgCWU20elOAd8tfA": {
    "date": "12/31/2017",
    "text": "Met up with some friends for dinner.  This was my first time at Deejai Thai.  I have been wanting to try this place for a long time.  I was impressed with the food and will be back.    We had a few things and will highlight them.  Started with the spring rolls and bahn mi for appetizers.   Both were done really well.  The Bahn Mi had a lot of flavor.  The spring rolls were cooked to perfection. I would recommend both.  I had the panang curry with chicken for my main.  The portion and flavor were on point.  I had them take out the vegetables (just how I like it).    Service was okay to good.  They get so busy that everyone is racing around.  It's a good / bad thing.  Overall there were no issues but could have been a little better   The inside is comfortable.  The location has a fair amount of seating and the pack them in.  Nothing too bad but they utilize the space.  I think that there is a patio but not useful in the winter.    Overall the food is really good.  Service could be a little better but this is a place that I would go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XdKau7tc1MBYr_EN7TzTiQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Spring Rolls and Bahn Mi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XdKau7tc1MBYr_EN7TzTiQ/o.jpg"
      },
      {
        "img_id": "v3oarWXFNd6XW28EMUQq8A",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Panang Curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v3oarWXFNd6XW28EMUQq8A/o.jpg"
      }
    ],
    "user_id": "Ekw7wuUTX36BtcPP6XnA-Q"
  },
  "zQxBESzRkuTf7tP7CiTreg": {
    "date": "2/17/2019",
    "text": "You cannot go wrong with Deejai Thai. Their Drunken Noodles and Pad Thai are the best around. They tend to run a little spicier than other Thai places around, I recommend ordering a level lower than you usually would. Start with the dumplings, you won't regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eLhrgeQ7i5UVQTNpzmmptA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Hands down best Pad Thai in Charlotte!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eLhrgeQ7i5UVQTNpzmmptA/o.jpg"
      }
    ],
    "user_id": "PtUgCfuw6-nGFY1ihVlrcg"
  },
  "oEKDFJEr5TzS2NnIQs-MUA": {
    "date": "12/26/2017",
    "text": "Deejai has some of the best curry in Charlotte.  The red curry is the best, but the Penang is a close second.   I have had multiple sushi rolls (red dragon pictured) and the seafood is fresh and the rolls are tasty.  There aren't any sushi lunch specials so do expect to pay around $14 for a specialty roll.  The rolls are average size.     I recommend trying one of their lunch specials or getting a groupon/living social to make the prices more reasonable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "Zpzco1C3RXweYIzHCW3Y6g": {
    "date": "9/10/2017",
    "text": "Solid spot for a flavorful lunch or dinner! They're almost always running a Groupon or Living Social deal. So, if you pay full price, you're doing it wrong.   Consistency is a bit of a struggle -- I've had a grill beef salad one day that almost burnt the tastebuds off my tongue it was so spicy and then the next week the grill beef salad is so mild I had to ask for a little chili sauce to spice it up.   At lunch, they give you a cup of soup and some crunchy noodles on the house. They're also on Postmates, which comes in handy those days I can't escape the office. Oooooor, don't want to leave the house.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "E_SwdNFJQ_UwlWKx9SbBEA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Grill beef salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E_SwdNFJQ_UwlWKx9SbBEA/o.jpg"
      }
    ],
    "user_id": "eVxYV4jI-618bnRCDniowQ"
  },
  "_fkRC9PX_QcdRuoKIOpSWA": {
    "date": "7/23/2019",
    "text": "I order the Pas See U and crab Rangoon. The crab Rangoon was good but the Pad See U was so spicy I couldn't eat it. There was no flavor to it other than spicy. I asked specifically for it to be mild, so this was very disappointing. Not worth trying again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xP1ozR9F5YzpR9Cd-nFQwg"
  },
  "LLCDC99X9PPTFm00_BKWHg": {
    "date": "4/14/2018",
    "text": "Green Curry was tasty.  I wish there was more curry soup to spread across my rice.  The spring rolls were aromatic with basil.  The sauce was the best I've ever had!  The restaurant was small and cozy with a sushi bar.  That's quite different for a Thai spot but who doesn't like sushi these days.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oEt9BBgBVctZUoKZgHe7CA",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Green Curry w/ chicken to go",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oEt9BBgBVctZUoKZgHe7CA/o.jpg"
      },
      {
        "img_id": "RKV7_G13WK40T4fOt1XLag",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Basil shrimp spring rolls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RKV7_G13WK40T4fOt1XLag/o.jpg"
      }
    ],
    "user_id": "DaUJvHMmKoDDT3vB_ltJ6g"
  },
  "xwKGuNGniatiag6ZwWr4yA": {
    "date": "10/7/2018",
    "text": "I'm honestly so surprised this place has this many positive reviews because our experience was truly NOT good. Mediocre at best. Spring rolls were huge - which yes, was a bad thing. They were big and fell apart when you tried to eat them and they stuck to each other so they ripped and it became a mess. The sauce was unnecessarily spicy (and I like spicy but this was like... why). My husbands pad see ew was too chewy, the noodles were not the authentic ones, and my pad thai was flavorless and the veggies were undercooked. The mango sticky rice dessert was really sad - the mango was still frozen (they didn't use fresh mango!), there was a TON of ice cream which overpowered the entire plate, and the rice had a weird sour taste.  Honestly there was nothing special at ALL about this place. I would not go back, and I would not recommend. Its not going to be the worst meal of your life but it certainly wont impress you or make you happy or satisfied either.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "a9rhAZ5ceOCBG9wmf-iT7A"
  },
  "pZUOmFR59fpuGPPm3tB2dg": {
    "date": "3/14/2015",
    "text": "I went to Charlotte for a concert and went to Deejai before heading to our concert. The menu had a lot of great options, had good prices and the wait staff gave excellent, attentive service. I had the Pad Thai Chicken and it was one of the best pad thai chickens I've had. My wife had the pad thai tofu and she also described the dish as one of the best she's had as well. Whenever we are in Charlotte again, we will definitely check this place out again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zJuaWUWVqP36t7zPBMkTOw"
  },
  "6ltf8ZkrNz6neGdd6IWltw": {
    "date": "1/18/2015",
    "text": "Love this local thai joint. It is way less filtering of to go orders like Thai Taste on East. Great intimate dining space to enjoy some of Charlotte's best Thai! The service is top notch and the food is outstanding. I enjoyed the Pad Kee Mow with chicken (spice level 4 , +1 to the typical) and it was full of flavor AND heat which is rare! The chicken was no mystery meat. We also enjoyed the spring rolls - those were top notch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6f_uyaZZuHp-tG2Apks01w"
  },
  "gCS55q6lDDp_myxv1yFfBw": {
    "date": "5/11/2014",
    "text": "Food took over an hour to come out. Wasn't only our table everyone around us had the same issue. Food just takes way too long to come out not worth coming here avoid",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4daJkFupXNA7x2iJYwVasQ"
  },
  "7Wv3mm6Y-4gY7ev6rXAT5g": {
    "date": "12/6/2013",
    "text": "Hands down-the BEST Thai Food in Charlotte! Nothing even comes close. We moved here from Chicago and were used to very authentic Thai cuisine. We had almost given up on finding anything as good as what we were used to in Chicago. Deejai is amazing!  Great food, quick service, nice ambience.  Only con (if any)- desserts here are not that great. But who goes to a Thai restaurant for the desserts anyways??",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "qBQIcyRf7qRvd37PDGNIdQ"
  },
  "t0IMQIRjSJza7CD5HZ68QA": {
    "date": "9/12/2014",
    "text": "I moved here from San Francisco and San Diego (homes of great Thai food) and this is by far the best Thai restaurant we found in Charlotte. It's just as good as my favorites there. We have yet to eat inside the restaurant - we order takeout. The Pan ang Curry is just as delicious as my favorite Thai restaurant in San Diego. Also, the Pad Thai is delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iXui8UJGOGmm5WekS1ULIQ"
  },
  "bTFHTUfhtlAK9zVmOp50Qw": {
    "date": "9/14/2011",
    "text": "Thank you yelpers again for leading me in the right direction! Tom Ka soup was good not great, not enough heat and coconut flavor. The Basil Chicken was Amazing! Fantastic. The Shrimp Fried Rice was Excellent a bunch of plump Juciy perfectly cooked Shrimp! Great and Friendly Service! The bathrooms were very, very clean, this is a good sign of the kitchen as well. Keep up the great work!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "lf1m4CbheuUR7fFZoLGRvA"
  },
  "RacQ1uQjYq6_UhzyxF3h9g": {
    "date": "1/2/2012",
    "text": "Sticky, overly sauced Pad Thai? Dry, boring larb? Wet Pad See Ew with only broccoli?  Kitchen that closes at 9:40 and deep fried items can't be accommodated even at 9:30ish?  Not my idea of good Thai.   I remember having some nice experiences here 18 months ago.  After coming back twice in the past couple months, I've crossed Deejai off my list unless I need to go there and everywhere else is closed.   This past experience, my friends and I went at 9:30 on a Sunday.  We knew it was getting close to closing time-- but we just wanted to order some Pad Thai and our friends had a hankering for spring rolls.  Boring, but easy and something we could order quickly before the kitchen closed at 9:40.   After ordering, we were told the deep fryer was turned off since they're closed on Mondays.  (Wow, they must really have wanted to get out of work by 10pm or something if they shut it down already.) I didn't think much of it, (though our dining partners were somewhat miffed) so they ordered some sushi and we got larb instead.   To our surprise...15 minutes later, spring rolls arrived at our table!  Uh, okay!  Then we were brought the larb and sushi.  It would have been nice if we were informed the spring rolls would be coming.  The larb by the way was okay...but tasted like overcooked ground meat.  Not juicy or flavorful.   The Pad Thai was, as I said.  Overly sauced and sticky, as in it was difficult to break it apart even. We weren't asked for a spice level...so it came out with no spice at all.    The sushi was fine, nothing out of the ordinary, purely perfunctory.   The spring rolls were okay, but again, nothing special, and the sauce was too sweet, as mentioned by Yeye A.   The Pad Se Ew I had one take-out day was so liquid-y, it was as if noodles were cooked, and sauce poured atop-- not sauteed/wok fried at all.   Oh well, we tried, and now we know we most likely won't go back unless we have to.  There are a number of ways to get discount coupons to this restaurant (coupon fundraising books, at-home mailers, deal sites occasionally...) but even then, I'm not sure if I'd spend the money.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7M-rWYRGPfCDnb7tjl7QGQ"
  },
  "ZmMmdV1qo1G46g9Av3zkVw": {
    "date": "6/29/2012",
    "text": "Meh is exactly how we felt here.  The restaurant is lovely, so if ambiance is the most important thing to you then you might like it, but the food took a bit too long and seemed overpriced, and when my husband ordered his curry spicy it was laughably mild. I had a dish with fried tilapia and pineapples and other veggies, and while the tilapia was good the other stuff was overly sweet.  My mom liked her mango salad though, so it wasn't a total strike-out.  Also the staff was nice and attentive, and I didn't think it was their fault the food took so long. It's not a bad place, but IMO there's better Thai to be had in town.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "htzxDWzRt4Xd7UGy4t0yAw"
  },
  "ihzU3L6x6rqWi-REkJYygg": {
    "date": "9/26/2011",
    "text": "I took a friend who was visiting here, mostly because I found one of those buy one entree, get one entree on the back of the Harris Teeter receipt.  She's a vegetarian so I knew that Thai would be a great veggie choice.  Likes:  Quick service and fun local atmosphere.  Thai tea.  My friend got some sort of tofu noodle thing, I tried it, and it was delicious.  Dislikes:  I love Asian soup, so I got some sort of beef noodle soup.  The broth was really good but the quality of the meat was lacking.  As in, I picked through the beef.  I always eat everything unless it is inedible.  Take it or leave it:  Take it, but next time I would try stick with tofu or chicken, or something that's safer than beef.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "bjCJ3Pl5OTqGTb1BfkIm9Q"
  },
  "7PTeNbtLm3xd7p4gAxZWmA": {
    "date": "12/10/2011",
    "text": "My first 5-star review in Charlotte.  My wife and I stopped by for some take-out on a whim, and got an assortment of stuff.  We got Chicken Satay and some kind of Pad Thai just to see how they handled the basics.  Both were fantastic.  I think we also got some sort of light spring-roll with shrimp in it... whatever it was, it was great.  Everything was fresh and flavorful and interesting.   I highly recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8sMXH4sFKo-V-yBu7dXr7w"
  },
  "S-mE5SHd0r3DawF-qLlh4w": {
    "date": "4/21/2014",
    "text": "Deejai is one of the few things I crave, but once you've had the Pad Pak Ruam/Vegetable Lovers, you'll understand why. I always think I'll be able to save some to take home and end up eating the whole thing. Yum, 5 stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8MVkrrQu_r3N6DS2Ojf7BQ"
  },
  "Rj333ikeA8qb4mTkobdLFw": {
    "date": "9/20/2014",
    "text": "Top two best Thai restaurants in Charlotte, along with Basil Thai. Quaint little restaurant inside with not a lot of tables but you can usually get in without too much of a wait. My wife and I have tried a bunch of different dishes but the one I keep going back to is Pad Prik. It's got great flavor and just the right amount of spice. We've also tried some of the sushi and fish specials, most of which have been very good. Would highly recommend Deejai for anyone looking for top notch Thai food or a great date night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OoIwJMDmKUyEyUsPx5A9rA"
  },
  "fOZgdPlstA1ghTYdII7dtg": {
    "date": "11/2/2015",
    "text": "My favorite place for Thai in Charlotte.  A little more expensive than it should be in my opinion, but tasty none the less.  2 items that I always order when having Thai is Pad Thai (something easy to bench mark across all Thai restaurants) and larb - my favorite Thai salad.  Both are great at Deejai.  I usually ask for a little spice to be added to the larb as they make it very mild.  Curries have all been good - quality pieces of meat are always used (isn't it the worst when you have a curry and get a dodgy piece of meat?!).  Another plus about Deejai is that it's just as good if you eat in, take out or use a delivery service. While I'm not a fan of Asian places that do 2 types of cuisine (why not just stick to one and make it great) the Thai side of the menu does not seem to suffer.  I've yet to try the Japanese items because it's a Thai restaurant.   Ambiance in the restaurant is nice, dark-ish, usually a fair amount of people which would make it a nice spot for date night, but isn't overly fancy.  Worth a try to satisfy your Thai craving.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jyhFIDkB7uJWfH6NOZriLA"
  },
  "pZfi6k5kKxxy2qK4r6motg": {
    "date": "10/17/2014",
    "text": "The sushi and thai dishes here are amazing.  I love to get a curry dish with a request that it be a level 3 spicy, which is the spiciest.  The sushi here is amazing, as well.  I would definitely make a reservation on the weekends if you can.  There is usually a Groupon offer - $22 for $40 but they are currently sold out of those so that was a disappointment.  My boyfriend and I consider this \"our place\" because we went nuts here one night and everything was absolutely amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Byjn24Jhcq_Gl6QkjSdlPw"
  },
  "OS58J-ucG7GVBZ-jnuWSGg": {
    "date": "12/7/2011",
    "text": "From the outside, this place look pretty casual. Inside, not so much! Dress it up dressy/casual with your date to enjoy a moderate-priced menu. Our meals were tasty, and from scanning the other tables-- there were no disappointed faces!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KKIw0JbJuz6UKvcwTSlKMg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KKIw0JbJuz6UKvcwTSlKMg/o.jpg"
      }
    ],
    "user_id": "ydwT-Upq_C1s7XFlDmkzZA"
  },
  "u9NAZvHq2YCPXKTZiPG8WA": {
    "date": "2/9/2015",
    "text": "The quality/price relationship doesn't get any better than this family owned Thai restaurant.  Excellent place to meet with friends or a business lunch.  Service is always good, and the food excellent.  I'm addicted to Panang Curry (with chicken), I often have to force myself to order something else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-fWa5Y-rUGXEtQSKkclDAg"
  },
  "OVq-31IL54i1F65bVBF3ZA": {
    "date": "9/9/2015",
    "text": "I went for a dinner on a weeknight with my family, the place was packed. Excellent food and service. We ordered Shrimp and Calamari Tempura, Basil Fried Rice, Fried Flounder with sauce and Panang curry. Loved all of them. Prices were way better than Basil Thai. We would be going back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XeN9_t7CZp8apE_9R97jPA"
  },
  "Na94tKCoGD3J7FWYfaF_2A": {
    "date": "5/18/2011",
    "text": "Do you want a sweet date spot? Do you like your flavor (and spice) turned up to eleven? Then Deejai is the spot for you!  Let be break it down: The curry potstickers were fantastic. I ate the extra sauce with my spoon. The 4 dumplings they give you are the perfect starter to share. They weren't spicy but there was no mistaking the curry flavor. I had the Pad Ke Mao w/ beef made four stars spicy. I feel like I should have gone 5 stars (thats Thai hot with fresh chili) but even at that level there was t least as much kick as most Thai restaurants in CLT give you if you order the dish at the highest heat. The noodles were a spaghetti style instead of a flat rice noodle, but they worked with the dish and all the flavors blended nicely. I washed it all down with a Chang lager.  I must say I was pleasantly surprised about the pricing (ok, not surprised because i looked it up online first, but happy none the less). For all its high ceiling, low lighting, and modern swank Deejai's food is priced comparable to most other Thai places I've been to in town. My noodle dish w/ beef was $10 and the app and beer were $6 and $4 respectively. It's good to have found tasty Thai that doubles as a swoonworthy night out when the fella and I want to dust off our fancy duds without breaking the bank.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "FXPGGtOlCawxz5Uw5DNF3A"
  },
  "K12TEDYVkY5M94CanXGwoA": {
    "date": "8/13/2014",
    "text": "Awesome atmosphere, friendly staff.  Only reason I didnt give 5 stars is because the pad kaprow only had ground beef and not beef strips.  But that's more of a personal issue I suppose.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yTGEYE7tBfQpTII0VJX2DA"
  },
  "6Z0j5RXowDbITA1yFoWJlw": {
    "date": "4/4/2013",
    "text": "OK so my mother-out-of-law is a Thai nut... as a matter of fact the first time i ever ate Thai was with her in California the first time I met her... she knows good Thai and she loves this place and I continue to not be disapointed when dining there since she made this declaration.  The wine list is adequate, the service is acceptably attentive and the Thai dishes and the specials (which encompass all) are thoughtful and well prepared.  Tonight had the scallop green curry and though they were out of aubergine was still spicy and wonderful.  Tuna starter special was great as well with the perfect amount of seaweed salad.  Not really sure how to say one Thia is above another because I have limited expertise, but this place works like a charm for us!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "msRUiBE7Sa5A9145ZdFBow"
  },
  "pJjY-5Rs-O5JEfxZBq1BYw": {
    "date": "12/18/2016",
    "text": "My second time at Deejai was even better than the first. Great location, service, ambiance but most importantly, GREAT food. Would highly recommend the Panther Roll. Go 'thers. One minor critique. Staff members could be seen eating food and chewing while serving customers. Other than that, top notch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZd_dnnfvGdujkgWPai8tQ"
  },
  "a0ctRb9dypKTvIb24Bjsqw": {
    "date": "9/19/2016",
    "text": "Found a really good groupon for this place so my boyfriend and I thought we'd try it out. We are hugeeee sushi lovers and this place is soooo good! It's a realllly small restaurant but the service is good as well as the food! Definitely worth a shot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eMWrKyhlOc5NpCHRmgVTlA"
  },
  "7K-6bpM3M9DFxgVigpp6SQ": {
    "date": "9/4/2014",
    "text": "I've been wanting to try them after reading good reviews and needing to try as many Thai restaurants in my vicinity as possible!  :) I finally made it there tonight and the overall experience was just okay.    I tried the Pad Prik with pork and while it was spicy, it was otherwise bland. My girlfriend had the Thai fried rice and it was really good. The service was awful.  Our server seemed rushed when she did make it to the table and no, they weren't that busy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "RxmWo0HjcNJjaDmfNDgU8w"
  },
  "_MOc7o5hx0UxmCpQOu01Qg": {
    "date": "12/5/2014",
    "text": "The food at Deejai Thai is fantastic. Easily the best miso I have had in Charlotte. The vegetables are cooked just right. The sauces they use are great in flavor and consistency. Even the tofu is cooked perfectly, which you don't see too often. Deejai will definitely satisfy your craving for delicious Thai food. Also, they do feature a good selection of beers, wines, and sake.  It's nice and cozy on the inside. Though the dinning area is pretty small and so is the bar. It has an atmosphere for romance however you'll find you self to close to other dinners to really get an intimate feeling. The place is usually packed for dinner and rightfully so.  It is far from the most affordable Thai in town so I wouldn't recommend using if for take out unless you have a lot of money. It is a good place for close friends, family, and lovers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2gBnpLchnstAV9DvhczYew"
  },
  "lQi3MKNuBNoQZv_-1EKKqg": {
    "date": "9/13/2014",
    "text": "Where should I start. Ok my boyfriend and I had been there before so we know what we likes. We order sushi and pad thai chicken but we had a different lady waiting on us. So she went and put in the order and the sushi is out first cool no problem. Than I waited until she come over and I asked about my pad thai and she asked me \"oh u order pad thai too\" Yeah.. so we already done finish our sushi. Later our pad thai is out.  So by now I'm already full so I ask for the check and box. We used groupons AND I feel like she had an attitude with us using coupons. My reasoning is that she didn't speak a word to us after my boyfriend handed her, his phone to use coupon.  If y'all don't like guest to use coupons than don't advise it on groupon. I mean im NOT sorry for the fact that she didn't get my order right because she didn't write it down!. But we still gave her a 20% good tips after all that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2jKgN671MiZqepekuZvLfg"
  },
  "5RgK-2L8oCw3DQhT8IqqFQ": {
    "date": "7/22/2016",
    "text": "First wanted to say, the food has phenomenal flavor, came in last night, ordered pad see ew, pad thai, thai fried rice (one of the best i'd ever had), and fresh basil rolls... Only issue we had was on the Pad Thai... I would definitely check your limes out, because the one that was squeezed on our dinner entree was extremely bitter, and totally ruined the pad thai.  Typically, when trying new thai restaurants, I'll get an order of Pad Thai to get a good feel of quality.  While the other dishes delivered, this one failed to hit the mark. I did contact the restaurant via Facebook and was unable to garner a response.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wdbwvN-fJSTTdo8mVlCVcw"
  },
  "ye7iK1iJsFvKn9rdXVOeMw": {
    "date": "8/13/2016",
    "text": "Duck curry is really good although expensive ($22). Nice place to have a nice experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JzObnFqqvapuzCA1eyvJNw"
  },
  "OijiTPEhgo_mNo_Jdw1-cA": {
    "date": "9/13/2016",
    "text": "So first pulling up I see a really amazing place and instantly had me hooked. The staff was very nice and very informed on what each dish featured and how it was made. I had a wonderful meal especially the Penang curry which blew me away. I was truly amazed by this place! The only con I would say is add a little more salt to the dishes but other than that it's a great place to eat. Bring the entire family if you want because it's very friendly!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bGR6bf5FUyVF3j8zP9Rs5Q"
  },
  "4f5_aG6zbYQ63Ik_sZVf2Q": {
    "date": "9/13/2016",
    "text": "Top notch service paired with an excellent menu. I'm a huge Thai fan and this place just rocks all around. The atmosphere is perfect and the staff is super friendly and ready to accommodate. Can't wait to visit again!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QDBJVzG-GXC0olzwS_tZlQ"
  },
  "wRrUt8J1ddGaxswnfR05tQ": {
    "date": "9/13/2016",
    "text": "Love this place! I've never had curry before and was afraid I wouldn't like it because I don't like spicy but it was GREAT and the heat was palpable. The service was awesome and so attentive. My server was so excited for my first curry experience lol. The ambiance was nice. I'll definitely be returning and drag my friends along with me- and I suggest you do the same!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HkbNRiUWUOxWZu78OH8PAw"
  },
  "2BAdh--k0WKCa-rkcSNwCA": {
    "date": "4/9/2016",
    "text": "Awful service. Rude hostess. Rude waitress. If you want to clear your dining room out by 10, DONT seat people at 9:30. I'll never return. There are way too many great Thai options who want to serve customers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OQT9DjfBrzrwOEdVJjuYIA"
  },
  "YPUuxF0b90iW8wK6L518Sw": {
    "date": "9/15/2016",
    "text": "Great food, friendly staff and an all around great place to go for lunch or dinner! Grab a friend and take a chance! You won't regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VTVQeyS0cVtC4l_G5ahjwg"
  },
  "ZNqhACdFj_74loqpxvxAQw": {
    "date": "9/7/2014",
    "text": "Always thought it was an Indian restaurant for some reason. Excellent spot. Great ambiance. Fresh sushi. Great Thai. Check it out.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3BnlEdnKEfyZ0wHw5F4Kow",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3BnlEdnKEfyZ0wHw5F4Kow/o.jpg"
      }
    ],
    "user_id": "Wz6nekYXj4wZ39UKgaVHJA"
  },
  "Z3vCJuyMiazvBPQUTqBp_g": {
    "date": "12/23/2013",
    "text": "Let me start off by saying that the food here was very good and if I just had to judge them by food I would give them 4 or maybe even 5 stars. We ordered the green curry with scallops and eggplant, the Pad Prik and the basil rolls. Everything was delicious! The green curry was mild yet full of flavor. I think they have at least three different kinds of green curries, but the scallops one was good, especially the eggplant part. Usually eggplant (if not cooked all the way) makes my tongue itch and I've heard it happens to a bunch of people, but theirs was very well made and I felt nothing but bliss on my tongue. Careful with the Pad prik though, it can get spicy. If you are not very good with spicy, you might want to ask them for a spice level 2 (default is 3), but I would never make the mistake of making it 4 or more unless you KNOW you and your insides can handle it. The basil rolls were really good as well. All the flavors melded well and the sauce was not too peanutty. Someone else from our party had the mango pudding with rice for dessert and were really happy with it. They said the mango had a very nice flavor. The ambience was nice as well.  My only problem was that these guys don't have a baby changing station despite having a big bathroom. We had a four month old baby with us who needed to be changed so I accompanied her momma to help out and was very surprised to not see a baby changing station. The bathroom was big enough to fit one in, but nope. We had to lay the baby down on the floor (of course we put a changing mat under her) and it was just weird for her mommy and I to be squatting down by the toilet, trying to change her up while she kept wriggling around and flailing her hands off the mat on the bathroom floor. Normally I wouldn't strike down the stars to three for not having a changing station, but last night's experience with a baby and us on the bathroom floor was just not a nice experience at all. Also, the server took forever to bring our checks. We were just sitting there for 10-15 minutes after we finished out dinner and the plates were cleared, just waiting for the server to bring us our checks. I'm not sure I would go here with a family again, but for date night it might be good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q83R2UssCoErEJX36wrlvg"
  },
  "0u3EtABerQZFjtf6Lxeh5Q": {
    "date": "7/11/2014",
    "text": "Darn they're closed today:(( Guess 3 days after July 4th is still a holiday..........,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zkSGfPLZ8WuE1ZzfAP_qEw",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Great sushi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zkSGfPLZ8WuE1ZzfAP_qEw/o.jpg"
      }
    ],
    "user_id": "f7egihM45a2bYT3VS-39sA"
  },
  "vjw48hIq2Sn15EPksEZgMQ": {
    "date": "12/28/2013",
    "text": "I met a co-worker at Deejai Thai for lunch on the way to a meeting.  We met at noon and were seated right away.    We both decided to order Penang Curry w/Chicken. The service was super-fast and the food was very good.   I would definitely eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "SvXH7ddPRbA8fGULiv7z6w": {
    "date": "6/6/2009",
    "text": "When I think Thai, I don't expect upscale. Deejai Thai has put a twist on the typical family owned Thai restaurant. The atmosphere is modern, fresh, and slightly upscale (many of the patrons were dressed nice, shorts and flip flops were the exception).  The service was friendly and attentive! In addition, the presentation was fancy (again, this is based on other Thai dining experiences). The quality of the Pad Thai was disappointing, but the Pantang was good.  We spent approximately $25 without drinks. I recommend it for a \"fine dining\" Thai-style experience, but not necessarily for delicious Pad Thai flavor.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6AbOr2I284XhAaZJnSBCrQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Pantang curry",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6AbOr2I284XhAaZJnSBCrQ/o.jpg"
      }
    ],
    "user_id": "Reuq65EOFI938Yg8xgff9g"
  },
  "Or7raaiLArSlUw81aiI_vw": {
    "date": "7/2/2017",
    "text": "A Tsunami roll is well worth the drive from another town.  Absolutely delicious.  We had basil rolls for our appetizer...very good.  This is my favorite Thai restaurant in Charlotte...The food is beautifully presented and every dish I have tried has been good to outstanding.  Lovely restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-jjD_H40FF18z94XKgJI8g"
  },
  "g3qTojB3dmJQLK4DcsuJ8w": {
    "date": "3/24/2016",
    "text": "Great & fast service at peak hour. The basil rolls were delicious. Thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zeZMcwMpW9YNAY7wPlmGoA"
  },
  "26eBv9ljh5kNCcA5I-cB2A": {
    "date": "4/28/2016",
    "text": "Awesome flavor; big portions to the entrees; great ambiance and service. We were a group of 4 and we all had something different. Each dish was outstanding-and it came out REALLY fast. I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GWe2_62xPQ0hLj67_NQ6zQ"
  },
  "lSn6x0hPJtNPhSZQm2i39A": {
    "date": "12/10/2015",
    "text": "Awesome!  This place was a StumbleUpon via Groupon.  I was having wine at a nearby swine bar with a friend and we were naturally hungry shortly after the event.  We did a Groupon for whats close and whalla! This place showed up.  We went and were promptly seated; that was a bonus since Groupon said to call ahead.  The service was good, nice atmosphere and clean bathroom (very important).  The Food OMG!!!  This was the best curry dish I have had to date (and I make curry frequently).  I had mine with the roasted duck, which was crisp to perfection.  We enjoyed it so much we bought another Groupon for 4 this time; we went back the next day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wpZ-aszsMc61-cGKLv-wUA"
  },
  "rFjUTIhdkCz616FQo_HYuw": {
    "date": "11/17/2015",
    "text": "Service is very slow.  Prices are a little outrageous, especially the sushi! I didn't try it because of the ridiculous prices.  My food was just a little boring, nothing special. My dessert was very overpriced and not how I had it before at other restaurants.  I got the mango sticky rice, and it was dry and dull. Probably won't come back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "E1tWEn11LHvmt6oxmQ7U9A": {
    "date": "12/28/2015",
    "text": "This restaurant was highly recommended by a friend who had eaten here about three years ago. As a party of two on a Friday night I expected there would be a crowd and I was told it would be a 20 min wait. Little did I know this would translate into an hour waiting in line. We told ourselves it would be worth it given the good reviews we've read of \"authentic Thai cuisine.\" Unfortunately this was also not the case.  While the staff was quick to run our orders, the food came out less than what we expected. We paid almost $20 for crispy duck in a curry sauce and got a tiny little duck thigh that didn't even taste anything special. The sauce was bland, hardly meeting the flavors it boasted on the menu. The calamari also had the same effect. While the food overall was cooked fine, it was not even close to the authentic dishes my partner and I have tried in smaller (hole-in-the-wall) Thai restaurants from Charlotte.  If you have a craving for Thai cuisine, it may be best to look elsewhere. The price and the wait is not worth the fill.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2fcAEP0dH4sPoxVYlAUkpw"
  },
  "wz7EfbpuVD7m9pF5G4nS5w": {
    "date": "4/15/2011",
    "text": "OK, a few of my foodie friends are obsessed with Deejai and I just didn't get it, well I got it today at lunch. YUMMMMMM. We ordered a lemongrass, ginger beef, green curry chicken, and a spicy ground chicken dish. Of course, I ordered my green curry spicy, it did have a kick but it wasn't as hot as the other dishes on the table. Everything was delicious and the portions were huge. A little one star addition for this cute, modern establishment.   Deejai also offers a private dining room downstairs that can accommodate up to twenty people and outdoor seating. It's on my radar now.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "zG_LQ0jQCHkan0vjhylslw",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zG_LQ0jQCHkan0vjhylslw/o.jpg"
      },
      {
        "img_id": "x9h7bccfsoCESo-86EEclg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x9h7bccfsoCESo-86EEclg/o.jpg"
      },
      {
        "img_id": "PdXVZH4qkxZXnNga8k-gaQ",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PdXVZH4qkxZXnNga8k-gaQ/o.jpg"
      }
    ],
    "user_id": "Bsbumyr3Of8BauN2URK4bg"
  },
  "U3FnuI_AmFDzqg627PxmeQ": {
    "date": "7/8/2015",
    "text": "There are better Thai restaurants in Charlotte. Deejai is overpriced and the quality is subpar. The larb ($8.99) has a nice lime tang (but no heat, even though the menu said it is a \"level 3\") but it is served with a quarter of a head of cabbage. The menu specified that it is served with lettuce. The cabbage is too thick, stiff, and too bitter to make cups or wraps.   The Tom Yum ($12.99) is the worst I've ever had. There is a disconcertingly strong beef flavor to the broth, and there is no lemongrass flavor at all. This soup is supposed to have a bracingly fresh yet sour flavor profile but it is just unbearably salty. After a few sips we threw it out.  The reason I give Deejai more than 1 star is because the Panang curry with chicken ($13.99) tastes good. It's fine but not special, and the portion is so small. In the takeout container the entire amount took up less than half the space. There was not enough to share between 2 adults. The rice is most definitely not \"jasmine\" rice. It was no different than supermarket long grain.   Disappointing.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WHBzVnZi-wUoKJyfVK7zgA"
  },
  "PHXqZ1ggoKmzs6HaVQmBzw": {
    "date": "12/12/2016",
    "text": "Decent Thai food! I tried the panang curry and crab rangoons. I liked the curry because it wasn't spicy, but I would have liked it more if the vegetables were more cooked. Altogether it was a good, hearty meal!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L8FuNbxOIAjUwv_RkRbR9A"
  },
  "TJg3dMOGd2FGeJUrlZkHQQ": {
    "date": "1/21/2017",
    "text": "Best Thai food spot in charlotte. I've been going here for at least 3 years and I am NEVER disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZawcH6PweAxoKfMZ2VctFw"
  },
  "0LX_uhaSLEJrzp3kLXG8uA": {
    "date": "7/22/2015",
    "text": "Been here a few times. My BF usually gets the chicken pad thai, he likes it. A little sweet for me though.  I've had the larb, not bad. Tonight I'm having the basil fried rice with chicken. It's fantastic. Tons of firm veggies, just enough spice and the thai basil gives great flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ibUCNfiS-Rc7zopT8OFjHA"
  },
  "BwwvdIdcDPSOsP4-LP6Mbg": {
    "date": "1/16/2017",
    "text": "You know.  I just wasn't that impressed for some reason.  I may try again (might've just gotten the wrong thing (I got chicken with coconut sauce)).  I'd recommend it to someone, but if throw in caveats/disclaimers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v9FT1O5vdOHlzOYpyc-Y2w"
  },
  "cCgOdK1uwXUmLehpsVyo4w": {
    "date": "9/13/2015",
    "text": "Atmosphere is nice. Server was nice. But I got the drunken spicy noodles and it was not spicy at all even though I asked for it to be more spicy than 3 stars. I liked the udon noodles but it really lacked flavor. We got the Tom yum with seafood and it was warm not hot. Huge chunks of tomatoes in it and hardly any seafood. I definitely wouldn't get that again.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "da9gmVxOvYzNyS1CGYTiTA": {
    "date": "11/14/2015",
    "text": "I recently moved to Charlotte and decided to check out Deejai Thai.  I live nearby.  It always is crowded when I pass by and has excellent reviews on Yelp...so I had high expectations.  I really do not understand the fascination!  The food is really mediocre at best.  I had the Basil Rolls for appetizer.  Basil rolls are supposed to be refreshing and flavorful with lots of texture.  These were similar to eating wet newspaper.  No flavor and just mush. Yuk.  I had the Spicy Eggplant for main.  Again very disappointing.  The eggplant had some heat but had a very weird aftertaste.  It was not very appealing.  My friend had the Pad Takrai (lemongrass stir fry).  This was not very good either...totally lacking in flavor.  It is very pricey for what you get.  The service was very good and the ambiance was decent.  However that does not make up for the food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HKPdEatcYoEfOL8MEKsWOQ"
  },
  "Y4JqSFlmwNlIybGkKtE7bQ": {
    "date": "6/25/2015",
    "text": "The place is so clean and the staffs are nice and friendly!  I love their basil friend rice! You can choose your spicy level and I usually get 3 and its the perfect amount of heat and is so good! My husband always gets the basil beef and he loves it! The portions are a bit on the smaller side but the flavors make up for it!   Keep up the great work =)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-Fk2xynnzYxOK1EhJ4-Sg"
  },
  "eAaC0m01ekNiNS-5TCNbHw": {
    "date": "1/12/2015",
    "text": "This is the best Thai restaurant in Charlotte in my opinion. The Panang Curry is amazing. Everything is cooked perfectly from the veggies to the protein. The sushi is really good too. I had the Red Dragon roll and it was a great start to an amazing meal. Not the biggest restaurant on the inside so I would strongly suggest making reservations. Also, this place is on the pricier side as others have mentioned but it's well worth every penny. Good service and great food. I will be returning soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cb8epxGMdlTEIMF4xxmAxg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. Red Dragon Roll",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cb8epxGMdlTEIMF4xxmAxg/o.jpg"
      }
    ],
    "user_id": "aihRtdsX5RXWxgKmPGG1xw"
  },
  "8ze-8zfxe0QMIFk-2mN_Mw": {
    "date": "7/30/2013",
    "text": "I always forget Deejai Thai exists because it's tucked away next to the Manor, but it popped up on my radar screen one Wednesday night, and away we went.    I like going to Deejai a little bit later on a weeknight because parking is easier in the strip mall lot, and when it's full, it feels full.  Honestly, the crowd usually makes it or breaks it for me.  The night we went most recently, it was about half full and felt energetic, and I didn't feel like I needed to scoot my chair all the way in til it hit my spleen to get some room.  However, I do love that it's dark and romantic... because then I don't have to wear makeup.  The service was prompt as usual, and I got the chicken pad thai ($12.99) while the fella got beef pad see u ($12.99).  Since it was a Wednesday night, one of their bottles of wine was half off, so we got that, too!  I was in the Clean Plate Club after about 20 minutes of inhaling my dinner, and the fella said his was good but mine was better.  I really need to do a better job of remembering that Deejai is out there.  Now if only I could figure out how to pronounce it...",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QmethzRyAvZXS9m1UNJpdw"
  },
  "tVfe1KnKL4btLO1U-9E2eg": {
    "date": "3/16/2013",
    "text": "Mom treated me to a birthday lunch yesterday.  We beat the lunch rush since we got there around 11.  Nicely decorated, cozy seating.  It looks like they also have a nice outdoor patio seating area when it's warmer.  Started off with complementary chicken rice soup (although the menu says free soup or salad with dine-in, we were not given the choice) and those addictive crunchy fried noodles with the sweet chili sauce.  Of course we ordered Pad Thai to honor the tradition of eating noodles on one's birthday \"for long life\".  It was yummy with the jumbo prawns.  We also tried the Pad Prik with seafood, but turned the spice dial down to mild. The second dish was just okay, and there was a higher proportion of rice to seafood and veggies.  We both split each meal and had enough to split a second smaller meal the next day.  Service was fast and friendly.  I would not mind going back to try a meat dish or their dinner menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PoYY1CAGOx4dkNgOP1zQHA"
  },
  "LImwex2wr8Dp9vrg1jdvew": {
    "date": "10/20/2016",
    "text": "Ordered Beef and shrimp pad thai. The shrimp were huge!!! The pad thai seasoning was excellent. The best pad thai ever!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cEmN96cb6jg5Y9U0HhThdg",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cEmN96cb6jg5Y9U0HhThdg/o.jpg"
      }
    ],
    "user_id": "jJD0NyZD0aMGmRlMqk0dRA"
  },
  "w3a38BISxlfLcYxTPnqtaQ": {
    "date": "11/14/2016",
    "text": "Ambience and food was great. Waitress was very friendly. I will be back. Drunken Noodles and pork belly appetizer were great",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6nnwIt5RM2NPUFx0Or5pA"
  },
  "D_jzjQtpDJTK5Eczl7PVuw": {
    "date": "7/12/2014",
    "text": "Went here for dinner with a group of ladies.  Love the expansive windows in this place.  Nice wine selection available, and our drink orders were taken quickly. Being a vegetarian typically makes ordering easy for me at most restaurants.  Not here!  The choices were nearly infinite.  I asked our server to take orders at the opposite end of our table while I struggled to make my decision.  When my friends had finished ordering, the server completely forgot to ask me what I wanted.   My indecisiveness almost cost me a good meal!  I called her back, and we all had a good laugh. I got the spicy lemongrass because my friend Jeff had it before and loved it.  I somehow overlooked the fact that it features green beans, which I don't care for, but there weren't that many.  It also came with onions,  bell pepper, Thai chili and basil.  I requested tofu as the meat.  It was served a \"3\" which is Thai spicy.  It was delicious, but I still needed to add hot sauce.  I love to give my tongue a good slapping! Great experience.  This is a repeater!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "Wus7S9rFi7xYxmNgFm0UOQ"
  },
  "e442PyqSNU-SqBZYr2vakg": {
    "date": "8/9/2010",
    "text": "We visited Deejai Thai for the first time this past Saturday night.  We were immediately impressed by the space inside.  Although it's basically one big open room, it doesn't feel \"too\" open.  I don't know if it was the low level lighting or the arrangements of the tables or what, but we liked the modern feel.  When it gets cooler out, I'd also love to sit outside in their fenced-in patio; it looks inviting.  I started with a Thai iced tea to drink.  I was only introduced to this drink a few years ago, but I immediately fell in love with it.  If you've never had it, give it a try.  It's not like any iced tea you've ever had.  It's sweet, smoky, and so flavorful.  I have to try to limit myself to just one glass, though.  I can just imagine the calories in it.  I get excited at Thai restaurants when I see cheap basil/summer rolls.  Deejai had 'em.  For starters, we tried the basil rolls (2 for $4) and crab rangoons (6 for $4).  Both were SO GOOD and balanced one another out, temperature- and fried-wise.    I had a difficult time deciding what to order for an entree.  Everything sounded delicious and were equally reasonably priced.  I went with the Pad Prik.  The menu description had me at \"Oooooh! This is so spicy...\"  You can get it at your preferred level of hot.  I went with \"Thai Hot,\" which is the hottest you can get.  And, let me tell you, it was definitely hot, even for me.  My partner said, \"I don't think I've ever seen you eat anything that was too hot for you.\"   However, I'd probably order it that way again next time, too.  It was full of flavor and spice.  Thankfully, I always had plenty of Thai Iced Tea or water.    Would we go back?  You bet.  It was the perfect first experience, the food is fantastic, the atmosphere is enjoyable, and the prices are affordable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3FtRspvg1h-r_EKvR2cuIw",
        "caption": "Photo of Deejai Thai - Charlotte, NC, United States. The Dining Room",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3FtRspvg1h-r_EKvR2cuIw/o.jpg"
      }
    ],
    "user_id": "_uqIpl5tzucKuIlZZPBZRw"
  },
  "cgfWkyB0_WW0Oxz9Mpa3Pg": {
    "date": "6/1/2015",
    "text": "Worst fried rice ever!  Rice had the consistency of pudding  Also tried their sushi which was very flavorless.    Will not be going back",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fP4jxSxoaWdWRk-oxTbyZg"
  }
}