{
  "6ErQxZvv1b-YWafy3EiAoQ": {
    "date": "11/6/2017",
    "text": "This place is small, intimate, and absolutely delicious. My husband and I went last night to celebrate our two year wedding anniversary. After casually mentioning it to the server that it was our first time here, the owner came by our table to chat with us and welcome us. I had the seared scallops with sweet potato hash and my husband had the seafood pasta. We both enjoyed it very much. For dessert we enjoyed the chocolate pot de creme. Delicious! On our way out we even got a congratulations from other diners surrounding us. It was the perfect anniversary dinner. Definitely recommend this place and we will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uVsMlXcK34VqGYFMQMLzEw"
  },
  "FEMGCNGx5Qe33O4H9iv_Wg": {
    "date": "8/13/2017",
    "text": "Nice place for brunch. Downstairs in the Shopping Center, it's tucked in the corner. Food was good quality and prepared well. A little on the pricey side as my Monte cristo sandwich was $12. Crab cake Benedict was $18.   Service was slow as they were understaffed and quite busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XHn1VRAW_vThZ_nPg7pDkg"
  },
  "LWCKL8kPAK4wzQv9HpItUg": {
    "date": "3/29/2018",
    "text": "The service was good and friendly , but food was just ok.  (For the ambiance, I liked the chairs - comfy and practical. Setting would be more intimate if the walls were a darker, warmer color). Mixed reviews amongst the group on dinner. French onion soup was luke warm, hanger steak bland.  Scallops got positive marks.  Good selection at the bar.  This is a tough location.   I hope they can get the menu figured out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6TFZfnKTe5qsO5MOp6nZng"
  },
  "YlVBoxAbcwb03InJ94ECRw": {
    "date": "6/18/2017",
    "text": "Went here for Father's Day today, they take reservations which I really appreciate. Food and service were both top notch. Me and my dad got the shrimp burger which was incredible. The bun was perfect and the shrimp were seasoned perfectly, the whole thing just worked. It was like a fancy po boy and the shrimp were nice and large. Grits were good also, and everything else we tried was really solid. Service was nice and friendly and just the right amount of tentativeness. We will definitely be going back as the cocktail menu is quite intriguing. Ambience is very nice and I like the small size of the restaurant.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qiic0fc2PTjh_tLAGgYGaQ"
  },
  "aRYdcr5yVIRYnWaOniAaeQ": {
    "date": "9/23/2017",
    "text": "We've been here 4-5 times now and have received exceptional service each time, and really enjoyed the food. The French Onion Soup is fantastic. The burgers, wings, and all of the salads are delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g1rMTTcve4DG71k7v6yUZQ"
  },
  "td-AzJXqztiALtbP9tk_Kw": {
    "date": "3/11/2018",
    "text": "I am not sure how this place has a 4 1/2 star rating. We went for brunch last Sunday (had a reservation) and it was very busy. We were seated and ordered drinks and then the wait began. It took one hour to get our food and when we did, my quiche was burnt to a crisp, I received the wrong side dish and I had moldy blueberries in my fruit. My husbands shrimp & grits were just ok... nothing to write home about. Our waitress was kind and management removed my dish and drinks from our bill. I won't be going back...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bGInRT4nEChEKov9KyIEyg"
  },
  "4nfOG6-IcO3cq8d7dKqtJA": {
    "date": "9/5/2017",
    "text": "Sam and Brooke were awesome .. the food was excellent . We had Shrimp , Burgers and Pork Chop ! Everything excellent cooked very well !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0LzaaoQ4zsxr8M-yp3yAKQ"
  },
  "C3X6dYb2hjO4XssSXbi3sQ": {
    "date": "4/25/2017",
    "text": "This place is incredible! The food is soo good. It is he perfect restaurant for girls night, date night and family brunch! Yummy yummy yummy!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "El8rbjuKI-aA95lek8Qc1Q"
  },
  "Qt0ZeRB92y8IRlYwOuRU-g": {
    "date": "8/30/2017",
    "text": "This is such a cute neighborhood restaurant! I would hang out here a lot more if I lived closer! It was not very busy on half price wine Tuesday so I hope they are doing ok business wise! Service was great and I had one of the tastiest sandwiches EVER! Order the SalmonBLT and you won't regret it...fries were perfect!! Will definitely return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTnErcGQOILFmDYFz3FOIw"
  },
  "RHrJfFtMFOFqrVc6TBFDHQ": {
    "date": "4/22/2017",
    "text": "Nice spot!  Great drink list and the food was excellent!!  I had the salmon BLT and my wife had the burger. Pair with a beer or craft cocktail and you're set.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ysqgOPRMJ7oeGMHnAklpjw"
  },
  "pF4qRJq4_iKwExgTCbxQxQ": {
    "date": "1/20/2018",
    "text": "Once we found this place we were glad we did!  It is a little hard to find the first time (tucked around the corner on the bottom level). The staff was very friendly and helpful. The food came out quick and was delicious!  We had the duck confit flatbread- wow! It was scrumptious!  I had the salmon. It was cooked to perfection! My husband had the short ribs. Very tender!  For dessert we had the salted caramel apple bread pudding. It was the perfect ending to a wonderful meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5xVP0-MeRypAMJTtoGrfpw"
  },
  "XM78q10Efp3SHlnmSjqZQg": {
    "date": "11/29/2016",
    "text": "Really enjoyed my experience at Turnhouse Grille. I live nearby so I popped in here by myself for a glass of wine and potential take out order.  Small place but very cozy and great decor. Sat at the bar which was full on a Tuesday and ended up ordering the Salmon BLT with side of sauteed spinach. So delicious! Brooke behind the bar was a pleasure - very welcoming. Also this Tuesday was 1/2 priced bottle wine night. Definitely check out the turnhouse grille!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zXXs8vyr3tPPEoXCeonLYw"
  },
  "6-5nXbPoVVlTDgesafbWJw": {
    "date": "12/19/2016",
    "text": "The Turnhouse Grille has what a lot of restaurants in Charlotte are missing... personality and memorable food! Turnhouse is locally owned and staffed with people who genuinely want to be there to make your experience memorable. John and Katie regularly tend bar and and will amaze you with their creativity, homemade bitters, and signature drinks and Sam is there to greet you with her smile and knowledge of the menu. The food and is simply spectacular and the kitchen staff is spot-on with their creations and presentation. My favorites eats are the Shrimp Burger, The Hef Wings, Salmon BLT, and the Pork Chop. I'd wake up from a coma to eat that Shrimp Burger!!! Simply delicious and friendly place to hang out with friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cHWASeLjyPpQIVTBs87qwA"
  },
  "q4HZJ5FJh3ykdgTxuRTs3Q": {
    "date": "3/25/2017",
    "text": "Quaint place, it is very small but the food was delicious. The Scallops with sweet potato hash is outstanding, pork belly appetizer really good but the mussels were lacking something. The sauce was bitter did not have a lot of flavor. They do take reservations definitely make them if going.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "62EnRhDOr6lO0xVtNWgoow"
  },
  "InohyUEYGFaDqhD-CSv7BA": {
    "date": "5/21/2017",
    "text": "Great dinner! We started with the short rib flatbread, which was delicious with a glass of Oregon Pinot. I had the short ribs dinner and my husband had the salmon, both were great. I highly recommend this place and will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XxbBYvOeKwEgdR7FyUbx8Q"
  },
  "d3CnvI33ZDT4RStK8U91mw": {
    "date": "5/19/2017",
    "text": "The Turnhouse Grille is a great addition to ParkTowne Village.  It might just be the best food in the shopping center!  Loved the small menu, as I felt our meals were prepared with thought, and the attention to detail was top notch.  I would highly recommend the scallops and salmon under the entrees.  The braised short rib flat bread is to die for and I cannot wait to eat that again, soon!    They have an excellent signature cocktail list.  I enjoyed the Spicy Booty Loop.  On Thursday nights, the signature cocktails are $8.  The staff was extremely accommodating and friendly.  They could not have made us feel more welcome!  The Interior was clean, updated, and modern. They have a great large round booth that seats seven --who doesn't love a round table?  Needless to say, I will be back for more!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LbazvWSHAATmrgxvrOuERA"
  },
  "7VEx-eO3nb4zT03Pjgs4Ww": {
    "date": "4/19/2017",
    "text": "Cool spot, haven't checked out the food yet, but great drinks and they did a nice job on the remodel, these guys are professionals",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eEZhL2pjp7gyqOTSy-DwyQ"
  },
  "8_2TlsA-OgtcK5FVlGAaxA": {
    "date": "5/26/2017",
    "text": "This is a hidden gem in my neighborhood. The food is amazing! In a heavily foodie haven this place stands proud.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NxlOWYqNtN-V65UQb9ZH4Q"
  },
  "pbXEhDaPqJMQakaeblW44A": {
    "date": "5/13/2018",
    "text": "I give this place 2 stars not because of food but because of service. Our server never once smiled and we waited 10-15 mins before she ever greeted the table which should have been a sign of things to come. She walked to the table and never introduced herself and just said what would you like to order. Never asked about drinks or anything. We ordered drinks and an app and got our app before the drink as we watched the drink sit at the side of the bar. We had to ask for napkins and silverware from another server because ours never came around once after she finally dropped our drinks off. Once we got our food from the bartender the server again didn't ask how everything was but the bartender did. The only time the server was on it was time to bring the check. We again sat waiting for her to pick up the check and she never did and we had to walk to the bar as she stood there talking with other co workers. We also witnessed her other table get up and go to the bar and have to ask for things like a refill/box/etc. The food was good and cocktail was awesome however when you pay $100 for lunch and service is terrible it makes you never want to go back and encourage others not to as well.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sP6fI3EcDsM2cgdS6sURNA"
  },
  "ZdgXD5H6HAnXZPIU9Dfw3Q": {
    "date": "11/4/2017",
    "text": "Excellent food and even better service!! Get the Shrimp sandwich!! You can't go wrong!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "62IZHJoCxMjWSH6R6sZLzA"
  },
  "nnoU49tv5lVcyGmV9xd2uQ": {
    "date": "7/18/2018",
    "text": "This place is small, but excellent. We came for Sunday brunch, and ordered more food than we could actually eat. The French onion soup was like something out of my childhood. Excellent broth, gooey cheese. Simple but surprisingly difficult to master. This place has. We tried the dry rub wings, and while the rub was awesome, we just wished the flavor had penetrated the meat. My husband went for the crab cake Benedict, and he stated the crab cakes were very well executed. He especially loved the crispy edge. I had the fried shrimp \"burger\". It wasn't like a shrimp burger from Shrimp Shack in Beaufort as it's not a patty, but the shrimp had a very light well seasoned breading. I changed my fries to the sweet potato hash browns, and it was a good call. The sweet potatoes are tender but crispy, and I loved the peppers roasted with them. Locals seem to know everyone here as many neighbors stopped in just to say \"hi\". Seems like a real \"Cheers\" kinda place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BIAeURDBQnL3wRft8iTLJg"
  },
  "ND2HzLD42tvafyN7XVpvEA": {
    "date": "2/8/2017",
    "text": "Went to turn house last night for the first time and we will be back! Great selection of local beers. We started with the wings!  The sauce was nice with some sweetness and heat.  They grilled them to finish so there was a nice char that added to the flavor.  They were huge! I had the pork chop.  It was massive! Cooked to perfection.  The fingerling potatoes and spinach went well with the chop. My girlfriend had the scallops.  She was very pleased with the taste and loved the sweet potato hash.  The only disappointing part of her entree was that there were only three scallops. The staff were very attentive and helpful! Great food and experience!  Look forward to coming back soon",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "X8_vC2zUBNcpBOr1RYCswA"
  },
  "2NbmR_A5SwX-E99g8ORSxw": {
    "date": "2/17/2018",
    "text": "The restaurant and menu was smaller than I expected, would be a great place for GNO. We ordered seafood pasta and shrimp & grits, both were very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hSDoatf523J2qySrF0kDHQ"
  },
  "ZTxOc5Qz0XcO4Raw_p2ppg": {
    "date": "7/5/2018",
    "text": "Tucked away in a corner, small but very nice, and gourmet food. We ordered the shrimp burger, peach arugula salad, and onion soup. Unanimous across the table that the food was delicious. This place won't disappoint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A2yrYy41D6B74enHbZwIvA"
  },
  "N-TSsSFlo1XfDkHMjRilPA": {
    "date": "3/4/2018",
    "text": "I ordered wings and the sauce was good but the chicken was dry. I ordered their Chinese Bao buns but never got them. The waitress realize and before handing me the check she quickly removed them and never apologized. I'm a big foodie and I try a lot of places. I have a large following on some of my business social media but this is a place I wouldn't share on it. They have a ton of amazing concepts for food but they don't have them on the menu. I was drawn to this place because of their IG photos but they wouldn't prepare anything that was on it! Don't be fooled. They're are going to be on Triple D which makes no sense because they flew in a Chef that doesn't work there for the show and I'm sure they will make something amazing you can't get on a regular day!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wmBuF7Hd1NodcgmOfVeXFA",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wmBuF7Hd1NodcgmOfVeXFA/o.jpg"
      }
    ],
    "user_id": "xdatYtLTDFrV4C9Rr_4iDQ"
  },
  "2d3hGYSE9Fj8WNO0WUmaJA": {
    "date": "8/29/2018",
    "text": "Just ate here today. Everyone at our table said what they got was the best:). So, I'd say that it is a unanimous FIVE STAR rating. Anyway, I look forward to going back soon and often. Cheers, E",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jB4fa8IykFUTZN8KwqYeGw"
  },
  "J1MgsijixR6OvaWISCkxLg": {
    "date": "8/19/2018",
    "text": "The second time I have eaten here. I got a burger both times. The first time was about a year ago it was great. I went last night and got a hockey puck with very burnt fries. I should have sent it back. The staff was nice and the service was very good. My wife like her seafood dish a lot. I would probably go back and give them another shot but it will be a while. Disappointed after a very good first experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "shHA_otnhFuT-N28xQivcA"
  },
  "yg3N8ep6sZDYcNw0Rn7aCQ": {
    "date": "2/17/2018",
    "text": "Went here during the Saturday brunch hours.  It is a cozy well done space.  The chicken biscuit was absolutely amazing.  Probably the best biscuit I have ever had and the chicken was fried perfectly crisp on the outside and juicy in the middle.  My husband order the oysters and the shrimp sandwich with a side of spinach.  It was all great as well.  We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qSwN4yYyHcOad3_XjlJbeA"
  },
  "5esD-5Sm3Bm9jX_A-kV9cA": {
    "date": "6/20/2018",
    "text": "Hosted my daughter's bridal shower here, everything was wonderful.  Short rib grilled cheese sandwiches, chicken and waffles and more were delicious.  Staff and owners were easy to work with - going back to try the French onion soup and bread pudding Which I understand were recently featured on the Food Network.  Definitely try the the Turnhouse Grille , you will enjoy it !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9nRnCjeDOtUT7kn10bLSA"
  },
  "RYI63ziZ2sqq5ctv4XDtuA": {
    "date": "12/14/2016",
    "text": "Katie is a delight! Her cocktails are an inspiration. The food here is great, the prices are better, and if you haven't been in, you're doing yourself a disservice. If you like craft cocktails and amazing service, you found it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BqLOURGssNycYz_-_iNoJw",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BqLOURGssNycYz_-_iNoJw/o.jpg"
      }
    ],
    "user_id": "a1GgKFed8x-2XOrp6pYw8Q"
  },
  "J_wFJcTRgt5gqFrlWS6dqA": {
    "date": "7/13/2018",
    "text": "I'd give 4.5 stars. The food was absolutely phenomenal, but seemed A LITTLE expensive for how much food we got. Prices still weren't horrible. Service was great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_sFlDbuFGZKwDg-Blc74Fg"
  },
  "3Z4fqgAixlk1fR0vSNO2gw": {
    "date": "6/8/2018",
    "text": "Really solid food and great service. I got the beet salad and added salmon  also got a side of the sweet potato hash and just dumped it on top of the salad. That is the way to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OWVNQl6rgou9rAAHAm4sSQ"
  },
  "ucqjkpFE_um3wtNVMMremg": {
    "date": "11/16/2016",
    "text": "This place was great! I brought my parents here for their impromptu visit and my dad, a chef, had Guly approved. His only comment was made once it started to get busier (we may have been one of the first groups there) and he pointed out that he wished the staff was wearing a uniform of sorts to be able to distinguish them from the patrons (but he's old school so I take that with a grain of salt).  We had onion soup, salmon, and shrimp and grits and everything was yummy. My only complaint is that I didn't have room for dessert. The service was great and they were very attentive. The price was also more than fair for the portions. This is definitely a neighborhood gem that I will start to frequent even if I am alone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t6ljearJ8Mqor3DntLi_Zw"
  },
  "Lpnsoym7aILLGcp3oIFOTg": {
    "date": "12/15/2017",
    "text": "Aisha's food is simply P E R F E C T I O N, staff is A M A Z I N G and ambiance just what you need. If there were more stars to give I would. Best find in the CLT in a long time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SVLo7RakEVVIxoaEAzhjuQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SVLo7RakEVVIxoaEAzhjuQ/o.jpg"
      },
      {
        "img_id": "z_mYW_fnNK6tnMZ0137ekg",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z_mYW_fnNK6tnMZ0137ekg/o.jpg"
      }
    ],
    "user_id": "Ggzh9rVyEflyuXuXMZidjg"
  },
  "6hQc9Ljqb-hWQ_60rRDQxQ": {
    "date": "4/11/2018",
    "text": "Another winner from yelps.  This place popped up while looking for a spot to meet an old friend.  Everything we had was excellent - wine, beer, oysters, short ribs and scallops.  Even though we got there at the end of happy hour, our check was still surprisingly low...Thanks Turnhouse!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_EUYpuwoLSdGyluDLtUI8w"
  },
  "t3qeGfdmSXXFFhCZzjwvZg": {
    "date": "10/8/2017",
    "text": "This place has great customer service!  The food is amazing.  I had oysters, wings (the secret sauce is delicious) and the crab cake egg Benedict with fries.  I need to come back here, like ASAP.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JjnpsVmavaTThw8yU1mYYg"
  },
  "FFMFMXLYpUFBNKWPylYx3w": {
    "date": "8/13/2017",
    "text": "Food was excellent and worth the l-o-n-g wait. There was only one chef in the kitchen and two staff members. I would definitely eat here again but I would suggest they hire another chef or just more help in general.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3F3NWGrKTvV10n8CWDXdPA"
  },
  "YFW9E7ziZFG_h5Xqn55hew": {
    "date": "10/15/2017",
    "text": "Went there for Sunday brunch. The food was fantastic. I had the chicken biscuit plate. Holy cow!  The portion was huge and the food was phenomenal.   Thanks John Cates!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pTPAeXQ9UNKx5EmHw81YIg"
  },
  "y1iWBEBrcmO9fCWgP444Hw": {
    "date": "5/25/2017",
    "text": "Quaint newly renovated bar and grill in South Charlotte.  Great food, awesome staff! Everything we had was amazing. Highly recommend the Boa Buns, Wings, and Flatbread. This has gotta be an upcoming hot spot in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GUocC34Q5g1NN2S0cxYaXA"
  },
  "J0iVrPL0sGI0UQKpGvSkHw": {
    "date": "5/17/2017",
    "text": "I was visiting a friend in Charlotte and the place she had planned on taking us had a crazy long wait. We jumped on yelp and found this place. It was a little awkward when we walked up as they didn't have a host . We stood waiting at the host stand for like 5 minutes until one of the servers asked us if we would like a table. We noticed during our meal this happened to a few other people who arrived. Our server was friendly enough and did a good job handling the amount of tables shes had, we didn't feel neglected. The food we decent and the environment was pretty good.  It is a good place to go with family or with friends, I wouldn't recommend for a  romantic date as the tables are pretty close. I had the french onion soup to start, it was great! For my main, I had a salad and the salmon. It was average, but I am sure some of the other dishes would have been more interesting.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ejdC0okcBppd_CBcf7p0yg"
  },
  "BAXEsVYVVRbu9tyhonmH6g": {
    "date": "12/30/2018",
    "text": "Great food, great place and cool vibe!! You can tell  the ingredients are fresh and the staff cares about your experience! Best Ribeye in town!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H0BhbSrlcJm38WHP96K_pw"
  },
  "1HiNWHlZpfpyr_CQhQmiSQ": {
    "date": "9/29/2018",
    "text": "Great brunch place, fast service amazing food and excellent drinks! Sorry no food pics but the presentation is just as good as the taste!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZZTJcsMl5_JDUp9A-RS8OQ"
  },
  "kw0bdde6IVYrii3O75wauw": {
    "date": "6/5/2018",
    "text": "My favorite local establishment! Great cocktails, the best wings in Charlotte and a quiet but lively crowd. This is a great place for birthdays. Holidays, girls nights, any occasion that requires great food and even better service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QrEhnV_7Q5JJR2gR3b3YYg"
  },
  "BbdsiA9FbKD2BSwh4hiklQ": {
    "date": "1/13/2018",
    "text": "My husband and I tried The Turnhouse Grill tonight for the first time.  It is a small restaurant with a bar almost the full length of the front of the house.  Most everyone at the bar was eating dinner as well. There are about 5 high tops and bench/chair booths most all were full.  We were able to walk In and be seated. The ambiance was cozy and intimate.  There are three TVs which I usually don't care for at dinner but, the sound was off and the NFL playoffs were on, so wasn't distracting.  They played a great alternative 80's music which was fitting.  We started sharing the French onion soup.  We are very particular about our French onion as some tend to be oily and can leave an aftertaste.  This was wonderful, not heavily salted, fresh and the cheese was beautifully melted with a slight roasting on top.  I now wish I would have gotten a bowl all for myself!  My husband had the burger as an entree, cooked to order, it looked like a food porn picture.  Made with brioche bun, the tomato, onion and lettuce very fresh.  As my husband like medium rare, it was cooked perfectly.  I had the chicken pot pie and it is served with a mixed green salad and light balsamic dressing.  The pie had a layered puff pastry, real pastry, with buttery light layers.  The filling was creamy and the veggies fresh with a blend of fresh herbs.  Was a great choice for the cold night.  We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TuVRa-GlK3cYW2q5uCgQHQ"
  },
  "uKBotpiN7xqO8vs4SLX5tg": {
    "date": "3/2/2019",
    "text": "The unassuming entrance to The Turnhouse Grill does not reveal the amazing meal you will enjoy inside. This was one of the best meals we have had in a long time. From the appetizer of Short Rib flat bread, to the Turnhouse salad and Caesar salads with a side of the Brussels sprouts with pancetta.  Every bite was so delicious!  We finished with the Salted Caramel Apple bread pudding. So yummy. The staff was very attentive and friendly. The portions were large and the price was not.  Check out this gem in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eCZX7RSeFtvz3OxRAd1Rnw"
  },
  "k5zXxlMJ9GegCVZotyf8ZQ": {
    "date": "9/2/2018",
    "text": "A must place to go.  Group of four all ordered different everything and all without a doubt excellent.   Superb service, relaxed atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gjFqgPD6osHaOhzzUZTJxQ"
  },
  "qB0kDymKDRkO1vVSPkt21g": {
    "date": "1/6/2019",
    "text": "Great neighborhood place.  Food is really good and the staff is very nice.  I went for brunch (chicken and waffles is great) and we will be going back for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xMkIC3R0m__l1tRhoGNVIw"
  },
  "7LGVCwmUkF8npwLPyyiORg": {
    "date": "2/11/2017",
    "text": "My wife and had dinner on a Friday night The place was packed but we managed to get a table The service was very good The food was great The music was just too loud",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fSQWjw8bfDWIQcXYWlZwtQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Braised short rib and shrimp n grits",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fSQWjw8bfDWIQcXYWlZwtQ/o.jpg"
      }
    ],
    "user_id": "oCIfB_Eyp5hAekehThBXnA"
  },
  "MI7cUs3IBGlku79yvkAclA": {
    "date": "2/1/2019",
    "text": "I'm not sure what all the rave is about this place. Maybe for Charlotte and it's location it's a big deal.  The food was ok, nothing to rave about. I had the pan roasted salmon with butternut squash and some tough green beans underneath.  I added a salad, just arugula some hard croutons, tomatoes, cucumbers and carrots.  Just another salad.  To me it seemed like just hotel bar food at best It could have just been what I ordered. Price didn't justify the quality, in my opinion.  A place where the beer and wine and social aspect is probably good for a group or date , but the food is just ok.  The servers were attentive and no issues there.  I don't know if I would battle the traffic and parking just to go back there.   The guy next to me ordered chicken wings and they did look good.  I don't know, try it and see, you might have a better experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7_WuKJng4TcsOUYCz6BQPg"
  },
  "k7lhtrBAT1n1rWmiT6ZOvw": {
    "date": "11/16/2018",
    "text": "Very nice owner, very average food. With so many good restaurants in Charlotte, it is a shame to waste a good meal here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cWVQ8hve4Lq4oADlM9iJdw"
  },
  "29jfJ3YbqxKx3zdcSuBi6Q": {
    "date": "3/25/2018",
    "text": "My husband and I have now visited Turnhouse Grille several times as we live nearby, and it has yet to disappoint! We've done brunch and dinner. For brunch, go-to is the towering fried chicken biscuit (we add egg), and for dinner, wings and the Turnhouse Burger are great! For any time of day I always start with the French Onion Soup- amazzing! Drinks are always good too. This has quickly become a go-to neighborhood spot for us. Hoping this place stays open, as it is somewhat hidden and easy to overlook underneath Jason's Deli.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P8yMO4XWVcrkIf3rv2GkPA"
  },
  "-FNn8g6pWf7WFWVi3eltRg": {
    "date": "11/3/2016",
    "text": "This new restaurant across from Park Road Shopping Center is trying to make a name for itself with its eclectic food menu and crafty cocktails. The service is outstanding (the owners are always coming up to ask how you are), the food is pretty good, and the cocktails unique. This is a great after work stop! I recommend the pork chop entree -- it's a really nice size price of meat, pretty moist, and the apple butter sauce compliments the meat really well. The ambiance here is also great -- really modern yet cozy. I can't give it 5 stars because the food and cocktails don't blow me away; however, it's quite good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t5TqED-K1BzgthlEGz1H1A",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. The pork entree is good, with apple butter, Demi glacé, fingerling potatoes and cooked spinach. The pork cut is HUGE!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t5TqED-K1BzgthlEGz1H1A/o.jpg"
      },
      {
        "img_id": "bxG4HPixa7KXj5V43LS-vA",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. The Hitman -- Maker&amp;#39;s Mark and homemade cider",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bxG4HPixa7KXj5V43LS-vA/o.jpg"
      }
    ],
    "user_id": "8JiNjuhu1J45St3mEoQCfg"
  },
  "_nzqqg24jUQa2XBLBgatyQ": {
    "date": "6/5/2018",
    "text": "Love this place!! The food is excellent, atmosphere is high-end and relaxing at the same time! Everyone gets to know you - home away from home - friendly atmosphere. A truly hidden gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0lkELki7jMlKTdHwpWQFdg"
  },
  "nYh6_AGUxOcBXNGcGPH0mg": {
    "date": "6/24/2018",
    "text": "This is a great restaurant with a neighborhood pub feel. The food was delicious and the staff very friendly. I had the crab cake sandwich and it was much larger than I expected! I will have to return and try other items on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DKHn6ouwdTRjwzWsYGbaIw"
  },
  "HVeOCOv80hcNtvmEQFS5iQ": {
    "date": "11/17/2018",
    "text": "The food and service here is great. The shaved Brussels sprouts n kale salad is super yummy. The truffle crab Mac n chz is to die for! The wings w/ d sauce is also yummy. I most def be back to try other items on the menu for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CvpIJB9WXFH8PeO5jOZCsQ"
  },
  "GmO1mWlvbYsgz66a-2lLVQ": {
    "date": "4/14/2018",
    "text": "Came to celebrate moms birthday and was a little disappointed. Ordered seafood pasta and the portion was so small. I wanted more food for $21. The sauce tasted store bought. No real flavor to it. I think maybe even the store brand has more flavor than the sauce that it came with. I also asked the server for parmesan cheese to give the pasta more flavor and I never received it. She seemed busy with other tables and since it was just her serving the entire restaurant. My mom ordered the pork chop and she absolutely hated the sauce that came with it. The drink menu seemed pretty interesting and if I do come back it will only be for drinks and not food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1tY6-NBpPI7OtqS6LdDrPg",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Seafood pasta portion.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1tY6-NBpPI7OtqS6LdDrPg/o.jpg"
      }
    ],
    "user_id": "rfxl8gDfn8TfCmSy937wZA"
  },
  "1RsNQvM28DkwK_LfVSFlRQ": {
    "date": "6/3/2017",
    "text": "This is our first time here and we didn't really know what to expect. I called and made reservations just in case it were to be busy on a Friday night. To my surprise, there weren't that many people dining in. So no big deal, we entered and were told to be seated anywhere. Ordered some drinks from the bar to get us started. I had a drink with titos and prosecco mixed with cucumbers. It was very refreshing and simple. Then for our main course we ordered the sea scallops with sweet potato hash and my date order the sirloin steak with frites, I believe. They were both delicious! Came out in a timely manner. The sweet potato hash had to be my absolute favorite! It was perfect to pair along with the scallops and the sauce that came on the plate too. I think it may have been an apple butter reduction of some sort. But it was good! My date enjoyed his med rare steak but only complaint on that was it may have been a bit too charred. But that's our preference.   Other than that, I enjoyed our service and our food. It was a good experience! Will definitely be coming back to try their brunch as well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bnS7ggyVV8jRv5YndIwfjQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bnS7ggyVV8jRv5YndIwfjQ/o.jpg"
      }
    ],
    "user_id": "gITqX8Utn5z6gDffPhS2vw"
  },
  "RNwc8Q6npTwevdGooSyvmw": {
    "date": "8/18/2018",
    "text": "OMG! How I wanted to love this place. I had been meaning to eat here after reading the glowing article about their female chef in Charlotte Five a few months ago. I also saw the pics in yelp from that time frame that made the food look tantalizing. WRONG!! The good imaginative chef is no longer there. I went here today and got their most popular two meals: the chicken sandwich and the shrimp and grits. DISGUSTING! I should have known this wasn't going to end well when I arrived at 12:30 Saturday - the peak of lunchtime - and the place was COMPLETELY EMPTY!  But back to the food:  The chicken was way undercooked and had zero flavor. The shrimp and grits was also devoid of flavor and the grits were so under cooked they sort of crumbled in my mouth. To make it edible at home  I had to add my own andouille and creole salt. I also re-cooked it in my own oven. I repeat DISGUSTING!! I called back later to discuss my experience with a manager but none were there on a Saturday night and all I got was a confused girl who didn't know her own work title but was full of anger and attitude. WONT. FUCKING. BE. BACK!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PN6lYym62G8NAaXgbMaSpg"
  },
  "bydCLlO5auonoJKvIv5Huw": {
    "date": "10/27/2018",
    "text": "Pork chops... .  The bread pudding. OMG. Cleaned our plates.  Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfPeotRPitb_pZydSXfqZA"
  },
  "ylCexH2leERIUWNtqRpBJA": {
    "date": "10/16/2018",
    "text": "We were passing thru town and found this gem on Yelp.  Food was fantastic and the servers very friendly.  We had the hamburger and the pork chop.  Both were very tender,  tasty,  and cooked to perfection.  The sides were fabulous also. Chef knows how to create and cook! Very reasonable prices too. We highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8gFV-ffEVlsd2cbpQLdJyQ"
  },
  "GkqSjE7OTDhfRycFhqmZFQ": {
    "date": "8/7/2018",
    "text": "It's a small, chic restaurant with both indoor and outdoor seating. The staff is extremely nice & even went out of the way to make cocktail sauce from scratch since they aren't serving it this summer. The waitress said they were known for the fried shrimp sandwiches, so the boys got those. And coincidentally all the girls opted for the truffle crab Mac and cheese. Don't be fooled-it's a \"small plate\" but is still really filling. The Mac and cheese was 4.5/5 stars for me. Really, really good. The boys loved their fried shrimp sandwiches. I snuck a bite out of my hubs sandwich and instantly decided that when I come back, that's what I have to have. The spicy mayo on it was also really good. We also shared a side of the panzanella. It's basically a crouton salad with some heirloom tomatoes, arugula, and shaved Parmesan marinated in balsamic vinegarette. My husband and I enjoyed it. Wish there were more tomatoes though. This place was an overall win for everyone. Fun fact-they also have coloring books and crayons for kids!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-kD5IKUuCokIF8R9YnI43A",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Truffle Crab Mac and Cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-kD5IKUuCokIF8R9YnI43A/o.jpg"
      },
      {
        "img_id": "BNdUoMnbOqlFsNLctyvIQg",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Fried Shrimp Sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BNdUoMnbOqlFsNLctyvIQg/o.jpg"
      }
    ],
    "user_id": "yfgsLSvLE99m4qSZblkDkQ"
  },
  "cLFpJLUmfARpePzoerabqQ": {
    "date": "4/28/2017",
    "text": "My husband and I went on Friday night.  The restaurant was crowded and we got a seat by the tv to watch the draft. (GO PANTHERS)   We ordered a bottle of wine, flatbread, and wings.  $70 for those three things and we got the cheapest bottle of wine.    The flatbread was really good, wings were subpar and service was amazing!  I hate to say this but I agree with the other yelpers that the price is too high...  but again the service was really good.    It makes me sad but I probably won't be back because of the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t07FfNSgrlTiHYjE4y1GgQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Wings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t07FfNSgrlTiHYjE4y1GgQ/o.jpg"
      },
      {
        "img_id": "B6QDLDou78-eR6AHGBurdA",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Flatbread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/B6QDLDou78-eR6AHGBurdA/o.jpg"
      },
      {
        "img_id": "RSljH-2NACk-TBvup8WcjQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Sav blanc for $30... came out super quick!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RSljH-2NACk-TBvup8WcjQ/o.jpg"
      }
    ],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "7aCpvFsW9EpIpJg_sQX1Gw": {
    "date": "7/28/2018",
    "text": "Been wanting to try this place for awhile due to their glam photos of their food online, totally IG worthy food photos. Tonight, they only had a few patrons at dinner which worked out good for the group I was with as the restaurant is small. High top tables - chairs are super uncomfortable, we all thought so, sit in booth if you go. Food was good. Wings were flavorful and hot, ranch was watered down. Shrimp burger was plentiful but the fried shrimp could have been seasoned more. Lightly fried, big shrimp. Fries were good and looked hand cut. Friend got scallops and enjoyed them - plated nicely. Other friend got burger medium well and it was too well done, not med well but thats understandable, should get it medium. Will come back, but want to try their brunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ngt1DInAEf3Zlw0YqWoh9Q"
  },
  "x4yAZLU0uRaDntmi4LOzzw": {
    "date": "6/11/2018",
    "text": "We came to Charlotte for Mother's Day weekend and didn't make an early enough reservation for a brunch on Mother's Day.  Mainly because it was a quick family gathering and we didn't know how things would work out before we headed back to our various destinations.  So when we decided what to do we started trying to get a brunch reservation.  We're so lucky that our first couple of selections were full, because that's what led us to this restaurant.  We had a mix of quiche, french onion soup, salads, chicken and waffles, crab cakes and pasta.  (had to figure out what the 2 year old granddaughter might want)  Everything was excellent, empty plates all around!  Definitely on the return list.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pLZuTVM4Z2pqfM8J7mumcw"
  },
  "_puy5OqsojNnbGdGqkU-nw": {
    "date": "4/7/2018",
    "text": "We were out and about for a friend's birthday and just happened to walk into a goldmine.   We walked into a quaint, warm environment on a cold April night. Greeted warmly in stark contrast to the outside temperature, we felt right at home when we walked in. Even other patrons greeted us and told us to come in out of the cold. Seating selections include booth/table combos, high tops and bar seating. We chose a booth/table option and had Darby and Brodie (yes, beautiful twins) as our duo servers. My husband realized that our servers were actually twins! Both were super friendly and helpful in guiding us through selecting a few good bites to \"supplement\" our dinner we had earlier. We selected wings and peel and eat shrimp. Perfect combos paired with a few beers, rose and a glass of Cabernet Sauvignon.  What struck us most about our experience tonight was the customer service.  Our servers were perhaps the most attentive we have had in awhile. And where can you go that the owner, Andy, comes and sits down with you at your table to have a conversation? I think he actually had about three or four encounters with us! He was super friendly and engaging. He was considering adding port to the menu and even gave us samples. Super friendly and down-to-earth gentleman. When we got there, he had on an apron...an owner who doesn't shy away from working the business.   We were informed that brunch is served on weekends. Why did they tempt us? We just might have to go back in the morning!  This place is a must-try!    I regret not having the nerve to ask Andy for a picture. Trust me, he's a really nice guy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "CtIBG55GolSXI3qjcQFExg"
  },
  "nxG83jj3wTZzgqz1ja-mUg": {
    "date": "1/13/2019",
    "text": "Fried Chicken sandwich was exquisite and the fries were awesome. Wow!! Grill type of menu, but a swanky atmosphere. They accommodated us as a huge 14-person group and we enjoyed it. Thank you for a great dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hfLHW7QYRWeB1EMwlGkK6Q"
  },
  "S7fRJTVDEu4Gv8GbWYZ-HQ": {
    "date": "2/9/2019",
    "text": "Really good food; except... Caesar was clearly from a bottle and Croutons a box. Mac'chesse, Beet salad, and Short Rib Flay bread really good. They were Out of dessert(???)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OIm00WnFlBPzWWTy0py-JQ"
  },
  "nyJG95706w6US7PlYmWDZA": {
    "date": "10/5/2016",
    "text": "Date night Sunday where we decided to check out two new places near our casa.  We stopped into Turnhouse Grille around 5pm on a Sunday. The place was pretty quiet but we were welcomed in with open arms! Sat at the bar and proceeded to get the low down from the bar tender.  Turnhouse is not officially opened yet and is just doing a soft opening. They haven't advertised a ton just yet either. We absolutely loved the bartender, who was so enthusiastic and excited about her job. She showed us her different thoughts on future cocktails and her change-ups on some of the classics. She even keeps a running notebook of different funny names that come up around the city as an inspiration for future cocktail names. Halfway through our drinks, an owner (there are two, both were there) came in and shook our hands and introduced himself. It was cool getting this inside peak of the runnings of this place.   The ambiance is fairly relaxed with a nice size bar, 2 tvs, and ample seating. Small mason jar candle lights at a nice touch.   For this occasion, we stuck with just drinks (though the food menu looked amazing and we will definitely be back). I got the Booty Loop and my husband got a mixed drink that had whiskey (or bourbon...dont remember) in it and wine (odd I know!). Wish I would have remembered the name cause it was absolutely delish! The Booty Loop was super refreshing and the perfect balance of tart and sweet. I thought the cocktail prices were extremely well priced.   I am so excited to have stumbled upon this place and can't wait to see the amazing things that come out of it. Go check it out! Great job guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dRvSWd-QoqGFOW0f0a6-uQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. The Booty Loop!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dRvSWd-QoqGFOW0f0a6-uQ/o.jpg"
      }
    ],
    "user_id": "Hw5riZfnB-B7G79vBTOssA"
  },
  "dzloGkqueyIkcGAcl8OxzA": {
    "date": "12/12/2018",
    "text": "The best thing I can say is that they had half-price bottles of wine.  My wife ordered a french onion soup that ended up being the best dish of the evening, but its broth lacked richness and the onions were not caramelized. Her \"roasted chicken pot pie\" had a massive (2\" thick?) biscuit-like thing on top of it, rather than the thin, crispy crust that I've always thought of as one of the hallmarks of chicken pot pie. She didn't finish.  My dish, though: that's where it gets weird. I ordered a pork chop. The chop itself was fine, but the sauce and... apples? that came with it were so overdone that they were bitter. The fruit was unrecognizably black and shriveled. There was no flavor discernible throughout the dish other than \"somebody burnt this.\"",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0UOUnwKQ7yhCxWD4JJKZgg"
  },
  "TEs4PPRGtTmmofBglQ2TeA": {
    "date": "9/5/2017",
    "text": "The girlfriend found this place on Yelp and it turned out to be just across the street from The Flying Biscuit Cafe where we had breakfast earlier that day. It was a little hard to find thanks to it being tucked away in a lower corner. Although it faces the street, the parking lot is behind the complex and you have to go down some stairs.  As someone who is always on the lookout for local beers when traveling, I was happy to discover several on tap. Even better, our visit coincided with $3.50 craft drafts on Wednesdays. Perfect timing!  Food-wise, I ordered their grilled hanger steak that came with corn succotash and shoestring fries. The girlfriend went with seared sea scallops on top of a sweet potato hash with a bacon apple ginger reduction. Both dishes were excellent and we enjoyed every bite.  We caved on the dessert and ordered their strawberry key lime pie. More strawberry than key lime, it was a solid way to end a fantastic meal.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "YwaKGmRNnSa3R3N4Hf9jLw"
  },
  "Y1qucCXialzChCRjzmIrew": {
    "date": "11/24/2018",
    "text": "Damn! Great food.  Drinks are strong.  Prices are right.  Staff is VERY good!  Chad make my new favorite: the Everett!  The pork chops are AMAZING!  Who thought to put truffle oil in mac and cheese?  Amazing shrimp and grits! Cant say enough.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zg1AY0S5Q5wdeafBDJPtcw"
  },
  "N7FSSVWeJr2oDYx8C7MpHA": {
    "date": "7/13/2018",
    "text": "Great food & awesome service. Truffle crab mac is AMAZING!  The drinks were also good and they have nice glassware",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oIsZN6ZNJiwWJTJ0WoNZ5Q"
  },
  "rDH13hik-2uIENbR3ZABpA": {
    "date": "6/4/2018",
    "text": "We had a fabulous time at the Turnhouse Grille this past Saturday where we hosted my sister's bridal shower for 35 women!  Chad, Darby, and Andy were willing to help with whatever set-up we needed, the menu was customized to the brides favorites and all delicious!  I would recommend the Turnhouse Grille for any special event or just a casual weekend brunch, my personal favorite was the chicken and biscuits!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iVy5gBefcNS-mc_qvQ9B7A"
  },
  "zmJMX8P0FqcQM7gg-cd_bA": {
    "date": "10/19/2017",
    "text": "This place is tucked away in the lower level of the shopping center, beside sportscuts. Thursday nights are half price bottles of wine and $8 craft cocktails. I indulged in The Minh craft cocktail...perfection    The service is excellent and the food is wonderful, all made to order. Turnhouse is definitely worth checking out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "54dLDY7eRB5co3DFYBZqZQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/54dLDY7eRB5co3DFYBZqZQ/o.jpg"
      }
    ],
    "user_id": "aKwPmz2pQxt45Z5uE2lwYw"
  },
  "vAZxMGGYcEhAIZqNCWDGPA": {
    "date": "8/6/2017",
    "text": "This place was sooooooo good. Everything we ate was sooooo delicious and flavorful. The hanger steak was amazing. The burger my husband ate, he said was vey good and flavorful. I would definitely be returning and recommending this place to everyone.   It's not a big location but was not busy because I don't think many people know of this place but once they do I believe they will need a bigger location. Food was great and the manager was very attentive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k-HH-VnQWyd0iX3XyhV_Hw",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Onion soup was really good. First time having this kind of soup. Love the bread pieces in them.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k-HH-VnQWyd0iX3XyhV_Hw/o.jpg"
      },
      {
        "img_id": "qr1pr1ensBdFUysyy1k9tg",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Wings were delicious.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qr1pr1ensBdFUysyy1k9tg/o.jpg"
      },
      {
        "img_id": "9xi4xeYOiO0F1N_kmv7g0A",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Hanger steak was soooooo good. I got it with the potato instead. Omg this steak was cooked perfectly and the flavor was great.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9xi4xeYOiO0F1N_kmv7g0A/o.jpg"
      }
    ],
    "user_id": "iP0bG-8pltVB15u5m98mow"
  },
  "wEscezVRswafsIMtvqBfGg": {
    "date": "9/9/2018",
    "text": "This place is a hidden gem!  Love the fried chicken sandwich, and they have a great selection of wine.  And they are open for brunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rLr_1yDrLgvRTLYDnl-QpA"
  },
  "StdiaCSu-ox_V_ph2oYmDQ": {
    "date": "4/16/2017",
    "text": "Found this place on #YELP and THE lamb chops burgers shrimp and grits and a lot of the good stuff __ AND a1 definitely enjoyed ourselves the kids ate good and my tummy is full the lamb chops and shrimp and grits oh my goodness definitely good place to come but you definitely got to get those.  ((((( grilled chicken wings ))))))  !!!!!! never had anything like that blessings to come thank you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VgrvXlKO18tZXPH4rKLK9g",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VgrvXlKO18tZXPH4rKLK9g/o.jpg"
      },
      {
        "img_id": "meqLm9zuIjGnjlb4Xc6fkw",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/meqLm9zuIjGnjlb4Xc6fkw/o.jpg"
      }
    ],
    "user_id": "qVaZDd2gvw8ns0OKI-2xCg"
  },
  "YPQgd-QhQungHoGaLEyqdg": {
    "date": "3/1/2017",
    "text": "My friend and I decided to try Turnhouse this past weekend for some dinner and drinks. We were told to find a seat wherever we liked and water was placed on our table almost immediately. The staff was very attentive and polite the entire evening.  It wasn't too slow, too busy, or too loud, which was perfect for a relaxing night out.  For dinner we decided to try the Bao buns as an appetizer, while I chose the scallops and my friend opted for the shrimp burger as our entrees. Everything tasted delicious! My only suggestion (like another reviewer), would be to add at least one more scallop to the entree to feel worth the $21 price.   Since we were enjoying the atmosphere already, we decided to relocate to the bar after eating and had another friend join us. This time I tried one of their signature cocktails, and I would highly suggest the Phat City.   Definitely check this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GR-iQQqrn-2J3hJ_Q6tbPg",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Phat City",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GR-iQQqrn-2J3hJ_Q6tbPg/o.jpg"
      },
      {
        "img_id": "wQFNQ43o7KhPD1cbe5ydkA",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Shrimp Burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wQFNQ43o7KhPD1cbe5ydkA/o.jpg"
      },
      {
        "img_id": "ZW1jCqA6MyB8QAxPDJ4XlQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Seared Sea Scallops",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZW1jCqA6MyB8QAxPDJ4XlQ/o.jpg"
      }
    ],
    "user_id": "DGGyRn5gDKqSlNscFvbJzQ"
  },
  "QfM_wIv0YfztDsTLQBsA2A": {
    "date": "6/2/2017",
    "text": "Added to my list of gem brunch spots for Charlotte. You'll never have to wait since it's tucked back into the commercial property and in a not so obvious location. The food was great and atmosphere is simple, but cool. We had the Monte Cristo sandwich and chicken biscuit. Mimosas were more of an artisan/craft style, but still really good. Don't expect the typical bar OJ with cheap champagne. Lots of great flavors and some unique dishes. My only negative comment was the service was slightly slow, but this is a mom-n-pops, small time restaurant, so it's understandable. It's not huge and not employing a large staff, so you could experience slightly longer than usual wait times. I could easily see this place having a special spot in a great location one day, but until then it's my diamond in the rough. A solid 4 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N09K18xBetdwJpJ74L4S_A",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N09K18xBetdwJpJ74L4S_A/o.jpg"
      },
      {
        "img_id": "rzh5LoT8sRLY_ED6ZKOiag",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rzh5LoT8sRLY_ED6ZKOiag/o.jpg"
      }
    ],
    "user_id": "0KGCdp9W8jz9KJRsABb66g"
  },
  "Cj2jbmRPwaMHryoCxP1KZA": {
    "date": "7/22/2018",
    "text": "We forget this is here, it's so hidden away in the shopping center across from Park Road Shopping Center. I wish we remembered it, because both times we've gone, we've loved it It's quiet, comfortable and the food is to die for! Our servers both times were wonderful. I hope more people catch on to it so it will thrive. Too many places there disappear and I'd hate for this one to. Must write the name of it on the fridge so that the next time we're going out, we think of it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NxmHZqmdvzD4ZlQSCEskzA"
  },
  "VFTRpI8FCqkYRhqGlcbJcw": {
    "date": "6/30/2019",
    "text": "I am so sad to hear that another great offering had to give up at this location. These last two restaurants both had 4.5 stars when they closed... what was missing Charlotte? @thenovamikebarrea",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rbqlGk6Kvyxcv0f3TrzQWA"
  },
  "QD09RHtWogCf-OnfkuhkIQ": {
    "date": "3/25/2019",
    "text": "Working with Andy, Chad, Chef and the entire staff at The Turnhouse Grille has been a pleasure. Our newly launched nonprofit hosted a fundraiser event at the facility on a Monday night (when they are typically closed). Even though they had to come in when they are normally off, the staff was more than accommodating.   Super intimate, The Turnhouse Grille is a unique space for a small gathering. The service is impeccable. Seriously some of the nicest people I've ever met behind the bar and waiting on tables. The food is also delicious - get the Brussels sprouts, Caesar salad and/or the shrimp burger. All amazing!   I can't thank Andy and his staff enough for their hospitality and flexibility in facilitating this event. I plan on becoming a regular at this establishment, and hope you will, too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ods9HD7J8EgZIsyvUVI7Yw",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ods9HD7J8EgZIsyvUVI7Yw/o.jpg"
      }
    ],
    "user_id": "Zuw3U46w19_MWzz--M5aqg"
  },
  "FEUX4CtxGrr0TLaNdtJJ1A": {
    "date": "1/14/2019",
    "text": "I've been to the Turnhouse Grille three times and waited a while to review, for some reason.   If you remember, the quickest way to my heart is either through a cute puppy dog or some really good Brussels sprouts. I'm not sure how the Turnhouse feels about pups on their patio, but their chef knocked it out of the fricking park with those Brussels.  They've got an amazing crunch on the exterior leaves, but the inside has juuuuuust the right amount of bite to them. The pancetta adds the insane saltiness that enhances the flavor of the balsamic glaze... I mean, it's one of my top two sprouts for sure.  And the spare rib flatbread is back! Y'all. It's got crispy onion straws on it! The sauce, though. That sauce is a kick in the taste buds. It's not too sweet, not too spicy... The balance is perfect.   And to drink, I ordered the Bourbon Orchard which was crafted by Chad and thoroughly enjoyed by me. Twice. Anytime you mix some Jim Beam with rum, you can expect a good time. Black cherry rum? Even better.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "FRWhJGdz-L9Ur8JMwIVDSw",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Short rib flatbread.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FRWhJGdz-L9Ur8JMwIVDSw/o.jpg"
      },
      {
        "img_id": "oZ1C1HhVHaBMZ6joX0uSiQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. The Brussels.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oZ1C1HhVHaBMZ6joX0uSiQ/o.jpg"
      }
    ],
    "user_id": "ttZSRwCZiFMXwUO2Vr9pBg"
  },
  "iX4gqHBDOVEgEM0TP-eH5A": {
    "date": "1/11/2019",
    "text": "Once you find Turnhouse Grille and have a meal you will have found a hidden treasure of Charlotte!   Turnhouse Grille properly named after the owner playing golf one day decided to open up a restaurant and I am happy he did such a thing!   First the mussels are by far the best mussels in Charlotte! If you can find a place that is better please don't hesitate and tell me because I'll be there to compare. There is nothing like fresh mussels but when they taste this good you will want to jut order them!   Our service was excellent and impeccable here. I asked what I should try and she was genuinely giving me her personal experience and steered me right way every time!   I order the pork chop and I they give Carpe Diem a run for their money on best pork chop. The pork chop was literally cooked to perfection with a moist nice center with just the right amount of seasoning.   You got a second so I can talk about the Brussels sprouts? What!!!?!!! The Brussels sprouts are so good! Warning they have bacon in them so if you are vegan or vegetarian please be aware!   I didn't know I was eating bacon until after my first bite or two when I noticed it. Well I am honestly not a big pork lover besides bacon every now and then but this place is the place to go!   The salmon and burger were equally as good! You are not going to go wrong at Turnhouse Grille. Happy eats!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "KaZNsxXr-PRGAG_jRVUBWg",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Famous Charlotte Mussels",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KaZNsxXr-PRGAG_jRVUBWg/o.jpg"
      },
      {
        "img_id": "Z-1eKLmiMbv5j9aCPCEQkg",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Brussels Sprouts !",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z-1eKLmiMbv5j9aCPCEQkg/o.jpg"
      },
      {
        "img_id": "2gwoNHFfoWmtDasjp546-Q",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Salmon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2gwoNHFfoWmtDasjp546-Q/o.jpg"
      }
    ],
    "user_id": "wcubg4QbsWBhc5bjlkCdDw"
  },
  "qTziAeMabjJbzbPY9fNH0Q": {
    "date": "7/25/2018",
    "text": "The Turnhouse Grille is a definite hidden gem. However, now that it appeared on Food Network, that may change unfortunately.  The restaurant is very inviting. It is small with an intimate feel inside, with several outside table as well.  They offer an extensive menu with a great option of choices. On my most recent visit I tried the Cheeseburger with Fries. One of the best I've had, cooked a perfect medium! The Fries were also great! In addition to their food menu, they do have a cocktail menu with several unique drinks, as well as beer and wine.  I'll be sure to make this a stop when I'm in the area, especially when I'm craving a burger !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 11,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yfcReg60XSkxltnlAVHLQQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Fried Chicken Sandwich with Macaroni &amp;amp; Cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yfcReg60XSkxltnlAVHLQQ/o.jpg"
      },
      {
        "img_id": "Q3z_XUDvBhjbqkxBU4SdkQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Shrimp Burger with Brussel Sprouts  !",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q3z_XUDvBhjbqkxBU4SdkQ/o.jpg"
      },
      {
        "img_id": "1Fl_kn4hjzBqGLGiQmu34Q",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Burger with Fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1Fl_kn4hjzBqGLGiQmu34Q/o.jpg"
      }
    ],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "9KZJgpvH9hAOf-mRlui5LQ": {
    "date": "1/14/2019",
    "text": "This place is without a doubt a hidden gem of Charlotte! Never even heard of this place and it was by chance that we ended up coming here for dinner one night!  First off this place is intimate and a cross between casual and classy. Come here for a date night or just to grab dinner and drinks with a group of friends. All of the above is good here. I was very impressed because the owner had come in and was drinking wine and laughing and mingling with all of the guests. Everyone seemed to know him. The overall atmosphere was fun and I felt like I was having dinner and drinks at a friends house.  This is not something I have seen at any restaurant I have ever been to.   Second and most importantly, the food was GOOD! We ordered the mussels as an appetizer. I don't even like mussels, but I tried one and I was grabbing for more! My boyfriend got the pork chop as an entree and it was absolutely phenomenal! I still have dreams about this pork chop!   The service was also very friendly! When we asked the waitress what she recommended you could tell that she genuinely thought very highly of the food and gave us excellent recommendations.  Overall, this is an outstanding restaurant and I left here beyond impressed. You will not be disappointed!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "PI0nRf7P3-oVkkV1bs8pTg"
  },
  "Wy2AbyNrBIcyVSzlYaSajw": {
    "date": "7/6/2018",
    "text": "I stopped here on a Friday night (with my husband and Kate) and the place was pretty low-key. It draws in the older crowd and there seemed to be a few locals that visit this place often hanging out at the bar.   The cocktail list looked delicious, but I opted for a beer. I got a blue moon and it was served in a chilled glass and was ice cold! Yummy!   For dinner I split meals with Jon B and Kate. I got the shrimp burger with Brussels, Jon got the fried chicken sandwich with Mac n cheese and Kate got the burger with fries. And yes, we successfully split 3 sandwiches. Haha!   My shrimp burger was more like a poboy. I was expecting it to be packed vs breaded shrimp on a bun. It was tasty, but nothing special. The fried chicken was tasty especially with the pimento but my favorite was the burger. It was cooked perfectly and super juicy.   For the sides, I really enjoyed the Brussels however their fries were very good. I would skip the Gouda Mac next time.   I won't be in a rush to get back but it's a place someone wants to go I won't say no. I've heard their brunch is bomb so I might need to come back for that instead!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EFvN7zRt6jxpOtr-JQbsfQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Shrimp burger w Brussels",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EFvN7zRt6jxpOtr-JQbsfQ/o.jpg"
      }
    ],
    "user_id": "EtFYEN0sbxkZOOt3DE7vWg"
  },
  "nuAHM_pO8TVgeG0CST4gpA": {
    "date": "11/9/2018",
    "text": "You will have trouble finding it! But worth the discovery. TG is located next to Ben and Jerry's. It's not great for groups but  with the dim lightening, it can be a semi-intimate dinner for you and a plus one (even if platonic). Every dish that was brought out of the kitchen grasped my attention. Cam the barkeep made a great recommendation. We had the truffle crab mac & cheese, and order of wings ( both flavors) and the Bloody Old Fashion.  We will be back. Dishes that looked great: the Shrimp Burger and a salad topped with a SUBSTANTIAL piece of salmon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gy2cx-_VqDhgSIiIYIYQ7A"
  },
  "eJkYF9nkQ0k1OBft7RBeOw": {
    "date": "1/30/2019",
    "text": "My friends and I stopped in to this new restaurant for a Saturday brunch and it did not disappoint. Our biggest surprise is how many open tables and seats there were given how wonderful our experience was. To start, the service was excellent. The server was friendly and attentive and the food was timed appropriately. The menu had a great variety of items, leaving everyone pleased to find something they'd enjoy. Not a single one of our entrees missed the mark. We had the short rid benedict, the burger, the fried chicken and biscuit sandwich, and the shrimp burger. They were presented nicely, generous portions, and plate licking good. Price point is right on where it needs to be. The cocktail menu looked interesting, but we stuck with their $5 mimosas. I wish the glass was a little larger, but for the deal it was fine. The ambiance is very nice and I look forward warmer weather when they open up a patio service area. My only critical comment is that the high top chairs are not very comfortable. I felt like I was always falling out of my seat, but this distraction wasn't enough for me take away star given how wonderful everything else was for our brunch.  Also, I don't very often mention it, but on top of all this, their health score is an incredible 98.0!  Bon a petit! I hope you enjoy as much as we did.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ir8HD2v8YoL-bZfP8y7B0A"
  },
  "xhzsgcHlFsGn6efM7Hx3nQ": {
    "date": "4/9/2018",
    "text": "This is our second time in the last three months of going to the Turnhouse Grille.  We arrived around 4pm, and were the only diners.    We go for the early specials of raw oysters and steamed .  The oysters were local, but way smaller this time then last.  The shrimp is good but just sprinkled with OldBay doesn't seem to be boiled in it.  So it lacks flavor.  The $1.00 per wing are really good. Fried and then grilled.  My only complaint is it seems like it takes a long time to get food, especially when were the only patrons in the place.    It's in the lower level of a strip mall, easy to miss. There is an elevator on the upper floor by the Italian restaurant if needed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sXP4z8Trg7up2zJY3iDllA",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sXP4z8Trg7up2zJY3iDllA/o.jpg"
      },
      {
        "img_id": "dDD6lHAdNSzyCme3Pqkfzg",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dDD6lHAdNSzyCme3Pqkfzg/o.jpg"
      },
      {
        "img_id": "xMXoem7xV3JoT1xbU6_dbw",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xMXoem7xV3JoT1xbU6_dbw/o.jpg"
      }
    ],
    "user_id": "8R7YQrcWqc72_IBbWgaJlg"
  },
  "5W2C41i2hEENQUOsJ_K6LA": {
    "date": "5/14/2018",
    "text": "Are you a Food Network fan? I've wanted to try this Gem for quite a while but when I got the inside scoop about an episode being filmed here I knew I could not wait any longer to check it out.   TurnHouse Grille has been opened for almost two years. The moment you walk in you instantly enjoy the classic ambiance, from the beautiful chandeliers hanging to the music playing.  \"Why Can't We Get Along\" That my friends is the name of the sauce I chose, I would describe it as a brilliant blend of sweet and spicy. I ordered the Hef wings which comes with another sauce option called Orge sauce, describe on the menu as \"local (all purpose) craft bbq\"  I brought one of my close friends from 7th grade along and he decided on the Shrimp Burger. From his reaction I can tell the fried shrimp served on a warm brioche bun made his taste buds dance. The Shrimp Burger comes with coleslaw and cocktail sauce but he opted out of both lol   I cannot end this without acknowledging the fast and friendly staff. The place was packed but the servers were extremely hospitable and served us in a timely manner!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cjiacf37AckCwrwuPSmh4g"
  },
  "nd8rnh72pDb_EM1mtAQNLQ": {
    "date": "7/25/2018",
    "text": "Another find on YELP and so glad that my friend Charlotte and I locked in here for lunch today.  This restaurant was featured on The Food Network last week, and I can see why!  Their menu is creative and original.   It is just not a typical grille!   I had some gourmet chicken wings with blue cheese and hand cut fries.  The wings were prepared with a zesty sauce that complimented the dish. There were a variety of salads and sandwiches, including a shrimp burger on the menu.  It is an intimate space with a magnificent bar area.  The restaurant was sleepy today, but it is vacation season and restaurant week, so I get it.  It's located directly below Jason's Deli adjacent to Park Road Shopping Center. If you don't know exactly where you are going, it is a little bit hard to find.  Absolutely go enjoy the food and the ambience in The Turnhouse Grille.   It could well be your favorite new restaurant, if you haven't already discovered it!   Three thumbs up and I plan to be a loyal patron.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "OlFBl4AT5IbPncFPGxiQeA",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OlFBl4AT5IbPncFPGxiQeA/o.jpg"
      },
      {
        "img_id": "BXby0tnvuEvbjc2XOP5Ztw",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BXby0tnvuEvbjc2XOP5Ztw/o.jpg"
      },
      {
        "img_id": "3-uFStWFe_TJzEfibbyllw",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3-uFStWFe_TJzEfibbyllw/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "RYvFu_VKSwx9eX6AsvFu2Q": {
    "date": "6/4/2017",
    "text": "I came here for brunch with a friend on Sunday afternoon. It was fairly dark inside, and not crowded so we picked our own table. We ordered mimosas and a mango drink then ordered. It took a long time to get our food, but our waiter apologized and then bought our drinks for us, which was real nice.   I had the banana bread French toast and highly recommend it. The bread was sweet, with bananas on top and maple syrup. For my side I had the sweet potato hash. So. Yummy.  They had a great flavor, not sweet, but more of a spice and it was delicious. My friend had the monte cristo with cheese grits and I tried her grits. Creamy and delicious.   I saw the chicken biscuit go to a table near by as well as the burger and they both looked delicious, so I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 10,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "HMz_xpETBhm16nwiJ7h85Q",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Banana bread French toast.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HMz_xpETBhm16nwiJ7h85Q/o.jpg"
      },
      {
        "img_id": "MiLSxUr2Lo7OOSNnwmFt_Q",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Sweet potato hash",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MiLSxUr2Lo7OOSNnwmFt_Q/o.jpg"
      }
    ],
    "user_id": "fPxE0VgahKU0Xh6YQt2-Kw"
  },
  "OSGwwLVpsFwk1asinWQf7Q": {
    "date": "9/23/2018",
    "text": "One of my favorite restaurants in South Park!  Highly recommend this neighborhood place for brunch, happy hour, date night or to catch the Panthers game!  The staff is always super accommodating and the food never disappoints!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3iASVnYonE0Ama9patbqQg",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3iASVnYonE0Ama9patbqQg/o.jpg"
      }
    ],
    "user_id": "IaEzNYdtzmUqankLrj91_w"
  },
  "-up2VKhG5QtNmlLpQEiwVg": {
    "date": "2/8/2018",
    "text": "I was looking for a place for brunch so I could catch up with a former coworker and found this place nearby via Yelp. Surprisingly, it wasn't busy being that it was a Saturday during brunch prime time.    I ended up ordering the Chicken Biscuit (I decided not to opt for a $2 egg) and paired it with the Smoked Gouda Grits.   The chicken was a tad bit on the dry side but overall, it was still very good.  I'm also a huge fan of grits and theirs did not disappoint.  Remember that $2 egg I decided against? Yeah, I regretted that as soon as the table next to me got their order and their chicken biscuit was covered in a generous portion of scrambled eggs.     Overall, we both enjoyed our meals.  I would recommend this place if you're not looking to spend hours in line for brunch and would like a more intimate environment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "98btGqzEwpMlECiKUR4OHQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Chicken Biscuit and Smoked Gouda Grits",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/98btGqzEwpMlECiKUR4OHQ/o.jpg"
      }
    ],
    "user_id": "4B6qFN-wUEegZTxCWU_Mkw"
  },
  "nFlIC7u_rhB-PaxBj0pbcA": {
    "date": "5/12/2017",
    "text": "Really surprising food quality for a neighborhood hangout.  Not your bar food scene; rather, solid entree and app offerings at decent prices.  My wife's Caesar salad was huge and the French onion soup has a satisfying rich depth to its flavor.  My order of PEI mussels was exceptional and a big time do-over.    They gave me a choice of broth:  classic white wine, or tequila lime.  I ordered the tequila lime loving every succulent bite (even got a \"really?\" stare from Lori when I picked up the bowl and guzzled some of that juice down)!  Hey, it's not that fancy a place!  I'll be back with friends, too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "qXlvEyl8Xmnl1Xo1g9oTbA",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. PEI mussels in tequila lime sauce.  Great value and wonderfully tasty.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qXlvEyl8Xmnl1Xo1g9oTbA/o.jpg"
      },
      {
        "img_id": "9BdNLpdKo5F6SInNCYoXNA",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Delicious French onion soup with gooey cheese.  Mmmm.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9BdNLpdKo5F6SInNCYoXNA/o.jpg"
      }
    ],
    "user_id": "CjHWRUKXhhley9N9NLS07Q"
  },
  "ufBvzo4TlIcCr3wMbj-k-A": {
    "date": "1/7/2018",
    "text": "Met up at this small rustic looking chill honey comb hideout last night with some friends, i had already eaten so i just indulged in a specialty craft drink. Placed a order for the spicy booty loop drink.Was quite tasty but not $14 tasty. The looks of this place i do love as well as the laid back scene with old school music and more mature crowd.Their was one small problem my friend as she was drinking her drink she had a grey goose mixed with vodka she found a hair in it as she was drinking it the waitress did bring her out another one and apologized. Look forward to seeing what the actual dishes are like.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IQS-Hg6hJCT4iKmuw9MUgA",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IQS-Hg6hJCT4iKmuw9MUgA/o.jpg"
      },
      {
        "img_id": "hw9_9Xp8qTVB4-ASFhO-lw",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hw9_9Xp8qTVB4-ASFhO-lw/o.jpg"
      },
      {
        "img_id": "A9FFU3alMnLx2mef5J5Fvw",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A9FFU3alMnLx2mef5J5Fvw/o.jpg"
      }
    ],
    "user_id": "NVVknS1I51z8wY5NNrJ6vQ"
  },
  "w2_mKgAwYp4vqEbKS5r0sg": {
    "date": "8/23/2018",
    "text": "Loved the lunch here. It's hidden underneath Jason's Deli.  I had the soon to be famous fried shrimp sandwich and my lunch partner the quinoa bowl with salmon. Loved them both! Also liked the half price Rose' which is for all of August. I look forward to trying dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVidDZUvOiy3xl0v3WKJlg"
  },
  "8ZOwV0xLvI_C_P-rujyvbA": {
    "date": "4/24/2017",
    "text": "Yo! What's up with people not coming to this joint???? It was dead. Calling all yelpers! Check this place out. They pimpin when it comes to food and service! Forreal!  It was just me and my homies there. My home E appreciated the fact that they didn't have sports playing on the TV's Hint hint ladies. I know how it is going to a joint with your guy, and his eyes are glued to the tv cause some sports game is on. Not heeeerreee!!!  So I'm on a veggie and protein diet and it was either the salmon dish or the short rib dish. Whatever I decided on the lady was very accommodating as she overheard my diet plan.   The short rib dish was fiyah!!! It was so tender and flavorful. Literally, meat just falling off the bone. I couldn't eat the root veggies because there's sweet potatoes in it (yea I can't eat that) so I got the sauteed Spinach which was pretty good.   The top of the pepper shaker was loose when my friend tried to add pepper to her pasta dish so they made her a new one, allowing me and my other homie to eat the fish from the dish (no charge) so of course I took a scallop which was big, juicy, and cooked perfectly with a delicious buttery flavor, as well as a shrimp that was the same. Loved the flavors. I like the ambience. I'd definitely go back... especially for brunch... well when I'm not eating only protein and veggies.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wjuoTTTSSqaQjj8TqSBknA",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Big Ass Scallop from a Linguine Dish",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wjuoTTTSSqaQjj8TqSBknA/o.jpg"
      },
      {
        "img_id": "htIDmF8_Thfi1IgCxO3JWQ",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Braised Short Ribs with Sautéed Spinach",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/htIDmF8_Thfi1IgCxO3JWQ/o.jpg"
      }
    ],
    "user_id": "yy7shAsNWRbGg-8Y67Dzag"
  },
  "ugme4o8oD10YXLP8pXAIgw": {
    "date": "4/25/2017",
    "text": "To be fair - I would give 3.5 stars.   Some of my girlfriends and I came here and we're surprised how empty it was because it was pretty good.   The service was great! In fact, the service we received was above and beyond in every way. I went with the French onion soup and short rib flatbread. The food was really good. Where it was missing for me was the price. I had soup, flatbread and one bottle of beer and my tab was $30. To me, that was a bit pricey for what I got. With that being said, the food was good and we had a good experience there.   Note: there was some CSI type of show on the television that had decaying bodies on an autopsy table and a brain being sliced. I was a detective in a previous life and love that stuff but not while I'm eating.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NpUhyViYTVPoLFiqQf8dmg",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Short rib flatbread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NpUhyViYTVPoLFiqQf8dmg/o.jpg"
      }
    ],
    "user_id": "QGKOTCbS-gpAMWPADGmf0w"
  },
  "yZF2slXb1ksxoyW9akqb4g": {
    "date": "2/24/2017",
    "text": "Cozy spot for drinks or dinner. I ordered the pork chop and it was a very generous and delicious portion for what I found to be a very reasonable price. I highly recommend this place to any of my Charlotte friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VELRaWKL9NCB71TbRouHtA"
  },
  "gRoyYwgYRRLMNyVZMEiAkw": {
    "date": "12/3/2016",
    "text": "Great find in Parktowne Village. Small, locally owned restaurant and bar. Local craft beers on tap and full bar with a selection of craft cocktails also. Good menu for a Saturday lunch stop, tv's inside and out with college football. The kitchen is run by a Johnson and Wales grad with a shrimp burger and a salmon blt that are must haves! A new little gem that is definitely added to our list. They are also open for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-sQrD7VDBeHzU5iGSH5trg"
  },
  "C31pKJEs3sRflhSZUscvhA": {
    "date": "2/27/2017",
    "text": "Great ambience with wonderful cocktails. The shrimp sandwich was a huge portion and very good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DdT4Lagt1ikhGbH1cMbrtA"
  },
  "eY_bkukl2V-Q9jR6bdMsRg": {
    "date": "4/4/2017",
    "text": "The  waitstaff was alsome, the food was absolutely horrible and believe the waitstaff knows it, because they don't ask you how the food was when you leave your plate full of food, we order the steam buns (15 min cook time), just give me a spoon full of sugar, the buns were sweet and the sauce was sweeter, the pork was sweet and burnt tasting, the vegetables on the bun also sweet, did not learn flavor profile in school, let's talk about the pork chop, look at the picture,(25min cook time)Burt on one side and barley  grilled on the other side, it was tasteless and the sauce was even worse, it was like a paste, not demi, apple butter, no just sugar again, no taste of apple,  fingerling potatoes also sweet and over boiled, the spinach tasted like sweet mowed grass, maybe pastry degrees from JW, but not in hot food preparation, so with a open kitchen  you as chef should not be twerking, inappropriate behavior for a chef,  instead concentrate on the food and timeing",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g53x8B16cRCucNn7Qtm28w",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Burnt pork chop, more flavorless food",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g53x8B16cRCucNn7Qtm28w/o.jpg"
      },
      {
        "img_id": "GQLZ8po1yHwdbaCI7_emdA",
        "caption": "Photo of The Turnhouse Grille - Charlotte, NC, United States. Sweet ass steam buns, please more sugar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GQLZ8po1yHwdbaCI7_emdA/o.jpg"
      }
    ],
    "user_id": "Z8sNz_pHjV1opvI9H1tfQQ"
  },
  "k9fllEWHyRv82KD8k0wllg": {
    "date": "10/11/2016",
    "text": "Amazing atmosphere, food competing with any 5 star restaurant, kind staff and great drinks. Can't go wrong with this place!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0nrr1rKUKBA0RJinPhQwBg"
  },
  "whTBUNi8Y9A0Sj4lFxvxrg": {
    "date": "11/5/2017",
    "text": "I had the crab cake Benedict with a side of sweet potato hash. It was delicious! The restaurant is a nice spot for brunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v_R2z8pBiIjj-4t3IQA9Yw"
  },
  "Qo9ljM7H8ukWL6a5u0UEoA": {
    "date": "6/9/2017",
    "text": "Great food, great atmosphere! Very accommodating, highly recommend. Steak frites great for two! Might want to ask for little/no peppercorn seasoning, a little strong tasting but otherwise very good sauce and ribeye!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2RwS7l8tc5yP_lviS4erg"
  },
  "42321T9_JUR3Y0F2F1hLSA": {
    "date": "9/29/2017",
    "text": "Nothing impressive here.  The menu seemed impressive on first glance, but unfortunately was extremely underwhelming.  We got the burger, french onion soup, peel and eat shrimp, and cheese plate.  The $14 dollar burger we ordered medium well was extremely overcooked and burnt.  The bacon tasted like it had been sitting out for hours and had no crispiness.  The Cheese plate was essentially over portioned wedges of deli cheese without any type of attractive presentation, and the shrimp was basic steemed shrimp with some old bay.  This place is charging premium prices for sub par food.  They were empty on a Friday night and perhaps that is why.  Don't understand the good reviews?  Service was attentive and friendly and the only positive of our experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "04bXF7iSGBkKUlPCpsYIMg"
  },
  "VxlkdOrrb9y8p-oeImyA7A": {
    "date": "5/27/2017",
    "text": "I had the omelette and grits. Let me tell you...the grits were fantastic! The hubby had the burger and fries! The bun was toasted to perfection! It was a great meal! We will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rm-Ix_wGaD2z2oA7jwmKYA"
  },
  "RbziCkO-0rsNqESjjOWs4A": {
    "date": "6/11/2017",
    "text": "This gem is tucked away on the corner of Woodlawn and Park, downstairs. It is worth the trip, the food is excellent, the cocktails are excellent, the service is excellent. They have outside dining as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KrwJQ_PNEmMdlbsHc_L3pg"
  },
  "Yop8dJTofYHfElkZ6WNGfw": {
    "date": "11/8/2016",
    "text": "Amazing staff and food. Quick service and great at giving suggestions if you're indecisive like me. I would highly suggest it if you're looking for a place with a chill vibe and tasty meals.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oivyCbr9uU6o9HquaW-j6g"
  },
  "LaKPQw8msIpRvBBWvdhGVA": {
    "date": "7/22/2017",
    "text": "Great food and great service! Really pleased with our experience!... it's pricey for dinner, but it's worth it! Sitting out on the patio when the weathers nice is great. Not the best location and I know other restaurants have struggled down there, but I hope they make it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QrbZ4Qz8hNtGW93XwZwiVw"
  },
  "Ny2dB_lG_txxUEXEdUjkVQ": {
    "date": "2/24/2018",
    "text": "Honest opinion of this place is, it's just alright. For the price and selection of the menu isn't worth it. My boyfriend got the steak and order it medium rare. Although it came out medium rare it obviously had been put on a high heat grill to speed up the process and completely burnt on the outside. I myself had a salad with salmon which was also burnt on the outside and over cooked. I asked to add goat cheese to my salad and when the check came realized they charged an extra $3 to my $15 salad. The servers wear leggings and a t shirt with tennis shoes...I've served in all kinds of places in charlotte before from bars to fine dining I'll never judge a uniform but for what the restaurant seems to be, it should change its menu. I've never left a bad review but I just feel like this place isn't really anything worth spending your money on. Two glasses of wine, a just okay steak, and a crispy salmon salad for $100 just wasn't worth it at all.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91MxqHMpV8vZFe8G__sNCw"
  },
  "Qw4bbB6diXJdPzJewUggAw": {
    "date": "7/6/2017",
    "text": "All I can say is THG did not disappoint. We came in for an early dinner which was very good. Service was above and beyond. We started with mojitos and ordered the short rib flatbread and oysters as appetizers. For entrees we had the short ribs and the salmon. Both were excellent with great flavor. For dessert, we shared the tuxedo cheesecake which was definitely decadent. We will certainly go back again!!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GKbCobQmSGc9NryeUfGhwg"
  },
  "hxp6Ns9UpPKUcCBEO1s0qQ": {
    "date": "5/14/2017",
    "text": "Enjoyed a gorgeous Sunday early afternoon at Turnhouse. The adults ate the Crab Cake Benedict while the kids smashed the Banana Bread French toast. If you pass by this place, I recommend you turn around and give it a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sC1OSYRD81mcGuFGFz_WkA"
  },
  "fXQ-rgt_OUAys7qbETTsVQ": {
    "date": "5/4/2017",
    "text": "My husband and I will be back!!! Great service, excellent cocktails. Food was delicious and we truly enjoyed the atmosphere. Thanks John! Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cHXtz0Kq_Pzwb-Ct5PWH8Q"
  },
  "nr0jKolDaRGXed2S2ND-gw": {
    "date": "11/25/2016",
    "text": "Love this place. Small but cozy with friendly servers and bartenders.   A nice little serendipity after getting massages at Zen. Awesome cocktails and great food.   Love the music and the vibe!! Definitely will be a regular  stomping ground for us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9rpr4yXy3jkHfsJ1oH38zQ"
  }
}