{
  "V3x5S2UF6uVhhvq0JrPvqQ": {
    "date": "2/20/2017",
    "text": "Just after work drinks so far with light snacks, but enjoyable time. Nice cocktail menu and bar snacks -- not cheap but not over-the-top pricey. 22 beers on draft or something like that with all but a handful being from local breweries.  If sitting in the bar area, sit at the bar or at a regular table along the edge. The high bar tables have the trendy chairs that most in my party couldn't sit on for longer than a few minutes. The waitress was great and immediately moved us to a table.  Have heard really good things about the food so will be back to try that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ewUI79hQZnaSWJRJZ2GoQQ"
  },
  "Lnu1QayqwNI-ltokMzPPLQ": {
    "date": "5/22/2017",
    "text": "On recommendation of a couple in our group after attending an Uptown function, we wandered into the beautiful space that is Stoke. We sat near the open kitchen and peppered our wonderful waiter with questions about the beautifully prepared items being served. The cocktail menu was interesting and tasty. I settled on the Sticky Pork Shank with a side of Broccolini and was not disappointed. Others chose salads, Gazpacho, the Tilefish special, etc. with raves from all. Despite the crowd and the airiness of the space we were able to carry on our conversation. Our waiter was fun and knowledgeable. I look forward to our return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1DrC2YybloxcXpGw1KrwqQ"
  },
  "tY8-n1zscrixNjMghXV7NQ": {
    "date": "9/30/2016",
    "text": "A very nice friendly greeting from Cassandra was a great start to our first visit to Stoke. We wouldn't have changed a thing about our experience there! Michael, our sever, was perfect (helpful, genuine, friendly, attentive but not hovering), as was the food! We started with the Avocado Toast, and I had the Charred Watermelon Steak, which looked small to me when they brought it, but it was perfect. My husband had the Sticky Pork Shank... fabulous. We also had the BBQ Carrots, and for dessert we shared the Coffee Cream... great! Not too big and not too sweet. Perfect again! We will return, hopefully very soon! Love when we find a great place we can walk to!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rUXb7MjnsqaWZ-vHtX_e7A"
  },
  "_r3Q82YLCV3lvjPx0OYhSw": {
    "date": "11/15/2016",
    "text": "One of my regular restaurants in Charlotte. The food is very high quality, the service is fantastic, and the location is unbeatable. I highly recommend the watermelon steak and lamb merguez for appetizers, the lamb and the pork for a main dish, the succotash and blistered tomatoes for sides, and the big donut for dessert. You will not be disappointed!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L8FuNbxOIAjUwv_RkRbR9A"
  },
  "Z-Ivf4B-ftk3sbh2i80c7A": {
    "date": "1/15/2017",
    "text": "Excellent food and cocktails. I also really enjoyed the atmosphere. Every dish was delicious. My wife and I started with deviled eggs and broccoli salad. She had the grouper special and I had the ribeye. Brussels sprouts was the side dish we chose. I had the bartenders handshake for a cocktail. Really great farm to table experience. Every dish was spot on. Great flavors and well presented. Highly recommend. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0NMdyXqjjw7WHYVUFxqww"
  },
  "sf3vbubh3hyGsPnj2xKINw": {
    "date": "11/13/2016",
    "text": "Great new restaurant. Food and cocktails were great. Smoked chicken was amazing with lots of meat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-g0euqUjlkSM9NDM1C9uxQ"
  },
  "BxWzbJY_kXRNgC56ktcfkA": {
    "date": "11/23/2017",
    "text": "The food here is mostly locally sourced (the only stuff that's not are stuff you really can't get).   Food was great, portions were ample (the doughnut is enough to feed at least six).    Pretty deep winelist.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yeVWHtqOT4-c8Pi4JPVnig"
  },
  "6bF9MD_j6tkqQ3jrm_kpOA": {
    "date": "12/3/2016",
    "text": "Give the 3 stars because place is homey and with good service. Food is mediocre though, unfortunately will not return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rl1lYvSoLO0TitjMTDAo2A"
  },
  "eIjf2vEbWorZESAhMiZq-Q": {
    "date": "1/21/2017",
    "text": "Excellent overall great 1st experience!  Go here, you will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VLj6Z9_pjNJwJ-8-aqMvFg"
  },
  "l1xRXCRCkiwUX947VZTNEg": {
    "date": "10/20/2016",
    "text": "Just had lunch at Stoke and it was delicious, I had the lamb hash with eggs on top. Not sure why it is called hash as it is not chopped up lamb. I think they should rename the dish and call  it delicious lamb dish.  The lamb is served over fingerling potatoes and has a great condiment on top. Service was great also. I hope to back tomorrow and check out the bar in the evening as I am partial to bar food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cziRQQ6D7ogpL1gQWEbqRw"
  },
  "Vf0HPN88CW2G3sNxdkVe9w": {
    "date": "3/6/2017",
    "text": "I was really disappointed by my first experience with Stoke.  We had reservations on Friday with another couple and were seated in the bar area at a high top table.  The seats were wide but shallow and incredibly uncomfortable.  Our table mates had to stand and constantly readjust, and it became a joke throughout the night as we watched other guests squirm in their chairs for relief.  Our server rushed us to get drink orders in, but I asked for time since we were sharing the one cocktail/wine menu among the table.  I had to remind the server about my drink order and waited an additional 15 minutes for my glass of wine to arrive.  We ordered the meat, cheese, and pickle tray as well as pretzel brioche for appetizers.  The pretzel brioche and whipped butters were good, but no one ever told us what the butters were.  We figured out one was mustard, one honey, and the one in the middle was a mystery butter.  There were very few pickles on our plate (one slice of jalapeno for example) and we had to ask for more bread.  In addition, I didn't like two of the three cheeses that were served, and I can't say that has ever happened to me before.  Our friends ordered two entrees to share, scallops and lamb, and the server left before taking the order for the other half of the table.  We had to call our server back to order.  My boyfriend and I shared the sticky pork shank and sides of brussel sprouts and crispy fingerling potatoes.  I enjoyed the pork shank more than my boyfriend did and the brussel sprouts were not crispy like I would have preferred.  All in all, we could have prepared a better version of this meal at home.  If the food was amazing and the service lackluster, I may have been able to overlook the deficits of this restaurant.  However, when a shared meal costs over a hundred dollars (in Charlotte no less), I expect the food to wow me and the service to be up to standard.  As a former server in a Michelin star restaurant, I know what level of service to expect and what is unacceptable.  For example when spending $150 on dinner for two, I expect the silverware to not be placed in a pile with the napkins at the end of the table.  Unfortunately, we will not be back to Stoke.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zXKMWn6WgO84kPRlNvqb-A"
  },
  "XWsbzbS4_l_05oDNJJkQ3g": {
    "date": "12/1/2017",
    "text": "The donut here is decadent. Absolutely decadent and worth every penny. The service was better than most restaurants in service. Food was fairly small portions. The scallops were great, but hardly came with much of a side/vegetable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "56A7L8sxt2rfpMgbfSdXBQ"
  },
  "Tmb68hWvSrTV4L18MFrPug": {
    "date": "3/2/2017",
    "text": "A couple weeks ago I headed to Stoke for some cocktails with a few coworkers.  This was the first time any of us had been and we were pleasantly surprised.  We learned that the establishment places a large emphasis on being a part of the community by using local ingredients and serving products from the surrounding area.    Stoke offers many of the Charlotte and North Carolina beers which placed the state on the craft brewery map.  Some of the beers on tap include NoDa Brewing Company, Wooden Robot Brewery, Triple C Brewing Co. and Wicked Weed Brewing.  They also have a great list of unique craft cocktails.  Many of the cocktails on their menu are old classics with a twist.  We learned that one of these concoctions, The Uptown Sour, intrigued a Marriott executive so much that he jumped on a plane so he could try it for himself!  The desire to use local ingredients can also be seen in their food.  We had a few of their appetizers (pretzel brioche, beef bone marrow, crispy oysters) which were all amazing.  We could tell that this group understands the importance of top notch service when the Director of Eat & Drink, Sean Potter, delivered our appetizers to our table providing us with an informative description of the ingredients and preparation techniques.  The staff was friendly, helpful and attentive.  I loved Stoke's open kitchen design which compliments the modern yet welcoming atmosphere very well.  Although the restaurant is located within the Charlotte Marriott City Center, this is definitely not your average hotel restaurant.  Chef Chris Coleman is doing a fantastic job which has created national attention.  Stoke was listed on USA Today's Top 20 Restaurants to Try This Fall (2016) and that's a well-deserved accolade.  You should definitely add Stoke to your must try list in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ktdSi54nDnX5CI1JTUvTkQ"
  },
  "YeyLNlJVk0MIVyK9pNfSsw": {
    "date": "11/12/2017",
    "text": "Great happy hour spot. Centrally located, great vibes and lots of seating options. . Nick the bartender is great! I recommend his old fashions. For snacks you can't go wrong with any of the small plates.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IhdlB6-oRTwLPH36uj_mng"
  },
  "3gFYN4D1SY6yn1ye29aobg": {
    "date": "11/28/2016",
    "text": "Best restaurant in Charlotte. Period. Comparable to places I frequent in NYC. The pork shank is one of the best dishes I have ever had and the service was on point.  Don't forget to order the donut - you won't be disappointed!  Have already made reservations for New Years Eve.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w1Li0BKl7sgkjvoTtiuCSg"
  },
  "jmt-QpQ9ADo-Ebzzh0_vdw": {
    "date": "10/6/2017",
    "text": "This place is awesome!  From the atmosphere to the upscale, unique southern fare, this place gets it right on so many levels!  Food selection, service and overall experience have been great each time I've eaten here and I don't expect that to change any time soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "si-sigbPPkNGUbC7Y6Cq-Q"
  },
  "-ND-AMQ9xOSIQ7IpJCL6Aw": {
    "date": "9/15/2017",
    "text": "I was in Charlotte for a conference and had the pleasure to eat at Stoke. Wow. Had the cheese and ham starter and the pork shank as the main course and was very satisfied. The Southern Bourbon starter helped of course but the food was exceptional.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "97igXCwYE2c-6pLUUbOx7g"
  },
  "qWrfiP1qakGUdZDKVXJSiA": {
    "date": "8/28/2017",
    "text": "Very well done restaurant from top to bottom.  The ambiance is great and very modern, open and inviting.  My friend and I sat at the bar and had drinks and dinner there.  The pretzel starter is delicious and recommended.  Just salty enough with 3 butters to make it even better.   Then I had the pork shank.  While I am not usually a fan of sweet sauces, this worked with the meat well.  Sides were the rice grits, the star of the meal in my opinion, and the roasted corn medley which was very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sy_hwluk_ooPhP_GT6mr4g"
  },
  "v2pXw6TPW_PWch2-3Ny7hg": {
    "date": "12/31/2016",
    "text": "My husband and I came here on New Year's eve in anticipation of having a wonderful evening. We looked at several menus online to see where we wanted to go. We picked this restaurant for a couple things on the menu that suited us both. When we got to the restaurant on New Year's Eve they had just changed the menu and the items we were looking forward to were no longer there. It seemed there were other dishes that were just ok, but not what I was wanting. Why would a restaurant change their menu one week prior when people made reservations weeks in advance for a place they wanted to attend. Needless to say we had a bottle of wine and a charcuterie plate and left....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SQDVjSyPFGVESSWLCMf1PA"
  },
  "aaAf12aOKHn4J2E2zg6Tdg": {
    "date": "8/21/2016",
    "text": "Delicious variety of crafted drinks.  Very cool draft cocktails.  Try the Moscow with watermelon!! Atmosphere was very inviting.  Staff was extremely professional.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H6EBorhsweMCmONjvYkX5Q"
  },
  "BdWzLbdkiDCzdb2k5Z0ZVA": {
    "date": "12/20/2017",
    "text": "Its a nice place to come out for drinks afterwork. The bar area is nice and spacious. Not so crowded or loud that you can't talk. We've several times had a high top table that seats 10. Good drinks and nice local draft beer selection. Some good appetizers so you have a little food with your fun. Overall, one of the better places if you want drinks and be able to talk without yelling.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5qk2OW5PLcmQ2ryBcn0ZXQ"
  },
  "69nsvS341xnSphmxzWXJnQ": {
    "date": "12/30/2017",
    "text": "Excellent choice for dinner with friends. We shared little plates- fabulous octopus, duck tamale, great pretzel brioche and deviled eggs all super yumm. We shared the papardelle with short ribs with such a rich, intense flavor. We also shared the red snapper in a ginger sauce and got rice grits with an egg- like a savory rice pudding and the fresh peas which for me were the only thing I wouldn't have ordered- service was top notch- Molly was professional yet friendly . Too full to order dessert",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l6jrqB95P4alQkRHq9OWnw"
  },
  "9VvD6aqKnAStK4bCqgJtcw": {
    "date": "2/15/2018",
    "text": "Had an amazing experience last night, Valentine's Day with six great friends.  Our server, Destiny, was incredibly kind and attentive. The food was amazing. From the duck, to the Porkchop, to the steak, to the scallops, every single person had an amazing meal. We sat close to the kitchen and watched the cooks work their magic.  I would never have thought such a wonderful meal could be had at a Marriott hotel restaurant, but this place blew me away. I can't wait to go again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KIigytGsPGLT_lL8hA0ATQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KIigytGsPGLT_lL8hA0ATQ/o.jpg"
      },
      {
        "img_id": "kGUdPUt-0xDrawWFJU-RdQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kGUdPUt-0xDrawWFJU-RdQ/o.jpg"
      },
      {
        "img_id": "ESCM45bMOAhl4nKdfoLDew",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ESCM45bMOAhl4nKdfoLDew/o.jpg"
      }
    ],
    "user_id": "uLDKrbA2E2SMUZ3B9RhdUA"
  },
  "EWqu4glcmruuCZAZXr3uXA": {
    "date": "2/8/2019",
    "text": "Only giving 3 stars only for the appetizers. They shined on the appetizers,  but the entrees were extra salty. I had the duck special. All my friends thought I was having broth instead.  It wasn't attractive to the eyes. I had a really hard time cutting through the duck. The shape of the bowl didn't help either.  My boyfriend had the scallops. The scallops and the veggies were way too salty.  There are plenty of other restaurants that I would rather go to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LetrO8RPycAEifdzDEeIXg"
  },
  "7Z6ZphPNBwnSDggiHONlKg": {
    "date": "11/5/2017",
    "text": "This was our first time here. The ambiance is perfect. The mixed drinks are really expensive $10-$20 to be exact. The mimosas were also $10. The food took about 25 minutes to come which is a very long time. However, I must say, the food was absolutely amazing! I got the madam croquet and it was cooked to perfection! My husband got eggs and avocado toast and both were simply amazing. Everything tasted so fresh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kX-oTXuluTVcIcNVT4g3Pg"
  },
  "p_SKXw0ZOHV2lFRF_usesw": {
    "date": "10/9/2016",
    "text": "Love this place- definitely under the radar in Charlotte.   Breakfast Review: The rice grits are out of this world! The service is a bit slow but everyone is super nice. My one complaint would be that they don't have a brunch menu on Sundays, only a lunch menu after 11. They were very accommodating, though, since it was only 11:05 and we were able to get breakfast. The fruit bowl was really fresh and we watched them shave the country ham that went on our plates! I'm pretty sure the delicious coffee is from Coco and the Director  (also in the Marriott) and is a nice change from the black sludge some restaurants try to pass off as coffee.   Drinks Review: The drinks list is awesome! We split one of their cocktails in a French press and it was a good value (2 drinks for $14). I'm not a huge fan of rum but it was still pretty good. I hope they add more pressed drinks in the future because the concept is really cool. We also got a loaf of the pretzel brioche and it was amazing! Definitely a cool spot to grab a drink and snack while in uptown.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "T5K9k7VP2fmqIXKQG1pROA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Pretzel brioche bread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/T5K9k7VP2fmqIXKQG1pROA/o.jpg"
      },
      {
        "img_id": "0JdMlz25frXDM0C_ok5F3g",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Pressed cocktail",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0JdMlz25frXDM0C_ok5F3g/o.jpg"
      },
      {
        "img_id": "pBG91JO35kLRkwxu75nbVg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Avocado toast with a poached egg",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pBG91JO35kLRkwxu75nbVg/o.jpg"
      }
    ],
    "user_id": "XRSCBMm1lRwSNCRUCTGA9g"
  },
  "69tfTClGD8nClb1PN7yqnw": {
    "date": "1/11/2018",
    "text": "This was my first trip to Charlotte and I came here on a business dinner and had the short rib dinner. It was delicious. This place has the best \"donut\" you'll ever have. I highly recommend trying their donut desert, it's so light and sweet and hits the spot!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HJ__IUMbrv1MGkBND5dAnQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HJ__IUMbrv1MGkBND5dAnQ/o.jpg"
      }
    ],
    "user_id": "Ak_Qy5MQcSsktJp4Xr6YpQ"
  },
  "Jgk0gdcLV9rR7TOQcG4IAw": {
    "date": "9/13/2016",
    "text": "This is the new restaurant in the Marriot Hotel.  I've only visited for breakfast so far, and the steel cut oats with almond milk, vanilla sugar, almonds, and blueberries sounds more flavorful than it is for $6. The restaurant itself has a open floor plan, but the entrance area is a little confusing.  I plan to return to try something on the lunch menu and hopefully have something more.....flavorful:-)",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7RqZf1fU9etOu9-b3NjkvQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Rice grits bowl with field peas, sausage",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7RqZf1fU9etOu9-b3NjkvQ/o.jpg"
      },
      {
        "img_id": "0AtfGaxnwvzVRWuVjUno_w",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Steel cut oats with almond milk, vanilla sugar, almonds and blueberries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0AtfGaxnwvzVRWuVjUno_w/o.jpg"
      }
    ],
    "user_id": "9IRuYmy5YmhtNQ6ei1p-uQ"
  },
  "oLVEiPqy6FT1lwd_wR-pyA": {
    "date": "6/17/2018",
    "text": "Ever had their 1 lb doughnut? Well you need to. Plus the Southern menu and vibe are pretty spot on. I appreciate the attention to detail and I've tried a lot of their menu items. The chicken biscuit is one of my fav things.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4jqMA5vhPQ4W2Aa6UUw7MA"
  },
  "wW-Zl2KIUNVUZ-BwK0qhcA": {
    "date": "6/28/2018",
    "text": "Simple menu great food they did have a lot of pork options which I wasn't too happy about because I dont eat pork but will come again if I'm in the city I loved the atmosphere!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5cpVxcVB8_NOq_xIfk74TQ"
  },
  "6EtcHI6xHqtIWcvRJwFiTw": {
    "date": "9/18/2016",
    "text": "Our friends took my partner and I here for dinner while visiting Charlotte this weekend. Food was fabulous- I wasn't thrilled with the cook on my steak, but the cheese grits were INSANE and everyone else was delighted with their meals. Cocktails are awesome- plan on at least 2-3 when you go, because trying to decide on one is impossible. Our server, Pamela was phenomenal...she should be running the house. :-)  Oh, and Pamela? I totally beat him in the Scrabble game that night!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xtr8A3CKa95xivDJKhO3-g",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Pamela, here&amp;#39;s the final score on our post-dinner game!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xtr8A3CKa95xivDJKhO3-g/o.jpg"
      }
    ],
    "user_id": "HpsZpSDKq9xtAS5c4bxdWA"
  },
  "SKurS_4l7JLBeuwlkSfoKA": {
    "date": "10/23/2017",
    "text": "Made reservations for Saturday night at 6:45. When we arrived (they have valet parking) we entered the restaurant and was greeted immediately. Once we were seated our server Molly greeted us and grabbed our drinks. The decor was a modern but rustic theme. I definitely enjoyed it. It wasn't dressy attire (I mean you are in a hotel after all). I did not see any children though, but I was not looking for them as well.   - pork belly: IT WAS AMAZING!! It was very tender.  - Pretzel bread: It came with three different butters. The first was a bit on the sweeter side but still pretty good. The next was a cheerwine butter (I LOVE CHEERWINE). The last was my favorite which was the honey butter. The pretzel bread was DELICIOUS. I wanted a whole pan on the bread.  - Deviled eggs: They were pretty good, very creamy. There is a bit of a spice, but very mild. Also, they cut the bottoms of the eggs so they sit flat, so be careful when you bite into them.  - Winter Vegetables (I think this was the name): They were refreshing and light! It was nice to have something to almost \"cleanse\" the palette.  - Scallops (entree aka \"Large\"): They were a pretty good size (not too small - like some restaurants have). They were tendered and fresh. The broth (just a little on the bottom) was very good, and added some extra flavor to the dish.  - Pork Shank (entree): MY FAVORITE!! The pork was so tender and flavorful. It literally fell off the bone when I was cutting it off. You honestly do not even need to sauce that it came with because it was so good without it - but I love sauces... It was amazing, and definitely my favorite item off the menu.  - Corn (side): It was good, but a little too creamy in my opinion. It was a pretty big portion and you could definitely share it with 3 or 4 people.  - Green Beans (side): There was a little spice, but nothing too hot or overwhelming - just did not except it. There were sliced apple pieces as well! - Broccoli (side): It was nice, and beautiful. There is a little spice in this, as well - just so you know. It was still good though! - Fingerling Potatoes (side): They were crispy (do maybe pan fried? Not sure), but they had an aioli sauce (under them I believe) that was fantastic! it was pretty good! My favorite side dish! - Apple pie (dessert): The filling was very good! They did have oats on the top, which were good! The pie crust itself was a bit hard to cut, and I did not like it that much. We also got it with ice cream (of course). Definitely shareable!   They have valet parking (that's free for Stoke!), so that was a plus.   Overall, our server was very friendly and nice. She suggested items for us, and even chit chatted a little (and I am not a huge small talker, personally). The food was spectacular. I will definitely be back in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l6wqZwWnXt1l-NInReBufA"
  },
  "qlI_IHeogmVhGJ7pNDISYQ": {
    "date": "11/18/2017",
    "text": "This was a surprise getting out of the Uber at the Marriott Hotel.  Thought it was a stand alone location.   Ok as a single eating in the bar area.  Food was good and flavorful.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A_3PdG9J3J7nXdJIYTUbTQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Bar is good for a single",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A_3PdG9J3J7nXdJIYTUbTQ/o.jpg"
      }
    ],
    "user_id": "2-AMT98xGb74pd8ptTTprA"
  },
  "LiF2OVkDEs-PTxLHBOLOyw": {
    "date": "7/20/2018",
    "text": "From start to finish! Amazing. Drinks and food are great. Service is also exceptional. Will go back again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2VA7P8ogGvaKhM0fS18lAg"
  },
  "uwAo4Y0Bs4nlhDtGODp_Cw": {
    "date": "1/15/2018",
    "text": "Was in town for meetings and decided to try Stoke based on them serving an octopus dish (absolutely one of my favorite foods that not enough people try).  I was not disappointed at all with the Charred Octopus dish which had a Spanish flair to it except for the orange addition (which was an interesting combination).  Paired it with a local Windy Hill cider that was also really good.    The inside of the restaurant is very well done with the main dinning section on the lower level separated from the back bar.  Since I arrived late, just grabbed a bar seat on a quiet Sunday night.  The bartenders working for very friendly and talkative while catching watching Sunday night football.  Will definitely be a stop on future visits to Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LbdanfyiHBjcyopP6gz5xQ"
  },
  "eXIHZouUNHKJBlleIvUhzw": {
    "date": "8/25/2016",
    "text": "Craft cocktails  Local beer  Great food, amazing Chef!  Pretty servers  Phenomenal prices  Located right inside of marriott with amazing ambiance.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rmWjMtWtOJdPzcdMvLqisg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Come out and try our very own stoke edition of knob creek !!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rmWjMtWtOJdPzcdMvLqisg/o.jpg"
      },
      {
        "img_id": "vstvYzK6TbfTs4fVeqeJ9w",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Fresh octopus Yum",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vstvYzK6TbfTs4fVeqeJ9w/o.jpg"
      },
      {
        "img_id": "rrETEJ9RxLKdkkmMJZQ96g",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. THE DOUGHNUT  y&amp;#39;all..... It&amp;#39;s amazing!!!!! Perfect for sharing. It&amp;#39;s a must try when you visit",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rrETEJ9RxLKdkkmMJZQ96g/o.jpg"
      }
    ],
    "user_id": "3IVVuKC8RBjtiwxDBtOwJQ"
  },
  "9MSNe_M8ccSL0JioZ8eHOA": {
    "date": "10/21/2017",
    "text": "Great new restaurant in uptown. We ordered the grilled octopus, bone on pork, scallops and rice grits. Everything was really good. The menu was minimal but the food is worth a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i1J9hNromiV7js4nJUKxVQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i1J9hNromiV7js4nJUKxVQ/o.jpg"
      },
      {
        "img_id": "zLEAtCNx-X9Fpui5-q_S7A",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zLEAtCNx-X9Fpui5-q_S7A/o.jpg"
      },
      {
        "img_id": "xR5TSSH23FWug5tWP1BVaw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xR5TSSH23FWug5tWP1BVaw/o.jpg"
      }
    ],
    "user_id": "5LUfQF-uhCLEeJdv1q01ig"
  },
  "Cpkfh4KEk4N_FoMYt5qoHQ": {
    "date": "12/9/2017",
    "text": "My wife and I were excited by their menu. For appetizers we had the grilled octopus, pork belly and tamales. Sounds yummy right!?   The presentation was good but... the octopus had no char marks and was a tad salty. The tamales were presented in husks. However they were falling apart. Should have been more moist. The pork belly was the best of the three. I would have liked some sweetness or acidity to cut the fat down.  The frieze salad was very good.   We split the Cobia fish special and esquietes  side dish. Unfortunately they over cooked the fish. The smokiness came through. I would highly recommend the corn side dish.  Make sure to leave room for the dessert doughnut. It was the best part of the entire meal!  The staff was very pleasant. The service was a tad on the slow side. We were sitting right by the kitchen and could see our food come up. To be fair It was a Saturday nigh and it was busy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0otMBrEYbVPLwIBo6ad2ZA"
  },
  "7O0w75zPPAGRkmRUTC-ueQ": {
    "date": "11/17/2017",
    "text": "Great atmosphere! My charred octopus was ridiculously salty. If I come back, it'll be for drinks only.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Wsent3QZZxLZXUMXLlgXoQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Charred Octopus....the potatoes that accompany them were really good. The octopus....SALTY! #HighBloodPressure",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Wsent3QZZxLZXUMXLlgXoQ/o.jpg"
      }
    ],
    "user_id": "Y3t7mKa5in7ATCecMslNzQ"
  },
  "gRyL_J5oY862smVhzQlsOg": {
    "date": "10/8/2017",
    "text": "Overhyped restaurant. As many others reviews have mentioned the food is way over salted. This was the case with the Charred Octopus and the Sticky Pork Shank. The pictures tell a different story, it looks appetizing and about to be wowed. Yet when you take the first bite you are taken back by how much salt is in each dish. The octopus was tiny tentacles so it was overcooked. The pork shank looks really good but its probably one of the worst food items i have had in recent memory. I'm giving two stars instead of one because the bartender was attentive and he was helpful. I probably wouldn't return to this restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4ORRa5r4FmU1vKXOtGGRpQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Super salty! Don&amp;#39;t let the looks fool you",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4ORRa5r4FmU1vKXOtGGRpQ/o.jpg"
      }
    ],
    "user_id": "8WE7H_NvgM7V6IA7Ro3Prg"
  },
  "dawDkSFZh5jGJMvk9J9HHg": {
    "date": "9/22/2017",
    "text": "I dined at Stoke in gym clothes (don't judge) and didn't feel at all out of place.  It's a hotel restaurant, after all.  I decided to eat here since I was staying at the Marriott and it was both convenient and had excellent reviews.  I loved the open kitchen concept and the fact that it didn't even smell one bit like a restaurant in the lobby or in the dining area itself.  Some NYC restaurants could learn from this place.  Service was great - our waiter was super nice.  The menu was fairly simple and had a good array of choices, but wasn't overwhelming.  My colleague and I decided to share a few plates and went with:  - Deviled eggs: very mustardy.  If you're keen on mustard, you'll like this.  I would get this again (but you only get 4... womp) - Chicken liver pate: I order this pretty often at many restaurants I go to, but I thought it was very meh here.  A lot of chicken liver and not enough to go with it.  It also had an interesting consistency - Pork shank - probably the worst thing I had that evening, honestly.  The pork shank was decently cooked, but had absolutely zero flavor or seasoning to it, it seemed.  We tried to compensate with the sauce, which I believe is Asian-influenced, but it tasted strange like burnt sugar.  I think I could kind of see what they were trying to get at with the sauce, but it just didn't hit the spot for me.  I'm a fan of the bar area at Stoke, however.  They're fully stocked with a nice selection and the seating is nice and comfortable.  Definitely one of the nicer hotel bars I've seen.  For a hotel restaurant, Stoke is actually pretty good... I'd definitely give it another try, but probably order something else.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "APoAugdz6nscL4HjF4Oryg"
  },
  "wDGTHZbAis_kcX2oxteQ-Q": {
    "date": "4/15/2018",
    "text": "Okay so I wanted to get a really cool dessert for my birthday. I did a google search and up pops this picture of a one pound doughnut! I have never seen a doughnut so big and I decided since it was my big day I should treat myself. This is how I ended up at Stoke! The restaurant is located inside a hotel in uptown Charlotte. My best girlfriend and I went in the afternoon around 2pm. It was not crowded at all. There was no wait for a table which I enjoyed because we had limited time on the meter. I ordered my doughnut and she ordered a salad and a drink. The doughnut came to $18 which since it was a treat was not bad lol. Definitely a one time experience for me but a fun one Indeed. My friend even ordered one to take home! The food came out in a timely manner and the bartender who was tending to us was very nice and attentive. He checked on us just the right amount of times. Overall I'd say the experience was very nice. I'd definitely stop by again on a date or just for a drink so I can try the other menu items. I'd love to see how it is in the evenings. Definitely isn't some fast food place so a few extra dollars wouldn't hurt either lol.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iKhr9DViyPTNwe82VOtM9Q",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. The delicious one pound doughnut from Stoke!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iKhr9DViyPTNwe82VOtM9Q/o.jpg"
      }
    ],
    "user_id": "Gaab6xMGUrKKxsW9tK-VKQ"
  },
  "9OT68vkwk449d9S9_XHISw": {
    "date": "9/2/2016",
    "text": "DRINKS - I dropped by Stoke on a Thursday after work for a drink and quick snack with a few girlfriends.    We work just across the street, so it should have been pretty easy to find.  And, it was...and it wasn't.  Confused?  Yeah, we were too.  You see, the signage isn't clear outside where the entrance is located.  There's a sign by Coco - but, that's not Stoke.  We ended up walking in through the Marriott entrance.  We got there, but it felt awkward and if I were doing it again I'd go in through the atrium area.    Once inside, the bar and restaurant are beautiful. Seriously, this is a gorgeous venue.  The restaurant side - we were not there - has a beautiful open kitchen with tables surrounding it.  The bar is trendy, but not over the top.  The cocktail and wine menu has a great selection of not outrageously priced drinks. There are local beers on tap, with my favorite Wooden Robot Good Morning Vietnam currently available.  The bar menu is small, but with selections ranging from chips to cheeses to oysters and a burger.  We had a small selection - everything was tasty.  Our server was helpful, unobtrusive and available when needed - perfect!  There are no happy hour specials - I would like to see that change to compete with almost every other high-end restaurant uptown that runs specials from 5 p.m. - 7 p.m.  Overall, it was a great experience!  LUNCH - I went to lunch at Stoke on a Friday afternoon at 12 p.m.  When  I arrived, there was one other table in the restaurant.  I always find it a little awkward to eat somewhere that is nearly empty - but, nevertheless we went forward with the plan.   We both ordered the wood finished smoked chicken, i got a gem lettuce salad as a side and my friend got the carolina gold rice grits.  The chicken was very tasty and juicy, but the skin was way too salty.  The gem lettuce salad was small and unimpressive.   The carolina gold grits stole the show - they were so very flavorful and creamy.  The service was prompt and helpful.  A manager stopped by to check in on the food and service and a server offered us some banana bread, that we didn't take her up on, (that she raved about) at the end of the meal.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AQ7rKkIDNSWbtMLGgsr3kg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Wood finished smoked chicken and Gem lettuce salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AQ7rKkIDNSWbtMLGgsr3kg/o.jpg"
      }
    ],
    "user_id": "P0g72ss7P25E4A1Sb-LT_A"
  },
  "TQbnIKHxdXRPUJL-57G7oQ": {
    "date": "11/10/2018",
    "text": "Enjoyed the grain bowl with an extra side of cashew butter and trout for lunch while traveling for work. Healthy lunch in a nice, bright setting - will return next time I'm traveling.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cb7sFKDEJHdsP6ylr1Xmgw"
  },
  "FsW2mzTL1z3iBSrU45yyFg": {
    "date": "2/4/2018",
    "text": "I eat at this restaurant at least once a week, and pretty much tried everything that is on the menu (except the pork). Overall it is ok, a bit too expensive for what they are offering and their take outs usually lack flavor or toppings/dressing.   That being said, their pretzel roll and donut are absolutely heavenly. Order the pretzel (starter) and the donut (dessert) and you will be good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4rA-NSah4y8oSBOOoX27sg"
  },
  "33HwXw9RXdKu0YrS0JmgqQ": {
    "date": "3/21/2018",
    "text": "We came here on a whim, looking for something near by. Saw the reviews here and decided to check it out. We discovered it was inside the Marriott Hotel. This place was wonderful... from the beginning to end. Our waitress, Maly was beyond phenomenal! I really enjoyed talking to her. I ordered the cauliflower soup which is hands down the best soup I've had! She was kind enough to even give me the recipe!!  This was a wonderful experience which I'm happy to share and look forward to come back to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1qlGazIl1LXo-4G0d2oMsQ"
  },
  "I37OkcyjAdhQ77eE5kHa4w": {
    "date": "3/23/2017",
    "text": "Take your rings off and gulp down some H2O. Wow, this place is salty! After taking a few bites, I anticipated my fingers swelling and blood pressure rising.  Hubs and I wanted to check out the newest restaurants Uptown and decided to check this off the list before heading to the symphony.   Stoked is an open kitchen restaurant with terrific decor inside the Marriott. The hostess was super and kind and made us feel welcome. The drinks are one of the other highlights: Maker's Mark served over a giant ball of ice is how it should be.  Then, the rest is, well, disappointing. The server wasn't detailed focused and described the cheese in the wrong order and we had to ask for water refills or for side plates. The entrees themselves were too seasoned and salty for our liking. In fact, we didn't even finish our plates and that never happens.   A night out here will set you back a bit $$$. Go for drinks and ambiance, skip the food.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "Reuq65EOFI938Yg8xgff9g"
  },
  "se7riChlYVv1X8g3btBRJA": {
    "date": "8/22/2017",
    "text": "I finally made it into Stoke!   The ambiance was a great place for a girls night out. The restaurant wasn't too loud so we could chat and hear each other perfectly, the decor was clean and open with a trendy vibe, the seating was very comfortable and great for large groups.  Our waitress was attentive and honest - especially when we were selecting our cocktails. She talked through the flavors and gave suggestions. They were all delicious (especially the mojito).   The food can be shared or single meals. We had the octopus, short ribs, potatoes, peppers, and deviled eggs to share. I can't say that the main food blew my mind or was something I'll come back for, but it was good. I was comparing it to Good Food on Montford since the prices are similar, but the textures just aren't quite there. That being said, the potatoes were surprisingly good - crispy, easy to share, great sauce, well seasoned.  Why we came: for the one pound, made-to-order donut. It was SO worth every last calorie. If I had just had cocktails and this donut, my review would be 5+ stars! The donut is a warm sugar donut with cream on top. It was easy to share and was so much fun. I love that you can add as much cream to your bite as you want (rather than it being hidden inside). Yum!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7JK4avF49-FuFjm08C2ROg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Stoke&amp;#39;s 1 Pound Donut that could feed 6! The warm, made-to-order donut is topped with a sweet cream and what tastes like toffee.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7JK4avF49-FuFjm08C2ROg/o.jpg"
      }
    ],
    "user_id": "y0bL2EZxhzD7DlxGMhUboQ"
  },
  "eg8WdO7xG2DfDvXWgIl_0g": {
    "date": "4/5/2019",
    "text": "Absolutely amazing!!!! Girls night for birthday dinner. Tori was our waitress - she was personable and gave great recommendations on sharing plates (and about other places in Charlotte that we should check out since we're all first timers!!!) Must try: Mac and cheese, hush puppies and Brussels! We had 2 bottles of the whispering angel rose - also amazing! Everything about our experience was spectacular! Thanks y'all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oHC5Q-klbqw87Cq13TFBag"
  },
  "Am8f6ufRbznEDLmMzYOv4Q": {
    "date": "2/15/2017",
    "text": "This review is solely based on drinks and appetizers at the bar. Once we arrived I was very impressed with the layout and trendy yet comfortable feel of the bar/restaurant. I met a friend so we grabbed two seats at the bar and were very impressed with the cocktails and wine options. The bartenders were very friendly and also we definitely enjoyed watching the craftsmanship that goes into making the drinks. We enjoyed a few cocktails and got two appetizers, all great. I definitely look forward to getting back for dinner soon and will provide details on food...although I have heard and read (other Yelp reviews) great things!",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 15,
      "cool": 11
    },
    "photos": [],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "DZuOafkdbasp3vC5_9Zu8A": {
    "date": "3/31/2019",
    "text": "Great breakfast! HC, the awesome cook, is a fist bump guy who knows how to take care of a customer; go several times a week; the food is great and Paige is a great server; can not recommend it enough! Great job guys; keep up the awesome work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rx02L0QqN8Jyc3_cJjb5GA"
  },
  "3c7Fv9Md0AhZ9DaPe6_sKw": {
    "date": "1/14/2018",
    "text": "Disappointed sums up my experience at Stoke tonight. My boyfriend and I came here for dinner for a romantic night out and for him to try their signature dessert- the 1lb dessert donut. My boyfriend got their Sticky Pork Shank and a side of sweet potato pave. I got a regular mojito, a small farmers salad, and a bowl of their cauliflower curry. The food was beautifully presented, but unfortunately it was lacking in flavor. My mojito tasted kind of off and it had a lot of alcohol in in, I ignored the off flavor because I thought maybe it was just all the alcohol. My salad was pretty good but it was small and very basic, I didn't think it was worth $9. The cauliflower curry soup was $6 and it had way too much curry in it which was very off putting. My boyfriend's pork was extremely tender but it wasn't very flavorful and the sauce that came with it was very salty and had an odd flavor. It was a large portion of meat, but for $24 I expected something more than just a hunk of meat on a plate. The one redeeming quality of the meal was his sweet potato pave ($8)- this was delicious. The texture was a little weird at first because the potatoes were kind of hard, but I assume that they cooked it that way to hold the shape of the dish. I personally was dissatisfied with the donut which was topped with a mixture of pastry cream and whipped cream and Heath bar. This was $18 and I felt like it definitely wasn't worth that much. I could understand that price if they brought it out with a homemade chocolate sauce or topped it with homemade toffee, but they literally just topped it with crushed up heath bar. The middle of the donut was raw and the cream on top just tasted like whipped cream. Overall, the whole dessert tasted like something I would get at the state fair, not a high end restaurant. When we got our bill, we realized that I was charged for and given a Moscow mule ($13) instead of a mojito when I brought this to the attention of our server, she apologized but didn't offer to correct the mistake. I enjoy going to nicer restaurants when they have good food, but this restaurant was a complete and utter waste of money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X_mu7iOWpkfkxuzqTiTDyQ"
  },
  "2MYxAnwwD4UuytQ_07XhzQ": {
    "date": "11/18/2017",
    "text": "My friend wanted to have her birthday dinner here & for once I didn't do any yelp research beforehand!  Stoke is located in the Marriott hotel. I strongly recommend putting the Marriott's address into your gps.   1) The atmosphere is so laidback and adorable. We were seated in the middle at a marble table. The pepper grinder on the table was a shiny copper. The restaurant felt very modern.   2) The drinks are good! The cocktails range from $10 - $15, and everyone loved their drinks. No complaints from anyone at the table. My drink of choice was the Apple Orchard (crown apple is life!).  3) The food is where things get a little dicey. It was a hit or miss experience.   Pretzel Brioche bread w/ whipped butter - good Pork Shank - amazing Squid Ink pasta - fail. Everyone who ordered it sent it back to the kitchen. Charred Octopus - one the salty side, but edible Esquites - was okay Fish of the day - meh 1lv donut - yes, please!  Order the pork shank! Pass on the squid ink pasta. It was overcooked & mushy.   I would return for drinks. I would probably eat elsewhere since their menu is so limited.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "sXccOuVx25toGWS86hS4XA"
  },
  "oayK0vT72kmIIpQzfcklIQ": {
    "date": "1/1/2017",
    "text": "Fantastic dining experience!  Small restaurant in the lobby of the Marriott City Center hotel.  They have starters/small plates.  Our favorite was hands down the Pretzel brioche. The deviled eggs were solid as well.  For dinner, you order your meat or salad and sides are served family style (for up to 3 people). I ordered the pork shank and was not disappointed!    The meat melts off the bone into the delicious Chili-sorghum glaze, peanuts, benne sauce.  I suggest the cheese grits (my favorite) and brussels as sides.  To finish it off, you have to order their speciality donut for desert! Let's just say it's not your average donut...but it will easily feed 10 people!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "H-6FdygDoQn8D8BPbZIttA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Speciality donut....easily fed 11 of us",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H-6FdygDoQn8D8BPbZIttA/o.jpg"
      },
      {
        "img_id": "n3Y1aFclx3BRhHv5Y8g-lg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Pork shank with Chili-sorghum glaze, peanuts, benne sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n3Y1aFclx3BRhHv5Y8g-lg/o.jpg"
      }
    ],
    "user_id": "nap5CM2nZvaFodByvUL75w"
  },
  "Htz89Gwcabqwa4iBGQXdTg": {
    "date": "3/4/2017",
    "text": "I had a great experience at Stoke with the wait staff, and I really enjoyed their cocktail menu. We planned a surprise engagement party for a friend, and the hostess and waiter all pitched in so that she didn't know what was coming until they led her to the table.  After a round of bubbly, we ordered a cheese plate and the pretzel brioche. Get. the. pretzel. brioche. It came with three delicious butters, and I could barely keep myself from licking up the Cheerwine butter. The cheese plate changes each time, and one of the cheeses that day was bleu. I personally like it, but the rest of my party did not, which was disappointing for them.  We also ordered a round of cocktails, and I am obsessed with the Lay of the Land (shoutout to Stubborn Burro too). We shared a salad to top off our meal, which was pretty good.  Overall, it has a nice vibe and really got hopping around 8pm. I would definitely come back for drinks, but I did think the food was overpriced for its quality.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hh1M-3aDJZVTwwYYy9AnA"
  },
  "nDDmBsBt8l1pg8CHzipaEw": {
    "date": "3/1/2017",
    "text": "Horrribleeeeee  Horrribleeeeeeeeeee  I must say that I am high disappointed in the establishment. Allow me to start off by saying I contacted Stroke in hopes of having an engagement celebration dinner. I called the number on Yelp and the number on good (same number) and never got any answers. I called a total of 11 times between last Thursday and Friday night and got no answers. I left them a total of 3 voicemails where NO ONE bothered to return my call. I managed to get transferred to the hotel attendant on one of my calls where he confirmed that they were open. Long story short is I'm high disappointed in the companies ability to miss 11 calls and not return 3 voicemails... who does that? Apparently Stroke does!!! And to think I was bribing 21 paying guess with me. Their lost not mines...",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KMZDZqP__XpDKM_pqq6eYQ"
  },
  "XA_TbZwJVLkB-ybVFIx66A": {
    "date": "5/8/2017",
    "text": "Came here on a weekday night at 6:30 pm for a party of 3 (no reservations needed and we were seated right away).   Food: This place follows farm-to-fork principles. We LOVED the charred octopus and the 1-pound doughnut for dessert (could easily satisfy 6 or more!). It was visually impressive and delicious. The shrimp and mussel paella and green farro piccolo were just okay. I probably wouldn't get the scallop crudo again (it was teeny tiny! we were left wanting more).   Service: Excellent! Big thanks to our server Mike for the great service.  Ambiance: Trendy, open kitchen, nice, plush booths, located inside the Marriott.   Definitely worth a visit. Bring friends to try the doughnut! It's elevated the doughnut to a whole new level -- a must try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JQDGFPT88PfgwurWOYhp9A",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. This doughnut was a beast! We had to take this silly photo to show it off. We loved every bite!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JQDGFPT88PfgwurWOYhp9A/o.jpg"
      },
      {
        "img_id": "nYs2ZTk6TUXvgFJ4H6ORMg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. My friend unsuccessfully escaping the picture in the background. We LOVED the charred octopus.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nYs2ZTk6TUXvgFJ4H6ORMg/o.jpg"
      }
    ],
    "user_id": "n2UJWrrHir7dWL7pyFO8Rw"
  },
  "V-8X6HvjYMKagOaHgBmWXw": {
    "date": "12/25/2017",
    "text": "We had a Christmas brunch at this location. The ambiance is very nice next to the wine bar. The service was rather poor since we did not get our first course for a long time. The pretzel bread with flavored butters were really good. The beef tenderloin, pork tenderloin and the trout were just average. The best of the side dish was the sweet potato. The donut dessert was the best part of this meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xE_-bOaOwoOALhV_fsSOhg"
  },
  "4kcLNiryNyWtpDFwMrmA-w": {
    "date": "11/28/2016",
    "text": "I had the opportunity to visit Stoke for a tasting menu one evening. What an absolute treat of an evening! It is hard to describe the perfection of the evening, but here we go!  Stoke is located inside the Mariott and has a large amount of seating with a chef's table and large bar area. The atmosphere is super laid back with a slight rustic feel using wood and metal.   My husband and I ordered a bottle of wine. The wine prices by the bottle were incredible. Retail prices. Additionally, we had a sip of one of the cocktails and it was fantastic!   Since we were there for a tasting menu, we were given our meal based on what the chef made for us. Everything we had was absolutely incredible. During the evening we had the following:  -Deviled Eggs - Im not a deviled egg girl, so my husband got mine (after taking a bite to reconfirm I am not a deviled egg person!) -Pretzel like bread with different butters (blueberry, bacon, and dijon)- The blueberry butter was like heaven -Squash side- This was my favorite. Acorn squash. Super simple but the puree was heavenly -Carrots- The puree was a pesto made with the tops of the carrots. Absolutely amazing and beautiful looking dish! -Lamb shank- Huge portion! Perfectly cooked! -White Fish- The white puree made this dish. I wish I could remember what it was cause I would eat it with everything -Chicken- Super juicy! -Fingerling Potatoes- The sauce at the bottom of these was a tad spicy but perfect -Beets- These beets were outstanding. I mean, most people cant say that about beets but the cheese mixture in it just made them stand out -Giant donut- Giant would be the key word here. We split it with 8 people. Definitely had some entertainment watching a couple try and eat it all. This donut was amazing. The filling in the center was so tastay.   Servers were amazing and the evening was definitely one of the best meal experiences I have ever had. Stoke is the real deal.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 12,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "0sfPhr9hmEkt8VqPUSrW3Q",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Heavenly carrots!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0sfPhr9hmEkt8VqPUSrW3Q/o.jpg"
      },
      {
        "img_id": "sU9CyA8N0fKOMZOWlMkh6g",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sU9CyA8N0fKOMZOWlMkh6g/o.jpg"
      },
      {
        "img_id": "BY8n8JgqJXN8iBsYRZU-jQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Blueberry butter!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BY8n8JgqJXN8iBsYRZU-jQ/o.jpg"
      }
    ],
    "user_id": "Hw5riZfnB-B7G79vBTOssA"
  },
  "MaraT9R9Cx0tLBBB70fSbg": {
    "date": "11/30/2016",
    "text": "#2 on my 10 before the end of the year list. Good grief, did I feel like a celebrity here. Quick backstory, I contacted Tonya P about having a small dinner here and she, of course, made that into a dinner party where she contacted her friend, Chef Chris friggin Coleman, and arranged a full family style tasting menu at a private table right in front of the kitchen where the restaurant was having a professional photoshoot.  Well that escalated quickly. Anyways.  Location is amazing, I love everything about the new Marriot and Stoke is no different. Exposed wood and edison bulbs are all the rage these days, and Stoke uses all them tastefully to convey that what you're eating has been sustainably sourced. There are even chalk boards saying where all proteins and most dairies come from - something which The Lady deems very important, and thus do I.  We all sat down at the white marble table attached to the kitchen and began our meal. Since there ended up being so many options, I'll keep this to one phrase per dish. Some were on menu, some were off.   Cobb salad: Smoked egg (yes, eggs that have been smoked over a wood fire), avocado, frisee, and a light dressing. Nice way to start off any meal. Deviled eggs: If you don't like deviled eggs, you won't like these. But for those who do (me), they were awesome. Accompanied with chicken skin (chicken and egg theme). Pretzeled Brioche with Butters: Blueberry Butter, Mustard Butter, and another one that I forget. Blueberry was life, mustard was awesome and light, and the third was gone too quickly for me to remember. BBQ Bone-in Pork Shank: Get it. Amazing. Chicken w/ Baby Bok Choy: Sauce is to die for, incredibly tender (thanks for keeping the bone in!) Beet + Turnip salad: I'd never really tried either of these before, and this salad made me question that decision. Didn't help that everything was well marinated and had dollops of a sweet cream that paired very well with the tart veggies. BBQ Glazed Carrots: Friggin fantastic. Came with a sort of carrot leaf pesto in order to use every part of the vegetable. Fingerling Potatoes: Came with a chipotle aoli that was spicy and smokey and paired with the awesomely cooked vegetables. Perfect side. Roasted Butternut Squash: Came with this yellow sauce that was on the bottom and mushrooms that just all added to this dish that was the epitome of fall flavors. Savory, homey, and smooth all coming together in an amazing side.  And then it came. The doughnut. The mother of all doughnuts. All I can say is thank GOD that we had 8 people to split it between. While we were there we saw a couple order this, and we all kind of stared in disbelief. It is HUGE. But oh, so good. There's heath bar everywhere and what's essentially a boston creme on the inside. What a thing of beauty.  Overall, I had maybe one of my best culinary experiences here at Stoke. Cheers to Chef Chris for inviting us and telling the story of each dish, as well as putting up with our rowdiness. Friends, please go support Stoke and try some of their menu. There is so much good food to try here, I know I'll be back to support it.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "zI6vjxY9h1fHq3aS3MRCyw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Close up of the mother of all doughnuts.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zI6vjxY9h1fHq3aS3MRCyw/o.jpg"
      },
      {
        "img_id": "noKhUGECbzbneT6GcvTOqw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Butternut squash",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/noKhUGECbzbneT6GcvTOqw/o.jpg"
      },
      {
        "img_id": "VMSvds20HRTsp_cqFv-6EA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. BBQ carrots.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VMSvds20HRTsp_cqFv-6EA/o.jpg"
      }
    ],
    "user_id": "rSQITvDnm1smzJl-3LJz4Q"
  },
  "uvWVhHJYWUacaK5yIFTmvQ": {
    "date": "7/31/2017",
    "text": "What a pleasant surprise to find the best good in Charlotte is in your hotel. Great menu of well executed dishes. Great bar program. This place will not leave you wanting. Do yourself a favor and order the Mexican Corn side dish and  the 1lb donut. Even if you don't finish it you can Instagram it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "j9KqeOuo6KYV5eMnwITrEA"
  },
  "skVQAU7pYK6J4xcvX8IyEw": {
    "date": "5/5/2018",
    "text": "The ambiance of the restaurant was great and for that alone I would give 5 stars. Farm to table foods prepared fresh. The service was fabulous front to back! I love that you can see the kitchen prepare the food while you wait and the coffee was hot and fresh. We went for breakfast and ordered the avocado toast, shrimp and grits, chicken biscuit and French fries. The avocado toast was simple yet delicious. The shrimp and grits was grainy which being from the south(Texas) it was unique, not bad, but not our favorite. The biscuit on the chicken biscuit was dense and very dry so I used the whole pot of coffee to wash it down. The best part by far was the French fries! The were kennebec potato's so the we're a little more starchy, but perfectly cut thin and delicious.  Overall the food I would give 3 stars. The great service and ambiance was why overall it would be 4 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RC5hY3XxGXkAnDpEg7iBbg"
  },
  "-nhLBnt5Np0iAKwvdotlIg": {
    "date": "10/29/2017",
    "text": "underwhelmed. The kitchen staff was heavy on the sodium this evening, apparently. Otherwise, this establishment is acceptable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FfIqVc153sRLDtI8fvA4FA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FfIqVc153sRLDtI8fvA4FA/o.jpg"
      }
    ],
    "user_id": "dQc1rO1srrWZqKvNEklUPw"
  },
  "8oOgFsEMEBQcztIOXz34Iw": {
    "date": "6/11/2017",
    "text": "Hands down the best brunch buffet I've ever had. On our first visit, we were a little nervous about it being a hotel restaurant, but we were pleasantly surprised. We've been several times for brunch and bottomless mimosas(you can pour them yourself)  and can't wait to try it for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7WF5e4vlpOLqUpohuOGITQ"
  },
  "IL1k4YlqPH77j3kcVAq71Q": {
    "date": "9/2/2016",
    "text": "Decent beer selection. Wide variety of hard liquor to choose from. The remodeling project at this Marriott was very well done. Have decent appetizers. Crowded with people of all ages and types. Bar is open late. Friendly staff. Spacious and very nice setup. Has two areas-bar and restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k4LVrBLD5mk71jLLYeeEog",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Vodka cranberry",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/k4LVrBLD5mk71jLLYeeEog/o.jpg"
      }
    ],
    "user_id": "w2CtbME40__e1xpT9IYKxQ"
  },
  "w68fpM0PU2Bt8RhyPe0d3Q": {
    "date": "11/28/2016",
    "text": "One of the most opulent restaurants in the Queen City, Stoke is sure to quickly carve out a name for itself as one of the best. The restaurant features an innovative yet affordable menu making this an easy and wonderful choice for anyone visiting the uptown area or those tired of their usual haunts. As good as their menu is, and it's great, the best part is their one pound (and I said ONE WHOLE POUND) donut they have for dessert. One of my favorite restaurants that has opened in the past year and I have no doubt it will soon be one of yours.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "My7KcXpU_eC6oy1EhxFeDA"
  },
  "_jEIDnEGfXaQsOY7zVxQag": {
    "date": "5/15/2017",
    "text": "I came in looking for \"good ol southern BBQ\"... yup this was not that place. That said I was not disappointed. Top notch service from Michael, well crafted drinks and a clean modern yet southern inspired decor. I had the Pate and Grilled Octopus and both we great little plates. I look forward to trying more on the menu. Pamela stopped by to check in and was so helpful suggesting some sites to visit around town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qpbnLbqpQhFbN4TfgOS3dg"
  },
  "-PbWjnf4mPMYDn8D4nbl3A": {
    "date": "7/15/2017",
    "text": "Unfortunately, drinks at the bar at Stoke did not live up to the fan fare for me that it opened with. Our service was terribly slow and everyone else around us commented as well. The bar was bright and loud - not a great atmosphere for a Saturday night. My cocktail (the Ode to Hemingway) was acrid both from the citrus juice and the alcohol used. My friend asked for a regular old fashioned and was instead served the house take on one which had tastes she didn't care for. I really thought Stoke was meant to be more than a hotel bar, but it just isn't. There was nothing about the drinks or service that make me want to return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8PFxcGBFgHq-lQd0OPjPvA"
  },
  "W2ZJ7KwSwFk9iVNLrrlcTA": {
    "date": "2/12/2017",
    "text": "An amazing find for dinner!! Everything that we tried was amazing and the atmosphere is great. Our server was very knowledgeable about both food and drink menu. Must try dishes are: smoked trout mousse and Brussel sprouts side!! A fantastic addition to the Charlotte restaurant scene.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "evoSS-m1wJS2peaGQZoWYQ"
  },
  "KqcNIOcFJM7Jhgmk7DIoyQ": {
    "date": "1/11/2018",
    "text": "While the ambiance and effort of some of the staff was good, the overall food and management of this restaurant should keep people away from dining at this restaurant. It took an hour for our food to arrive. Two tables around us - one for four and one for two - completely turned over as our table of 5 waited. And waited. When the food arrived, the lateness was blamed on the time it took to cook a well done steak. Judgements on why someone would order a well done Steak aside, a 2 pound steak should take 13 minutes. The lamb shank, fish, papperdelle pasta were all luke warm. And the steak? Warm but pink in the middle! Clearly the kitchen does not know what it is doing. What really made it worse was the behavior of the manager. It's clear she drew the line and blamed it on the order. She wouldn't back down. She offered to replace any of the cold dishes, but we were already almost done as she didn't come over to apologize (or communicate) about the lateness when the food arrived (the waiter did and we complained, but he just blamed it on the steak). Please note that the lamb shank was good - would be better if hot - but would recommend it. The fish and papperdelle were average. The waiter, who took the company line at first, then backed off a bit and outlined for us that the bar area was different from the restaurant. He offered us a free drink. We got the check for the entire meal and paid it, all having a bad taste in our mouth from the cold food and the poor customer service experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DAqJaFGIah9sRsL1dI4l9w"
  },
  "vts_toaWF5vxvW1Vz_hFsw": {
    "date": "1/27/2018",
    "text": "We were a little hesitant as this is in a hotel downtown, but this farm to table restaurant is fantastic. Delicious start with the pretzel brioche and whipped butters (cheerwine butter was great and very interesting), the ribeye and pork shank were great, and we finished the meal with the donut, which is cooked to order and amazing (highly recommend)!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nhEcc6tsFaBBx8ilUi9Mpw"
  },
  "sSGUwJaUpoyzekFl0MkajQ": {
    "date": "4/7/2017",
    "text": "I saw this place all over Instagram so I had to try it. I took a colleague for lunch and we both were super disappointed! His grilled cheese was burnt and my chicken sandwich was just boring. The fries were excellent though. I want to try again but it's moved way down my list",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvHtJ5aK7AvUfcCyfgrZhQ"
  },
  "7I0S2QArXnqwQtDGVdUW4A": {
    "date": "4/2/2017",
    "text": "One of my new favorite places, I've been here 4 times already. Perfect date night spot. It's open kitchen style so you see the cooks working and prepping the food. Everything is locally sourced from their cheese to the steaks. The prices are high but you're eating locally selected veggies and meats and I'll happily pay more to support local farmers. Also their menu changes so if you go once a month you might not see the same things on the menu, which I think is refreshing! Their wine selection is amazing and pairs well with all the menu items, drinks are great too and the bar staff are friendly and quick to get you your refreshment. I hope that this restaurant stays around for a very long time!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u-iPzwyP4p6rEoFVKrefxA"
  },
  "zl7xkWFmgxdRICw_I2OEVQ": {
    "date": "12/15/2016",
    "text": "Brought friends here from out of town to show them the city and could not be more disappointed in our experience. We heard great things initially but after how we were treated - we will never, ever return to this restaurant. All areas of the staff (hostess, bartender, manager) were so rude and disrespectful. I've truly never seen anything like it. Being a Charlotte native who has traveled to cities near and far this was by a long shot the worst experience at a restaurant we have ever had. So terrible that we walked out. I encourage everyone who decides to book a table at this restaurant to PROCEED with CAUTION.   We walked out and went to Sea Level (Hearst Building, 129 E 5th St, Charlotte, NC 28202, (704) 412-2616) where we had the most amazing food, drinks, ambiance, etc. Highly recommend that restaurant to anyone looking for an exciting new meal uptown.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Gwmlw-Pjbrq65k6PAU8Pw"
  },
  "19RiZaS2KyS4IVt-o4L1Tw": {
    "date": "12/7/2016",
    "text": "This place deserves the five stars. The appetizers are the right size and they are light so you can eat your entree without feeling overwhelmed. I had the steak, cooked perfectly. Sides are extra but the BBQ carrots are worth it. The carrots are tender and flavorful. The price is right if you think it is in downtown and right next to Marriott. There are more expensive places nearby with much less quality. I even ended up ordering a dessert.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "h5Ta4GX-CRHu7ViDC-Q51A"
  },
  "47Goq77dc_Anxv5kbCKIhA": {
    "date": "8/19/2017",
    "text": "I've never rated anything on Yelp until now because this place deserves it! Incredible food, great wine list and excellent vibe with the open kitchen. If you're ever in Charlotte for one night... GO HERE. You're welcome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MSBp3JQlZa8x1vOP1YjEMw"
  },
  "tg3GRLVOa6iOw2SQxrn9AA": {
    "date": "7/9/2017",
    "text": "Although the service and atmosphere was wonderful I could only give 3 stars as the food was mediocre at best.  We chose items that were recommended and supposed to be favorites.  The pork shank was over cooked, rice grits were bland, sweet potato hash was undercooked, and grouper special was bland.  We had high hopes for the restaurant but were disappointed.  Won't be going back and wouldn't recommend as there are many other farm to table restaurants in Uptown where the food is superior.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zrS4hL1B_RRWN5kQ4-3ikw"
  },
  "IQqqUn8cMRsL0ZelhBWtPQ": {
    "date": "3/1/2017",
    "text": "We ate here on a Sunday morning.  Although the place was crowded, we were seated within 15-25 minutes.  The food was solid.  I had the peaches and cream waffles.  That being said, there wasn't enough food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5QOwWwuSwzh5Cnuq0qzD4A"
  },
  "X0f51WLW98FaZRnOeIdHSw": {
    "date": "4/11/2017",
    "text": "Way underwhelmed. My party came here to celebrate a special occasion, and I definitely was not feeling very celebratory after we left.   Multiple things were forgotten by our server, yes there were 7 of us, and sure maybe forget a dish or two - but not four. Especially when it is slow.   Got the pork, and it was tender but way over salted. The bone marrow was seasoned strangely, with too much ginger (I think that was the mystery flavor). The fingerlings were harder on the inside, not soft and warm like they should've been. BBQ carrots did not seem BBQ'd at all. Small green salad was ice burg lettuce. The deviled eggs were good however. The pretzel was delivered way after we ordered it, but the butters were amazing. I did not try any of the deserts but the donut looked great when they brought it to another table.   The drink menu was extensive, and not in a good way, especially when your server doesn't know how to explain the ingredients/accurately describe how certain things taste. This is unacceptable when paying $14-17 a cocktail.   Most annoying however was that no where does it say they automatically add 20% gratuity. If I do not receive great service, I should not have to leave a great tip - that choice should be mine, or at least give fair warning that you are going to add that to my bill. We had no choice to leave an amazing tip (because this place is so OVERPRICED) and we were met with eye rolls, sighs, empty drinks, gross food, and a server who couldn't even remember our order/forget to put it in.   I will not be back, needless to say.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KdexguR6S0GPyAuTO10Yww"
  },
  "ukxiaQmOx0LqdSoq46h0DA": {
    "date": "1/29/2017",
    "text": "Mixed-bag: interior is nice and bar tender was great, but it seemed overpriced. For food I got the scallops and pretzel roll with whipped butter. The scallops were good, but way overpriced for what you get. The pretzel roll, which is much cheaper, was better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXofPhXFnqvxaYJIo8XmyQ"
  },
  "zE_t_2TCBIktoJp0Rw02sw": {
    "date": "3/31/2019",
    "text": "Delicious french toast stuffed with ricotta cheese. I also shared biscuits with chicken and avocado toast. The place is very clean and hostess was very friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-WcgrhMpzivDyWplDuimnw"
  },
  "G4RT55MueDlWdQ-yrP4gQQ": {
    "date": "12/15/2018",
    "text": "The food is delicious. We order the grilled octopus and  pretzel bread as appetizers and they did not disappoint.  The octopus was tender, due to it being charred on an open fire. The pretzel bread felt like a soft cloud in my mouth, it also came with three different types of butter. We also had the sticky pork, with macaroni and cheese,  fire roasted broccoli, and for dessert the gigantic doughnut. Everything was delicious and the drinks were strong.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YFGUsw9gZYdbFHfwWWXWdw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Gigantic doughnut.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YFGUsw9gZYdbFHfwWWXWdw/o.jpg"
      },
      {
        "img_id": "0Hfvl8XsVc1CaPIWwdApxQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. pretzel bread with three butter spread...delicious, soft cloud in your mouth.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0Hfvl8XsVc1CaPIWwdApxQ/o.jpg"
      },
      {
        "img_id": "uIJj-u6zCifNc8hOLWxvOA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uIJj-u6zCifNc8hOLWxvOA/o.jpg"
      }
    ],
    "user_id": "FhsEHO81PwuFfE1UaEfjeA"
  },
  "kr_WN4RUYe7K7Gk9GW6Qmg": {
    "date": "3/25/2019",
    "text": "Visited the place on a previous occasion and it was much better than today's experience. Hush puppies, brioche, octopus, and s'mores ice cream sandwich were all pretty good. The cassoulet in the wood fired chicken was salty and the pork shank was dry as f***; had to wrestle with it to get meat off the bone. If executed correctly I bet it'd be much better. Service was pleasant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v1fkQbMJQHzoit2LCm9pZQ"
  },
  "Ehnx0l9ZM9m5iO081LRJ3w": {
    "date": "11/13/2018",
    "text": "Stoke is a classy and clean restaurant. It has an open kitchen, so the customers actually views the Chef prepare their orders. The service was great. The lady who attended on me, went out of her way to make recommendations which was very much appreciated. Great spot for a date! Calm atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HincuzjqAp9y-Q9YSEgZPQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Chicken, corn, Mac n cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HincuzjqAp9y-Q9YSEgZPQ/o.jpg"
      },
      {
        "img_id": "h0GyTxXrib6hv1iyFfo2Gw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h0GyTxXrib6hv1iyFfo2Gw/o.jpg"
      }
    ],
    "user_id": "0ck0qDiNnGmeVdxsOMqmOg"
  },
  "dz4UCJI5niKsVDvAYGwKiw": {
    "date": "7/22/2018",
    "text": "First of all, this place is not worth the hype. This place does have a nice ambiance, but that's about it. It wasn't very busy during the time we were there, which was around 2p on a Saturday. Secondly, when I saw that the restaurant served banana bread, I got excited because I am not a fan of nuts in my food so I asked (due to the wording and the fact that I've eaten banana bread without nuts before) if there was indeed nuts in the bread and the waiter (tall caucasian bald guy who happened to be the bartender as well) told me no --- so I was super excited to order the banana bread because I love banana bread, minus the nuts. So at any rate, we ordered the Garbage fries, Dipped Fried Chicken Sammy sandwich, the burger a side of fruit and a biscuit. The hot chicken sandwich was a big no! The burger was ok and the fruit was not fresh (which is what I would've expected from a restaurant such as this one). The only thing from our meal that was a hit, were the Garage fries (pimento cheese, chives, and gravy) and the biscuit... that's it. It was sad because I was expecting great things from this place. Lastly, I ordered the banana bread and upon receipt it had the entire bag of nuts on the piece of bread and I was UBER annoyed at the fact that I specifically asked if it had nuts in it and he said no. Then when I followed up/confronted the waiter regarding the nuts, he says \"well it's not a lot in there\" I'm sitting there like 'Really'?! What if I was allergic to nuts? That was totally not cool.   The only reason why I would return would be to try the 1lb donut they have. Other than that, the food was not a hit here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qEzFqJGvp1jAj5p0MJE_wA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Burgers and hot chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qEzFqJGvp1jAj5p0MJE_wA/o.jpg"
      }
    ],
    "user_id": "7DWlt0bmmZ9oj-jnrBCMvw"
  },
  "fA1gobLTOq5yK2Or6_lYQA": {
    "date": "2/16/2017",
    "text": "Lunch menu is limited and expensive. $16 for a leg quarter in onions and Cheerwine sauce? Nah.   The burger was good even though the server never asked me how I would like it cooked. My buddy was offered the grill cheese special which came with no side. Just a lonely sandwich on a little plate. Lamb and eggs were good per my colleague.   I would give it another go for drinks and bar bites but lunch is a bust",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4mRQmg-Gj-kOgt40lhoPIw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4mRQmg-Gj-kOgt40lhoPIw/o.jpg"
      },
      {
        "img_id": "n_vlgP7tZyqjMrM1KoQEmA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n_vlgP7tZyqjMrM1KoQEmA/o.jpg"
      }
    ],
    "user_id": "lN400ckm9JAMqq5_nsmBEA"
  },
  "Jl2SMuWTJLUWEBdUJqN3pw": {
    "date": "1/5/2017",
    "text": "Charlotte should feel super lucky and excited that Stoke is here.  Located literally, directly in the heart of the city in the Marriott, this restaurant and chef really highlights farm-to-table, seasonal cooking.    I was happy to be in a large group and we ate at the chef's table.  It was a smattering of tastings all built around the restaurant's wood-burning oven.  Chef Chris was more than happy to have us and share his food and the stories behind the dishes he served us.  The plates just kept coming and it was definitely a real treat  We started with a salad, with embered eggs, avocado, frisee.  Then onto the deviled eggs w/crispy chicken skin, pretzel brioche with 3 different butter spreads.  Then the proteins started coming out and honestly I know this was a couple months ago, but I had this \"black-out, food coma feeling\".  The plates just kept coming and I just kept eating.  The pork shank was amazing, chicken (bone in) with cheerwine sauce (how much more local could you ask for?).  Probably my favorite was a side:  the BBQ carrots with carrot top pesto.   There was a beet salad as well as a bunnernut squash side that was pretty amazing.  Just when we could not have fit any more food into ourselves.... came the DONUT.  Luckily we were a large table and we were able to finish it off, but we did eye a couple in a table nearby that ordered it for themselves!  I didn't keep track, but I didn't see a take-out box with them later in the meal (no judgement zone though!).  Overall a great dining experience here at Stoke... I do want to keep this to myself, but everyone should really take advantage of this great restaurant in Charlotte.  A great addition to the many great eats this city has to offer.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "EpNMyYqPjqNOAVuct0aWBQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Chef Chris @ the table!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EpNMyYqPjqNOAVuct0aWBQ/o.jpg"
      },
      {
        "img_id": "lzMB1jW-2GmDpiQsPqjYdw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Donut whole!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lzMB1jW-2GmDpiQsPqjYdw/o.jpg"
      },
      {
        "img_id": "oSi9V1pCvNi7Qx_FqOCh9g",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Donut (slice)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oSi9V1pCvNi7Qx_FqOCh9g/o.jpg"
      }
    ],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "9aEuAAJLv9TYqqZH9QgLBA": {
    "date": "3/20/2017",
    "text": "Such a great place for a nice dinner, a girls night, a date, whatever! The food here is amazing and the cocktails are super fancy.   Cocktails: I really enjoyed the stubborn mule drink I had during my last visit.  Food: I have ordered the pretzel brioche both times I've been because the bread is amazing and comes out warm and it comes with some of the best butter, jam, and mustard I've ever had. And I don't even like mustard. I also highly recommend the salads: for 1 or to share family style. The fingerling potatoes are cooked perfectly and crispy. And if you like deviled eggs, those a dang good too.. and I also don't normally like those. And if you dare, order the donut... just plan to split it with a few neighbors or take some home with you.  Atmosphere: Love the urban look and the soft lighting. It get's busy but not too crazy loud. And the service has always been wonderful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p2-5cYBip-PygojYxa5PIw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p2-5cYBip-PygojYxa5PIw/o.jpg"
      },
      {
        "img_id": "6koSdcl_lRBIlZAgqwlS5Q",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. The Stubborn Burro",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6koSdcl_lRBIlZAgqwlS5Q/o.jpg"
      },
      {
        "img_id": "rqsgxBEpvDdozumRgpFSOA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rqsgxBEpvDdozumRgpFSOA/o.jpg"
      }
    ],
    "user_id": "azpZPrb02xWYI_S0MYfIGA"
  },
  "6WXvHrT38f4VjNAd0LXH5w": {
    "date": "1/3/2018",
    "text": "So much potential!!! The flavors really come together nicely...  However tonight Stoke managed to choke... Slow acknowledgement from server...slow delivering appetizer and to keep things interesting delivered salad , main entree and side all at once...REALLY???  Manager eventually came over and asked how meal was vs simply acknowledging the slip up...I don't want free dessert I want well cook fish that shouldn't be sent back to the warmer as I complete my salad. Never do I eat in the hotel where I'm staying...this experience has not managed to convince me otherwise. Hopefully the potential can be realized...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Uu6VbIAmPJcLtgLqhyH8A"
  },
  "5L7gwfjsF8U08ekh_aGUYA": {
    "date": "7/30/2018",
    "text": "(Queen's Feast Review) The food at Stoke was generally tasty, but It seemed obvious that they were putting out Queen's Feast (Restaurant Week in CLT) food as fast as they could, and there wasn't much care for the finer details. Things like the half of a soft-boiled egg in my Frisee Salad starter was mostly empty of its yolk. The crispy pork belly main was cut such that the meaty part was only on one half (front/back, rather than top/bottom).  The taste (glaze) of the pork belly was good, but it was not crispy and seemed to have been left under a warmer or possibly under a covering of some kind so it was more soggy than crispy. The chiffon cake pieces in my desert were dry, thankfully they were paired with a tasty ice cream to re-hydrate them.  The semi-redeeming aspect of the meal was the cocktail I ordered (Canadian Vacation - knob creek smoked maple, ginger syrup, lime, chocolate) it was incredibly good and I was able to sip it slow for most of the meal. That being said, it was $16 and just barely met the mark for that price, leaving no desire for a second drink order at those prices.  All in all I feel like I have to give some deference to restaurants that try to serve up reasonably priced 3 course meals during Queen's Feast, but if the hope is to attract people to their restaurant for a future visit I think Stoke fell short. This meal did not leave me or my date with any sense of \"value\".",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aj0_-GJIJnNhr0p6gccqYQ"
  },
  "mYVyM9TFb5TXkFmG72A1Vw": {
    "date": "5/10/2018",
    "text": "Went for lunch with my fiance and got the shrimp and grits. The flavors were perfectly in sync. The savory red sauce on top perfectly cut in with the buttery grits.  And I was delighted to see that the shrimp were tailed. No messy hands today!  We sat at the bar and Juan, the bartender, was awesome! I can't wait to come back and try Stoke for dinner!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "LE8fiyaqq25KsJ_oluZBbg"
  },
  "7MskgW_EBmvoL0q_qXvP_w": {
    "date": "11/30/2016",
    "text": "Chef Chris Coleman (formerly of McNinch House and The Asbury) does it again!!! Stoke is one of the best new restaurants Charlotte has to offer!  We were lucky enough to partake in a Family Style meal at the Chef's Table. From beginning to end, a broad selection of amazing wood fired dishes inundated the table!  Chef Chris makes \"embered eggs\" - basically an egg that has been smoked and cooked in embers. The white part has this incredible smoky flavor. The Frisee salad with slab bacon, avocado,  bleu cheese and embered egg really highlighted this concept. Even better were the Deviled Embered eggs with Lusty Monk mustard and fried chicken skin - bites of heaven! Homemade pretzel brioche with blueberry butter, bacon jam and Lust Monk Butter were up next - fluffy, light, buttery - do it!  The main dishes included Wood Finished smoked chicken, Sheepshead (the fish - meaty and mild like Grouper) on a sunchoke puree and my personal favorite, the Sticky Pork Shank.  All of the sides were delicious - the rustic BBQ carrots were glazed with their own house made carrot BBQ sauce. The Butternut squash was accompanied by a lemon ricotta bed and mushroom (hen of the woods?). The Roasted beets with ricotta had a wonderful surprise at the bottom - sunflower granola with cocoa nibs - great crunch and great contrast.  The grand final e was \"the Donut\" - this thing is large and in charge - it served six people easy - the house made brioche made an encore appearance filled with pastry cream and covered in Heath bar crumbles = unreal!!!! I loved how the brioche was warm and the pastry cream was nice and cool - so good!  Chef Chris was an awesome host and walked us through each dish and its ingredients! Service was also spot on. Bottled wine prices were very reasonable.   I recommend you check this place out before everyone else finds out about it and you can't get a table!!",
    "rating": 5,
    "rated": {
      "funny": 10,
      "useful": 14,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "8Edpq70OqFTS5xTWOJWXzw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. The Donut!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8Edpq70OqFTS5xTWOJWXzw/o.jpg"
      },
      {
        "img_id": "F4WbFcLpctLyxbwf3b86EQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F4WbFcLpctLyxbwf3b86EQ/o.jpg"
      },
      {
        "img_id": "oGch7Y6khf7OZ1pY51vIyQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oGch7Y6khf7OZ1pY51vIyQ/o.jpg"
      }
    ],
    "user_id": "5jJjY5_R06Og56VfjIc66A"
  },
  "_41Tlkgc8TQ2y9C1HOd0nA": {
    "date": "2/6/2019",
    "text": "Its what I call fancy smancy type of place.  Pricey but decent. It's the sort of place that uses random ingredients in their food that requires google to figure out what the heck is that.   The pork shank, their signature dish, was good, but not amazing. It was huge but not something I'd order again. Same thing with the hushpuppies. They were okay.   Everything else I ate was amazing. The pork belly starter and braised carrots  were all outstanding.   The real winner is that ginormous donut. It was literally the best donut I've ever tasted!   Great wine selection.   Stoke is worth a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yow94EsrxJ92swWYJ2tNsQ"
  },
  "16fWpW9M3JCFrqml3kF96Q": {
    "date": "1/2/2019",
    "text": "Such a nice find in Downtown Charlotte!  The deviled eggs were good.  Nice wine selection.  Contemporary, open-air ambiance.  The duck and mushroom risotto special was unbelievable.  It's been three days and I keep thinking about this meal.  Next time I'm in Charlotte, I'll be back, delish!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n-6gqoEP9uQQBUnbKIu3RQ"
  },
  "PIl64QUw-sWwlcvRe-bEsw": {
    "date": "10/13/2018",
    "text": "Let me just start this review out by saying that my wife and I had the Chef's Dinner at Stoke and it was hands down the best dining experience we've ever had in Charlotte. I could take the time to describe in detail each of the 8 courses we received but they would all just talk about how well presented and delicious they were. The drinks we had were fantastic as well and included the Stoke Old Fashioned and Manhattan and several different glasses of wine including some Pinot, Sauv Blanc and bubbly. Chris, the head chef, described each dish with no shortage of passion and care for what they put out of their kitchen and this showed through in the flavors each dish offered. KC, our waitress, was attentive, fun to converse with and did an amazing job helping us pair drink selections with the dishes we had. Stoke is most definitely worth a visit if you're looking for great service and an amazing meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "86iLzPA91PoEjFypUNGGLQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Watermelon, goat cheese, peanuts and seeds. Amazing!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/86iLzPA91PoEjFypUNGGLQ/o.jpg"
      }
    ],
    "user_id": "tThhM59qp7llbBkVgBTszQ"
  },
  "Vsm4gCw-nQhi6Wu8yZ-xkQ": {
    "date": "1/27/2019",
    "text": "Really enjoyed the bar at night, great cocktails and beers on tap. Bar tender Daryl from WV was outstanding, even comping a beer for my husband at the end of the night- just because! Bar food starts @ 1030 PM, tater nachos were worth the wait! Breakfast was good for my husband (omelet, bacon), but my chicken tacos were pretty awful. They were smothered in this sauce that made them almost inedible. Disappointed that my meal was not comped- hence the 3 stars. Otherwise phenomal hotel w/ good restaurant!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jByXhU8KOD93ebVEGSOjJg"
  },
  "v7uXPCsuazEtT-4lsrCCwA": {
    "date": "2/24/2019",
    "text": "This is possibly the best restaurant in town.  Dining should be an experience. A lot of venues have good food, but Stoke steps up the total dining experience with terrific ambiance, impeccable service and some pretty damn good food from appetizers to dessert. Kudos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IsWAmCDv6J5eWj8gYbFilA"
  },
  "KUCDNCNdiLlOZNP-AGGIHw": {
    "date": "5/25/2019",
    "text": "Excellent grits and shrimp, the salads are amazing and the best Fried chicken with a biscuit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MiYQm85r6jsX6UIj3WgQA"
  },
  "0HPf_IcndnvWTWZ2F6DxCA": {
    "date": "12/31/2018",
    "text": "Not horrible, but definitely not close to the usual, think outside the box restaurants. We ordered a lot of their dishes between the 4 of us, 4 apps and 5 main dishes. To start off though, wine list is pretty weak. I don't like to commit to a wine by ordering the bottle, so we ordered glasses of wine and mix cocktails. I thoroughly enjoyed the mixed concoctions, but wine was just eh.   So we ordered a few appetizers, the pretzel bread, octopus, family board and pork belly. I'll start by saying the pretzel bread was pretty good, but the mustard butter and cheerwine butter was a little overboard. Octopus was the highlight of the appetizers, tender and flavorful. Charcuterie was sub-par, not very good combinations of hams and cheese. Pork belly was burnt and I know the difference between a nice sear and burnt to a crisp, we couldn't enjoy the richness of the dish because of it, needless to say, our server and I think the food runner, were completely naive to the fact that we are ordering a good bit of food and for some reason when they take the plates away, there's still a decent amount left on them. I came to eat good food, I didn't come for restaurant week or for free stuff, but at the very least, at some point, the question should've arisen as to why there was so much food left on our plates, but it never happened. And might I add, she still was tipped 25%-30% on a $350 ticket.  Now main courses, 50-50 is the general consensus between the 4 of us. We ordered an entree each and wanted to share the scallops. Pork shank was very flavorful and rich, but not hard to do because there is a lot of fat near the bone, the sauce that it was drenched in was ok at best, less is more sometimes. Duck was pretty good, it came with grits, 1st rule of cooking, season your food, grits tasted like watered down oats, oh that's right... Again less is more, it was engulfed in a pool of sauce. Flat Iron steak, was pretty dang good if you ask me. Perfectly cooked, nicely seasoned (cause it wasn't sitting in a pool of sauce). Pork chop was a little on the dry side, but not horrible. Now the scallops, cooked perfectly, but again less is more, sitting in a pool of curry sauce where the turmeric way overpowered the scallops, dab it, drizzle it, douse it, sprinkle it, but for the love of god, leave the scallop alone. If you know anything about scallops, they are tender and juicy, with a little seasoning and a nice sear/baste, they will be perfect, garnish and drop a little bit of your sauce on it or around it and you'll have a perfect dish. Don't allow them to sit in a pool of yellow curry with no vegetables, so it's either a curry dish or a sauce, but can't be both if you're missing vegetables or you're over saucing them.   So I know I sounded harsh, but the chef(s) should take heath into the fact that this same table is here on a slow Sunday night, ordering almost everything on the menu. Be mindful! It's not Restaurant Week! Unless that's the crowd you are trying to pull in! Although not horrible, not memorable either. Oh by the way, don't go by the pictures, a little misleading considering all the plating was completely different.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JJTqdEUQ8Gdgp1dTdzkcfQ"
  },
  "eHcY-sj8rhsy0xCZ3M0Ulw": {
    "date": "7/16/2018",
    "text": "Stoke is tucked into the lobby of the Marriott Hotel but certainly stands out on its own. We arrived early so we started at the bar. One of the best Old Fashioneds I've ever had - incredibly smooth.  The open kitchen format had split my attention between the table talk and the food but was refreshingly fun.   We started with the pretzel bread and deviled eggs. Both were delicious. With the pretzel bread make sure you get a good helping of their \"Cherry Coke butter\".  For the main courses my wife had the scallops, which were cooked to perfection and accompanied by a ratatouille-like side. I had the sticky spicy pork shank which fell off the bone and was a healthy serving (but definitely not healthy for ya).  We would definitely come back if not to try this 1-pound donut everyone raves about.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n2LTAHSQIvGH8E54bP58Uw"
  },
  "Jb7xZuyRSGZIBADT3KBpwQ": {
    "date": "2/23/2018",
    "text": "Not long ago, the Marriott City Center underwent a remodeling project, and part of that was to revamp the lobby area. What was somewhat chopped up is now relatively open. There was a very solid restaurant offering (Savannah Red, now closed), and now there is a smallish section with tables for more open seating, and also a very open bar area, which is also a part of the same offering.  In reality, it is a bit confusing - it looks like the bar is one area and the seated section another because of the \"walls\", but they are both Stoke, and you can dine (and/or drink) in either. And there is a good flow of traffic all around, simply because you are in the lobby, after all. If you want to avoid some of that, you would probably want to sit in the more walled-off portion. It's still fairly open, but you get a bit farther away from the people just moving through the lobby.  Also keep in mind that there is a good bit of noise here simply because of the open design. This probably isn't the best place to sit and have a private conversation or a romantic dinner. It's a good gather place, especially if you are staying at the Marriott, somewhere nearby, or maybe even stopping in prior to an event uptown and want a drink or a quick bite. For a longer meal? Maybe not - it's just not that kind of a place where you can really enjoy what you are getting.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "62GNFh5FySkA3MbrQmnqvg"
  },
  "W518vYLPl6AVdrMQNHqymg": {
    "date": "4/7/2019",
    "text": "Very decent brunch. Not a huge menu but the prices are good and the food is great! Get the donut!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fj6igOChQixptNAZfWXGTQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fj6igOChQixptNAZfWXGTQ/o.jpg"
      },
      {
        "img_id": "VnpICWfSDMRuTHR9X-s5EQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VnpICWfSDMRuTHR9X-s5EQ/o.jpg"
      },
      {
        "img_id": "5WvCqL8Y9GXLCPH2TEwHoQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5WvCqL8Y9GXLCPH2TEwHoQ/o.jpg"
      }
    ],
    "user_id": "yhK03LAwo5pNZQJAWkAAog"
  },
  "8lz-ox4PEDXo-n-af63_Dw": {
    "date": "4/14/2019",
    "text": "I came here during restaurant week and we ordered off of the set menu. Everything tasted great but I would have rather ordered from the regular menu and mixed and matched dishes more. It can be pretty loud since it's in a hotel lobby with a bar next door, so it's not a great place for an intimate date. The donut holes (restaurant week special) were amazing so I'm sure the regular sized donut is a must-order.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YNDtPDQ_keWy0l6ZMnZi3w",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Donut holes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YNDtPDQ_keWy0l6ZMnZi3w/o.jpg"
      }
    ],
    "user_id": "qk6NOZVWZrd9FtfrJXEdFg"
  },
  "Mc9tveC7ILwUrNF8DICXDg": {
    "date": "1/19/2018",
    "text": "Look how huge that donut is!!! And it tastes just as good as it looks!!!         ..It's a 1lb donut!  AMAZING!!  The cream is similar to a decadent whip cream.  Cinnamon and sugar on top with heath bar.  The perfect combination of OMG!!! DELICIOUS!!!  It's really something you have to try, I can't imagine anyone not liking it. Could be a family dessert. So good!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7zYxP4Gp09pw122Fd2NGHg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Look how huge that donut is!!! And it tastes just as good as it looks!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7zYxP4Gp09pw122Fd2NGHg/o.jpg"
      },
      {
        "img_id": "0KaEhi6VrTOyBI_NqMtz4A",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Look how huge that donut is!!! And it tastes just as good as it looks!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0KaEhi6VrTOyBI_NqMtz4A/o.jpg"
      },
      {
        "img_id": "NfumnpA5E4WAOT1WG2Mc-w",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Look how huge that donut is!!! And it tastes just as good as it looks!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NfumnpA5E4WAOT1WG2Mc-w/o.jpg"
      }
    ],
    "user_id": "T13IBpJITI32a1k41rc-tg"
  },
  "pEScRj_wIlsb0JnMrt1QuQ": {
    "date": "12/10/2017",
    "text": "Couple of weeks ago, I finally went to Stoke in Uptown for a four courses Thanksgiving Feast.  What I like about Stoke: its open kitchen and sleek tables, craft cocktails and farm-sourced everything.   My meal was fantastic, every course and every single bite. However, THE DOUGHNUT was the highlight of my meal. A giant brioche (1lb) filled with rich pumpkin diplomat cream, and topped with spiced pecans. It's meant to be shared, but if you're like me, you don't share your desserts, then there was no shame having it the next day for breakfast.  Five Yelps.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Pfb9YBLdKvpNbPNdBuG_Lg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Pfb9YBLdKvpNbPNdBuG_Lg/o.jpg"
      },
      {
        "img_id": "E6MXFsS_J7BvwNnpcziyYw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Mushroom and gold rice grits",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/E6MXFsS_J7BvwNnpcziyYw/o.jpg"
      },
      {
        "img_id": "YrEa6r3yir5PfSHYaIbhuw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Wood finished smoked turkey with mushroom bread pudding and roasted sweet potatoes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YrEa6r3yir5PfSHYaIbhuw/o.jpg"
      }
    ],
    "user_id": "N9hqTPQu2bmI8c2Pj8F1ww"
  },
  "kYLC_L0FCg3yazKl0rxYBw": {
    "date": "1/10/2018",
    "text": "Come here for someone's birthday and you won't be disappointed!  They will serve you an amazing, cake-sized donut!  Great atmosphere, great cocktails, and I loved the lamb and side of Brussels sprouts.   Also went there for a ladies valentines night and enjoyed the special menu!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "82aAlJy0dQj2x0H7i1KUVQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/82aAlJy0dQj2x0H7i1KUVQ/o.jpg"
      }
    ],
    "user_id": "vRMlt2TBsH5_efNSJLGD7w"
  },
  "y26Lc8IV4DPWGX1vGwddog": {
    "date": "1/24/2019",
    "text": "Very impressed with this restaurant and the chef is the nicest! We started with the Mom's deviled eggs, farmer's salad, local cheese, and hush puppies. We ate it all, but extra loved the spiced on the deviled eggs.  For the entrees course, we loved the Brussels sprouts with raisins (even though it was a side.) the farmer's haul was a veggie chili and shockingly good. For dessert, the donut holes with the whipped cream were our favorites! Service and ambiance were both on point.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "n3pKbmjkRncH2uhQLAo-Sw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Farmer&amp;#39;s Whim: lentil chili (which was super delicious and topped with fresh vegetables.)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n3pKbmjkRncH2uhQLAo-Sw/o.jpg"
      },
      {
        "img_id": "zwC0rVVtX8K6Bxlym6eAlA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Farm  Sparrow Hushpuppies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zwC0rVVtX8K6Bxlym6eAlA/o.jpg"
      },
      {
        "img_id": "UMXqO5-h2d_j20IIrjdm1Q",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Shrimp  Grits",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UMXqO5-h2d_j20IIrjdm1Q/o.jpg"
      }
    ],
    "user_id": "uvg1a4VaRkKdfFMKws26DA"
  },
  "sRMtkNHwoTwUeHQBxzz3JA": {
    "date": "5/7/2019",
    "text": "Great food.  I had Monk Fish with rice grits.  The grits had a mild lobster taste and was topped with a perfectly cooked monk fish.  Side vegetables.  All the items were perfectly seasoned.  It was a warm comfort meal but was not heavy. It really was one of the best meals ever.  The others had a chicken fish that they also enjoyed.  Great service and atmosphere.  Will definitely return",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "quC4Q9QrjGxc21ZygYroeg"
  },
  "99BskU-A1HF6tuKY1Ftmow": {
    "date": "1/28/2019",
    "text": "The service, wine, and dessert were amazing. The dinner...not so much. While I would like to give them a pass because it was restaurant week in Charlotte, that would not be fair. During restaurant week I think it is important for these places to put their best foot forward, sadly that is not always the case, as was our experience at stoke. I ordered the deviled eggs, the pork belly, and the donut holes as our three course meal for restaurant week. The eggs were bland, the pork belly had a chance to be great but was accompanied by a somewhat plain brick of rice. The donut holes were nothing short of amazing, saving the day, with fresh whipped cream and heath bar sprinkles. Our service both at the bar before sitting for dinner and from our waitress were first rate. They were the only things that kept this review from being three stars. We will be back to try it one more time during a \"regular\" week. Hopefully it's better as we were really looking forward to a quality dining experience here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4h0pI0tkeYZFnmjb1R2LSw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4h0pI0tkeYZFnmjb1R2LSw/o.jpg"
      },
      {
        "img_id": "6uzlCksV6oM5GTWi_EvNZQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6uzlCksV6oM5GTWi_EvNZQ/o.jpg"
      },
      {
        "img_id": "WdBsGKwIjKxFT4aqU9F3AQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WdBsGKwIjKxFT4aqU9F3AQ/o.jpg"
      }
    ],
    "user_id": "HjUHZ3YiIGaXOEbTgEvnLw"
  },
  "B3SKu3XK-uokIGc0dHFRZg": {
    "date": "7/26/2018",
    "text": "Loved our dinner here for restaurant week! The pretzel brioche was amazing and I'll definitely be back to eat that again! It came with 3 specialty butters including honey butter, a Dijon butter, and a Cheer Wine butter. They were all fantastic. I had the fettuccine for my meal and it was so filling and the shrimp in it were large and fresh. For dessert I had the donut holes and our server was not kidding when he said they were heavy! I could only finish about 2 after the rest of the meal. Our server was wonderful too; very attentive and had great suggestions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fdbJV1OFA0F5XV9uU1LkzQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fdbJV1OFA0F5XV9uU1LkzQ/o.jpg"
      }
    ],
    "user_id": "lpcYAvuU6ljcJ7jtFUE_Tg"
  },
  "ZId04b0ZwW_xbCWu9qWJ_g": {
    "date": "1/24/2019",
    "text": "I visited Stoke for Charlotte restaurant week 2019. They were booked with reservations the first Friday night but we were told that the bar area is first come first serve but full menu. I arrived and wasn't sure where to enter. I saw a door with stoke on it, went through the second door and found myself in the bar area without a host stand. I stood there for quite some time looking at the bartenders before a server directed me around a corner to the host stand.  She showed me where the open bar seating was. The area has a really nice vibe with low lighting. Our service was quite slow but I assume this is because of the bar seating. It's quite confusing though since the bar area seemed to be almost the same size as the restaurant seating, so why not have proper service everywhere?  If you're unfamiliar with Restaurant week, it's $35 for a 3-4 course meal. You have a variety of options for each course. So, with that said, I ate with two others and we all ordered different appetizers, entrees and desserts. We tried the deviled eggs, pretzel bread, and cheese plate. This was definitely the best part of the meal. The eggs were very tasty and the pretzel bread was soft and came with three kinds of sauces. The bread itself was lightly sweet and amazing. The cheese plate was pretty bare and had a couple of slices of cheese, honey drizzled so lightly we couldn't actually use it, and less than a handful of nuts and fruits. For the entree we had the lamb, shrimp and grits, and the pork. The lamb was recommended but was our least favorite. It was fine, but nothing special. It was also a very small portion. The shrimp and grits were quite tasty and a good size portion. The pork can I top of rice with some very thinly sliced pickles and crunchy flavoring on top. This dish was tasty but not something I would go back for. Lastly we ordered dessert. We had a s'mores sandwich, a brownie, and doughnut holes with heath bar. The smores sandwich tasted like a raisin cookie and was difficult to eat. The middle part oozed out and we never really got to taste it as it became pure liquid. The doughnut holes were your run of the mill doughnuts and on top of a whip cream bed with heath bar. We did not finish this or the s'mores sandwich. We also had the brownie which was quite tasty but only enough for 4 bites.  We also tried a cocktail which was amazing! It was something along the lines of blackberry bramble. I would go back strictly for this drink!  Overall, it was not at all worth the $35(+cocktail). It was a fairly average meal at an upscale location.  Definitely take an Uber here as parking is hard to find uptown",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9eiqEQzRrhPjvMDoGRq20Q"
  },
  "XODX9yHKS6koQniPPozbRg": {
    "date": "5/28/2019",
    "text": "Friendly bartender! We arrive 30 minutes before the kitchen closed and they sat us in the bar and let us order from the regular menu. Highlights of the meal included the cocktails, a pea salad and their s'mores dessert. Worth a visit",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4DPOqqOKcK4q5Lcxv97a4Q"
  },
  "3F_UO5-Tj4KCfSnWvJkxAQ": {
    "date": "6/18/2018",
    "text": "Loved it!!! A great dining experience. Food and service, by Molly, were top notch. Unfortunately, yelp pictures aren't too helpful since the menu changes every couple of months.   Our group sat next to the kitchen. It was calm and clean.   The gigantic doughnut is a menu staple for a reason and you won't regret it. I could do without the crushed Heath bar garnish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Vh-tEzkBJ-P-i-GayC3KQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_Vh-tEzkBJ-P-i-GayC3KQ/o.jpg"
      },
      {
        "img_id": "-CAV4TeoM3iNBEGVwblc4A",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-CAV4TeoM3iNBEGVwblc4A/o.jpg"
      },
      {
        "img_id": "2w-tEJSJLjUzukmwk2mvvA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2w-tEJSJLjUzukmwk2mvvA/o.jpg"
      }
    ],
    "user_id": "nmTE5KBDHusSglJYuKT4WQ"
  },
  "sc6Lmn8nX2v9my0-GSBOkA": {
    "date": "1/19/2019",
    "text": "Yikes, this place was not good. We went for restaurant week and I got the pork belly and my girl got the flank steak. Both were very underwhelming. The potbelly was actually tasty but they only gave me 5 small pieces and rest of the dish was unappetizing. The steak was flavorless and chewy (we got medium) and the Brussels sprouts were just ok. This is with a very high price tag. I hoping this would be good but unfortunately it was a complete disappointment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Skj4tNkQSwShhatWlCgBsQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Flank steak, pork belly and fingerling potatoes. Steak and pork belly was disappointing.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Skj4tNkQSwShhatWlCgBsQ/o.jpg"
      },
      {
        "img_id": "BixBjo26VfF8JuEoIs6xcA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Pork belly. Only 5 pieces!?! Disappointed.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BixBjo26VfF8JuEoIs6xcA/o.jpg"
      }
    ],
    "user_id": "B2n7XIQl3C0iTbQkDIFtzg"
  },
  "ZLy5FMfmOIyvH71RHg4WeA": {
    "date": "5/29/2019",
    "text": "Went here for the first time for restaurant week. Fresh pasta had no flavor. The food was really disappointing and underwhelming.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQKCch7Fv3fAseBM4vfN0A"
  },
  "gAoXEo9huXCzgDCT6_PEPw": {
    "date": "12/17/2018",
    "text": "Fantastic cocktails at this location.  So good you'll definitely want to hold yourself back because it's certainly easy to have one too many.  Delicious appetizers as well.  Service is pretty good but drinks took a while during our happy hour.  Overall a great cocktail bar and very recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uJftKIM8Cpo9lJhxMQB2_A"
  },
  "mj949BENJi0iAb6eIXYanA": {
    "date": "11/12/2017",
    "text": "Great spot for dinner. They are on Open Table so easy to reserve ahead of time or for a weekend. First of all, if you are a cocktail drinker, they have an awesome assortment and make some creative concoctions. The menu is small, but detailed and creative. They have some great starters, including the charred octopus with chorizo and fingerling potatoes (DELICIOUS), pretzel brioche which comes with 3 butters, and the deviled eggs, all of which are fantastic. The 3 pretzel butters were pumpkin butter, a mustard seed butter and a cheerwine. They were each tasty in their own right, served atop of the pretzel bread which is keenly sprinkled with sea salt (excellent decision).  For our meals, we tried the catch of the day (a snapper), the duck and the sticky pork shank with peanuts and a chili sorghum glaze. The meat was so tender and fall of the bone delicious. For sides, we tried the esquites (warm corn salad) and the broccoli. To my surprise, the broccoli is served as one large piece, charred and covered with harissa, goat cheese and mustard. SO delicious.   For dessert, we HAD to dry the one lb donut, as it's been on my Charlotte Bucket List. We split it among 4 of us after all having apps and entrees and finished it. It is delicious, with a custard type cream in the middle, and covered with heath bar pieces. I could definitely eat more of that in the future :)  Service is great and the atmosphere is romantic.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ViwGBNPv4BG9p1KRcasxGA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Donut",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ViwGBNPv4BG9p1KRcasxGA/o.jpg"
      },
      {
        "img_id": "2JZdWTjJ_h1jZhGzzGUi6Q",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Famous one lb donut! 4 of us finished it",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2JZdWTjJ_h1jZhGzzGUi6Q/o.jpg"
      },
      {
        "img_id": "sptmgAlLEcc1GhxV6uI_5A",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Lamb",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sptmgAlLEcc1GhxV6uI_5A/o.jpg"
      }
    ],
    "user_id": "FRvKvr1-AsUaCBuxaoxnCg"
  },
  "Tl1nm3ixZAvOlY-z2Cm7gg": {
    "date": "4/9/2018",
    "text": "Husband and I had breakfast here before we left to head back  home. I will say; you are seeking variety for breakfast this may not be your first choice. The A.M. menu is limited to (3) \"lite options\", (7) full plate options and (12) side items to include the meats(4) and breads (3). I had the Avacado toast, which is served on Rye, over-medium eggs and sausage. My husband had stuffed French toast and an omelet.   My Avacado toast was different than what I'm used to; sliced and laid over the toast as opposed to smashed/blended w/olive oil, ricotta type cheese, but it was good. Eggs were fresh, prepared as ordered and though the sausage was good it didn't have any kick/spice, which may be fine for most.   My husband really enjoyed the stuffed French toast w/fruit and his omelet. The French toast was stuffed with a ricotta mixture, coated with Rice Crispys and cooked on a griddle I believe. Really different take on stuffed French toast but very tasty.   I was confused as to why we were served toast that seemed to have been toasted twice and a bit hard to eat but it was left on the plate as was my frustration with it!    Based on what appears to be a menu of fantastic fare, I think we would have really enjoyed the dinner as well but we had to get on the road so maybe next visit!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FW-lzoywCmuDqnHP3pecwg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FW-lzoywCmuDqnHP3pecwg/o.jpg"
      }
    ],
    "user_id": "UeogRCuvQ37ImgX2IX7FPw"
  },
  "qXSFO3moExqfb78-MiNR2g": {
    "date": "3/22/2018",
    "text": "We came here for lunch and all the food was really good. It's locally sourced and you can watch the chefs preparing your meal from any table. We got avocado toast as an appetizer and then the lamb tacos and salad for lunch. Would definitely recommend for a fancier meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7kBnNKRi1Um1sKK0mbIkvA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7kBnNKRi1Um1sKK0mbIkvA/o.jpg"
      },
      {
        "img_id": "uceHifCVQULqagCfbBmofA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uceHifCVQULqagCfbBmofA/o.jpg"
      }
    ],
    "user_id": "2NKOI38yFcoAWkDEBZDq1w"
  },
  "zUHmF-JoSA4fBLMaMNcI6g": {
    "date": "7/5/2018",
    "text": "So this review is a week overdue and my apologies to Samuel as I promised I would yelp right away but it took some time to get this right.   Person, place and thing.... Samuel, the amazing mixologist at Stoke! Personable and engaging with flair!   Place is Marriott Center City in Stoke, a comfortable contemporary bar with great ambiance to entertain business associates as well as meet friends for an after work or dinner drink.    Thing is by FAR the most amazingly delicious Old Fashioned I have EVER HAD!!! I could easily divulge the contents of said drink but I am reserving to do so in hopes you meet up with friends after dining out in uptown and stroll over to STOKE, a classy contemporary bar where the mixologists are knowledgeable and friendly, you can purchase an AMAZING cocktail with such a sweet flow of flavors and sit back and be an adult for an hour, enjoying the ambiance of STOKE where you hear good music but can still hear yourself think as well as your friends conversing.   Samuel!!! You are excellent at what you do.  You pour a fantastic drink and I have raved about that Old Fashioned to anyone who is looking for a great place to go. It was the flavor of that drink! By far one of the best drinks I have ever had in a bar the world over (yes I've traveled internationally many  times.)  Great job Samuel! Katie and I definitely give you five stars! You couldn't have done anything to make it better. It was perfection. Thank you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "48BcS4xZaZocb5m4WtO_aw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/48BcS4xZaZocb5m4WtO_aw/o.jpg"
      },
      {
        "img_id": "ZLeg3KMxlq5sXfg9MzbAvA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZLeg3KMxlq5sXfg9MzbAvA/o.jpg"
      }
    ],
    "user_id": "g_sHxW2ytck6QZ9K79crnw"
  },
  "nXXW_lwW3xPq52RuKQexzg": {
    "date": "8/18/2019",
    "text": "Hungry? You're in good hands with Stoke. They proudly make everything from scratch in an open kitchen using local ingredients and a whole lotta soul. They focus on southern foods that are simple, rustic yet refined.  My friends and I came for restaurant week and were blown away. We've been doing restaurant week for the last four years and Stoke is our favorite so far. We shared everything and enjoyed everything but we collectively agreed the smoked pork belly was the best dish of the night. We also agreed the donut holes we the best dessert of the night. But really, you can't go wrong with anything.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wNUCAah7oJn8i7bbDQ7-Hg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Donut holes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wNUCAah7oJn8i7bbDQ7-Hg/o.jpg"
      },
      {
        "img_id": "yQQGpULmHI2ZvmlunE-OXg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Smores Ice Cream Sammie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yQQGpULmHI2ZvmlunE-OXg/o.jpg"
      },
      {
        "img_id": "7NLq2hfnfGdakrxeD6TTCg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Donut holes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7NLq2hfnfGdakrxeD6TTCg/o.jpg"
      }
    ],
    "user_id": "pBeNjksmGLPlBTaujOqiLQ"
  },
  "ojk_plEzsO_Ab-9EzkqudA": {
    "date": "7/27/2019",
    "text": "I've been wanting to try Stoke so we decided to come for restaurant week. After we made reservation, it was announced that Chef Coleman was leaving so we were there for his last night.   We had an early reservation and were seated right away. We were seated with a great view of the open kitchen which was cool.   There were four of us and we split our appetizers of the deviled eggs, hushpuppies, sticky pork toast, and pan roasted scallop. They were the best hushpuppies I've ever had. The scallop was amazing and the pork toast was very unique.  For entrees, my husband and I split the smoked pork belly and the catfish. They were both incredible. The pork belly was probably my favorite, but it was a small portion.   I finished with the donut holes for dessert. They were awesome. Three big donut holes with a ton of cream to go with them. No Heath crumbles for me since I don't like chocolate.   The vibe is relaxed even though it's a very nice restaurant. It's not stuffy at all.   I'd definitely recommend coming here for a nice dinner and hope the next chef carries on what chef Coleman started.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "0f1eobZGJ3bDn0smbqhRFA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Pan seared scallop",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0f1eobZGJ3bDn0smbqhRFA/o.jpg"
      },
      {
        "img_id": "9p_YndlN6oGuja10E4jI3g",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Donut holes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9p_YndlN6oGuja10E4jI3g/o.jpg"
      },
      {
        "img_id": "TVnD0kC5k-tAGUodLlvQmw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Deviled eggs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TVnD0kC5k-tAGUodLlvQmw/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "Vbx0hdjKnbH8RgG1rxOSbg": {
    "date": "7/27/2019",
    "text": "I stayed at the Marriott where this restaurant is attached to and wanted a meal where I didn't have to walk outside too. After reading these reviews and all the \"hype\" of this restaurant, I must say they DO NOT deserve the rating they have.  The only good thing about my experience was the server was attentive and professional. Everything else was awful!!! For starters I ordered a farm salad was brought over a scallop dish. I am highly allergic to scallops and thankfully I did not have any of this. Then I ordered the flat iron steak. I asked for it medium rare. I don't know what happened but I had a few pieces and then noticed how rare it was. I immediately felt sick to my stomach and stopped eating.  I went up to my room and a couple hours later had symptoms of food poisoning. I was up all night in the bathroom and this was the only meat I had ate all day!! I am greatly upset with the whole experience. The manager Took off my glass of wine on the bill which I only drank half of anyway because I felt so sick!  STAY AWAY FROM THIS RESTAURANT!!! Unless you want food poisoning!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "G82OGxVNTdTOVKfbNRLvWg"
  },
  "6kvWdB5c7u4i94KxZ7_XEg": {
    "date": "7/19/2019",
    "text": "Pretty great for a restaurant in a hotel! The menu was small but everything in the group liked their meals. The small menu was, in fairness, the brunch menu still but it was around 2 and some more options (especially gluten free) would have been great.   Overall, the ambiance was cozy and friendly the food was pretty good.  I'll try to make it back for dinner and see what's going on and update if I do!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IJDGYoIGvtWnMfZgrfNLgA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Dining bar area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IJDGYoIGvtWnMfZgrfNLgA/o.jpg"
      }
    ],
    "user_id": "Tsx_ET41ZR-dxIWhdGw5AA"
  },
  "YlbTZdUbOQykOwtnuczl0Q": {
    "date": "7/22/2019",
    "text": "Interesting layout where the kitchen is completely visible to all. It adds to the overall experience and ambience on one's visit. First visit I was pleasantly surprised and now I go just because of its uniqueness. Menu has been kept simple which I'm sure is purposeful and for which I'm grateful. The food is well priced and taste. I recommend the BBQ dipped chicken sandwich however have the sauce on the side so you can dip to your likeness. Chef can get carried away at times lol",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3OvZilGzpW1Dz7l8qDcQGQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Open kitchen",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3OvZilGzpW1Dz7l8qDcQGQ/o.jpg"
      }
    ],
    "user_id": "tclPiErHMU7LwqDUQcb5dQ"
  },
  "sCIazPqSnEwNbrpQqQCp7w": {
    "date": "4/7/2019",
    "text": "I've been here a few times for dinner and had a great experience, however I went for brunch recently and honestly was extremely disappointing.   First, there either isn't a drink menu or we weren't offered one. Made it difficult to know how expensive anything was. I ordered the avocado toast with over medium eggs and was severely disappointed. First my over medium eggs were overcooked to over hard eggs, which I'm just not a huge fan of and then the avocado toast was simply sliced avocado on toast. Nothing else, no lime juice, salt anything that could be considered seasoning.   Also I have allergies and I had to ask the kitchen to change their gloves because either my waitress didn't say anything, or the chef disregarded my allergies. It's an open kitchen so I was watching them handle things I was allergic to and then get to my food  Lastly service wasn't great this time around. Overall just had to wait for our waitress from everything from water, to ordering, to our check.   The setting here is really nice and I've definitely enjoyed the two dinners I've had here. Would come back just not for brunch",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pHEhR0kaLNZt83EgPTWPlQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Kitchen",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pHEhR0kaLNZt83EgPTWPlQ/o.jpg"
      },
      {
        "img_id": "0h-QJHGAe0qBH_XTvNQ6Fg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Brunch menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0h-QJHGAe0qBH_XTvNQ6Fg/o.jpg"
      },
      {
        "img_id": "Hz7iwGpoXQHpaWVQ1HfkXQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Over hard eggs on top of avocado toast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Hz7iwGpoXQHpaWVQ1HfkXQ/o.jpg"
      }
    ],
    "user_id": "Z5SMn_JVZGtvgF7As2sNCg"
  },
  "SCopUiAaK_kZnohfZbi8ag": {
    "date": "7/27/2019",
    "text": "I came here for queens feast with my boyfriend and another couple and it was a fantastic experience. We got to choose one option from three different courses- appetizer, entree and dessert. I got the pan seared scallop which was AMAZING! It was in a green pea bisque which was astonishingly tasty. I wasn't completely sure what to expect of a pea soup but it was slightly sweet and paired perfectly with the scallop. For my entree I got the flat iron steak cooked medium and it was perfect. It came with a warm corn salad that was sweet and savory in all the best ways. One of the other people I went with got the smoked pork belly and I think hands down it was the best dish I tried all night. The pork belly was on top of a brick of sticky rice with some sauce on it and I wish I had gotten that dish instead. My only issue with it was that it was a noticeably smaller portion than all the other entree dishes. For dessert my boyfriend got the doughnut holes which was a smaller rendition of their infamous one pound (yes 1 lb!) doughnut. Basically the chef took that large doughnut and pulled pieces from it to make smaller balls rolled in cinnamon sugar with diplomat cream topped with crushed Heath bar. That was stellar and I'd recommend trying their normal doughnut to anyone who had the opportunity to. All around I'd definitely encourage everyone to go to Stoke",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HbReQTA_Ymyg2tfLPhcxsA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HbReQTA_Ymyg2tfLPhcxsA/o.jpg"
      },
      {
        "img_id": "HPL9rnDgvEv6ITWUMBRbig",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HPL9rnDgvEv6ITWUMBRbig/o.jpg"
      },
      {
        "img_id": "4JtixEnux44JS2ZI8daIpg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4JtixEnux44JS2ZI8daIpg/o.jpg"
      }
    ],
    "user_id": "ttmv_T2Zy8YwGpAsSvlDfw"
  },
  "uq_zH8NbdiCUohryiClQZw": {
    "date": "2/8/2019",
    "text": "Came here twice during my recent trip to Charlotte since I was staying at the Mariott and had a great experience both times! The restaurant is pretty spacious and located in the lobby of the hotel, with a bar area as well as a main dining area. The food/drinks and service were great, and the ambiance is upscale but still relaxed, which I was super into.  I tried a few of their cocktails, all of which were tasty and unique. The pretzel brioche with whipped butters was delicious and the scallops were also amazing (and huge!!). The Brussel sprouts were pretty good as well.  Overall, I would recommend Stoke to anyone in the Charlotte area. While the menu is definitely on the pricier side, I thought it was worth the money!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "K4bjyGsoZVnnzEbnlOPQIw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K4bjyGsoZVnnzEbnlOPQIw/o.jpg"
      },
      {
        "img_id": "zRVi0gMxugB9B3Wd-UQ70w",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Scallops",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zRVi0gMxugB9B3Wd-UQ70w/o.jpg"
      }
    ],
    "user_id": "4RbhwZc8q2dZuwV8KcJvEQ"
  },
  "uEtECwM2GuTnhlvdnIk0rQ": {
    "date": "5/5/2019",
    "text": "What a nice little eatery in the hotel lobby of the Marriott in City Center of Charlotte, NC.  Coming from San Diego, CA, I honestly wasn't sure what types of adjustments I'd have to make in order to understand businesses in these parts.  Granted, it's inside a hotel, so the standards need to be at least at par with the hotel itself.  It had the whole open-view concept.  You could see the place from the lobby, and you could see inside the kitchen from the dining area.  It looked very elegant, yet casual enough to feel absolutely comfortable.  Food was well-made. The omelette was delicious, but the two things that ended up unexpectedly stealing the show were the oatmeal and the butter.  The oatmeal had to have been slow-cooked over a certain period of time because it was so soft and not what I expected at all.  I'm glad I was able to have the appetite for it.  And the butter was so good.  It was soft from probably being freshly-whipped, and it had a very sweet flavor to it that made me want to use more of it.  Server was not only helpful, but also a riot.  She had very good recommendations from the menu as well as affirming reactions to our official choices.  It made me believe that there was not going to be a bad choice no matter what we decided to order.  On top of all that, she was funny, witty, and engaging.  The rest of the staff was great too.  Parking:  Since we did not drive during our whole time here, I honestly cannot speak on this aspect.  The streets tend to be narrow in this area, and I did not notice much street parking at all.  FYI:  - Open to all who can venture here.  You do not need to be a guest at the hotel to dine here. - They can accommodate for large parties.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "1tenbBbCUONAtbC0k5rdmw"
  },
  "y0JGf-j9p--p9ZRFW2u6CQ": {
    "date": "5/12/2019",
    "text": "We brought the mother her on Mother's Day and called ahead to make a reservation just in case. It's tucked away inside the Marriott, it's very open with brass fixtures and pieces.  Our waitress came up and provided us with water and mimosas. A slight delay on her return during the entire service which is the reason for the 3 stars. We even had to stack our own dirty plates.  I ordered the steak sandwich (med rare) w/ pimento cheese and fries. The fries were a mixture of fresh fries and slight over cooked ones. The sandwich was another story, very moist with amazing texture.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AKaWuHCHkt681blHeeMi4Q",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Steak Sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AKaWuHCHkt681blHeeMi4Q/o.jpg"
      }
    ],
    "user_id": "Dh0BM0JoxmitChKTxUIwcg"
  },
  "52Y8v75OoN9Y7Ye3N9arkQ": {
    "date": "7/25/2018",
    "text": "There's a right way and a wrong way for businesses to do Restaurant Week in Charlotte. I think most Charlotteans that keep their finger on the pulse of the local restaurant scene know exactly what I'm talking about. Far too often I've given a place a chance only to find that their food isn't up to par, portions are scaled back way too much, or the business simply can't handle the influx of customers. The folks at Stoke should be the model that every other restaurant strives to be for Queen's Feast!  Reservations for 6:45, we arrive at 6:35 and are seated immediately. To my surprise, we are seated just steps away from the open kitchen. All night long we are able to watch Chef Chris Coleman plate some stellar looking food with such precision all the while making sure every dish was perfectly presented. Our waiter (also named Chris) was friendly and took the time to explain both menus being served that night and suggested some beers for us.  The food wasn't the only thing that was amazing looking. The entire restaurant is what I would call \"rustic-modern\" with a warm, spacious floor plan. I'm not sure which one steals the show more, the massive bar or the open kitchen! My first visit left me wanting to come back equally for the food and the atmosphere.  On to Dinner and my girlfriend and I chose three courses exclusively from the Restaurant Week menu. Another note on their menu for this event: They have a lot more options than most restaurants usually offer. 8 Appetizers, 6 Entrees, and 4 Desserts. Since me and Kristen split most of the plates, I'll list 'em all from first to last bite.  Mom's Deviled Eggs: These are perfect little bites of flavor explosion. Seasoning was spot on, not everything has to be overbearingly salty, spicy, or tangy, which is what you normally encounter with deviled eggs. Topped with butter pickles and aleppo chile, it was the perfect amount of sour and heat. While regular red chile is a one-hit wonder, aleppo dials the heat down a bit with subtle southwest hints of fruit and spice.  F&S Hushpuppies: These have utterly destroyed hushpuppies for me. Never again will I be able to go to your average greasy spoon and order 'em, they won't stand a chance. Fried to perfection, which I would call a couple of seconds beyond golden brown, and served with simple honey and butter. The seasoning, the butter, the honey, it was just amazing. What really made it sing? Order a Birdsong Jalapeno Pale Ale and enjoy plate of these with it. You'll thank me later.  BBQ Half Spring Chicken: This was my girlfriend's entree as the fettuccine & shrimp she was eyeing had pine nuts in it, and unfortunately she's allergic. Regardless, I saw no sign of regret as she rolled her sleeves up and devoured the chicken with her hands! I mean, really, there's no better way to mow down a bone-in bird. Again, a real simple dish but the execution on these simple ingredients are so carefully crafted they simply shine. Red grits were wholesome, thick, and delicious.  Sticky Pork Belly: When this plate first came out I was a little disappointed in the portion size. That soon changed when I realized how much flavor this piece of pork was packing. After the first bite I stared to cut my pork into tiny pieces just to savor it for a bit longer. The seared glaze on top gave the dish an amazing crunch with a hearty texture underneath in every bite. The squash and 'quick' pickles paired so well with this dish.  BONUS Dish - Charred Octopus: So hats off to Chef Chris, he sent our table a small plate of the charred octopus. I got to admit, octopus is something I probably wouldn't have voluntarily ordered but I'm so glad I was able to try it here. The char gave the edges of the octopus this perfect crunchy texture and it almost reminded me of a more toothsome version of lobster. Paired with fingerling potatoes, spicy chorizo and aioli, it all came together to make one of the best small plates I've had in uptown.  \"The Doughnut\" (Holes): I think this is the perfect way to enjoy a single serving of what is probably Stoke's most famous \"Instagram-worthy\" dish. I can't tell you what's better, the doughnut itself or the Diplomat Cream it's served with. Warm perfect texture with a crisp exterior, sweet and complex diplomat cream that has just the right amount of richness, and the Heath crumbles on top just nail all the criteria for a slam dunk dessert.  Chef Chris and his team are doing amazing things here. Now two visits in, I can honestly say I haven't had a single disappointing or even average dish. This dinner just had me blown away with the thoughtful combinations, every flavor worked so well with each other. Next time I'd probably request the kitchen to just surprise me, bring me what they like, it'd be a first! Thanks to everyone at Stoke for such an amazing evening. This was just one night ago and I'm already wanting to come back.  'Nuff Said",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 10,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "EvYApqXMXcUw93XGaq-3yw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. The pass.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EvYApqXMXcUw93XGaq-3yw/o.jpg"
      },
      {
        "img_id": "2QBO8hDUu0DJns6lGQd98g",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. My breakfast was better than yours, don&amp;#39;t @ me!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2QBO8hDUu0DJns6lGQd98g/o.jpg"
      },
      {
        "img_id": "z_9dRoYmDqswxwt_ojjx-Q",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Rawr (found this guy in the planter near the front of the restaurant).",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z_9dRoYmDqswxwt_ojjx-Q/o.jpg"
      }
    ],
    "user_id": "dpzAqLprtex54rXlCU-OTA"
  },
  "ZHNBKueek7ZhGICgJYMmyw": {
    "date": "3/16/2019",
    "text": "Stoke was amazing. My friend and I chose to do Sunday Brunch here and mark it off our long list of brunch spots. We both ordered the French toast and The Usual. My favorite item was the banana bread loaf. It was amazing. I have zero complaints about this restaurant and will definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0X2FvPjwioj5RL6PrZAXVA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0X2FvPjwioj5RL6PrZAXVA/o.jpg"
      },
      {
        "img_id": "erVufP20w5UeAphlnuHjJQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. French Toast &amp;amp; The Usual",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/erVufP20w5UeAphlnuHjJQ/o.jpg"
      }
    ],
    "user_id": "KOr-cB-a_lBKzzgs-hPCvA"
  },
  "bUQQRRaVPaB78JmbA0zH_g": {
    "date": "7/9/2018",
    "text": "Came here for Father's Day lunch. Made a reservation for a group of 5 for 1pm on OpenTable. We arrived about 10 minutes early, were greeted immediately, but was asked to wait for our table to be ready. The restaurant was busy, but not packed. The restaurant is located inside the Marriott. It's not that big, but there's plenty of seating. Parking is valet only, but the restaurant validates the parking.  We were seated withing 5 minutes. Our server was Colby (I think?) and she was fantastic. She was friendly and attentive throughout the entire meal.  We ordered: Garbage fries $9 Trout $18 Chicken BLT $10 Steak sandwich $10 The burger $12 Shrimp & Grits $18 1 lb donut  We asked for the gravy on the side for the garbage fries, and we actually enjoyed it better without the gravy. We loved the size and crispiness of the fries. Our orders were cooked to our liking. We really enjoyed the flavors. The portions were great and prices were reasonable. My son loved his shrimp and grits. He devoured the shrimp in minutes. I only finished half of my steak sandwich and took the rest to go. It was delicious and very filling. My husband and mother had difficulty finishing their orders as well. My mother took half of her chicken BLT to go, too. The donut was amazing! Even with 5 people, we could not finish it. We definitely took the rest to go and ate it later that day for snack.   Great experience and great meal. We will definitely return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Armg0HPlC5ybHTCMHeIYDw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Trout $18",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Armg0HPlC5ybHTCMHeIYDw/o.jpg"
      },
      {
        "img_id": "252sJBuR7nSTqPRWA0NXkw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. 1lb donut",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/252sJBuR7nSTqPRWA0NXkw/o.jpg"
      },
      {
        "img_id": "ETJQ581zr-NLJUCkA7udfQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Steak Sandwich with Pimento Cheese $10",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ETJQ581zr-NLJUCkA7udfQ/o.jpg"
      }
    ],
    "user_id": "nhlXSTW453F3587FKo-Rsw"
  },
  "omUsOzHFpYgGqi5FhtuA_A": {
    "date": "1/20/2019",
    "text": "This bar has some solid cocktails and a casual atmosphere. It's located inside the Marriott Hotel. The bartender Sam is excellent! A good place to go if you aren't trying to wait in a line when you go out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aTJVu1i3wlNqYh8OlFWTDQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. French 75 made with vodka instead of gin, my favorite here",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aTJVu1i3wlNqYh8OlFWTDQ/o.jpg"
      }
    ],
    "user_id": "Ga8510f-1eBaztYuQyBdYw"
  },
  "140PLojFqBkVW1O2W08PEA": {
    "date": "12/22/2018",
    "text": "Prob worth 3.5 stars. It was good but not the hype I had heard. I also found out after the group and I ate there that they just recently had a C (70s) sanitation score...but it was corrected/higher when we ate there. Still...what on earth did they do to get a low score like that? Gross. Shared some apps - pretzel bread was delicious with the diff types of butter. Wish I had more of it! Salad was unique, flavorful and colorful. I enjoyed it. The menu wasnt that impressive. The problem was we waited entirely too long for our food. The waitress knew we had a show to go to and we were there for over two hours, causing us to be late to show. If they served us in decent time, we would have all gotten dessert too but we missed out on that. If you go, just know you will be there for a long dining experience.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "90v2ksPZpDAdqaeuWcvDDg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Farmer&amp;#39;s Salad...so pretty and colorful",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/90v2ksPZpDAdqaeuWcvDDg/o.jpg"
      },
      {
        "img_id": "cipi9gNa5CKX8IBUE8_Yjg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Open kitchen concept",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cipi9gNa5CKX8IBUE8_Yjg/o.jpg"
      },
      {
        "img_id": "uILJ0scvJE8HWa2dWlbEHQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Dec 2018 Companions",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uILJ0scvJE8HWa2dWlbEHQ/o.jpg"
      }
    ],
    "user_id": "Ngt1DInAEf3Zlw0YqWoh9Q"
  },
  "oHj2mTuuhDgJ81jzL7B-mA": {
    "date": "8/5/2019",
    "text": "Visited for restaurant week and the food was exceptional. I love when restaurants in uptown have complimentary parking so that is always a plus. The food is great, the atmosphere is OK but offer smaller portions. I would go back and suggest for a date night, not larger groups.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "beTC60aV9LYCdnvjLos-bw"
  },
  "DFpWzs3K01UwTpJW0kmzaQ": {
    "date": "5/8/2019",
    "text": "This was a really special dinner for 7, that I will not forget.  They sat us at a marble table/bar, connected to the kitchen counter.  This was a great seat to get to watch the cooks at work, slicing prosciutto, plating entrees, etc.  We began with cocktails, which were interesting and well made.  I and a companion especially enjoyed the house version of an old fashioned.  Unlike some old fashioned, this had no muddled fruit, and had a burnt orange peel, which is just how I like it.  We ordered the pretzel brioche with three butters: cheerwine, a mustard butter, and I think a honey butter.  All 3 were good, but I especially enjoyed the cheerwine.  The bread was amazing, but not nearly enough was served for the amount of butter that comes with it.  Fortunately the waitress brought us some extra bread on the house.  We also had a mean and cheese platter (I think it was called \"ham and cheese\") which featured three fancy and delicious hams.    For my entree I had the duck, which was wonderfully crispy on the outside, and pink and juicy on the inside.  I would love to have that again.  For dessert we had the \"one pound donut\" (can't remember what it's called on the menu), which easily fed the table.  It was topped with a delicious creme fraiche/custard type confection, which was addictive.  I was especially impressed that they were able to cook this gigantic \"donut\" (it didn't have a hole - it was more like a big square pillow) evenly and perfectly, so that it was crunchy on the outside, airy on the inside, and didn't have any undercooked parts.  Our waitress was excellent - friendly, helpful, informed, and attentive.  I would love to return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3h4RTOkVMC8Woq0ynrHnvw"
  },
  "TwbvWC04G5zwmkMrx5JSOQ": {
    "date": "7/30/2019",
    "text": "We got the set menu with an appetizer, entree, and dessert all for $35 which was a phenomenal deal. The scallop for appetizer was cooked to perfection and the sauce that came with it was also very rich in flavor and had a complex taste profile. It was very delightful. The cook on my steak was also a perfect medium-rare and it rested on a bed of squash puree that was very delicious. The sorbet was also one of the best that I've had. It had a very rich peach flavor with fresh peach chunks and a slight saltiness for the finishing touch. Some of the people that I went with really didn't like it and preferred the donut holes but I really loved the sorbet. The kitchen was also very open and you can see the chiefs cooking. The atmosphere was good and the service was very good. I would recommend people going there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NxVGwPT1mmQVD646iIjeVA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Sorbet",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NxVGwPT1mmQVD646iIjeVA/o.jpg"
      },
      {
        "img_id": "RH_A8uPKr-uMO_wr-be-Zg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Steak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RH_A8uPKr-uMO_wr-be-Zg/o.jpg"
      },
      {
        "img_id": "SuPCVT48ESKDVt5elnA-Hg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Scallop",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SuPCVT48ESKDVt5elnA-Hg/o.jpg"
      }
    ],
    "user_id": "LxyD_M6fdNcxOPy3dWBz9Q"
  },
  "JpFgl2p_k8o_kP6O5uejRg": {
    "date": "3/29/2019",
    "text": "I found Stoke on YouTube. I watched someone stop in to try Stoke's crazy big take on a Boston cream donut, and I knew I had to come in for dinner.   Dani was friendly and gave us great recommendations. She refilled our drinks without request and periodically checked in with us about the food. The menu is simple, but it has something for everyone -- think a fresh twist on comfort food. Mom's Deviled Eggs are great, the Hush Puppies tasted crisp (and not too greasy), and the Pretzel Brioche comes with three equally awesome butter spreads. The Wood Fire Chicken is big enough to split between two people, and the chicken was well seasoned and cooked perfectly.   Dessert was what I looked forward to most, and The Doughnut did not disappoint, oh my God. The name might make it sound ordinary, but it beats every regular donut I've ever had. The Doughnut is massive, it can feed the whole table and the Heath Bar topping is a great touch. If you come to Stoke and don't try it, you're missing out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c_NLNsE900icl8Kmsgh8GQ"
  },
  "SqyUKxl7DttYmkMGtgZMdQ": {
    "date": "5/14/2019",
    "text": "We had a really great experience here. The restaurant now fairly big and open. We expected it to be loud based on the way it looked, but it really wasn't.  We were able to enjoy the conversation at our table during the entire meal.  Also the view of the open kitchen is pretty great.  I enjoyed seeing every dish that came out and it gave me some ideas for next time for sure.    The service was prompt and polite and very good.  We ordered the Pretzel Brioche and the Farmer's Salad as appetizers.  The Pretzel Brioche was served with three butters- honey butter, cheerwine butter (my favorite) and a mustard butter. All were delicious. The Farmer's Salad was also very tasty with crunchy chickpeas and a carrot dressing.  These were a perfect start to our meal.  Two of us split the Woodfired chicken and the braised carrots.  The chicken sits atop a plate of polenta.  It was a  very tasty dish.  The rub/seasoning on the chicken was perfect and the chicken was juicy. I could have eaten an entire plate of just the polenta- it was excellent.  The carrots were an excellent side to this dish and had me coming back for more.  For dessert we had the doughnut which an entire table could split.  It was everything we had heard it would be.  Probably the best doughnut I've ever tasted by itself, then when you consider the cream and the Heath bar topping, it just can't be beat.  We definitely took some home and I'm happy to report it tasted just as amazing out of the fridge the next day. (Definitely wasn't letting any of it go to waste!)  We'll be back to Stoke for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LG0bVAzwCvwbSipf99fhgQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. The Doughnut (and view of the kitchen)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LG0bVAzwCvwbSipf99fhgQ/o.jpg"
      },
      {
        "img_id": "YGmmOl5IZqXIY3txTim1Ng",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. The Doughnut",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YGmmOl5IZqXIY3txTim1Ng/o.jpg"
      },
      {
        "img_id": "ImM96GPOaYIoVjWZOCcFMw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Woodfired Chicken and Braised Carrots",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ImM96GPOaYIoVjWZOCcFMw/o.jpg"
      }
    ],
    "user_id": "vs4ECjWAwaKmrnEUylzQyQ"
  },
  "F0bXbeDcSOAqLMTr0mAvbQ": {
    "date": "9/16/2016",
    "text": "Wonderful service, amazing food. The cocktails are fantastic-if you don't try the Stoke Fashioned you'll regret it forever. As for starters, the pretzel brioche melts in your mouth like cotton candy and deviled eggs were sublimely tangy. The Carolina shrimp and clams features the chef's mother's gumbo broth recipe which is heavenly when sopped up with some of the left over pretzel brioche. The Carolina gold rice grits paired well for a little shrimp-n-grits action. The lamb shoulder was perfectly prepared and beyond delicious. The blistered tomatoes sat on a cushion of stracciatella; I could eat this everyday for the rest of my life. My only regret is not saving enough room for the giant doughnut I keep hearing about!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "adFa0XjzjUTR1PZ32a6eZg"
  },
  "owSyJlixn3WLRvChTYZjQg": {
    "date": "11/24/2016",
    "text": "Our second visit to Stoke was similar to the first - mediocre service and hits and misses on the food. Both visits, friendly service, but inattentive and WAY unprofessional.  Our server tonight was too busy sharing her experience of whatever to inquire why I hadn't eaten much of my dinner (it was TOO salty!). Both visits I got the avocado toast, both times the avocado had too many brown spots.  Ordered the shrimp and clams, the broth was so salty, I sent it back and ordered a salad which came around when all of my dining companions had finished their meals.  We love the chef, he used to cook at The Asbury, although we have not seen him at the restaurant.  If the chef or the manager were overseeing the restaurant, these issues would not have happened twice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hIHqsskaLCBSgUzBePus8w"
  },
  "9Brd7QjTJ9YeMlFeeHWtBQ": {
    "date": "10/6/2017",
    "text": "They spent all the money on the chefs.  Food great. Wait staff and hostess were like Wal-Mart refugees. This low unemployment rate is causing an upscale restaurant dystopia.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iryAJbxSQNi6XP2XeS7Qzw"
  },
  "JWlR-TjRxKL14gGrfp44sw": {
    "date": "8/30/2016",
    "text": "Had lunch here today and waited almost 45 minutes to receive our order. We had the fried catfish sandwich and the market fish of the day,  which was a red snapper with a vegetable melody.  I also had a small side order of fries which were supposed to be seasoned with lemon and cracked black pepper; I detected neither but the fries did have an over abundance of salt.  Both the catfish sandwich and the snapper were very good, but given Stoke has only been open for about 3 weeks now, I will let them work the kitchen kinks out over time before I go back.  We had to woof our food down in 15 minutes to get back to work for a 2pm meeting.  Stoke needs to get their act together if they expect to serve the Charlotte lunch crowd.....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Bc4yzUSuRWMi906_S0ozA"
  },
  "ymHrxmU6skbNNd1f_Mf-5Q": {
    "date": "6/3/2017",
    "text": "Food was boring and dry.  Not much selection.  Loud..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Mi_dJRmO663nIdcZp_TrQ"
  },
  "98EXNKewW72xZTmClpPCPg": {
    "date": "6/3/2017",
    "text": "Food mediocre, service indifferent, noisy atmosphere, low value for dollar. Not even an average big hotel lunchery.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vcbHrBjkrQzZPXWlRpWN0w"
  },
  "YaxEoTOvYAa-jHp205_qkA": {
    "date": "8/18/2016",
    "text": "Most amazing experience in dinning in Charlotte . A fan of everything on menu across the board . Thought out apps to great dinner options . Best hospitality service great time thanks to all for making this experience a memory. Chef Chriss and everyone good luck.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "S5i3FNh8In-eoPfQB1SFBw"
  },
  "TKHNmSd6coTyFUdfyX3OPg": {
    "date": "1/8/2017",
    "text": "Our experience may not have been typical because it was the night a big snow and ice storm was to roll in, so even though it was a Friday night there were not many other diners in the restaurant.    I imagine on a busy night it becomes much noisier.  The hostess was very nice and chatted with us for awhile and our server was attentive and knowledgeable.  He spent time with us as well, as we waited for the third person in our party to arrive.  We started with the pretzel brioche & butter which looked way bigger when I viewed other reviewers' photos.  I was surprised by how small it was.  But, it was just the right size not to spoil your dinner!  And it was warm and delicious on a cold night.  I had a large \"simple green salad\" for dinner which was good (lettuces, fennel, orange, chevre, pomegranate).  The two gentleman with me had entrees:  shrimp & lobster paella and a lamb dish with pasta.  They both enjoyed their meals.  We also ordered and shared 2 sides:  brussels sprouts and beets, both were tasty. The big donut dessert was the star of the meal for me and we also had a chocolate board dessert sampler.  Our cost including tip was $180 for three people.  This included one cocktail, one glass of wine and an iced tea.  The restaurant is beautiful and the booth was comfortable.  We had an enjoyable meal before attending a Charlotte Symphony concert.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jI1XHPSYoPtkA2v7-G1NLQ"
  },
  "szo7uRneBBbAIDH07BKfig": {
    "date": "8/27/2016",
    "text": "Ambiance is good. Food is eh. Cocktails are eh but not to pricey. Servers need smaller sections to be able to tend to guests better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "KW-LCrMb3F_DUDYaX9k0sQ"
  },
  "j21s_UBpzzY0UHBtOh5RGg": {
    "date": "10/3/2016",
    "text": "From the moment we walked in, we knew we were going to have a wonderful dining experience, and we did! The vibe and decor set-up an festive atmosphere, and you can tell everyone is enjoin themselves.  We were lucky to sit at the Chef's Table, so we got to witness all the culinary magic happening!  We enjoyed the local ham and cheese platter for our appetizer, and then shared the roasted chicken, cooked tomatoes, and pimento mac and cheese, all delicious and plenty for the the two of us.  The creative cocktails, and bottles of wine made the meal complete! We're looking forward to returning, and hope to save room for dessert next time! Welcome to the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hWmNMLXDSlp2ww8nb9FISg"
  },
  "0lNVVn6umS8-9tjFfFNADA": {
    "date": "5/7/2017",
    "text": "Ambiance was lively.  Service was good.  Drinks were very good.  Food?  Meh.  Too salty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AXwsqmw6r7Gq9IJOXSvc-g"
  },
  "wnTAs0ELm_iifYCfSTMngQ": {
    "date": "12/4/2016",
    "text": "My husband took me here for my birthday dinner and it was delicious. From the craft cocktails to the cheese board and entree, we loved everything. The cheddar rice grits were amazing and we loved the pork shank too! Service was excellent as well. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZZ9BNtr1e3vEvfeG4edljg"
  },
  "2-gE05KVdfSQQeg8uCk3fQ": {
    "date": "4/27/2017",
    "text": "We have \"date night\" every Wednesday and Stokes was a good surprise - great great service and excellent small plates - as all hotel restaurants a little pricey for the servings but the charcuterie was good and the donut desert was a take home prize.  All in all good food and great service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eDRq6aCDc2JIS3m7hO7VuQ"
  },
  "0wFt-AbKS7izvy6TUe_5Xg": {
    "date": "4/11/2017",
    "text": "Came here on Valentine's Day. The service was phenomenal and the food was perfect!  Best oysters and best grits I've had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vaNlA8A56bMMQiDuurx_sQ"
  },
  "LjxfT11uLVDp8Xqkqbz4mA": {
    "date": "12/2/2016",
    "text": "I had heard great things about STOKE and knew it was a tough dinner reservation. So opted for a business lunch yesterday. And STOKE did not disappoint! Love the farm-to-table menu with local ingredients. And the service was outstanding! Shoutout to our waitress Ali! Such a pro. Went above and beyond to get one of my lunch guests what she requested, even though it was not on the menu. With the great food and service we experienced at STOKE, it should become one of Charlotte's top restaurants. Can't wait to try it for dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FtdWS7aRUt_FFhMZWhGRjg"
  },
  "dEqXznwWm35YCV1MYPHPBg": {
    "date": "12/16/2016",
    "text": "Amazing dinner! Went here for dinner with friends to celebrate one of their birthday. The ambience is perfect for groups, a few dinner guests, as well as for couples night. Food was amazing! Management friendly, attentive, and interested in all enjoying the restaurant.  The only suggestions to work on would be the mac and cheese (when everything else is amazing, basic sides, a la mac & cheese MUST be extraordinary), and the bartender should be able to make amazing drinks beyond their signature cocktails. Otherwise food was outstanding (had trout special, lamb, pork shank, butternut squash, smoked deviled eggs, and THE DONUT!!!) Will absolutely be back....many times!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ex9WI3Qn9vaXqzQ4JnA0tg"
  },
  "Cgcyd_hXngJUrdwK_zK-OA": {
    "date": "12/29/2016",
    "text": "Farm to table style restaurant in the Marriott. Excellent service. Great food. Cool atmosphere. Definitely worth going if you're looking for a good meal with quick service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "scu_B5HYNyQ6GR-D4NIqQg"
  },
  "yS4Qa3M7riNbK7xCxKUraw": {
    "date": "9/16/2016",
    "text": "Just went for cocktails after work and the tall chairs are terrible to sit it, but the drinks were really good and the cheese plate was great.  Will be going back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eR8O_cotN3aygIZx7KnDxw"
  },
  "pTbckIJqgWLTx9-FU4E7WA": {
    "date": "8/8/2017",
    "text": "We were travelling from out of town and met a friend here for dinner.  We happened to be staying in the Marriot, which is where the hotel is located, so we couldn't have asked for a better location.  Very hip, open design.  The restaurant was comfortable and spacious, and our server was spectacular.  The cocktails were excellent (their pressed cocktails are something unique and  flavorful, served in a French press).  We ordered the pretzel brioche (excellent!) and the cheeseboard (good, but not worth the $30 price tag) to start.  Our friend had the fish of the day, and we had the chicken and the pork shank.  Everything was beautifully presented and very flavorful.  The corn and potato sides were also delicious.  The only thing I might say is that at a lot of other restaurants at this price point, the portions are small (which I have no problem with...quality over quantity), but usually there are some type of \"sides\" included that make it still a complete, albeit small, meal.  Here, the portions are small, but for that price no sides are included...everything is ala carte.  That's really the only criticism I can think of.  Other than that, this is another great example of an establishment that is destroying the old negative stereotype of the \"hotel restaurant\" that was so prevalent even ten years ago.  Farm to fork, ingredient-focused, and innovative cuisine.  We'd definitely stop back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1co99pw7jc2ohMap0ISJBQ"
  },
  "khdvgdQQQCg_7Qu5e1vAOA": {
    "date": "6/9/2017",
    "text": "I checked into the hotel on a Tuesday night for a conference that started the next day. It was 8pm and I was hungry so decided to check out the hotel's main restaurant.  Having been to several great farm-to-table restaurants in northern VA and in Texas, I decided to try it out.  I ordered the pork shank and the carolina rice grits (both recommended as most popular items on the menu) with a gin cocktail.  The cocktail was pretty good, but the food was a major disappointment.  The pork came in this sticky brown sauce sprinkled with sesame seeds (sorry \"benne seeds\").  The sauce was tasteless except for an over abundance of salt.  I couldn't have them refill my water glass fast enough - it was that salty.  The \"grits\" were bizarre.  White rice similar to an overcooked watery risotto with white cheese (which you couldn't taste in the dish) covered with a poached egg (white as well) and what I suspect to be a drizzle of olive oil or maybe it was the melted fat from the cheese?  It's kind to say the dish looked less appetizing than the menu made it sound.  Unlike the pork, the rice was severely under seasoned, and the texture of the entire dish was mushy (think really mushy rice pudding).  After tax and tip, I paid about $50 for one person and I wished I went to Coco & the Director for a hamburger instead.  Considering the plethora of other solid 4 star restaurants within 1-2 block radius of the hotel, it really is amazing this place can charge as much as it does with the food it produces and remain in business.  For the signature restaurant in a Marriott hotel, this was a major disappointment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ET79ILissjMV9a5uhjmfw"
  },
  "IkBOtssxo5f00Qsbjpj41Q": {
    "date": "7/9/2017",
    "text": "So we've been here a few times, only for drinks though. Old Fashioned is one of the best in town. Good craft selection. Made custom drinks at request of my wife, all of which she loved. Have laid eyes on the pork shank a few times and it looks amazingly delicious. All the bartenders are very nice. Place also has pretty cool ambiance. Will be back to grab some food at some point.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "13aOHJFfWndyR-y4qi0U6w",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Old Fashioned",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/13aOHJFfWndyR-y4qi0U6w/o.jpg"
      }
    ],
    "user_id": "3UevAjRSoujhM-b40ivTOw"
  },
  "UbQQz5qYR-49PXN7s5MSAA": {
    "date": "11/14/2016",
    "text": "In October shortly after the grand opening I visited Stoke to enjoy some libations and eats...it was my first visit and I wasn't disappointed.   Yelp family...I'm the single girl who goes to the bar to people watch and experiment with the drink menu, nothing like cold, stiff well crafted libation...Stoke had me covered.   They have a signature Old Fashion, while I hate ordering what everyone orders, I eventually but the bullet. There's a list of preinfused crafted drinks they will let you sample before selecting - great options and then UNIQUE was a pressed drink menu. It's served to you in a French press...it was fly!   Burger - slammin' Bartenders- awesome Price - get what you pay for...  Atmosphere- drippin with swanky & sexy Date night - sure could, I actually walked out with a stranger and we kept bar hopin...just sayin!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 5
    },
    "photos": [],
    "user_id": "XrgcHURVAe_wys_jdweKLw"
  },
  "nqHgVpRsRbtcXlnG8KlbnQ": {
    "date": "2/20/2017",
    "text": "Wonderful environment and definitely unique that they served water in large brown bottles. Health score was really low, but I understand that the kitchen is completely open and they work in a small space. The food was wonderful, especially the charred broccoli kale salad. Charred octopus could have been cooked better, but otherwise everything was delightful. Parking is validated through the valet, not the parking garage next door.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I8flth7ZMjES03pgNRK3nA"
  },
  "g8x_OcwBKryJfEJ5i2qpWQ": {
    "date": "2/1/2017",
    "text": "Good eats! I didn't get a chance to get dessert was too full maybe next time. Had the octopus- great texture and flavor and scallops were cooked nicely. The sauce was a little bland for my taste buds but not bad. Had bread with 3 types of butter all delicious. The drink cocktails were good/unique and strong enough. I would have liked more frequent water refills. Good ambiance inside Marriott hotel .",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OoiC8ihiDzCWkrMPBtxYsA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Scallops",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OoiC8ihiDzCWkrMPBtxYsA/o.jpg"
      },
      {
        "img_id": "HpDbdf6MuEHD6xNTnQ9bPw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Octopus",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HpDbdf6MuEHD6xNTnQ9bPw/o.jpg"
      }
    ],
    "user_id": "Ru_q5mNBYvD1nWqupbNF_g"
  },
  "0qmKl1j-D_74K8LBkU8qcg": {
    "date": "1/19/2017",
    "text": "Stoke has just officially taken over \"my favorite restaurant\" spot in Uptown!  I adore that you can see the chefs at work from your table. The menu was just the right size for my taste...big enough for a nice selection, but small enough so you know each and every dish is well crafted with fresh ingredients! They have gorgeous wall coverings listing all the local and regional spots where they source ingredients.  The service could not have been any better. Pamela was the best! She knew the menu and drink list inside and out and explained each in detail with every question we had. She paced our courses nicely and was always available when we needed, but gave us plenty of time to eat and socialize without rushing us. The food!!!! The food!!!! The pretzel brioche was a great starter with 3 delicious spreads. I filled up with mouthwatering pork shank and brussel sprouts. But always always save room for The Doughnut...Yes w a capital D! It will easily feed a family, but you can always take the leftovers home too! Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2_H_w2TYOf7483qRtxlgxQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Picked Vegetables - Complimentary",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2_H_w2TYOf7483qRtxlgxQ/o.jpg"
      },
      {
        "img_id": "IwwRmtggD4XzezV96XdHKQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Cheese Board",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IwwRmtggD4XzezV96XdHKQ/o.jpg"
      },
      {
        "img_id": "e_O9YbDY13FKu9oFeofaXQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Stoke House Pretzel Brioche",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e_O9YbDY13FKu9oFeofaXQ/o.jpg"
      }
    ],
    "user_id": "_peVol5RVrLz2UMFaZjzEQ"
  },
  "EnXokMOInjD6IN-BxMvzYg": {
    "date": "8/20/2018",
    "text": "Small menu.  Lamb tacos were good but greasy.  My partner had a chicken sandwich.  He didn't like it.  The taste of the sauce was overwhelming.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2vk6FWpfmzDPmCjI06yqPw"
  },
  "4cEUWyN2mFNzwV8-h5_LOw": {
    "date": "2/4/2017",
    "text": "I made the trip downstairs from the hotel room in hopes that breakfast would still be served around 10:30am. I seated myself and was promptly tended to by a server, who I later learned her name was Maria. Let me start with the atmosphere-casual, clean, crisp, comfy and loved the masons jar silverware display on the tables. I ordered an omelette-with bacon, cheddar, and onions. It came with white toast, not what I had ordered, but Maria graciously made the change, as she was the one that recommended I give the banana bread a try and I'm so glad that I did. The food was delish! I also ordered hot tea and i was delivered my own personal kettle and matching mug and was provided a new tea bag and a to go cup as well. Maria was very sweet, and attentive. She was personable and genuinely seemed interested in making her interactions with me by asking about my football team( I was wearing a buffalo bills shirt) and asking what brought me to town. Thank you for a great meal and great service! Keep up the great work",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HM4_39_-jYK-vLu2_1_oMQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Delish omelette-not the side that I ordered but it was promptly fixed!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HM4_39_-jYK-vLu2_1_oMQ/o.jpg"
      },
      {
        "img_id": "0P5L4r5GdHnTDPj6j8WuQQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Beautiful set up!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0P5L4r5GdHnTDPj6j8WuQQ/o.jpg"
      },
      {
        "img_id": "9EuYke25aT63ptL0nDYrgw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Such a nice presentation and discovered my new favorite brand of tea!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9EuYke25aT63ptL0nDYrgw/o.jpg"
      }
    ],
    "user_id": "YZ89IiCnf6B6F_YoIr4feg"
  },
  "gYyzP5s4eHC60lz8rvv4Mw": {
    "date": "8/4/2017",
    "text": "Made reservations at Stoke on a Friday night to celebrate a birthday and an anniversary with family, and I have never had a better experience at a restaurant. Our waitress was attentive and excited to explain the new menu to us and provide us with both food and drink recommendations, and we were not disappointed. Everything we had from the pork to the charred octopus was fabulous, but we (thankfully) saved a little room for the home made donut dessert. We were also lucky enough to get to taste a new pork belly dish they were testing in the kitchen.  Long story short: we will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0iR_gYqaeEnL-M7R2h8igQ"
  },
  "WNbCh2omOKHeiW8M4M3gkw": {
    "date": "12/4/2017",
    "text": "Ok tasting food that's made quickly. While it's farm to table it's odd to have a tomato soup menu option then say it's off the menu because tomatoes are out of season.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "711gsmiQOjOAHZP_0uJabw"
  },
  "QD8Tegj8JMnLaYXv-oA-2Q": {
    "date": "11/12/2016",
    "text": "We chose this restaurant based upon the reviews and we were not disappointed!  Our family was visiting Charlotte and had a group of 10 for lunch.  We were seated at the chef table and loved seeing all that was going on in the kitchen!   Pamela our server was FANTASTIC.... She answered numerous questions from our \"foodie\" group.  We got several sides to share as well as the wonderful heirloom tomato salad.  Members in our group got everything from the catfish sandwich to chicken to Farro Salad to beef flat iron.  All were excellent -fresh and flavorful.    As we were ordering I briefly mentioned to Pamela that we were celebrating the engagement of our \"children\" ( parents meeting grandparents etc...).  We briefly wondered why desert plates were placed at our table after our dishes were cleared .... I wondered if this was a way to \"push\" desert ( we all declared we were stuffed).  Moments later Pamela presented to the engaged couple \"THEDoughnut!   Oh My!   This was a huge doughnut- almost 12 inches wide ..filled with a chantilly cream ( or similar wonderful filling). She said it was compliments for our celebration.  The ten of us all enjoyed a piece and it was amazing.    I highly recommend \"Stoke\" don't let the fact it is located inside the Marriott Hotel deter you..... This place is not to be missed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7KdLQAhCwT_lq_FKHsbNww"
  },
  "TR_Cj9-DvSCEyfHOeus-Ow": {
    "date": "4/24/2017",
    "text": "I've been here three times now. After my first time I wanted to write a 5-star review simply based on the octopus, which was the best octopus I've ever had in my life. Cooked the wrong way, octopus comes out tough and chewy. This was the opposite of that: soft and butter-like. Like nothing I've ever had before.   Then I visited again a few weeks later and the octopus was mediocre. I sent it back. The waitress brought back another but it still wasn't great. I asked the waitress what happened. Apparently it depends on who is working in the kitchen. She told me the name of the \"good chef\" but I've forgotten it by now.  Long story short: get the octopus, but ask your waiter or waitress first to make sure the right person is working in the kitchen.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQJfkmaHQ_uD_3csyoTbig"
  },
  "C16xd5mZ3OBCD92hsOZ8Ng": {
    "date": "4/5/2017",
    "text": "Amazing service, great food. Just wow. Great creations that are surprisingly North Carolinian. Cheerwine butter? I mean heck yeah! Just great, highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "71s6_QLPRKkheowQ7Fwd0Q",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/71s6_QLPRKkheowQ7Fwd0Q/o.jpg"
      },
      {
        "img_id": "6VaCaUDRRV6tK18TX-WplA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6VaCaUDRRV6tK18TX-WplA/o.jpg"
      }
    ],
    "user_id": "jUEOdXv3LM8hD_5xzthsmA"
  },
  "nEuHQ4pcCFyfwZIElEugQg": {
    "date": "12/18/2016",
    "text": "We had a group of 8 at dinner on 12/17.  First, it is way over priced for what you get.  I am an avid foodie and have no problem paying for quality but I personally had a small piece of Sea Bass as my entree and it was $28.  My wife had a few shrimp, a few clams and some broth.  No sides, nothing.  We ordered sides. The sides which are pitched as \"family style\" are great if you have a family of one.  The service was mediocre.  Our waitress was not very good at cleaning up.  The only positive is the style and ambience.  That is great and the open kitchen concept is nice.  Now maybe comparing this to Dressler's, Del Frisco, Essex, Custom Shop, Good Food and other great Charlotte restaurants is where I went wrong.  It is not in any of those restaurants league.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZM89WuSOdh9zheUkGnUgKA"
  },
  "qPPQkNpOmnNpaygfz48W6w": {
    "date": "10/4/2016",
    "text": "Last weekend my husband and I wanted to get out in uptown Charlotte and spend some $ at restaurants and bars since they suffered recently due to the unrest. So, we went to Stoke for dinner and what a great spot it is. First of all, nice open spot right off of the Marriott lobby which was quite welcoming with high ceilings. We had made a reservation but there were some open tables at 7:30 when we went. The service was on point, especially since our server went to the kitchen and asked the chef how he prepared the octopus starter for us after we inquired. That was the most tender octopus we have had and we pretty much order it on every menu we see it on. A main reason to go is the wine by the glass/bottle sold at retail prices. We shared a bottle of French rose that set us back a whole $21.00. Awesome. Next...food. I selected the Carolina shrimp and clams in a gumbo broth. I could tell that broth took a while to make and it hit the spot. My husband ordered the Iron Skillet Mountain Trout and he essentially got a whole fish. Very generous portion. What got me in the door of this restaurant though was seeing that they had roasted carrots with carrot top pesto. Did NOT disappoint! Remember, pretty much everything is passed through that wood fired oven. It is called Stoke after all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5xKVnhfkpxe4oZ_74du9ow",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Argentinian rosè for 19 bucks a bottle.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5xKVnhfkpxe4oZ_74du9ow/o.jpg"
      }
    ],
    "user_id": "fXPwu_pvEAQHfY_G8eW4vg"
  },
  "DV_dUyX3XJObBN1vJRJdOA": {
    "date": "8/23/2016",
    "text": "I stumbled onto Stoke which just opened, and Charlotte should be stoked (sorry, I couldn't resist). This farm to table restaurant has a huge open kitchen where it seems like diners can watch the chefs from every single table.  My trout was spot on, but the real winner was the service.  My server, Tysha, was absolutely incredible.  She knew the food, knew the wines, and literally sold me on the place before I even knew what it was all about.  If Chef Chris Coleman's waitstaff continues to be this incredible, then all the Uptown chain steak houses are in for serious competition.  I wish this place the very best!!  I ordered the Sunburst Farms trout because, quite simply, I screw it up when trying to cook it at home.  Sunburst Farms trout is a Carolina treasure, and Sunburst isn't too far of a drive from Charlotte.  But, I'm not a good cook, so I always mess it up when trying to cook it.  The trout I had at Stoke was just perfect.  Perfect.  I didn't order sides, but the dish came with some pickled okra and onions which were the perfect compliment to the trout.  Perfect.  Wines:  Tysha explained that Stoke isn't marking up the wine prices.  For that reason, I ordered an entire bottle of Malbec for the same price Total Wine charges.  What other restaurant at a \"high-end hotel\" is going to do that?  And, the manager came around a few times to see how everything was.  Incredible experience all the way around, and I'll be back to try it with friends and family.    I hope Stoke stays.  Now, a little history:  the restaurant at the Marriott used to be Savannah Red.  It taught Charlotte about farm to table dining long before we all realized the health and importance of farm to table experiences.  And, the kudzu butter and Krispy Kreme desserts taught us the importance of taking Carolina \"stuff\" and turning it into gastronomic extravaganzas.  I loved the decor at Savannah Red because it was unique in a way similar to Patrick O'Connell's Inn at Little Washington.  But, Savannah Red closed.    Down the street at the Dunhill Hotel, Cassie Parsons from Grateful Growers farm was also teaching Charlotte about farm to table dining at her Harvest Moon restaurant.  But, Cassie closed Harvest Moon at the Dunhill, and Chef Chris Coleman turned it into The Asbury.  He put his spin on farm to fork dining, and The Asbury is where I always took out of town guests for brunch.    A few nights ago, I stopped by the Marriott to see if their crazy renovations were over (the Marriott  did away with one of the best hotel indoor pool/spas in Charlotte), and near the lobby was this huge, new restaurant called Stoke.  I was in the mood for Ethiopian, so I absolutely did not intend to dine at Stoke.  But, the huge, open, airy layout was intriguing.  The host and waitstaff sucked me in, and I'm thrilled to have tried it.  Kudos, and thanks for a great dining experience.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZTX0ThBnycMaR2mRwDPQaQ"
  },
  "CAQB-dLbCDWWMlkcfa1RZg": {
    "date": "12/24/2017",
    "text": "For the price we paid, it was very poor value. Went here for my wife's birthday on Christmas Eve. I appreciated that they let us move our reservation up from 7pm to 6pm.   However, my wife and I ordered the steak. For $40 a plate, we expected a fantastic cut. My wife ordered medium rare and it came over cooked. Mine was medium and it was acceptable but not fantastic. It was awkward having to send a dish back. Once both of us got what we ordered, it turned out to be a chewy and less than ideal cut.   The cheese board and charred octopus were good. The broccoli and sweet potato sides were ok.   No matter what the reviews say, next time I'll avoid the restaurant inside of a Marriott. 5Church down the street looked a lot more full and probably better.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "exV99cikoHWfKBx7EJgGQQ"
  },
  "IK_Mxhs1j6Vly0Ctw960Fw": {
    "date": "7/20/2018",
    "text": "The valet parking lost my friends keys to his vehicle because an attendant took his keys home on purpose. We waited over 90 minutes for the valet associate to return the key with no apology. The manager did nothing to alleviate the stress, anxiety and confusion. The food was decent which is the only reason for even one star. There are so many other choices in this area do not waste your time on this restaurant the customer service is terrible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GXSTsVp2rsMY-sA_jYcAbw"
  },
  "KQVw9jQhNjw-FgWzjlaM6A": {
    "date": "1/6/2019",
    "text": "Wow...one of the worst restaurant experiences I've ever had. Super excited to go here for brunch after reading the reviews. Yes, yes the ambience is good. The food was meh and the service was absolutely horrible. We saw our server once, when she took our order. We had to flag a manager down to get water. And he attempted to pour us a half a glass (what is that about!) and we had to ask for a full glass of water. I would've ordered another mimosa but if I can't even get water then I'm certainly not wasting my money on waiting forever for another drink. We had to flag the manager down again to get the check. Both times he had an excuse for the server, saying she got caught up at another table. Let me be clear, there were four tables in there. She had two of them, and the other one seemed to have the same issues. She brought us the check and apologized, saying she had to be in the kitchen as a chef. Being that the kitchen is an open concept, we could clearly see that there were three chefs and she hadn't been in there at all. What a horrible experience!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hzVP1jA2p7T2KjCqSJq7qA"
  },
  "6aAnwq_0cWI9Yed8Lez24A": {
    "date": "8/18/2017",
    "text": "Probably my least favorite restaurant in Charlotte. Usually food is too salty and inconsistent portion sizes. Generally great service, food is just meh",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hh0vNIx0PT_a4OkK8MxMRA"
  },
  "ZdKj9WRs97CSGvC-pNHIsg": {
    "date": "11/18/2017",
    "text": "Simply amazing.  We were initially hesitant because it's a hotel restaurant but don't let that stop you.  Everything from the cocktails to dessert was unbelievable.  We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eVWh6Wzt9R-DkFZ-xoj1xw"
  },
  "IwrIt1v9a3oCWioXeU2K-w": {
    "date": "12/26/2018",
    "text": "Went here for Christmas Night dinner. Not only was there a set menu that they didn't tell us about, but the food was horrible. Seems like a nice place with great staff but food was awful. The food was not edible. Worst meal I have ever had. A crappy set menu was 65$ a person! Unfortunately, it seemed like the waiter knew that the food was bad but couldn't do anything about it. 0/5 do not attend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qOUNN9mOeOCjylb9xpgz0A"
  },
  "FTfzy5No6JfCff1zi6nsTA": {
    "date": "6/26/2017",
    "text": "So I come here A LOT because my office is across the street and there is free wifi, the food is great... but most importantly the service is outstanding.  It's actually the reason I was compelled to stop everything I was doing and write this.  I came in today and ordered lunch and did some work at the bar.  My bartender and waiter's name is Juan, he was super friendly from the getgo... warm, welcoming, just chatty enough and did an incredible job checking in to make sure I was good.  But the best part was that I ordered a special and I guess it just wasn't my taste.  It was cooked perfectly but for some reason I just wasn't feeling it.  He noticed I didn't eat the main dish - he tried to get me something else, made recommendations, and was GENUINE.  I wasn't really all that hungry so I politely declined and without even asking had it comped.  When I went to pay my tab he said I already took care of it.  I hope you'll come back and let us try again with something else.  I mean, how often do you get care like that?  The food was phenomenal - just wasn't my preference for fish.  It had nothing to do with how it was cooked or anything.  It was 100% me and he was still so concerned and wanted to make sure my experience was great.  And it was.  It was great.  Thank you Juan!  For going above and beyond!  A stellar example of customer service.   I'll obviously be back.  PS - all of their salads are delicious.  Also the fried chicken - dang!  So good!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "QbFTdA-NXmK3PJxgK-DVdg"
  },
  "15cLStglosMUEzOTzasWrA": {
    "date": "11/9/2016",
    "text": "All I can say is YUM! We ordered the following for dinner & it was wonderful! Friendly and prompt service. Great atmosphere + modern decor. We'll definitely come back for more.   -  Iron Skillet Mountain Trout - I loved it!  - Wood Roasted Avocado Toast - My husband enjoyed this.  - BBQ Carrots - To our surprise, this was so flavorful. - Carolina Gold Rice Grits - Super creamy. I can just eat this alone and be happy ;) - THE Doughnut $18 (NOTE: This can honestly feed an entire village! My husband and I did our best & finished half)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cBqhK9qSCd56QbxKUFcAvA",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. THE Doughnut $18 - The doughnut hole is filled with a yummy creamy custard (NOTE: This can honestly feed an entire village!)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cBqhK9qSCd56QbxKUFcAvA/o.jpg"
      }
    ],
    "user_id": "jC3XHk3oxqayr0Ti5_B29Q"
  },
  "h28AXgQVDqKyX-vNUmHAfw": {
    "date": "5/28/2018",
    "text": "My husband and I were staying in the hotel attached to the restaurant. So we popped in for some dinner. The server was very knowledgeable about the menu and gave us a lot of details which helped us deciding on a main course. For the appetizer we had the pretzel brioche. It was to die for! The cheerwine butter was delicious. I had a fish with risotto. It was super fresh and tasty. They gave us a free dessert because we were newly weds! We had an awesome experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u1LTgEJmd8FZmDxxrgHwGw"
  },
  "aEmDbIJZ1Tl2Be0eeUjqjA": {
    "date": "2/10/2018",
    "text": "Made a reservation for 2 via Open Table.  Arrived promptly on time.  Front-of-house staff seemed confused but did find the reservation in their system.  We were taken to a communal table that seats 6. reminded our hostess that we booked for 2 and said, \"You're going to give us this entire table?\"  She replied, \"No, there will be others seated here too.\"  We left.  I checked Open Table and nowhere does it advise to expect communal seating at Stoke.  So, word to the wise: a reservation here is really one in name only and you could be seated anywhere -- with anyone!  Caveat Emptor.  Charlotte has too many good restaurants uptown to waste time with this sophomoric eatery.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JWTPTbly-l0KahFVBiGlYg"
  },
  "bCxH2Wo2ePAkj1benAENCA": {
    "date": "12/1/2018",
    "text": "Although the food was delicious, one of the people in our party got choked, and instead of showing compassion, she was asked to \"move it to the bathroom\" by the manager!! She was clearly choking and not some drunk girl getting sick.  Someone else in our party got her outside for air and she was ok, but the manager's reaction was disappointing to say the least.  When he was confronted about this, after our meal, he was minimally apologetic, and never once appeared genuinely concerned. He said he didn't realize she was choking, even though she had her hand on her throat (universal signal for choking). I said he and his staff should be given sensitivity training with an emphasis on recognizing a customer in distress.  Even though it was not the restaurant's fault, I think the manager should have comped her meal or given a card for free dessert or something.  A gesture like that would go a long way in acknowledging the value of their customers.  Good customer service is the only thing that brings people in your establishment as there are plenty of other restaurants within a few steps of Stoke. As it is, the most memorable part of our evening was the nonchalant reaction to what could have been a life threatening event.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mcTy3U99u-VlCcYO75aqng"
  },
  "b5qRfYffVByy9IiM5bKuCw": {
    "date": "4/8/2017",
    "text": "Well whaddya' know. Another farm-to-fork venue. Gettin' to where if you open a restaurant in Charlotte, it BETTER source locally, or else you've got no leg to stand on. That being said, the challenge of making THAT original and new is sometimes a struggle. Stoke Charlotte gives a decent try. The ambiance is totally contemporary, but somehow cozy at the same time. Lots of attention to detail, all the way down to our NC sourced tableware! Huge vaulted ceilings make a challenge for any decorator, but they managed to make it beautiful and warm. Definitely on the VERY LOUD side though. Gorgeous marble is everywhere, but sound has a field day in all that open space. Probably not a first-date-restaurant. Unless you prefer yelling at your table mate.   The food was amazing. We started with a cheese plate, and some meat jelly. Oh wait, I meant Bone Marrow. Very nice. Marrow was cooked perfectly, with sharp stabs of ginger and sweetness. For entrees, we had the Duck Ragu, Lamb Shoulder, and Prime Rib. Server tried to warn us that people share, but we got greedy, and wanted to taste too many things. All were melt in your mouth tasty. The ragu, a flavor explosion. The lamb was a fork tender mouth-gasm, and the steak? Well...I always used to say, I can cook the hell out of a steak on my own, why buy it at twice the cost at a restaurant? But this piece of MEAT did the magic last night. Cooked to exact temp (of course), the chef let the flavor of this meat take center stage wisely. Nicely done.   Our sides were also amazing. Although grits that aren't grits, may piss off your average True Southern foodie. That side should be thoroughly explained to the table when ordered (not everyone will know, or love a 63 egg like I do). That's the only food 'complaint' I have. And I can't truly complain, because I loved 'em! The flavor was subtle, but loverly. The rice/(grits) cooked to creaminess, but not sludgy. The fingerling potatoes came out like big fat wanna'-eat-em-with-my-fingers French fries. Super crispy and salty on the outside. Smushy and hot on the inside.   Alas, we only had room for one dessert, and it has to be the smaller one. The Strawberry Shortcake was pretty spectacular. Once again, the main, fresh, locally sourced strawberries were wisely allowed to be the focus. We'll definitely have to go back to try the mega donut cake specialty though! They even had spectacular coffee!  All-in-all it was a pleasant experience. Only got the 4 stars because there were a couple of front-of-the-house glitches. They did pretty well with our SUPER picky expectations. Couple of erroneous food drops, server forgot to ask the entire table if they wanted bevs (rookie mistake, overall he was wonderful), and if you're gonna' pretend like you're that kind of restaurant, (complete with pretty people and a snotty hostess - which I will always grade lower for as snotty is so unnecessary!), you should know who's food is who's when serving. Not \"selling\" entrees are only a food-snob's standards though. So not a huge thang.   Well done Stokes!! Will definitely have to try again soon!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "L4PfS8-gdGyAn7S3F-sJrw"
  },
  "WPF8jVv_Pwdqs4hyGTOZDw": {
    "date": "10/23/2017",
    "text": "I went here with my sister and her future sister - in - law. My sister made reservations at 7 but we arrived at 6:45 and was sat right away. They also have free valet parking if dining at Stoke (located inside the Marriott hotel).The hostess made sure to ask if we were okay with a booth; which we all said yes too, the only strange part was she motioned me to go ahead of her. I was aimlessly walking because how am I supposed to know which table you are seating me? The interior was modern rustic. The made sure to incorporate wood pieces but still made it modern in style. The plates were a combination of ceramic plates and wooden boards. It is a lot bigger than it seems to be \"just inside a hotel.\" The attire is casual but many did dress a little nicer. We sat down and were quickly greeted by our waitress Molly. The menu is a little on the small side (fits on one big paper) but the flavors are definitely all there! All of us decided to share so we could try everything since we have never been here before and also to share the cost. From the Share: - Pretzel Brioche: Came with three different butters; I believe the first one had garlic and whole grain beads inside (my favorite of the three). Next, they had a cheerwine butter; you are in the south after all. Lastly, was a honey butter and just as most are; sweet but not too much. Usually pretzel breads/rolls are a little harder but this was so soft and the little bit of saltiness from the pretzel was great. - Mom's Deviled Eggs: Love that they chopped the bread and butter pickles to put on top instead of putting one big piece of it like I have seen other restaurants do. In order for them to lay flat on the plate they have to cut the bottom, this makes it a little thinner so be careful. - Pork Belly: Absolutely delicious. I was worried the watermelon molasses was going to be too sweet but it was just right, not sticky and gross. I would rather not share this item because of the portion size. The bottom was charred and it gave the dish a great crunch and smoky flavor to each bite. - Winter Roots: Plated beautifully and when added to our entrees, went well. It was also a nice palette cleanser if ate alone. Included beets, radishes, caraway, and buttermilk. From the Entree: - Scallops: They had five on the plate but they were not small. The were cooked perfectly. They were placed on top of a ham hock consomme; which was at the right level, not overflowing but enough to taste. - Sticky Pork Shank: We asked what the menu favorite was and this was what was recommended. This did not let us down. Definitely my favorite dish of the night. The meat fell off the bone, was not dry, and the sauce was there but not even needed (but who doesn't love sauces). From the Companions:  - Esquites: This corn salad was delicious but definitely a sharing side dish. - Crispy fingerlings: These potatoes were cooked to have a slight crunch, that usually you don't get, and it was paired with a creamy aioli. My only suggestion - have the aioli come on the side and not the bottom below several fingerlings. - Green Beans: Had a little spice to them, a nice crunch from the pistachios, and the apples added a crunch but a sweet acidity as well. - Broccoli: I personally did not eat this because I do not like broccoli that much but the other two did. They agreed there was a spice to it which is unexpected but it was tasty overall.  From the Dessert Menu: (This is a completely separate menu that you have to ask for) - Apple Pie: We also got a scoop of vanilla ice cream to accompany the pie. It was served warm and came out in a mini cast iron skillet. The crust was too hard and not flaky (we could barely cut it) but the filling was the best part! They topped it with oats instead of a dutch crumble and I personally like the added crunch this gave to the dessert. From the Cocktails: - Espresso Martini: I love coffee/espresso and when you mix it with Kahlua, even better. The glass was unexpectedly small but it tasted great and I hope the pour count was accurate! Overall a great first time experience, will definitely be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "trcrWmsAGoK2-f6Teq0B2Q",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Winter Roots",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/trcrWmsAGoK2-f6Teq0B2Q/o.jpg"
      },
      {
        "img_id": "x5m__tg5yRT0QHvyllQgZw",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Broccoli at the top. Pork Shank in the middle (favorite, fall off the bone, so good!) Esquites on the bottom.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x5m__tg5yRT0QHvyllQgZw/o.jpg"
      },
      {
        "img_id": "gG_NarWBPnVeHpfwoyRiGg",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. They looked amazing when they came out so we dug in and forgot to take the photo before hand. This is worth ordering!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gG_NarWBPnVeHpfwoyRiGg/o.jpg"
      }
    ],
    "user_id": "9uooUPcUA-R6M2_BA6HrmQ"
  },
  "iZ5Te1SfTnYuQW1ssEC5Ug": {
    "date": "8/13/2017",
    "text": "Awesome brunch! I got the deep fried stuffed French toast and it was so good! A bit pricey for the amount of food you get, but worth it. Also love the decor! It's inside the Marriott hotel and they'll validate your parking if you get valet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CBo5rt3BI9BQoNj0DVbg3g",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CBo5rt3BI9BQoNj0DVbg3g/o.jpg"
      },
      {
        "img_id": "2xq3Z548u5aMonhiGJL96Q",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States. Deep fried stuffed French toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2xq3Z548u5aMonhiGJL96Q/o.jpg"
      }
    ],
    "user_id": "8oi2XpkF7OzdlzfTOhrzfg"
  },
  "84mcBPBZQI98S-mb3uZtHg": {
    "date": "2/16/2018",
    "text": "Solid service, food, drinks, decor and dessert. Sit towards the kitchen for a good experience. Definitely get the donut - take home what you don't eat there! Will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M_wjPLcIY2LcCLMLLwT7Og"
  },
  "6fgOt1c08LAck_XicbkYzg": {
    "date": "9/12/2018",
    "text": "Our family of four had tickets to go see The Lion King at the Belk Theatre and we wanted to grab a quick yummy dinner close by. My husband suggested Stoke because he had eaten lunch there and enjoyed it so we made reservations. When we were seated at our table in front of the open kitchen, our server Destiny introduced herself and let us know what the specials were. As we perused the menu, we decided to get a number of small plates, appetizers and sides instead of four large dinners. We were happy we did! The hush puppies were crunchy on the outside, soft and tasty on the inside very delicious! The pork belly was very tasty along with the octopus and shishito peppers. I'm so glad we ordered the pretzel brioche with the honey butters, it was quite sizable and delicious. To top it all off, we ordered the donut with whip cream, which was as big as my head! That donut was absolutely delicious and the cream I wish I had more of that because it was so good! Food and service were great and we will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ow07iTOW_JUer07MWNhazg"
  },
  "kydI76xQsv0XCq0jwLL9yA": {
    "date": "4/5/2018",
    "text": "I'm not a frequent yelp reviewer. However I felt the need to make note of the exceptional experience we had at Stoke tonight. My wife and I chose this spot to celebrate our 10th anniversary and we were not disappointed. We were greeted by a hostess that seated us promptly. Our server Hannah began what would be an evening of constant satisfaction. She was extremely knowledgeable of the drink menu as well as the food menu. She made recommendations that fit our tastes perfectly. The food was prepared perfectly. Our dinner experience was exactly what my wife and I hoped for on such a special night for us. Please don't be turned away because their location is inside the Marriott. The ingredients are all locally sourced, prepared impeccably, and the service is above and beyond. Please stop in and give this spot a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_KMk_IQUSF2oBM1Z-h9leg"
  },
  "1cWf0bhRdzWlX3W7yVdCSw": {
    "date": "2/21/2017",
    "text": "I found this place on Yelp while visiting downtown Charlotte and figured I'd give it a shot for a quick lunch. I had no idea it was in a hotel! It's a cute restaurant with a comfortable, modern atmosphere. However, on a Saturday afternoon I expected there to be more than ONE person working. Our server was also running the bar, and while he was super nice.. he couldn't help but be a bit slow since he had zero help.   The menu is very, very limited.. and a bit pricey (but I'd expect that at a hotel restaurant.) My boyfriend and I each ordered burgers and a soda.. and our bill with tip was over $40. However, the food was fantastic. I love the farm to table concept - everything was fresh and tasty.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rvgh4wSDqSSN1XyCGL4a7g"
  },
  "ibsnnDAnJqb3vrLtBYwPRw": {
    "date": "5/9/2017",
    "text": "We decided to drop into Stoke in search of a good bourbon cocktail. They didn't disappoint! Placed in the lobby of a Marriott its still a great vibe. The bar itself is beautiful, copper and white counter tops. We were promptly greeted at the bar, and happy to find the bartender was clearly top notch. We watched him make a few for other people and ordered two old fashioneds. I stuck with the original recipe, which had a bit of bite from the Elijah Craig. My boyfriend substituted it for Michters and it was nice and smooth. All around a good experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PDwBN2Yjh2P4qgbgM6Jqtg"
  },
  "GPkVbHXTZ36ZPOavOAAF7w": {
    "date": "2/15/2018",
    "text": "I was really excited to try this out because of all the hype surrounding it. Limited menu was good but not too many options. Prices were high but comparable to uptown... there are better options out there but a great spot for cocktails and appetizers before a night out if you are uptown.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2TkoBo1qmLg_MXKPOYX_4A"
  },
  "ynhlgUrZl26442DktgvfKQ": {
    "date": "5/5/2017",
    "text": "This is for the bar area only - extremely cool vibe for the location and nice signature cocktails.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XivuRnPq3D-K5cPiBTztIA"
  },
  "9OmX1wnZd4kjrKW5SNMQcQ": {
    "date": "2/4/2018",
    "text": "This was a very good restaurant and very good experience. The drink menu had a wide variety of hand crafted cocktails, beer and wines to choose from. Both hand crafted cocktails I had were excellent. The bartender was very nice and personable as well. When we got to our table we ordered deviled eggs and were very happy with those. The cobia was delicious and the side of broccoli was seriously amazing. The best broccoli I've ever had. It had a hollandaise and fish egg topping which sounds undesirable but it was amazing. The dessert wasn't as exciting as the dinner. A pound cake with banana and peanut butter. I tasted more like a peanut butter and banana sandwich than how it was explained to be. Overall, I give four stars instead of five because of the dessert. I will definitely go back and try the shank which looked really good too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZKY61t2Yyvr5AToCAGQUA"
  },
  "gdPLueI03yoIG_jKILS7uQ": {
    "date": "12/14/2016",
    "text": "This place is a must try! They are absolutely amazing! We tried the lamb, trout special and pork. We also tried the deviled eggs, butternut squash and donuts. Everything was 100% perfection. The service was perfect. Very kind staff. They do valet parking so even though they are uptown there is no trouble to come and enjoy. The ambiance was very nice, with an open kitchen. They are great for a party or celebrating a special occasion. Perfect for a small or large groups but seating is limited so if you are bringing a large party, I would make a reservation first. I can not wait to come back. My favorite was the lamb, it was cooked perfectly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Nuft8UPfWRkPj85zjI7pzQ",
        "caption": "Photo of Stoke Charlotte - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Nuft8UPfWRkPj85zjI7pzQ/o.jpg"
      }
    ],
    "user_id": "ZpwPC2Dpj3OsN0JsFFwmdQ"
  },
  "eggh_E9s5Us4dT-tdBd8bg": {
    "date": "12/14/2016",
    "text": "The servers were great. The food was delicious I can't wait to go again. I had the flank steak that was just wonderful. Very flavorful and cooked to perfection. They serve family style sides so no sides come with your meal. So I ordered the side of Carolina grits and that paired well with it.   My friend had the lamb and that was excellent. Again very flavorful and cooked to perfection. We were beyond pleased with our selections.   I don't want to spoil it for you with details because I want you to be as surprised as I was but you MUST have the donut for dessert.  This place is amazing. The went last night and I'm going again today!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "V6jkXtJsElbzpm9iq1Yw5A"
  },
  "dIFFMYeyr8K9bZPkx-n62g": {
    "date": "12/28/2016",
    "text": "STOKE is a refreshing modern take on the open kitchen concept. Our server, Tony, was warm, welcoming and offered fantastic recommendations. My favorites where 5he smoked octopus appetizer, the beets (ordered as a side), and the lamb shoulder. Come hungry and try EVERYTHING. Leave room for the 1lb donut dessert...it's under real (and perfect to split amongst 5 people).",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-srZqmR83vjSfR6PSUyVUA"
  }
}