{
  "B6Xk4U-QykqzjqvSnkTVRQ": {
    "date": "10/28/2009",
    "text": "Fast and free wireless, plenty of electricity everywhere, I like Bruegger's. You do have to arrive early for the best seats. The place is pretty popular for the \"out-of-the-office\" types, sitting with their laptops at tables for hours at a time.  The only two things that I would say are negatives is that the place tends to get very loud with a lot of background noise from neighboring tables. And the coffee refills aren't free.  Great bagel flavors, including several that they don't have at Panera. I like the Pumpernickel and the Jalapeno. Both are excellent. These are \"real\" bagels, unlike the stuff you might pick up a supermarket. They're made the right way, even if they aren't as good as New York. (Ha ha.)  They have a \"deal\" for a bottomless coffee mug. Only $129 for the year. So if you stop by Bruegger's often enough (at least twice a week), it might work out for you. I was hoping for something way cheaper!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "kW_mlgXKcoaPXoEq6A_7Ig": {
    "date": "8/4/2010",
    "text": "Great combo of Bruegger's and Caribou...one stop shop. Free wifi and lots of business going on inside. I think I was one of the few without a laptop that day.  The employees are friendly! This is a great Bruegger's location and you don't have to feel guilty taking a long lunch break here because you can easily bring work here. They also offer a conference room to book for those out-of-the-office-private-meetings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Reuq65EOFI938Yg8xgff9g"
  },
  "N20KvsTIeZO7GQ0Se_4HaQ": {
    "date": "1/3/2012",
    "text": "I like Bruegger's but it's your basic bagel shop with all of the usual choices.  That it's attached to Caribou makes it convenient otherwise I wouldn't look for it specifically.  I like the free wi-fi.  I will say that both Bruegger's & Caribou need to work on their cleanliness.  Most times I'm in there it's a step away from disturbingly messy, dirty, sticky and the bathroom (shared w/caribou is atrocious).  I'm also wondering what is up with the big square they cut out of the wall over a year ago that is still there.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "a_QrvzAKumcSSnLLrcnlYQ": {
    "date": "3/17/2015",
    "text": "My teenage son likes to eat here before school. He always orders a breakfast wrap and the OJ. The food quality is good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VA4GOxU-RmRkqnNDTlrpgQ"
  },
  "QRxY28WR092HRAEtZEfD8Q": {
    "date": "10/26/2012",
    "text": "Love coming here, fresh food, pretty quick to order and relaxing atmosphere - plus it shares the same space as Carabou!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EdbijWyB7_6DV27BiTkaSw",
        "caption": "Photo of Bruegger's Bagels - Charlotte, NC, United States. Soup, sandwich and a drink for $6.99 - delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EdbijWyB7_6DV27BiTkaSw/o.jpg"
      }
    ],
    "user_id": "4rE2OpB4hV5lxSHigwrKHQ"
  },
  "fzYcm5Hr2nY-NXD6BmT7-g": {
    "date": "6/13/2016",
    "text": "For a bagel place that isn't in New York, it's not bad. It's definitely one of the better bagels I've had south of the Mason Dixon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WlEQVDhG_vdOK1DYecxGxA"
  },
  "q2Z8fVsJUoOrr7-ataF_pw": {
    "date": "9/25/2014",
    "text": "Get the pastrami, swiss, and egg on pumpernickel. It is amazing and service is quick. Being from out of town this is so much better than Starbucks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JyLpiDhATPS64U8F9Ttd8g"
  },
  "TkTnlIrxMWdYK02ne8Ssjg": {
    "date": "8/13/2011",
    "text": "Did I just pay $8 for a bagel thin sandwich and an unsweetened iced tea?  Why yes, I did, and I'm going to enjoy it's toasty goodness in moderation.    The service here is spot-on.  Super fast, friendly and the order is always made just the way you like it.  I enjoy the rosemary bagel (made into a \"thin\" where the center is cut out.  BTW: I wonder where the insides go...am I allowed to take it home?  I will ask next time.) with light veggie cream cheese, smoked salmon, extra red onion, extra tomato, no capers. The bagels are nice and crisp on the outside and chewy on the inside. Mmmm carb heaven.   A BIG plus is the free Wi-Fi and the access to seating/outlets.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7M-rWYRGPfCDnb7tjl7QGQ"
  },
  "3Ip7nsO0UjQtWkNli1GXAg": {
    "date": "10/8/2014",
    "text": "Three strikes and you're out.  Nine strikes and the inning's over.  This location's problems are mostly of its own making but the intense foot traffic only exacerbates them.  The bagels are usually acceptable but, compared to other locations, occasionally skimpy and/or undercooked.  Unfortunately, staff turnover at this store seems to be a way of life and through circumstance or choice they are shorthanded by at least one counter person every visit.  The predictable result is long waits.  Placing the coffee urns behind the counter means yet more delays as staff must do the pouring.  They've got plenty of room at the coffee/tea station and it's well past time to move the coffee urns out there even if it means hauling them back to make fresh coffee occasionally, just as Panera et al must do.  This store really is the devil's candy - great location, expansive seating area, outdoor tables - but the slowness of service invariably causes one to ask 'Why bother?' especially when other Bruegger's locations without these problems are nearby.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J32RPJT2j-H9ISH9AnHchw"
  },
  "tED3e6YSxNCs2jxOGHRWuA": {
    "date": "2/7/2016",
    "text": "The worst service and most unprofessional staff I have ever seen. I wish they would put another bagel place here where the staff actually enjoys their customers and their jobs. I would've given negative stars if possible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZDJsno6GMW_Xwy5BThHrjw"
  },
  "c2mzNZappWQSJ_6L0yBa1Q": {
    "date": "9/11/2012",
    "text": "Excellent bagels, nice and chewy with a crispy outside... even better when hot. I like that they have a lot of flavor options and rotate offerings... recently had a pretzel bagel that was pretty tasty. Lots of cream cheese options, the breakfast sandwiches are pretty decent as well and not greasy like typical fast food places. They offer the option of skinny bagels which I love... regular bagel is just too much, skinny bagel perfect!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAxtOfFyhgvyHwK3gkBUrg"
  },
  "Z34hkEnwX4QhfuQttey_WA": {
    "date": "6/29/2014",
    "text": "Unfortunately this is my last time going to this location. They are consistently very very slow with high turnover and brand new employees every week. Not enough people working either and the line was to the door at 9:15 am. Management must be poor to continue to allow this all of the time. There is always one poor employee who is fast and efficient who has to cover for the rest who are super slow. But that doesn't work too well...which causes long lines. Too bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VVqUDoIgftIay5ggfVmRUw"
  },
  "o_dwUbQTBN7gCaCKCR0Sag": {
    "date": "5/6/2012",
    "text": "Great food great people great everything overall... only thing i would say that is negative is the line is extremely long very fast...i come early just to avoid it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "InBIEqapQwtm2u3mq1TQUg"
  },
  "T-GGwc2q-gNJSgZtt7bFsA": {
    "date": "3/14/2018",
    "text": "Just went this afternoon to Bruegger's instead of Which Wich because I was already in Park Road Shopping Center.  Mistake.  I was the 2nd person in line.  The guy who started to make my bagel didn't hear me the first few times I told him what I wanted (Sriracha Blues sandwich on a bagel) and kept looking back at the board to see the ingredients.  The other employee kept coming over to help him and at one point raised her voice almost to the point of yelling to show where ingredients were.  I waited between 10 and 15 minutes (by which point 8 people were in line now).  The female employee couldn't find anyone's order on the computer and attempted to hand me someone else's order.  She ended up handing the bag over instead of putting the bagel in it.  I was on the sidewalk when I opened it up and realized they gave me the sriracha egg bagel (breakfast item).  I don't eat bacon which was one problem, but if I'd had a more pleasant experience, it wouldn't have bothered me that much.  The sandwich itself was good, just not what I ordered.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MmWUHzpkVT7ZPpbnHDNNvw"
  },
  "qsE7D9ZCwwom3qXgHE05PA": {
    "date": "3/15/2016",
    "text": "I went yesterday and got the lox bagel, came with capers and red onions and of course cream cheese. It was good, I was made together and it wasn't messy. The service was fast and the prices were decent. Was contemplating about going back today",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nDz9yR9IsPa7YpKeqJXRaQ"
  },
  "dW7qw3EPuxkp9wGAFtXqYw": {
    "date": "2/6/2015",
    "text": "Never fails to disappoint ... I wish they would open an Einstein bagels im officially done with this place .....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oH49SAI_ii_qH3UYnDZHMw",
        "caption": "Photo of Bruegger's Bagels - Charlotte, NC, United States. Some cream cheese would be nice....",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oH49SAI_ii_qH3UYnDZHMw/o.jpg"
      }
    ],
    "user_id": "rckjLcYiZNr0agDMXPZrcA"
  },
  "Bb3pNZw6Evysrmx4HSbPSw": {
    "date": "7/3/2017",
    "text": "This place is awful. The bagels are down right throw-upable. Hard as a rock and nasty tasting. It's no wonder why this place only has a 92 health code. I don't generally go to places that have below a 95 but I needed something.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dY0D1iiXudSGM_Vn6oiOfQ"
  },
  "tMoCojmN6ezwY159-tuf-g": {
    "date": "11/29/2015",
    "text": "Every time I come here I am disappointed. Today I was the only customer in the store and the guy behind the counter said he could not handle food and the only employee out of three working at the time was in the safe and would be a few minutes. I walked out because I was not in a mood to wait for what probably would have been lackluster anyway. They never toast the bagels to my desired degree of darkness, despite any description I can imagine, like \"stop before it catches fire\". I only went back today because it was really early and they're close to where I live and none of the other cafes were open yet.  Also, they sell day old bagels at a discount which is nice but the packages don't state what kind they are, so you just have to guess.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i2rSZVnBtuv70OD4sbOtUg"
  },
  "C8D5BckrscREOxboqBSO1g": {
    "date": "4/21/2013",
    "text": "I haven't been to Bruegger's in years, but was in Park Road Shopping Center & was hungry, and I will not do Subway. So, Mom & I decided to venture in, even though the construction was a little confusing. We ordered a few bagel sandwiches & I will say I was rather impressed. The bagels were fresh & they make sandwiches to order even though there are any great selections. Although we enjoyed the meal, the service was a little dis-organized and there were issues at check-out b/c they didn't have an organized plan for each customer. With that said, everything was ok & if I am in the shopping center that would be my meal f choice...plus, it might be one of the only Caribou Coffee's, my favorite, remaining open.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "wF3X_HwyWkca7S3HR63WUA": {
    "date": "4/22/2017",
    "text": "Very unfriendly staff and very dirty. Waiting at the counter and several of the staff walked up and looked at us but said nothing, most just standing around. Several minutes before anyone came over to help. The facility and the bathrooms were very dirty - which is funny because several of the ones who didn't help were \"cleaning\"",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oeWAN1NCA8IhRhfRlg9NMw"
  },
  "SJGGKYlYW-T1-nA2I3lORA": {
    "date": "10/10/2015",
    "text": "I am very disappointed.  This place has gone downhill.  I understand that taking the roast beef away was corporate decision, but to replace it with frozen hamburger patties???  This location is slack... I was there for well over an hour and they were not busy and no one wiped up the tea area where the napkins are.  I know someone saw it b/c I waited to be rung up while they filled the napkins when I first came in. The trash is overflowing... Don't think I'll be coming back any time soon.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t9wA4FKkE0f9N8DBieR5EA"
  },
  "gKhzQAE8glo_W-Ma0WKv3w": {
    "date": "9/17/2016",
    "text": "Not sure how this place stays in business. There is always a line and the service is slow slow slow. Guess it only stays open because it is in the shopping center.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M5UNhp6oSzgsfdI-CXYJEw"
  },
  "fic4EqkU-5Htx-wJunF7dA": {
    "date": "5/22/2013",
    "text": "I'm a huge fan mainly do to the convenience. It  has a great location and I can usually find a place to sit without any issues. Because its in park rd shopping center there's always a place to park. (Issues I have at many of the other coffee shops)  The wi-fi is hit or miss. I don't think they have enough band width for a place where people come to use the wi-fi. Their other locations work better but I still tend to choose this because of the other conveniences.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oHdCkOf9gHSMhvJd4JbVrA"
  },
  "Kssk-immsYXL0VgcbFKUOA": {
    "date": "4/23/2017",
    "text": "Ordered a smoked salmon bagel & it was truly horrid to say the least. The bagel was rubbery, cream cheese was not spread more like random clumps of it around the bagel. I couldn't even taste the salmon. It was a cold, rubbery unpleasant mess. Pretty upset considering my $7 bagel had to be thrown out. Will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cp783Zt1FV8sZXvrvrvL4w"
  },
  "-TiK0o8uI1_l8x9S5qPoVA": {
    "date": "1/20/2015",
    "text": "I stop at Brueggers at least three times a week for coffee in the morning and in the afternoon. The staff are friendly and coffee & bagels are wonderful. I do their bottomless mug (it's a great deal if you drink coffee/tea/soda the deal comes out in December.).   Herby Turkey is one of my favorite sandwiches. I like it without onions. And an Asiago bagel toasted with light veggie cream cheese is my go to for breakfast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ncSUgmfdpxowEb3J2f1L5A"
  },
  "mLo94WgX9lSCLsZutTgmBA": {
    "date": "10/9/2015",
    "text": "Love this spot! Consistently delicious bagels (get anything with their bacon) and quick service. Their coffee is decent - but I'd recommend visiting the Caribou that shares this storefront if you have the time.  Plenty of booths and free wifi. Great place to meet and catch up with friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "18_xSvye3_8oTjT5Ue-ozw"
  },
  "QaiDLxGxvkB8Kjzy-ZPMjw": {
    "date": "12/3/2016",
    "text": "Went in today at 7:50 (they open at 6am!!) and they told me they weren't open yet because they got a \"late start\". I wish I could say that to my patients at work if I decided to sleep in and show up to work late!! Totally unprofessional, won't be going back again, if you don't have to do your job why should you have business?",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9SPTOcglGqODq5wbSULW6Q"
  },
  "YOvDQjL7vhZBVlOavY_YKA": {
    "date": "11/8/2014",
    "text": "Delicious hot bagels!  Absolutely packed, so there was quite a wait time, but I liked the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0EU_7qsQaZ0adeotUHdPVA"
  },
  "ptfjd7VV8y1tpvtPqeGSrA": {
    "date": "10/7/2015",
    "text": "Food was great and the location was perfect in Dilworth Uptown. We ordered a Egg & Cheese bagel here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vdecnpSEbOI3xYL444pU3w"
  },
  "skieQ7_rYr7m_LQJQy1Evg": {
    "date": "5/23/2011",
    "text": "The best thing about this location is that it shares a space with Caribou coffee.  Sure Bruegger's sells coffee but it's not what I go there for and why get their coffee when your favorite coffee is just 5 steps away?  Anyway, the thing people come here for is the bagels in several flavors for everyone's taste and they make your sandwiches to order.  My favorite sandwich is the salmon.  It has salmon, cream cheese, tomatoes, onions and capers on the bagel of your choice.  The place does get busy so you may want to allow some time.    I always get my bagels to go so I've never actually eaten in the restaurant but being it shares half the space with Caribou I would assume it fills up fast.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "jSpwSoHzUcwg89DQOqQiSw": {
    "date": "4/6/2013",
    "text": "I love Brueggers, this location is quite gat, you can get your bagel and coffee at the same place and come here to study, remind or catch up with friends! This location is attached to caribou coffee. I personally think that Brueggers is better than Einstein bagels. Einstein bagels reminds me of more McDonald type breakfast and Brueggers is fresher better ingredients, not to mention a million type of bagel selections!! This place is only open for breakfast and lunch. I've gotten the smoked salmon bagel for lunch and it comes with my choice of veggies, all fresh and crunchy! I usually get the sun dried tomato with egg white bagel for breakfast. I also tried the spinach and egg bagel, also very good! I love how great my bagel taste after it's toasted! Yes, I am indeed a fan!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8zpZLEWweD0Tp6wLTzlZsQ"
  },
  "YO8uljGs_Viq-YDwaAiDow": {
    "date": "5/2/2011",
    "text": "Free WIFI. Coffee and Bagels all in one stop. Plus there are plenty of electrical outlets to plug into.  I usually get the Bagel thin sandwich with turkey sausage, egg white, and sun-dried tomato spread. It's a great lunch item thats around 400 calories and you can choose whichever bagel you want, all for $4. I would like to see more variety for the bagel sandwiches on the healthy items menu though. Overall, its a good place and atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5aS6VqUBeGSFv1rqYa_1rg",
        "caption": "Photo of Bruegger's Bagels - Charlotte, NC, United States. Skinny zesty egg white on a jalapeño cheddar bagel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5aS6VqUBeGSFv1rqYa_1rg/o.jpg"
      }
    ],
    "user_id": "1Jt6cO-XTIcHDIAyVHiwbw"
  },
  "ewjhOeM0diWJXl0MGqlzKg": {
    "date": "5/6/2015",
    "text": "I guess if you walk in and order one lunch, this place is alright.  But if you want to fax in a to-go order for your office- forget it!  They can't seem to keep an operational fax, they have no online ordering and they will tell you how busy they are when you call, so you end up feeling guilty about trying to spend money in their establishment...  All this drama for a sandwich??  I think not.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2l8rUzap_-dy3lVgYshOSA"
  },
  "SIFAigd65G9xUNKnaEYtZw": {
    "date": "4/6/2019",
    "text": "Bruegger's Bagels is one of the best places to get a bagel. I went there all the time as a kid then never saw them again thinking they all closed. Then I came to the Park Road Shopping Center and saw there was one and was immediately thrown back to my childhood. Their bagels always taste amazing and I love that you can see straight into the kitchen through a glass wall. The only thing they leave up to your imagination is what you want in your bagel. Everything is made to order and fresh when you order it. Highly recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ttmv_T2Zy8YwGpAsSvlDfw"
  },
  "kNTwjGMpRWBWyexFSDPkrA": {
    "date": "1/21/2018",
    "text": "You can't go wrong with Bruegger's.  This location is very crowded so there is normally a wait.  The bagels are always fresh and delicious.  I love that Bruegger's publishes their nutritional information and offers low calorie options.  My favorite is the everything bagel with reduced fat cream cheese.   Another delicious option is the western.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "kRMdKXxZQ7dxz-NUeKJqAg": {
    "date": "7/24/2019",
    "text": "Great place to grab a quick bite before work! Great bagels and sandwiches. I love that they can make \"skinny\" sandwiches and how many types of bagels they had",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A_C0M5dfmHNj0p9aEdqAAg"
  },
  "IKsQwAFFcL2ew2gr285c1A": {
    "date": "12/22/2018",
    "text": "Young staff here - seemingly near a comatose state of semi-awareness. Walker, cashier, totally rude young one. Jake, mostly capable. He managed to salvage an otherwise odd and uncomfortable customer experience. First server/order taker claimed egg whites could not be prepared, second (Jake) contradicted this by actually preparing my order. Very confusing, aggravating and not a pleasant visit. Bagels just aren't that important to endure such minimal skills from young ones!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uns_pFkWCCt-MVdtvGEfg"
  },
  "dJIDy731CfVHj-2k7BbTGA": {
    "date": "1/25/2018",
    "text": "Confused on how to word this review as I had a bad experience but my friends have had many positive experiences with Bruegger's. I went on a Saturday around 11am.   The food- I ordered the siracha blues bagel guy and I was very excited. Sadly the person who made mine was very flustered and didn't put any of the ingredients on the bagel other than chicken and cheese. There was no siracha or blue cheese or lettuce or anything. So my bagel was dry and boring. The chicken was also very cartilage-y.   The line process is confusing and unorganized as each worker makes a bagel from start to finish and there was about 6 of them. Usually at places with assembly line food ordering 2-3 people help build one bagel so it's an assembly line process and you move down the line and you're use to it. Here they were shouting at people in line to move forward but people were so confused because it appeared as though they had to cut people to order their bagel.  My friends have had amazing bagels here and compared the environment and style to Tim Hortons of Canada! I plan to give it another go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9eiqEQzRrhPjvMDoGRq20Q"
  },
  "vrdtJe1ohUPQhK6D3EB6yw": {
    "date": "1/27/2019",
    "text": "I come here often. Yesterday I got the Supernova and it was FANTASTIC, came back and got it again today to be disappointed. Not nearly enough salmon :/ it really just depends on who makes it I guess !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QuxrP87tAXRKbsJA5I1CGg"
  },
  "_gXKSJdVeOpCHcEv1girrg": {
    "date": "6/25/2018",
    "text": "Time to rant. I go to this Bruegger's location often since I work in the area. I go for lunch though, since I am not a bagel person. Their sandwich's are actually pretty good.   Two things that bother me here. When I tell the person making my sandwich what I want, why do they have to use those red or black grease pencils to write on the very paper they make my sandwich on. They write on the paper then lay the bread down almost on top of the writing. And then that gooky grease pen stuff gets on your bread. Who's idea was this? It's terrible and sends a bad message.   The other issue I have here is the cleanliness and readiness of the dining area. I was there at 2pm, so it wasn't crowded at all. Employees standing around doing nothing. Yet, the condiments bar was totally out of napkins and the trash was overflowing. And EVERY SINGLE TABLE that wasn't being used was dirty. So, I am left to sit at a crumb filled table left over from some stranger. After spending about 20 minutes there, not once did someone come out to clean..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3QtgI2sJITkbKaXEGsyThw"
  },
  "QBUo0mehbiMZr_S4IrWDLg": {
    "date": "3/4/2018",
    "text": "What the heck Bruegger's! I ordered a Salmon bagel for $7 and they forgot the Salmon. Don't know how that was missed",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KFaTtEvycx4PkaFup7luMA",
        "caption": "Photo of Bruegger's Bagels - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KFaTtEvycx4PkaFup7luMA/o.jpg"
      }
    ],
    "user_id": "NJO3C6fF0FfvvdDpXzMoaw"
  },
  "elNatRplEYCNN8DQxC_-FQ": {
    "date": "9/16/2016",
    "text": "Believe it or not, this was my FIRST time enjoying ANYTHING at Bruegger's. I've never been big on bagels until recently. However, I'm a HUGE fan of Caribou Coffee... so I figured, why not?  Well to sum it up nicely, I wasn't really sold on the Bruegger's Bagel experience. It took about 20 minutes for me order and pay for a breakfast bagel... there were two people in front of me but 7-8 by the time I finished paying. The organization of orders kind of caused things to drop out of whack... especially after one person order a few boxes of bagels and a couple of large boxes of coffee. Also, one of the associates kept having to remind people to get on the register, as I was trying to checkout... there was one associate that was more concerned with cleaning and replacing the tap-ends on the soda machine... shouldn't that have been done before the breakfast rush?   My breakfast bagel was a little rubbery so not enjoyable, to say the least.   HOWEVER, as chaotic as it all seemed, the staff was really pleasant and apologetic for anyone having to wait in line. For that alone (and with it being 7AM in the morning) I think they are trying and I will probably give them another shot some time in the future... this time with just a plain bagel and cream cheese! :-)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "cuHp8luhexZ8XP97885d8g"
  },
  "EHGVH0nNZUolgR3sQ3KMww": {
    "date": "7/24/2018",
    "text": "Anybody who thinks these are good bagels, just hasnt been around to experience what really good bagels are",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mbec0SoTC7-eYLOs8mECmg"
  },
  "FuK8JNo_djmZxJkYRrUYsA": {
    "date": "10/11/2017",
    "text": "Nothing fancy about this place but they serve good bagels.  On this particular visit it was crowded and loud. I think they have more people in here working on their laptops and conducting meetings than they actually have patrons.  There's also a Caribou Coffee inside the same space.  Wide selection of different types of bagels and fresh squeezed orange juice. My go to bagel is a plain bagel with light veggie cream cheese and cucumber slices.  I've been comimg here for over ten years and the service is usually fairly quick and the bagels are always fresh.  You can also build your own salad and make various sandwiches on a bagel bun.  I did have sweet tea today that wasn't very good.  Sweet tea at any restaurant can vary from batch to batch so I wasn't upset.  They were accommodating and swapped it out for a soda instead without any problems.  Will I come back here, yes.  Lots of people come here to study or work on various things on their laptops. Honestly, I think it's too loud in here to focus but it seems to work for a lot of people. The interior has been remodeled various times through out the years. Nice and clean. You can also watch the employees make fresh bagels through a large glass window. I've never had their coffee but mom says it's better than caribous coffee. There's also an area out front with tables and chairs that I've seen lots of customers being their dogs to. Ample parking available close to the Brueggars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Twub-ZHhUwI3z9b-TMJ0w",
        "caption": "Photo of Bruegger's Bagels - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_Twub-ZHhUwI3z9b-TMJ0w/o.jpg"
      },
      {
        "img_id": "XyLupt2QI3i5yMt-eQ9gcg",
        "caption": "Photo of Bruegger's Bagels - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XyLupt2QI3i5yMt-eQ9gcg/o.jpg"
      },
      {
        "img_id": "nu1u5b4sItez8Vkv0X2DBQ",
        "caption": "Photo of Bruegger's Bagels - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nu1u5b4sItez8Vkv0X2DBQ/o.jpg"
      }
    ],
    "user_id": "9eFi-CKKmdlwpoHVja9Y6g"
  },
  "oQoL4fsS-uYjUPL9F0p-ig": {
    "date": "1/11/2019",
    "text": "Terrible service. I love Bruegger's overall but this location never has enough workers and no employees ever smile or thank you for your business. I will now drive out of my way to go to the Cotswold location. Great service at Cotswold!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQWwurfxwqSY55oaFJoJsA"
  },
  "eBPF00WxX7jsfNyQ1ybkRA": {
    "date": "6/18/2017",
    "text": "This location is close to my work. When it comes to their bagels, I find them pretty chewy. I prefer a less chewy bagel. I will say that the chicken salad is pretty tasty for lunch and it's only 5.99 and comes on wheat toast which is great since I'm not a big fan of the bagels. Also, the caribou coffee next door is a great addition.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ovFBhEt28yMjW6hBBHp_gA"
  },
  "8yHdfUKr86zCKAio6-gNgA": {
    "date": "4/12/2017",
    "text": "The cashier Beverly is almost always in a bad mood . She is terrible.  The Staffs never looks happy.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dDV-ONsXggDuFth8Um7PmA"
  },
  "KNlk-crZgq9DChk6g2zdMA": {
    "date": "5/24/2015",
    "text": "Seriously, How can you go bad with a bagel?  The Line is always long attesting to the deliciousness of the bagel.  Mine Everything w/Butter, Her Everything w/Plain Cream Cheese on the side and never a bad issue.  Occasionally the counter people try too hard to service everyone quickly and take on too much so they do not hear or remember what they should be doing. (ie Cream Cheese on the side becomes cream cheese on the bagel and an oops moment)  Remind Cashier about asking if you need a drink.  Minor things all in all.  But much better than any other bagel place...Nope all about the same.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4o0KkpAkyO6r0NHXmobTeQ"
  },
  "cPCA-CSIATfPF3Gp1c1jkw": {
    "date": "5/6/2013",
    "text": "Old school jams, super friendly staff, great fresh food and free Wi-Fi, Come on...how could this place not be worth the five stars?!?!?!  What an excellent selection of bagels and varieties at this location! I stopped in for lunch and to catch up on some work and was more than pleasantly surprised with my visit.  I walked up to the counter and everyone was smiling and singing to the music, very happy to help and that is what will keep me coming back as a customer! I ordered the trio, by far the best deal on the menu...you get any bagel sandwich, soup or chips and a drink for $6.99.   I chose the turkey chipotle (turkey and peppered bacon) on a rosemary and olive oil bagel with lettuce, jalapenos, onions and chipotle mayo. Toasted, of course with chips as my side. I asked that they make the bacon extra crispy and they were more than happy to oblige :)   The sandwich was absolutely delish! Loved the rosemary and olive oil bagel and they piled on the toppings! The chips are all kettle cooked, my absolute favorite so I was clearly a fan!  Best thing about this place outside of that customer service and yummy food was the abundance of outlet plugs and booths for everyone to enjoy the free Wi-Fi!!! Everywhere I looked there was a chair or booth and outlet which was wonderful! And I don't know if it a regular thing but the tunes today were amazing...nothing but old school classics...I could help but bop my head and jam on....  That my friends is as good as it gets! Can't wait to go back!!  Don't forget about the specials on Wednesdays, so be sure to drop in!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "u4MNKr1ZTgU3IRZ4G0XwsA",
        "caption": "Photo of Bruegger's Bagels - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u4MNKr1ZTgU3IRZ4G0XwsA/o.jpg"
      },
      {
        "img_id": "9Cb-ezFENo2rJpwvZBPHeQ",
        "caption": "Photo of Bruegger's Bagels - Charlotte, NC, United States. Veggie cream cheese on wheat!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9Cb-ezFENo2rJpwvZBPHeQ/o.jpg"
      },
      {
        "img_id": "Y2-Gh-1GEoYLuucPkSi_0Q",
        "caption": "Photo of Bruegger's Bagels - Charlotte, NC, United States. Egg bagel with veggie cream cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Y2-Gh-1GEoYLuucPkSi_0Q/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "RiVGfqOkOTwkRx8tUJ5v-w": {
    "date": "6/28/2017",
    "text": "I come here because it's close to where I work but every time I've been greeted with terrible attitudes. Today specifically I had to wait for the cashier to come back from texting in the little closet area. She finally came and rang me up and then proceeded to start texting again at the register so I just walked away. She then yelled if I wanted my receipt. Service is just always horrendous. In previous visits I've had employees look at me as I walked up, then go back to finishing their conversation about their weekend before coming to take my order.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_0Tmjr97V05-V21C9SxQNg"
  },
  "CMTIe7Ftk3z7JhGZv3t0gQ": {
    "date": "9/23/2017",
    "text": "I love the sundried tomato bagel and that's why I go here.  But it's always slow, a bit dirty, not organized, and poor customer service.  You have great bagel places nearby like Poppy's or Owen's who really have it together.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qb-8k6qKMq9gjCZlm_o2lw"
  },
  "k_3JoN0wy3Apay25Ai7eyg": {
    "date": "10/16/2014",
    "text": "Overall: The food wasn't too bad. Service could definitely be improved. It's in a shopping center so Parking is plentiful if you don't mind walking a bit.  Had the trio combo with salad, soup, and a drink. Also came with bagel bites. The broccoli cheddar soup and the chicken almond salad were both okay but nothing to write home about.   Be prepared for a wait :/ the location seems really understaffed (as you can see by the lack of trash being taken out) and the staff that was there all seemed new...and only one of three seemed friendly.  I wouldn't make an effort to come here but it was conveniently located and we were starving.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6i4XKJ5j8brueimXoyXSlA",
        "caption": "Photo of Bruegger's Bagels - Charlotte, NC, United States. I haven&amp;#39;t seen things stacked this bad at McDonalds!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6i4XKJ5j8brueimXoyXSlA/o.jpg"
      }
    ],
    "user_id": "laaDq4q9teDWzBZeREBJhg"
  },
  "tnN5loRs3rpi6BjM1cCQRw": {
    "date": "3/18/2018",
    "text": "Attitudes every time and slow service. Made to feel like an idiot every time I order here. Manager and workers both huff and puff as you order as if they don't want you there. Sanitation rating is 90 as well. Needs better management.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3cGx74L7coImaNSoFjujSw"
  }
}