{
  "AHGgB4ipsbnxbOeHV_0tcw": {
    "date": "7/25/2017",
    "text": "This is my second review. The first one was positive for the most part but I don't have many good things to say this time. I've been going into the park road location regularly since my first visit and it's gone down hill since - or my first visit was just lucky. Nobody at the registers knew anything about the menu and didn't give me a straight answer on anything I asked. And then got my order wrong. It took so long to get my to go order the first time I didn't even bother getting it fixed, the food was okay but I could tell it was sitting in the box for a while. While I was waiting an employee came to check on me and told me there were a lot of new people working there. Makes sense since nobody at the register could answer my question! The people who took my orders before were knowledgeable and polite and this visit ruined viva for me. Viva should spend more time training and keeping their employees happy enough to stay instead of hiring a ton of new people. I will not be returning to this location.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ft5CI68AXrx9aDh7PTeG-w"
  },
  "_nLZ7snxVSQpk7q9bjJpbw": {
    "date": "11/8/2016",
    "text": "First let me say I love Viva Chicken, but this was my first time at this new location and wow!! I didn't think I could love them any more but I DO!!  Park rd location is so clean & fresh, the staff was amazing!!  Friendly, kind & taking care of their guests. All of the utensils, napkins, sauces and accoutrements were fully stocked.  Wait time was minimal even though it was quite busy on a Tuesday night.  The great staff checked on us several times to make sure we were doing ok, engaged us in friendly conversation, refilled our drinks/sauces for us several times so we didn't have to get up.  The food was amazing as always, consistent with the Viva that we love!!  A family favorite for sure!! The manager should be very proud of their staff and chefs at the Park rd location.  We could not have asked for more. Awesome dinner experience after a hard day.  Love that this location is so close to us. We'll be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Adq0PavB5WZp9wyfH1yacA"
  },
  "qsx_zRQcZIEFnx1cBRLBtw": {
    "date": "10/6/2016",
    "text": "I usually get the 1/4 chicken and vary the sides. The Cilantro Rice, Plantains and Green Beans are phenomenal! It is always enough food for me and I'm a pretty sizable guy. However, there is always the 1/2 chicken too if you are really famished. The two sauces (I only know them as green and yellow) are both delicious and unique. Great for dipping chicken or fries into or pouring over your rice. The stuffed avocados with chicken are incredible and worthy of an appetizer to try or get two and make it a meal. The Tres Leche cake is also wonderfully sweet and a great treat.  When I checked in, I commented \"I got here as soon as I could!\" I did not know it was opening day until I got to the register and thought it had been open a week or two. I usually avoid openings because so much can go wrong and the lines are too long. I'm really okay with delayed gratification.  That all being said, they were flawless in their opening which indicates to me this place is going to thrive with high quality and delicious food. I've reviewed their original location and am no stranger to their food. I will be a regular at this closer location.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ntq_6n5SpkZGmNHXnEmlNQ"
  },
  "2rvopyu610GCvSlEZTmsXQ": {
    "date": "1/13/2019",
    "text": "Delicious food!! Had the classic saltado and I loved it! The place is clean and the service is good. Definitely coming back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yRgad1ac59lV2useZNoHLg"
  },
  "ALd68GIVdo7uYAPj-8tyeQ": {
    "date": "2/22/2018",
    "text": "Excellent food and service. Whatever you order, don't forget the cilantro infused rice. It completes any dish! Service was fast and friendly. Will definitely be back to this location. I'll even try some dessert!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y3t7mKa5in7ATCecMslNzQ"
  },
  "zSCHzvR3rwBT-eN3SUYNuA": {
    "date": "12/20/2018",
    "text": "Not long ago I picked up salads. The food is usually very good, but both salads appeared to consist of old, bottom parts of lettuce (not green), and were brown when placed in the refrigerator. I tried to contact the manager through their site, but did not receive a response. I have not returned since. It may take a while to try their food again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nduJkUDx3okcqd17ZpCp3Q"
  },
  "v4gOsNJTHeM5pwjd3scLPA": {
    "date": "6/20/2017",
    "text": "We catered the viva chicken package for a work meeting and it was a big hit. We ordered chicken, cilantro rice, green beans and fruit. The delivery was prompt, and the associate helped us set it up. Loved the silverware wrapped in a napkin and square plates-- it looked great. The food was delicious and including the green and yellow sauces. We debated which was which, only to realize they were labeled on the other side! Ha! The sweet tea was very sweet and the pink lemonade was good too. Highly recommend catering Viva Chicken for your next event!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "fPxE0VgahKU0Xh6YQt2-Kw"
  },
  "VIr4y4a5grAAiOAuAepxSw": {
    "date": "12/15/2018",
    "text": "Delicious chicken. Sides are great as well. Fried rice is pretty darn good too. Always love when this gets catered to work",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZRgjAtYh5-ool-Zh5WBatw"
  },
  "MjSuVVu-J74Dhiu9d9rNUA": {
    "date": "11/25/2018",
    "text": "I ordered the quinoa stuffed avocado. It was filling and had good flavor. I also got a side of the plantains, which were perfectly cooked! I'll be going back for those plantains!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F12V6Bzq2CgnHHYAQYdUmg"
  },
  "Af1sJBgFUvUHNNZcIE__Fw": {
    "date": "3/31/2018",
    "text": "When the family's happy, momma's happy. Picked up some Viva Chicken and sides and they were all delicious and fresh. Everyone enjoyed the flavors Peruvian (?) flavors. Always enjoy the avocado quinoa concoction. Pure deliciousness! A definite go to when you're just wanting a consistent delicious meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jUW1PsmZk7WNcHoQUYuiAQ"
  },
  "Wfuylg36ppHvl3Nlc39C5Q": {
    "date": "11/14/2018",
    "text": "Service is great but the quality of the food is going downhill.  They've changed the naked Peruvian wrap so many times it went from great, to dry, and now the tortilla that they have tastes like bland trash.  Sad to say I won't come back because my favorite sandwich is ruined. Used to love this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qAfAjtjuqTHA4kOSgmsCag"
  },
  "IVLj9Ze_FgN3eh5eAa9CWw": {
    "date": "10/14/2017",
    "text": "My mouth waters just thinking about the meal I had here! I had the Classic Saltado... The steak was extremely juicy and tender. The fries were crisp and really complimented the meat and vegetable medley on top. Oh and the au jus... I think Jesus came and made it himself! I even asked for extra which the GM had them whip me up some since everything is made to order! Also the dining room attendant Dennis really was great too! Very attentive and extremely helpful. I will continue to visit this location!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3jHtDv9IOYxN4xwn8650CQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3jHtDv9IOYxN4xwn8650CQ/o.jpg"
      }
    ],
    "user_id": "RFRN6AvMXc8ueWPcXYjzrA"
  },
  "MmcSVClO7MooqS2Dl-qpiw": {
    "date": "8/13/2017",
    "text": "The chicken at Viva is delicious! When my friend told me about this place she said it tasted like Boston Market, but clearly she has no taste buds. OMG viva chicken seasons their meat so well & cooks it perfectly nice & juicy. I also got the cilantro infused rice, the rice was okay for me not the best because you couldn't really taste the flavor it tasted like jasmine rice, the plantains were deliciously cooked! Perfect amount of crisp and seasoning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z3jbAhEEpaBUJAl6rSMQPw"
  },
  "igB5iAyJT_8ykCvr0gGZkA": {
    "date": "3/31/2017",
    "text": "Chicken and yuca fries are great.  I can't eat the rice or couscous because they put so many raw onions.  Looking forward to trying more!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "c3_AdjAlMy4EJYQhuXADgA"
  },
  "2lWfc1L1Xp7t-Wf75oELig": {
    "date": "6/17/2017",
    "text": "Lunch can get busy so order ahead and pick it up. Must gets are yuca fries and plantains. The sauces are a perfect compliment to the food. The green sauce is my favorite!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Kk0h6NGUDH0IMrvjySxTJQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Quinoa Stuffed Avocado Salad with Rotisserie Chicken -Half Order",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Kk0h6NGUDH0IMrvjySxTJQ/o.jpg"
      }
    ],
    "user_id": "JlTEv3ZAHTCDvt94fOjWOQ"
  },
  "9UBg4BSMzDeBZCCEEX7Frw": {
    "date": "6/21/2017",
    "text": "Delicious!   The customer service was fantastic! It's my first time here and they helped out tremendously! The chicken was even better tho!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s7t9ompzMar6Rj6aT6zaxQ"
  },
  "t2LAjo0vtAOXw4n7YomOVA": {
    "date": "12/6/2017",
    "text": "Had their ARROZ CHAUFA with no meat and it was surprisingly delicious! I wasn't expecting the rice to be so tasty. I'll definitely look out for this place again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "A56Cmt5_UvYAL8wZS8zOBw"
  },
  "detQZstmZFJ_ATLsTRSlew": {
    "date": "7/14/2017",
    "text": "Love viva chicken.  Wish they had an APP  as we like to order it on the way home and pick it up. Each time I have to fill in all the info again. If I had an account it woudl make it easier.  But love the freshness of the food and the sides. yummy!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5keMAmic7zzrnM5mVefBw"
  },
  "uUp4vYFJQ07tx0X6Y7IbMg": {
    "date": "10/22/2018",
    "text": "I usually love this place but today my chicken was cold and soggy and my fruit was mushy and sour:/ Really a bummer for the price.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ZpYjtddvJQU6Kc6SXg8vg"
  },
  "TTSJ5uqHtxCIT2esDil-9A": {
    "date": "9/21/2018",
    "text": "Food is spectacular!!! Truly, so fresh and always delicious. Their customer service is also above and beyond! They go the extra mile to ensure you are well take care of! My favorite is the  stuffed avocado!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gj2aYCXEXV6GjKCKx1T5tg"
  },
  "UYSN7au3ER5JvNDHzKyYjQ": {
    "date": "5/21/2017",
    "text": "The naked \"wrap\" (we got it with ciabatta) is delicious with the chicken added. Tres Leches  always makes me smile.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BTeaeW0BGVYeQxxoGR6hVw",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Delicious!  Naked Peruvian with chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BTeaeW0BGVYeQxxoGR6hVw/o.jpg"
      },
      {
        "img_id": "XCqMrsIAbXHgOwai-T45Tg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Stingy sides, but tasty",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XCqMrsIAbXHgOwai-T45Tg/o.jpg"
      }
    ],
    "user_id": "QxrmO9IKZc68E2npuN9p8w"
  },
  "zc6jQPvCxf0Artv9RYzu3g": {
    "date": "7/20/2017",
    "text": "Oh Viva, sweet sweet Viva. I highly recommend anything on their menu. I usually go for the Viva Salad with chicken or a full quinoa-stuffed avocado. And to make sure I'm not being too healthy, sometimes I'll get a side of fries (which is HUGE, definitely shareable) and dip in all of the sauces.    You can't go wrong getting a whole chicken and three sides. For two people, this ends up being at least 2-3 meals; the cilantro rice and canary beans never seem to end! It's probably the best value here. I also can't help but mention their \"arroz chaufa\" aka fried rice. One serving is easily 2 meals and has a ton of flavor.   This new location is much easier to park and find a seat than Elizabeth, and much more convenient when living in South Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uFP9IeEYwBeqqlUQ-dw7PQ"
  },
  "5B1wcJoYTrCGx7IDQqHwYw": {
    "date": "4/13/2017",
    "text": "YAAAASSS!! This place is the absolute BEST!!  Delicious, every food item. (Not so much on the funky combo drinks). Service is quick and efficient - including the ability to order online ahead. The sauces are FREE!! Get the green one, put it on everything, its AMAZING!   Best tip about this place: There is a small patio!  Sad tip about this place: They close by 9PM :(",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Jwnr845JKkiLOeHPV7_INg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Sauces! Green is the best!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Jwnr845JKkiLOeHPV7_INg/o.jpg"
      },
      {
        "img_id": "OgikYF83HSmJOSSTOSfxEw",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Sauce Station!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OgikYF83HSmJOSSTOSfxEw/o.jpg"
      },
      {
        "img_id": "YypQYXvPe4wef6O0LAqe2g",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Inside",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YypQYXvPe4wef6O0LAqe2g/o.jpg"
      }
    ],
    "user_id": "F-TYd6eIvMIyInQrhW6oEA"
  },
  "hIgxBKxw8LRoExgMk82LkQ": {
    "date": "5/11/2017",
    "text": "I came here during lunch on a weekday and it was packed! The line went all the way back and around to the sauce station. This was due to only one person taking orders. So be prepared to wait unless you ordered online or called in ahead of time. There's a separate register for that. I saw many people do that and it seemed like a good alternative.   After ordering, the food surprising came out pretty fast. I got the taco bowl which is pretty good. A bit too much red onion on top and a lot of beans. My mom got the 1/4 chicken with cilantro infused rice and sweet potato fries. She said the chicken was really dry and the sweet potato weren't fresh like they had been out for awhile but she did enjoy the rice.   There's not many parking spots in front of Viva Chicken but plenty surrounding the building beside it. I've seen many people park over there and walk to Viva.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gKWT5PTL9f9mdbKDQy1E4Q",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Taco bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gKWT5PTL9f9mdbKDQy1E4Q/o.jpg"
      },
      {
        "img_id": "YK_QyfcVNvD_Q8n8brt8Pg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. 1/4 white meat chicken with cilantro infused rice and sweet potato fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YK_QyfcVNvD_Q8n8brt8Pg/o.jpg"
      }
    ],
    "user_id": "bWbwoUFKKgEIkMMjXxVrbg"
  },
  "UF_P-f1R5JFtaqb0TnMtdg": {
    "date": "3/7/2017",
    "text": "Viva has a special place in my heart. I wont make this review too long, but below is what you need to know:  1. Order the quinoa stuffed avocados every time and add chicken! My husband and I always split them, but it's also big enough for a meal. I usually get the 1/2 order with a side of plantains for my meal.  2. Plantains are a must here! Sweet, savory and delicious. TIP: Dip them in the green sauce- it's so good!   3. Speaking of sauces- they have 3, but my favorite is the new red sauce. A bit of a kick, but not too overpowering. All are made from different types of Peruvian peppers!   4. The Arroz Chaufa is awesome- plus add the chicken. Mix in the sauces and you have a dynamite meal! The ginger gives it a little bit of a kick, but it's so darn good! They usually have this as a weekly late lunch special too during the week (2-5)  so be on the look out for that!   I can go on and on, but these are my top picks here! You can't really compare them to any of the other Peruvian restaurants in Charlotte. They aren't completely authentic, but the food is awesome and it's a great fast casual option that never gets old.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 13,
      "cool": 10
    },
    "photos": [],
    "user_id": "EtFYEN0sbxkZOOt3DE7vWg"
  },
  "cLmGgcvUVDdfW1T9qlYcdg": {
    "date": "1/18/2017",
    "text": "Love this new location of Viva chicken! It's so much better laid out than the original location and a lot bigger on this inside than it appears from the outside.   Inside there's a line where you can place your order.  On my initial visit I ordered the 1/2 chick with Yuca and their cilantro rice. They also suckered me into one of their specialty drinks, the herbal limeade.  On the opposite side of the restaurant, there's a counter for all the sauces - I forget the names of the sauces but all of them are delicious but I think my favorite is the green sauce. I found myself dipping the chicken, the yuca, and smothering the rice in the sauce.  The chicken is flavorful. The meat is tender. The yuca was a nice change from usual fries. The rice on its own was a bit disappointing but mixed with their sauces it was fantastic. The limeade had a nice basil flavor but it was a bit too sweet for me.  The one thing that concerned me about this location when I saw it being built was parking. There was only a small parking lot for the building unless they had approval to park in the office lot next door and that's what they did. So don't let parking worry you. There's a sign stating you can park in the neighboring lot. Whew!   I love this place and their food. Definitely glad to see them expanding!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "H-4wWq2odrhsIbhsNZFjRg": {
    "date": "11/25/2017",
    "text": "This is a great location! Not only is it conveniently located in Midtown but the ingredients and end products are so fresh and delicious. As with any Viva chicken, the sauces is where the magic is at. DO NOT FORGET TO TRY THE SAUCES. Some of my favorite dishes include the bowls and salads. The cilantro lime rice is delicious. The dining area is always clean. The staff are very accomadating here as well. The only downside to this Viva is the parking, they share a lot with Jimmy Johns and there is not much parking there, I often have to park in the office buildings lot next door.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ovFBhEt28yMjW6hBBHp_gA"
  },
  "8iycQDwslSk6JtiN6XP6qw": {
    "date": "12/5/2016",
    "text": "So glad to see another Viva Chicken pop up. The service was extremely friendly and the cashier was extra helpful with explaining what everything on the menu was. Customer service success yet again at this new location.  Here is what we had and what I thought:  Fried Yuka- Amazing! Love some fried yuka Beans- Really great beans! Extra smoky flavor French Fries- They have really great fries here! Chicken- Chicken was good, but nothing better than your average Peruvian chicken place.  Tres Leches- Way too sweet for me Passion fruit Juice- Delicious!!  The sauces for dipping were really great! The yellow one is addicting",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "dGUOe2TBchiGvU1BNkmTog"
  },
  "4F5Jw0kqR9eqBQrm2pb7UA": {
    "date": "4/3/2017",
    "text": "Viva chicken is a bi weekly staple in our house!!!   The arroz is amazing.  The portions are huge and I highly recommend at least 3 tubs of yellow sauce.  The sauce makes the meal.   I also love the andina power food salad.  Add feta cheese to it and you won't regret it.  Since I'm obsessed with the yellow sauce, I use that as my dressing.  The quinoa stuffed avacados are delish and could be eaten as a meal.... with the yellow sauce of course!!    Viva is fast, delicious, and fresh.  They even have a cute patio out back!  I highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "-z5SPtGQry4ExEM-WV9s4Q": {
    "date": "8/6/2018",
    "text": "Loooove the food at Viva Chicken. We frequent this location with our two young kids and the staff are helpful and super friendly! The service is also really fast if you are looking for a quick bite or to grab some dinner to take home. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F9hO2ranx-YzSaHERTQ4Jg"
  },
  "ESej3WMx3Caz_NrI5EntYA": {
    "date": "10/19/2016",
    "text": "I was driving by and remember they now have a Park Road location and I totally turned my car around to go back!!! Tried to place an online order while driving but this location doesn't show up yet. I was able to place a phone order. The person taking the order was very knowledgeable and answered all of my questions.  Getting to the location may seem hard but if you continue down Abby Place and cut through the parking lot you are able to get to the parking easily. The outside of the building is very nice and they have two entrances and a patio for sitting. Since they just opened they had greeters at both doors handing out menus and give you directions to the counter. Everyone was very friendly.  I stood in line for about a minute and then was able to speak to someone at a register. I was amazed that my order was ready when I arrived cause it literally took me only 4/5 minute to get there. They work fast. I was also directed to the condiment station. I was able to grab some more of the yummy yellow sauce for my Arroz Chaufa  Upon opening the Togo container the wonderful aroma of ginger hits you! The Arroz Chaufa was delicious and the yellow sauce gives it a little spice.  I'm soooo happy they have a Park Road location. Since it is so close to home and work I know I will be a regular to this location!!!",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 12,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "R4Mkf2UDCFcIZogp7EZBzg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Kids pulled chicken and mixed fruit (apples, oranges and pineapple)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R4Mkf2UDCFcIZogp7EZBzg/o.jpg"
      },
      {
        "img_id": "7Hu_Rq1brLddRkB35Kpslg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Inca wrap with plantains",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7Hu_Rq1brLddRkB35Kpslg/o.jpg"
      },
      {
        "img_id": "8dgB93vi4ZGARXB6Fmcu6g",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Inca wrap",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8dgB93vi4ZGARXB6Fmcu6g/o.jpg"
      }
    ],
    "user_id": "12iozmUYN_gvAng9kMLs_w"
  },
  "T-bdDpvu_EFvLALXM0icPQ": {
    "date": "6/28/2018",
    "text": "I have only been to this location and the Elizabeth location because I work close to Elizabeth. The employees at this location have always been friendly and helpful.  We eat Viva Chicken a lot and now usually get  1/4 white chicken kids meal and cilantro lime rice or green beans with an herbal limeade. I get too full and waste when  ordering the adult meal. I know there are more things on the menu that I have heard great things about and will venture out one day:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_DiRhrLmnT_qtV_jm48BRg"
  },
  "JhAlQve4C1DPb_cxAPoZRQ": {
    "date": "10/17/2016",
    "text": "Yesssss! Thank you Viva Chicken for opening a location in the south side of the city! Furthermore, thank you for opening a location walking distance from my home!  My husband and I finally got to check out Viva Chicken for dinner on Sunday. This was just as amazing as the Elizabeth location. There was a little bit of a line, but it moved fairly quickly.  For drinks, I got the sangria and my husband got a Corona. The sangria was really delicious and a nice sized drink! For food, we split the 1/2 chicken with chicken soup and sweet potato fries.   As we were waiting for the food, we got the \"stop light\" of sauces. The yellow one was definitely my favorite! The chicken was perfectly cooked. Even better dipped in the sauce. The sweet potato fries were also delish! However, the winner was the chicken soup. I can't even describe how amazing this is! What's so awesome is it is super basic. Chicken broth, rice, chicken, veggies, cilantro. It is just so much better than your average run of the mill soup. I want to be sick just so I can make my husband get this soup for me!!!  We will 100% be back! Great job Viva Chicken on another location!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "Hw5riZfnB-B7G79vBTOssA"
  },
  "m-ulU7-AFwN57hNtBHPbcQ": {
    "date": "1/30/2018",
    "text": "Visited Charlotte on a work trip and any time I travel I love to try new places. Honestly, especially something that looks like it could be a fresh new chain. Viva Chicken has my seal of approval. These are flavors you don't get conveniently anywhere else. I also love exclusivity in flavor and sauce and they had three bold condiments I couldn't get anywhere else. The menu ranges from a whole chicken with sides to wraps, sandwiches, and bowls of rice and veggies you can add chicken to for a small additional cost. Correct me if I'm wrong but vegans or anyone on a not too strict diet could enjoy this place. I applaud Viva Chicken and look forward to an Atlanta, GA location.   P.S. it is rotisserie chicken so there can be bones in the food so watch out. Notice how that didn't stop me from delivering a 5 star review.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K5b02dfEZDMdPvzlKFdUNA"
  },
  "mzx1uM_EPncS12a-ugCQzg": {
    "date": "12/22/2016",
    "text": "I love all the Viva's but this location is my favorite.  It is large and has adequate parking and seating.  The sauce bar is located away from the soda area so it creates less congestion.  Their food is phenomenal.  The quinoa stuffed avocados are delicious - I always add the chicken to make it a meal.  The arroz chaufa is my favorite dish - it is a Peruvian fried rice.  The Great is my go-to sandwich there.  I've never met anyone who didn't like their cilantro rice.  Probably my favorite casual restaurant in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dp1XMUV1Laq6-EBiSXj_1Q"
  },
  "c5wdJOMxwFFpLVYvcH_4DA": {
    "date": "7/6/2018",
    "text": "My husband and I visited viva chicken for the first time today and loved it! The food was great everyone that works there is so helpful and kind. Daniel and a young lady with a very short haircut were very helpful. They brought sauces to our table and Daniel gave us a free sample of their fried rice. Delicious! We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZguMf1rmTZlu14pNQdSJxA"
  },
  "i4QeQTNrzYANlaFradZNfQ": {
    "date": "3/25/2017",
    "text": "Sooo good with healthy eating options!!   I got the 1/4 chicken with cilantro rice and sweet plantains.  Omg the cilantro rice is amazing, definitely will be using their recipe for my rice at home.  There chicken is pretty amazing and sauces are so good along. You can choose between white meat and dark meat. Sweet plantains were soo good I wish I had more than 4 LOL. I usually can't ever finished my food but it was that good .  CONS; lines can be so long that should expand their checkout  Tres leches cake; not really a fan at all. There's a half of a inch of milk at the bottom of the container which I've never seen before. It was good but wasn't the traditional tres leches cake",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RiXUCQH0fxlZ-_yDZIoNJg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Awesome cilantro rice and 1/4 chicken with sweet plantains",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RiXUCQH0fxlZ-_yDZIoNJg/o.jpg"
      }
    ],
    "user_id": "KWXIVMbT-8UqS1_piND4Iw"
  },
  "gR-j4SFgjDzaAyaa2lF3cQ": {
    "date": "10/24/2016",
    "text": "I had some time to kill so thought I'd try this new location.  It's another place using the \"clearly confusing\" Chipotle business model which I do not enjoy, but I'm already inside so I keep going.  It'll either blow my socks off enough to come back or it won't.  Of course they have a timid little girl whispering at the register which also irritates me because this is my first visit and I need some guidance.    I ordered a Tacu Bowl with chicken and a Basil, Rosemary, mint drink.  The drink is outstanding, but it's too thick to drink it with a meal, so I had to go back and order a pepsi which was over $2.00!  Keep in mind this is a plastic cup, pour it yourself kind of place, so $2.00 for a fountain pepsi I think is too much.  My bowl was tasty, but had way too many beans in it.  I thought it was pricey for what I ended up with.  I wasn't bowled over by any part of my visit, so I don't think I'll be going back, but if you enjoy this type of food and environment, you'll probably enjoy your time there.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ZAkDj46IJUy2iN37RLV7_w",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Tacu Bowl with chicken.  It was moist and flavorful, just nothing I&amp;#39;d really have a desire to return for.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZAkDj46IJUy2iN37RLV7_w/o.jpg"
      },
      {
        "img_id": "M6C_CbH9bfaa2IVXkJEt5Q",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Basil, Rosemary, Mint drink.  Very tasty if you like rosemary, but too thick to be used as liquid with a meal for me.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M6C_CbH9bfaa2IVXkJEt5Q/o.jpg"
      }
    ],
    "user_id": "2l8rUzap_-dy3lVgYshOSA"
  },
  "qz7MCHOLMDYjdLbqydRVzA": {
    "date": "2/21/2017",
    "text": "Amazing ! It was my first time and the service was fast and the serving was great. I got the limena chopped salad which was amazing was filled with multiple flavors and ingredients that complimented each other. The pulled chicken was great and the yellow and green sauces were heavenlyyyyyyyyy! This is a place everyone should try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MmkVJxzO8LwYWwluzzoB3Q",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Limena chopped salad with pulled chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MmkVJxzO8LwYWwluzzoB3Q/o.jpg"
      },
      {
        "img_id": "_IYKKESlj8jb3KnEY3z1yA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. The limena Chopped salad with chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_IYKKESlj8jb3KnEY3z1yA/o.jpg"
      },
      {
        "img_id": "qZ6YPYCF__koVfpzi1Nayg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. The yellow sauce is INCREDIBLE! And the green",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qZ6YPYCF__koVfpzi1Nayg/o.jpg"
      }
    ],
    "user_id": "Lgu-Qv64XA7pnfDEdJ817Q"
  },
  "QcakQFtHul1tk-k8vcJu7w": {
    "date": "7/18/2018",
    "text": "So scrumptious!! We had a bowl and added chicken. Loved the green sauce the most. Downside: they were slammed at lunchtime so seating was slim pickings. Service was excellent. Someone came by and checked on us several times even though it's a self service setup. Definitely check them out if you're in the area. Perfect for takeout at home when you don't feel like cooking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A-QyqTp9XL0mNrDZoRwgRg"
  },
  "evr8veTiefX9cBmLqs1qbw": {
    "date": "10/22/2016",
    "text": "You can never go wrong with viva chicken. I always get the same thing, dark meat chicken, cilantro like rice, plantains, and every sauce. You really can't go wrong with this place. The tres leches cake is also a must have and to die for.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "k79_5452GstRlKB62Z_GDA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Deliciousness in a to go box.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k79_5452GstRlKB62Z_GDA/o.jpg"
      }
    ],
    "user_id": "FjVJ1BJ2Y26vL41UdSxDKg"
  },
  "o_91cLD9hIFMrZuWW0mvSA": {
    "date": "10/17/2016",
    "text": "This Viva Chicken location is everything I liked about the Elizabeth location with the bonus of being walking distance to my house! Being a Peruvian rotisserie chicken joint, expect very flavorful roasted chicken, colorful dipping sauces, and a laid back atmosphere.  Upon my most recent trip here, my wife and I split a half roasted chicken which comes with 2 sides. We ended up getting sweet potato fries and chicken soup. If you are a fan of any soup, I recommend this one as a side. It's broth based, but they don't kill it with salt and load it down with huge chunks of chicken, rice, vegetables, and cilantro. A must have if I get sick this winter! Also the chicken is a can't miss. Don't forget to get the dipping sauces located in the back of the restaurant. I recommend the yellow (tangy) and red (spicy).   I also like the new layout of the place. Glad they could carry over the patio vibe from the Elizabeth location. Overall a solid meal at a reasonable price. Makes for good eats after a few cervezas at Brawley's. You can probably catch me again here sometime soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nvHJFFr5R74ug5NOh2VDPg"
  },
  "V7LlAOb-UbKsqvWbnEtUpA": {
    "date": "3/26/2017",
    "text": "5 stars every single time! I always order one of the two options: stuffed avocados with chicken or half of chicken with rice, beans, yuca sides and herbal lemonade. The employees of this location are very helpful and friendly! The managers are always there and make sure that the place runs smoothly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qwYfnIWBB1zOVJ2XNzvdqQ"
  },
  "VZk7_wrib7dQ1pGN-ENskg": {
    "date": "12/1/2016",
    "text": "Yum. I come here mainly for the Quinoa Stuffed Avocado salad with the pulled chicken and the sauces. The sauces are out of this world, I could write sonnets if I had any poetic inclinations. They have a nice variety to the menu and the herbal limeade is really good, too. I wasn't as over the moon about the Maracuya (Passionfruit) drink and the dark purple Chicha Morada (corn, cinnamon, clove, pineapple, lime) drink, but I am glad that they have them to switch things up on occasion. Those drinks are sometimes served a little warm, so I tend to grab some ice at the self serve fountain to chill it some more. Don't be too afraid to come in when the line is a little long, it moves fast. It's a little claustrophobic in there, so try to get a table out of the way- or just get your stuff to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bSQ1e1SvcLeLeyD367gWqw"
  },
  "HhGciH4meAfeIcXZwjIPnQ": {
    "date": "5/25/2017",
    "text": "We placed a large catering order for a group lunch and it was wonderful! They delivered the food (and it was A LOT of food!) and help set everything up. Kate was extremely helpful throughout the process. They are great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ki5N8fkzIJVJCp89tf9Tnw"
  },
  "e9eaKGP8ig1D-wHHUgSNxQ": {
    "date": "5/16/2017",
    "text": "I like this spot. My coworkers and I went on lunch. It wasn't too busy. Service didn't take too long. I got the qtr chicken, fruit and cilantro rice. Nice lil meal. Kinda wish I got the half chicken. But I thought it was gon be too much. But anyway, put some sauce on the rice. It ain't gon do anything but enhance it. And the rotisserie chicken as u might've guessed by me wanting more is A1. I'll be back sooner than later.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aIt8TKiYoPk7MW-5EZqZFA"
  },
  "eEX5Eha62xIoYM4SPMf_9A": {
    "date": "2/24/2017",
    "text": "Great location, great building. The food was good, but personally, I'm not sure it would have been worth it had I not been with my family, only because of the ridiculous line we waited in in order to order. (Excuse that awkward wording). The place was tremendously crowded and loud as well. That being said, the food was very good and it definitely has something that no one else in the area has, in terms of food and even ambiance.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hm3L4n5DUotxRCWPxVWk_A"
  },
  "TXg5xZH1MQ4AcKrzVzOLLg": {
    "date": "3/9/2017",
    "text": "This place is so good. I cant wait to go back. they have this yellow sauce that is amazing. The staff was great and there are a lot of different option on the menu! They have vegetarian friendly options which was surprising given the name.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UKJ8rZD0Cpo--9DY1WxMXw"
  },
  "U6yvQICNmgKVZUFJ8VcNwA": {
    "date": "10/16/2016",
    "text": "Excellent chicken, sides, and service.  We were very pleased with our lunch at Viva Chicken.  The only fault I would give them is the 1/4 chicken was tiny for a $9 meal.  The sides were excellent and made up for the portion.  I wouldn't give this a 5 star review as I wasn't blown away by the place, but will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RMhh-vs9CBglg4kfxWdZHQ"
  },
  "KY3PjfUTkCvcKoTKmZ_7uw": {
    "date": "1/3/2017",
    "text": "This place is so wonderful, and I'm so glad they have a location so close to my house now! The quinoa stuffed avocado and the naked Peruvian wrap are the BEST.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UN0MdiMH5_jFT1HO4Uwmkw"
  },
  "Vc35D_JVu_XVssARBDgvtg": {
    "date": "4/12/2017",
    "text": "Good food...a little inconsistent. WAY too loud. Even my ten year old complained. We sat there in silence because we couldn't hear each other talk. The girls at the counter were nice but seemed unprepared/young and a bit clueless. AND, they need to SPEAK UP! Wish they had a drive thru!   I literally had my hearing checked after this episode. It's very good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_x5-xVP1WttCEsAF-Vi2lw"
  },
  "zEU-A8DPSP65GJUP9vJkJw": {
    "date": "1/14/2017",
    "text": "Always great food and great service. Food is always hot and fresh.   Surprise of the menu - how good the French fries are.   Order the inca wrap and you'll be happy.  And... this location has the most efficient layout.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iVc7SYekGxESl8IKHi9Qig"
  },
  "Mgzyw8kriRPezcmtZGs_DA": {
    "date": "1/2/2017",
    "text": "Such great food! We can walk there from our house and it's definitely a go to for dinner. We have never been disappointed in their food and have always gotten awesome service. Make sure you get a lot of the yellow sauce! It's medium spicy and sooooo delicious. It goes with everything!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7yXNEnnTZAEhl7N-qv9fyQ"
  },
  "TEtyuvDTmUfyaBSro6acmw": {
    "date": "12/30/2016",
    "text": "Great place to eat,  nice vibes . Try the tacu,  and don't be afraid of the Gringo Killer Sauce,  it's not that bad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_qg-dwZc4EV8bCcayNY5jA"
  },
  "S8orRyvFCgoS3v_o_ssl6g": {
    "date": "11/20/2017",
    "text": "I really enjoyed this place! I got the Peruvian Fried Rice with steak and to be honest it was a littttlee bit salty at first but I didn't notice it as I kept eating. My sister got the same thing except with chicken and that one was pretty good too! Her boyfriend got the roasted chicken with fries and oh my goodness the fries were SO GOOD. Overall I would give the food a 4 but the reason I am giving this place a 5 is because of the service. The manager was very attentive and came asked how everything was. The place was very well staffed and everyone was very nice. I don't live near the area and stopped by just to get lunch during our road trip but it made the trip worthwhile :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mHk7XmUYl_pNJl8-CD3vYA"
  },
  "UUFZlvBfmasWqdjsdogwXw": {
    "date": "11/18/2017",
    "text": "Food is great as always... i just wanted to give props the Yvonne and the staff for taking care of my family and i... first time for my family doing viva. Very informative and nice folk...the food is a no brainer, Yvonne was outstanding!  Will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_hn812-93vBWirLY5F-Og"
  },
  "wDxx7Y30AaHxJniFk1Q0Pg": {
    "date": "10/6/2016",
    "text": "I've been to one other Viva Chicken location before, and was already impressed with that.. Today for lunch I went to the Park Rd location (its second day open, I believe) and got a wrap and a side of plantains.  It tasted amazing, especially the plantains with green dipping sauce.  Even though it was only the second day, and it was PACKED, the staff knew what they were doing and were extremely nice.. if they can keep this level of quality up there as the months go on, they'll have a customer for life.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3tyqacrfO445shqj8p7xEQ"
  },
  "tyzE41tRBMWnBVwI_FXQrw": {
    "date": "8/7/2017",
    "text": "NEW FAVORITE PLACE!!! The chicken is amazing, but its the healthy options and choice of sauces that puts this place over the top. The stuffed avocados topped with chicken is one of the best meals I've ever had without the guilt of eating a high calorie meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tEd59XnxQFlXsus0bfLL9g"
  },
  "tqjwTB-5_2iOf8HpsmyHaQ": {
    "date": "9/14/2017",
    "text": "Love, love, love!!!  The food is always fresh and delicious.  The choice was mine for a catered company lunch and I chose Viva Chicken both times.  Kate is awesome...very friendly and professional.   I would recommend them to everyone.  Thanks Viva!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ggehGgiTR8efDfrWXouqA"
  },
  "_5BdSOQ9Ypf6zIRxEv2H6g": {
    "date": "3/18/2017",
    "text": "Sides are okay but the chicken is a ripoff. Another case of trendy crap. Many better options for less. Everything here is too salty. Salt is not a spice. Not worth the price or the wait.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "831fcKfbaMs3erHwQtx9jQ"
  },
  "XNoefKfwRz7qSxf-xPCviw": {
    "date": "6/5/2017",
    "text": "Our first time eating here and enjoyed the meals. The mint flavor drink is refreshing and delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YZEpuiiNCZzR5qocbBKGEw"
  },
  "mgyjWFdU0_PJJLuLih4-ew": {
    "date": "2/10/2017",
    "text": "While I was already a fan of Viva Chicken in Elizabeth. The Park Rd. Location is closer to me and they got a ton of staff and more room than their previous location. Great food, good customer service. Tried the inca wrap, yuca, and stuffed avocados. Do yourself and body a favor try the mint lemonade. All delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ibk2kY59Tq5nUrePO1sRXw"
  },
  "e1BFKp9Sbj7nHaQUkXmk9Q": {
    "date": "1/3/2018",
    "text": "I love Viva Chicken--see any of my other reviews (Elizabeth, Ballantyne, Huntersville) and you will know I'm not lying. This location; however, has been a swing and a miss two out of two times for me. The employees are friendly, restaurant has a great ambiance, but the food is worse than the other Viva locations. Today it was some cartilage in my The Great sandwich, and last time the chicken was pretty bad as well.   You'll still get a good lunch here, but the quality control needs to be stepped up to match the amazingness that is the other locations.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ABRH3A37M24GrCR3-bX1Pw"
  },
  "dNL9BdHwhu751Q3x5-w6IQ": {
    "date": "6/30/2018",
    "text": "This is my favorite restaurant! Any location I've been to has been amazing. It was busy when I came in on Wednesday to place a to go order. However, the cashier was smiling and the staff was efficient. The restaurant was clean and the food was fresh. I order the tacu bowl with pulled chicken and it was amazing! The flavors meshed extremely well together, that I didn't need the sauce. However, when you eat at VIva, you have to get the sauce! I am a customer for life!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kDppjkN7xIgxunSLfhYjpg"
  },
  "MAriCk2fPEmGM5IyvsEgVA": {
    "date": "2/17/2019",
    "text": "Great place for a lunch date. The food is amazing and never disappointing. My go-to place for lunch at work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tri60WU2F_ypxwh4ZCAeTA"
  },
  "iv7Zkr6C0V3H7clT_7rjJg": {
    "date": "12/8/2016",
    "text": "When Peruvian is offered during lunch, let this be the first place that comes to mind! I'm not sure how long this location has been here but I'm ever so grateful, because it gives me delight being so close to my job.   If you want to avoid the lunchtime rush, then it's best to get there around 11:50-ish but no later than 12:10! The line was to the back door and in the beginning stages of wrapping around to the sauce bar! The cashiers were quick and friendly, so you will not be in line for too long.   The food is AMAZING! Most believe that you can't go wrong with chicken, but you can and this place DOES NOT! The 1/4 chicken lunch special is enough to hold you over so you don't suffer from a food coma so early in the day.... however, I didn't take my own advice and enjoyed a 1/2 chicken with two sides (lol), lazy is now an understatement.   Check this place out, you will not regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xqwdq0G-CpvmvB8zrWzeug",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. 1/2 Chicken with Cilantro Rice and Canary Beans",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xqwdq0G-CpvmvB8zrWzeug/o.jpg"
      }
    ],
    "user_id": "cuHp8luhexZ8XP97885d8g"
  },
  "YWnkhg0teZTDRSykbLgJlQ": {
    "date": "5/30/2019",
    "text": "I eat here many days a week. The sopa de pollo (chicken soup) is low calorie and delicious. Staff is extremely competent and friendly! You ought to stop in! It's great food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RcaH6K9OKVc_vzBvB-69Rw"
  },
  "1RdwlkzY9BjtSd2uXXkV4A": {
    "date": "2/25/2017",
    "text": "This is my second review of a Viva chicken restaurant! Loved the ambience and the dim lights added such a warmth to the environment! The menu has a lot of incredible tasty and healthy options! I came here with my friends for dinner and ordered some fried rices and chicken with various sides. The juices were extremely colorful and a delight to drink rather than the regular coke and sprites. I loved the Green thingy concoction they call the herbal lemonade! The flavor from the mint  was freshly exhilarating! It didn't take long for the food to arrive at our tables and boy, they were hot and fresh - we dug in immediately giving no time for nature to cool off the tasty stuff! Added to that, the staff did remind us to pick up the three different sauces behind us and man, they raised the flavor to a whole new level now! Have to agree, We were tripping on food!   Definitely recommend everyone to try this restaurant- especially if you are not from NC or Utah, cause currently Viva Chicken is blessing these two states only!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SYJMilplTVa1CjjX7tF2CA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Loved their ambience and interiors",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SYJMilplTVa1CjjX7tF2CA/o.jpg"
      },
      {
        "img_id": "KEsYGqx4ZCj_TeYzmCUKAw",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Love the dim lights and ambiance",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KEsYGqx4ZCj_TeYzmCUKAw/o.jpg"
      },
      {
        "img_id": "Xa-6rU1GTsdfPwgXRIfb8Q",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Yuca- hot and freshly fried tapioca",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Xa-6rU1GTsdfPwgXRIfb8Q/o.jpg"
      }
    ],
    "user_id": "u-NbxbNdh7GZGnwxXUitYg"
  },
  "Qvf2PLT5jfY5YPOzKkq5XQ": {
    "date": "1/14/2018",
    "text": "Ok so back to the basics this is a 5/5 - Chicken is absolutely DELICIOUS, juicy and perfectly seasoned.  - The sopa de pollo tastes like home!  - The fries fresh and crispy  AND THE AJIES BAR OMG!!! The aji amarillo is soooooo good.  The people: amazing! Viva made my day today",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o58RGT-51GAU930dhu015A",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o58RGT-51GAU930dhu015A/o.jpg"
      },
      {
        "img_id": "B4_mVR5mTWTv0nOTUZZP_Q",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/B4_mVR5mTWTv0nOTUZZP_Q/o.jpg"
      }
    ],
    "user_id": "AK6ioEjZt-dfdSXSeGtc9A"
  },
  "azuLTjtHaXma5dF5TYaNjw": {
    "date": "10/21/2016",
    "text": "I'm happy Viva came to my neighborhood; I'm a huge fan of all things slowly roasting on a spit.  Our visit was as expected:  seemless service, prompt delivery, and good quality.  We sat out on the patio and didn't feel abandoned wayyy out there.  I'm going to upset some of my Yelp buddies, but I think they have good chicken for a franchise, but not great  (OK, go ahead and stop following me and take me off your friends list).  My wife disagrees, too!  I expect all this from a company with multiple locations.  I still think, however, that for all their quirks, both the Roasting Company and Pio Pio have a wonderful participation in the rotisserie chicken space, too.  Now I have three within 5 minutes of my home.  Welcome, Viva!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "CjHWRUKXhhley9N9NLS07Q"
  },
  "pD6YpyS7vJTqB6jNcDPJIg": {
    "date": "5/9/2018",
    "text": "Today was my first time eating at Viva Chicken. My fiance had always told me about loving to go here. This has to be one of the fastest and healthiest places to eat. The menu is creative and plenty of options. Today I had the Inca wrap with white rice and add chicken with sweet potato fries. The wrap is a generous portion, so I had to bring the other half home. My fiance had the stuffed avocado salad and add chicken. The sauces looked amazing on his food. The staff is friendly and helpful with the menu. They offered me to try their homemade juices. I made a \"Vivosa,\" which is one of their juices mixed with champagne. It was delicious. There is self seating, including outdoor seating. It is covered and has netting to keep bugs out. This was a perfect, quiet dinner. There is also a register for people who ordered online to pick up. I feel that this really helps with the flow of checking out. Can't wait to eat here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7wxSIdSbNoTQtut5i0kDmA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Stuffed avocado salad and add chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7wxSIdSbNoTQtut5i0kDmA/o.jpg"
      },
      {
        "img_id": "bIrQ8rk48PBYPmDwx9cr3Q",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Inca Wrap with white rice and chicken. Sweet potato fries and &amp;#34;vivosa&amp;#34;",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bIrQ8rk48PBYPmDwx9cr3Q/o.jpg"
      }
    ],
    "user_id": "A5iIKBKCuqDvrFlHnJrW8A"
  },
  "BflwKAJJxsLDGrgXanMIsA": {
    "date": "12/12/2016",
    "text": "Ahh an old favorite. I'm still a huge fan of this place! And I'm super glad to have one on my side of town.   We arrived just before the lunch rush. So we walked right up to the counter and placed our order. But beware - this place get super busy! So if you want to be in and grab a seat I'd recommend getting there any time before noon.   I ordered the 14 chicken with two sides - the yucca and a house salad. Everything was just as yummy as I remember them being the first time I tried this place. The chicken is so tender and packed with flavor. The yucca is cooked to perfection and the house balsamic dressing is amazing.   All the sauces in the back are self-serve. I'd recommend trying them all....I like one for my yucca and a different one for my chicken.   I really enjoy the food here. No matter what you chose you're in for a treat!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "o6GhimQ_KHO9hjt4uwfW0Q",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. 1/2 stuffed avocado with chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o6GhimQ_KHO9hjt4uwfW0Q/o.jpg"
      },
      {
        "img_id": "gYOwACQThggWTjhzKXqUxw",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Chicken, Salad, Yuca",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gYOwACQThggWTjhzKXqUxw/o.jpg"
      },
      {
        "img_id": "DQAD7iv6ljvUg3iQ8aFkZw",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. All the sauces!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DQAD7iv6ljvUg3iQ8aFkZw/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "0LVwMx6f3uB6wABFABeYgQ": {
    "date": "5/22/2019",
    "text": "Super impressed with this location- the service is always great and the food is even better! We have used their catering services also for work events and the catering manager Jon is great to work with!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cGSHFljKAJRVXCAHQCiL5Q"
  },
  "I_UA0-bgz6tos2ZISoGxdg": {
    "date": "4/14/2018",
    "text": "Just got Viva Chicken to go. Started eating my salad and then noticed that the chicken on top is pink and raw..... omg. So disgusting. I really hope I did not eat enough of it to get sick! Picture attached...",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vqKCxlXzzIfNWJRdptbj1A",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Raw chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vqKCxlXzzIfNWJRdptbj1A/o.jpg"
      }
    ],
    "user_id": "14j39CU0NQOlsBFlZRHoVw"
  },
  "9jqKmXmr8ZCsx1ziJnI7XA": {
    "date": "6/12/2017",
    "text": "Every time I think of Viva Chicken, my mouth starts watering.  I had some out of town visitors and couldn't figure out where to take them... but Viva Chicken is definitely a must stop place.  I've had reservations with the Elizabeth location (mostly parking), but this new location has a huge parking lot.  Still busy as always, but seems to be a flow and keeps people coming back for more.  We had the quinoa stuffed avocados and I ordered a BLT wrap which was excellent with a side of plantains.  We also ordered yucca and got #allthesauces for dipping and pouring and enjoying.  The staff are super friendly.... and PATIENT.  I know you walk in and order, but my family wasn't quiet ready so we stepped back and found the handy menus located on the half-wall to peruse.    Even though there's a lot of people coming through here, the place is super clean and the staff also come by to pick up your plates when you are done eating.  Probably just as easy to clean up after yourself since there are trash receptacles located in convenient spots.  You do get a little \"herded\", like cattle to make your way to the registers to place an order, but everything else was super easy and relaxed.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "Z4Syq-Qcqhnspp9WY2NAsg": {
    "date": "5/14/2018",
    "text": "Avocado and chicken is excellent!  It is stuffed with quinoa and has a balsamic vinegar drizzled on top.  It's kind of like sushi in the sense that you can eat a lot and at no point do you feel disgustingly full.  Pretty healthy menu as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s5dDf398fbR1IB858ajhGg"
  },
  "LdUP4fwVASzqlqMbmvnidw": {
    "date": "9/15/2017",
    "text": "EVERY VIVA CHICKEN IN CHARLOTTE IS AMAZING! I have eaten in at this location twice and picked up food to go once. Same great amazing experience EVERY time. Seriously, these guys know consistency.   Thank you for providing our area with healthy quick food alternatives. I love Viva Chicken!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-srZqmR83vjSfR6PSUyVUA"
  },
  "RQ35SIB6pzvTpuQ9HzX9Ew": {
    "date": "8/8/2017",
    "text": "Too close to home! This location is great for us, it's busy but there's always some space, and a nice semi-outdoors one too. If you haven't had their Peruvian chicken, then get that first along with the cilantro rice. It's a great alternative to all the fried chickens out there in Charlotte. The whole chicken and 3 sides deal is pretty good for 2 people, but not if you're hungry. I now get the arroz chaufa w/ chicken and she gets the tacu bowl which adds more substance for the $10 each price point. We usually pass on the desserts, minus the fried plantains, which is really considered a side. Yep, definitely get the fried plantains.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SJwNmBTJGLszcJyfhztyrw",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Arroz Chaufa w/ chicken. Good value",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SJwNmBTJGLszcJyfhztyrw/o.jpg"
      }
    ],
    "user_id": "3VldYRmP6n2wIzaaRrWSNQ"
  },
  "uSGkV9JZGSAzHjAv5uqpgg": {
    "date": "12/6/2017",
    "text": "Love this place. It's always so so clean and everyone is always so nice and helpful.  Have never had a bad experience. Come to this one all the time, not just because I live down the street.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6uTxSzk7cIWF5udRzuh4jA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Tacu bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6uTxSzk7cIWF5udRzuh4jA/o.jpg"
      }
    ],
    "user_id": "nPiX5RkrlODK8DHb4NgTxg"
  },
  "kGUt0L5YIHnQZppBUAfdGA": {
    "date": "3/2/2018",
    "text": "Juicy, peruvian style chicken with a large variety of sides options. I had the 1/4 chicken with crispy green beans, chopped red peppers on top and a salad. They flavor tge ckicken under the skin so it tastes great all tge way through. They have amazing cookies called alphahores. They serve beer and wine and have a good lookung outdoor area..tent in winter. Colorful atmosphere with good music. Very clean. Sauce options at condiment station and hand wipes for cleaning up ur sticky fingers. About $10 for my meal. Worth it. They also have a whole chicken to take home for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TFa_-ZLZSBapZcozBv_JMA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. 20 ft mural is vibrant and very cool.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TFa_-ZLZSBapZcozBv_JMA/o.jpg"
      },
      {
        "img_id": "J7rNuWO3JPKfwioXq2teNg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Wow...yummy. The 1/4 chicken was succulent and flavorful. The stuff herbs under the skin it seemed.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J7rNuWO3JPKfwioXq2teNg/o.jpg"
      },
      {
        "img_id": "Yp9ZPkgvOywopsi2BmFNRA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Yp9ZPkgvOywopsi2BmFNRA/o.jpg"
      }
    ],
    "user_id": "WadXZbiBf1QVAV6wqGJ1YA"
  },
  "8SQpEmL05M97wHaqD7ehKA": {
    "date": "8/31/2017",
    "text": "How many Viva Chicken locations have I reviewed now? God I love this place. And now there's this new location dangerously close to home. Arroz chaufa, rotisserie style pulled chicken and quinoa stuffed avocado. Where can I go wrong?  Honestly even the prices are a perfect match to the food at every Viva Chicken. You can't possibly leave here hungry. The arroz chaufa is a seriously huge portion. These days I almost never finish it in one sitting. No mind, lunch for tomorrow! They have some (usually local) beers available and lots of good house made drink options. Don't hold off on the sauces. Not sure what they're called, but the yellow is best closely followed by the spicier green one.  I've never been disappointed by service at any location although my biggest dislike would be the noisiness. I guess that's what popularity gets you! The icing on the cake for me is that they're incredibly environmentally friendly with most of their entirely disposable dish and utensil line-up being plant-based and compostable. Viva!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjYXOBnladFYhciGBSgAMw"
  },
  "TubSThQFH_IhBrPLpj3JTw": {
    "date": "9/12/2017",
    "text": "I went to Viva Chicken with my family for lunch after hearing it was delicious from a coworker of mine. It did not disappoint! The prices may seem high, but after having a taste and seeing the fair portions you will want to come back. My 1/4 piece of dark meat chicken was well seasoned and so tender. I had a side of fresh fruit and something else, I forgot the name. All of it was very tasty and the service was quick, even when it was busy.  I wish to see more Viva Chickens close to me in SC, it's a great business.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6kZcM-PTSRJmwQdp3FyGeg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6kZcM-PTSRJmwQdp3FyGeg/o.jpg"
      }
    ],
    "user_id": "tsKHY0AOsS7zkV9jg8OyMw"
  },
  "_wbpcEJCh_89mWaAyzaVgw": {
    "date": "2/12/2018",
    "text": "I love Viva Chicken! I've come here several times and loved everything I've had.  My go to orders are the quinoa stuffed avocado salad with chicken and the friend rice with dark meat chicken. The fried rice portion is huge, you'll definitely have leftovers. You have to try the dipping sauces too. I love the house made juices they have! All of them are very good, but my favorite is the herbal limeade. The yucca fries and alfajores are also good.  It is so loud during lunch here. It's crowded with really bad acoustics and they play really loud music. Parking is also a pain at lunch.   The last time I was there, they didn't shred the chicken and it was really dry. I think it was an anomaly though because it's been great every other time.   I love the food and it's unique for Charlotte. I would highly recommend trying Viva Chicken!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "o_Y4C59RZSdFyXz203bqbg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Quinoa stuffed avocado with chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o_Y4C59RZSdFyXz203bqbg/o.jpg"
      },
      {
        "img_id": "90_FilOjpCEUmkMFjxQQLw",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/90_FilOjpCEUmkMFjxQQLw/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "1fQFFA06gSc3Qvf_gMzYGg": {
    "date": "6/28/2019",
    "text": "Love the food. HATE THE MUSIC!!!  PLEASE kill the speakers on the patio to provide your customers an enjoyable meal sans the techno.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ELkVHwgmnxTiG68WJ6CPug"
  },
  "gNiZG4yTji_p9Sy3AIrhyw": {
    "date": "8/7/2019",
    "text": "Frustrating! After a long day at work all you want is a nice meal. Sat like dummies for 30 minutes for food. Waited because it took over 5 minutes just to order at the register with only one person in front of us, thinking, \"oh they must have a bunch of to go orders\". Worst part.. the food never came. Go to register to check on the food - no one made the food. How does that even happen? A full refund after waiting for food that never came because they simply didn't make the food. Charged my card though!!!! So annoying",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IehNSyD-xgYFWgtDWoeyFw"
  },
  "_px1cn1xH74sRaZGIjgVeQ": {
    "date": "2/5/2019",
    "text": "Honestly I'm not sure what we ordered since my local friends did. I just remember chicken, fried rice, yucca fries, and a delicious trio of sauces. Everything was so good. Alfajores were also delicious. I like how it's a fast food set up and affordable. I wish we had this further up north. Please expand.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tZEPCxZSImv2wqbO0dpRCQ"
  },
  "JWUCDJyepaMPkENHMzA1_A": {
    "date": "6/16/2019",
    "text": "My favorite location!! The manager Anthony, is so great and attentive! This is where I go when I have out of town friends and we want a good quick bite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b82J6xdAIqCgruWFoIUYaQ"
  },
  "aaaz6l6aUgTPfqjbn66nBA": {
    "date": "10/31/2017",
    "text": "Have all Viva Chicken locations changed their yucca or just this one? I must go investigate! If only Elizabeth wasn't ripped apart due to construction for a trolley. Anywho, I don't love this new yucca... It was more like a potato wedge than the Viva Chicken yucca of the past that I've come to know and love. Change is hard, y'all.   Besides yucca-gate, all is well at the Park Road Viva Chicken. The place was packed at dinner time on Monday night but they got everyone through the line and food out to our table quickly. I could still drink the green sauce all by itself. And, the chicken was piping hot and delicious, the green beans crunchy and savory, just how I like 'em!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "4EBUofsv4MRV1VbES_ZcIg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Half chicken (all white) with green beans and yucca",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4EBUofsv4MRV1VbES_ZcIg/o.jpg"
      }
    ],
    "user_id": "eVxYV4jI-618bnRCDniowQ"
  },
  "iZGhfWvddap0fEmABoFlMg": {
    "date": "6/4/2018",
    "text": "At The Best Peruvian Restaurant in the Park Rd, Charlotte, NC.  I travel around Charlotte, NC and Indian Trail, NC, I have visited and reviewed most of their locations. Fast & Friendly Service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QBNt7HF08UeCigmL9B9cpA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. At The Best Peruvian Restaurant In The Park Rd, Charlotte, NC.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QBNt7HF08UeCigmL9B9cpA/o.jpg"
      }
    ],
    "user_id": "1DLp9XsxOSkXjQ3yOCN6xw"
  },
  "TmlhDrrdhlmFycNjDIixjw": {
    "date": "11/11/2017",
    "text": "I really like Viva Chicken over all.  There is a good variety of items, the food is prepared well and quickly and is a good portion size.  It is a little pricy for lunch I think, but worth the splurge.  I love the service... the staff are very prompt and willing to help you.  I like that staff stays on the dining floor to keep things clean.  There is no-one that just stands around doing nothing.  I like and will drive to the location at Park Road even though when I pick up my sweetie we are closer to Elizabeth.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "a4IMPhVVYXagIxTVAXH5Dw",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a4IMPhVVYXagIxTVAXH5Dw/o.jpg"
      }
    ],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "mPYOy5N1uf4otwM5LoXPhg": {
    "date": "5/10/2019",
    "text": "This place amuses me at the most. A lot of meals here are served (without Chicken)???  So, why do they call it Viva Chicken, yet you have to actually Add Chicken? Other folks I know have saidcthe same thing. Why not just call it \"Just Add\" Viva Chicken? Anyways, everything I've had here has been great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dKMIKDxenuaGYvuD6y4sYg"
  },
  "Wy2Fx8QDGy1ApHEXyIHCRg": {
    "date": "7/9/2019",
    "text": "Love Viva Chicken!! Consistent goodness all the time.... wish they would open in Steel Creek where I live. If you are a dessert fan, pick up the tres Leche next time... you won't be sorry. This place is fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DwD65Rr17FrATGGRKeQWNA"
  },
  "Ok0JlmoWZB3Gvw0hlMtb1A": {
    "date": "4/17/2019",
    "text": "Love this place. Always the same great quality. Service is quick and the homemade sauces are to die for. This is not your ordinary chicken place. It is far superior.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ap5Me_gnR1BY4zFO6sc50w"
  },
  "j8bXJGQ88RGaeM1etuLp0Q": {
    "date": "6/22/2018",
    "text": "Everyone suffers from an indecisive battle when it comes to what you should eat from time to time. Fresh, clean, and fast. Viva Chicken is always a good choice! Easily one of my all time to go places.  *Arroz Chaufa (Peruvian fried rice)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iLkrXhXqPyqKA3dIRQw1WQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iLkrXhXqPyqKA3dIRQw1WQ/o.jpg"
      }
    ],
    "user_id": "0_9HCOdSBSrgeboN_pDcgA"
  },
  "0134yGlbeu4BbrnpaYTfDw": {
    "date": "7/12/2019",
    "text": "This was my first time trying Peruvian food and it was a great experience. We ordered a whole chicken(which came with 3 sides that you can pick). The sides we for were the Peruvian fried rice, Peruvian salad and plantains. We also got the limena salad. First off, the chicken was so juice and flavorful. The white meat(which is usually pretty dry) was cooked so well that it was very juicy and tasted like dark meat. The chicken as a whole had great flavor. The Peruvian fried rice was also great. It had very nice flavor without being too salty. The Peruvian salad consisted of nontraditional salad ingredients such as edamame and corn. But the dressing really brought all the ingredients together. The plantains were also very yummy. They are fried with a light sugar coating. The limena salad was probably my favorite out of all the dishes. It had a lime based dressing and feta cheese on top. It was all so tasty and they had great service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lI1i_BR_yVnafEfaue-B9Q",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Whole chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lI1i_BR_yVnafEfaue-B9Q/o.jpg"
      },
      {
        "img_id": "xsVWsyM6zBPVSV6zpOnjQw",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Fried rice, Peruvian salad, and limena salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xsVWsyM6zBPVSV6zpOnjQw/o.jpg"
      },
      {
        "img_id": "iiU1XzoNo1urAPpcCpSfQQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Plantains",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iiU1XzoNo1urAPpcCpSfQQ/o.jpg"
      }
    ],
    "user_id": "gluCNekb7oEn7fQ-aYJURQ"
  },
  "8-DCm7BQ04V0OK02RTZHYg": {
    "date": "1/23/2018",
    "text": "I absolutely love this place-- even as a chain! The food is to die for and I don't eat meat  ! The quinoa stuffed avocado and side of green beans are my go-to! Very healthy!   Also, there staff is amazing. So friendly at the counter. One guy is constantly cleaning, another is walking around filling up water, another is picking up your trash, and the girl who brought my order over (I was getting water) waited until I got back to read off the order and ensure she delivered it right!  The best!!! All of them need raises because they work hard!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mtlCOeMCLb2xFQTx7BocDQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mtlCOeMCLb2xFQTx7BocDQ/o.jpg"
      }
    ],
    "user_id": "HOAZt4J39xKyh0WFHmGW0Q"
  },
  "j94Z4GSZVJmd_njzHPjLTA": {
    "date": "10/13/2018",
    "text": "I ordered online during lunch rush hour for pickup and it was ready when I got there in 15 minutes!The staff is really nice and quick to get your order perfect. There's a second side door specifically for pickup which I thought was a nice touch. Get the Inca wrap!! And plantains. Never gets old.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rTRgRaABpgO4OAwddrvpNA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Inca wrap with chicken and yuca fries. This picture does not do any justice with how good this actually is.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rTRgRaABpgO4OAwddrvpNA/o.jpg"
      }
    ],
    "user_id": "dATz-wXMQHXiUx2qM34VBA"
  },
  "09UXcyYinfjTUuH1_ydVZQ": {
    "date": "6/23/2019",
    "text": "Menu: outstanding. Food quality: outstanding. Cleanliness: outstanding. Friendliness and efficiency of employees: outstanding. I've had both vegetarian and non-vegetarian meals and have always been pleased.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HGwTSOvxZkJey4AJqjEHmA"
  },
  "kUPOUthjjd7JdnhxOCM3vg": {
    "date": "6/23/2019",
    "text": "Great chicken and great service.  Love the yellow sauce.  The food and service are always 5 star.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rkwSr7q8JKWrlyLFHNAhEQ"
  },
  "mU94Xc2BurujldeOrixagg": {
    "date": "4/5/2019",
    "text": "I wanted to let you know how impressed I was with a hand written note following a very simple / easily made mistake with my order.  I'd had a few experiences of my drink and fries being left off delivery orders recently, so I decided to email this store that had left my bottled drink out of the bag of my pick-up order that I'd placed on-line.  This District Manager is clearly a man who understands the critical need for stellar customer service!  His swift and consistent effort to apologize and remedy this was beyond impressive!  The art and effort of making customer's for life is lost in our country - and few seemingly understand or make the effort beyond talking. This response will certainly have a lasting impact!  I have shared the note and gift card with the lovely co-worker that told me about this place, and several others, with the statement, \"Now this is phenomenal customer service!\"   I will definitely be eating here again and again, exploring their menu to replace items that I tend to go other places for, such as the taco bowl that the same co-worker was eating yesterday, and the fried rice that I just noticed here...  I just remembered that the co-worker who told me about Viva Chicken -when I asked her what she was eating one day said to me - \"It will change your life.\"   At the time I thought that was impressive but clearly an exaggeration - the current truth is, that in some ways it has - once again restored my belief that there are still some businesses in our country that understand the value of their customers, and are willing to go the extra mile(s) to ensure that their customers know that they do.  Great job Viva Chicken!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ct5EePDe2pWFP9NTXt65w"
  },
  "pQUnKKPbXLjIII8XtU0XWg": {
    "date": "6/17/2018",
    "text": "A unique concept we don't have in Cincinnati - the other Queen City. A chicken and sides easily feeds at least 4 adults and a few kids. Fairly healthy and fun variety. Love the salad with chickpeas and plantains the best!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4IYfTxmI0sboz5KZHRHt0g"
  },
  "Qb_vABGz9QhGpgQ7MnFTFA": {
    "date": "6/2/2019",
    "text": "While the food is great, I don't recommend getting it to go. They mess up the order, and they only give you half of the portion",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xj5zxwyWPrVmetG3glMRZg"
  },
  "dosw4LE1oFJ5s9oLo-qApg": {
    "date": "6/28/2019",
    "text": "One word- AMAZING!  I was in Charlotte visiting my sister when i got my first taste of this deliciousness. I kinda regret trying it since now i get frequent cravings for viva chicken but i have no way to satisfy them(without booking a plane ticket).   The place is clean and well kept. I ordered the tacu bowl and added chicken (extra), red peppers (extra) and later went back and got a side of lettuce(not sure if its extra but i wasnt charged). Im so happy i added the lettuce as it added a nice crunch to it and lettuce always complements a rice bowl. Just a suggestion, i think lettuce should automatically come in the bowl, that would be awesome. Anyhoo, theres 3 varying level of spice sauce available. I personally liked mixing the two higher levels, they tasted so nice and fresh in the bowl. Overall, amazing unique fresh flavors all together makes for a party in your mouth! I loved my experience and i need for them to bring some to Florida! Highly recommend trying this place out if you havent been!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eXHoExt41AD0Q-oHxfH5dQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Poor quality pic of my food bc i was starving and wanted to dig in and not wait for my camera to focus lol",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eXHoExt41AD0Q-oHxfH5dQ/o.jpg"
      }
    ],
    "user_id": "pKr90MPxQcu2FtH3j3oInA"
  },
  "GXijGalsX2YiFhvOgKSHCA": {
    "date": "6/20/2019",
    "text": "Love Viva Chicken!  I'm from Atlanta and get it every time I'm in town.  The half chicken, avocado salad and plantains are we're it is at.  The avocado salad is modern and unique but in a way that I am not sure why more aren't following this kind of side at their restaurants.  Also, shout out to Misa.  What a pleasant person at the register making sure I am an educated customer.  She also made sure that I sampled new things.  I also enjoyed while waiting for my food hearing her great guests as they came in with a genuine voice.  Very refreshing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XfJmD89mBUbyLRRQ_u5M2A"
  },
  "MeWO8YEuImGjjPqH-29dmg": {
    "date": "5/7/2019",
    "text": "I love Viva Chicken. I went with my boyfriend to work today to hang out with him while he was working at the store next-door and I decided to run into Viva chicken which is a restaurant that me and my family have ordered from, dined in at, and have always looked Forward to going to for a long time now.  The atmosphere is super chill it's never hectic or stressful it's calm & a nice place to go when you want some legit Americanized Peruvian chicken. I almost always get the avocado chicken salad because it's absolutely delicious & super fresh.  Today I just went so that I could hang out while boyfriend was working and I just had to get some of their seltzer's which were in the mini fridge by the checkout. super convenient.  The cashier did inform me right when i went to buy them that they could not be taken outside of the facility. Fine. Wasn't planning on leaving and it did feel a little aggressive the way she said it.  I sat outside on the porch. Always love the ambience & the music. it's just a great spot to chill if you want to meet up with somebody or go by yourself either way it's really great and I really encourage everyone to try it. My family spent a month in Peru last year and going to Viva chicken is like our way of reminiscing on our trip to Peru so think of it that way :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6BTuZEGA9-Xxj6DhtymqOw",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Some of the available drinks at check out",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6BTuZEGA9-Xxj6DhtymqOw/o.jpg"
      }
    ],
    "user_id": "vCB_CquK8QS_jfyTAa7S-w"
  },
  "pfdP5pTLSQfwNM6BkHiirw": {
    "date": "4/15/2019",
    "text": "Wow, I ate this food so fast I didn't even get a picture. My friends talk about Viva all the time and I truly had no idea what I've been missing. It was so good , so fresh and full of flavor! The chicken was tender and juicy. My only complaint was the wait was long considering there weren't many people in the restaurant. Also, the staff weren't very welcoming but for take out I wasn't too concerned .  I ordered the dark meat 1/4 chicken with chuafa rice and green beans. The sides were absolutely delicious!! It's also reasonably priced. I received a whole meal for under $10.  I will definitely put Viva in my rotation when grabbing lunch or donne",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lXqsmdhggY-dciQLHGDFQA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lXqsmdhggY-dciQLHGDFQA/o.jpg"
      }
    ],
    "user_id": "7n3E1tWpANHJKeeaC0TIBA"
  },
  "BZBWRiRfD6QoU-jLSCCAEg": {
    "date": "8/25/2019",
    "text": "I love Peruvian food and grew up in Washington DC where there are many numerous excellent Peruvian restaurants. I just moved to Charlotte so I was in search of Peruvian food. I found Viva Chicken which specializes in pollo a la brasa. This brings back fond memories of Washington. The sauces are to die for and chicken is mouthwatering full of flavor. Nice atmosphere also.  Found my new home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tdPLodjSujI4VL-ra_zldg"
  },
  "mZdEy-NDKL9HWE_M-bXQ6w": {
    "date": "4/7/2019",
    "text": "Never been to this viva chicken glad I did. The chicken is made in a wood fired grill using a rotisserie the juices and sauces are made from scratch. The yellow sauce taste good on almost anything! On today's visit I ordered the Inca wrap with yucca it was very good. The maracauya juice is made with passion fruit. I love their outdoor patio it's great for nighttime and this is a place I'd go to as often as I can it's so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "rO0UQPtjnAcl3PWrahvt1A",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Inca wrap with yucca",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rO0UQPtjnAcl3PWrahvt1A/o.jpg"
      }
    ],
    "user_id": "5Z5Pq5tMKzbXjATgXsKFFQ"
  },
  "htaO64wo-kxLc3AsoZ752Q": {
    "date": "7/21/2019",
    "text": "Viva Chicken never lets me down. Everything I've tried has been fantastic. The chicken soup is so delicious...perfect any time, but whenever I'm sick it is LIFE! The arroz chaufra (Peruvian fried rice) is awesome and reheats very well. I read in some article that they had some of the best French fries in town and today I decided to give them a try...YUM! They are crispy and well seasoned on the outside and fluffy and flavorful inside.  The sauces they offer are also so good. There is a mild, medium, and hot that they offer and they each have great flavor...not just \"spicy.\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dg4BGzyl7hAYy9185-yf0g"
  },
  "aPRzROtRVAPBYIHApsjDEw": {
    "date": "3/13/2019",
    "text": "Man this one sucked!!! I've gone to Viva Chicken a million times...well maybe not a million but atleast twice per month. Between Blakney, Johnston Rd and Park Rd(this location) this is the first time my food has ever been messed up/nasty. I ordered the Arroz Chaufe(spell check please) with the added all white chicken. My mouth was watering and I had this meal planned all morning.  I called my order in so I could take it back to work and enjoy it. When I got back to work(15 mins away) I dug in. Only to realize my chicken was NOT cooked. It was rubbery and hard to chew and i was devastated! I tried to just pick through it and find some pieces that were cooked with no success. The rice was good, with added yellow sauce(and lots of it) and a hint of green sauce. I cant say that I won't go back. I would just probably taste my lunch in the parking lot before leaving. I'm not good with calling back to complain so I just let this one go.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "httxNTog7pPv8cjNCDBxHQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Arroz Chaufu (uncooked chicken)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/httxNTog7pPv8cjNCDBxHQ/o.jpg"
      },
      {
        "img_id": "7KAJKB73yj3oABMN8RYCWQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Pink chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7KAJKB73yj3oABMN8RYCWQ/o.jpg"
      }
    ],
    "user_id": "qgIH1Y3ei1ddc50TcLBwmA"
  },
  "JSsrMhr8i37XrmylbLxMQw": {
    "date": "8/14/2019",
    "text": "Great fast casual place. Place is clean, people are great and food is pretty good! Chicken soup is really good especially in the cold weather months. I usually order the 1/4 chicken with cilantro rice and plantains. The plantains are always perfection!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rPqs76yuTh3qtVI-Hgv9Ow"
  },
  "kl6qqtdYyd-3uoPfTZTgHg": {
    "date": "3/12/2019",
    "text": "Viva is definitely a Charlotte staple. This time I tried the fried rice and it was okay. Surprisingly, it was better the next day as leftovers. I normally get the stuffed avocado or quarter chicken and I always love it! My friend had a wrap and soup that she liked a lot too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fA-Vo-m5zI0A2bj-iN9QDA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Fried rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fA-Vo-m5zI0A2bj-iN9QDA/o.jpg"
      },
      {
        "img_id": "0UcxMcAX7SeGXvSxmEJG0w",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Wrap and soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0UcxMcAX7SeGXvSxmEJG0w/o.jpg"
      }
    ],
    "user_id": "9V-S12NTkhXc5goGN5Dfbg"
  },
  "p-fP4VVm4wdZj0eJJae5NQ": {
    "date": "5/6/2019",
    "text": "I love Viva Chicken but I would never recommend this location. The service was terrible and besides that the serving portions were not the same as of what the other locations usually serve. The plates didn't took presentable nor appetizing to me. Received three chunks of undercooked steak (normally sliced) and really salty rice.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p2TO5pleMcTN0nVogrwHug",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. I got 3 chunks of undercooked steak. Usually served sliced.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p2TO5pleMcTN0nVogrwHug/o.jpg"
      },
      {
        "img_id": "YanmkuFIhggnh0-Sz4zvlA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Almost seemed as the last bit of rice left on the pan was served to me since it was not the full normal portion.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YanmkuFIhggnh0-Sz4zvlA/o.jpg"
      }
    ],
    "user_id": "OYWiwPJfZ-qzvBw3JXx-Qg"
  },
  "QjS2rhsfBH_Fdpp1Cpd5Lw": {
    "date": "1/29/2019",
    "text": "Viva Chicken is an awesome way to mix up the fast-casual industry with Peruvian cuisine!   I came here for a takeout weekday lunch. I stood in line for a minute or two and made my order with a very friendly cashier who helped me pick my meal. I went with the $8.95 1/4 chicken + 2 sides (green beans and plantains). The chicken was certainly fall-off-the-bone delicious and juicy. I could have used a little more spice, but I understand you have to appeal to the masses. I also really enjoyed the green beans, which did have a nice spicy/vinegary taste to them. I'm slowly realizing I don't personally love plantains, but these were probably the best I've ever had. They were ripe and lightly fried, which made a great dessert for me.   Getting take out took a few minutes of waiting, so I'd probably order ahead next time. The takeout was boxed correctly and came with all the necessary utensils. I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2gZZNANbEt6bx8nPNWGcuw"
  },
  "q_tR6sTu2O8y-oaQ3k24GA": {
    "date": "7/17/2019",
    "text": "Good food but dreadfully noisy restaurant. Every voice and clanging pot or pan echoes around the room. Real headache!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_LAJMejurMfW436LIrvfDA"
  },
  "JotLDP2MDPQdOdTeEfmtnQ": {
    "date": "12/17/2018",
    "text": "Fresh, fast and flavorful. I got a tacu bowl with chicken and Sam had the half rotisserie chicken with solterito (spicy corn and edamame salad) and plantains. Also had a guava juice. My bowl was a little plain but they have three in-house hot sauces in the back! The medium was perfect for me.  It's a great spot for a quick lunch that won't leave you feeling icky afterward.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KMCDQOEt_1AiWOUVpWzyKw",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KMCDQOEt_1AiWOUVpWzyKw/o.jpg"
      }
    ],
    "user_id": "LvZ--kzma9nOyTUz2ZHRkg"
  },
  "II3aF17eB65jGWV7Q6sHdw": {
    "date": "3/17/2018",
    "text": "Just call me Dez Bryant because this food will make you slap your mama!   Best fries in the game right now. Like before we get to anything else let's give credit to the fries. And I had to get used to them not having ketchup. They have 3 different original sauces that I had to get used to. All the sauces are very good though.  I love the wraps. You can't go wrong with The Great or the Inca wrap. The secret is to add some chicken or bacon to it. Then you gotta dab it in one of the sauces before each bite. That gives you maximum flavor to bite ratio. I know this because I am a scientist.  Are you watching the NBC hit dram \"This Is Us\" yet? You totally should. I know that it has a reputation for making people cry but it's not a sad show. It's an emotional show. But we can all use a good cry. Don't bottle your emotions up inside. It's not healthy.   And maybe you'll get to see the awesome acting of Sterling K Brown or Mandy Moore. Is that so bad? What do you have against great acting performances that make you feel something? Is that not the whole point of acting?   Just take my word for it. Watch \"This Is Us\" and get back to me. You'll thank me later.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "mnwMSdpzlokyUm5CAAfLMg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mnwMSdpzlokyUm5CAAfLMg/o.jpg"
      },
      {
        "img_id": "hj0On4-iH3FHDYJH8keDvQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hj0On4-iH3FHDYJH8keDvQ/o.jpg"
      },
      {
        "img_id": "lQbc2sDFtiOYKzyOFFknhQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Incan Wrap with fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lQbc2sDFtiOYKzyOFFknhQ/o.jpg"
      }
    ],
    "user_id": "KUZ8w538GlVDrfrmex2zhw"
  },
  "j204vaYGrzi4YJS9tleAfg": {
    "date": "7/19/2019",
    "text": "4500 Park Rd   Viva chicken is a place that I go somewhat regularly for a healthy version of chicken for lunch and also for dinner sometimes. I generally recommend the restaurant for a quick bite with delicious flavors and this day was no exception. I went just last week for a take-out order and there was a bit of confusion at the registers because they had just begun a new rewards program. To participate in the program, you download the Viva chicken app to your phone then you will get different perks and rewards throughout the year on your birthday and other special times. On this specific day, if you downloaded the app then you would get 15% off your order.   I downloaded the app and got the 15% off my order which was a nice treat because with the discount that I received it enabled me to place a larger order for about the same cost. Usually I order a 1/4 roasted chicken with 2 sides but I was able to order 1/2 chicken this time for just about the same price. (Some for now and some for later).  I was very pleased with the immediate reward and potential for more savings down the road.  Additionally, the manager made sure to try to keep the line moving that day so the wait was not extended and my food was delicious as usual. I will use this reward program and receive more perks throughout the year.  Way to go VIVA CHICKEN!  Yet another reason to frequent your great restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pfj7GhZntsC7zQRJoRQmwQ"
  },
  "5RvwnU5Ts6GLK6YRuSnfPw": {
    "date": "11/1/2018",
    "text": "Always a staple when I visit Charlotte! All the hype is True.. they really do have the best chicken! My favorite (pictured) is the stuffed avocado with quinoa + shredded chicken! Can't go wrong with topping the meal off with some of the yummy sweet potato fries!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZTB93Q-idUS2qNYoMP1Ixw",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZTB93Q-idUS2qNYoMP1Ixw/o.jpg"
      }
    ],
    "user_id": "IbSoU9uuNd0dNxfcw90Grg"
  },
  "XhupHZ6Txb9uESdwB4S6_g": {
    "date": "6/28/2019",
    "text": "I'm still new to Peruvian food and this is my 2nd visit to Viva Chicken; I'm impression with Park Rd. location and the Tacu bowl is my new GO-TO lunch meal.  I do wish I could opt for dark meat chicken..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xPZ6D5zDj7YOuGIrZhnW6w"
  },
  "TaXBxVyYY8bxo71OOinOow": {
    "date": "10/26/2018",
    "text": "Awesome,  hands down nothing else to say. Lol, just kidding. Today I had The Works In a  wrap and it was filling and delicious. My side was chicken soup which I didnt get to eat cause I was full from the wrap.  I also tried one of their signature drinks (Passion Fruit) and that was good also.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P5w9Vc8KrnA4EIfE9tDdUA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. The works wrap and Chicken Soup. Passion Fruit (Drink)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P5w9Vc8KrnA4EIfE9tDdUA/o.jpg"
      }
    ],
    "user_id": "Hf1dov8HZLiXvfrxIeTZVw"
  },
  "Q4Gc1iGv55yp07buSobaNw": {
    "date": "10/21/2018",
    "text": "This place has become a favorite for my son and I! The smell slaps you in the face as you approach the door but it's a slap that you actually don't mind lol. My son loves the kids meal. Usually he will get the rotisserie or pulled chicken with fries. I've had their quinoa stuffed avocados and they are so good! For some reason I thought it would be served warm but it's categorized as a salad. This  particular time I opted for the chicken Inca wrap and sweet potato fries. I can't resist sweet potato fries. The wrap was amazing! I loved the cut pieces of avocado! The food there just taste really fresh and I can tell why it's always a nice sized crowd there. Must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v_swX8KNd3Fzz_ZAWhO3ig",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v_swX8KNd3Fzz_ZAWhO3ig/o.jpg"
      },
      {
        "img_id": "GELNgyBHFBmXKceo1zQlYA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GELNgyBHFBmXKceo1zQlYA/o.jpg"
      }
    ],
    "user_id": "Gaab6xMGUrKKxsW9tK-VKQ"
  },
  "LGBQRWR6hPyYtsMd4lb1Iw": {
    "date": "9/26/2017",
    "text": "The chicken is always delicious, the sides and sauces are excellent.  Plus the staff is super helpful and friendly.  Always a great experience",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8q5mg9bWe4A6wWuflL_dOQ"
  },
  "5uR9sKaA3YJksDeEyQqZgg": {
    "date": "4/14/2017",
    "text": "I love Viva Chicken! It's one of my favorite places to eat :-) I usually get the Tacu bowl, but this time I tried the new pork sandwich with sweet potato fries. It was amazing! The ciabatta bread was very fresh and the pork was tender and juicy. The daikon radish gave it a great texture and it had a generous amount of cilantro, which I love! The sweet potato fries were perfect too. Usually sweet potato fries are soggy but these were perfectly crisp. I will definitely order that again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PLJCPz4C0W6lLNn847I2pQ"
  },
  "NHwMM0j8vgK-_utncSd-ig": {
    "date": "6/4/2017",
    "text": "Super mundane and kind of boring. We went based on reviews and recommendations but there are a thousand better places to eat in Charlotte.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YJJQP7ic2mfLg1zMQzvikg"
  },
  "A7dzJBziDgShbStAjnOxCg": {
    "date": "7/30/2017",
    "text": "One of my favorite takeout spots in Charlotte.  The chicken is always moist, the sauces are good, and the rice with vegetables is light and refreshing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "phJ5j8RjQMmn0kEv3WGDVQ"
  },
  "M-oaW2tfCsoWsQZ8SNJP7A": {
    "date": "6/10/2017",
    "text": "not sure all the hype  believe me it was busy when i went to the counter to order and tell the girl it was my first time there and i was interest in some recommendations she could have cared less!  reluctantly she told me a few items, i ordered and my food was super dry and honestly nothing special",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkzcgyqrhGP-VNfh4gxG1Q"
  },
  "8KCNUL6kNLsp7_2s17KUgA": {
    "date": "10/9/2017",
    "text": "The staff is friendly, place is clean and food is amazing - the managers are helpful and polite. My favorite is the stuffed avocado chicken quinoa salad - I have to get it at least once a wk.  make sure you get the passion fruit drink too - it's amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rl4RPB_Jm343W-z49Inqpg"
  },
  "7p4xrE8ii9dOuEB26_0hlQ": {
    "date": "4/14/2017",
    "text": "This is not another review to sing the praises of VC.  I wanted to share 2 hacks if you were going to order the Andina Power food salad (and I suggest you do)  First- if you order the salad with Rotisserie chicken, the portions are huge and you could easily get 2 meals out of a $9 salad.  Not bad.  Second- if you are a vegan ( yes we know, you're vegan) order to-go with the quinoa on the side and they fill up the bowl with the hole left where the quinoa normally is.  Mostly lettuce but with a good distribution of toppings as well.    Hope this helps!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LbuLBqbc3SOntKK_ERGWFQ"
  },
  "5gkEkATYHVyh3Z4s90l_TA": {
    "date": "9/28/2017",
    "text": "I work for a large financial firm in Charlotte and Viva Chicken on Park Road catered our lunch for 40 employees and executives last week.  I admit, I was a little nervous about using them for the first time to cater such an important event but they came thru like champs!  They were on time, set up the service beautifully, provided plenty of utensils and sauces, and the food itself was really tasty and plentiful.  I heard so much positive feedback from my team. Most had never had VC before but they've already told me to add them to our unofficial list of preferred caterers.  Fyi, we had the quarter chicken, cilantro rice, canary beans, house salad and passion fruit juice.  Yummy!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pi_pjp0VAokBL9kxwoVEAQ"
  },
  "C9i6Wr6hgJBwvJNsSWj8fA": {
    "date": "3/11/2017",
    "text": "This place is nothing but hype.  My wife and I tried lunch here recently, and other than a few interesting sauces, it has to rank as the most overpriced chicken dinner I've ever eaten.  Two chicken dinners for $27 sets a new record of obscene pricing.    A much better chicken dinner is available just around the corner at the Roasting Company at much more down to earth pricing.  They have a larger selection of entrees and sides too.  The food isn't bad, but it isn't spectacular either, at least to the extent they charge for it.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4I-ROnLsUqLkM4i0ag1w0g"
  },
  "R5jSpvPv8qSDdcs2TST-LQ": {
    "date": "7/31/2017",
    "text": "Viva Chicken catering on Park Road is absolutely wonderful. My company orders catering often and we have officially added Viva Chicken to the list. Kate the catering manager is a delight to work with. Our company was pleased with the service and LOVED the food. We highly recommend Viva Chicken!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RFF7zghssWqeo5Y0HFMtFw"
  },
  "Ds-jLFd6hYBh6teghtCN3g": {
    "date": "10/19/2017",
    "text": "Slow. What is the joint of the promised ready time when its 15-30 minutes off? Online ordering is pointless",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "02mVEQoHlVUmRCu1xSnB-g"
  },
  "OJ-ufIVxguySnyaXOdZe_w": {
    "date": "12/29/2016",
    "text": "Chicken was marvelous, juicy, tender, and with a lot of flavor! Great job! The sangaria was fine too.  But the chicha something taste is special. Not my thing.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xStojLx_taJ_49bD1z9YQw"
  },
  "oL5LEx66ywBWnhBKV5zf5A": {
    "date": "5/4/2017",
    "text": "I loooove the place! They are super friendly and helpful! Never left the place without being happy.  Dogs are allowed on the patio!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PUEYOkvq2Ai6V6t7bw_17Q"
  },
  "gxKs9JfzJ9yRFUNukY8ZCA": {
    "date": "12/2/2016",
    "text": "Great food and reasonably priced. All of the staff we encountered were very sweet. They genuinely listened and were patient. The only issue I had was the music was a little loud. Other than that it is a great place to go.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SDGqGMWYHPBJf9ROWSynCQ"
  },
  "TQ1sqW860mJSuUeSghOe3w": {
    "date": "5/10/2017",
    "text": "Huge portions.  Great flavor!!  Nice staff.  Patio seating available.  This location gets super crowded but they move fast.  Consider ordering online/via phone for faster service.  Limited parking. Wish they stayed open later than 9 pm, especially on weekends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQYg8Gr1KSi57w0hjAFgsA"
  },
  "PduNC-iR-QMv4lLhALGMTg": {
    "date": "5/8/2017",
    "text": "Love this place. Great quality for a great price. Get the whole chicken and share it with the whole family. Personally I love the Peruvian salad, it is a corn and bean salad with onions, peppers, and cilantro. Delicious and fresh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YmSMOB9MW73yi3MhO_vy1Q"
  },
  "5xUtq1deAzmj9WNXnJ-_8Q": {
    "date": "8/14/2017",
    "text": "The Great wrap and the stuffed avocado are my favorites. Try all the sauces. They are spicy but not so spicy your mouth hurts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z7BdRScC2Ld24fH0bEFV1A"
  },
  "hwpWR8KLQF_YUlUDUCz4DA": {
    "date": "4/25/2017",
    "text": "So delicious every time.  My favorite and go-to is the quinoa stuffed avocado with chicken with a side of plantains.  But every thing I have had off of their menu is great!  And I cannot say enough about their french fries.  Maybe the best in Charlotte.  Seriously, I could eat the whole basket of them - perfectly crispy and hot on the outside but still soft on the inside.  Service is always great and food comes out quickly, even when very busy at lunch time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gMdTYkgXy10cy-2m-qnGcA"
  },
  "kk1IEUG8i3oTuAa5Lx0B6g": {
    "date": "12/12/2016",
    "text": "Let me start by saying I love Viva Chicken (and here it comes) BUT I had a pretty poor experience here on Friday 12/9.  I ordered a Caesar with chicken and a friend ordered the stuffed avocados, no chicken.  We end up having food brought out that was incorrect for both of us, two employees came out at separate times to ask again for what we ordered and it was eventually brought out just for me to notice I still didn't get chicken on my salad.  I hated asking the guy for the chicken but it is what it is and it was eventually all corrected and the manager brought out a juice for each of us.  Nice gesture, just 20 minutes that had I been with someone else could've felt like an eternity! Anyways, I'll obviously keep going!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "481-Q11158RLVrF4WMQQlw"
  },
  "WLbAE_SNT0GCEYLk95Mhog": {
    "date": "12/10/2016",
    "text": "Delicious food; clean, friendly environment; and sustainable products. What more can you ask for?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ozjf5v20rWi2Qhf8byxJlA"
  },
  "G26HPL7AtsKn2ccziC4HjQ": {
    "date": "6/13/2017",
    "text": "This place is awesome for lunch or a quick dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5IMFlMJa8y5IVuXX-53nGw"
  },
  "gnvQkQDgkQw3WxZshhNf5A": {
    "date": "7/8/2017",
    "text": "You can feed a family of 4 for $25!!!!! Every item on the menu is packed with flavor and the fries are really the best in Charlotte. It is good enough to reheat in a convection oven and taste as good as when they first made it. The solterito took me by suprise because the corn is 3x the size of a regular corn kernel! The mint limeade is awesome and has a little kick to it. I absolutely love the cilantro lime rice and next time I will double the order. The side salad that comes with the family meal is huge! The sauces they have are super good and I pretty much douse my food with it.   The staff is very attentive and they work efficiently. Great job by management. They are always looking to make sure a table is spotless and quickly, too.    Viva chicken is the Chipotle of chicken joints!!!!!!!I LOVE THIS PLACE!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TahdAmelmlCBsSDeDTWOhA"
  },
  "YxbdXz1JCl_pli1G9N6o-w": {
    "date": "6/17/2017",
    "text": "Just had the best chicken in Charlotte. We ordered the whole chicken with 3 sides : cilantro rice, green beans, fries. These were truly the best fries in town. I only tried the yellow and green sauce and everything had plenty of flavor and spice. Service was fast and courteous . The lady at the counter boasted about the fries and she was right . I loved the limeade and my significant other loved the passion fruit drink. For $25 it fed a family of 4 generously. This is the Chipotle of chicken joints. We will be coming back here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qSu-OYmEGw88s-NjVFDq1Q",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qSu-OYmEGw88s-NjVFDq1Q/o.jpg"
      },
      {
        "img_id": "pf-c2irIpkzbf-PhXpRvTA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pf-c2irIpkzbf-PhXpRvTA/o.jpg"
      }
    ],
    "user_id": "Sqb_-ON9i90kcNFYqj2nDA"
  },
  "lto_4BzPujrGSeHB1sjBvQ": {
    "date": "2/6/2018",
    "text": "Customer service is PHENOMENAL. The bus guy is so so so nice. He's so positive, full of energy and genuine. Literally make my day and meal so much better every time.   Everything is good here. The juice and the green sauce is a MUST. I come here when I want to be healthy (wanting chick fil a)  but not too healthy (salad is too plain) lol  P/s:The location in uptown near CPCC offer student discount.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5sCA9lfZJbyuoy3amyHoxQ"
  },
  "AC5QRqLU_-zoJ0srKFJALw": {
    "date": "1/3/2018",
    "text": "Absolute winner winner chicken dinner, or lunch, or take out. Viva is delicious with from scratch sauces that allow you to customize every visit. The chicken is the best rotisserie you'll find. Looks fast casual but way way more and better. Wish I lived closer because this would be a weekly staple.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bycpg09uwbAO4eKe-lzpWw"
  },
  "rw5Z3be7BIs9ZPIwoVFNcg": {
    "date": "12/5/2016",
    "text": "It was very nice chicken place, staff was friendly, place was clean, food was okay. I would recommend people trying out this establishment at least if they have never been.  However, it wasn't for me.  Everything about the place was good, but for mine own taste, the chicken and sauces were pretty plain and ordinary.  I got 1/2 chicken meal and it didn't fill me up. Also, the sweet potato fires and rice were very plain and dry. Also, I didn't see what was so special about the sauces that the offered at the bar.  It was ok, just not great.  People should definitely go and try it out for themselves. But its not for me.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "c-1biwACMAHTD4AtOlWnpQ"
  },
  "eRxC-Sfg2fWx5cAJWbORGQ": {
    "date": "7/25/2018",
    "text": "Loved the Peruvian rotisserie chicken, rice, sauce (yum!), and plantains (more yum!). Quick & easy lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rITV0jp-ZUNuPnQDZF3iPw"
  },
  "4uJLfRYbxbz_Jjcb02vzrA": {
    "date": "8/19/2018",
    "text": "I came into Viva chicken park road during I guess their shift change because it seemed a little busy, however I still received great service from my cashier Giordan as well as friendly service from other staff like the manager justin and team members Miriam and Susan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5GJoL0EBZ6xeiJ3ED0VB3A"
  },
  "WtEMJu_PnBT5WgW0wXQRvw": {
    "date": "10/22/2017",
    "text": "Great place! Great food! Great customer service! Especially that one guy named Dennis. Was refilling our drinks and cleaned up our table. Very outgoing staff! Would highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IvMhQtKFMoepQhVl_HHeNg"
  },
  "ow5fLsG0BmMxuTxTarD5ig": {
    "date": "3/17/2017",
    "text": "DELICIOUS FOOD. Extremely fresh, tasty and amazing service.   Must try the veggie food, it's soo good.   The juices are extremely refreshing and their tres leches cake, to die for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1-ErL2VpEIpnWnPBS-PqDA"
  },
  "88S4xH-a7ZIkcWBbNSIavQ": {
    "date": "10/10/2016",
    "text": "I was already a Viva Chicken fan so I'm elated that they opened this location near my home. I took my rather picky husband tonight to introduce him and he absolutely loved the chicken. I'm a vegetarian and I think a lot of people would be surprised that a large majority of the menu is actually veggie! Plus the menu is marked making it super easy. Any place that can satisfy both our extreme tastes gets 5 stars!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "e0sZM-NMH9UYfWMQrtrGwQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. My vegetarian Inca Wrap! I could only finish half. Guess who has lunch for tomorrow? Yay me!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e0sZM-NMH9UYfWMQrtrGwQ/o.jpg"
      },
      {
        "img_id": "3_hN3I6W-YVi9mbSCYXDUA",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Yucca. Yessa! These are amazing. Perfect for dipping in the spicy tasty sauces!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3_hN3I6W-YVi9mbSCYXDUA/o.jpg"
      },
      {
        "img_id": "o879TuHpOCP9Ho-ua0pUzQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. My hubbies chicken and fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o879TuHpOCP9Ho-ua0pUzQ/o.jpg"
      }
    ],
    "user_id": "nRtwjjGiHzXfhxNwG1Zowg"
  },
  "jURKjOGOjpI2IPtCKat0kg": {
    "date": "1/1/2017",
    "text": "So I needed to update my review ... The last time I came I enjoyed it okay but wanted to try it one more time with more of an open mind. This place is hyped up so much and I couldn't understand why ...Well now I do. I ordered my food on the phone for pickup. Food was ready when I got there I'm less than 10 minutes. The service was excellent and everyone was friendly. For me that goes a long way. I got the kids meal with pulled chicken and cilantro rice. Excellent choice. It even comes with a drink including the speciality drinks. I appreciate that! Don't limit me to fountain drinks I'm here because I want to try what makes you stand out. They allowed me to sample them which was great. My favorite was the purple one...It has a hint of cinnamon ... Very appropriate for the winter. And the food was just enough ! If you are not super hungry you will do good with the kids meal. I had a little leftover. My favorite sauce is the orange and yellow I mixed it all in the rice and chicken. Delicious!!!!!!!!! It was so fresh and flavorful but beware as the sauce can be a little spicy which I like.  So although I was trying not to join the hype of this place I have . Nothing beats excellent service and excellent food with a good price. Try them out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YIgTczLx2A4ngDm88Ud_9A",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. With my sauce mixes in my kids meal to go order",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YIgTczLx2A4ngDm88Ud_9A/o.jpg"
      },
      {
        "img_id": "SiApmfjOhRv7jW9btaB98Q",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. The cinnamon drink. Delish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SiApmfjOhRv7jW9btaB98Q/o.jpg"
      },
      {
        "img_id": "MPK4tBhzYd-uE2M53vITHg",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. My kids meal to go order",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MPK4tBhzYd-uE2M53vITHg/o.jpg"
      }
    ],
    "user_id": "jdcOF4skk75rjefgKBPIyQ"
  },
  "BQT0Ipto5SbZk-QivswP_g": {
    "date": "11/27/2016",
    "text": "I can not stop eating Viva Chicken. It's the best food in this world. The stir fry rice is my absolute favorite for lunch but their hot sauce is to die for.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QDgIIQCe89OOsqbMvzqHgQ",
        "caption": "Photo of Viva Chicken - Charlotte, NC, United States. Love this food. Love that they care about the environment.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QDgIIQCe89OOsqbMvzqHgQ/o.jpg"
      }
    ],
    "user_id": "vU4KMhfxiF0arr2i7iE82w"
  },
  "qrUpH_m-gwBLIJZjtIqd8g": {
    "date": "8/4/2018",
    "text": "Here for a business trip and ordered this for them. EVERYONE loved it, including me! They need to move Viva Chicken on down to TN. Loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D_UglyinxZZlnFiSEzICGg"
  },
  "nJG5_NzLpC7sLBvBtM-srA": {
    "date": "9/1/2017",
    "text": "First time, loved it. Chicken is flavorful and all the different sauces are delicious and worth trying. Saw lots of delicious looking food going by as well, will be back to try some other dishes. Had Caesar salad with chicken.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "K7ik2pKLrPOu9kBZgGQnKg"
  },
  "ahkS6LC5c8oXz5MmyaYZqQ": {
    "date": "7/1/2018",
    "text": "Good Salvadorian Food. Always clean. 1/4 chicken and salad are my favorites with plantain. If you want a super-sized serving, their rice with choice of chicken or steak is cooked to perfection. Good job.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ysg73fAEpriKndtiMQpnWQ"
  },
  "xMirse_yljweiXOUl7XFMQ": {
    "date": "12/29/2017",
    "text": "I cannot say enough good thinks about this place.  The food and service is amazing.   The staff is always so friendly and helpful and the quality is consistent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7B2_k6AcPI3i7JT0uHsbA"
  },
  "AgxGZ8T7h6dT28j8P_rW9A": {
    "date": "6/8/2017",
    "text": "Aight check this out! I'm about to tell some mad truth so listen up....story goes like this: The other night I'm driving home from the mall, getting some new swag. Thought to myself \"hmm I'm hungry. I need something delicious, fast and healthy - VIVVVAAAA.\" I call in the order - 1/2 chicken with green beans and salad. Show up 7 minutes later, 8:58pm to be exact. They're closing...dang it, now I'm \"that guy\" calling in at closing wanting my food which technically will take longer to prepare than they have to close up, whoops. I thought they closed at 10pm and will not make that mistake again as no one wants to be \"that guy.\" Anywayyy I get my food, the essential delicious sauce, one of each of course, and head home. Wooooo hoooo hot Viva next to me, driving extra careful, precious cargo ya know, smell just tempting me, and knowing I'm only 5 minutes away from flava town. I get home open the bag and lay out the spread - oooo yeaaa I said in my Macho Man Randy Savage voice. BUT this is where stuff gets real....ready for this bullcrap (language I know, but i was upset).... in the bag was one of the most amazing dishes Viva has - ARROZ CHAUFA. Problem with this? My out of shape @$$ is eating low carb, hence the chicken and no carbs in the order. I was HANGRY! Dang you Viva you let me down. So I went to the website and told them in a polite way that i received the wrong food.   I went on to eat my delicious green beans and salad, but this carnivore needed some meat so I picked out all the chicken in my arroz chaufa. Exactly 12 minutes later I get an email notification from Viva and I think to myself \"I'm not talking to you,\" I'm still upset that i'm eating the equivalent to Tweetie bird when I really wanted Foghorn Leghorn. I look at the email anyway and was stunned - the email was from the general manager. THE. GENERAL. MANAGER and not some automated nonsense reply, but an actual concerned response. I'll skip over the unimportant details of email here and there and get to the point of this 5 star review: Those awesome employees over at Viva actually gave me the correct items and I had ordered the wrong thing. I explained this over email and admitted my mistake to the general manager. Not only was he extremely helpful, polite, professional, personal, he made me love Viva that much more because of his professionalism and expectation of excellence. Needless to say I felt like an idiot, but I love Viva that much more. My only suggestion is to eat carbs and make good decisions...which eating at Viva is ALWAYS a good decision.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "otMUh4JdTmhMuQ016cdR6Q"
  },
  "QSbh-jxr57daawMZDYQg6w": {
    "date": "5/16/2018",
    "text": "I eat here basically every day so I figured I should give it a review. Everything is delicious. The serrana cobb salad is my go to. the Lime vinaigrette is AWESOME.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OWVNQl6rgou9rAAHAm4sSQ"
  },
  "AYESYR_PR9PYf3WUcN-2fA": {
    "date": "9/26/2017",
    "text": "This location is closer to me, but I got sick the one time I came here. Had the 1/4 white chicken meal.  Maybe it was a fluke, but have eaten at two other locations with no issues.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6tlC85J2zsHpnrtHp3qX6Q"
  }
}