{
  "ZJCVtCyn14Va762Hh9EZog": {
    "date": "2/6/2012",
    "text": "It's great to see another Crisp location...this one tucked away in Dilworth next to Charlotte Running Company.   If you like fresh salads and sandwiches, then you'll likely dig Crisp. The setup is similar to the 7th St spot..walk up to the pristine counter and place your order. The friendly employee will call out to have your choice of protein created while he/she fixes up your salad. The interior is low key and slick, albeit smaller than the other location. Regardless, the food comes out super quickly and, of course, freshly!   I favor the Cobb salad as well as the Asian Shrimp salad. The Cobb is full of flavor and that dressing is to die for. While the Asian Shrimp salad is stuffed with plenty of fresh baby spinach, tasty grilled shrimp, Chinese noodles and such, the soy ginger dressing is pretty weak.   Also, if you see brownies near the register...grab one! They are fan-freakin'-tastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "qlC607Cyp0Mj91vDFvkp3Q"
  },
  "_0wle0rMB7RUdHIVTMS5jA": {
    "date": "10/8/2012",
    "text": "I stop in here about once a week for a salad for lunch. I almost always get the FCN (Fruit, cheese, nut). I stop here so often because the salads are always fresh, the service is always friendly and quick, and I don't have to wait.   Keep it up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ic9iN1AGx9_phF_DOcn_Zw"
  },
  "h-Xu3t8DPaq8lwxpZlsPzQ": {
    "date": "4/22/2013",
    "text": "Crisp is solid. My issue with paying $10 for a salad is it is something that I can make at home with fresh produce for half the price. But, something always seems a bit more delicious when someone else makes it for you, am I right?  I have been to the Elizabeth location a couple times for carry out, this was my first trip to the Dilworth location. It was packed with the lunch rush, but the line moved pretty quickly and we were able to cram into a table to eat lunch. I do like the build your own option, but I do agree with previous reviewers that the toppings are pretty standard and nothing out of the ordinary. They generally seem fresh (except a funky taste to my apple slices today). I got the flank steak on top, which was cooked to the temperature I ordered (hooray!). So I do like that the meat is not pre cooked and it is something that they do when you ask for it.  I also like the portion, it is HUGE and I get at least 2 servings (if not three if I'm taking the side salad approach) so that is sometimes how I can justify a $10.   Not a place that I will go to all the time, but definitely a reliable stand by when I crave a salad and am too lazy to make it myself.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "17qZxRhTcp_JSnEg65COkA"
  },
  "mB_rP979ndMZ2upggujwog": {
    "date": "12/30/2011",
    "text": "A fresh, healthy salad from Crisp is just what the doctor ordered for those \"oh my God I've been eating cheesecake for breakfast, lunch, and dinner for a week\" moments.  Don't pretend like you don't know what I'm talking about...  Both locations are identical in taste and quality.  The service is super quick and friendly.  You can create your own salad with a choice of lettuce, protein, and 5 toppings.  Several of the salads that are on the menu I really enjoy.  The grilled salmon with pesto drizzle is outstanding.  I also enjoy the BBQ chicken salad if I'm feeling crazy.  I've never had any of the sandwiches or pizzas, but I can almost bet they are pretty great!    The 7th Street location is more spacious but the food in my opinion is the same!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "Oz1Tz4LUlLw_UAgEkUiCvw"
  },
  "CKU3pHrdErbSU7wKixp64Q": {
    "date": "8/7/2015",
    "text": "Tasty, healthy and fairly quick. Love the variety offered for the salads and the chophouse sandwich was simple and well prepared.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7cPj-qJnGdQiA7eTy4msuQ"
  },
  "KoAT6KeNBbMtUdT6IDftNQ": {
    "date": "10/21/2015",
    "text": "I had a terrible experience at Crisp. I ordered a small salad and they rang me up for a large salad, which was not a big deal at all. I waited for awhile while they figured out how to refund me and at the end the cashier said not to worry about the cost since I had to wait so long. I walked away thinking \"wow what great service\". While eating my salad the assistant manager interrupted me mid conversation and accused me of not paying for my meal. I told her that her employee told me it was on the house because of their error. She proceeded to rudely tell me \"it's not that big of a deal\", so to avoid the embarrassment I gave her my card. She then interrupted me again to sign the receipt. I've never had such poor customer service before. IT was not about the money at all, but more about her accusing me and being so rude. I will not be returning to Crisp Dilworth.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "2GM_KKU7G9uGqOvIq2RfXg"
  },
  "5eKdVk2tXJXe3jkd29HnWg": {
    "date": "4/15/2013",
    "text": "Been here a few times now, quality is inconsistent.    1st time, Wednesday lunch {( 4 star )}  I had the steak salad - one of the best salads I've ever had.  Got me to come back. Crostini was meh.  But who cares, I was paying for a great salad!  =======================  2nd time was a Sunday at lunch... {( 3 star )}  This time I had the salmon salad.  Not so lucky. Salmon was cooked well (needed salt) but the flavors didn't go we'll together.  The kalamata olives are good but overpowered the fish.   The dressing was oilier than flavorful which was a turn off. I won't be getting the salmon again but will be back to try a shrimp and chicken dish.   Now, my wife (vegetarian) on the other hand got the acropolis (Greek salad) and loved it.  She already has her next 4 meals here planned.   The salad prep guy needs a little better memory; he had to ask me and my wife twice (each), only about 45 seconds apart.   He was a little hard to hear, had to ask him to repeat himself.   Friendly enough service, a little reserved.   =======================  3rd time, not as good as previous visits {( 2 star... :(  )}  Chicken was bland (like another user experienced) and was closer to fast-food quality.  Dressing wasn't mixed well again - to the point I decided to say something.  The cashier got me more dressing but had shaken the dressing bottle well - it was much better then.  Not sure why a cashier could do it properly when the line \"chef\" wouldn't.     I'll go back to try the shrimp or if my wife wants to go, but the last two visits haven't been impressive.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vTDIfVV-JFfyc6XZMkpk-g"
  },
  "jfPM3h8F4P30A4YL4hkM0Q": {
    "date": "3/23/2015",
    "text": "First time here and it was fantastic.  I ordered the Bar-B-que chicken salad and then added some additional toppings.  I will be back often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F4s-5a-wCCoP5FsPJEK80g"
  },
  "iW-KycIxIPdmrn9kvm9saA": {
    "date": "3/5/2012",
    "text": "Loving a Crisp location in Dilworth!  I've already been twice, and loved each visit- great fresh ingredients for my 'build my own' salad, and the Chicken Bruschetta wrap was DELISH!  Its a great option for a quick and healthy lunch/dinner option, and the portions are large- one salad feeds me a dinner and lunch the next day! Friendly service, clean and a great location.  I will be back for sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ajJP1GNrF8vmNvoTQyRjGQ"
  },
  "izitnP3X6-2VDRy62N-A3g": {
    "date": "4/12/2012",
    "text": "I'm impressed and I'll be back. :) I pass Crisp on a regular basis and decided to stop in for a late lunch, a good decision! I was over whelmed by the salads on the menu and the options for building my own...so I decided to try the Akropolis salad on their menu. When I have more time I'll be back to build my own. Everything looked (and tasted) super fresh, the decor was modern and chic, and the staff were very friendly. Well done!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5TUdAmLgEs9Q_g5exummLQ"
  },
  "VP2W1HYBpBA7SEZsMfvzdw": {
    "date": "3/15/2012",
    "text": "The line was long but it went fast and I was relieved to get a large fresh salad of mixed greens and grilled chicken.  Sometimes it's hard to find such a simple thing during the lunch rush but they did a great job.  I'm glad they just moved in!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3_AdjAlMy4EJYQhuXADgA"
  },
  "VwXjQB8ckBMuKReiYpB7GQ": {
    "date": "1/28/2012",
    "text": "I love this new location of Crisp.  Easy in-and-out for take-out, or pop in for lunch.  I've been two times in the past couple weeks, and each time, the service is fast and efficient, and the order is perfectly right.   I won't bore you with the details, because this one is almost the same as the 7th street location...but I will say this for anybody who hasn't been before:   Fresh ingredients (several types of salad greens to choose from and lots of toppings), big portions (never, never do I finish a whole salad, maybe 3/4ths at best) and yes, a bit more expensive than a salad you'd get at the salad bar.  The grilled shrimp custom salad I buy is usually $12 with unsweetened iced tea...but I don't mind paying the price for the selection and freshness.  I always get an extra crisp bread to go with my salad for crunch.   Oh, and I totally agree with Stephanie K.  It's my go-to place for detoxing after a 12 course heavy meal :-) It just makes your body feel better :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "7M-rWYRGPfCDnb7tjl7QGQ"
  },
  "M9osOQ8GXQXATnASQpxBoA": {
    "date": "2/16/2014",
    "text": "Echoing a previous review: the Crisp website says they are open until 9pm every day. I showed up at 7:30 on a Sunday and they were closed. How hard is it to update their website with accurate hours? Very unlikely I'll be returning...",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DnRSTN4iPr6czGoNnzAKJw"
  },
  "9xTX1ScM3XHUIlM7EqHmIg": {
    "date": "11/4/2014",
    "text": "This place is the best! I eat here at least twice a week. I enjoy making up my own salads but have tried a few of their creations and they are so good! My faves are the BBQ chicken, Grilled Salmon, and the Steak salads. Not in the mood for salads? They also have sandwiches and daily soups... Probably my favorite place right now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hhvkQEAUxO-lSLeJo2nUSA"
  },
  "GVcs-dCDon2oH6JOggFpBQ": {
    "date": "5/17/2014",
    "text": "The atmosphere is great, a place you can truly go to alone eat and not feel like a loser. The service is good but nothing to rave about... The food is not great... They ask you how you want your steak prepared, I ask for it medium and always end up with it well done... I still come here on a semi regular basis because it's good I just wish the passion was here to make it great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "w7KmO2z2SZ3c5mG6_qKjpA"
  },
  "2U6dTg8VepSlgY4VR2Uqpw": {
    "date": "1/31/2015",
    "text": "Salad dressings could use a little kick but overall healthy good salads. Big portions. Good customer service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-xZMlNf86s5xbQx8S6vCmQ"
  },
  "ANArw_o2TwA8IK6r0tAWVQ": {
    "date": "3/20/2014",
    "text": "Delicious! My go-to for a healthy lunch since I work nearby. I've tried a sandwich and it was good, but I usually get a salad since they're so tasty. It really is fresh too. They put together your salad ingredients and grill your protein as you order. No pre-made salads here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3a1k9aAl7RNQw0dDBa5KWQ"
  },
  "ukA3VBRaRHfISmX9mYJBKA": {
    "date": "3/10/2015",
    "text": "the food was really really good. I had the Cobb salad. But the lady making my salad was rude. But the lady at the register went over and beyond.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Nlw4NMfO0erxfWrjbgmFQ"
  },
  "wbhFmYE1JSQq_gVFP4FYYw": {
    "date": "3/6/2015",
    "text": "Since this place used to be a favorite of mine,  I decided to go back and give the salad another try.  The salmon was much fresher this time.  I will go back in another week or so and update again if needed",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hBWVFM1-pROdC9QEoU3hMQ"
  },
  "VZqlUcSvZZx_i_cGpMLbPw": {
    "date": "8/11/2014",
    "text": "Great quick salad spot. Similar to sweet greens in DC or NYC. Fresh grilled steak and other ingredients make the spot awesome. This is my go to lunch spot for a healthy meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IJr1_R-MGrh0397orpOmJg"
  },
  "Pzwikp9Ls3UeemQbfJBfuw": {
    "date": "6/24/2017",
    "text": "I've been here dozens of times and the food is always great. I'm picky about salads because I hate low quality proteins(think airport chicken salads) and the protein here is always fresh and warm! I havent had the issues other reviewers have because I always do a custom salad order, so I cant speak on messed up orders. I moved to south park recently and after having crappy salads at Chopt ive started driving back to Dilworth to get Crisp.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UQT67gaadrlTdgShIHlpYg"
  },
  "n0gv4KVQnZCN8eNy7bX5Mw": {
    "date": "1/5/2016",
    "text": "My colleagues and I have frequented this place for the last several years. The quality and quantity has decreased since Chopped opened. In today's order I was without salad dressing and my boss's salad had brown edged romaine lettuce. Their salads used to be so impressively big, you couldn't finish it all. Now you can see the cardboard at the bottom of the container. Feels light for the price tag. I think my FCN literally had 2 slices of apple in it. When competition moves in you need to step up your game, not back off, in order to keep your customers. Unfortunately, we'll be frequenting the competition and not Crisp much in the future.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qQOs9v-lm7Vc6KH_0X7SOQ"
  },
  "7Vw5acv8WqgFMOveYNbvzQ": {
    "date": "1/18/2015",
    "text": "Went there on a Saturday afternoon, the cashier was not very warm  or friendly, not rude, but definitely not customer friendly. There was water spilled on the floor which someone finally went outside to a news rack got a newspaper and placed pages of newspaper on the spilled water that customers have to  cross to get to the restrooms. No mop was ever used. The floor of The dining room was quite dirty, this is not typical of this location but I will give it another try if it's like this the next time I won't go back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0zUgnCZduSjtl0he0ZPR9A",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0zUgnCZduSjtl0he0ZPR9A/o.jpg"
      },
      {
        "img_id": "X-Q1j15K9RXL7GC-1gco8g",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X-Q1j15K9RXL7GC-1gco8g/o.jpg"
      }
    ],
    "user_id": "HUeBuImP2l0mmFJbCM-4tA"
  },
  "Fl_Bc44N4k6aVLx0RC-0Hg": {
    "date": "5/3/2017",
    "text": "I have been a fan of this overall enterprise ever since they opened on 7th within the last 10 years. I watched 7th St decline, I was never as impressed with East Blvd as I was 7th St, but as 7th St declined, what options did I have? As I gently made the transition, it became increasingly more and more difficult to find East Blvd open when my tummy was growling. Ok, I became more diligent about changing my life to match their potential hours. Now, as I seem to have worked my life around their hours, sadly, the quality just STINKS! Where is my Crisp from when it began? Portion? Way smaller. Oh, I called the order in for a pick up and while the protein of my choice was not available, there is NO excuse to be out of ANY of the other items. None. If anyone has been lately, this place isn't exactly cheap -- expect to pay minimum of $10 per person. For this price, I expect better than what I've been receiving. Sadly, IMHO, it won't be long before these doors also close. So very sad, great concept, just poor execution.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1g5BZ2FHiGnSI1qD3sGHiA"
  },
  "qe2pb5xxGf7Y1nRWeJQn1g": {
    "date": "8/8/2013",
    "text": "What I love about Crisp is that the staff is pleasant and helpful every time I visit.  What is even better about this restaurant concept is that you get the type of salad you want with the items you prefer.  This makes for a pretty big salad that tastes just the way you like it!  This is exactly what I get when I visit and I love that I can experiment with different fixins'.  The process is, select a green, select a protein (chicken, shrimp, tofu...), select 5 toppings, then select your dressing.  You can't miss because it is what you make it!  They have a nice, but small selection of wine and beer is also available.  On my last visit, we enjoyed the Sangria.  We got a decanter full for $10 and it was plenty!  In addition to the good food, Crisp is typically not crowded if we go in the early evening, so there's no wait to fill your crying \"feed me\" stomach!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "7PiRdxYF-Uvzn2fHqdtU1Q"
  },
  "3_BLqmo-qHkZCqFOqs5OCQ": {
    "date": "7/17/2013",
    "text": "Love.  Huge portion.  Create your own or go with their suggestions.  BBQ chicken is my current fave.  A little on the steep side financially, but you may be able to make it into 2 meals.    The layout of the restaurant is not conducive to take out orders.  You wait in line with others, regardless of dining in or taking out, place your order, pay at the register, but then there's nowhere to sit/stand to wait for your order.  You are either standing in top of staff blocking their path to and from the kitchen, standing in front of the tea/lemonade stand, or forcing diners to stare at your butt/junk while you stand right next to their tables waiting for your food.  I'm not sure what the answer is besides removing an interior table, but we all know that's not going to fly.  I'm not sure the toasted baguette slice adds any value.  Bland.  I like it conceptually, but they can do better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ddKZervvozCcK5j6gnasJA"
  },
  "uYaXiXLhOkTLj-Li0pPVfQ": {
    "date": "11/14/2013",
    "text": "SOOO GOOD!! Delicious, hand-crafted, cooked to order & perfection!   This place is quite amazing. They have every kind of topping and combination of salad you could think of - as well as creating your own if you don't see something you like on their board.   A little on the spendy side if you're looking for a regular salad, but these are more gourmet salads - not a subway salad.  The service is very quick and friendly, you walk in and head to the counter - watch them put everything together - cook, chop & toss it all the way you want!   *Best tip about this place - the size of one salad can really feed 2 people - or take home the other half for another meal : )",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "F-TYd6eIvMIyInQrhW6oEA"
  },
  "ErVHhLR8uHE8vVDNYWbYPw": {
    "date": "3/10/2016",
    "text": "Can't say enough good things about Crisp, which is a go-to healthy spot for me.  Everything is always fresh and dependable.  Still my favorite salad joint in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aXbZWQWUR8vH9prX-XwAPg"
  },
  "8NN67sRu4DaPKd7F1oEGZQ": {
    "date": "12/14/2011",
    "text": "Crisp has had the right idea for a while - crisp (for lack of a better word) greens, fresh vegetables and other salad yummies, cooked to order proteins, and a selection of dressings you wish you had in your fridge. Want to pick out exactly what goes on your salad? No problem. Feeling less creative but still want something super tasty? Choose from the awesome menu. So opening a second location would seem kind of a no-brainer. (And thanks for putting it a stone's throw away from my house in the Outback strip... a few doors down from Thai Thai)  if you've been to the Elizabeth location think slightly smaller seating area, same earth tones inside, same menu, larger parking lot, no bar seating, no cute patio, and not as good people watching (it's kind of at an odd part of the strip).  If you've never been to Crisp, you're in for huge salad portions, some soup and sandwich options, and a fairly casual environment where you can eat and go fairly quickly or take your time and maybe eventually get to the bottom of your salad bowl.   I enjoy the atmosphere of the other Crisp more, it's a little bit more bustling, a little less sterile feeling - but this location still cranks out tasty salads and I see myself stopping in again in the near future. The only note is I don't think the employees have figured out the acoustics of the place just yet, although there were about four tables eating and conversing it all seemed to be drowned out by gossip and \"omg\"s &\"totally\"s coming from behind the counter and beyond.   Also, they update daily specials through their facebook <a href=\"/redir?url=https%3A%2F%2Fwww.facebook.com%2F%23%21%2Fpages%2FCrisp-Charlotte%2F132401990164787&s=8880d2ba58cc75af82b31a31b4c3027874b68d5be7668b441e29be01c4236584\" target=\"_blank\" rel=\"nofollow\">facebook.com/#!/pages/Cr...</a>",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nlQutaH-C01etKCkK5csoQ",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nlQutaH-C01etKCkK5csoQ/o.jpg"
      }
    ],
    "user_id": "n_zJNVFWUwyzryuFf1v9pw"
  },
  "7OZxnZ6MWL3nddOSFp9nZg": {
    "date": "4/17/2016",
    "text": "Great salads for any time of day. Fresh ingredients and good selection of protein. Solid place to eat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ysqgOPRMJ7oeGMHnAklpjw"
  },
  "tDsu5-1MkGDqenI1aTNfng": {
    "date": "3/13/2016",
    "text": "Meh. Feeling very indifferent about this place. Walked in and the employee at the counter was texting. Greeted me and told me \"I'll be with you in a second\", finished her text, and walked up to me.  Now, the food. I had the turkey sandwich with greens, Brie, and cranberry dressing. I will say, the turkey is a little thick. It also just doesn't taste good quality wise. It's rubbery and gross. Pasta salad though was amazing... so who knows... maybe I'll go there again and try something different. Not that convinced though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FiGlH7GxvgNlBvuKh-xTxQ"
  },
  "x2Cq_gKxDXGifgNzGva4mA": {
    "date": "6/24/2014",
    "text": "It's hard to do salads right in a restaurant.  Crisp understands salads and the importance of fresh ingredients.  I wanted to give 3 1/2 stars and with a few tweaks, they could make it to within striking distance of 4 stars.  My daughter and her husband took my wife and I to Crisp for lunch, so I got to check out 4 different menu items. Service was fast and the food was delivered with a smile. Only one small mix-up but not even worth mentioning here.  I had the cobb salad and it was OK. The chicken breast on top was hot and literally steaming. Very moist but not much flavor going on. A lightly seasoned boneless/skinless chicken breast doesn't bring much to the party, but it was cooked well. Lettuce was crisp and fresh and the blue cheese was very good.  The bacon was too thick and kind of hard to eat. not crisp and tender at all.  The wife had the marinated shrimp salad, and it was to me, the best thing on the table. Asian dressing was fantastic, the shrimp were flavorful and perfectly cooked. Lots of spinach, almonds, crispy noodles, red peppers and Asian pear slices.  My Daughter had the flank steak sandwich. While the bread was good and the steak was very flavorful the sandwich was lacking a certain \"zing\"  The steak was a little tough.  I know that flank steak can be tough but the way you slice it makes a lot of difference.  Son-in-Law had the BLT wrap and pasta salad. It looked great, stuffed full of bacon, lettuce and bright red tomatoes. He said it was really good, and I would probably consider trying it in the future.  The space was just OK, nothing special and it got a little crowded. The drink area is right beside where you pay and I bumped into two people getting drinks.  I would like it if they had organic options or used ingredients from local farms.  All in all Crisp is a welcome fresh alternative to most fast food lunch options and it is refreshing to have a restaurant salad at an establishment that understands how to make one.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGhgiNW1OVTRTz390q9GvA"
  },
  "gznGn0LAnvMHY_WKyNsjPw": {
    "date": "8/10/2014",
    "text": "First off....I can't believe I just got around to trying this place!!!! The staff is super friendly, they are quick/efficient, and my salad was absolutely delicious!!! Did I mention I came back the same week?!!!! A must try and I will be back soon. I ordered the FCN...new favorite salad :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TBzNcBASd-H5w0AHfcsigA",
        "caption": "Photo of Crisp - Charlotte, NC, United States. F.C.N!!!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TBzNcBASd-H5w0AHfcsigA/o.jpg"
      }
    ],
    "user_id": "4f54hzLrfbRD_YH4ufgdLA"
  },
  "e6DEOqfDkWwdZ_sIcV3mmg": {
    "date": "4/22/2017",
    "text": "When it is 10:56am, your door is open and Fresh Market is 4 steps away, telling a customer that you are 'closed' is kinda silly.... IMHO.  Think about it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RIdLkf_87slP78rF5RO5dA"
  },
  "V4hs5lGEVOaUI3R_-4NNFA": {
    "date": "5/24/2015",
    "text": "My salad was good, but the sanitation wasn't up to par. We entered from the back parking lot and the smells and sights were disgusting. Everything just seemed a little dirty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "GP4-LdzQ7XDqOo8YUc3RUA"
  },
  "vO9ch6SiNzsShn8UCtmKbw": {
    "date": "12/7/2015",
    "text": "Food is great and the service is very nice regardless of the craziness of lunch hour. The only reason for not 5 stars is long wait during lunch time. They seem to need a better system for streamlining the ordering process.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DZnPBn4-NI6t-cQr5FAqWw"
  },
  "ES6l9VvSEfo8eHi7iE7MEQ": {
    "date": "12/18/2013",
    "text": "Met a friend for lunch here- it was the first time for both of us.  They have a variety of salads and sandwiches on the menu to choose from or you can even \"make you own\" salad from an assortment of fresh looking ingredients.  I went with the F.C. N.  (fruit, cheese. nut) salad. After seeing how large it is, we decided to split one! The salad was good, loved the ingredients! They serve the salad with a piece of bread, it was very hard so I am assuming it was suppose to serve as a large crouton...?  When you walk in, you order at the front, pay, then they bring you your meal to a seat of you choice when it is ready- no waiter service here.  The staff was friendly and helpful. I'll definitely be back when I'm in the mood for a tasty salad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O-nb7z-iqeXGT1i-98HvUQ"
  },
  "gsPluzBDjzOAyZWS4wY72g": {
    "date": "9/24/2013",
    "text": "Crisp is a solid place to get a very healthy salad.  In the world of heavy meat and greasy diets, I can see myself hitting this place a couple times a week. I can't always working out as much as I like to but I know I can at least eat healthy!  It is a huge portion but it is very good for what it is. The shop is  a bit small but they do very well for the space they have.   I would make sure you know what you want BEFORE You get in line otherwise you might get passed by. I understand since this is a pretty popular place.  This place is dog friendly",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "apwx9mVErPHhQgxFnlvcjA"
  },
  "DaybX9SSFyM9znsGvhKhMg": {
    "date": "7/20/2015",
    "text": "If you're looking for something fresh and delicious in Charlotte, you have to check out Crisp. This location is hidden away in a shopping plaza off of East Blvd  in Dilworth, but if you're in the area it's worth the find. They make the salad in front of you and there are plenty of options. The grilled chicken is phenomenal. All the staff is super friendly too. Did I mention they serve wine? You really can't go wrong here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VYKQZ2c9nUekQe1y-nhNNg"
  },
  "vmXfCX2Lusi9k7DrDZtnrg": {
    "date": "11/6/2014",
    "text": "This's restaurant specializes in salads and you can chose from their array of ready designed salads or build your own. Simple, delicious and quick with ample portions. I would have given it another star, but I entered from the parking lot in back and the sights and smells of the back hallway with open doors to the storage rooms and scullery were unappetizing & kind of garbage smelling. Those doors should really be closed. Once you get past that to the dining room it looks & smells fine. I would eat here again",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9a4p9tF417vUuyP-3kIh1A"
  },
  "MdFTeyqaX-lq7gy8HyuFeQ": {
    "date": "10/17/2017",
    "text": "This place gets an A- from me. Reason being: the Tofu is good here - especially in the salads which is what I have - however it was a tad burnt. My friend got a spinach chicken wrap which he said was pretty good. Service is fairly quick. Good place for a grab and go healthy lunch. Kind of hidden away so you have to know it's there!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kI61eBL0FCX-2OL0QltuhA"
  },
  "pFeXFBWy5h-l7k5ZH6zvjw": {
    "date": "3/11/2016",
    "text": "Very underwhelming for me and my salad snob family. We ventured off to this place initially to have salad and pizza however to our dismay they only serve pizza in the evening and we were there for lunch.  The salad process was pretty unorganized as we ordered and the staff was not very enthused about working this day. I ordered salmon as my protein and it was called back into the kitchen and my husband orders chicken as his protein. We found a seat at a table near the door and with the nice weather the door was open and there were flys just a roaming which is out of the control of the restaurant so I can't fault them. It was a swatting interesting time (could've sat outside). Back to the food, my husband salad came out let's say 1:05pm ish and I sat and watched him eat and talked with him as he offered up lettuce to me since I don't eat chicken before he ventured over to the counter to inquire about my salad this inquiry happened at about 1:20pm-ish and they basically forgot about my order which was on the same ticket and as my let use got all soggy waiting on the protein to be added to them THEY still decided to quickly make the salmon and add it to the soggy lettuce which wasn't going to fly with me so they had to remake my salad including the undercooked protein.  My husband said his salad as So So and after my fiasco my salad was Ok because I was sooo hungry it was Ok but I'm sure I'll stick to Chopt as their salads are AMAZING and fresh and fast.  If ever in the area and in the mood for a salad I'll give them another go round and update my review accordingly as everyone deserves a second chance.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "XUwYlVRuyoImgtaw8Cjztg"
  },
  "m81n5rtJAcD8JHAe_qWxSw": {
    "date": "5/21/2015",
    "text": "I've enjoyed both the salmon salad and the acropolis salad with shrimp. Both were really good and fresh. However, not too impressed when I went by today and saw the sanitation score! :-/",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "77l186pVcYu2D3fVJrCQ0A",
        "caption": "Photo of Crisp - Charlotte, NC, United States. acropolis with shrimp (no onion)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/77l186pVcYu2D3fVJrCQ0A/o.jpg"
      }
    ],
    "user_id": "CHf8EbvYLUUCpQxP9_lP7A"
  },
  "fPKORHAXWJTkJWBXl9yhCQ": {
    "date": "5/23/2016",
    "text": "Not really my place for a salad. If I ever decide to give them another shot it would have to be for a sandwich. Ceaser salad was OK, but didn't seem as fresh as pictures make it seem. Bathroom area was ewww... nets flying around.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "omBigINZ1xpBrNXwH9ro3A",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/omBigINZ1xpBrNXwH9ro3A/o.jpg"
      },
      {
        "img_id": "UUC6hh2yBx-kRwIJ5QXfuw",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UUC6hh2yBx-kRwIJ5QXfuw/o.jpg"
      }
    ],
    "user_id": "NCvg_i6l01egwQ6_b_sWLA"
  },
  "V6WgZrZAz8dDO4LKTaW8Eg": {
    "date": "1/4/2017",
    "text": "What's not to love about this place.  With all the fast food and greasy food options around, its nice to have this kind of place.  Chopt is right down the road, but for the money, Crisp is the best.  I like the create your own.  Pick your greens, protein and 5 toppings.  Cant go wrong with spinach and blacken chicken.  Go wild on the toppings.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "dpyvUkvuxAgA24wXHxAbRw"
  },
  "STddlj6YavrBVQzLwFhlAQ": {
    "date": "6/23/2014",
    "text": "As much as I visit Crisp it's a wonder why I didn't update my review sooner.  This place has become by go-to lunch spot on days when I work from home and even sometimes when I have to stop home for lunch.  I've still never had a sandwich here but always stick to the salads.   The salads are tossed to order. You can select from one of their options on the menu or create your own.    The staff is great here.  Even on their craziest of days which is between 11:30 am and 1pm, the staff is friendly and willing to get your order taken care of.    My only criticism is that when you get your order to go, there is little space to sit/stand and wait.  I am usually crammed next to the drink station.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "iJ3mJ8aZ3_Pull2z_bHoXA": {
    "date": "7/6/2017",
    "text": "This is a good place to eat if you are around this area and have a craving for a salad service is good as well but this place can be very forgettable",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iVWtnR3Z-yKtzl56Ko8qSw"
  },
  "dISuW1Ud4kIOcTgX-p7q1g": {
    "date": "3/6/2016",
    "text": "I had the special of the day which was the southwest chicken wrap...all in all it was just an average wrap, not bad but not great. I got a side of pasta salad, it was mushy and bland..at least the portions were large.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xg8l0wDinU0THwgeD6HsoQ",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xg8l0wDinU0THwgeD6HsoQ/o.jpg"
      }
    ],
    "user_id": "PsrQjxG9Kh70ILKoYTa2JQ"
  },
  "7YBD0L0MM2rF_AmKI5Pvzw": {
    "date": "1/3/2015",
    "text": "Their salads that are tossed to order are fantastic! . Sauteed mushrooms, slivered almonds, bacon, feta cheese, tomatoes, & carrots topped with honey mustard dressing is my go to order. My hub likes the awesome chicken Monterey sandwich with bacon. I've ordered the cranberry turkey sandwich & that is really good also. Their sandwich orders are huge portions.  The \"crustini\" bread that comes on the salad is terrible & tastes like cardboard. They could improve it by: brushing it with Olive oil & sprinkling it with a little garlic salt & baking. Jasons deli does their garlic toast this way & it is really good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UTPMcBGpfB7nPd9sh6CPUg",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Monterrey chicken sandwich with bacon. Excellent!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UTPMcBGpfB7nPd9sh6CPUg/o.jpg"
      }
    ],
    "user_id": "F-QV5_FbMJte5fDoPaxvdA"
  },
  "HwaPWLB0-KXdNKnWrynjww": {
    "date": "8/25/2014",
    "text": "Crisp is pretty solid when you're craving a salad. They have tons of variety to choose from and ingredients to appeal to anyone. I enjoy adding crumbled blue cheese and their roasted red peppers along with steak and spinach to my salad. It is made to order so the steak takes time to cook. It's not sitting there in a container.   If you go for lunch be prepared for a huge line and difficulty finding seating. The prices are a little up there, but it's appetizing nonetheless.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dGUOe2TBchiGvU1BNkmTog"
  },
  "rcwBBXrkTM1BE7X-bryjWQ": {
    "date": "6/27/2017",
    "text": "I had an unpleasant experience with a pick-up order.  The order included 2 items. The person who picked up the order was only given 1 item. When I called I was told the other item was still at the restaurant (Information which was useless as I work 25 minutes from the location). His explanation was that the person who picked up the order asked for \" AN order\" which they interpreted as ONE item. I was never offered an apology.  I understand mistakes happen all the time, however an apology for a hungry person with a limited lunch period goes a long way. I suggest they train your employees to offer better customer service and make changes to their online ordering service so their customers aren't deprived of their meals.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7MuHop2_PUJnx8Wn8nrm3A"
  },
  "3yPw_LZT7klmO_ZUsxdT2A": {
    "date": "8/31/2013",
    "text": "I enjoyed the BLT with turkey. A large sandwich with amazingly cooked bacon & a great aioli, which added a special flavor to the sandwich. I chose the pasta salad as my side and it was god, not great. The location is great, but the inside is a little dark & quiet for my liking, but the service was nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4DJs5Ei7hhnxyS_-w8KJNQ",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Turkey BLT w/ a suds of pasta salad.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4DJs5Ei7hhnxyS_-w8KJNQ/o.jpg"
      }
    ],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "PTLP5KYy2rP0y8v6L7GNvw": {
    "date": "8/30/2015",
    "text": "Excellent salmon salad--I made my own with romaine, walnuts, feta and cranberries. Nice selection of beer & wine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CKRfBUqQGaVCYTKN5kDrzw"
  },
  "C0raDagVAbj9uYAQPORTmQ": {
    "date": "2/8/2013",
    "text": "I'm new to Charlotte and I am glad this place is a few blocks down my street.   The Flank Steak sandwich with side salad was really good. I would definitely come back to try the salads (they look tasty)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tMRAHw0F5fKBv1DczMhXjg",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Flank Steak sandwhich =amazing!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tMRAHw0F5fKBv1DczMhXjg/o.jpg"
      }
    ],
    "user_id": "3qs-_KIB9vaA8evCiir27Q"
  },
  "Cg8EUi4f_id8ZqMQw_LYUg": {
    "date": "7/22/2015",
    "text": "I enjoyed lunch today at Crisp. I had the Salmon Salad and added egg, substituting spring mix for spinach. The staff was mostly helpful; however 2 things bothered me. 1) no nutritionally information was available which was surprising considering their healthy nature of their menu. 2) the eggs were not at all correctly cooked and I'm shocked they were served the way they were. They were grossly over cooked and a very gray...I would suggest figuring out a better method of boiling those.   Otherwise my salmon was fantastic and the portion was large. Worth the money, I'd just expect a few changes before I came back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Eyi8NCU2es8Rz250cOhjw"
  },
  "8U6Zn7SF-wLFQ3L2dO-q_w": {
    "date": "1/29/2013",
    "text": "I have to bring some balance to this place that is HIGHLY overrated!!!  C'mon folks!!  Ok, ok...I will cut everyone some slack.  I think this is one of the only \"create your own salad\" places in Charlotte so the idea seems fresh and new and exciting and I have to believe emotions are running high.  I absolutely love the concept of Crisp and when done right you can create a salad masterpiece.  I just don't think Crisp is \"all that.\"  They had some decent toppings to add to your salad but most of them didn't look very fresh and the variety wasn't that great!  The part that truly marked my rating down was the chicken that I added to the top of my salad.  They don't have it pre-prepared so if you order chicken there is a cook standing by waiting to grill it or do whatever to it.  They pulled this breast of chicken out of some random plastic bucket and started to grill it right away and then slapped it on top of my salad.  It wasn't marinated, it wasn't cooked through, it was absolutely disgusting.  It didn't even have a hint of salt on it and it was rubbery.  I mean, it ruined my otherwise decent salad.  I didn't think the teeny boppers working there were very friendly and I'm sure I wasn't when I used to work in food service at that age but it still took something away from the experience.  They were like pushing each other and laughing at who was going to get \"stuck\" making the salad because none of them wanted to do anything....ahh the youth of today....but that's a whole other story.  All in all, Crisp is a great idea and has some great menu items...I would avoid their chicken like the plague unless you tell them to drench it in flavor somehow and I personally wouldn't go out of my way to return.  Clearly, that's just me though.  :)",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TB9ibgXVrq1B7-fajbsu8g"
  },
  "9MD11eBjLZKdsvIxajQlyQ": {
    "date": "5/19/2016",
    "text": "Just returned to the office after a HORRIBLE lunch at Crisp.  Let me tell you....  I stood in line forever waiting to order.  Finally got my order in and sat down.  Waited at least 15 minutes, still no food.  Asked a server to please check on my order and she said that the kitchen was behind on sandwiches.  Well, anyone who has ever been to Crisp knows that you can see the kitchen from the dining area.  I could see a guy leaning up against a counter with his arms crossed.  I asked the server to at least bring my salad out first, and she responded that the salad and sandwich are plated together (so essentially, no).  She left and came back about 5 minutes later with the wrong food!  Not only was it not my order, the food she brought me had been through the wringer...the bread was all wet and soggy (and  GROSS).  Seriously, why would the server even bother to bring something like that out to a customer.  She should have had someone in the kitchen make a fresh sandwich.  Anyway, I proceed to bring the wrong food back to the girl at the register and tell her that I'd like my money back.  She looked at the food, and then proceeded to look for my order.  She comes back with a to go box that had apparently been sitting there for a while and asked me if that was mine.  It looked like the sandwich I ordered, but they put the wrong side salad with it....AND it had been sitting there for a while, so didn't look so hot.  The cashier said that I could have the food anyway, and she'd still give me my money back.  I politely declined.  After I got my  money back I went next door to Fresh Market and got a sandwich.  Had to eat it in my car on the way back to my office, since I had already taken over an hour for my lunch.  Total disaster.  What happened to this place?  It used to be good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "I3QnbrnJLT47sT1eEKRQ3Q"
  },
  "-ZS2qVMv4m66JIEZMMgl4Q": {
    "date": "4/12/2015",
    "text": "I really like Crisp. They have very high quality ingredients and a convenient location. It is never too crowded, which makes it pretty fast. Great for a casual lunch when you want something healthy but fast.  The staff have always been very nice and helpful and I would definitely recommend the salads at Crisp to a friend. I have tried their steak salad, asian salad, and salmon salad. The salmon was my favorite, and the asian was my least favorite :)   The only reason they get 4/5 stars is because I feel like some of the salads are a little bit overpriced for the ambiance of the place. It is very casual inside- which isn't bad- just doesn't totally match the food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "14j39CU0NQOlsBFlZRHoVw"
  },
  "Af1cMeQGM9kN67FXggOiRA": {
    "date": "5/4/2012",
    "text": "Dion L. & I popped in here last night for dinner, as I hadn't been to this location yet. I love Crisp's 7th Street location, so I knew I wasn't going to be disappointed.  Walking in, the music was pumping some club feel jams...it could have been \"Club Crisp\" for the night!  It was 7 PM & there wasn't much customer traffic, so we were able to walk right in & place our orders.  We were cheerfully greeted by our salad maker & he was friendly & happy. He prepared my custom made shrimp salad with quickness & another pleasant employee brought it out to us.    I have to echo a lot of what everyone else said about this location.  Ironically, it seems just about the same size as the 7th Street location.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "exEElE4pG-ZwoCMwoYddeg"
  },
  "6BfpXwv6AWkZnPPrA9ptFQ": {
    "date": "6/4/2016",
    "text": "What's not to love about a well-priced, customizing salad spot? I've had Chopt (and several variations of this dining concept) and Just Fresh locally; I feel Crisp boasts the best value and ingredient variety, as well as a relaxed atmosphere. I loved not being rushed through a line or pressured to have my meal thought up. Carnivores must try the balsamic grilled tofu! It's divine. I'll definitely be back for to-go orders.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m3M2lI47A-SitLpH9J4ldw"
  },
  "L79f2hXFLZQE2jDdbj4EEA": {
    "date": "2/18/2018",
    "text": "Not bad, but I like other salad places better. Wasn't really feeling the options.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YscjZezxLirEjK_bK82uAw"
  },
  "ZwO5j2uzTuWYZr6RLJR1TA": {
    "date": "9/27/2017",
    "text": "Have been coming to this Crisp location for a couple of years. Consistent, delicious food. Plenty of salad choices. LOVE the Honey Dijon dressing. I am always a bit disappointed that the price is a couple of dollars higher than one would expect (or maybe give a couple more toppings for the money?). But the atmosphere is quiet, efficient, and calming. A great stop for a good, quick salad/lunch and to decompress before heading back to the grind.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VHq5-cn5VsyrVqg1czI5Aw"
  },
  "Jvo2esI6DOpg2HizQGI8ow": {
    "date": "5/22/2018",
    "text": "Sanitation is poor (cooks using bare hands and no hair nets). My wrap was awful. \"House roasted\" turkey was slimey and disgusting. If they roast that in house I'm Abe Lincoln. My wrap was annihilated before I even touched it, I think they put grill marks on them ahead of time thinking it presents well. All it did was destroy the structural integrity of the wrap. This place needs to be replaced with something decent IMO.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "47APzE0vWGb81xuEEMTZzA"
  },
  "C8KLQ5wsPN4M-0K58TSzxw": {
    "date": "5/28/2018",
    "text": "It's so nice to have a made to order option for salads available. They are pricey but the salads are HUGE. Meats are nice and freshly made though I wish they had the option for a half size.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zPrnD3FdU7zouX0JhJgOrg"
  },
  "pdJWhWXcKwP2TgYOzWEnuQ": {
    "date": "10/13/2016",
    "text": "I come here at least once a week. Love this place. And the Starbucks next door. I'm always in this area.  Great location. Love the ambiance. We usually sit outside. Delicious salads. I always get a salmon Caesar. Fast and great service. It's about 11 dollars I think with my drink. Well worth it. If you love good healthy food, come here. Def love this crisp. The other one is cool I just like this one better. That pesto on the salmon tho...yum. My family is addicted to it too. Nothing crazy just fresh and healthy ingredients. Amazing staff. Excellent all around.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "z6OcroUUezjQGC9OMcM_dw",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Salmon Caesar. Yum.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/z6OcroUUezjQGC9OMcM_dw/o.jpg"
      }
    ],
    "user_id": "fxUh4h9t3xltCTinzrjqPw"
  },
  "aN9KrabAbUimBswpimI9Qw": {
    "date": "6/18/2018",
    "text": "I prefer Chopt or Reid's. I ordered a salad and they brought it out with different ingredients than were listed on the menu. I mentioned something to them about it and they just said \"Oh. Really?\" And did not offer to correct my order. Not bad. I would just say that if an item is listed a certain way on the menu, it should be served that way so there is not confusion over what you purchased.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RrEpCR6Doy8p7bLP_UmFnQ"
  },
  "0OUZe-qbd_Gee71ubh8F6A": {
    "date": "9/15/2017",
    "text": "Caesar salad with grilled chicken is amazing. My favorite spot for a salad in the city. I added bacon and corn and it was a great decision! My weekly salad spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ufAQFLU4f-qiyLELS9Mgcw",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Caesar salad with grilled chicken is amazing.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ufAQFLU4f-qiyLELS9Mgcw/o.jpg"
      }
    ],
    "user_id": "q3WmeOYc08krz143bzLYxw"
  },
  "SzXseF1IEq-b_LOZEDwXjg": {
    "date": "4/4/2018",
    "text": "Little pricey for a salad at lunch but WOW it was good! I did the Cobb w/ grilled chicken on top with a bottle of water and was $15 after a $2 tip. Super clean, outside seating available, and fast service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "doy1MCdZbT4yxJf0twDhWg"
  },
  "yWfEUejFQ-8lFwiTrqwEYQ": {
    "date": "2/18/2018",
    "text": "The salad I ordered here was overpriced and lacked flavor. Won't go back as there are better places for salads close by.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9J7cfBDI7quaayOlNLLm_w"
  },
  "D_KNSzphB0wt6GXCo7L0Fw": {
    "date": "3/11/2017",
    "text": "My wife and I have eaten at the Crisp in Elizabeth and really enjoyed it. Having moved, the East Blvd location is now closer. We decided to have lunch there today, and it was pretty underwhelming.   I got the special, a teriyaki chicken salad and my wife got the grilled salmon salad.   Mine: entirely too much dressing, stale crostini & Asian noodles, soggy and all around meh.   Hers: bland and colorless salmon, she asked for dressing on the side and never got it, flavorless and all around yuck.   The lackluster food, combined with what appeared to be the \"b squad\" staff (common courtesy anyone?) secured this as a place we won't ever be visiting again. For $20, I can make two salads I'll actually enjoy.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQkkzXoY0uNoXq9ZcN9b2A"
  },
  "hizg_9qLTHSQvWbCUldesA": {
    "date": "2/10/2018",
    "text": "This is a great place to grab a quick clean bite. There are a lot of fresh, healthy options. In addition to salads they also offer sandwiches and wraps.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "br6cS0HoUQ1lW58yhV9Urg"
  },
  "wF6vJtffbvy1Dg_HJKBjVA": {
    "date": "6/1/2016",
    "text": "I'm getting back into the whole healthy eating thing, which means I'm back to salads.  More importantly, make-your-own salads...my favorite!  The Crisp in Dilworth is a cute location located in a shopping center on East Blvd.  I periodically stroll in when I'm in the mood for a salad during lunch.  They have nice seating (both inside and out) and the staff is incredibly friendly.  They also have some really interesting flavors of potato chips that I've never seen before that are really good.  Crisp is a decent place, but there are a few things that would convince me to give it an extra star or two: -Need more variety of toppings and lettuce.  The toppings they have are good and fresh, but there aren't very many choices.  Would also love to have some kale! -Speed up the service a bit.  I don't expect fast food speeds, but sometimes it takes a good 15-20 minutes to wait in line to order a salad. -Have some meats prepared and ready to go.  It's frustrating when you see your salad sitting in the back waiting for the protein to be added.  It really slows down the process.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g4CEweu8TJo9NRvbtd4zEQ"
  },
  "a9JWDllwLHGslrBWDSlsHw": {
    "date": "9/26/2017",
    "text": "I have been back three times in two weeks. The service is excellent! More than I would expect for a salad place. The portions are large you can't even believe how much you get for the price.  I've gotten the salads, soups and wraps and they are beyond my expectation. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M0PwGEtSRYW29OPqIa2MDw"
  },
  "Furv4Z4N4VlQrpKy9M30Kg": {
    "date": "5/28/2014",
    "text": "Fresh Salads and Sandwiches.  This location is always packed around lunch time - so plan on a line. I am not a fan of the \"order your food, find a seat\" style places like Chipotle and Baja Fresh etc. because I hate not being able to get a table once I have my food, but there is usually a quick turn-around here, people don't tend to linger since by nature of the food, they are probably in a hurry if they popped in here for lunch.  I like the asian salad the best. Small outdoor patio.  The bad thing is the line and the limited space. It can feel a little stuffy at times.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ch99Qow_rchIaAjX-l8Fag",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ch99Qow_rchIaAjX-l8Fag/o.jpg"
      }
    ],
    "user_id": "MWuVbyBgP4vD24Rc7UH5xw"
  },
  "cAa6bLB4WXWWFfrM9bpf8Q": {
    "date": "4/18/2016",
    "text": "This place deserves a five star for service because both workers that helped us out were extremely friendly and helpful.   Price-$9 for a salad seems pricey, so be sure to load up on all five toppings.  Salads- I do not recommend getting any of the cold cut salads as the chicken was much more tasty and fresh than the turkey salad my wife got. I also recommend the Asian-Ginger Vinaigrette since it was an explosion of flavor for my tastebuds.   Would definitely visit here again for lunch as opposed to the Crisp on 7th street due to the overly friendly staff :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LwvPZ1bQt5-Zl1xxPberVQ"
  },
  "PdqF1c5E_UfBN9bo-aJiLg": {
    "date": "3/11/2016",
    "text": "Great customer service, quick wait, and amazing product. Stopped in for lunch on a Friday, before the business. I've been to the one on 7th street but this was my first time for the Dilworth one. Two of the employees took time to start small chat, and offered smiles and friendly customer service. I had the salmon salad, but switched out tomatoes for artichokes, which was no problem at all. I had the lemon vinagrette dressing, which is so good! It goes perfectly as a light accompaniment to the salmon. Speaking of, the salmon was cooked and seasoned perfectly. I was very happy with everything about this salad",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "49H_E6VEodFkPtR2hfyP1A",
        "caption": "Photo of Crisp - Charlotte, NC, United States. salmon salad - delicious",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/49H_E6VEodFkPtR2hfyP1A/o.jpg"
      }
    ],
    "user_id": "FRvKvr1-AsUaCBuxaoxnCg"
  },
  "ruVmIFbKXro7xzB9rGedTg": {
    "date": "6/15/2017",
    "text": "Crisp used to be my go to spot (at least once a week)for lunch on 7th street. Slowly leadership began changing and the turnover increased. With the new staff the food changed and so did the accuracy of my order.  I began going to East Blvd location and now the same issue has happened again. They have even hired some of the former employees from 7th st.  I am very sad to say I will no longer be eating at crisp. No matter how many times you ask and no matter how busy they are your food will not be correct.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MMYXpR2TDMjVwwUJv1hnIA"
  },
  "cgAGcWMYOQKWgwbDO4eFyQ": {
    "date": "5/10/2017",
    "text": "CRISP has become my healthy go to lunch spot. The ingredients are always fresh and due to such generous portions I always have enough for left overs (a great way to stretch my $10 lunch). I recently started to get the BLT (love the aoli) and even then the salad portions are extremely generous and you have the opportunity to customize your side salad. My only slight is that with the model you sometimes get a taste of cross mixing of ingredients. Normally it's not a big deal but sometimes I can get a minor blue cheese flavor and I really dislike blue cheese.. Not enough to make me not come back.   Update: I have since been back to this location several times for the BLT wrap. The bacon is never fresh,cold, and is very chewy. They are also frequently out of ingredients such as avocado. Now the reason I provided an update because I have been to the uptown location multiple times  and the quality of the same sandwich and ingredients are ALWAY far superior to this location and for that reason I will be docking a star from them.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qvGQs5AG1sMJ5a2O9LBoNA"
  },
  "OdLbBiJ16BjPyTxhDJ0RyA": {
    "date": "9/21/2017",
    "text": "I came into the Dilworth location and ordered a  FCN with Salmon.   I called the store to let them know that the salmon was bad and I was told by the manager that the fish was good, but it was not. The salmon has a greyish color and the fish smell was very loud. I would like to be refunded for the cost of the salmon. I even called back to the store and asked for the email address and no one in the store could provide me with the email address.  I think that is poor business! I will not be back and I will make sure that my company never uses them again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZcIn6ZPv7KygRhr7A2KzBw"
  },
  "JYHIz9P78SkmMpEm4UeO4g": {
    "date": "7/5/2016",
    "text": "Awful.   Arrived early for my daughter's appointment at Levine Children's Hospital up the road and decided to come here for lunch based on Yelp reviews.   My wife and I orders at the same time - she got a salad made to order with cooked shrimp and I got a turkey wrap. They completely forgot my order. Wrap said it was made with turkey roasted in store but it tasted like deli meat turkey - slimey, gelatinous, and had virtually no taste. The rest of the ingredients were fine but the turkey ruined the whole thing.   All this for $23 (salad, wrap, and 1 drink)? No thanks.   Go elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s3gWnFxLE97CM5vpdxsqkA"
  },
  "YsLd1GC_bK7mpk6YxTrDwQ": {
    "date": "6/29/2019",
    "text": "Let's be honest. Eating healthy on the go can be hard and expensive. Crisp makes it worth it.   I find myself going here often to grab a salad that I can't seem to remake on my own. I opt for the \"build your own\" with steak that is made to order. There are tons of different toppings you can add to your salad, as well.   The staff is so friendly and customer service oriented. I highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OYcxowkhh1xBSftsFgdM2w",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Build your own salad with steak.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OYcxowkhh1xBSftsFgdM2w/o.jpg"
      }
    ],
    "user_id": "K0LdtNqweb1KYJBiHyemcA"
  },
  "DVVnaRjLgOgjXACsj_L1Kg": {
    "date": "7/1/2019",
    "text": "Review update: They got rid of the best bacon in the world. The bacon they used to have made me crave salads here. It was so crispy and delicious which made it the perfect topping with any salad combination. I like Crisp \"ok\", but I'm not happy with this.   I guess I can just choose different toppers, but really, it will never be the same. I feel like the store has gone downhill a little bit. And cutting corners on some of the products is one of the ways it's changed.  The staff is always friendly. I just don't enjoy coming here at the way I used to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a1Vk4itHoiQQ0YE4y58mPw",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a1Vk4itHoiQQ0YE4y58mPw/o.jpg"
      },
      {
        "img_id": "OXH1f5AZQYtC3RAdpHr4wA",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OXH1f5AZQYtC3RAdpHr4wA/o.jpg"
      },
      {
        "img_id": "BpfB6DFr-mZdLoZtgGiwWg",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BpfB6DFr-mZdLoZtgGiwWg/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "QPePV5JClOkUW040p_498Q": {
    "date": "10/17/2018",
    "text": "This place needs just a little more love then it seems to get!! If your going to compare salad places, sure Chopts comes in a clear bowl container, but Crisp is still just as good in a brown box!! This place has killer salads, great prices and good everything. I don't have much negativity to say about the place.   My croutons were stale and that was about it. I don't care much about that, reasons why I don't want to downgrade this place! The serving size is huge and a very generous amount.  The workers are so so friendly, so nice as soon as you walk in. Give it a try, totally worth the time!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1QTXKWl0mrmPYp46VRJmiA",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1QTXKWl0mrmPYp46VRJmiA/o.jpg"
      },
      {
        "img_id": "nb61N9YMcdaCUA8BXZTc2g",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Caesar salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nb61N9YMcdaCUA8BXZTc2g/o.jpg"
      }
    ],
    "user_id": "f6oyZA1DUdVEqewR95TSdA"
  },
  "6u2YiUVAQsHr8G1i8IrRuA": {
    "date": "2/9/2019",
    "text": "If only this restaurant location was open during dinner time! If you work in uptown, and particularly the side closest to south end, it's very hard to find a good wrap or salad place - but Crisp is a great place to try. I suggest going around 11:30am or 1pm because the line can get pretty long - even if you get caught in it though, the line moves pretty fast. The best bang for your buck is getting a wrap as it comes with a side salad but if you prefer salad only, come hungry as it is huge.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PxhKsL_sDKS3g1_X7QVqxQ",
        "caption": "Photo of Crisp - Charlotte, NC, United States. The Monterey and side salad!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PxhKsL_sDKS3g1_X7QVqxQ/o.jpg"
      }
    ],
    "user_id": "oMcBz3NfDnpJ0ktVosC1cw"
  },
  "bk9SBLPZ6hLMHO1o7hIqqg": {
    "date": "1/15/2019",
    "text": "Crisp is definitely a hidden gem on the salad scene. A unique protein option that you do not see at \"cafeteria\" style joints is salmon. I order a ceasar salad with salmon (make sure you add the optional pesto). The customer service aka salad builder calls to the back and before yo know it, your hearty piece of salmon is being grilled to order. Add tomatoes and ask them to be heavy on the dressing. You will not regret!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xqocY-f-RuXTDQzJy_YqYg",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xqocY-f-RuXTDQzJy_YqYg/o.jpg"
      }
    ],
    "user_id": "gy2cx-_VqDhgSIiIYIYQ7A"
  },
  "YPGnB_zVsGiSaof24OhlNA": {
    "date": "1/11/2019",
    "text": "The salads are pretty good and a quick option for lunch breaks. There are a variety of salad options. There's custom options and also signature salads. I always enjoy the chicken ceaser salad and add onions, tomato, and eggs. The staff is super friendly. There's plenty of seating and they have WiFi capabilities. You can get water for free in a decent sized cup as well. Crisp is definitely my go to when I want a salad on the go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "budZOJCPg8BRKhexDXPySw"
  },
  "epuiyU_pg19CkKLREQ9KlA": {
    "date": "9/14/2018",
    "text": "My go-to spot in Charlotte (aside from Whole Foods) when I'm craving a big ole salad. I always opt for the Build Your Own option, but they do have an extensive salad menu if that's more your vibe. They also offer a few different paninis and soups as well. Be sure to try their Dijon Vinaigrette, because it is SO good and a little goes a long way. Prices are also very fair given the size and fresh grilled proteins.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lp1W8m1w_22pJ4GWsA3rKw",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Build your own with grilled salmon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lp1W8m1w_22pJ4GWsA3rKw/o.jpg"
      }
    ],
    "user_id": "4UHBndk1j0GsN6NOStpAdw"
  },
  "13fQQ3qeLCP5aYXLUrGFrw": {
    "date": "8/21/2018",
    "text": "I usually go to Chopt but I was in the shopping center Crisp is located in, and I was hungry so I gave Crisp a try.   I arrived at 11:30 and there was not a single person in the restaurant. The bar was clean and the food looked fresh. I ordered a build your own salad and it was good, not great. They have plenty of topping options, but not nearly as many topping options as Chopt. Employees were friendly.   I took my salad to go and the to go packaging is a cardboard box; I much prefer the large plastic bowls from Chopt (easier to eat out of and much better for keeping your salad fresh to eat leftovers later). The bathroom was dingy and needs updating.   They have indoor and outdoor seating which is nice.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TKwzreBMGFbu9zN6taeVLA"
  },
  "IslF4oMbPziKLBL-zEh3RQ": {
    "date": "7/25/2018",
    "text": "This is a nice little lunch spot close to my office. Parking is a little tricky, but if it's not during the rush, you can get a spot in the lot...usually.  My favorite lunch to get is the chophouse wrap w/side mixed green salad and their lemonade.  My coworker always gets their special of the day and so far she has not gotten anything she didn't like. Staff is friendly and the store is clean. You can sit inside and outside.  Sometimes during rush hour it takes a while for them to clear the table-especially if you want to sit outside, but it's rush hour so they are very busy making your dishes, which I can understand. One time we sat outside, we saw this table with the plates to be cleared and it took quite a while that a trail of ants made their way to the plates. I mean, they don't have busing stations, so I assume it is their policy that the staff clears the tables.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "c72nKRCJ8f4afpUE1tGciQ"
  },
  "3YPq7fsONhroa9X3Q-1iFw": {
    "date": "3/26/2019",
    "text": "Best Salads in Charlotte. FNC with grilled shrimp and mandarin oranges.  Will say that they always seem to get one ingredient or \"on the side\" wrong when ordering  to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FIThEzbfQuKCP64NyAyblQ",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Fruit nuts cheese salad w shrimp. Yummmm",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FIThEzbfQuKCP64NyAyblQ/o.jpg"
      }
    ],
    "user_id": "WCd8ZpJnI4IQPd7crbrVOA"
  },
  "ql2rWI-3c8HJ6uSDNUF06Q": {
    "date": "7/24/2019",
    "text": "Great place for healthy options, a little expensive but you get a HUGE portion so it can be 2 meals!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u_6VWKNsr5U18gfndJnJpQ"
  },
  "vE2Xm3VQpYrQQYiOaioyJg": {
    "date": "5/21/2019",
    "text": "I had the special salad which was blackened mahi-mahi. Overall the salad tasted great and seemed really fresh. If you go during lunch expect a long line, but they do a good job of moving it through.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s9m7mRhDEHEbi44C1avhpA"
  },
  "JnyMepmqtbSsT8HPvzXwNA": {
    "date": "3/16/2018",
    "text": "I've only been a few times because I have a general rule against going out for things that can be so easily made at home. BUT I was in the area and craving something in the vein of a salad or sandwich, so this place is where I ended up.   The service was super friendly. That's the part that really endeared me, is how kind of welcoming the staff were. The food was every bit as good as I'd expect. I mean, it's salads so there's only so much you can do, but the ingredients were fresh and the salad was GIGANTIC. I had a hard time finishing it, to be honest.   Don't know that I'd make it a point to go here on the regular but glad I gave it a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dOtx0WaYK95xdCMalSWwCw"
  },
  "cOX6wFOiR9C8643nI4-51A": {
    "date": "4/23/2017",
    "text": "Large Salads -Good but not Outstanding.  Two weeks ago we were going to try Crisp for Lunch after Church but for some reason, the GPS put us on the side street behind the shopping center they are in and there is no connection. Ended up Lebowski's but after lunch, we found the location with their help and bookmarked it to try again.  Today was that day. Raining Cats and Dogs during out drive down from Cornelius and it looks like we were their first customers.  I had the Build your own salad and I started with mixed Greens, Flank Steak, tomatoes cumcumbers, feta cheese, onions and black olives with a balsamic dressing. Watched them make it and it was an impressive thing to watch.  My wife ordered the Salmon Salad which is a standard menu item and brought here own dressing.  My salad was good and the portion size was hugh.  My wife liked the Salmon but not a fan of the rest of the salad. Said the bed of greens had too many course stems which to her made the salad rather course.  Staff is friendly and the dining area is neat and clean. Restrooms could use a bit of work however in terms of emptying the trashcans.  All it all, it was pretty good and while I would not make a special trip from Cornelius, I would give it another shot if I were already in the area.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 15,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "768GBu0wBDWiqbpWdecKZA",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Two Salad Masters and their Work Station",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/768GBu0wBDWiqbpWdecKZA/o.jpg"
      },
      {
        "img_id": "QXx-GypPb6hyUktNd0eaIQ",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Build Your Own Flank Steak Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QXx-GypPb6hyUktNd0eaIQ/o.jpg"
      },
      {
        "img_id": "rAvsoevIjTAi9fUxWvdODg",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Part of the Main Dining Room with Wall Accents",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rAvsoevIjTAi9fUxWvdODg/o.jpg"
      }
    ],
    "user_id": "GGTF7hnQi6D5W77_qiKlqg"
  },
  "5Dr1KWd4wtCpqHDrkfAgPQ": {
    "date": "6/26/2019",
    "text": "This place should just closed it's doors. Nothing but garbage. Lost my appetite when I walked in from the smell of the place. Hopefully when they close it will be replaced with someone that cares about food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3sZXdyJHgo2P8F8B82vEOw"
  },
  "q7DDnnmNtQwuGYJ7t1vSKA": {
    "date": "6/16/2017",
    "text": "This place alway have a special spot in my heart.. My go to when I'm trying really really hard to eat better. And I tried..   Crisp 5/5 offered a varieties of different type of salads with different type of proteins. Very easy to follow... For me, I like to customize my salads... alway love the salmon. Nicely cooked and it's grand portion. They also offer a few soups of the day. You won't be disappointed!  Customer service 5/5 they have alway been on point the few times I'm been there. They bring your bowl of salad to you and do check on you.   Cleanliness: 4/5 on busy lunch.. I understand it's harder for them to keep up with busting the tables.. but they did their best.. and any other times. That place is clean to me.   Overall, this will alway be that place for me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "88DUa9aWPQeAo3lrfXKDHQ",
        "caption": "Photo of Crisp - Charlotte, NC, United States. Customized salad with salmon. Yum",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/88DUa9aWPQeAo3lrfXKDHQ/o.jpg"
      }
    ],
    "user_id": "jcURiDqCLY7AOqo8KClJnQ"
  },
  "KeVbeHYD_otgIkirI3MmQA": {
    "date": "5/21/2019",
    "text": "DO NOT GO HERE! I decided to give Crisp a try after they moved from 7th street, and I never ordered my salad. I walked up to the counter started telling the guy what I wanted and saw a roach crawling on the wall next to the salad counter. That was it for me. Walked out and never going back! I struggled with not telling the people that had just ordered and were sitting at their tables waiting for their food. Sad that these people that posted good reviews have no idea what their food has been contaminated by. Disgusting.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RwWdq0i4hUwYSPzfYB8FLg"
  },
  "vqk8WEExQ74mJN8Z0N8_FQ": {
    "date": "7/17/2017",
    "text": "My first time at Crisp. The review where OK not great but I like to try things out myself.   Its small inside with outdoors eating. I don't see myself eating inside bc of the tight space. It was not many ppl in there eating but as I was walking out my pocketbook was bumping the chairs and table( due to the tight walk space).   I called my order in over the phone. They have online ordering  but you have to create an account and I did not feel like doing all of that.   The salad was good. I paid 7.50 for mine. It was a LOT which is great. I really enjoyed my salad. I will most definitely eat there again.   NOW MY CO-Worker did find a piece of hair in her salad. She was upset because she said her salad was REALLY GOOD. Once she seen that hair it was over.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l39AtdsdOwVqR4O9UFdK0w",
        "caption": "Photo of Crisp - Charlotte, NC, United States. My co-worker Crispy Cobb Salad with hair in it",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l39AtdsdOwVqR4O9UFdK0w/o.jpg"
      },
      {
        "img_id": "pwD-Pt-JvbVn2HsIu-VPsg",
        "caption": "Photo of Crisp - Charlotte, NC, United States. My salad I order the build your own salad for $7.50",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pwD-Pt-JvbVn2HsIu-VPsg/o.jpg"
      }
    ],
    "user_id": "xEupSNbB6H8fomOjK65fgA"
  },
  "7JVJxeM0JYmoWUoXL_h6qw": {
    "date": "5/12/2018",
    "text": "They were very friendly ! You have to wait for your protein of choice to be cooked so you will pay and sit and wait till they bring your food ! But it taste awesomeeee!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-VEa391IvQYhqeq9aePWnQ",
        "caption": "Photo of Crisp - Charlotte, NC, United States. I got a Caesar salad with chicken and shrimp and added onions, blue cheese crumps and avocado!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-VEa391IvQYhqeq9aePWnQ/o.jpg"
      },
      {
        "img_id": "awAt8IpiSTLjsmMTOBfm5Q",
        "caption": "Photo of Crisp - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/awAt8IpiSTLjsmMTOBfm5Q/o.jpg"
      }
    ],
    "user_id": "B69akrRM3xq4sExiC2oZ9g"
  },
  "eszvJzpSmgPB0D5TVhFwKA": {
    "date": "9/29/2018",
    "text": "I crave the FCN (fruit cheese nuts) salad with Salmon and Lemon Vinaigrette on a monthly basis. My favorite salad place in town!! So delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LL8SODYnIdsaqWo3yPkhwA"
  },
  "MGS9wlOSK_L5tVWDFKI6yg": {
    "date": "3/20/2012",
    "text": "I expected an energetic friendly staff when I visited this restaurant as it is new.  Instead the staff was rude and lazy.  I will not go back!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NS1xEchx-8tbHq5lVLY7Yg"
  },
  "IJVEr-yQoIFFqcqWrA-p2A": {
    "date": "9/16/2014",
    "text": "This is the place to go when you have a salad craving.  I really like that you can personalize your salad to your liking.  I haven't been disappointed yet.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_fGru6qP-VAciFJpgACdRQ"
  },
  "apGc9qQ6BCuHhQTc6q6gGQ": {
    "date": "6/21/2014",
    "text": "Great food.  Very healthy salads.  The sandwich and salad combos are great!  The best thing to have before a movie or concert....if you are looking for a great hand made special pizza....try the Chicken Pesto!!! Awesome.  Service is always magnificent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "obxrjNKD6Y1ic7iyXQU7ug"
  },
  "AMIfbZ59MA2R-5VzH0Bf2g": {
    "date": "5/17/2016",
    "text": "LOVE this place and the service is great! I used to go to the 7th street location but will drive an extra couple minutes to go to this one strictly because of the staff. One of the employees, Brian, remembered mine and my boyfriends name which I thought was so cool. He always goes above and beyond and is so pleasant every single time. The food is also amazing! If you haven't went to crisp yet definitely check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k919beYvcKsxeazvCWuvEA"
  },
  "H_6nlZahf-YCPA0lEcoRXA": {
    "date": "5/26/2014",
    "text": "4 stars for emotional value -- so glad to have found a \"make-your-own\" salad place here in Charlotte!!!! But I wish they had more variety in toppings -- they didn't have fresh onions or beets. AND 5 toppings are kind of slim -- I'm used to getting 7 toppings standard back home. Can't really do much with 5 toppings. BUT... YAY FOR SALAD!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1xmifaySPgPpD47xBvqzsQ"
  },
  "I8IlMrMxBtCWhw65qF0tUw": {
    "date": "3/13/2012",
    "text": "Just like its original sister restaurant in Elizabeth, this second location for Crisp offers the same menu of fresh made salads, soups, and sandwiches, prepared to order as you wait.  When looking for something on the lighter side, Crisp remains an excellent option.  The new location sports the same modern feel with muted tones of green and brown throughout the space, along with wooden vine accents neatly tucked into a few places.  As with the original, you walk in the door here and go right to the counter to order, where you can watch your salad come together in less than two minutes.  Specials of the day are prominently posted and many are worth a try.  For orders that require a bout more prep, servers will bring your order to your table.  Servers will also clear your table for you once you leave.  Tipping is actively encouraged, though you will still need to get your own drink and refills.  Prices here appear unchanged, and remain just a tad high, in my opinion, for what you get.  Still, there is no arguing with the freshness and emphasis on quality vegetables, fruits and nuts to enhance the dish.  Certainly makes the burrito and burger shops look like that fat slob of a cousin you only claim on holidays.  You, meanwhile, can run around lean and trim, knowing you didn't kill your calorie count for the day over a single meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AwyM03qzhwgyskBruurWQw"
  },
  "rYNzTeKdAmerefDyyF0rwA": {
    "date": "10/4/2014",
    "text": "Good salads. Close to home. Guy who takes the order and makes the salad is a massive jerk. Every time.  Everyone else is pleasant. Will come back as the product is great and no good alternative. But hate hate hate dealing with that guy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zBO8TLVshqLNB8R_l5KZoA"
  },
  "yYerq7fdrELQVDc0ffvD8A": {
    "date": "1/28/2013",
    "text": "Went here with some fellow yogis as we wanted a healthy lunch and this is right up my alley!  They have a wide variety of salads on their menu and they have a make your own salad option with lots of fresh ingredients and it's reasonable price-wise.  The salads are enormous too.  They have sandwiches which looked good as well.  Small space, but there was plenty of room for the 6 of us on a Sun at noon.  Went to the Dilworth location.  Friendly service as well. Will def go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3zIjK0tsOJqoLLedQ7XlDg"
  },
  "JmPIlK5ziCN0-Nez8aE_1g": {
    "date": "9/28/2012",
    "text": "I'm a huge fan of Crisp for their create-your-own salads, light menu and quick & friendly service. This is definitely the place to go for a tasty and healthy lunch if you're in the Dilworth area. Crisp is like a cafe in which you order your food from the counter at the back of the store and then have your food brought to you. I've only been to this location twice but I will say that the last time that I went the lady who cashed me out at the register was the friendliest person I have been helped by in a very long time. I did not catch her name but she definitely made my day a bit brighter. :)",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "HUI9SrB4NW0GP0MUCCT6VA"
  },
  "X2hnTmnzpp_7P1TKZYc0Xg": {
    "date": "2/19/2016",
    "text": "I love the quality and taste of the food! I also love this healthy alternative for when I am in need of a healthy quick meal. The price is good and I am amazed the salad makers know all the ingredients by heart. The service is great and by that I mean their knowlege, efficiency, and overall kindness. I think most of the staff is working really hard and pay attention to the details. This has to be hard with the many variations on orders and heavy crowds. I am only giving 4 stars because twice now they have messed up my order and thank goodness it was mine and not someone allergic to shrimp when I asked for chicken. That is just dangerous and quite frustrating. I even asked them to check the order because the girl putting them all together was clearly lost and everyone had to wait quite a while for her to sort it out - not the first time. That is likely the only part of this otherwise efficient process that is broken because there are typically several boxed salads waiting while the cashier takes more orders and the \"box up\" girl is off cleaning tables.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nDUxNtf-eMC5UWQbWqSQXA"
  },
  "9dB6Gll-HiR3ZuAJz2kibw": {
    "date": "9/30/2012",
    "text": "Crisp is amazeballs. Fantastic, healthy salads at reasonable prices. Emphasis on the healthy part because a lot of \"salad\" places drench their romaine-based salads in a heavily oil or cream-based dressing. Not so with Crisp, where you can select from a large variety of veggies with a light dressing on a spinach base. Also, the meat is fresh-grilled: my salad came out with the seasoned halibut still steaming. Om nom nom.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "DYt0HZUjMKkYgxBL7xUNSw"
  },
  "guMlV1uRoEivM7TWHgaKnA": {
    "date": "10/29/2012",
    "text": "I'm updating an old review because  I've been to Crisp a dozen times in the last couple months (we live 20 miles away) and I can't get enough. I've customized my salad a couple times which was great., but I stumbled upon their Salmon Salad with Pesto and have been IMPRESSED.  It's delicious.  They cook the meat to order so you get a fresh salad with excellent ingredients topped with salmon and pesto that just came off the grill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "noMqYSV1tGUPniAl-8QHDg"
  },
  "lL6VrBgwpz8zMvlf_Rj1GA": {
    "date": "4/5/2013",
    "text": "Pretty good food, the pasta salad was ok - but for pasta salad it was a pretty good portion. Doesn't seem to be a ton of parking, but overall a nice lunch spot. Wish I could give a half star for the music they were playing all of my favorites!! Think Amy Winehouse Pandora station.. not sure if my visit was the norm but I thoroughly enjoyed it!  I plan  on trying a salad the next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CfVdlk7VmhGA6YaJKmFEqg"
  },
  "T7hf3BGnrx1Ncl7kENK6hw": {
    "date": "10/1/2012",
    "text": "Unfortunately, I'm not a big fan of many fruits and veggies.  For that reason, I find it hard to eat salads, particularly pre-made ones.  With that being said, I am actually a big fan of Crisp.  I like the fact that I can design my own salad and pick and choose what I want on it...and the salads are very good.  Two salads usually cost us around $20, which isn't bad because they have freshly made \"protein\" and are pretty big.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nFgdvXE0NfqQodRq1xICaw"
  },
  "DzwUt7EfSwcO2zcJxDXHEw": {
    "date": "9/12/2013",
    "text": "The apple cider vinagerette dressing is my absolute favorite! My only complaint is it's a little pricey. But when you factor in the convenience of it being close to home and the taste, still gets 4 stars in my book.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "flz-ymsTSzM9ACOV2JyU8g"
  },
  "cPY59okFBZ4iTe3JGXdzew": {
    "date": "5/20/2015",
    "text": "I have not been to crisp in a while and was CRAVING a fresh delicious salad for dinner. When I arrived, I noticed their sanitation score was 86! How is that possible?! I was highly disappointed, and extremely disgusted. I turned around and left quickly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "73RP1mmXN1PfTiJf7j4_tQ"
  },
  "D0i5e6N989dTUFOoS4g5mg": {
    "date": "11/3/2013",
    "text": "Very disappointed the hours online say Crisp is open until 9. This is the 3rd time I have tried to come on a Sunday and Crisp has been closed. Today I was there at 4:45, to find a closed Crisp. Update your website so people don't drive across town to find a closed restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "1boVmmKU9zFgA0sZ6qyNNA"
  },
  "u7XzemGp0bjBK-nVjrjeig": {
    "date": "11/13/2014",
    "text": "Lots of great options for your salad.. The shrimp protein option is incredible and so flavorful. Prices aren't cheap, but for $10 I get a huuuuge (seriously, enormous) salad with 5 toppings and shrimp which I think is reasonable for the quality of food that you get. Definitely worth the money. Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8N4sKUwmVDPZszxNopr_7g"
  },
  "5RHz1zedP8KX_4wfl9v5Kg": {
    "date": "2/2/2012",
    "text": "Too me, its a little expensive for a salad place, BUT the salads are great there.  They have the freshest ingredients and really good salads to choose from or you can build your own.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hpwtfwzLFdeYq4yAJ6d-bQ"
  },
  "pcc-bu_lCCbhClvysZn1pw": {
    "date": "2/16/2014",
    "text": "Perfect for Sunday lunch. They served our family of 8 adults with ease.  Orders were perfect and served quickly.  Food was excellent, fresh, and very tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xEDwOZpxuSBjd8pl35hYEg"
  },
  "wDpM9iLljYeV1tcRdzRTqg": {
    "date": "1/23/2014",
    "text": "We've lived here three weeks and have eaten here four times. The salads are fresh and inventive. My personal fav is the salmon with pesto. The soups and chili are also excellent. The service is friendly and pretty quick considering they're cooking the protein to order. Love this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bY1eerwKT-hYaG0jVYh6Ew"
  }
}