{
  "Iy8SrCeD09u0NNxxR0SxGg": {
    "date": "2/14/2015",
    "text": "Excellent pizza. The wild mushroom was full of flavor and a great crust. They use all natural fresh ingredients located inside the 7th Street public market. Enjoyed with a German style Dunkel Beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XCvOvttxx6mgKefjUEqo0A",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. A view from general seating in the 7th Street Public Market",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XCvOvttxx6mgKefjUEqo0A/o.jpg"
      }
    ],
    "user_id": "0tgL3MVpVZWdednqvhMigw"
  },
  "dKKB046CR-gneQcIsZck3w": {
    "date": "9/13/2013",
    "text": "I would give them 5 stars based on deliciousness, but I had to take 1 star away because of the price. The only thing I've had here is their pizza and it's great. We have to modify our pizza to make it vegan and that's where the dollar signs start adding up. They charge $1 to $1.50 per topping and we added 5 toppings. We almost doubled the price of the pizza in toppings! But I'm more than happy to pay extra at a place that offers Daiya vegan cheese.  Other reasons I love this place: it's in 7th Street Public Market, it's right off the light rail, it shares a space with my favorite coffee and vegan cupcake place. We can easily spend a couple hours here eating and people watching.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "AwrTMmmK0xu-bFK4Bkd9Xw"
  },
  "VX2iVGka6oYzOMfb_niCeQ": {
    "date": "5/28/2016",
    "text": "As a girl who grew up outside New Haven, CT.... I know my pizza.  Gino and his gang at Pure Pizza know how it's done.  Best pizza I've had outside of CT!  Dough is perfect balance of crunch and chewy.  Sauce is fantastic.  The fresh, local, organic ingredients are DELICIOUS!  May fly back to Charlotte just to eat here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8bSV4BPw68J2Nr8L6-YhEQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8bSV4BPw68J2Nr8L6-YhEQ/o.jpg"
      },
      {
        "img_id": "6Sjuzu6AteeucLGBE8Akbg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6Sjuzu6AteeucLGBE8Akbg/o.jpg"
      }
    ],
    "user_id": "ih36B2qcGFidGX2pc6HqcA"
  },
  "7CEGYadqbjR2YyBEFivstg": {
    "date": "4/15/2015",
    "text": "Great place to come to grab a cheap, quick dinner!    The pizza is definately one of the better pies in Charlotte (nothing can compete with the NYC I grew up on!)  They use extremely fresh ingredients and have a wide variety of toppings/speciality pies.  I always get the ancient grain crust, which is definately one of the better grain crusts I have had.  The honey they offer to dip the crust in is a must!!  The wait time for dinner can get a little long during peak hours, so don't come hungry, but it's worth grabbing a beer and waiting for!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PMw2cpsAJ2zRyv3gJdbkEw"
  },
  "Vx77_j45EIK4fXulgK-tug": {
    "date": "6/6/2013",
    "text": "I think they should rename this place Pure Heaven Pizza. I'm embarrassed at how long it took me to try this place especially since I know one of the owners. But with an office in SouthEnd and this being in an area with only paid parking around, it always got pushed down the list. Well parking should not be a deterrent- all the places in 7th Street Market validate parking- woo hoo!   So I met someone for lunch at the market and Pure Pizza has definitely built a good base of clientele because they had a sizable line. I got to the front and asked Juli her top recommendation which was the wild mushroom pizza. I think I'm going to be stuck like JJ because there is no reason to move on.  The wild mushroom pizza has some tasty shitake mushrooms (as opposed to shitakes that sometimes taste like dirt which I call shitty shitakes) as well as some other varieties, drizzled with truffle oil. I tried it on the sprouted crust which is lower in gluten, and I paid attention to the tip about also drizzling honey they offer all patrons. You yelpers are sharp, my friends.   I had an epiphany when I tried the savory meets sweetness all on a pizza. There weren't too many pizzas in Charlotte I get extremely excited about, but this pizza changed my life and my outlook. It's not a thick crust, but still somehow substantial. I don't know what kind of cheese they use, but it doesn't upset my stomach like a lot of cheeses, and that with the low-gluten crust made my tummy very happy and guilt-free.    I guess some people might want other choices (not me, my love- I will stay True to you,  Wild Mushroom) so there is a \"lasagna\" pizza and some other carnivorous options as well as sandwiches and salads for vegetarian/vegans.  I think I just might have this for dinner.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "oInNoiunuDYWakwmvDiVVg"
  },
  "nYV_p0jmqM52Xe1Zb-dAVA": {
    "date": "6/3/2017",
    "text": "I absolutely love pizza. LOVE it! Unfortunately at most pizza places the pizzas are loaded with crap that I refuse to put in my body. Pure pizza is different, I feel good about eating it (no GMOs, no high fructose corn syrup, no refined oils) and it is absolutely delicious. I highly recommend the pesto pizza on the spouted ancient grain dough - soooooo good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x3KqdvNV2MkaKQva8IlMMw"
  },
  "qUJN1Ig5SL10swCFqu8Mxg": {
    "date": "12/29/2015",
    "text": "Solid pizza. Check in on Yelp for free garlic knots. My only complaint, they won't give you a box to take over any left over pizza. Really? They can't just give you a box. Easy solution though, just order your food to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PVyZXgOkVtnU6966FDFhuw"
  },
  "8rfdjoK9a8rfE2teyj1jgA": {
    "date": "5/3/2013",
    "text": "Well Pure Pizza is another place that falls in the category of \"I finally had to buy a living social to try\".  Apparently, I need the motivation of an expiring coupon to help me eat some pizza that I know is going to be great.  As per usual, I am all over a wild mushroom pie like a dog in heat.  I chose the sprouted crust and let me tell you, it was the perfect combo with the earthy goodness of the shrooms. Others at the table had margherita and another pie that I can't recall at the moment. Both the other ones were on regular crust, which was also delicious, but I can't get over the sprouted crust.  I look forward to many a return visit.  Oh they also have local craft beer which is always a plus in my book.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "GqJRlbga27rUpolN-SP9Ig"
  },
  "U60cVznyjkyyrRKgSFJteA": {
    "date": "10/15/2015",
    "text": "Their pizza is excellent (definitely one of my favorites in Charlotte), but we cannot get past the customer service and attitudes of the employees. Regardless of the day/time of our visit or how busy they are, any request large or small seems to be too bothersome for them to deal with. Sadly, I might go as far to say worst customer service in Charlotte.  We'll probably occasionally go back because the pizza is very good, but I cringe at the thought of dealing with whoever is behind the counter.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vvdg_hBh8lTc2fSskIv02g"
  },
  "gbXVR-13hIYaTZYdHTxxCg": {
    "date": "12/20/2013",
    "text": "Good pizza.  Great for lunch, and located in 7th street market so your companions can choose from sushi or sandwiches if they don't desire pizza.  Pizza is thin(ish) crust.  I've ordered the T-Rex and a basic pepperoni, the T-Rex is awesome.  If the line is long, it takes a while just to order.  For some reason, they are slow at taking orders.  It usually takes 10-15 minutes for them to bring your pizza out to you.  They have various sodas/beers available as well.  They carry some Dr.Brown's soda which is pretty good.  They have complimentary honey dipping sauces for your crust, which are really pretty tasty.  I went with the cinnamon flavor.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BFr6Z705fZxztLM9siIuLQ"
  },
  "dwexIRJb6Bvu65dvEnLrnw": {
    "date": "3/28/2013",
    "text": "This is the best pizza I've had in a long time! I think it's the crust! Or maybe it's the fresh ingredients! Or the sauce! Hell, I don't know which factor it is. I just know that it's hella (it's a Cali thing, sorry) good! We've been in Charlotte for almost a month and we've already been here three times. We usually get a medium custom pizza ($15.95) with cheese and jalapenos. The crust is thin and chewy-ooey goodness. They even give you a sample of honey to dip your remaining crust in. One sample had red peppers or cayenne in the honey which gave it a little zing to the sweetness.   The staff is friendly and the food comes out extremely quick considering that they make each one custom. I love the location as well. It's located at 7th Street Market, which is one of the Lynx stations, and it's also just a quick walk from Times Warner Cable Arena.    I remember the first time he ordered a pizza here. We took it to go since we already had dinner and he just wanted it for a snack for later. He had a slice right when we got back to the hotel and ended up falling asleep from food coma. He woke up to one slice left since, while he was sleeping, I had discovered how good it was. I couldn't stop myself from eating it all except for the last slice. Lala-oopsy! I think we're upgrading to a large next time ;)",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "fVcm0T4zVSNViYcq-zaI9A"
  },
  "TaoGo_UcZ-Z_072cAD5LPg": {
    "date": "6/3/2013",
    "text": "Who else has farm to table fresh pizza as good as Pure Pizza? It's pure and it's wonderful. Never had a bad pie here! All of the elements of the pizza pies work so well together. The crust, the cheese, the sauce, the toppings, even the honey for the crust. One of my favorite pizza spots in Charlotte. Check it out!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "bOQ_BLC09TE8FULMz7i_dg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Some of the best and freshest pizza in the QC",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bOQ_BLC09TE8FULMz7i_dg/o.jpg"
      },
      {
        "img_id": "1TypQl-HpG27QPgPCZ2Ycw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Wonderful Spinach pie...that I ate while driving. :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1TypQl-HpG27QPgPCZ2Ycw/o.jpg"
      }
    ],
    "user_id": "onsvManL82rHzpcCB3Uyfg"
  },
  "3czWEE15Aewo4_gdAQYydg": {
    "date": "5/12/2016",
    "text": "The farmers salad was bomb! The pizza was a little better than average but as a disclaimer I'm a pizza cook at a 4 star restaurant. I love that they use local ingredients, in fact that's what drew me in. Also, the beer suggestion was on point. Overall worth a try especially if you're looking for quality , local ingredients.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ed0_Alf5OrLFlzVsFBDELA"
  },
  "DXpnZg-mQTVQkYTUAUQQLA": {
    "date": "9/3/2013",
    "text": "Been here a few times for lunch, my pies are always VERY good - their Neapolitan dough is amazing: thin, yet with a puffy, chewy, & crusty edge.  & I love that they give you honey (the most amazing honey ever) to dip your crust in.  The Five Cheese pizza (fresh & smoked mozzarella, provolone, cheddar, & goat cheese) is an explosion of cheesy goodness in your mouth - awesome how all the flavors come together.  Ordering this and substituting pepperoni for goat cheese is a good combo too.  It's in a great spot, the entire 7th St Market experience is a fun one.  The only reason this is 4 stars instead of 5 is that a friend with a gluten allergy tried the T-Rex on gluten-free crust and was less than impressed... he said he's had better at Fuel.  However, they get props for the fact that their gluten-free dough is prepared completely separate to avoid any cross-contamination.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "r_dKh4X6WQZDvvcXOy2Yiw"
  },
  "uC7brGPPZPn6iMJbRaujxw": {
    "date": "3/23/2016",
    "text": "Usually dine here 2 times a week! Their sandwiches and calzones are great. Always wonderful service and tasty meals!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yON7EZzNtH36vHyCnbRpFw"
  },
  "aBh2tLjEvZOJ-mW9t1sEjA": {
    "date": "12/28/2015",
    "text": "Vegan and Veggie selections. Organic Lenny Boy beer. That's 5 stars right off the bat! Cheers",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qlsVbk3ySB8wq9opYcf5hA"
  },
  "gYAZ8-6AeZwEjVpMMO_vYw": {
    "date": "6/16/2013",
    "text": "Awesome pizza! Stopped by yesterday after reading such great reviews and was definitely impressed. I ordered a small pepperoni supreme and it was delicious. The ingredients proved their authenticity from the first bite. One of the best pizzas I have had in Charlotte.   The only thing keeping Pure Pizza from being one of my regular lunch spots is the price. My small 10\" pizza was $11.95; with a can of Coke my total came out to a little over $14. Worth the money, just not on a weekly basis for me.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tqIAiKisujzZWEjbdbMxyg"
  },
  "h4BtohQssRvFoGoAQU858Q": {
    "date": "12/19/2015",
    "text": "Best pizza in town and great location. Anyone in uptown for a night out, a date, a game, etc needs to go here. Many options local supported.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iGxhC62v_7zfcVOdihI-FQ"
  },
  "zQYH0EGz2RC-9Mb3q3_kBg": {
    "date": "1/21/2016",
    "text": "I took my parents to the market one night to experience what I consider to be an amazing part of Charlotte. While we were there we decided we would grab a pizza to snack on. It was the first time I had ordered pizza from them, as there are so many choices in the market! I have to tell you we all loved it! Loved loved loved! It truly was one of the best pizzas I've ever had. Between the crisp crust and the fresh toppings, it was amazing. It's been about three weeks now and we still talk about that pizza like we had just eaten it today! My parents said it's one of the best they've ever had. Without a doubt we will be back soon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nC_DTTSNlt2CBbjktdxM_g"
  },
  "kpVoEb-MknLaubMEZpSn2w": {
    "date": "11/20/2012",
    "text": "I don't know why it took me so long to get my butt over to Pure Pizza.   As a JWU grad I'm a huge Reinhart fan, and was really looking forward to making it here shortly after opening... and somehow my first trip happened in November. Oh well. They were out of gluten free (which is usually just my preference) so we got the sprouted grain. Then we had to order a mushroom after we heard about the man who grows them in his basement, followed by a vegan and a margherita.   Needless to say, the way the bare bones vegan pizza was made said enough. If an almost nothing pizza could be that good, they clearly have the basics down, and everything else should be awesome - and it was.   The only thing not awesome? The $50 for three 12\" pizzas. I understand why, but at the same - seriously??? The honey samples she threw in kind of made up for it I guess. But next time I'll ask for a few more toppings, because when I added olives to my margherita, I ended up with the equivalent of about half of an olive minced and sprinkled on. kinda lame. I did have a nice surprise with the other topping I added, though - the arugula is in sprout form!  I will return, because it's darn good pizza, and if given the choice I'd definitely pay more so I could eat that delicious crust.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "n_zJNVFWUwyzryuFf1v9pw"
  },
  "pfe8pOFoVbLeED1R-57yzA": {
    "date": "6/20/2016",
    "text": "The \"wild mushroom\" pizza was perfecto.  The truffle oil made it delicious but the oil wasn't overpowering.  I love white pizza and this hit the spot.  Would definitely get this again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HKPTnoeEgxl0Xi_Z-eKLzQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Wild Mushroom Pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HKPTnoeEgxl0Xi_Z-eKLzQ/o.jpg"
      }
    ],
    "user_id": "G-l9P0d5pxn9T1k1GvPVtQ"
  },
  "KdggjEajF-LdXwoUICqKNA": {
    "date": "8/8/2016",
    "text": "I have been on the search for a gourmet pizza place in Charlotte that wont break the bank and this is it! I dont think that they could make a pizza that I wouldn't like. They also offer a honey bourbon sauce with your pizza. It is amazing to dip your crust in this! It is located in 7th Street market which is so convenient. Plus, they validate parking which is quite nifty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ovFBhEt28yMjW6hBBHp_gA"
  },
  "9prZNNYg2aa9MJO5SCxTzQ": {
    "date": "4/22/2014",
    "text": "First off I love this market it has so many great places to enjoy including PURE Pizza.  First of I  must say the guy who took my order was very helpful and friendly.  They must have a great business because this might  be the only pizza place I know not open at nights because of the lease where they are at.  So that to me speaks volumes about their product!    I ordered the PRESTIGE FARMS CHICKEN it has grilled chicken, fresh tomato, Lucky Leaf Farm fresh arugula, white balsamic onions, Boskey Acres goat cheese talk about fresh and flavorful I loved every bite of it.  My girlfriend ordered a small MARGHERITA pizza and added bacon for 2 bucks which I was for a small?  Then I saw and tasted the pizza.  This is some of the best pizza I have ever had and for 2 dollars they dont skimp on the toppings they are big pieces of bacon not bits.  I can't honestly wait to go back to Charlotte and eat here talk about top notch with out a doubt.  IF YOU LOVE PIZZA IT IS A MUST GO!!!   I also saw this in another review and am reposting since its so cool!  \"After eating there the first time I started reading about Pure Pizza, how their crust was made, where their ingredients come from and fell more in love with each sentence I read.  You've really got to read about their pizza (<a href=\"/redir?url=http%3A%2F%2Fpurepizzaclt.com%2Fabout-o&s=6fde399ca715a09dd88f82fff8eadd607c92ab56eb9bbd21f7fb132d428e9a66\" target=\"_blank\" rel=\"nofollow\">purepizzaclt.com/about-o</a>...) and just go try it for yourself.\"",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "A2ZJjbN932XAsRBxDPYIzw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. PRESTIGE FARMS CHICKEN sandwhich and a small pizza with bacon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A2ZJjbN932XAsRBxDPYIzw/o.jpg"
      }
    ],
    "user_id": "OT3q21JZls-MV7Wv0d4bwQ"
  },
  "O70cdLs5dhdCyz71-mx0IA": {
    "date": "9/11/2017",
    "text": "Great pizza, very authentic Italian/NYC flavor.  Wasn't a fan of their gluten crust but definitely love the classic.  Their garlic knots & pepperoni rolls are also fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j7XsiZOx41RdJWkQW2zDaA"
  },
  "1HK-XiRyXxBMSAKZvne7mQ": {
    "date": "2/9/2017",
    "text": "Love this place and the location on central. The food is always fresh and I love the ancient grain crust. Makes me feel better about pizza. The sauce is perfect!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xbo_A0YkZE7a7y18_9ATw"
  },
  "Y7ZaVfGefSOcOOaMY9SudQ": {
    "date": "5/6/2017",
    "text": "Excellent pizza with super friendly staff! They have a personal size which has slices that are perfect for little ones. Not too pricey and the market environment is just a fun one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u7r8WbzRjjrzYqmr_1t-Ew"
  },
  "2GHJ-kLiHCBKWLwEOmjppA": {
    "date": "2/28/2018",
    "text": "TRex pizza was great, they honey was a fantastic treat that really elevated the pizza over a other meat heavy pizzas.  Crust was crispy and chewy.  Garlic knots were cooked perfectly with a crispy out and tender inner, did need the marinara that came with them.  They were understaffed but the guy there was polite. Salad ingredients were fresh and crisp.  Definitely my favorite place in the building.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Is89tJ9x7cTsbomCG6SYOA"
  },
  "VMY4E23tyIuTfgNUm78IJg": {
    "date": "3/25/2016",
    "text": "People are nice. Pizza was super greasy A bit pricy. $10 for a small 12\" - no toppings, only cheese It didn't take long, which was a bonus, but only 6 slices, we were expecting 8, since there were 4 of us, we were going to get 2 slices each.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "I4j2FPuM3Yz3mqeFKVawkQ"
  },
  "bIrnKdffk6BOccxM-gcvuA": {
    "date": "9/16/2014",
    "text": "If you haven't tried Pure Pizza out you should give it a try soon. Not sure exactly what they do or how they do it but they really have something special in their pizza crust and focaccia bread. Maybe there are gluten fairies working in secret or something - not sure but all I know is it's darn good.   I have had their pizza multiple times and you can't go wrong there. Try the smoked salmon pizza for something a little different. Today I ventured down and had their caprese focaccia sandwich and it was nothing short of amazing. Just simple and delicious.   Not really sure what else I can say. Gave them four stars but probably like 4.5.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-fxkBMjDRGooLkEMwUZHlA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Caprese focaccia sandwich...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-fxkBMjDRGooLkEMwUZHlA/o.jpg"
      }
    ],
    "user_id": "tUqwAohotmOyOqTcqDUt_g"
  },
  "PjcU-jX-O9twvNC0NOHHZg": {
    "date": "3/26/2017",
    "text": "Ordered a Caprese  pizza. When my order came up I went to add the essentials (cursed red pepper and Parmesan cheese). As I'm adding the crushed red pepper THE LID FELL COMPLETELY OFF. It left a mountain of red pepper flakes on my pizza. I went over to the guy at the counter to explain what happened. As I handed him the shaker he just kind of took it and shrugged.  Whether it was them doing a poor job of screwing the cap on or someone playing a mean joke, it didn't matter. My pizza was ruined. On top of that the employee didn't offer to either remake it or refund me. Poor experience overall :(",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZWSLzWDwpvg0wQy_YkG7PA"
  },
  "SAiB4mlgnXcfuWf2YIVYeA": {
    "date": "2/18/2014",
    "text": "Gonna make this short and sweet.   I'm an NY Italian and a bit of a pizza snob. I usually like my pizza just sauce and cheese like in NYC. This place however puts a whole new spin on gourmet pizza.  I love this place. I have yet to find something that isn't unique and completely delicious. Highly recommend the Wild Mushroom & Truffle pizza!  Update: the nice people at Pure Pizza gave me a free pizza coupon for my original review. My girlfriend & I went last night and I think their pizza hot even more delicious since last time! If you haven't gone yet... GO!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "2lwm_gVfM7QQYW0Npen6Fw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Wild Mushroom &amp;amp; Truffle Pizza... OMG",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2lwm_gVfM7QQYW0Npen6Fw/o.jpg"
      }
    ],
    "user_id": "WYR3VF11vMMf0HT0rmD8mQ"
  },
  "wPqVBLiju7dWV5ChZSDrtg": {
    "date": "3/6/2018",
    "text": "The food was good! The atmosphere was a lot noisier that we expected.  Good for letting children run about, but it shares a large warehouse-type space. Only a short walk from Discovery Place, which is where we were heading afterward.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OEPkoartEeUkozDFNPZyvA"
  },
  "tZYq-ENeNMwk0omi7HnM0A": {
    "date": "7/16/2017",
    "text": "We had tickets to an event in Charlotte on a Friday night and knew we wouldn't have much time for food but wanted quality food and not a fast food joint. We stopped here (our 2nd visit) and got the Mediterranean pizza and farmers salad. My husband got a beer and I walked a few stalls down and bought a glass of wine.  I'm picky about my pizza and their crust is crispy & chewy just like I like it. For an older review that I saw that says it tastes like Dominos...what in the world are you talking about?!?  Not even close. The salad was fresh and fantastic as well. The goat cheese was the best I've ever had.   We made a great choice in that we were able to get great food and not run late to the opening of our show. I just bought a bunch Groupon for their Central Ave location and looking forward to going again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MTFC2rx_OAz1UDeTKo5S7g"
  },
  "IRh1tGTav9kw5f4Hf1fRIQ": {
    "date": "4/2/2016",
    "text": "Classic NY Style pizza! Definitely on my top 3 favorite pizza places in Charlotte. They have fun and unique topping arrangements but even the boring old classic pepperoni is fantastic.   Great spot for big groups since the market is set up with an extremely open plan.   LOCATION TIP: Pure is inside of the 7th Street Public Market. An easy place to park is the deck located between Brixx & Queen City Q.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LVm62RortolmcNmwlrmMqg"
  },
  "092zyRBGcUxaW_twUPjd7w": {
    "date": "12/21/2014",
    "text": "So it's has been a few weeks since my last Pure Pizza experience and I wanted more of it! We called ahead for pickup and ordered a larger half just cheese for the kids and half goat, feta, fresh mozzarella and bacon for me and the wife! Of course we ordered ten of the garlic knots how could we knot!    The pizza was amazing! So fresh and foldable, covered with toppings, soft flakey crust. Yum! The sauce tasted like it was homemade, the perfect balance of acid and flavor! We will be back for more!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xr5n089ZpTgmwG8WkwDBqg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. He almost ate the whole thing!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xr5n089ZpTgmwG8WkwDBqg/o.jpg"
      },
      {
        "img_id": "VSXaWT2jQmFJN9nVC0LFPw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. That&amp;#39;s good NY style pizza!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VSXaWT2jQmFJN9nVC0LFPw/o.jpg"
      },
      {
        "img_id": "M2T7Coq3W6a-nl0pWbpqaQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Knots!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/M2T7Coq3W6a-nl0pWbpqaQ/o.jpg"
      }
    ],
    "user_id": "VXlOnrpx4J_HXoyoX9uICg"
  },
  "ycONhjzflsOFojuyudcRhQ": {
    "date": "7/28/2017",
    "text": "Amazing!! Check out the honey with red pepper flakes. The pizzas are to die for. Service is welcoming...On one weekday Pure does half priced bottles of wine which is fantastic! Will be coming back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLzZJxHDOUOTxG6TFvclJg"
  },
  "TaP5Wofif4ORINHZ9I0sWw": {
    "date": "10/7/2013",
    "text": "If Heaven were a pizza, it would be this pizza.  With honey on the side.  The 7th Street Market is such a neat place to go anyway, but when you go hungry - be sure to eat here!  I've only ever had the T-Rex pizza, because it's SO GOOD.  The crust is crispy and just right.  The T-Rex pizza has all sorts of meat on it (Ron Swanson style). The people are friendly!  Annnnnd they validate parking!  Pure Pizza has never let me down, if you want a good pizza and you're Uptown - this is your spot!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "QLgFEumhrHq6LgbEOKCzdw"
  },
  "NKcPExwLhRsE-MzaTblsPQ": {
    "date": "7/14/2017",
    "text": "Love this place! Bottle of wine with our pizzas-perfect mid-week date night spot. Staff couldn't be friendlier.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tdc9JWrY49v-R8O6ofgqkA"
  },
  "kSjdE3RndejUJXLOPRLRsg": {
    "date": "1/15/2016",
    "text": "I have tried both locations, and neither disappoint! Tonight, I accidentally called the 7th Street location thinking I was ordering from Central. Upon arrival at Central, I realized my mistake. I called 7th Street to cancel my order not wanting to travel uptown in the rain. They were so cool about it that I called back to pay for my original order and asked them to donate it to another customer. We need more small businesses like this. If they only delivered...  Great thin crust pizza! Even better customer service. I've been to 7th once, and to Central twice. They take care of their customers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "o2kCgVbI9SbUbXzFfF6Bgw"
  },
  "D24yy0FOZilwseHdWfHemg": {
    "date": "2/22/2016",
    "text": "Less than stellar. Tried out Pure Pizza for the first time on a Friday, when they were having a pop-up market.  I was there at 1:00ish, before the 2:00 pop-up. After ordering, I found it strange I had to ask how long, considering I was to go ahead and be seated - but that's extremely minor.  Pizza was brought to me piping hot - but also somewhat burnt.  So after letting my pizza cool, the flavors were just ehhh.  There was just nothing too special that would lure me back again, considering the plethora of other options out there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yE7lXvYznI3-rEZUzOyBiw"
  },
  "E372g8uIbrnsQFzQF7PfNA": {
    "date": "10/10/2012",
    "text": "Hands down one of the best Pizzas I've ever had (including in Italy :-) ). Plus, the Pure Pizza folks are really nice and have very inventive daily specials. Nothing else to say!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s-vNBsCsbEEVdrO-scz2Vw"
  },
  "TqxctQe8-8IekHJ3IZDbVQ": {
    "date": "5/5/2014",
    "text": "This restaurant has really good pizza, though a bit greasy.  The service, however, is really not that great.  The two times I have been there, all guys have been working and they are not very excited about their product.  It is like they are doing me a favor to make a pizza.  I arrived there today at 7:01 pm and they refused to serve me because they were closed and were really quite rude about it.  I didn't argue, but I had driven 20 miles from work to get there so it was disappointing that they couldn't make a single pizza.  I have worked in restaurants; they were going to be there anyway, cleaning up for at least 30-45 minutes.  Obviously they are not interested in customers and I was a relatively new one.  Again, the pizza is great, but do not expect to be impressed with service (although conveniently it pops up to \"tip\" them on the Ipad when you swipe your card.)  Gotta love the audacity of that!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h7zHYM8LbPWmXx0ZEqOOAw"
  },
  "Z8Ej8ZH9aABUn-QTsXKj7w": {
    "date": "2/9/2015",
    "text": "Pure pizza in the 7th Street Market is pure heaven for a pizza lover that tries to eat healthfully. Even on a Saturday at lunchtime the market was packed and tables were hard to find. The line at Pure pizza moved quickly and the food was delivered to our table in about 15 minutes. My friend and I went for the sprouted ancient grain crust, which was full of flavor and had a really good texture, crisp but not tough and with a delightful whole wheat feel to it. While not gluten free, this option is definitely \"gluten friendly\" all the standard toppings are available and we went with the pepperoni supreme that was packed full of flavor. the bill for a medium pizza with 2 bottles of water was $21. The only drawback is the parking situation. We parked in the deck and were only there for less than an hour and a half and it cost $8.00. Next time, I may try riding the light rail. No matter where I have to park though, I'll be back to try more of Pure Pizza's offerings soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGhgiNW1OVTRTz390q9GvA"
  },
  "_RZ34wGKtzH1oZZIZ21Knw": {
    "date": "11/17/2014",
    "text": "nice setting in a collection of \"artisan\" type places...salad was good, pizza sprouted grains crust was ok, but not that different from say a whole wheat crust I've had other places....and they were skimpy on the toppings, which I never like so can't really go beyond three stars  next time might try the crepe place or the grilled cheese sandwich shop in the same setting here",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4X2Dw7Bm0o6JuV0eWJKJUA"
  },
  "W662Ivgji7pWGYsaOy75WQ": {
    "date": "9/17/2014",
    "text": "Amazing. Had a 10 inch with ham, basil and garlic. Devoured it in no time flat. (While using honey on the crust of course.) Totally delicious and the staff was as excellent as the food. The recommended beer I had with it was tasty as well. A win all around. Wish this was in my city.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "K4J3GAnWk65epxuvqQbVuA"
  },
  "6c9ygcEhzlrfrHl6k4IitA": {
    "date": "7/23/2015",
    "text": "This is my favorite pizza place in Charlotte! You can really taste the difference with their fresh veggies, hormone free meats and home made sauce. I love all their pizzas but my favorite is the BBQ chicken pizza. It's not like any other BBQ pizza! Their BBQ sauce is made in house and has a unique taste, it's a must try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7zRdfY6cPSBMFTEM27lS6A"
  },
  "v59DrTYL3dZt3sSOr2ltoQ": {
    "date": "4/11/2012",
    "text": "Well, I was hoping to be the first, but it seems I've been beaten to the punch - which is AWESOME!  Great food - perfect location to get a new business started.  And the organic wines and NC brewed beers are also delicious.  Join and see that eating healthy can be fun and good for your brain.  Their crust is delicious!  Supported by <a href=\"/redir?url=http%3A%2F%2FiFred.org&s=0594161b8de105a589b1ec1159ecddf0c428038704fd0fce4337a642174b220c\" target=\"_blank\" rel=\"nofollow\">iFred.org</a> as brain healthy food for your mood.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "6TA8e6A0Rlp2uKS9SD6X0Q"
  },
  "GSheEbO68FaTSXC4zdSFzQ": {
    "date": "6/15/2015",
    "text": "Not sure what all the hype is about. I LOVE pizza, but this was bland. I tried the 5 cheese, and it did not have much cheese. Also tried the T-Rex and it was a little better. The pizza is VERY thin, so you need a lot to fill up. The honey for dipping crust was the best part, but still nothing to write home about.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UaK3P8mhBPNQSBGGI3VYtA"
  },
  "uXnCa2oZYI5ZGqzK-YrYHA": {
    "date": "7/19/2012",
    "text": "I tried Pure Pizza after seeing it while stopping into the 7th Street Market\" to check out \"Not Just Coffee\".  The pizza was amazing!  Nice thin crispy crust but still a little chewy.  The ingredients are great and it is nice to see them using local produce etc.  My wife and I devoured the pizza and will make this a standard Saturday stop on our weekends.  The only downside are the hours...since it is located in the market, it closes at 7:00pm Mon-Sat.  I live/work north of Charlotte so it is hard for me to get down to it during the week.  Hopefully they will be opening another location soon with more traditional hours so that it is easier for me to get my fix.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NnMCDFCsaiJ3OgvzZJJ-cQ"
  },
  "SVLNB-J8Br2323EcRVgNpg": {
    "date": "8/3/2014",
    "text": "We used a \"yelp\" certificate and were not disappointed.  Service was good as was the pizza - we got a meat pizza (can't remember the exact name - but know it was meat because that is all my husband orders) - crust was just right.  Also ordered pulled pork sandwich and one other item - sandwich maybe but everything was really good and prices were very reasonable too.  Nice little place tucked away inside the 7th St. Mkt.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "467LEKrruExESxrypMgb0g"
  },
  "SuWK00pSGkFAETkoV0DkPg": {
    "date": "7/4/2015",
    "text": "New Yorker here... Best pizza in town next to Fuel. I am looking forward to our next visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YFU_dhnHSdU56f0qdxBsXg"
  },
  "lfEA_wQ-B1JtEJAS9g7y9Q": {
    "date": "9/21/2013",
    "text": "Changing my previous 4 stars to 5. This place is just unbeatable. I've tried brickx, pizza fusion, and others. No one makes pizza like these guys. My typical order is garlic knots (awesome), Greek salad, (awesome), specialty pizza, (BBQ and pepperoni supreme are redic), and a local tap while we wait. This is a once a month treat where I go crazy at the public market. There's no other organic pizza place like pure pizza.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Z8kF-Ftv2O5TZ35uGD6jxQ"
  },
  "ZLV1lPINeeBNepsCmYHBGQ": {
    "date": "9/11/2014",
    "text": "I decided to use my Groupon tonight during a wine tasting.  I was not impressed with my pizza.  I was expecting it to look like most of the pictures displayed. Instead I received a very flimsy pizza.   I probably will not be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "deVz7CbX6fUp12x690FQNw"
  },
  "0BkZNedWWI6P_2brCT0P5Q": {
    "date": "12/20/2013",
    "text": "Best pizza in Charlotte! Great environment at the 7th Street Public Market. Crust is delicious and they only use the best ingredients. The salads and sandwiches are also excellent but I'm usually a pizza kind of guy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "A5m7gR5p4wHmEQv6tM-WRA"
  },
  "08AYJUD7FQFK2Uy5Uijz-A": {
    "date": "1/14/2015",
    "text": "Not much can be said about this place except...... \"DAAAAMMMNNNN THAT FOOD IS BOMB\" I have never had good pizza outside of jersey and this place has got it.  We go here everytime were in the area",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S_oxF7mVP76yM581RRAPZQ"
  },
  "rtntbMONlcXkU3LjzVd90g": {
    "date": "1/12/2015",
    "text": "I liked the taste of all the ingredients quite a bit but the crust doesn't fully do it for. Could be crispier.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CPQ0fMvVsMW77aNvtRHgCg"
  },
  "QPnRrqynJnP6UrNl86FZJQ": {
    "date": "7/8/2013",
    "text": "Great pizza!!  NY native who lived in Italy for years, and this pizza was on par with those pizzas.  I had the \"Slap Yo Mama Lasagna\" pizza and was delicious, will definitely be going back for more!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "7U1pR9kwE4oZo_0ShIGZCA"
  },
  "0FCWvDM4z59A0PxAh6_LGQ": {
    "date": "4/24/2013",
    "text": "Great fresh pizza! We had the 5 cheese pizza and it was so good! We got the regular crust and it came with honey to dip it in. I have never tried that and let me say it went perfectly together! Wanna go back to try another pizza or calzone!!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "jfw9FKu4DKSEmJ-Y11akwg"
  },
  "la9FwgHXgldvgWoJ12jVQA": {
    "date": "2/4/2013",
    "text": "I have to admit i have been thinking about this pizza since i had it for the first time a few days ago. It was that good. Had the Slap Yo Mama Lasagna add Pepperoni, took it to-go, stuck it on the pizza stone at home for a few min and all i can say is damn that was one good pie. The crust was excellent. Thin and crispy with a nice flavor and not too doughy. Really good when dipped in the honey they toss in the box. The toppings and sauce actually tasted like lasagna and they use the large pepperoni. Its a win-win. I consider myself  a pizzaterian and i have to say this is one of the best pizzas i have had in awhile.  It really is amazing how much more flavor comes through when fresh ingredients are used. Price was a little steep so i wont be able to chow down here on the reg but i definitely look forward to anytime i can swing it. If you appreciate a nice, fresh and creative pie you should definitely check this place out.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "_h9rOf--MUWleyXAqPVo2g"
  },
  "hXYIBef2Y6mGC4gDEnuUuw": {
    "date": "5/8/2012",
    "text": "Let me start with a couple of disclaimers - I was born and raised in Naples, Italy (the birthplace of Pizza), I travel extensively (and thus try food all over) so I know what I'm talking about, and last this is not a universal pizza review but it is relative to the category Pure Pizza belongs to (otherwise I would have to take in account price, etc. which it will make it too complicated). When I think of Pizza in the US I can identify three main categories: The traditional American-Style Pizza, Thicker crust, with thick tomatoes sauces, many cooked toppings, garlic and onion in almost every flavor with variations such as thinner crust and different cooking methods (gas, coal, wood fire and electrical), the Chicago-style deep dish pizza, with a thick layer of meat, very thick, rich in toppings, especially cheese, resembling a stuffed pizza and the Neapolitan Style, wood or coal fired pizza, thin crust, oily, typically fresh and sometimes uncooked ingredients (prosciutto, arugula, cherry tomatoes) or the traditional margherita with blended peeled tomatoes and mozzarella or water buffalo mozzarella. Although tastes varies depending sometimes what you are used to eat, where you grew up and so on what I can say about Pure Pizza is that it will satisfy all the categories as their pizza is a wonderful combination of American traditional crust (I'll get to the sprouted crust later) with a perfect mix of farm-fresh ingredients. I tried 4 different ones so far, and from the simplest one, to the topping rich one I was caught by surprise to each Pizza's addicting flavor. I live in an area where there are many pretentious little local Pizza places and Pure Pizza would blow them out of the water and I'm not kidding. Most of the places I've tried either the crust is too thin and cooked in colder oven and thus too crispy, or they have too much garlic and onion (covering all other flavors), or they either have too little toppings or they have too many toppings, or the oven is too hot and thus they are burned on top. Pure Pizza is the perfect combination instead, you will taste the fresh toppings, you will not taste canned food (at least in the 4 I've tried), the crust in not too thick, not too thin, the amount of toppings is just right, the oven is at a temperature that doesn't burn the toppings or makes it crispy on the bottom. Another distinguish factor is that you will get your Pizza in a record time, still sizzling, even if there is a really long line. No cold pizza, no going back to work late. A little suggestion: they do need to hand out numbers to customers that are visible on the table though so that when the pizzas are ready the servers won't have to scream numbers hoping people will remember theirs. Lastly sprouted crust: in my opinion anything but a white crust is a crime, however I was with other people at the table and one of the pizzas was with sprouted crust and they forced me to try it. Well, I was totally and utterly surprised, my main concern is that the sprouted flour tends to be tasteless, but this wasn't the case at all! I even dipped the crust in their fantastic local \"spicy\" honey! Well done Pure Pizza, I'm looking forward to try all of your other pizza on the menu (I think the pulled pork is next, a little flavor from the south).",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "M480nhRv-rxCKDrAU3DdZg"
  },
  "FC-0nlnn6auhz4cSceDojQ": {
    "date": "6/29/2013",
    "text": "Apparently I just need to try the pizza. I got a calzone because I was feeling poor and didn't want to spend $14 on a pizza. The calzone was good, not the best I've had. The worst part is how difficult it was to eat because the the plastic fork and knife provided. It was impossible to cut. I eventually gave up and used my hands. The whole experience gets 3 stars, but I will be back to try a pizza, and I will update my review at that time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oY9ZkOjJJ_zShYQ4AsZ7CQ"
  },
  "8acRcXkpSxX54ZHn8GLSEQ": {
    "date": "4/12/2012",
    "text": "Two of my favorite worlds have combined: ancient grains and locally sourced food and PIZZA!!! Their pizza is out of this world. I have tried about 5 different pies and each was better than the next. The best was one I wasn't sure about: the pulled pork. AMAZING! Welcome to Charlotte, Pure Pizza!!!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9Ke8ybJiuL6NAlJiiTyZ9g"
  },
  "6fO6LZVXtZzuXFNey3DRTA": {
    "date": "2/17/2017",
    "text": "Creative menu, great people, fun setting.  We lunkheadedly ordered something we just didn't want, and the folks made us a new pie, no problemo. It was yummy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fztjpcnC-Vq1Rr5qg0Ib3g"
  },
  "J3fmfBkfLUbuoq05GZ4Uaw": {
    "date": "11/25/2017",
    "text": "Have really enjoyed Pure Pizza in the past. Tonight there were a few issues with the pizza. My wife and I had the Pure Country pizza. To sum up the pizza - the tomato sauce was like water, no taste and sauce soaked through to the crust. Sauce made crust so moist, it was almost impossible to pick up. The topping included country ham, but it was almost non-existent on the pizza. Pure Country pizza? More like a pure mess.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xg6x9niWFdVF9ddbmS-2MQ"
  },
  "uznF9HF1KxDkK1C5Ux_gQQ": {
    "date": "5/30/2013",
    "text": "I know how it sounds when I say this is the best pizza I have ever had... Believe me.  I know how it comes off... lol  Seriously, though... I can't think of a different way to describe this experience...   They offer a sprouted grain crust as well as a traditional white... The boyfriend and I (or me, however that goes) decided to split the difference... I got the Chorizo pie on sprouted grain and he got the T-Rex on the regular...   The chorizo had an excellent balance of flavor...  The sausage and tomatoes were markedly fresh, the radishes were crisp, the onions were nice and crunchy... My favorite part, though?  The cilantro sprinkled on top and the slice of lime they gave you to drizzle over the top... Omigosh, I literally ate the whole pie... I don't normally finish a meal and I made myself finish that entire pie at one sitting because it was too good to stop... lol  The T-Rex was crazy good... Bacon, ground beef, sausage and pepperoni with a tremendous mozzarella and a perfect accompaniment of organic tomato sauce...   The toppings didn't overwhelm the actual crust, so they both got to shine... The crust stayed crispy (which is very important to me) even though they did not shy away from the sauces or the other ingredients... I made sure to ask for some of that honey to dip the crust in and I was sooooo glad I remembered... It was absolutely heavenly...   I just saw that Foodie Call delivers Pure Pizza now... Why in the world did they tell me that?  I might not be cooking tonight after all... lol",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "GcQXdPyfIP_QKaVQCLYoMA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Chorizo with sprouted grain crust... So excited!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GcQXdPyfIP_QKaVQCLYoMA/o.jpg"
      },
      {
        "img_id": "6RF_W-CuR8QR-LVUEzONyg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. T-Rex with classic crust",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6RF_W-CuR8QR-LVUEzONyg/o.jpg"
      }
    ],
    "user_id": "ttZSRwCZiFMXwUO2Vr9pBg"
  },
  "JEQLoxO9Db86bU4uz8Jmcg": {
    "date": "5/17/2013",
    "text": "Yep...it's official this pizza is the <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>!    After chatting up the staff I let my inner meat monster out and went with the T-Rex pizza basically because it's got everything pepperoni, beef, ham, bacon...Mmmmm!   After about 10 minutes my masterpieces arrived. I chose the original crust and my goodness it was pretty delicious!   And that honey...Wowsers! Now, I admit I never thought of honey and pizza being a great combination so I was a bit hesitant but seriously just DO IT! Absolutely delicious!  Heck yeah, I'm coming back! Loved it!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "LnumVUSCejBBIwenHQkUNg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Mmmmm....T-Rex :-)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LnumVUSCejBBIwenHQkUNg/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "ncu9RLpZkg1_7vXyBuuiXA": {
    "date": "10/14/2015",
    "text": "We had a great lunch at Pure Pizza. The guys behind the counter was super cool and very accommodating. I can't eat cow cheese so they left off the Parmesan of my garlic knots and subbed goat cheese on my pizza. Everything was amazing. Bonus the knots were free because I checked into yelp. They even gave me a few more knots because I was nice about them opening a few minutes late. The pizza crust and knots were light and crisp. I also had a salad which was a little pricey but a fresh accompaniment to the pizza. I had a meat pizza called the T Rex which was very delicious. All of the meats complimented the airy crust without overwhelming it. The public market has many choises for lunch but I am very glad I picked Pure Pizza.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xOLYJjpYnfAyCa6-dmKUiQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. T Rex with goat cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xOLYJjpYnfAyCa6-dmKUiQ/o.jpg"
      },
      {
        "img_id": "sFuuFsFOGRuMmEuJomOqYw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Garlic knots with no parm.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sFuuFsFOGRuMmEuJomOqYw/o.jpg"
      },
      {
        "img_id": "mgpKvkFTXIsK2hbeK7A-bA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Farmer&amp;#39;s salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mgpKvkFTXIsK2hbeK7A-bA/o.jpg"
      }
    ],
    "user_id": "9Iy269paaYw9KrNoUvRPVw"
  },
  "pA4fJwcv2mw2F3Ya_FP99g": {
    "date": "2/23/2013",
    "text": "Everyone was telling me this pizza was delicious!!  I just wasn't paying attention, I went yesterday for a job, it was our fourth stop and we had been eating all day.  So, you can imagine I wasn't thinking how delicious this might be or having the excitement of a fresh pie coming my way!    We tried The Chorizo, it was so unique.  It was like a street taco, thin crust topped with cheese, chorizo, cilantro, tomato, raw red onion and a little radish.. it was an explosion of flavor.  Just the perfect mix of hot food, with crisp toppings and tiny amount of spice. Well balanced, you just wanting to keep eating it, to keep getting the wave of flavors.  Local sourced ingredients, friendly service + delicious product. And did I mention beer? They have a five or six local beers on tap.  Good times.  Check times in the evening because it closes when the Market closes.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 13,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "n4PfLyMwU-fy2Mrx6El-lA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n4PfLyMwU-fy2Mrx6El-lA/o.jpg"
      }
    ],
    "user_id": "Bsbumyr3Of8BauN2URK4bg"
  },
  "FdenoGhvxR9I0NSUuE7wkA": {
    "date": "3/17/2015",
    "text": "We purchased a $10 for $20 groupon for Pure Pizza and redeemed it yesterday. I got a large takeout pizza, half slap yo mama lasagna and half pesto. I paid $2 extra after pick up but it was worth it. I also asked for some spicy honey dipping sauce in addition to the 2 regular honey sauces that came in the box. The cashier also told me they have bourbon, spicy, regular and cinnamon honey dipping sauces as well.   The pizza itself was thin with a large, thick crust. The pesto was a bit oily and there were a lot of tomatoes on it. The slap yo mama lasagna was yummy but really needed some other veggies like spinach. I think my favorite part about Pure Pizza was that you could really taste the freshness of the ingredients. Yes, they are a bit expensive but its worth it.   I wish I had time to grab the garlic knots, they looked good. 5 are free with check in! The sandwiches also looked good. I'll give them another try when exploring the market place. Cheers!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "C5QsUsQg5I3dMdLM02SXGA"
  },
  "adJQY0aT5e6GB0IfcAwksw": {
    "date": "12/15/2016",
    "text": "Customer appreciation my a**! Stopped here a while back to pick up a pizza and salad from them but when I checked in [as I was leaving the marketplace] I was then given this offer for FREE garlic knots. Came back today to claim it and I was fed a BS excuse that I would have to buy something in order to receive them. Mind you, it's NOT noted on their offer at all [usually any BOGOF offers through Yelp are clearly identified] and I had already purchased something a while back to even get this \"free\" offer! I don't condone shady business practices of extorting as much $$ from customers as possible so this place is permanently blacklisted from my pizza choices now. I've upload 2 photos of their \"freebie\".",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nM3VGjnJ4lp8vA7vi-kGjA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. ...even after clicking &amp;#34;redeem&amp;#34; it still showed NOTHING about BOGOF= False advertisement/sh*tty biz practices!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nM3VGjnJ4lp8vA7vi-kGjA/o.jpg"
      },
      {
        "img_id": "MvW7pfeWmVuk0PSnvCAqmg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Their &amp;#34;free&amp;#34; offer is anything but that! I was told I had to buy something in order to get it= which is NOT stated on offer...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MvW7pfeWmVuk0PSnvCAqmg/o.jpg"
      }
    ],
    "user_id": "yxj7Z7FpdN4DSbdlGVdL9w"
  },
  "koIEKywkB_g_38XQZpQlwQ": {
    "date": "7/21/2015",
    "text": "Updated after trying more pizzas (had to go back only a week later, it was too good!)  Initial Review:  Pure Pizza is definitely the best pizza I've had in Charlotte thus far. I ordered the pesto pizza with tomatoes and red onion with a few friends, and it was superb! The crust is thin but stays crispy enough to hold up the toppings, the sauce to cheese ratio is solid, and all of the ingredients added great flavor without overpowering the pizza as a whole. You can really tell with their farm to table approach that they have high quality ingredients based on the taste alone. While this does cause the prices to be a bit higher than pizza chains, the quality more than makes up for it. My only complain is that I wish they had smaller options than 12\" so that I could get a personal pizza during my lunch hour at work- but hey maybe I'll just have to feel like pigging out or want some leftovers that day.  New: The Slap Yo Mama Lasagna is also incredible. The ricotta, ground beef, and Italian herb combo makes this taste spot on like lasagna filling..it's incredible. The wild mushroom pizza is nice and cheesy with a strong roasted mushroom taste. Also go a free order of garlic knots which didn't have a ton of garlic flavor but were buttery and had a good bit of parmesan on top. With the marinara sauce, they were very solid. All three pizzas I've tried have been out of this world. The crust is thin but still crispy, and the pizzas come out very fast (less than 10 minutes both visits). The only downside is the slightly higher price than other pizza places but the quality justifies it if you're looking for really good pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lsXjfkFqRzNgT63WLv1K5A",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Half Mushroom, Half Slap Yo Mama Lasagna",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lsXjfkFqRzNgT63WLv1K5A/o.jpg"
      },
      {
        "img_id": "VxpQMX7emW4ps-UWkJ8hvQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Side of Garlic Knots",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VxpQMX7emW4ps-UWkJ8hvQ/o.jpg"
      }
    ],
    "user_id": "aLqp_fe64ugZFuwMpsXLiw"
  },
  "xDDVNqf2owhkM0xc-i7C5w": {
    "date": "7/2/2016",
    "text": "I had been meaning to hed up to the 7th Street Market for quite some time, and I finally made my way out last weekend. I took the Light Rail up because the train doors open up to the doors of the market. I walked around the market for a bit before deciding on Pure Pizza.  You order at the register and get a number to put on your table. There really weren't too many available seats inside, but luckily there were plenty of empty tables outside along 7th street.   I got the chicken sandwich and my mom got the caprese sandwich. Both were absolutely delicious. The chicken sandwich came with chicken, arugula, tomato, balsamic onions, and goat cheese. The caprese sandwich has tomato, mozzarella, palermo sauce, and balsamic vinegar. They were both very filling. The bread was maybe a bit too thick for me personally - my mom ate the second half of her sandwich open-faced to cut down on how much bread she was eating.   I would love to return to try more of the sandwiches and actually try the pizza this time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "H5kximxFOPq4xjXJcqfA_Q"
  },
  "U23fRLzzMpuCHvDUZIZ1bA": {
    "date": "12/18/2014",
    "text": "I was going to be in town on business for a couple days and this time I took some time for me to actually explore a little more of Charlotte. Pure Pizza popped up on my radar and I knew I would have to try them out. Especially since they were in one of my favorite places: the 7th Street Public Market.   I went for the Pesto Pizza. Typically when I'm trying a new pizza joint I go for the trusty margherita pizza to get a nice base line of what a shop can do, but I switched it up this time and was very glad I did. I paid for my pie, got my number and found a seat in the dining area. Not too long a wait before it was time for me to dig in.  The pizza crust was crisp, but not charred. While I don't mind charred, but I know some pizza patrons do. Plenty of cheese & pesto drizzle to go around on each slice. If I ever make it back here with colleagues, I will definitely recommend getting several small pizzas so we can try a variety of flavors. I almost went back every day while I was in Charlotte, but I had to be fair and explore other options.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "43L7XcWOkVCe1d2XpuLGaQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Pesto Pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/43L7XcWOkVCe1d2XpuLGaQ/o.jpg"
      }
    ],
    "user_id": "npD9KeIpB7PX3OwBMxZ3EQ"
  },
  "gVkaYEfMAnG_XDVhLI2O3w": {
    "date": "9/30/2017",
    "text": "I was excited about this place but was very disappointed. Maybe it's just an anomaly but our pie was burnt terribly. To the point that I tasted nothing but burnt toast and garlic. I did my best to eat it because I was extremely hungry, but it was not good. Also very overpriced at $30 for a 16\" pie, and we had to eat again. I don't know what happened. Maybe they were just off there game.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UJelW74DROUb-IPK1LznLg"
  },
  "tYvT45lgth38NVc0y_AnVQ": {
    "date": "11/1/2012",
    "text": "I come to 7th Street Public Market at least 2-3 times per month and always think, \"I need to try Pure Pizza\".  Mission finally accomplished last weekend!  To me, one of my first tests of a pizza place is just, how well do they pull off a simple cheese pizza?  Pure Pizza pulls it off very, very well.    This version of the cheeser had perhaps the thinnest crust I've ever had on a pizza with just the perfect amount of crisp and chew.  Still on the crust side, you get a little plastic container of some excellent local honey to dip your remnants in.  The cheese was perfectly brown and melty and stretchy and delicious with a delicious tang you only get from real quality mozzarella and the sauce was fresh and added just the right amount of acid to the pie.   All in all, this was a great pizza and I can't wait to try another variety on another visit to the market.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "33v8c5ftrKuDGTw1ZQ2toQ"
  },
  "_WG8AXfYHUVuq39NJx1JlQ": {
    "date": "8/6/2017",
    "text": "Great pizza decent price and the help was super friendly will be back first time in the area",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qnvXpB8kslfcR_1hsn587Q"
  },
  "uOVgq1VwqEIgsT98diCvUw": {
    "date": "11/12/2014",
    "text": "Great pizza and it's consistent. Love the specials and the honey that comes with the pizza for dipping the crust. They support local businesses so that's a bonus!!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0G05-vT65b7lNMIbo5_bPg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Best garlic knots in town",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0G05-vT65b7lNMIbo5_bPg/o.jpg"
      },
      {
        "img_id": "-RBXnfKkBmwoYz-m0BKDrg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-RBXnfKkBmwoYz-m0BKDrg/o.jpg"
      }
    ],
    "user_id": "lN400ckm9JAMqq5_nsmBEA"
  },
  "TaoaX7MqCujFRNaJBns2Sw": {
    "date": "7/13/2014",
    "text": "While the prices are a bit high for a make-your-own pizza, the taste makes up for it. I love going to Seventh Street market, sitting Not Just Coffee and having a drink while waiting for delicious fresh made pizza from Pure.  I've taken this to go as well as eaten inside the market, and I can say that the pizza doesn't do well reheated. So try to eat it fresh while there if possible.  If one of their specialty pizzas sounds good to you, go for it, as those are definitely a better deal for the amount of toppings you get for the money.  I wanted what I wanted, though, so I ended up with a medium, thin crust, regular crust pizza with jalapenos, pepperoncini, onions and feta.  It was pretty expensive at $2/topping = $20 med pizza. But it was delicious.  The arugula salad with goat cheese and lemon vinaigrette is to-die-for. I crave that dressing days later. So light and fresh but flavorful.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "9JnfLlWgnWBX_BGwUHMlXQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Arugula salad with goat cheese and lemon dressing.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9JnfLlWgnWBX_BGwUHMlXQ/o.jpg"
      },
      {
        "img_id": "JFx2HNAY7Y4BjOKYh6sWdg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Pulled pork pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JFx2HNAY7Y4BjOKYh6sWdg/o.jpg"
      },
      {
        "img_id": "35smB7mnaxUEFk_J3q1Dfg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Half jalapeño/garlic, half pulled pork pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/35smB7mnaxUEFk_J3q1Dfg/o.jpg"
      }
    ],
    "user_id": "x37OyP--VEFE5p-xreplYA"
  },
  "mvcgaNQz_FLq9iI6FpW9Gw": {
    "date": "9/26/2014",
    "text": "Firstly, pure pizza is in an adorable marketplace and is now my favorite lunch area. There are a bunch of different choices of restaurants near it, all looking delicious and super hip.   I got all of the yelp deals available before ordering: 10 for 20$ and checking in for free garlic knots.  Even with my 20$ credit, I paid an extra 10$ for 2 pizzas and 2 waters.  So far, 30$ for 2 people worth of food is a little steep. But then the food came out and our pizzas were bigger than expected. We barely finished half of all of the food we ordered and took the rest of it home, absolutely stuffed.   The pizzas were pretty good. Slap-yo-mama lasagna pizza didn't quite live up to its awesome name (not to say it was bad, just not exceptional) but the BBQ was freaking amazing. I wish I didn't have two pieces in my sitting so I could have taken more of it home. Btw that pizza is just as good cold as it is hot.   And lastly, the garlic knots were free. Do I even need to say more?   Warning: lunch time gets busy and it gets hard to find a seat! Be prepared to wait around with your food for someone to graciously stand up and free up a table.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "5lEPHP_siAihUZDkFLBYRg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Garlic knots",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5lEPHP_siAihUZDkFLBYRg/o.jpg"
      },
      {
        "img_id": "RMyM3mT-XMyCkbliM6N0xQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. BBQ chicken pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RMyM3mT-XMyCkbliM6N0xQ/o.jpg"
      }
    ],
    "user_id": "KTgCN7nb-Dmnyma9quy4mw"
  },
  "Qqf-G3a4JL9LqM8q8R2pGw": {
    "date": "7/21/2014",
    "text": "We came here for a little snack while waiting for our coffee on Friday. See my review for Not Just Coffee.  We ordered the individual pulled pork explosion to split between the two of us. Took about 10 minutes to cook and came out right to our table with some slaw on top (just like a pulled pork sandwich).  The pizza was amazing! Decent price and great location.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "Hw5riZfnB-B7G79vBTOssA"
  },
  "fQJS4RoaA_OLvCWWms1THA": {
    "date": "5/28/2014",
    "text": "I hate to rain on the parade of 5 stars, but I was not impressed with my pizza.  I ordered for delivery through foodie call and had a custom pizza made of goat cheese, proscuitto, and arugula - my go to. The pizza came within the expected time frame (45 minutes) and I was excited to give it a try.  The first red flag (you can see by the picture) is all the toppings were plopped in the center. Who likes eating their pizza with no toppings on the outside and then mounds of it on the other side? I spent the next 5 minutes redistributing the toppings so it was evenly dispersed throughout the pie. Second, where was the proscuitto?! There were tiny cut up bits of what tasted like ham sprinkled on top, but definitely not the thin slices of salty, savory proscuitto deliciousness I was expecting.  The ancient grain crust, however, was very good and I also enjoyed the brown sugar cinnamon dipping sauce that came with it. I'm willing to give Pure Pizza another try...but I'll surely be there in person to voice my criticisms.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 11,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NoX7epUtgcaERKYGsQPeiA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Goat cheese, arugula and proscuitto. Why are all the toppings clumped in the middle? And where&amp;#39;s the proscuitto?",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NoX7epUtgcaERKYGsQPeiA/o.jpg"
      }
    ],
    "user_id": "j5AWHk5Vhv79P5onFX3xWA"
  },
  "2B6LKEodrsBknodYZ3MHGw": {
    "date": "8/29/2015",
    "text": "Their pizzas are a little hit or miss for me... Some are great and some are pretty dry and bland. I've learned to stick with the deconstructed pulled pork pizza (one of the greats) and am rarely disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eVxYV4jI-618bnRCDniowQ"
  },
  "_YqyahOpzIrh0H6pMWaAdQ": {
    "date": "1/8/2016",
    "text": "I've been to 7th street market for lunch several times and after hearing such great things about Pure Pizza, I was excited to give it a try. Unfortunately my bad experience started right at the register. I went on a Friday a few weeks ago at 12:30pm. As expected, the market was a zoo. To complicate things further, I had my 4 month old with me in a stroller. I was surprised to see that there were only 2 people in line in front of me to order. The friends I came with went to Local Loaf and their line was much longer than mine. When it was my turn to order, I walked up to the register and pushed my stroller in a way that it wasn't blocking the main aisle. Apparently the cashier (who appeared to be miserable to be at work that day) was not pleased and firmly said \"You're going to need to push that stroller down there\" as he pointed down the aisle past their drink fridge. My stroller was positioned in a way that partially blocked the path from their kitchen to deliver orders to customers. Even though it took me a total of 2 minutes at most to order and pay and no food ever came out during that time, I did as he requested. I was entirely uncomfortable leaving my baby unattended in the stroller down the hallway in a busy market, but he wouldn't serve me until I moved it.  I ordered their 10\" pork pizza and got a bottle of sprite. I was shocked when my bill was close to $15. Nonetheless I paid quickly and went to get my baby from down the hall. The second big mistake was that I was given a #1 table marker. I had no idea where I stood in line waiting for my food at that point. However I was never told or given any indication that the wait would be very long. I went and got a table and sat with my friends. After 20 minutes went by, I still had no food. I thought I would go check back with the cashier in case my number wasn't visible enough. My friends were already eating their food from Local Loaf at this point. The cashier REFUSED to make eye contact with me. I waited by the side of his register until he was through with taking someone's order and then he proceeded to move forward with the next customers. Finally one of the cooks noticed me standing there and told me they were still working on my order. So I went back to my seat.  After another 15 minutes and my friends finishing their lunch by this point (35 minutes total) I went back to the cashier a second time. This time he noticed me right away and with attitude said \"You're order is about to go into the oven\". So I sat down for another 10 minutes before my food finally came out. So I waited a total of 45 minutes for my food. By this point I had a very displeased 4 month old and I felt incredibly rushed since my friends had finished their lunch 10 minutes earlier. I thought for sure the pizza may make it all worth it, but yet again that was mistake #3.  Maybe I ordered the wrong thing, but the pork pizza was not good at all. The pork on top was dry and charred black. They put a heaping scoop of purple slaw right on top in the middle of the pizza. It made the pizza cold and soggy. The \"special sauce\" tasted like a buffalo wing sauce which didn't go at all with the pork flavor or slaw.   Needless to say, I had a horrible experience overall and won't be returning. Too expensive, terrible customer service, and not good pizza for what you pay. Save yourself the time and money and eat at Local Loaf or Hazelnut Creperie.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "0aPKRchlDlg_ThdwAjA-Wg"
  },
  "rTr6Oq6IU2OWuoG9hXd9NQ": {
    "date": "1/12/2015",
    "text": "This is pizza done right. Not too much sauce, perfect amount of toppings, and the crust is flawless. My favorite is the Pesto Pizza but the Wild Mushroom, Buffalo Chix and Five Cheese are amazing too. This is hands down my favorite place to get a pie in Charlotte. Also, they give you honey to dip your crust in and they have a solid beer selection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fofhbHguazNGQMsj1gUKLg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Five Cheese Pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fofhbHguazNGQMsj1gUKLg/o.jpg"
      },
      {
        "img_id": "290lQzTsWsKiW_hGkCqYHQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. BBQ Chix Pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/290lQzTsWsKiW_hGkCqYHQ/o.jpg"
      }
    ],
    "user_id": "aihRtdsX5RXWxgKmPGG1xw"
  },
  "eG6AcVlgjPsGDDGJ6OVSbQ": {
    "date": "10/2/2014",
    "text": "Spot on. Pepperoni is on another level as well as there chorizo.  Fast preparation multiple options for anyone palate.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kbRbh5c5fVwvUi6n0zGdYw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Great flavor. Amazing pepperoni",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kbRbh5c5fVwvUi6n0zGdYw/o.jpg"
      }
    ],
    "user_id": "du8TGiiVjQKh2NjASafCCg"
  },
  "5wRCV5pktnp40sZBPS3dWQ": {
    "date": "5/10/2016",
    "text": "This is the best location hands down. This is also the best pizza I have ever had in my life. The crust is crispy, not soggy, and I never feel gross after. They will also give you a little cup of honey to dip your crust in. I never get pizza from anywhere else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KVm6pv9yd4RrtMGSKchqXw"
  },
  "bnFTuJAiFvv8cfVJ3h0w_g": {
    "date": "3/20/2014",
    "text": "Nestled in the marketplace, it is hard to not know that this place exists but glad my friends introduced me to it.  Traditional entrees (ie lasagna) spread on to a pizza. While it wasn't as large as I hoped, it was alright for a lunch pizza. Had a variety of toppings and as a few others stated, I could eat this every day and not get tired of it since they have a great variety of menu items to choose from.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "owRJSf6XpxG0d9vBl04uAQ"
  },
  "KA1uKWBLb6saYLx6J1Unfg": {
    "date": "6/2/2015",
    "text": "I ordered the country ham pizza pie, 8\" and my boyfriend got the 8\" bbq chicken. It was ok- but not my favorite pizza in town. The Caramelized garlic added a nice flavor and the country ham was good. Only downfall is that the 8\" pie left me hungry and it was expensive.... $30 for 2 8\" pizzas and 2 cans of soda. The 7th street market is a great environment, very convenient.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cpNSmByTfG_wMnaILedUBQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Country ham pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cpNSmByTfG_wMnaILedUBQ/o.jpg"
      }
    ],
    "user_id": "egtav85TWLn2rlQZ0N_G8Q"
  },
  "VqiAqDNrbDgtcNcQ9lmm9A": {
    "date": "11/12/2013",
    "text": "Wow I was so impressed with this pizza! It tastes fresh, delicious, and put my taste-buds in a frenzy. This isn't traditional italian pie but it is excellent none-the-less. We had the five cheese, the wild mushroom, and a big greek salad.  I enjoyed all but the wild mushroom with truffle was beyond incredible. The crust is the perfect texture (chewy with a slight crisp) and is served with honey on the side. (doubling as dessert= genius).   Everything is local when possible and it is located at the 7th street Market so you can pick up some other local goodies while waiting for your pizza. I will definitely be ordering some PP in the near future!",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "h3QW-Kv1BOVyyP7hLRvdmA": {
    "date": "3/15/2014",
    "text": "My friend and I stopped by this spot with a Groupon late on a Saturday evening, just before closing. We tried the pulled pork pizza with a couple of pints. Two words: AWESOME SAUCE!   The pizza had unforgettable flavor, combining sweet, savory, and acidic into a delicious bite. Also, the staff was more than accommodating-they gave us remarkable service in spite of our lateness. Most definitely worth the ten bucks we paid for the groupon-even worth the sticker price.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "2aCW5swQkTfyK0BQDWE3IA"
  },
  "q7lc5V644SqxWEoUOZ3vvg": {
    "date": "7/24/2014",
    "text": "Another 7th Street Market vender that is great. Awesome pizzas. The ingredients are so fresh and the cheese just falls off the pizza. When ever I'm in Uptown during lunch I make sure that I stop and a grab a cheese pizza for like $5. They are so good they have spoiled me for other pizza places. It's great place and you should make sure you go there. They also have local beer too. The crew of Pure are friendly and love what they do. I have family members in other state craving their pizza after one visit.  So that should tell you that you need to make a visit right now.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eXFTFlpyKdvlEO1hmJLRlA"
  },
  "dQws9AYX3ybO1l6j6Ng98Q": {
    "date": "4/20/2015",
    "text": "LOVE this pizza. wish they delivered and open later.  makes you feel much better knowing the ingredients that are going into your pizza are locally sourced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_PC-Fx4AO-j5ruRARcCc_w"
  },
  "7XDcUAEkuwiDFnxFMwys0Q": {
    "date": "3/21/2015",
    "text": "Pure Pizza uses fresh ingredients.  That is a huge plus.  The downside is this makes it the most pricey pizza that I've ever purchased.  The Porky Pie was delic :)  They do have sandwiches as well & have tried the pulled pork w/the slaw.  This was quite tasty.  Suggestion - eat the pizza warm for the crust to be the thin & chewy vs. the end part of the crust being impossible to chomp into to.  When ordering from the menu posted online, ask as some of the menu items are not as described on the online menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xqUn2yqxQRq5MrthbRb-7Q"
  },
  "-6CjsCykxc_4gWAgHI7P8A": {
    "date": "2/18/2015",
    "text": "I had lunch here with my mom over the long weekend. We decided to make our own small pizza and then share a Greek salad. The salad was fantastic! The feta was high quality and the greens were clearly fresh. The dressing was tasty. The arugula was a different spin to my typical idea of a Greek salad but I liked it. The pizza was good! The crust was tasty and perfect texture wise. The toppings were clearly fresh. My only complaint was the pizza either needed to be cooked more or have less cheese on it or something. The middle part of the pizza was soggy and soupy (still tasty nonetheless).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dGUOe2TBchiGvU1BNkmTog"
  },
  "DKx6NQixDdSSuSbAM6K_0A": {
    "date": "5/11/2016",
    "text": "Great pizza, even better calzones, there's usually a line for lunch but the staff is pretty friendly. Recommend it",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c_vwdEGXm57ASJvMK4ob4w"
  },
  "5lXIV3zisVrfyrSqi1e9tg": {
    "date": "11/16/2014",
    "text": "Thoroughly disappointed- guess i went in with sky-high expectations after reading all the glowing reviews. The wild mushroom pizza was ok, a bit pricey at $12 for a small pizza. The pesto pizza was very good. And my kids loved the garlic knots - they even fought over who will get the last one.  This is not like a typical restaurant. It is inside the 7th Street Market, so we park up in the parking garage - we can get the ticket validated once inside(machine next to the Sushi place - free parking for the first 90 min). Take the elevator down, and we enter into the indoor market with Local Loaf, Cloud 9 Confections, Pure Pizza to the right and a Sushi place to the left.   And there are tables food court style - the Saturday morning we went, it was way too crowded and noisy!!! Again, not impressed!!!  The guy who was bringing the orders out was very nice and friendly despite the rush and lines.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QjMc16MFIeytPROXQRsZgA"
  },
  "0qcY1V86LTjKt2f59OOZlw": {
    "date": "5/4/2017",
    "text": "Popped in to Pure Pizza to give it a try on my lunch break, as my co-worker raves about it. It can be pricey depending on the pie you get, but honestly it's worth it. The ingredients are local and fresh, and you don't feel like crap after eating it. The staff is super friendly and great at recommendations! I normally stay pretty basic with pizza and am really picky with sauces, but Geno's D Pie was incredible. Definitely support!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HUE0aCJAPJU_3niyhMx05w"
  },
  "ft7zAvy7AlZi0181uF5IKQ": {
    "date": "12/27/2014",
    "text": "The Bottom Line: This is the pizza you have been looking for.  We ordered a pizza to go. The pizza box made it home but, um, the contents didn't. Not much more that I can add to that. Excellent!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IAs3dWYXmafI4ymP7LDvCA"
  },
  "qq0MSfcg3SMhexoLO5jtUA": {
    "date": "5/15/2015",
    "text": "Hands down, the best pizza I've had in Charlotte. They specialize in fresh, high quality ingredients. The crust is crispy on the outside and chewy on the inside without being too thick or too thin. Be sure to ask for honey to dip your crusts in; my husband and I prefer the spicy honey and the bourbon honey but our 8-year-old loves the cinnamon honey. Get the smoked mozzarella instead of regular mozzarella if you want to take your pizza from great to amazing.  Their staff is friendly and efficient, although they're more reliable in person than over the phone. I have called in a couple of takeout orders that weren't 100% accurate (one topping different than what was ordered).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zOf2ZKfyP8ZT8SgRc90efQ"
  },
  "e6bF3HK13LhUccGes6P7VA": {
    "date": "6/16/2017",
    "text": "7th Street market is just a great place to chill, eat and drink. The folks at Pure Pizza didn't disappoint. My son and I split a 16\" pie and a chicken parmesan sandwich...yes we can eat.  Pizza was great and the crust was crisp the way it should be.  The chicken parmesan sandwich had a huge portion of chicken and was nicely prepared. When we visit the market again, Pure Pizza is on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KVXmBtavJo1HAE1jCYcLiA"
  },
  "DVi09eBsYiN0LqYvud5Hqw": {
    "date": "5/4/2012",
    "text": "My co-worker and I stopped by for lunch today.  We decided to order two pizza and split them.  We ordered the margarita and the chorizo. The former on the classic crust and the latter on the sprouted grain crust.  Two bottles of cane-sugar Cheerwine on the side finished out our order.  We found a table and waited not even ten minutes and our first pie was out of the oven and on our table.  The margarita was really terrific.  A nice crust with a little char on top.  The chorizo was just as good.  It was not overly spicy and the sprouted grain crust gave off a mild nutty flavor that I found complimentary.  Maybe not so much for the margarita or the pesto, but it worked on this pie.  We did not get the honey that some other yelpers indicated they received, but we'll be sure to get some next time around.  Service was great.  Julie was very pleasant and happy to help.  The kitchen staff was on top of things and they physically would walk the pies out to each table.  I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "S8t4LF6J5kxmD8y0P9ju1Q",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. 10&amp;#34; chorizo pie on sprouted grain dough: $11.95",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S8t4LF6J5kxmD8y0P9ju1Q/o.jpg"
      },
      {
        "img_id": "xo0JGdnfRyxhh0u0l6wpIg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. 10&amp;#34; margarita pie on classic dough: $9.95",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xo0JGdnfRyxhh0u0l6wpIg/o.jpg"
      },
      {
        "img_id": "_a-MQynC4nAD-YMImQ9DDQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. menu board",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_a-MQynC4nAD-YMImQ9DDQ/o.jpg"
      }
    ],
    "user_id": "SwgCR62v2RKU3mQo1S-dlQ"
  },
  "1HgjVoRgPiFXJ9VgnPXQNA": {
    "date": "6/28/2016",
    "text": "Went to try this place at the advice of friends. I was enjoying the taste of the chorizo Pizza when suddenly I saw not one but 3 hairs on my food. I was so mortified almost vomited. I brought the issue to the staff who scolded me for wasting food. I will not be returning!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZVhAUilIUI34BfhZeUmDbw"
  },
  "KEfgWkIYrwK_8W0sADw6fg": {
    "date": "7/28/2018",
    "text": "I ordered a pizza for my children but never received it.  After sitting for 30 minutes, I went to the counter to return the table marker and explained the situation to the lady at the counter.  She said that the zero was not on the ticket. (My table maker was 40 and the ticket was for order #4).  No concern or care after I told that I didn't want the pizza anymore.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SOJWkDew3mNpNKU2FeAu3w"
  },
  "dprU12pMGglJAqVl-H_jJA": {
    "date": "3/26/2017",
    "text": "Tried the Popi brunch pizza with egg, chicken and cheese on gluten free crust. The crust was good and crispy, but I was disappointed I couldn't add bacon since bacon makes everything better! The egg was minimal on my pizza, but my friend got the central brunch sandwich and it looked amazing and came with a side salad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HwFIXlkXfsqzaP_zd8EjYA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Gluten free Popi pizza from the brunch menu!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HwFIXlkXfsqzaP_zd8EjYA/o.jpg"
      }
    ],
    "user_id": "fPxE0VgahKU0Xh6YQt2-Kw"
  },
  "x1If8qJilUJRPYCaYRuVdQ": {
    "date": "12/13/2017",
    "text": "This place is so cute and so delicious!  They are located in the 7th Street market.  The service was great and everyone was extremely friendly.  I was attended to immediately and I also received my order pretty quick.  I ordered garlic knots and a small cheese pizza.  Their garlic knots might be my favorite garlic knots, and I'm saying that having tried a ton of garlic knots!  The pizza was really good as well.  I've gone back a bunch to order the garlic knots, the large size will fill you up.  It is a little pricey though, which is my reasoning for giving it four stars, but other than that, it's amazing!  If you haven't tried out Pure Pizza yet, you should definitely make your way there very soon!  Don't forget to check in and get free garlic knots!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rgE7iUN2ibB56GNcgxesTg"
  },
  "jnQTcvSmYhcqcvs1UABRMw": {
    "date": "7/5/2015",
    "text": "So I finally was able to try Pure Pizza.  I had a day off and headed to 7th Street public market. Apparently so did everyone else had off that day as well so I waited in line for like forever.  Finally got up to the line. I had checked their menu online first and the Wild Mushroom pizza spoke to me.  The online menu says it comes with oyster mushrooms, cheese, truffle oil and organic tomato sauce.  The pizza came out in about 20 minutes. It looked amazing and while it also tasted wonderful. The dough was fantastic. The best dough I've ever tasted on a pizza. The mushrooms and cheese were great as well. And the sauce?  Hey, where's the sauce?  No sauce on this pizza.  Dang. Was really looking forward to that part too.  So I was a bit disappointed that there was no sauce but overall it was a good pizza. Have to come back and see if this was a mistake or the online menu is incorrect.  I even checked it again when I got home.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "zTlUwNDgIG8kZzFIFg4YDw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Wild mushroom pizza (without the organic tomato sauce)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zTlUwNDgIG8kZzFIFg4YDw/o.jpg"
      }
    ],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "gqvsKsfmfjaP04IFjgoEng": {
    "date": "7/11/2016",
    "text": "How this place doesn't have 5 solid stars...the pizza, the ingredients, the flavors, and the customer service was on great!!! I couldn't make up my mind all I knew was I wanted their Pizza.  The guy at the counter helped me out....this Pizza was fantastic.   Pepperoni supreme and added arugula & spinach to it and they hooked me up w/free knots per Yelp check in offer. Glad I stood there and checked in.  Pros: great location, free parking w/purchase, pizza crust was awesome and knots were buttery soft.   Cons: none! Do yourself a favor, go earlier than actual lunch time or midday. All pros...no cons..",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "RmWC005hr7bYrNM1udhq1Q",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Pepperoni Pizza w/spinach &amp;amp; arugula with some awesome knots.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RmWC005hr7bYrNM1udhq1Q/o.jpg"
      }
    ],
    "user_id": "XrgcHURVAe_wys_jdweKLw"
  },
  "kbgzVSzOMdOqTxfoqn5dEQ": {
    "date": "12/1/2018",
    "text": "Excellent pizza! Had the Pure Country and highly recommend this simple classic pizza with thin crust and excellent tomato sauce as the base. Discussion with Gino about pizza dough, construction and ovens was very enlightening and enhanced the overall experience.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dj2o6qmpHBUM5d9Bz0PcRg"
  },
  "eCfa8a8QqEXbFX_QQq9i5A": {
    "date": "7/23/2015",
    "text": "I only ate a sandwich so I can't comment on the pizza. But this review is mostly for my vegan friends out there!   I had the shroom kugel sandwich, which has Daiya vegan cheese melted in it. It was nice and the homemade bread was a great touch. It looked like you could build a pizza too with vegan ingredients but I just tried the sandwich since it was already marked vegan!   I loved the location- it is in a place called 7th street market so you can gets lots of other things while you are there , like sushi, coffee, and a little market to buy sundry items such as jams, salts, veggies, chocolates etc.   Great little vegan spot and I woudk like to come back to also check out the rest of the area - the taps across the way we're a real treat! They had beer of their own, too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ch1L9FM-glGHso7zb7dXBA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Vegan Shroomy kugel sandwich (it something like that !)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ch1L9FM-glGHso7zb7dXBA/o.jpg"
      }
    ],
    "user_id": "mIo-tpgxDHl4hLUYg-30xA"
  },
  "rgcpFKARbR5jDkbtOYe73g": {
    "date": "11/19/2016",
    "text": "Wild mushroom pizza with mozzarella and truffle oil. Six slices. Pure taste bud happiness.  Seventh Street Market is the perfect casual date spot and Pure Pizza's kitchen makes sure to tickle your olfactory senses as soon as you walk through the door. While it was a slow Friday evening when we visited in mid-November before a show at the Booth Playhouse Uptown, there really wasn't any question of whether or not we were going to get some bread and cheese, just a matter of what particular ingredients were going to come on said pie.  A smattering of craft beers on tap, quick table service and reasonable prices. Yeah Pure Pizza!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pZioOLzVNpxyEVchL6LLsQ"
  },
  "jqRsNChQ08J03IRMDCeZRA": {
    "date": "2/3/2015",
    "text": "Dear Chorizo Pizza,    From the moment I saw your picture on Yelp, I knew I had to have you. The attraction was instantaneous and strong. When I finally met you on Saturday, it was MAGIC. Your crust, unique and delicious. I was bedazzled by mounds of chorizo and onions. Your fresh radishes, cilantro and lime only succeeded in fueling my passion. Your flavor was astounding and made my heart pound with excitement. Chorizo Pizza, where DID you come from? My dreams, only I hadn't dreamt you yet. You light up my life and are the wind beneath my wings. Love,  Michael  PS -  I love your Garlic Knots, thanks for the Jam Session and your Yelp deal was the icing on an already beautiful cake!!!",
    "rating": 5,
    "rated": {
      "funny": 17,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "rW2wtN0f380kZUJlPtUBqQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rW2wtN0f380kZUJlPtUBqQ/o.jpg"
      },
      {
        "img_id": "l0z4Ks4_MB91-exKzCbbVQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l0z4Ks4_MB91-exKzCbbVQ/o.jpg"
      },
      {
        "img_id": "e1529Mnl_wYB0SbVXoSYcw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e1529Mnl_wYB0SbVXoSYcw/o.jpg"
      }
    ],
    "user_id": "5jJjY5_R06Og56VfjIc66A"
  },
  "OqS0Rrit2R4LmPug7fuyhA": {
    "date": "4/2/2018",
    "text": "Ok, this review is for the 7th street market location, not the central avenue spot of which I have not visited.  The 7th street market location is their original spot and used to be very good.  The service has diminished considerably the last few times we have been here.  This is the prime example of ownership losing their grip on the managers of a restaurant.  My wife and I visited with a friend on a recent weekday evening, the market was busy but nothing crazy by any means.  My wife ordered a small pizza and so did our friend.  Wife ordered a chorizo pizza, it was OK, very light on the toppings compared to previous visits.  Our friend ordered a build your own with white sauce, it did not come with white sauce.  The person that dropped it off responded with \"it wasn't on the ticket\".  Ok, so no problem, we will walk ourselves up to check with the guy who took the order.  When we did, we got a blank stare, no offer to remake, no offer to do anything for that matter.  Not my kind of service.  I understand mistakes happen, for that I have no problem.  The problem is, you must correct that mistake if you want me to return to your establishment, they did not so that makes my decision easy.  Bottom line for me is, you are serving average pizza, you must make sure it is consistent and correct any mistakes you make, there are plenty of places to get average pizza.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wpNe40aRMjMAepGsuTQRrg"
  },
  "U54Y2RsgDjXB-bsUIZHlww": {
    "date": "3/21/2018",
    "text": "We used 30% off restaurant week and even though we had slight problem with getting coupon done with management the workers here let us get half and half done on a pizza even though they don't allow it. I enjoyed the ambiance and the food. I recommend trying the t-rex pizza",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FXPekABMZzkjdL5_x--JBw"
  },
  "iLvIT1cJw8PP1YGL-6_6Cw": {
    "date": "11/14/2016",
    "text": "Came here because of Yelp reviews and because I was right across the street while wandering through the streets if Charlotte. It was completely empty when we walked in which typically isn't a good sign but I wanted pizza!  They had some interesting full pizzas or pizza slices to offer. A few different meat pizzas including chorizo and pepperoni. We were thinking more vegetarian and they had some good options! We were deciding between the margherita, pesto and the veggie setting on the large veggie.   The pizza here is baked fresh with fresh ingredients. Definitely makes a difference. Not the best pizza I have ever had but pretty good. I will definitely be back to try some other options.   I will say that the decor is a little iffy. I understand they're going for a certain type of vibe but could use some updates. Definitely kind of old and janky.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VzF4VA9vSmE8jY3n0zr8qA"
  },
  "URKVry-8BnIcyQ2AH8GQCg": {
    "date": "3/12/2016",
    "text": "I guess I'm in the minority here. To me, the pizza tastes like a glorified version of Domino's. There is definitely a similarity in taste between the two.   If you're looking for New York pizza (real NY pizza, not the places that call themselves \"NY Pizza\"), then you will probably be disappointed. If you're not a pizza snob (as in from NY), then you should be good to go.   It's also a little on the expensive side in regards to value.  Fortunately, this experience led to the discovery of Cloud 9.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "3gRfkaVcEWri-Ju7OQX7uQ"
  },
  "ivA4zIepsRMmAFn8w9vLBQ": {
    "date": "7/12/2014",
    "text": "Great pizza with interesting toppings in the Seventh Street Market. And they have local beer on tap, what's not to love?  I got their chorizo topped pizza which also had some cilantro and fresh tomatoes. Made to order, it took a few minutes until it was brought to my table. By that time, I was well into my pint of Triple C's Golden Boy beer. I'll need another of those, please.  Prices are okay ($5 for a local draft is quite reasonable) and there were enough seats around the dinner hour. Note that they do close at around 7pm.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 11,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "87DaTOj80sm0o0LJ8SsEBQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Pure Pizza in the Seventh Street Market",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/87DaTOj80sm0o0LJ8SsEBQ/o.jpg"
      },
      {
        "img_id": "uh3Mi0NROqbnukWHArDyqw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Chorizo pizza from Pure Pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uh3Mi0NROqbnukWHArDyqw/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "CYoUdBiSw5Ji7PE8PrGfKw": {
    "date": "1/10/2018",
    "text": "I ordered the lunch special ( any one topping with a drink) I got the chicken topping and I must say it was very delicious ! My food came out in a timely manner as well . I love this location because it is something like large cafeteria setting without the grumpy lunch ladies lol . Will be returning again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NF3vUYgz6DFd8YPQmzB1WQ"
  },
  "-WFmigNe3SqkJ57Fpm1cAw": {
    "date": "9/1/2018",
    "text": "Literally the best pizza around.  I downloaded Yelp and made my first post because of this place.  The owner is super cool and bends over backwards to make sure you enjoy your meal.  The crust is so unique and tastes like nothing else, hearty, crispy.  Great toppings that are the freshest around, with a great atmosphere.  Have eaten here three days out of three on vacation. Gino is the best, the reason we come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N4js2uJBk26WY350zUfrTg"
  },
  "_CMTxjs2phR49q7BuSV2Tg": {
    "date": "6/17/2016",
    "text": "For a gluten free option for pizza while in this area of Charlotte this is a decent option.   Price good and they also had vegan cheese options for those who can't do dairy.     The pizza (individual size) was a great lunch.  The location is pretty nice.  Like an indoor 'farmers market' open daily.  Couple vendors, but mostly food and beverage place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xj6kMUw7q59UYZznQtHKDw"
  },
  "wVkzvRRwXrm3PakJ0z3Zew": {
    "date": "5/13/2017",
    "text": "Delicious and I love that literally everything in my calzone was local. And plus who puts chanterelle mushrooms in calzones, Come on Now...one star just for that!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_1V82FzpRkYI1tMsBqUiw"
  },
  "tzS_1Elb1a_e92eMRRn8hQ": {
    "date": "9/1/2015",
    "text": "I don't give many 5 stars, but this place definitely deserves it.  First off, try the garlic knots! They weren't too doughy and it was the perfect amount of garlic and cheese. As for pizza, I got the chorizo pizza. I love that they put radish on the pizza because I thought it tasted great with it. Next time, I really want to try T-rex. I've heard many great things about it.  While this place isn't the cheapest pizza joint (a small 10' runs for about $10.95), it's definitely one of the best in Charlotte. I drove about an hour just to try this out and I'll do it again! Also, I came in around 4. That isn't quite rush hour or dinner time, so I got my food really fast.   It's more food than it seems so don't underestimate the size. You will be full!  PS. THERE IS WIFI! Check the cash register for the password.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "z7GRlGOpN_nJEmUh4L5MGQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Small 10&amp;#39; chorizo pizza. YUM!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z7GRlGOpN_nJEmUh4L5MGQ/o.jpg"
      }
    ],
    "user_id": "SJEr0t98Op8WDVjhttkKLA"
  },
  "OQSzxHf9j8io9Yasr_fbdg": {
    "date": "3/12/2014",
    "text": "I've been to Pure Pizza twice now and could eat there everyday and probably never get sick of it.  The first time I went I had the Wild Mushroom and fell in love. I'm a sucker for truffle oil and that paired with Cottonmill Farms Oyster mushrooms, Grande mozzarella cheese and Bianco-Dinapoli organic tomato sauce... delicious.  After eating there the first time I started reading about Pure Pizza, how their crust was made, where their ingredients come from and fell more in love with each sentence I read.  You've really got to read about their pizza (<a href=\"/redir?url=http%3A%2F%2Fwww.purepizzaclt.com%2Fabout-our-pizza&s=6e73532e446352adf982a1916d20c7fa8a0eaf4f94720ae10c6c7838fd78841b\" target=\"_blank\" rel=\"nofollow\">purepizzaclt.com/about-o...</a>) and just go try it for yourself.  Yesterday, I took my Mom there and she had the Deconstructed Pulled Pork (Dan the Pig Man pulled pork, Grande mozzarella cheese, house made cilantro lime cole slaw. Topped with a Secret Sauce) and I forced myself to switch it up and get The Chorizo (Chorizo, tomatoes, fresh organic shaved radishes, chopped onions, cilantro, and lime juice). Needless to say, there were no left overs.  Both times I got my boyfriend a standard Pepperoni to go. I was hesitant since he's usually not into a \"better option\" pizza, but he loved it as well.  Go, right now. What are you waiting for?",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mw7CL9Obx17-fP5bRh7WgA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Deconstructed Pulled Pork (top) &amp;amp; The Chorizo (bottom)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mw7CL9Obx17-fP5bRh7WgA/o.jpg"
      }
    ],
    "user_id": "w5weMFEtBWqPN1jUO3U7sQ"
  },
  "kXGOM7rEgiGGVYoPq4iBzA": {
    "date": "3/23/2013",
    "text": "This is my lunch go to spot . i love that you can watch as the put your pizza together where it becomes a masterpiece. The honey for the crust is a must ... Oh yeah and they always have fruit infused water...love it",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "-ZlBgVsg4Jw_S8LrjtlQ2w"
  },
  "uBFs9xTSHghn8CUjfHdWNQ": {
    "date": "4/2/2016",
    "text": "I love this pizza. I would say the best pizza in Charlotte. I get the sprouted ancient grain which is great. They give you flavored honey to dip your crust in which is a nice touch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4iW8xCj02WlcyE9p2HCcZA"
  },
  "hZREpKdnEoJVjUCxCQ_XQQ": {
    "date": "2/24/2016",
    "text": "Went here with hubby and friends day before Valentine's. Entire 7th Street Public Market was slammed with people. We all spread out in search of yummy eats, and hubby and I were drawn to Pure Pizza for the aroma. Ordered a medium thin crust pepperoni and onion pizza and grabbed a seat right in front at the small bar area. They make a classic Neapolitan crust pizza, nice and thin. The pizza has a nice puffy (not burnt) edge. We usually leave what we call \"pizza bones,\" the outer edge of a pizza that's typically without much flavor. We found we consumed the entire pizza. Pepperoni was quite good. We watched Gino make all the pizzas, and you could tell he had decades of experience (confirmed after speaking with him for a moment.) It was fun to watch him. Some complained of the wait time. Gino cranked the pizzas out very quickly. We saw he was limited by how many he was able to fit in the oven. A little kindness goes a long way, people. A smile and a thumbs up to Gino and the rest of the gang was appreciated, and we appreciated the hot, tasty pizza!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ihlwoxrWko36cof8mBg5DA"
  },
  "Lme6yl15NuqtsST9FJ6Cfg": {
    "date": "6/3/2013",
    "text": "Love the sprouted grain crust. Consistently good pizza.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gJzJa1xrPXu0gD6Qh9i49w"
  },
  "CaW6VcSwHzyxQaepUJB0zA": {
    "date": "5/15/2013",
    "text": "The pizza was great!!! Crust was really good! When they offer you honey to dip the crust in, take it!!! TRY IT!!! We tried the 5 cheese and it was good! Had a nice smoked flavor!!!  Also I just loved it being in the 7th Street Fresh Market! That place in itself was really cool!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UnnrWQRy9MqFl0QihL97bA"
  },
  "LdhvWva7FoZ3mdFkwrbFkQ": {
    "date": "1/7/2016",
    "text": "Very good mushroom pizza! I park for work in the deck above this spot & it's nice to pick up a pizza on the way home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rITV0jp-ZUNuPnQDZF3iPw"
  },
  "oq4IaBCurxq4cv-cyLGzgA": {
    "date": "8/15/2015",
    "text": "Here for a conference but snuck away at lunch.  Pure pizza looked great.  I ordered the one with ham, mozzarella and basil.  Unfortunately I asked for the ancient grains crust because its unusual and sounded good.  The overly healthy crust was not to my taste.  Suddenly Gino appeared (I believe he is the father or father in law of one of the owners) and noticed I wasn't eating much.  He immediately asked about the crust and said its not his favorite either.  He insisted on bringing me another pizza with their regular crust (also made from locally ground flour, but the white kind).  The second pizza was really great.  I ate one piece immediately fresh from the oven - awesome- and brought the rest back to my hotel.  heated up in the microwave tonight it was still good for dinner, but of course the microwave removes a bit of crispiness.   The public market is on the small side but the merchants seem sincere and really concerned with good quality local ingredients.   You can also get a nice glass of wine from the little wine bar, which I did, and it makes for a good light meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Df8cm5gJ6d5e6phvOb6clQ"
  },
  "GA6pJbqtdQmHynJF71bg5A": {
    "date": "4/21/2014",
    "text": "This is my favorite spot in Charlotte for pizza! Love the farm to fork concept. The T-rex pizza is great for meatlovers. Famers salad is nice also. Located inside 7th street market with free parking validation. Wish they were open later!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PFwEdeiwXwnFMksAZVPTAQ"
  },
  "k0dbAoJFJe-arN9Xc_0EIA": {
    "date": "1/1/2013",
    "text": "Had a client meet up at the 7th Street Market & got the opportunity to try out Pure Pizza! We had (what I think was called) their T-Rex pizza. It was amazing! Everything they make is so fresh and full of flavor! I loved every bite! The owner is also extremely friendly! Be sure to say hello!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "xd5QlK41GPSER2zj5koz5w"
  },
  "KguBQIkDCsorWvGgxixjjQ": {
    "date": "12/14/2014",
    "text": "Short trip to CLT but got to check out 7th St Market.  We had dinner at Pure Pizza and it was great! We got the deconstructed pulled pork pizza and greek salad.  Salad was great, very fresh!  Pizza was also great and something out of the norm.  Definitely recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "gF0NoX3F18WRHe5DxfqfJQ"
  },
  "XgibdnjNOAvIG1n_JqI2Cg": {
    "date": "12/4/2012",
    "text": "Best Pizza in the QC in my opinion.. hands down!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "Vs4-FOAGiGx82Nsu355GHQ"
  },
  "ZD59Zs0aks8PjnGX3pam5Q": {
    "date": "8/4/2012",
    "text": "Best Gluten free Pizza my wife and I have had in the South!!  Sorry Mellow Mushroom, Pure pizza has you beat! Great crust, great taste and great service!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "kWQ8Z0Lzfbjrb-o0HFVOQQ"
  },
  "yAdSnfTT9L22a4JlMQ6T7Q": {
    "date": "6/18/2013",
    "text": "Love the 7th street Public Market & esp. Pure Pizza. We didn't realize they offered such healthy options (sprouted dough until after we ordered) so we'll def. try that next time. Saturday was a perfect time to stop @ the Market with the parking available right across the street & the light rail stop @ their doorstep.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mR3-sk3smjGfCDcbZV3Psw"
  },
  "t_IG8joD6ICgZUhN-x-Vdw": {
    "date": "1/10/2013",
    "text": "I went there based on reviews on yelp.  I was not let down! I got the wild mushroom personal pie and added spinach and fresh jalapenos on the ancient grains crust. It was amazing. The crust was perfectly cooked and all the toppings meshed well together.  They have many vegan options(daiya cheese). The owner and the other employee there were very nice and friendly.  I will definitely be going back next time I am in town.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bB-4r8OaM9fKUXhfQGqqZQ"
  },
  "eeeBozUUHjKFRR9jq-mvgA": {
    "date": "1/18/2014",
    "text": "I tried this place today for the first time and I have to say this was the best pizza I've had hands down. I had the Wild Mushroom pizza and it was so good with fresh ingredients.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8H9w4cIN9VBcV5ri7bPmcg"
  },
  "az2kcW0UV4XOBk-17tmv-w": {
    "date": "6/22/2012",
    "text": "I've only had one kind of pizza at Pure Pizza, but I loved it. I had the 5 cheese pizza on sprouted grain dough. I went at lunchtime on a weekday, and it wasn't that crowded (granted it was a Friday in the summer, when it seems to me like half of Charlotte doesn't go to work, so maybe it's busier other days). The 7th Street Market is a series of different, almost booth like, stores, from fresh juices, to a coffee bar, to a bakery to a butcher's case, and Pure Pizza is just about in the middle of it. You order up at the counter, and then site in a food court like area, and they bring the pizza out to you when it's done. It took a while for the pizza to come out, especially since I was on my lunch break, but once it arrived, it was well worth the wait! The 5 cheeses blended perfectly, but the best part was really the sprouted grain crust. They gave us a litle side of honey to dip the crust in, but it wasn't even needed, The crust had almost a baked in sweetness to it. I did dip in the honey once, but it was almost distracting from the full flavor the crust had on its own.  I ordered the 10\", to share with someone, and it was the perfect size. 3 regular sized (not those extra huge pieces you see sometimes now) for each person.  I loved the pizza, and I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "kdkEsWs1jlAaeJoN89-mgg"
  },
  "IrQlAuGw2BwwKjWtq8PN_w": {
    "date": "5/19/2015",
    "text": "We ordered a cheese pizza and it was quite good.   Garlic knots were phenomenal!  Marinara include with knots was really good too.  Ate outside and hung out on the train platform.  Good people watching!  Different honey dips were interesting and tasty.  Will come back if in the area. Staff was helpful although it was quite busy on a Saturday afternoon.  The yelp deal was only good after 4.  Not sure if that is still the case.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AqR5QPXCbJ-MGe4U4dhkYA"
  },
  "NblnHexVkxVk7eu-8brdGA": {
    "date": "11/20/2012",
    "text": "We have always loved the 7th Street Market and as we watched it grow we usually did it by sitting at one of those tables in the middle of the open space eating a Tyrannosaurus Rex Pizza.  The crust is amazing.  My wife loves the honey they give you to dip the crust into.  I have to say it is absolutely one of the best pizzas I have ever had in Charlotte or anywhere.  It is worth a try and I hope to see you at the table next to us some weekend, watching the market grow.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LP9j1YqgWPJGw1zY_LRuzg"
  },
  "E0A2ay5hvbksmSVYXbxQ4g": {
    "date": "12/6/2014",
    "text": "My son and I are in town for a football game (go Jackets!) and stopped in for dinner.  The T-Rex is simply one of the best pizzas we have ever had.  Super thin crust, fresh ingredients, and excellent pizza.  This would be my pizza joint if I lived in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "keSeGhywmdijhO3A_HOLMg"
  },
  "YK5ZAJgPAx9VrMAb9_NPug": {
    "date": "11/8/2014",
    "text": "Great atmosphere and beer selection! Located in uptown charlotte inside the 7th street public market.  Awesome place to have some casual pizza, have a beer, relax and enjoy the rest of the market.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "roK0QNWIZDk7wZds64YuSQ"
  },
  "vmqNoaGQR5VMw4hrukS0yQ": {
    "date": "1/21/2015",
    "text": "Bought a $20 for $10 Groupon.  Absolutely insane considering how good this pizza is.  Good, old fashioned pizza with fresh ingredients, the way it should be.  The Pepperoni Supreme is everything I've ever wanted in a pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ruSJ4yaLjZoeZbtIJaCxng"
  },
  "Sqb42LFoQBn1FIOtU2cK_w": {
    "date": "5/4/2014",
    "text": "As a person who has not been able to go out to a pizza place and order a pizza like a normal person for a few years now due to gradually increasing wheat intolerance, I want to thank this place for existing. Their sprouted ancient grains gluten free crust is not a perfect replica of regular pizza crust (how can it be?) but it is tasty and has a good texture, and holds up to being held in your hand as you chew on a slice. The topping combinations are pretty interesting and everything tastes fresh and healthy.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "fo3aQuxapB_QJ5lcCHOVIA"
  },
  "tkbf28rQ_phDsISTh40qmw": {
    "date": "5/23/2015",
    "text": "Must have!!! Don't forget to add honey to the crust. You won't be disappointed. If you like meat, try the T-Rex. It's mouthwatering",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iPPAVnFf2aMf5OWas3qX2Q"
  },
  "_vvntHTB6ZIeejtaGWDupA": {
    "date": "5/1/2015",
    "text": "Overall great experience! Friendly service, from the person taking our order making sure he got everything right, to the person making the pizza who took time to wave and smile at my toddler who was watching. The pizza was delicious; it satisfies my pizza craving without the post-pizza, greasy feeling! We ordered half chorizo and half wild mushroom on ancient grain crust. The chorizo was my favorite, the fresh cilantro and radish add freshness and texture to the bold flavor of the chorizo. Used the Yelp $20 for $10 deal and free garlic knots with check-in. For pizza of this quality it was a steal! My son inhaled the garlic knots... so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r298ohOpVQQj-ov0d7iu0w"
  },
  "BD2gLc4fCtAFTGS3arVX5A": {
    "date": "4/20/2012",
    "text": "Excellent pizza..best crust in CLT and the organic toppings run both to the traditional (pepperoni, sausage, etc) to the somewhat exotic (truffle oil, smoked salmon). Love both the special sauce (kind of like a spicy, chunky gazpacho) and the pepper-infused local honey to dip the crust in..both nice touches.  If I had a rub, it would be the price point. $12 for a 10 inch is a tad steep for where their digs are located (7th St Market) and the amentites provided.  That said, however, in this pizza-starved town of ours, the product really shines.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ovftMHprI8OHNLdiTiwnDQ"
  },
  "ogqLx_M6ZFUUeKjF6KTBxQ": {
    "date": "1/12/2015",
    "text": "The local mushroom pizza was very good. Nice crispy crust, and meaty, delicious mushrooms in generous proportions. The Greek salad on the side was only ok. The balance of greens to mixins was all off - way too much feta and onions and olives. The prices are a shade high, but the Yelp 50 percent off deal took the sting away. I would come back if I were in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gtSuS2tfsTxaEGez6NrkzA"
  },
  "d1Aw0BkE1oONiKCKjVZUUQ": {
    "date": "4/5/2015",
    "text": "We ordered a large pizza and garlic knots. We were very pleased with both. It's a great healthy alternative. The staff was very friendly. I'm happy we tried it when we visited Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tk7ZjeTJ7NjdJnMW1neISA"
  },
  "l9OGno2Hol5JixM9Vnj5Iw": {
    "date": "6/8/2015",
    "text": "I order a pizza to go, the same person that took my order also was making the pizza. A guy came up and  got a drink and handed the man two dollars . The cook never washed his hands and went back to making my pizza. This isn't sanitary and I will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1kxe1pnGigss7WHAr-GDxw"
  },
  "TK94jsLbNIPxt8iWp464TA": {
    "date": "10/28/2013",
    "text": "We stopped here as the place received great reviews on Yelp.  If you're not from Charlotte, this place is a little hard to find as nothing is really labeled on the street.  It was really nice looking from inside the market.  I knew the price of the pizza was going to be more than your standard pizza, but was willing to pay it based upon the great reviews they received.    Upon receiving the pizzas, I noticed that we did not get what we ordered (we received 2 plain cheese pizzas instead of specialty pizzas).  When I went back to inquire on this, they stated I was charged for a plain pizza and not a specialty pizza, and they messed up my order on accident (yet on the phone they repeated my order after I stated what I wanted, so I'm not sure how they could have messed it up).  They said they would make us new ones if I had 10 minutes to spare, but after already waiting to get the pizza I ordered, I did not have time to wait for them to correct their mistake. They should have refunded me my money for their mess up (that would have been better customer service).  Now the pizza, for being plain cheese, was not great.  The crust was very thin and almost rubber like. Now my kids eat just about any kind of pizza, and they would not eat this!    I would say pass on this place as it is just not worth the cost of the pizza with bland taste and bad customer service skills.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "H2z0Ch3tPj23FXcHHTRxAA"
  },
  "uByg6_ZKIUcFcCneGTk1OQ": {
    "date": "2/8/2014",
    "text": "I had this pizza for lunch the other day while in the market with a friend. It was my first time eating it and I was so surprised when they give you little cups of honey with your order without you even asking! It was local honey and it was delicious but not really my thing on pizza. We had the margherita and it was good, I wish that it had more cheese and it really could have used like three times the basil but the flavor was good and I am picky when it comes to pizza sauce.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "A-U-K9z9oraMH7eBZW1dOA"
  },
  "zGrowtz2vVvZ7Gf7RMXcAA": {
    "date": "8/3/2015",
    "text": "Juli, good news.  I've spoken with the fine folks over at Merriam-Webster and they have agreed to throw out the old definition of passive-aggressive and replace it with your reply.  Holy geez, that escalated quickly.  I don't feel I blasted your business at all.  I never said your employees were rude.  I made sure to make it known that your food is very good.  But perhaps I didn't make the lines far enough apart for you to read between.  So to clarify, one issue we have is the mystery pricing on the toppings.  I'm well aware that more toppings equal more money.  I'm just suggesting it would be nice to know how much money.  \"Starting at $1.50\" is vague.  I would just like to know is my sausage $1.50 or $2 or $3?  I don't like surprises when it comes to money...I doubt I'm alone on that. But the main issue we have is that your employees/managers are not empowered to the level that they should be.  I'm not a big groupon user.  I'm sorry I didn't know to scour the fine print for some arbitrary time that it was allowed.  But the fact is, we paid to park, we were there, we were hungry, we were looking forward to some great pizza, and it was not crowded at all...we were literally the only people eating at that time and it was only 45 minutes early.  So why draw a line in the sand on that when it would have taken 2 seconds to inform us of the time for future reference, work with us, and maintain a good relationship.  I'm sorry but that just makes sense to me.  If you want to go down with the \"you should have read the fine print\" ship, then by all means have at it.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "AzDNcxmF3idbbn5H_jUwzw"
  },
  "MVfxILnmi-XCFgKYKuJVfg": {
    "date": "3/15/2014",
    "text": "Fantastic pizza, great service. We had the T-Rex pizza and it was some of the best pizza I've ever had! Good prices, good service, and a sunny outdoor patio area.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-yxSg5ig_CtcvSTPgIZOEg"
  },
  "_-FiB01eNOuKowCsOtyQ1w": {
    "date": "1/23/2015",
    "text": "Artisan pizza. It's a thing these days with healthy crusts, organic toppings, local ingredients. All of these things attracted me to Pure Pizza as well as the top-notch reviews. I tend to order gluten-free when possible so I tried the GF and also the sprouted crust for my first Pure experience. This is after searching their website's menu, speaking of which--thanks for putting up detailed listings of your delicious combos but HEY can you please put how much your pizzas cost and also what sizes are available!? This became problematic when calling to order because the online menu does not specify what sizes you can get certain crusts made with.  Meh. It was good, not great, but pretty good. The GF crust was crisp on the bottom but had a slight cream of wheat texture on top. Having eaten GF many times I get that it won't be like the \"real\" thing, Pure was definitely tasty but the texture still was, ummm, interesting. The ancient grain crust was also tasty but still was slightly lacking for non-GF pizza. I did however really like that they give you a side of locally-sourced honey to dip your crust with, this is something I never would've thought myself but quite enjoyed it.  If someone asked me to recommend a place to get GF pizza I'd recommend this place, but if someone asked to just recommend a good pizza place I'd tell them to head to Portofino's or Fuel first.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iK0OD2iiiVmY-uHihmFhhQ"
  },
  "afqPWWuHwMTR0QQW2DdQTA": {
    "date": "5/18/2016",
    "text": "Outstanding pizza. Best I have had in Charlotte. Pepperoni Supreme is a rock star! Love that they have different kinds of honey to dip your crusts in.  Very tasty!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zmsGTEY6XLhwzEn3amGV5w"
  },
  "OzIMBhJBA-jpYo1hS1ZGmw": {
    "date": "1/5/2015",
    "text": "My roommate and I found a groupon (still available) and we thought we would give it a try.  I was skeptical of the pizzas because they are not traditional in most ways.  Give them a try!  Pizza was amazing!    I only wish they had another location.  The 7th street Market closes around 7.  Other than that they were fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wKQHtZ48d4RFtv60pgFdvA"
  },
  "QReiSKYzY_evaymlQwirdQ": {
    "date": "1/11/2014",
    "text": "Many choices...specialty pizzas or build your own. Great arugula salad! Vegan and vegetarian options abound.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_gIrCe_g5pny6DAIsYVNQg"
  },
  "4dUh26ioMbN-f6XAuXT11w": {
    "date": "12/30/2013",
    "text": "I had the bbq chicken pizza for lunch today and it was excellent!!! It is my third time having it. I'm not sure if it's a NC thing or not but they give you a little cup of honey for your crust. Ummmm, it's actually pretty good! In a see of Pizza Hut and Dominoes meal deals you do get a bit of sticker shock at Pure. $11.95 for a small pizza...really? Good price on the beer though, $4 for a 20oz cup:)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cr7wM5n4zgGkl0oQugNbOQ"
  },
  "zvhy38HgjbgzKVHMopFh2w": {
    "date": "10/4/2014",
    "text": "Very good pizza. We got the pepperoni with garlic and ham. It was good but we didn't ask for the garlic and it was a pretty overwhelming flavor. The mushroom and sausage pizza that we got was very good as well. The Market area is nice as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qU9Q7XraFerv305h93eGFg"
  },
  "SGZ76fSOFWROsPF1XWz_Ag": {
    "date": "4/25/2016",
    "text": "The lady who works at the counter is always really cool. The prestige farms chicken sandwich is my go-to (I always sub the goat cheese for feta and leave the basalmic onions off). They always give you a healthy portion of salad as a side with sandwiches. I also love how everything is always so fresh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uVlDtv6jB7ZYFOLAWwm8Mw"
  },
  "KFpQeu3Levfmti2huSogug": {
    "date": "4/22/2016",
    "text": "Amazing pizza!  We have eaten here a few times and always love it.  Our favorites are the Mushroom and BBQ Chicken pizzas.  Sprouted grain crust and different honeys to dip the crust in.  YUM!  Probably the healthiest pizza you can eat, but delicious!  We also love the 7th Street Market and the various vendors. The building will validate your parking for 2 hours..  You can get dessert at the booth next door.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OAYCwfQv0L8jfzAqLHKXJQ"
  },
  "F4-iCaCarIAgcseUU0TKgg": {
    "date": "6/19/2018",
    "text": "Pure Pizza is a 7th street market staple and rightfully so!! It is delicious. The person taking my order was friendly and the other staff seemed the same way. My order came out quickly (even though it was during lunch rush: ~1 pm); I ordered takeout and it took less than 10 minutes!  As for the pizza itself, it is amazing! I got the Margherita this time (though all their specialty pizzas look delicious... mmm). It's your basic tomato sauce, mozzarella, and basil, but Pure Pizza does it so well! The mozzarella and basil are fresh and everything works so well together. The tomato sauce is bursting with flavor, but doesn't overpower the basil and cheese. The dipping oil on the side was a nice touch, too.  I love how Pure Pizza supports local causes, too! That gets 5 stars in my book! To sum it up, I can't wait to come back to Pure Pizza and try another pizza. 5 stars all around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "byaZhyJQflCHvOYJOvhu4Q",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. 10&amp;#39; Margherita Pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/byaZhyJQflCHvOYJOvhu4Q/o.jpg"
      },
      {
        "img_id": "8H5g6VWHNQsFMTChvwdXXA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Lunch special: Small pizza &amp;amp; drink for $8!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8H5g6VWHNQsFMTChvwdXXA/o.jpg"
      }
    ],
    "user_id": "vljWeZf0cL1m8VspMApIqA"
  },
  "ciEFH4Kal0g05NaK55TnCA": {
    "date": "4/28/2019",
    "text": "I ordered the calzone which was delish. There was plenty of great cheese with the perfect dough and their sauce on the side. I highly recommend this place and can't wait to try their pizza!! They have many options available.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0jaKiKemiUH4hCKLa_59ag"
  },
  "slFZYlbmmUImH5cRWobt1g": {
    "date": "7/27/2017",
    "text": "I was so, so, so disappointed with this place.  For $24+tip, you'd think that at least something would have gone right.  But no.    We ordered two 10\" pizzas.  One arrived 17 minutes after we ordered it and it looked like it had huge boils on it where the bread had swelled up and was burned without any toppings.  It looked like someone forgot to apply sunscreen (and by sunscreen I mean cheese) and it burned.  I'm used to seeing this on tourists at the beach, not on specialty pizzas.  Moreover, for a FIVE CHEESE pizza, there was surprisingly little cheese on it.  And although we were warned that the pizza had blue cheese (was she trying to scare us off?), it really tasted like generic mozzarella plus a little bit of goat.  I think we were missing three cheeses.  The delivery chick mumbled something when she dropped it off but I couldn't for the life of me catch a single syllable.    17 minutes was not great, but not the worst timing ever.  Our second pizza, however, didn't come out for another 12 minutes.  How is that possible?  We ordered two pizzas at the same time, but one came out AFTER an order placed SEVEN MINUTES AFTER US got their family sized pizza and drinks?  Well, if you are going to tell me that it just got stuck and/or forgotten in the oven all that time, you know, I might just have to agree with you.  It was even more burned than the first pizza.  And had even less cheese.  Seriously, less than half of the pizza had cheese on it.  Most of the pizza was either bare bread or just tomato sauce.  The ham was completely dried out and singed at the edges.  The roasted garlic was blackened.  CHARCOAL scrapings.    I was so annoyed, not the least at the ever-mumbling delivery person, that I wanted to walk it back to the counter and send it back.  Unfortunately, because it had taken so long, I had eaten most of the other pizza and my partner shoved the rest of this in his mouth so we could leave.    And we left crust.  That's how bad it was.  He NEVER leaves crust.  He's eaten my crust when it has sat on an uncovered plate in the fridge for three days being from a generic national chain.  And this after I had devoured most of his lunch in a feeble attempt to wait for my meal.  That's some bad crust...  P.S. Noted from another review that tipping is not expected here.  Keep that in mind, especially because if you tip before you actually get served, you might tip for terrible pizza and service.  They've got a tip jar on the counter--add to that after if you like what you've got.  Don't gamble ahead of time like I did.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9XQ6FUJLVGuCkBvNk0fh9A",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. My toppings seem to be missing. Less than half my pizza has cheese--or anything other than generic dried out tomato sauce on it!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9XQ6FUJLVGuCkBvNk0fh9A/o.jpg"
      },
      {
        "img_id": "dooykDW9BqzWUXENhCbzqw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. This five cheese pizza supposedly has blue cheese. I could taste mozzarella and a hint of goat crumble. Where&amp;#39;s the rest of the cheese???",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dooykDW9BqzWUXENhCbzqw/o.jpg"
      },
      {
        "img_id": "brpokCYJEd2CgePOLk4k6w",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Double double toil and trouble, pizza burn and crusty bubble. Blistered crust, singed dried up meat, and seared roasted garlic. Flavorless!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/brpokCYJEd2CgePOLk4k6w/o.jpg"
      }
    ],
    "user_id": "eqtEDyqn1kCXwlo2OKdW_Q"
  },
  "_Zp_5wWNM-5PZM0jIt_ZFQ": {
    "date": "3/31/2018",
    "text": "I'm taking classes at UNCC's city center and this place is within walking distance. The service is relatively fast. They hand knead the dough. I decided on a pepperoni calzone, they cost $7. The bread was a lot softer than it looked so that was a relief. They make them with ricotta and mozzarella cheese, I could have done without the ricotta. All my pepperonis were clumped together so that was an annoyance. At first I thought they were just stingy but upon further dissection I realized they were just in two places instead of all over. Kinda interested in trying their pizza.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cB_4AZh9WrktBt9jAwZguA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cB_4AZh9WrktBt9jAwZguA/o.jpg"
      }
    ],
    "user_id": "VWsPniQ335mkTtWYPksRtA"
  },
  "2_h62TftRC-A_ty0gjuT7Q": {
    "date": "3/5/2017",
    "text": "I came to 7th Street Public Market just to partake in vegan pizza at Pure Pizza and boy was the drive worth it.  Thank you once again fellow Yelpers for leading me to the promised land.   I took a moment to look at the menu. Still unsure of what to order, I asked the guy at the counter for a recommendation. He was super polite but no help. So I opted for wild mushroom pizza and substituted daiya for the mozzarella on the Neapolitan crust.   Accompanied by my pomegranate aranciata from Zia Pia (also in the market see review), I dug in with the best intentions to eat only half of the pizza. I failed miserably and ate it all. The crust was perfectly cooked and the perfect combination of soft, chewy and crispy. The mushrooms were perfectly seasoned and the truffle oil such depth to the flavor profile. The Daiya was perfectly cooked and gave the pizza a beautiful creaminess.   The pizza was so simple in its ingredient yet so wonderfully nuanced in its execution. It was worth the $15+ spent. I will most certainly be returning to partake in their pizzas in the very near future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3O05Ym3aeeKUjre2yfEmiw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3O05Ym3aeeKUjre2yfEmiw/o.jpg"
      }
    ],
    "user_id": "dKeYhtFgsc9E24trvx8FUQ"
  },
  "47Mwd5d_Eshp9QP0jh4fHA": {
    "date": "7/25/2018",
    "text": "Around 7:25pm I came in to order a sandwich to go. The young lady that took my order seemed to be bothered that I was there? \"Stay close so you can hear your ordered called!\"  Not sure if she was just rude, in a bad mood or just a millennial? I am banking, all of the above!!? Maybe they were about to close or maybe they never opened? Not sure?!  The (sadwich) was.... ok! It had a small Cesar salad along side.  Will not be back.... until they realize what time they are open to and every customer deserves the same service, no matter what.  Just being reasonable...",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wcyKmDs9CuRdw9fOd9199w"
  },
  "Na0CtQte0jsmUxPULUYjEg": {
    "date": "8/15/2018",
    "text": "The calzone was spectacular! The pizzas were good. The place, at Public Market, was awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PQspOCoMQcGs4amuM5GpCg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PQspOCoMQcGs4amuM5GpCg/o.jpg"
      }
    ],
    "user_id": "xuOkr0OZHf48GIf9OsDd9A"
  },
  "tV1t9TrskA6U93Yikg5Mxw": {
    "date": "7/30/2018",
    "text": "Great little pizza place in 7th Street market. I visited with my son after going to Imaginon across the street. I ordered the lunch special of a personal pepperoni pizza and drink for $8, I also checked in on Yelp and received a free order of their garlic knots.  The pizza took a little bit to come out (they are very busy during the lunch hour), but it was worth the wait.  The staff was friendly and helpful. Pizza was delicious. Definitely a new go-to for lunch when I'm in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8S-FWrALxKmXXJNE-UL9Jg"
  },
  "8tBN5ArimAx3nEqc505ebQ": {
    "date": "11/2/2017",
    "text": "After attending one of Yelp Charlotte's \"Made\" series, I went back to the market and had a new appreciation for Pure Pizza.  I have had many instances of eating here and all have been very good.  They range from sharing an afternoon snack with friends, to dining solo during the weekday, or fighting the weekend crowds to hang out at the market.  It's almost as if the 7th Street Public Market is the perfect venue for Pure Pizza.  The casual environment, plus locally sourced ingredients, and the health conscious approach all makes for a delicious and uncompromising local business that I would recommend to anyone visiting or living in Charlotte.    It's amazing so much flavor comes out of that small space they operate out of.  I have been meaning to check out their newly opened 2nd location (stand-alone) on Central.    Order at the counter and you will get a number so that the friendly staff can locate you in the market to deliver your freshly-made pies of amazing-ness.  Your choices range from:  10 inch pizza, 16 inch pizza, or a 9in gluten-free pizza.  Don't forget to put your pan away in the designated spot/bin!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "4-PlPZPs53GBcFbCxZzDzw": {
    "date": "3/10/2019",
    "text": "Gluten Free pizza crust is awful!  Brown rice, mushy, soggy and bread like.  I am disappointed because I called and asked if they made their  own GF dough and was told yes but that is not the case at all, this is definitely store bought and preformed, not good at all, wont be back. I can make better GF pizza myself at home!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LgCQSG-yH1l3JSgvUr7HWw"
  },
  "0cwUCdIuk7b1T4cYuV4usg": {
    "date": "3/3/2019",
    "text": "BEST PIZZA I HAVE EVER HAD!! I got the BBQ Chicken pizza and it was hands down the best pizza I have ever had. It comes with tomatos, onions, banana peppers, chicken, and North Carolina barbecue sauce. The combination of banana peppers and Carolina sauce lead to a unique taste that I have never tasted. It was sweet, but also spicy. Would 100% recommend this place to anyone who is looking for a new experience.  My friend had the Shroomin Krueger sandwich and it was delicious as well!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rvY2HKDGa1is0n7d8jBXLw"
  },
  "REfIl4DDtrUiG0BWFLpFXA": {
    "date": "7/17/2018",
    "text": "Got a 10 buffalo cauliflower pizza and it was fresh and yummy!! They also deliver to your table if you dine in. Also got a small size arugula salad and it turned out to be big! Love it. Will come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "chUbab3poxB0rlGrn0hkrQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Buffalo cauliflower (vegetarian) pizza - yummy!! (I asked no blue cheese)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/chUbab3poxB0rlGrn0hkrQ/o.jpg"
      }
    ],
    "user_id": "CUC2wuc4d8a6U5yUg7l7lA"
  },
  "Z15p7xuMZlmBInNYjzuOow": {
    "date": "7/21/2018",
    "text": "The crust is a little chewy and the sauce and cheese are nothing to write home about. It's a pretty decent pizza. I would say it's a little overpriced for what you get.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cXaxqEHWu_UnknlTEzfqaA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cXaxqEHWu_UnknlTEzfqaA/o.jpg"
      }
    ],
    "user_id": "uhH5SkUQR0QGMTknKvcDVg"
  },
  "JXXX2YR0-4ZrFJo7JqU3rw": {
    "date": "5/27/2018",
    "text": "Stopped in the 7th street market for lunch the other afternoon and my wife, son and myself all had an excellent lunch here! My son and I. It got the Hot Italian sandwich and my wife had a calzone. Absolutely delicious and everything was fresh. Service was prompt and courteous. We most certainly will be back and recommend this spot to anyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Bsrihsh2aPnQmg6iwaOcWw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Bsrihsh2aPnQmg6iwaOcWw/o.jpg"
      }
    ],
    "user_id": "uIMxiPmNHYcgMiu2YE2a9g"
  },
  "0Z2D39KYO1xfUzBCaCP-Zw": {
    "date": "12/18/2018",
    "text": "Absolutely delicious food. A very helpful staff and a very relaxed setup. Live music playing in the room and just an overall great vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s6HlV8dUZiuIoKksdxgIZA"
  },
  "_kz4UBEx_hCgTg0Rc_PmxA": {
    "date": "2/12/2018",
    "text": "Love the Pizza here, just had a takeout Chicken Jalapeno and a Sausage Mushroom.  I really like there crust and the sauce they put on it. Very good cheese ratio too. I think it could have had a bit more sausage. I love sausage though!  I could eat a slice every day. Garlic Knots are such little delicious treats also. Go you won't be disappointed!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "YFHrehv9nlluLMmn7eUUqw"
  },
  "4CWohCz3JL6g6BkCld5GOg": {
    "date": "3/31/2018",
    "text": "If you want good Pure Pizza, go to the Central Ave location.  The pizza at the 7th Street Market is very, very flimsy. You can barely pick it up without it falling over like a wet noodle.  Also, they used so much flour on the pizza that by the time we finished, our hands AND clothes were a mess.  Lastly, the flavor, or lack thereof, was non-existent, umm bland. It's not worth the time or money. Do yourself a favor and satisfy your hunger elsewhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WK0R6JgLM77a9DyuwzGMBw"
  },
  "0FlAezQ2EN1zs1JEvIYe1w": {
    "date": "4/6/2018",
    "text": "The ingredients are fresh and organic. The pizza isn't over cooked like most places. Orders come out quick. The price is a little high for the portions. That's the only reason I didn't give 5 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gt06ZMQH4BIoWdjS2-EnRw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gt06ZMQH4BIoWdjS2-EnRw/o.jpg"
      },
      {
        "img_id": "SYa6_twJklSWTE5qE0Qqiw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SYa6_twJklSWTE5qE0Qqiw/o.jpg"
      },
      {
        "img_id": "rFCGfARzYijNZmRkmKJsxg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rFCGfARzYijNZmRkmKJsxg/o.jpg"
      }
    ],
    "user_id": "UL1cN7493ro-VmsJC9jkqw"
  },
  "Alw9Vmbu9goL-ny19uYLHg": {
    "date": "2/27/2017",
    "text": "Stopped by the 7th Street Market location to grab some pizza and beer. I was looking for a slice but figured a 10\" Mediterranean pie (mozz, tomato, onions, spinach, olives, and feta) and a Legion Path to the Darkside would suffice.  Pizza was solid as was the people watching. After tip, my personal pie and a beer ran me $23 which was absolutely nutty but I suppose the Market knows they've got a captive audience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "U0zK340l3UzKzsGVH1oJmQ"
  },
  "2C5azWsPUqB-6INza7bplQ": {
    "date": "11/7/2017",
    "text": "These guys are pretty damn awesome. Their gluten-free crust is homemade and has super basic ingredients (read: no soy, potato starch, corn, etc), so it's all stuff I can eat! They make me happy!  I can't tell you how thankful I am there is a place that that has a truly healthful pizza. Service at this location and the friendliness of the staff is also always on point. There's usually a line for the pizza, but the wait doesn't ever seem to be all that long. Totally worth it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "2hii37dkKL4POcu6vh_6EA"
  },
  "V6-bIj4P0lgKUizJBpR1PA": {
    "date": "11/7/2015",
    "text": "As a girl from New Jersey, I love a good pizza. As a girl who loves pizza, I love pesto pizza. This place has it all. Wouldn't get pizza anywhere else in Charlotte. Not to mention the man behind the pizza is pretty awesome as well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YbVADSBXxTM_zftJ8ZekWA"
  },
  "P5CFivotXb3OF0hZzQzXRA": {
    "date": "11/3/2015",
    "text": "Best pizza in the southeast! My favorite is th T- Rex! The servers are always really accommodating and I enjoy every meal I eat there! Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wZ174oyhyvEu9ax60uPHCw"
  },
  "XMwBW923Or8FXa5gn3zFSQ": {
    "date": "3/20/2015",
    "text": "Great pizza. We watched the chef making the pizza while sitting at the bar. Pizza was fresh and the honey for dipping the crust was simply genius!  I'll never eat the crust without it now.  Loved it!  Can't wait to come back to Charlotte just for this!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vohp9SNkbbtSyfIynBzixA"
  },
  "GDDe2JToKkBsmAPnDxHjlA": {
    "date": "7/15/2015",
    "text": "Fantastic service, fantastic concept, fantastic food. Everything is delicious and fresh. Everything we've had has been perfect. The ingredients are the best quality and it really does make the difference. I can't wait for the new location on central ave, and the expanded menu with more gluten free options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPfybPoiiJdEOTocF027dQ"
  },
  "uXxIrYGiEkhiRSSmMcN2kA": {
    "date": "10/13/2014",
    "text": "I thought that the pizza was very good and I really love the atmosphere of the market. I will be a long time customer here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SsJWF2sydv8WI0zHy8IgJw"
  },
  "9KodW2Yt-BqgYls_mw3_mw": {
    "date": "11/14/2014",
    "text": "farm to table pizza is truly difficult to find, especially if you want gluten free.  This is the only pizza place I will go to in Charlotte.  Props for using quality ingredients!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0jZFVMcR8x_XZ5kGC0kMkQ"
  },
  "cjygIPIWMKKypnIvnpnTIA": {
    "date": "9/25/2014",
    "text": "I dig this spot for lunch. It reminds me of being home in New York. sitting in the 7th street market and taking in the things around you while eating this nearly perfect pizza is heart warming. Almost as good as standing in the streets of NYC with a slice the size of your head on wax paper. Almost. Good job Pure Pizza. Good job!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vVMwx-ccojMH5Hko0A_ZcA"
  },
  "p9ufMHWVCqmihrdQTxI2hQ": {
    "date": "10/13/2015",
    "text": "This Jersey Girl says...Amazing Pizza!  Margherita pie is on point! The dough is Thin, Airy & Crispy with a GREAT flavor!!  Cheese is delicious and sauce is perfect. So many nice combinations to choose from.  I like to try a new one each time I go.  Salads are a great size to fill you up.  Great Staff that takes pride in their creations especially Geno!! Healthy, Delicious and Inventive food in a nice relaxed atmoshere! Bravo!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lLkmC1AOuNFvHjWlHx8nIw"
  },
  "OwrpYnHciIoR2z4ndiw6Wg": {
    "date": "11/22/2014",
    "text": "Really good place for yummy pizza. I was on a raod trip with my girl when I decided to stop at this place and get a bite to eat. We were both very pleased with the food they serve. I'm glad we choose this place as our stop.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "E8evWNtZmVv64B_9xAif0Q"
  },
  "AELtAF8mcfP--Dq8LL-jEA": {
    "date": "6/12/2012",
    "text": "I've been here a few times now and I can officially declare fandom.  The pizza is good. The ingredients are noticeably fresh - the sweet bell peppers are particularly delightful. I've tried the original crust and the special \"ancient grain\" crust.  Both are a thin, chewy/grainy kind of feeling and have that oven fired taste.  They go easy on the sauce here, and there's an adequate amount of cheese (I personally like my pizzas to be dangerously cheesy, perhaps next time I'll just ask for it).  And definitely try dipping the crust in the chili-honey sauce, it's a nice touch.  Service is pretty quick, and the owner is super friendly.  It's a solid joint.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sEq92wZGPK39zGWZEa1iCQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Pepperoni and pepper on &amp;#34;ancient&amp;#34; grain crust.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sEq92wZGPK39zGWZEa1iCQ/o.jpg"
      }
    ],
    "user_id": "htzxDWzRt4Xd7UGy4t0yAw"
  },
  "vnauli1bdvtWoENTFR8WUA": {
    "date": "8/12/2015",
    "text": "Best pizza in Charlotte.   Wild mushroom is my favorite hands down but you really can't go wrong with any of their pizzas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vTzZjJDyOFtpP13XkDBU2w"
  },
  "YxR0Tiz6STsBSHwTRxxR_Q": {
    "date": "12/8/2014",
    "text": "Pretty good pizza!  A little pricey but bit tastes good.  The staff could be a bit friendlier... Maybe I've been spoiled coming from New York to the south where everyone seems super sweet... Maybe these folk ain't from around these parts.... But your pizza is good :-). Interesting toppings and suggested  styles.  But I love that they offer honey to dip the crust.  I wouldn't have thought that would work but it totally does.  Can't wait to try the next one",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_0LwemzCLchggFtEWHERDA"
  },
  "zSwt8s3i1dSZtluh8sQGGw": {
    "date": "1/27/2015",
    "text": "Amazing pizza and absolutely LOVE that they offer sprouted crust!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PBoJq8kGDURK0IloSP8utw"
  },
  "YtAd5bacNlN1C6-uTel0ow": {
    "date": "5/20/2012",
    "text": "So close to a five star rating, but I wasn't jumping up and down in my pants - just very happy and looking forward to going back. Enough? Definitely.   Roger and I shared a white mushroom pizza on sprouted grain dough recommended by a friend and fan in California. Delicious. Artfully layered and flavored and almost melting on my tongue. I'm still tasting it today.   While sitting, two friends happened to stop by for a pizza and ordered the single packaged glasses of wine. Sweet! Wish I had thought of that idea. Next time.  An artisan eatery that is worth a visit or two or three. So, happy to find some other crafty places in Charlotte. Maybe I'm starting to like it here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "YmDEZ-qFQlDqG4e6i2ylng"
  },
  "W6P7aS_Ru054UMkbElxlJw": {
    "date": "7/19/2016",
    "text": "The wild mushroom pizza is my favorite.  I am a bit disappointed in the fact that I asked and got confirmation that the pepperoni was beef.  It turns out that it's not!  If you don't know,  just say that you don't know!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dYh1RQA6V_qRJrxyXR_8rA"
  },
  "l0briX-7CdtHDlP_hnIo0w": {
    "date": "5/26/2016",
    "text": "An extremely rude employee at Pure Pizza (7th Street location) came from arround the counter and into the dining area and loudly shouted obscenities to me and slammed trays on the counter after I mistakenly placed my tray in the wrong cart for dirty dishes. My co-workers and I were embarrassed and humiliated. This site obviously lacks good customer service!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EyxwjxIlWaGzu-xk9szDNw"
  },
  "2biGqUC1B8HAVB9sNeDTCw": {
    "date": "3/31/2014",
    "text": "Mediocre pizza, bad Caesar salad, and high prices. On the positive side, service was good and we got our order very quickly.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Nf4qnh_blwZTD2mt-2RcA"
  },
  "-O3EyiO8JeP88sgz4qQaBQ": {
    "date": "1/30/2015",
    "text": "The atmosphere within the marketplace was very nice.  The pizza we ordered was very tasty.  I really enjoyed the cornmeal crust.  The unpleasant part was the excessive grease that topped the pizza.  I've never had to spend so much time dabbing a pizza with napkins before.  Normally a little grease doesn't bother me,  this was too much!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nnXXrH5q7J-UMJcy3-nCYg"
  },
  "6kr7TAOYn_1b96FCwENgjA": {
    "date": "9/8/2014",
    "text": "Both my friend and I were super pleased with the pizza. Only complaint either of us had was that we felt the chorizo pizza should have had more chorizo on it. I'll definitely be back. My mushroom and truffle oil pizza was to die for.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4Apq75fsTPBrvboKmzU2kA"
  },
  "zifx1IZZh9zX4b8AEfWDsg": {
    "date": "6/10/2014",
    "text": "Overall good pizza, but extremely expensive. Their pepperoni specialty pizza is $15.95 for a small 12 inches! Add one extra topping, and now you're up to about $20 for a personal-sized pizza. On top of that, their payment system asks for a tip up front.  An up-front request for a tip always feels a little awkward to me. Also, I'm not sure what I'm tipping for, there isn't much service to actually tip for.  The pizza is dropped off at your table. Napkins? Plates? Condiments? Red pepper? All kept at the bar area.  Leave all your stuff alone on the table, trek back up to the bar, and get it all yourself. You are also expected to bus your own table.   The rest of the choices there are good, including their salads and sandwiches. All still very pricey.   Conclusion: good food, but you pay thru the nose for it. Is their pizza 3x as good as Fuel? Definitely not.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUGo18ds_tCnps4d1HCAbA"
  },
  "Dgf1Lth7Aa44QTDPqZNPwA": {
    "date": "9/10/2019",
    "text": "Wild mushroom Gluten free pizza - yum.   Has a homemade taste that is a nice variety from the national chains like Blaze.   Quality ingredients, easy ordering, quick order fulfillment and plenty of seating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T3Dl1t1TUO3AJ_SMqdzwiw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Gluten free wild mushroom (yum!)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T3Dl1t1TUO3AJ_SMqdzwiw/o.jpg"
      }
    ],
    "user_id": "UJPy-RaihCkZM0cduqKpBg"
  },
  "EdBVJD-r3BEGH41dqABbow": {
    "date": "8/13/2019",
    "text": "Why isn't there a Pure Pizza in the suburbs?!  I have to drive all the way into town to get some of the best crust and the freshest ingredients around. The employees are friendly, helpful and happy to be there and it shows.   Master pizza maker Geno D and handiwork will not disappoint.   If you're in the neighborhood don't hesitate, just go eat all of it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZhiWc4ZD_8m1QfEcbJxFrw"
  },
  "5EIpLKx4ly0P2YZwEzLpBw": {
    "date": "5/31/2019",
    "text": "This pizza place is a great option for a pizza night! I will say the pizza is a little smaller then some larger, but two people did eat it with just enough!   The sauce is a bit sweeter, but not a bad thing if you enjoy it sweeter! The crust was my favorite part, so soft when biting in but still crunchy  on the outside!   The 7th street market is super cool and I highly recommend checking it out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tICg3IVujq0MuSl3oI00CQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tICg3IVujq0MuSl3oI00CQ/o.jpg"
      },
      {
        "img_id": "tAaYfnR-U8wC--3uzK4-6A",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Cheese pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tAaYfnR-U8wC--3uzK4-6A/o.jpg"
      }
    ],
    "user_id": "f6oyZA1DUdVEqewR95TSdA"
  },
  "w2_8KYbVWYYTaGpWL6P0JA": {
    "date": "9/11/2019",
    "text": "OMG! This pizza place is amazing! Loved all the unique options, especially for vegetarians/vegans!  Loved the ancient grain (healthy) crust and the Kale Yeah (also healthy) pizza. They offer complimentary honey to dip your crust in, I tried the bourbon flavor (extremely yummy) and the spicy red pepper (what can be bad?). In a Pepsi town they have Coke products (yeah!). The market this place is housed in is also great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n9TLDv9bUrtRCcAen82vlQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Vegetarian/vegan menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n9TLDv9bUrtRCcAen82vlQ/o.jpg"
      },
      {
        "img_id": "gs8ezrdbJT7CpbFP8UJ-8A",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gs8ezrdbJT7CpbFP8UJ-8A/o.jpg"
      }
    ],
    "user_id": "yOQwoJNMRlQKzVyQIlcouA"
  },
  "gdpwVWnkA8P5dfDBx5fAqw": {
    "date": "3/6/2019",
    "text": "Great lunch spot inside of 7th Street Public Market. Most people probably come here for pizza, but I got a salad.   Warning a large salad is seriously large. It takes up the space of a pizza pan. I ordered the Greek with chicken. Order a protein. You won't regret it. My order came out really quick. My friends went to other places but I got mine first.   When it came out, someone even said \"Wow. That's a salad!\"  It was good. The ingredients were basic, but super fresh. And there was plenty of chicken which was tender and flavorful. Plenty of olives and feta, too! My only complaint is some of the lettuce pieces were too big and it was hard to eat.   I didn't check in until after I ordered, but you do get garlic knots for checking in. I'll use it next time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "qp8ddgt5rrnup8Qwo-uc7A",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Large Greek Chicken Salad.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qp8ddgt5rrnup8Qwo-uc7A/o.jpg"
      }
    ],
    "user_id": "0cG35-H4SbjjTTSlNoK3fw"
  },
  "jvf9dERq0EGmfAU4X222uw": {
    "date": "7/13/2019",
    "text": "I don't know how this place can go by the name Pure Pizza. The pizza was not healthyish by any means and the ingredients didn't seem fresh either. The lady behind the counter did not have a good attitude at all - seemed annoyed to be working and while we were placing our order kept looking and talking to someone else. we took our leftover to our hotel room and the pizza smelled so bad we had to get rid of it. Wouldn't eat here again. We had the garlic knots and they didn't have any garlic taste to them. Not sure if we came on an off night but ew didn't enjoy our experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wSeZ7ph-9AbjgK3z-4A_iA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wSeZ7ph-9AbjgK3z-4A_iA/o.jpg"
      }
    ],
    "user_id": "Wxd9_FATaozi0dhgeh3cPQ"
  },
  "ob_cMzKT7PwRXQAUlWQ_uw": {
    "date": "2/5/2019",
    "text": "Great pizza and great people! You can tell they use quality ingredients and you'll taste it on your first bite. They are very friendly and helpful and serve up delicious fresh pizza, salads, and some amazing Stromboli's!!!    I definitely recommend either one of their locations as you won't be disappointed. The owner of this place is an amazing humanitarian and an asset to the City of Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "HrMv8vtW9Cpgi6O5jHcojQ"
  },
  "KIjlesQAV7hiADXxdzvFKw": {
    "date": "2/7/2019",
    "text": "Great little joint in 7th Street Market!  I know I know you probably can't really review this place if you've never had the pizza -- is what someone with no imagination would say.  While I'll say that my first experience with Pure Pizza was one where I was pretty inebriated, I've been back since and it's never let me down.    Since I first drunkenly stumbled in, I've ordered the hot Italian sandwich.  It started as a random decision and now I refuse to try anything else.  It's that good.  Seriously, if you go just disregard the name of the restaurant and order the hot Italian sandwich.  And then next time you go back, you should probably try the pizza because I'm sure it's amazing too.    Awesome spot in 7SM and a regular go-to for me.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uJftKIM8Cpo9lJhxMQB2_A"
  },
  "-ZFMIOefQS5xF02AigvcrA": {
    "date": "8/3/2019",
    "text": "Best Italian sandwich in the city, hands down. They make their own foccacia bread (swoons) and it is deliciously crisp in all the right places. Even if there is a line, it moves very quickly. And they get your food out to you just as expeditiously. You will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IYdyWx768HTNKPoVjqcBsw"
  },
  "Wd3FcbY5cXbNOfZW_Clt9g": {
    "date": "8/15/2019",
    "text": "I always get the calzone because its affordable and seriously delicious. So much cheese and great tasting pepperoni. It is a great addition to a 7th street market feast. I didnt give it 5 stars because their pizza is pretty expensive but the other menu options are great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H61dNiTHkySboLikXA8zIA"
  },
  "pxIRBchPPd7q7Atu6b3gpg": {
    "date": "3/11/2019",
    "text": "Garlic Knots were definitely the highlight of my visit. They were buttery, garlicky, and divine! Absolutely loved it. The menu was very diverse in their offering of specialty pizzas as well as offering the option to build your own.   Wish I could brag about how amazing the pizza was, but aside if from the knots, I'm not really overly impressed. I will say that the crust was really great. While the descriptions on the menu were very intriguing, the execution was lack-luster. There wasn't enough sauce or cheese, although the presentation was well done.   Can't say that I would go back.    Upside, restaurant was clean and very nicely decorated.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sgeY29fgFqACCiUtSH1MOw"
  },
  "SHNnOwVl6TYccvGOB1Mm3Q": {
    "date": "9/1/2019",
    "text": "Delicious pizza and great quality ingredients. I love the sprouted crust!! It digests way easier and tastes great",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jI-k3A2khm1a2cYTOVXOTg"
  },
  "JpYiTPo68QfIi3eVlCXbBA": {
    "date": "4/28/2019",
    "text": "Pizza in the 7th street market in Charlotte. Decent pizza and fairly quick service. They offer a variety of specialty pizzas with decent prices. Not a bad little stop if you find yourself at the market.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "x-Uzdd8Ti9OvKl0_XvT3Yg"
  },
  "yv6eL4qDsqSs-ZtFECxk2A": {
    "date": "7/22/2019",
    "text": "I've visited a few times and am always greeted by friendly staff.  Great pizzas and sandwiches! They can pretty much accommodate any request for alterations to what's on the menu.  Not a big pizza fan unless it's Pure Pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EjH1z3Do6ZAvC7fkr_Xh5w"
  },
  "h6inDpYjtSZ1rXBbubacVw": {
    "date": "6/7/2019",
    "text": "The flavors were good but the calzone was cold where it was cut. They should keep it closed as the cheese got ice cold on both sides until you got a few bites in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mWztycc8ouVFmhlt_kX0sw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mWztycc8ouVFmhlt_kX0sw/o.jpg"
      }
    ],
    "user_id": "Q2qo-zvinsjZUmmvzfxUJw"
  },
  "z8PZCpSDooFZLDX08KqS5w": {
    "date": "1/7/2019",
    "text": "We we're at 7th street public market with some friends on Saturday night. My husband and I went to a few different vendors to get food, one of them being Pure Pizza.   We ordered the gluten free pepperoni pizza. I was pretty disappointed with the gluten free crust. It lacked flavor and something was off with the consistency. It was soggy on the bottom and then edges were charred/burnt crispy.   We'll have to try a regular pizza or salad next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hr3iSHRh59DhFX8dn_UReg"
  },
  "elJeEtLR4y8vQK03tohuFA": {
    "date": "7/29/2018",
    "text": "I'd go lower but I like the quality and flavor of the dishes.    I don't like the moody, attitude-y workers (owners maybe?!?).   First time, I dismissed it as oh he's having a bad day. Or just unfamiliar with the offer. Or that is just him ... kinda like I accept from Pizza Extreme UW campus workers or Pete Harris entire staff in LA @ their original location.   Nope, 2nd and 3rd time ...man oh man. Lady answering the phone either didn't want to be there or didn't care for my lack of knowledge.   The central/NODA/Plaza location is more chill with phone in orders but this is blocks from me. So, for now I'll grin and bear it. Maybe the 4th visit, Ill be offered or actually receive the honey that is referenced here in reviews, online at their site and via the TV playing a loop of their vendors and products procured.   Que sera sera.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "r-zUIQPaHzvIyL93wQaoiQ"
  },
  "fP5yeAtr4EGYPg8uCvEhPA": {
    "date": "5/9/2018",
    "text": "I really want to love pure pizza because they have great owners who support many local causes but I find their pizza a little bland.   The 7th Street public market location is one of the staples of the market and usually has a good beer line up. Don't forget that you can park in their ramp for free (up To 90 minutes) when you validate your parking ticket at one of their stamping machines.  I will say their small pizza is a perfect size for one person and has a hand tossed crust. They also have a gluten free and sprout crust for a dollar more.   They also have salads which look pretty good and I might try one of them next time I'm at one of their locations to see if I like that a bit better.   If you get the wild mushroom pizza I would say you should add garlic or pesto to add some flavor!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5rEgK8NaZL3TTPKjGhnqVQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Wild mushroom pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5rEgK8NaZL3TTPKjGhnqVQ/o.jpg"
      }
    ],
    "user_id": "8pmxwY_nmXYBzKPa-klk3Q"
  },
  "L5GLSs9vl5GiE4PCa7hJFw": {
    "date": "3/3/2018",
    "text": "Food stall expediency with restaurant quality!   I had a surprisingly delicious sandwich at a pizza place! pure pizza is located inside 7th st market, with an inconspicuous business sign- nestled in between a smoothie vendor and bakery stall.  Ordering was simple. Their specialty is obviously \"pizza\" but I got the chicken sandwich. It came with a choice of house or ceased salad, $9. I received my food within 5min. Super fast since It was lunch hour! The chicken is organic and their foccala bread is made in house. I was impressed by the entire presentation and the quality of the fresh ingredients. Hearty portions!   WiFi pwd at the register. free parking for upto 90min from the adjacent garage. Seating is limited so be prepared to scout.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ya8neZq_w1JS0FeLnZxZ5Q",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Chicken sandwich on foccala bread $9",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ya8neZq_w1JS0FeLnZxZ5Q/o.jpg"
      },
      {
        "img_id": "LpOPFIAk2L8ZoedrR8-OyQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Register",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LpOPFIAk2L8ZoedrR8-OyQ/o.jpg"
      },
      {
        "img_id": "S5dBus1rMGmYN07OmpVDkw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Garlic nots- free with yelp check in",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S5dBus1rMGmYN07OmpVDkw/o.jpg"
      }
    ],
    "user_id": "KNaUnmmFbw4h6X_EOWoOEg"
  },
  "Ijs-sFg0GARq8mrZeAC69Q": {
    "date": "3/18/2019",
    "text": "In town for the ACC tournament. We had been to the this \"Food Court\" before but had not eaten at Pure Pizza. We got a pizza, Caesar Salad and garlic knots. The pizza was good. The crust was the best part. The Caesar dressing was not great. Fast service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6RHyRaMcLq4pqv2cRb77A"
  },
  "CZ9xql8n3SjBCwzyhlIOow": {
    "date": "12/9/2015",
    "text": "Great local ingredients, great owner and staff.  I love their pizza flavors and salads.  I like that you can get a sprouted grain crust - it's delicious.  We've been coming here since they opened and we could bike there.  Now they have another location in Plaza Midwood and we love going there too since it's close to where we live.  Please check this place out - you won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XPlJeS2OJ2198VuVdkk73A"
  },
  "ypJH05rj3xalmoeAT1eeGg": {
    "date": "11/15/2015",
    "text": "Consistently quite and courteous service, even during the weekday lunch rush. The garlic knots are to die forth, with fresh garlic and basil topping tender yet crispy dough. The mushroom pizza is good but not as exciting as I had hoped. The smoked salmon pizza is a bit strange but amazing, a really different flavor combo for a pizza but similar to a bagel and lox. If you're feeling adventurous I would highly recommend the smoked salmon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GyJf71ss616pHZrFZpL42g"
  },
  "iHpqDF97hMk_RI26L5_qMw": {
    "date": "11/24/2015",
    "text": "Pure Pizza is a fantastic place for pizza. I love the sprouted grain crust since I'm partial to grainy dough with that kind of consistency. The truffle oil is a wonderful touch on the Wild Mushroom and the garlic knots are huge in addition to being savory and delicious. I can't wait to try the other varieties.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bl79pgiM2DTnYrNApbpIHw"
  },
  "oJXuLJbm6wr07DeY_MPHSw": {
    "date": "1/15/2016",
    "text": "I had a tastey salmon pizza on ancient grain dough. I think the toppings could be a little heavier ;-) next oll rewuest well done too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CNUIMSJtYIqvW77xsEM05A"
  },
  "qWiIN25aTd2S6F7cgrYMKg": {
    "date": "12/1/2015",
    "text": "The person who helped me recommended The Chorizo and I couldn't agree more. Good pizza with nice and light crust. I definitely recommend Pure Pizza and The Public Market.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i4hJ5uIul2ScBq49iBJfFA"
  },
  "BZg9Qtk7AYL1hdfK8uqh0g": {
    "date": "11/30/2015",
    "text": "Best pizza ever. Get the Slap Yo Mama Lasagna Pizza. You won't be disappointed. Trust me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VoWZwwZ-X0vg8ctwsKSSww"
  },
  "sHWMULr9uCBmyEhcXhYbAQ": {
    "date": "11/19/2014",
    "text": "SO delicious - the wild mushroom pizza is amazing. Love the thin crust and honey sauce",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "E3_J84yoe6zAm7ZM5HUuHQ"
  },
  "jxWJfdoyRhdXV80JfjJeuA": {
    "date": "7/5/2015",
    "text": "One of fav pizza joints in Charlotte. Not \"traditional\" pizza, but you're just not gonna find Chicago pizza in Charlotte (so I've given up looking). The crust is the right balance of crisp and chewy, the sauce is righteous, but it's the ingredients that make this place. Fresh and yummy with awesome combinations like truffle oil and mushrooms, or pepperoni with banana peppers and garlic. And they've got great salads too, when you wanna balance your Za with some greenery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Or-AkQ-JWGUTSCaBXlATGQ"
  },
  "P7bvX-FhaJUGyfDuunEWFg": {
    "date": "12/19/2015",
    "text": "Quilt free pizza, this one never fails to please. Though usually crowded the service if fast and efficient. Each time I have been we have tried a different pizza and all have had a unique taste. The freshness of the ingredients makes pizza eating anywhere else unthinkable. Casual laid back atmosphere, always lively.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HaI0334ZwJjUfAdMJEgXXg"
  },
  "0PmdnvBxSud_HVRqHjtUrQ": {
    "date": "7/7/2012",
    "text": "Neat little pizza place inside 7th Street Market! They make the floppy, NY style (if that's your thing), and it tastes incredible. I love the fact that they use natural, locally-sourced ingredients wherever possible. Meats, veg, even the flour for the dough is milled in NC. And naturally, they have local brews on tap (NoDa Red: if you haven't tried it yet, perfect with pizza).  You can do the simple, comfortable pizzas (cheese, pepperoni), but they also have some really inventive stuff. My visit, the pizza of the day was a field greens pie - cheese pizza with a locally-grown field greens mix on top. Everything comes to you hot and fresh, and it's hard to stop eating once you dig in. These guys know their stuff! If they offer you honey for your crust, take it. I've never dipped pizza crusts in honey before, but it works!  The staff are incredibly nice and make you feel welcome. Be sure to grab a pizza from Pure next time you are in the Market - you won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "yNsOssYIr3EzAoJAPBerqg"
  },
  "K8ttxICfqucUdKuniQLBjA": {
    "date": "9/24/2015",
    "text": "Best pizza I've had in Charlotte, plus I enjoy the atmosphere in the 7th Street Market. It's a laid back and cool place to grab a bite and have a beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z0kQXyFbSlXaEDLkYTKGEA"
  },
  "5zsBa6vh2a-M7ihZKBRJXA": {
    "date": "8/29/2015",
    "text": "We LOVE Pure Pizza! Wish we had one closer to our house. We like to walk over to Public Market after going to Imagineon with the kiddo. Pizza is always fresh and tasty! Crust is perfect. The salads are fresh and good also!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RhhPxndercYxvQB2JK4X3w"
  },
  "wMrBYiAt1rVYfMMvJqvxDg": {
    "date": "10/16/2014",
    "text": "You know when people say 'Mellow Mushroomm is awesome!\" and you think to yourself \"Man their crust is so rough and heavy that it dominates the pizza\" or \"Their ingredients are pretty lackluster\" or \"It's such a rip off\".  Well you don't have to have those thoughts at Pure Pizza. I don't know how they do it, but their crust is wheaty, the perfect amount of salty, hearty, and SOFT. On the top at least. The bottom has a perfect amount of crusty crunch.  I'm sure they calibrate their oven pretty regularly because this level of crust perfection is incredibly rare. I didn't want to oversell the place or \"get involved\" immediately but if you're the same sort of masochist and bite the plain crust before even getting into the sublime experience of the actual pizza like I did, you'll be happy.  We had the pizza supreme. Absolutely incredible. The thinly sliced garlic was the coup de grace. Plus the market it's in was awesome. Definitely give it a try.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cpkkojfuNh4zaXHvgDZoMw"
  },
  "7JC8fZgpK84onXLp8YZb0A": {
    "date": "8/5/2012",
    "text": "I normally do not like to five star something unless I have been at least twice. In this case my friend let me snag a slice of his pizza so I sort of went twice. It was packed on a Friday for lunch when we went. I ordered the chorizo pizza on whole wheat and he ordered the Five cheese. The pizza came out in about 10 minutes, maybe a little longer but not a long wait. It looked beautiful, cooked perfectly and it tasted as good as it looked. Toppings were balanced and nothing overpowered another topping. The crust was very good and filling, the cinnamon honey dipping for the crust was AHMAZING. If I did have a complaint it would be the lack of sauce, maybe it is just the pizza I ordered I could see tomato sauce being awkward with the toppings of this pizza. However, I am a fiend for a good tomato sauce. The five cheese was equally as good. The cheese's were of great quality and stringed for days.   It was hard for me to choose which pizza to order because they have so many inventive selections like Smoked Salmon and pulled pork. I can not wait to try it again.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "E09rILptXFZXsYuWgiXFiQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Wild mushroom pizza with truffle oil. Too good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E09rILptXFZXsYuWgiXFiQ/o.jpg"
      },
      {
        "img_id": "lqqXL93eIOrMtWr_vejahg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Wild mushroom on quinoa crust.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lqqXL93eIOrMtWr_vejahg/o.jpg"
      },
      {
        "img_id": "AhToaTPXz3szTATnfXTW-Q",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Keepin it simple",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AhToaTPXz3szTATnfXTW-Q/o.jpg"
      }
    ],
    "user_id": "kvSbYKO9Ir6gSgXNgWPDKA"
  },
  "G6BnPDzo_vJKdiYjMOqYLw": {
    "date": "1/2/2015",
    "text": "What can I say? That's some good pizza. Definately a must if you're in the Seventh Street Public Market area. I am a huge fan of the Margarita Pizza.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "imLtyO2idHHBvT2-OA_vhA"
  },
  "Iumr-z3XOtjP_UGT4dF6_w": {
    "date": "7/10/2015",
    "text": "The pizza here is AMAZING. It is NOT NYC greasy slices. If you are looking for that, try again. This is a hipster pizza joint with prosciutto and figs on the menu. It is amazing but not where you would go if you're craving traditional pizza. I love 7th market in general and this is a great little place. Do watch out: they close early on weekdays so dinner is an early bird special kind of thing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yGD9uuKEhsMwnghX828i3g"
  },
  "HlqFR6RPTrTGM5pue1oHCg": {
    "date": "9/9/2015",
    "text": "Excellent pizza, casual, located in a venue where you need to find a seat which can be challenging on weekends, but salad and pizza are excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jytC9bKH5FW33vLexuJh5w"
  },
  "RFX2OQXmkemGGLrG-Pw23g": {
    "date": "10/9/2015",
    "text": "I absolutely LOVE the pizza.  I usually just get the plain cheese pizza, it is that good and the crust is perfect.  Nice local microbrew selection... What's not to like?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BtH9EzJKNsn_nAta4pcAkQ"
  },
  "RGmkzqUkcVvHHprKweCZ9g": {
    "date": "12/22/2014",
    "text": "So yummy! You can't go wrong with the food here. Service is great too. They made a mistake and put onions on my pizza and were quick to make me another one without. When you check in, they reward you with free knots. Don't forget those. Mmmmm.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lOKYlcYfRc5_3lnijW_yZQ"
  },
  "7TWyKFVmQcuJQ42n8Gvikw": {
    "date": "5/26/2014",
    "text": "All the flavor without the yucky stuff. Hubby and I purchased 2 pizzas, the Pesto with sprouted crust and added chicken... oh the flavor was sooo AMAZING! We also got a savory large T-Rex... We loved them both. The organic, fresh ingredients are what drew me but the taste has made me a loyal customer for LIFE! Worth the 1 1/2 drive to get it!! You will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "sQ9Dl-uIZzGnYek6eIFaFQ"
  },
  "pTCApTLnaRhBKEWTjipQoQ": {
    "date": "5/17/2015",
    "text": "Three years and a hundred plus reviews later, Pure Pizza is going strong.  We stop in occasionally when going to an event uptown.  The food is just as good as it was when they opened and the beer selection is a nice addition.  It's worth a visit, but since they are in 7th Street Market, they close early.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s4cki7AiOrOjb5r-ZpbJUw"
  },
  "zD_nOIKYDQxnnYW33YaLgw": {
    "date": "8/13/2012",
    "text": "On my inaugural trip to the 7th Street Market, I ate at Pure Pizza. I had heard all the buzz and knew I had to try to try out and see if the hype was legit... And it was!  I had the the Pesto Pizza with the whole wheat crust and it was phenomenal!  Normally after eating pizza, you get that ucky sensation (and not just from consuming calories!) but Pure Pizza was very 'clean'.  I thought that the ingredients were very fresh and it was very well presented.  The side of honey to go with the crust was a great touch and truly showed the love and thought that went into the menu creation!  The staff was very welcoming and pleasant and i'm sure I will be back again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tRtCox8CxQolREE9lj99Sw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Pesto Pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tRtCox8CxQolREE9lj99Sw/o.jpg"
      }
    ],
    "user_id": "sq8rtkRoKA7KQKhlU4_yuQ"
  },
  "iqumP3QWSqyh0SOlnhmL9A": {
    "date": "4/30/2012",
    "text": "Pizza today is a tale of two cities- the one ordered en masse for speedy consumption by hungry hordes, the other on a smaller scale, as a chance for food artisans to show their chops, for everything from the crust to the mix of toppings showcased on top.  Pure Pizza, with its focus on locally-sourced ingredients, is new to town but quickly showing great promise amongst the artisan crowd.    Tucked into the 7th Street Market, Pure resembles little more than a food vendor at your local indoor mall, in that there is a counter and a series of glass guards separating you from the \"kitchen.\"  A menu board overhead describes the offerings and options available.  Seating is basic and plentiful in the middle of the market.  A quick look at the menu reveals a number of different pizzas and salads.  Pizzas come in 3 different sizes and in your choice of 2 different crusts- a basic white and a sprouted wheat/ancient grain.  Salads come in a choice of either a large or a small serving.  On my visit, the wife and I opted for a fresh arugula salad with goat cheese and a chorizo pizza on the sprouted wheat crust.  The salad was uber-fresh and bright with flavors.  With a lively lemon vinaigrette, it was like spring in bowl.  One minor quibble- the dressing was so cold the oils were semisolid, so we had to bring that up to temp a bit before pouring it over the salad.  The pizza, though, was brought out fresh from the oven and was worth the trip alone.  The crust had a great combination of crackling on the outside combined with a light and chewy interior.  That's no easy task with whole grains, but they have pulled it off well.  Choirzo was spicy and the cheese was a great contrast to it.  My favorite part?  The pepper-infused honey they give you to dip your crust into.  Unqiue and a great contrast to the savoriness of the pie.  Given that ingredients are farm-to-fork, it just adds to the experience to know you are eating seasonal and local foods that support area farmers.    Though we were stuffed, it was not hard to look up at the menu and imagine some of the other pizzas being equally good.  Everything from a classic margarita to a T-rex for the meat lovers sounded very good and will be worth a future visit.  Even breakfast is not out of the question as they have a smaller menu with 3 different pizzas there- each combining a egg on top of a pizza with as assortment of other ingredients.  Sounds tempting to me.  Given that Pure is right next to a bakery and with an artisnal coffee shop just across the way, you can get you fill and quench your foodie cravings all in one spot.  Combine that with 2 hour validated parking in uptown and you have a winner.  Pure is a welcome addition to the 7th Street Market and they fulfill a unqiue and developing niche in the pizza market.  Not a place to take the family when it's time for a quick dinner out, but a great spot for enjoying locally-sourced food prepared with skill and care.  Pure Pizza is so far pure goodness.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "ta6YFadw92KZmMpdLAFEZg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Chorizo Pizza on sprouted  wheat crust. Superb and different!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ta6YFadw92KZmMpdLAFEZg/o.jpg"
      }
    ],
    "user_id": "AwyM03qzhwgyskBruurWQw"
  },
  "Ll0zpXSeXFb3th0DHhW8NA": {
    "date": "10/15/2014",
    "text": "Pizza is subjective - typically the best pizza you have ever had is the one you grew up with...until now.  This is the best pizza I ever had.  Lived in the northeast and had Italians and Greeks make pizza for me.  Been to Italy.  This is better.  Get the spelt crust.  Get the margarita pizza, or anything else on the menu.  Get vino at the shop nearby an enjoy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rGQ0HVjO4d6miloFB90w8w"
  },
  "_sKwssm47mpQHoRZcAobuw": {
    "date": "12/12/2014",
    "text": "Quick and convenient, fresh and tasty, and served piping hot.  I ordered the wild mushroom pizza and while munching on it, watched a video about their local vendors.  It was nice touch for them to not only say \"locally sourced\" and \"good for ya\", but to film a visit to a mushroom grower in Locust, NC is pretty cool.  Yes, they are a little pricey, but dang, great food IS gonna cost some extra change.  Keep up the good work, Pure Pizza--you honor your name.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CjHWRUKXhhley9N9NLS07Q"
  },
  "cacWel9pIB_7YH18TYXdfw": {
    "date": "4/24/2015",
    "text": "I love this place!! I travel to Charlotte a lot for work and I find myself eating here almost every visit. The margarita pizza is delicious and with the sprouted grain crust I don't feel too guilty about eating pizza! The mushroom and truffle oil is a solid choice as well. I always think about trying a salad but my inner cheese demon is just too strong!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GJPkPtb6H3V2peLOcQ0xgQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Margarita Pizza!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GJPkPtb6H3V2peLOcQ0xgQ/o.jpg"
      }
    ],
    "user_id": "3DQe2RHredXB7RCtLK_vCA"
  },
  "rNuDxpfebGDP_-c9QYjrug": {
    "date": "9/8/2012",
    "text": "I finally made it to Pure Pizza recently and was impressed by the quality of the pie they're serving up! I ordered my pizza from the chalkboard above the cash register with a little help from the guy who took my order. He helped me to decide which crust and even sauce that was to go on my pizza. I decided on a 3-Cheese pizza on traditional crust with a \"special sauce\". It was de-lish! My pizza was brought right to me as I waited at a small table in the 7th st market nearby. The gentleman who brought my pizza even asked me if I needed anything else, although I'm sure he didn't have to. The 7th St. Market seems to be very much self-serve.   If I'm craving a personal pizza in uptown in the future, I'll be sure to return to Pure Pizza and try another yummy pie. Keep up the good work, guys!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RpNW_dsnssAgPA6OaE4DEw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RpNW_dsnssAgPA6OaE4DEw/o.jpg"
      }
    ],
    "user_id": "HUI9SrB4NW0GP0MUCCT6VA"
  },
  "tZAMwZLoGHBuSyjW6z9e_w": {
    "date": "7/28/2014",
    "text": "Farm-to-fork fresh and SO tasty! I went in with a Groupon in hand and left extremely satisfied. We had the BBQ Chicken Pizza, Arugula Salad and OMB Copper on draft. The pizza crust is thin, chewy and absolutely delish. Toppings are piled on heavy but thats just fine by me. I'll eat them off my plate with a fork, no problem ;) Without a deal, the prices are a bit on the high side. You're paying for the farm-to fork quality here.   With or without a deal, I shall return. It's that good.  Validated parking available for 7th street garage.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "EifxBPfn9EsHVgFOEpyb4A"
  },
  "p37bz2kFU1lS_2iQJNSAyA": {
    "date": "8/1/2014",
    "text": "My husband came home talking about an amazing pizza inside 7th street market. Apparently, it was so good he felt obliged to take me here the following day. We ordered half chorizo and half slap yo mama lasagna pizza, a 10\" cheese and garlic knots.   The woman running the counter was so friendly and helpful. She answered our questions and have recommendations.   I found a table while my partner ordered.  We waited a few minutes and they brought out the knots first followed with pizza a few minutes later.   The pizza was really good! The chorizo had such great flavors going on and the lasagna actually tasted like lasagna. Weird. I feel like that's a line from Willy Wonka. \"The snozberries taste like snozberries!\"   Anyway, overall it's a great little place to get delicious pizza in the market. They offer deals through Groupon and Yelp although we didn't use them. It's very casual and laid back atmosphere. Although if you want a table during peak times you might be out of luck. It gets busy. Like really busy during lunch.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "FSIJydQyRRWrA8qgLTMJXA"
  },
  "HnCkBgzF82W5tO9rKl5SrQ": {
    "date": "4/27/2016",
    "text": "I'm just not a fan of this place. Been here 2 times and both times it hasn't done anything for me. The pepperoni is over the top salty to the point that I was taking it off in an effort to salvage the pizza. My wife had the Wild Mushroom pizza and she wasn't overly impressed. Tried it twice, it's just not for me- won't be a third.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0G40sfRx04rxUMWURAJY4A"
  },
  "OgtE_dPFZnj553-NulxXYA": {
    "date": "6/16/2012",
    "text": "A friend invited me and my husband to the Top Chef challenge across the street from the 7th Street Market, and after she RAVED this was her favorite pizza in Charlotte, we had to try out a few Pure pizzas.   The setup of pure is like a food court-- order at the counter, and take a seat, and wait for your food. The pies took no time to come out.   We tried the pulled pork pizza, which was divine.  The dough so chewy and crisp, and slightly sweet.  The pie is topped with pickled cabbage for a nice fresh crisp and tang.    The chorizo pizza was flavor packed too...as was the simple tomato and cheese.    BTW: Each pizza comes with a tiny container of local honey.  Honey!  To dip your crust.  Even folks who aren't crust eaters will appreciate the touch.    BTW Part 2: If you can't make it down to the market, Pure made an appearance at the last Chow Down food truck rally.   BTW Part 3:  We had the regular crust and the sprouted...and honestly, there's not much difference when your pizza's got so many toppings and intense flavors.  I'd try both...the sprouted just makes you feel healthier :-)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "6JxrqtVO4oxuHqy_LaBXCg",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Great idea for cabbage on the pulled pork pizza.  DELISH!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6JxrqtVO4oxuHqy_LaBXCg/o.jpg"
      }
    ],
    "user_id": "7M-rWYRGPfCDnb7tjl7QGQ"
  },
  "DTuhF7OS-CgxVLgsVkRo8A": {
    "date": "8/16/2014",
    "text": "Never have I ever been let down by these guys. Personal fav: chorizo pizza. Everyone I've met is super friendly. Oh and they're salads are great too!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "R5PA-eHl9YRcTvfLJVDGGw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Save your crusts and ask for honey! They give you honey with spices in it to dip your crusts!!! So good.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/R5PA-eHl9YRcTvfLJVDGGw/o.jpg"
      }
    ],
    "user_id": "Td68aWGcXT6NEMEcVS7MDw"
  },
  "d7ma1AziQnoHzsS8ZR-3FA": {
    "date": "5/14/2012",
    "text": "While checking out the new 7th Street Market, we decided to have lunch there. Pure Pizza it is! The setup is nice; you order & pay at the same place & everything is made right there in plain view.   And the choices...you have plenty! They offer several tasty options for specialty pizzas, but you can make your own as well.  They also offer options for salads, but you can make your own, too.  We decided to go with the 10\" Pepperoni Supreme with the original crust (you can also choose whole wheat crust), which gave us four pieces total - & nice sized four pieces at that. I love that they use local ingredients.  The employees are friendly & attentive...& quick. We didn't have to wait long to get out pizza.  It was hot & fresh & ooooh....they give you a small container of honey for the crust! It's the little things! The pizza was delicious. The crust wasn't extremely \"dough-y\", which is good.  Seating is plentiful, but you're sharing that common area with the other vendors - so beware, it may get busy.  They have a cooler full of drinks...soft drinks, wine, the yummy Dr. Brown sodas, & water, among other choices.  I'm really pleased with Pure Pizza & will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "exEElE4pG-ZwoCMwoYddeg"
  },
  "7fxwXmm0fS5BwkzaNugDTQ": {
    "date": "5/9/2015",
    "text": "My wife and I had the garlic knots and 5 cheese pizza.  The garlic knots were tasty and a good portion.  The side of marinara was garnished with fresh herbs and Parm cheese and went perfectly with the knots and latter the pizza crust.  The pizza was made perfectly with good crust and a great selection of cheeses.  We really enjoyed the food and the staff was friendly and helpful.  The yelp deals made this a great deal.  Will eat here again!    One note, the 5 cheese isn't sauced with a red base, so if that's what you are wanting Try another pizza from their selection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "POPPhtDAAICLa4mwdoA91A"
  },
  "rjqU6Ilpb92o0UqA0lHz9A": {
    "date": "7/31/2012",
    "text": "Highly enjoyed my 2nd visit to Charlotte's Farm to Fork, Organic Pizzeria!  It's not very often that you come across a restaurant with great gluten free options, but to come across a pizza place that offers gluten free is almost unheard of. It's not just a regular pizza place either, this is all organic - local - farm fresh - deliciousness!  Guilt free carbs if you will :) We will be back and are letting all our vegan, vegetarian and gluten free friends know about this hot spot.  PS - They carry Vegan cheese for those who are also dairy free.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "CSJnUidR7y3yt2eiLOPp9g",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Gluten Free/Dairy Free :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CSJnUidR7y3yt2eiLOPp9g/o.jpg"
      }
    ],
    "user_id": "4aSAo1NdkQX6AUEsyWyZpw"
  },
  "y9iN8krxCGXATTWgxJLe9A": {
    "date": "2/26/2015",
    "text": "Pure pizza was pure heaven!   The crust was thin and crispy/chewy,  made with freshly ground organic flour. The smoked mozzarella was rich and savory - just the right amount. I made a pig of myself, and I don't regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3EIQ97Tn4ywCAXBqIe3hxA"
  },
  "xCZVROmrvY1f6_AZGd-yGA": {
    "date": "6/23/2016",
    "text": "Great pizza, but very, very expensive.   We were overcharged one time as well.  After spending $28 on a pizza we asked for a to-go box and they wanted to charge us for it.    They claimed it was their effort to have less waste and be green.  I get that, but charging for a small box is tacky after charging a premium.   The pizza itself is awesome.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kzK1CrIxIhu9HiB-VWmiKw"
  },
  "hMo7Dfxno_hSbPBkiFwogw": {
    "date": "5/22/2014",
    "text": "So, I've to this place a couple of times, LivingSocial coupon in hand, because they have gluten-free pizza, which the beau needs. The verdict: You NEED this pizza in your life!  One of my biggest dislikes about pizza in general is how greasy it usually is. Heavy, sits like a brick, makes you feel squicky for the rest of the day. Not so for Pure Pizza! It was light, airy, and surprisingly grease-free like I have never seen before. I could eat until I'm full and not feel totally disgusting afterward. Which I totally did.  Their gluten-free dough option is quite fluffy and holds up well. It even has an interesting whole-grain sort of taste that quickly grows on you. As someone who typically eats regular glutenous bread, I actually really like it.  Without a doubt, the Deconstructed Pulled Pork pizza is the BEST. God, I'm craving it as I type. The crispy, salty pork with the crunchy, sweet slaw on top of that soft, cheesy bread? I could eat it every day. I don't even usually like slaw. This stuff is seriously fresh. I can't get over it. The T-Rex is also a tasty option for you carnivores out there. It's positively sprawling with delicious meats and won't leave you disappointed.  The only complaint I have is that the employees are a bit aloof and not very friendly. But I can get over that, for the food. Pure Pizza is more like a savory pastry rather than an artery-clogging guilt machine. They've got a return customer for sure.  Be sure to get your parking ticket validated! The machine is over by the bulletin board near the door to the parking garage.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Stkp_hRQdH4miuTVToW2Lw"
  },
  "xFmMyARTdYP_pZ2nDCvUQQ": {
    "date": "9/13/2017",
    "text": "Great selection of pizzas. Went with the TRex and highly recommend it. I guess growing up as a kid with only Pizza Hut for pizza you tend to go with the meat lovers style. Fantastic flavor. The crust was solid. Nicely balanced. Oven cooked. It really complimented the toppings without getting in the way. This place is worth a stop if you are downtown. I liked the \"public market\" atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lD_7R6XQhPoWcBpw_GZG1A"
  },
  "gb58g_Mmq4InSrEsLJyEDg": {
    "date": "7/12/2015",
    "text": "To me, the True mark of an excellent restaurant is consistency.  Pure Pizza is that.  Quick, courteous service.  Fantastic food. It has been 5 star at every one of my visits.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X-EUd9-f1UorIM0xC3cdnA"
  },
  "u1vigVpHuERQWYytI6cb1g": {
    "date": "1/8/2016",
    "text": "My friend talked about this place so much, maybe that influenced but the pork pizza was not good at all.   The slaw in the middle was not appetizing, and the pizza was just meh.   Hesitant if I should try something else, because it was not worth the $$$",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IpQ9GA-qmEUMfoOnmdU2XQ"
  },
  "QDKGUaeNEy_y1TaWHULh9g": {
    "date": "10/26/2015",
    "text": "I was this place on my first visit to the market but opted for sushi.  Fast forward two weeks and I yelped pizza and Pure Pizza came up.  All the stars aligned and this amazing pizza found a new fan. Fantastic pizza and the garlic knots -Jezus!  The only thing Id change is parmesan free garlic knots.  Prepare yourself people.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QP7EpIw6mw7iLog3kLL0_g",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. T-rex pizza and Garlic knots add some Ale from Tank Tap and you are good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QP7EpIw6mw7iLog3kLL0_g/o.jpg"
      }
    ],
    "user_id": "pM8OjA4Ji4th32_fR_Bgsw"
  },
  "lemi_4DBNbnDJO2CU92bbA": {
    "date": "11/28/2013",
    "text": "Yeah, two stars and that's all it deserves! Sure the food is really tasty but that is really all Pure Pizza has going for it.  Look I get the whole organic/granola/hipster thing everyone is into these days. I like that we are getting back to real foods with real names from real people. But honestly this \"market\" aka \"food court\" is a prepackaged sterile side show! Its located in the heart of downtown Charlotte, and has the typical chalk board menus, old style metal chairs, and hokey 'barn' carts to hold food items. The walls are covered with images of vegetalbles/flowers/smiling people/and all that organic stuff. There are about 10 other shops in there (coffee, sushi, meat, wine, pizza, desserts, etc) and each one is playing on the farm local organic vibe. But come on people this was hand picked by marketing and designers to make you FEEL like your in an old world market/little farm town. And its specifically designed to pull in the younger crowd working in downtown that wants to be a part of that image.  Let me get off my soap box and talk about Pure Pizza. I ordered a medium and 3 bottled waters for a total of $24. The cost was a little high, but I thought maybe the pizza would be all that other Yelpers had raved about. I figured that would be more than enough for my wife and toddler to enjoy. Anyway, yes I did enjoy the pizza, but it was more like a small in the realm of pizzas. On top of that these pizzas are thin crust, no not crazy paper thin, but thinner than I was expecting and from seeing it I knew it would not be enough for my family. Regardless though the pizza was super tasty with a great crust and the honey to dip the crust in was a very pleasing. But all it did was make me want like 2 more pizzas! But I was not about to drop almost $75 dollars on a lunch! And how much were those stinking bottled waters!?! They weren't even anything special and actually they were super cheap bottled waters with caps that were annoying to take off. But whatever the pizza although amazing on taste is too expensive for the amount you get.   Yeah I know all organic and free range and vegan with no preservatives and high fructose corn syrup is worth the extra coin. But I can't recommend this place because of the cost:food ratio. It's that simple! In addition to the prepackaged 'market' theme that your immersed in... its just to fake for me.   There are better values in Charlotte than Pure Pizza. I'd rather go to the Penguin for some True local flavor!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7uqfdl2cRZDMhhDuTWOvGA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Wild mushroom and Pepperoni special",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7uqfdl2cRZDMhhDuTWOvGA/o.jpg"
      }
    ],
    "user_id": "Y9T1Bs05q8CZdPa4MHcaLA"
  },
  "Zszg4Mt4jbM7jsz6_eXSiA": {
    "date": "5/15/2013",
    "text": "It's hard for me to know where to start. But at Pure, I usually start with the Wild Mushroom pizza and don't get much further than that. It's sheer genius...and as a consumer of many a \"wild mushroom pizza,\" I have significant field experience.   Truly a magnificent pizza. I love the execution, and the accompanying video playing on loop that shows where exactly the mushrooms come from...come ON! This little locavore is a happy camper.  I must also give a shout out to the croutons (thanks to a sweet young lady working there who recommended adding them to a salad) as well as the lemon vinaigrette dressing. I'd eat just those two in a bowl and die of delight.  I've tried a few other pizzas there, and they've all been swell.   There's also honey dipping sauce for your crusts...why isn't EVERYONE else doing this? It's so brilliant...and makes the crispy crust taste into a post-slice dessert. The sprouted ancient grain crust is also worth trying...only available in the smaller pizza options, though.  Pure is a favorite of mine when I'm hungry and in the uptown area.    **for the vegans, they have daiya and can make many of the pizzas vegan-friendly with no loss of flavor!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "V8ezJY9Bi3eis5_DunSWFQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Chorizo pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/V8ezJY9Bi3eis5_DunSWFQ/o.jpg"
      },
      {
        "img_id": "YVlZ93NpyBZRYROYP4rNNw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Wild mushroom pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YVlZ93NpyBZRYROYP4rNNw/o.jpg"
      },
      {
        "img_id": "NACsRukwrGWLreer6G71Nw",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Greek salad with added croutons.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NACsRukwrGWLreer6G71Nw/o.jpg"
      }
    ],
    "user_id": "jfaz1aQqnkbtzQfQyCE8IA"
  },
  "zEGPiL3cUD0e2KgYLqEb3w": {
    "date": "2/3/2017",
    "text": "This is the best impromptu pizza place I've been to in a while. We got the calzones. One with pepperoncini and bacon, the other with spinach and chicken. What a great flavor! We sat at the bar top in front of where the chef, Lance, made our calzones and it was so great! It was like paying an everyday price for an in the kitchen dinner. Thanks for a great meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eMP026Z9uhbIsc9LOwLvUw"
  },
  "3JkH57kMvBwPn_9mzMht7g": {
    "date": "5/21/2013",
    "text": "OMG, why did I need a Groupon to find about this place? I can't believe I hadn't tried this for so long! Firstly, since this place is inside the 7th Street Market, parking is validated.  So there was this $10 for $20 Groupon deal for this place that came up on my phone. Because I hadn't heard of this place before I looked it up on Yelp and saw the reviews. Me and my boyfriend headed to this place the following weekend and ordered a large pizza, half Wild Mushroom, half Pure Country. Because everyone was raving about their sprouted grain crust we asked for that, unfortunately they don't do that for the large pizzas. Fortunately, their regular crust tastes delicious too! The Wild Mushroom is my #1 at this place. It is also my boyfriend's favorite, and did I mention, he DISLIKES mushrooms? Go figure!  The second time we went here we got so greedy, we ordered two large pizzas, thinking we would have them for lunch the following few days, and we did. The second time we did half Pepperoni Supreme, half T-Rex and a while Wild Mushroom! Oh Mother of God, that was like the best pizza weekend ever! Also, I really like how they give you honey and cinnamon sugar with the pizza to dip the crust in at the end. I enjoyed that part so much (especially since I throw away all the crust or give it to my boyfriend), that I started doing that with all pizzas I get from other stores. But no, sadly that doesn't taste so great with other pizza places. This place really has some magic ingredient in their crust, next time I'm seriously considering getting my pizza half wild mushroom, half plain crust!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "Q83R2UssCoErEJX36wrlvg"
  },
  "vUAXHHHj31BU_tysissLyg": {
    "date": "5/4/2013",
    "text": "7th Street market, what can I say other than I hate that I haven't been sooner?  We went next door to ImaginOn and decided to follow all the other \"cool Yelpers\" review and try Pure Pizza.  WOW, is about all I can say.  You walk up, and the menu is written on a chalkboard and it takes some time to process, the lady at the register was really great about answering questions and suggested that I try the \"Slap yo Mama Lasagna\" which I had on Ancient Sprouted Grain dough.  The pizza came out in record time and was chock full of tasty fare.  Ground beef, mozzarella cheese, basil, onions, and the tastiest damn tomato sauce I have had on a pizza yet.  The ancient sprouted grain dough was flavorful and had a nice rise to it which gave the pizza the right amount of fluff.  I got the small which was plenty and was glad I did.    I like places like this, and hope that it is successful since I will be come a more frequent customer.  It is appealing to me that there are many other neat places to check out while I'm there which makes this experience well worth the trip.  Great stuff Y'all!!!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "-rlIN1BFK65MyHWt_HhPJg"
  },
  "K_BCjnX3NNLW-SF5ZbkcTA": {
    "date": "3/25/2017",
    "text": "The unique pizza choices are amazing! Great selection of local beers. Worth a visit for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AcCHvXD2Amgzum6nRC7c6g"
  },
  "9AnTjs_luL62aoWbrmYpng": {
    "date": "9/3/2016",
    "text": "Left a real bad taste in my mouth.  Warning my pizza loving friends.  This restaurant needs a lesson in good business.  I ordered here tonight and they really screwed up and refused to make things right.  I ordered a large lasagna pizza half with beef, half with sausage.  What they gave us was a small with all beef and offered to charge us for another small pizza if we wanted more.  No offer of refund or remake.  Beware.  They will screw up your order and then refuse to fix the situation.  Will not be coming back and will be letting everybody know",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0zRVzrit6ciI-foVHHvGLQ"
  },
  "mw3V_ZdW-EO60XtufNURSQ": {
    "date": "2/17/2016",
    "text": "This pizza is delicious! & 7th Street Public Market is such a cool place to be! Even though it closes at 7pm, which is crazy, it's got an atrium feel with lots of locally owned and operated shops/food places inside. While we waited for our pizza, the T REX (grr) we sipped on some brews from Tank's Tap. The pizza was huge! More than enough for 2 people and absolutely scrumptious. With 4 or 5 kinds of meat and loaded with cheese, it's definitely a pizza you need a fork and knife to eat.... but there's nothing wrong with that! Everything is farm to table fresh and they even offer gluten free options! I love this place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NplX3c_jvX81BMZJi1gfTQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. T REX!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NplX3c_jvX81BMZJi1gfTQ/o.jpg"
      }
    ],
    "user_id": "87ESOpbAdmDGzyjOkFg7Mw"
  },
  "-ZL-NuG5JRg0QBmmMImhLQ": {
    "date": "1/18/2015",
    "text": "I'm not sure if I ate the same pizza as the other people who left reviews? Ordered garlic knots and a med 1/2 pep supreme and  1/2 bacon. The bacon was totally raw, they forgot the peperoncinis and the pizza (and garlic knots) were incredibly grease soaked. Brought the raw bacon to their attention and they said it comes in pre cooked. I'm telling you the bacon looked raw, was totally limp and slimy. This was not a good pizza.  In regard to the owners reply - your staff explained that the bacon comes in precooked so you should educated them not me on your process. Regardless how you prepare it - not good.   Secondly, yes a review can be damaging but that's what this forum is for - to tell about your experience and mine was not a good one.   Lastly, you should have left it at offering a redo but then following up with a lecture on my opinion and stating what your staff said left me with a 2nd bad impression.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "gyOScqxrq9aHIMAb7gaZvA"
  },
  "kwvGaoT5dsY1MR-aPvln-w": {
    "date": "8/31/2015",
    "text": "Oh this pizza is so so awesome. As you can see from my picture, I got spinach and mushroom with gluten-free crust. The cheese was rich, the spinach fresh, and the crust was nice and crispy. And the service was fast and portion size just right. Love Pure Pizza!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-0U_IbaSEokcscUfNHRYLA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Spinach mushroom pizza (gluten-free )",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-0U_IbaSEokcscUfNHRYLA/o.jpg"
      }
    ],
    "user_id": "1pigoFijaHVWGrQl1_tYjw"
  },
  "3kuSpiMefnKmdv5gAc92iA": {
    "date": "3/29/2016",
    "text": "Awesome!!!! The best mushroom pizza I ever had , 5 ***** , great place to unwind.  Manager is great too . All the best for Julie   Cy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZVYixgZLezT4C2EimVIDew"
  },
  "jyB9TmKMn3ZG06IOhlrWfQ": {
    "date": "10/15/2015",
    "text": "The gluten free \"Garlic\" bread sticks did not have an ounce of garlic in or on them. It was basically just a flat pizza bread crust with a very over-whelming flavor of oregano and basil, the marinara sauce was good tho, but it would have been better if the bread came even hot, it was stone cold bread.   Now the pizza...same crust as the not so garlic bread, and still that flavor of the bread masked the ingredients of the cheeses and spinach on my Mediterranean pizza. And I don't like a spongy texture for my crust as this one had, and was also burnt underneath. At least It was warm...not hot how i like pizza, but warm.  The only thing good was the honey they give you for dipping your crust in.  Now, the drink selection was limited, we got the very last coke...how do you run out of coke??? No ice, no lemons...and the coke had high fructose corn syrup in it where as my sprite was actually with real sugar...so they should have had at lest some consistency with their drink products...*sigh, not very satisfying at all.  And even as I write this, it has taken my bill at least 20 mins to get back to me or even more. On a thurs night they were busy, limited parking spaces, and very loud! Should have sat out side.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MSml7ff7sqk6i-ReeqveIg"
  },
  "zZcO-qzJ2ZrvtAuBi_Qfdg": {
    "date": "6/15/2016",
    "text": "Pizza was adequate but if I could, I would give a ZERO rating for customer service. We were visiting from Southern California and my friend's family took us here for lunch. My friend ordered a pizza with goat cheese because it's the only cheese she can have. When it came out with regular mozzarella, she tried to bring it back to the counter, and GENO was so aggressively rude and disrespectful that he had made my friend cry. How he could have the audacity to yell, gesture, snatch the pizza away, and slam it into the garbage like he did was unacceptable and offensive. Only after noticing that he had made her cry did he come out to our table to apologize and offer a gift card. Even if we lived there, he is enough reason to never give Pure Pizza our business again. Thanks but NO thanks.  Also, if you're going to act like that, please stop telling people you are from New Jersey. You are giving all of us a bad name.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kL_BtU8eaCJcdGlQZ77Ccw"
  },
  "lA6QSTBPqdwwgfLduvEEag": {
    "date": "10/1/2014",
    "text": "I don't know about you but my craving for Pizza is always coupled with immense guilt for wanting something so unhealthy! not any more though... =)  the Pizzas at Pure are not only delicious, but even after you have devoured an entire pizza you won't get up from your chair feeling overly full or bloated or gross! it probably has to do with the fact that they use fresh / local / organic (when possible) ingredients, and they keep the pizzas simple - thin crusts, moderate toppings, but a good / creative variety to choose from. Yes, I do think the pizzas are a little pricey for what they are; but there's no harm in treating yourself to some delicious, non guilt inducing pizza once in a while! my favorite, is the simplest one on their menu - the margarita pizza with honey on the side. If you're looking for a non tomato based one, the wild mushroom pizza is great. Their pepperoni supreme is pretty good as well, though I thought the pure country one could definitely use a little more prosciutto on it. Their menu also includes sandwiches, calzones and salads - may be I'll get to those some day, but for now I'm sticking with the pizza!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "MqVEbImMF6jYybA48_cufw"
  },
  "IAwg4BOiKPq8D-HvEr7_eQ": {
    "date": "8/6/2015",
    "text": "Only place worth eating pizza if you are coming from NY/NJ.  I have been here on my last two trips to Charlotte and will keep coming back.  The ingredients are fresh and they even give you some local honey to dip the yummy crust into.  We always get the large to get the True Neapolitan Crust.  What makes this place even more wonderful is we always see the owner working back there with the rest of his team.  This is a labor of love for him.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "edCPA-6lvh5wqclDBZPggQ"
  },
  "jQ64bivctvOFb5KZehnceQ": {
    "date": "6/4/2016",
    "text": "Customer service sucks. Dude on the phone was super concerned about closing at 7p when we called for pick up at 6:15p. Like he was doing us a favor to make a pizza or something.  But the pizza was good, the crust was soggy though, it might be because it had a crap ton of toppings. Whatevs, worth trying if you haven't been, we'll prob be back. The pizza was pretty good. Better than Fuel Southend.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "i4ylPexbrs-49uNSrFpcRw"
  },
  "fY6vRz6Z6TuMZ9k5wZOBiw": {
    "date": "8/20/2012",
    "text": "After all of my camping out at 7th Street Market, I finally made it over to Pure for lunch. After seeing multiple delicious pizzas make their rounds throughout the market to tables seated with happily expectant guests, the time was nigh.  Hanging out on a Saturday morning at the market is great. Tons of hustle and bustle. Hungry folks exploring the various vendors and stands. We enjoyed the morning crowd and had an early lunch.   My wife ordered the mushroom on the sprouted ancient grain crust and I ordered the chorizo pie on the traditional white crust. The mushroom had incredible, robust aromatics. Local shitaki mushrooms and a nice whisper of truffle. The crust is thin and chewy with tons of grainy flavor. That subtle truffle oil flavor....heaven. The chorizo was great. I appreciated the lime wedge to squeeze over the pie. It added the needed sourness to enhance the other savory flavors. I enjoyed chorizo, but the mushroom definitely took first prize of the two. Easily one of the best craft pizzas I've had in the QC.  They also have some great drink choices. Ting? I haven't seen this except at Jamaican restaurants and ethnic markets! How cool! I LOVE Ting. I used to drink it as a kid. It's a nice, perky flavor and works well with the pizza.   Price point is very fair for the craft they churn out, they bring the pizza to you where ever you are in the market, and you can even custom your pie to the world's end. I'm so stoked this place set up in the 7th Street Market!  Very much looking forward to going back. Cheers!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "yyX4jq2t6k-UiIB4R7t2EQ",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Chorizo pizza. Also amazing.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yyX4jq2t6k-UiIB4R7t2EQ/o.jpg"
      },
      {
        "img_id": "eGwfuhBgDvMekLpBoDfouA",
        "caption": "Photo of Pure Pizza - Charlotte, NC, United States. Mushroom pizza. Incredible.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eGwfuhBgDvMekLpBoDfouA/o.jpg"
      }
    ],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "se89XcxfTv64smv7tPjkJQ": {
    "date": "4/30/2016",
    "text": "Closed 20 minutes early on a Saturday night, during the Charlotte Criterium bike races. Did not get to try their food. But if a place does not stay open during the posted hours, how do they expect me to do that?",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "j0v_PNF9R2QqyIDiUPqf1w"
  }
}