{
  "mI5n-Sb0ghK9eHZUgGQpLA": {
    "date": "2/26/2014",
    "text": "Tavern on the tracks is a Buffalo Bills bar so be prepared to hear their chants on game day.  The food here is pretty good, and they have a good beer selections.  If you are in the South End area at around 1 A.M. this is a good spot to go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5FfJ0Z76U1T_OMwH-crx6g"
  },
  "osg5mJjuR28fIY3SCA314g": {
    "date": "9/19/2013",
    "text": "Great bar food and a wide selection of beer and liquor to quench your thirst!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UPk-37Fq9NElwpJ7AASr8g"
  },
  "1jOov3RKQcyuEuC1xWiK0A": {
    "date": "9/15/2010",
    "text": "On the right track....  Are you new to Charlotte? Maybe you are from the Buffalo, NY area or just a Michigan grad a little home sick for the M Go Blue. Well Tavern on the Tracks has got your back. This bar is kind of a home away from home for the aforementioned areas. I really dig the decor of this place. It really screams: Look at me I am a great old school bar.   I stopped by to watch the NBA Finals game seven between the Lakers/Celtics. Just moving from Boston, I was rooting for the old home team. It was not meant to be as Lakers lead by their lead punk Kobe took out the Celtics as payback. This was a great spot to catch the game. The beers where cold and the food was pretty good. I really wanted the wings, which looked awesome, but decided to try the Steak in the Grass sandwich, basically steak with melted cheese and spinach on top. It was might tasty. The staff was top notch.  So if you are in the mood to catch the big game or cold one jump on the train and check out TT!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "zDNZtoOftaS3NFrEP1FNfA"
  },
  "D36zipdcog32usfoBIO8TQ": {
    "date": "10/4/2011",
    "text": "Great little bar to grab a bite before getting your drink on at the Gin Mill.  I love the quaint atmosphere and seriously good bar bites. We had less than stellar service on our last visit, but you know, that's not what brings me into a place like this in the first place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "A_j2AiDpD12JNdeP1FWVMQ": {
    "date": "3/7/2011",
    "text": "It's probably a safe bet that I've spent more money and more time at Tavern on the Tracks than any other bar or restaurant in Charlotte.  It used to be a once a week spot (at a minimum) for me.  My review may be slightly biased, as I now know the owners and I know several of the employees quite well due to the time spent there.    The thing that Tavern does the best is food.  They have, in my opinion, the best bar food in Charlotte.  Some bars do one or two things well, but Tavern's menu is varied and every item on that menu that I've eaten has been consistently good.  The food is the reason I go back.  The beer selection is just OK, but the food is where it's at.    If you've just moved from upstate NY and are joining the 3/4 of Charlotte's population that is also from upstate NY, then this is the bar for you.  You can watch the Bills, the Sabres, the Yankees and drink Labatt Blue to your heart's content.  You can find beef on weck and delicious stuffed banana peppers.    If you're a fan of the University of Michigan this is the place for you on Saturday afternoons during football season.  It is the home of Charlotte's chapter of U of M boosters.  There is a stuffed wolverine on display at Tavern to show their love of Big Blue.    There seems to be a pretty quick turnover of servers here.  The really good servers stay and become great bartenders or get the busy shifts on the weekends.  Service can sometimes be an issue here, but it's never so poor that I avoid eating here.  Menu highlights for me are the stuffed banana peppers, the fried ravioli, the meatball sub and the black bean burger on a pita.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "05A1WpXkjCbVHCodTSc6sg"
  },
  "qAtp2uPYGPmvesFAi_bq3w": {
    "date": "5/8/2014",
    "text": "Went there last night for the second time this month. The first time was fine, nothing to complain about there. Last night, however, literally gave me nightmares.  We got there around 9:00 and decided to sit at a high top table instead of the bar. There was one in the back corner by the door and a few arcade games. It was fairly crowded because trivia was going on, and we just sat there and played along for a few minutes, which was fine. After we'd been there for about ten minutes, we saw a huge black shiny thing moving on the wall. It took me a second to realize it, but what we had seen was a GIANT cockroach crawling up the wall not five feet from us. It was crawling in the other direction so, while we were a little creeped out, we kind of ignored it and kept talking/trivia-ing. Then my friend's eyes got big again and he was looking right past me, so I turned around and there was a second roach crawling on the wall behind me, but this time in our direction. We jumped up and walked over to the bar. The bartender asked us if anything was okay and we told her no, we had just seen a few (turns out there were others that I hadn't seen) cockroaches crawling around in the one corner. Instead of apologizing to us, she just said, \"that's not us. it's not our fault, I swear!\" and she kept making excuses as to why it had happened. I went home and cleaned my apartment from top to bottom. Needless to say, I will not be going back to this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e9eJ5hdxijoqG3Shu0d79A"
  },
  "Nm5tODhYeLKzYGKQQsQkSA": {
    "date": "8/23/2010",
    "text": "Considering Tavern On the Tracks is just a hop, skip and crawl away from my house, it is indeed A-OK for me.   As the other reviewers said, the patio is pretty vast and a nice stop in the warmish months. This particular bar gets a ton of Panthers traffic before and after the game, which can be irritating if you just want to grab a sandwich on a Sunday night. But hey, they didn't invent football! That being said, the service can be spotty after a game considering the servers are doing their best to, um, cater to the drunkoids on the patio.   Besides the overall environment, though, I've had some pretty good eats and drinks here. The drinks are pretty standard - full bar and a multitude of brew options (mostly big brand beer here). I have been fairly impressed with their eats, though! The Toasted Ravioli is just smashing before or after you're smashed. This is important, folks - yes, it tastes good even if you're not drinking. I've also enjoyed the Turkey Pita and the delicious berry mayonnaise that accompanies it.   TOTT, a solid place to grab a bite, watch a game or just watch the hammered Panthers fan take down a bucket of beer and a messy burger. That's entertainment, for sure!",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "qlC607Cyp0Mj91vDFvkp3Q"
  },
  "1pwWilnrUF-khduvmdmvOg": {
    "date": "8/25/2013",
    "text": "Trivia on Wednesdays at 8pm with Rob from Little Dreamer Productions!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ziF9bL2WU9boE6du0yAIA"
  },
  "n_WHXSbxSPaDqKw3CALrkg": {
    "date": "10/26/2013",
    "text": "Manager sucked and food was worst.. If you aren't a regular they don't care about you",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "51edWbuRHhm0S58k_fIvvA"
  },
  "KvGk5QjB84T7BIZujvNaoA": {
    "date": "12/4/2015",
    "text": "You get ZERO stars!  I came with a group of 20+. We wanted to split our time between you an gin mill. Some in our party arrived before me and went to gin mill first. I was told if I left my car you would tow it. So, I move and not one of us will step foot in your establishment tonight or ever. Learn to be a neighbor.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jlSKHtoyVY1_XgwMgAvfAg"
  },
  "OhMWurVb42_7Dd0kVfagBA": {
    "date": "1/10/2013",
    "text": "good set up!  You can see TVs from any seat in the place!  Great place to watch games on Sunday because they also have a Bloody Mary bar that is the BEST I've been to in Charlotte!  I highly recommend this place, although I have not had their food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "06Wo_DOjBzKvsdzqznEXGA"
  },
  "mjKLXdyxlkNxEt25jQH6OA": {
    "date": "7/18/2011",
    "text": "Very pleasantly surprised by this joint--I had my doubts when we first arrived...  Slow service AT FIRST, but once the waitstaff settled on which waitress was going to take care of us--wonderful!  I went with a group of 6. Everyone got something different. I tried the 1/2 beef on weck with 6 wings (of course I'm going to get the wings). The 1/2 beef was surely a full size--it was huge! Delicious beef on a toasty bun with au jus.  The wings--the wings were melt-in-your-mouth awesome. I tried the Caribbean flavor, and I instantly felt like I could hear the waves on the beach and steel drums playing. Yeah, that good! (not breaded but flash fried).  The beer specials were great, $2 miller lites which everyone drank.   Great for groups, to catch a game (lots of tvs), etc.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MpM0gAw6bhc79l2pdK8w9g"
  },
  "aNZ4FPnwEyInKZMN3jKvTQ": {
    "date": "8/16/2013",
    "text": "The Beef on Weck was awesome. The Portabella Mushroom Parmesan was good too. Gotta go back to try other food on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CDZ8OidCgzFq0eCdt6suVg"
  },
  "B1VX9Mm1fOjLOwqx-NkTGg": {
    "date": "8/1/2013",
    "text": "Tavern On The Tracks is the biggest Buffalo Bills Backer Bar in Charlotte. I made it a point to visit this restaurant during a Buffalo Bills game, so that I can get the full effect. I was not disappointed. The bar quickly filled to standing room only with more than 75% of the patrons donning some sort of Buffalo Bills paraphernalia. All 20 some TVs was showing the Bills game......to say the least, I felt at home. I had their Beef-on-weck, a single order of their wings prepared with the Gold Rush sauce and a side order of fries. The beef-on-weck was good, as well as the wings, but in my opinion, still not at the level of Buffalo. I will say though that being here for the game definitely made me feel as if I was sitting in the Rockpile in Ralph Wilson Stadium.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SRME9m7Dol6oO1J0BDy57w"
  },
  "GsZgEauTLkH7-1VCKl7BtA": {
    "date": "10/24/2015",
    "text": "Ordered from foodie call...waited 40 min..foodie call called said that they were to busy for a salad order and cheese ravioli. Took 40 min to let them know? Terrible will never get my service ever",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OF0B2WdxR-6Fq6uE_K-9yw"
  },
  "AyPsfJ4SsDwoP2bmXD44Ng": {
    "date": "9/25/2013",
    "text": "They have a nice deck and are dog friendly. They often bring water for my dog when the server first  approaches. AWESOME!!! Food is good and moderately priced. I always get the meatloaf for a meal. When hanging out, you can't go wrong with the nachos or wings. Cool place to relax with friends....even if it is a Bills bar...hence the 4 star only. ;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QhDf6gJDiUpAjsdLgb6wrw"
  },
  "cbeEkrAWq2MFrkvSIcZK_g": {
    "date": "8/5/2012",
    "text": "Horrible treatment at this place. Server was great, but the rest was horrible. The cooks sent out raw chicken wings and the fries were not done. The server offered us a bucket of beers, so we felt that would be fine since we were on the patio. Well I was wrong. Server gave us our check early and as soon as we paid they shut the lights off and would not turn them back on while we finished eating, music off also. So then the mgr comes out and ask us to leave at 2:10a, even though he sees us still drinking. Then he makes faces and noises as a child would. Then he locks the door and gawks out the door window for the next ten minutes. I will never recommend this place, contacting corporate and never returning again. It was my first time and my last!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gFvM7RFTfszOFIaH83bBoQ"
  },
  "ns6M2KcseR8pLJep80tnQA": {
    "date": "12/15/2013",
    "text": "The food is very good. The service is TERRIBLE. We waited 20 minutes on a refill and another 20 for our check. Our waitress was rude. If the service was better I would come back. Unfortunately it's not.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AY-pxLBgB58igOKxu7zg0w"
  },
  "jjermVxF66FlARRFpWUvCQ": {
    "date": "5/5/2010",
    "text": "So a graduate from UB moves next door to a Buffalo bar- some call it fate...   I have been to Tavern on the Tracks a mere three times and had vastly different experiences.  1st- The Sabres were playing and I needed wings ...oh and Blue Light. The bar was crowded and filled with Buffalo transplants. The cheers were obnoxiously wonderful- kind of like you were back home in HSBC arena. The wings were Duffs inspired. Crispy check. Franks Red Hot Sauce based check. Overall I felt for an instant I was 10 hours away.   2nd - The second experience was unlike the first although great none-the-less. I enjoyed literally one of the best Bloody Mary's I have ever had on the patio with my friend. It was a beautiful sunny day and the patio was filled with a fun younger crowd. If you're in need of a Sunday afternoon Bloody Mary you can't get much better than this!   3rd- One would think the third time would be a charm but not in this case. All started off well - I ordered one of those delicious Bloody Mary's (granted it was more of an end of the evening drink-but I couldn't resist) and again, it was delicious. My friend ordered a glass of wine. Her wine was corked - and while they did offer to open a new bottle she decided to give up and focus on food. She ordered a mini veggie pizza (TOT is not the best place for a vegetarian)... and my other friend asked the waiter how large the portion of calamari was (to which he responded we had more than enough food for three people)- so she ordered that. The food took forever- but it was late night so we patiently waited knowing that maybe the fryers took awhile to heat or what not.   Granted Buffalo pizza in my opinion, is not very good - my friends pizza was much much worse. I have tasted better things out of the freezer. The dough itself was scarily white -looking almost uncooked. The veggies were not cooked- just overall the pizza was a mess. The calamari was in a word-scary. The portion was super small - when we asked the waiter about this he snootily said \" well Ive had plenty of women eat it as their meal\"...I mean my friends and I are not behemoth ...and since one is a vegetarian it was only two of us eating it anyway- I just thought it was a very rude comment. The calamari are kept whole- meaning you are eating a tiny little fried creature with a body and tentacles ...it was a little much for me.  The sauce was an Asian sauce that was way too sweet so if you do order the calamari ask for marinara -as it was much better with that.   Overall I am going to call the third experience a fluke- and keep going back for wings- and Bloody Marys.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "bhZnaUyqWikBqQJjyELv_w": {
    "date": "2/25/2013",
    "text": "I love their Chicken Quesdillas.  So freken good!  I try to stop by whenever I am in the neighborhood!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tnf5vrtL-06oDk6cuvfkYA"
  },
  "LEGywSzaWSKQ6SHgkNzxtw": {
    "date": "10/18/2016",
    "text": "Of the three places on Bland street, Tavern absolutely has the best food.  Their chicken tenders are the specialty in my opinion.  Add hot sauce and it's really perfect.  Their burgers are good, the beef on week is also  favorite.    I find it bizarre that they will not turn on any other game on any tv during  Buffalo football game, but it works for them so whatever.    Drink prices have crept up and feel a bit high now.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2tWYZkpEUzlXbsF7kpZdKw"
  },
  "lY-GpiSQuflNzQ1RvrWNKQ": {
    "date": "3/20/2018",
    "text": "I would not go to this dump if it was the last place on earth.  The bartenders are rude the beer is warm the waitress was a rude as can be. I won't even get into the horrible bar food.  Do yourself a favor. Starve and die of thirst before you spend 1 red cent at this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bOrzS8I5n3dKg5R0XkSYrw"
  },
  "-KxEBx2BZ8HtDaQAdtPHVA": {
    "date": "4/10/2018",
    "text": "They literally stand outside watching people park in their lot just to tow them. We got towed for parking here, and just went next door to Hot Taco to eat and come back for drinks, and when we got back, we saw 4 cars get towed within 5 minutes. This place makes their money off towing cars! It's like sore losers calling tow companies because nobody goes to this bar.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tZZCIeyGqFnfPhzauYHpeg"
  },
  "EuPHSD-ZDYIuBXrmAwG9wg": {
    "date": "6/4/2015",
    "text": "This place was ok. We were looking around the neighborhood for a lunch spot and found this place. Given that it's a 3.5* place, I went in expecting just that, which is pretty accurate. I had a Southwest Shrimp Salad and my friends had burgers, steak/eggs, shrimp and grits. Can't vouch for what they thought of the food but for me, I thought it was alright...nothing memorable/special. The dressing was very heavy and when I asked for balsamic vinaigrette (thought it'd be less heavy) it was sort of creamy and it was sweet....yeah did not go with the salad at all. Well my review is based on my salad..so you may want to check out this place for a burger...I would probably check out another place next time I come to the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DD2j18NM2T99J2EGkBfApA",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Southwest shrimp salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DD2j18NM2T99J2EGkBfApA/o.jpg"
      }
    ],
    "user_id": "F5cH-_5ywgcQcaj_MQKUbQ"
  },
  "WOWOYkkWwG1iV95TiOe5ig": {
    "date": "7/21/2018",
    "text": "My husband and I visited the tavern a week ago for their Monday Wing Night special. We were promptly greeted and sat outside on the patio. However, when given the menus, the waiter failed to tell us that they were already out of wings at 6pm. This would have been great to know prior to looking through the menu. Nonetheless, we ordered and I should have known that my food was going to be wrong when the waiter didn't write anything down. We ordered the chicken tenders meal tossed in wing sauce. However, we received the wrong flavors and a side that was picked for us (we didn't know it came with an extra side besides fries and the waiter decided we would get coleslaw - we later asked for it to be changed). Upon telling the waiter that I received the wrong flavor, he attempted to remove all of the food from the table, including my husbands food who had already started to eat and was okay with his wrong flavor. We refused and the waiter said he would go get the manager. The \"manager\" arrived (and I say \"manager\" because he was actually the cook) to figure out how to fix our problem. The cook brought out the right flavor of tenders for me however, there was a very long piece of hair cooked into the breading of the tender. The real manager then arrived at my table and offered to cook me more tenders and assured me that I would receive a discount. At that point I no longer wanted any food- only the check. I received the staff discount which was about 50% off and signed off on the receipt. Now to my surprise, I check my back account they actually charged me the full amount. This visit which included no wings, poor service, miniature tenders, hair in my food and being overcharged is completely unacceptable.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y-OHiB_cqxKb-_jCdx0Cfw"
  },
  "u8U_u4H6ZU-4hhhMwT9ujw": {
    "date": "11/25/2017",
    "text": "Worst food I've had in years. You have better options! Also, I've seen security act as parking enforcement and treat their customers like crap. Place is just gross.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mWp3lUTfYiQK_apZyu71Mw"
  },
  "pDZV74Zp5XS6M9in5Gc7Dw": {
    "date": "2/4/2016",
    "text": "The 5 stars are for the wings and beef on weck, if you go to Tavern place and order anything else and you are disappointed, then this is your own fault.   Great drink specials too!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-FGswzMnnSADz0FBRZBX9g"
  },
  "JTx6lk3I2Ct-cpuAyBugJw": {
    "date": "3/14/2018",
    "text": "The business adjacent to them was hosting an event tonight for this weekends St. Patrick's day bar crawl where people could come pick up their shirts. Hundreds of people were going in and out from 6-8 for a few minutes each to pick up a tshirt. In the SEVEN MINUTES I was parked in Tavern On The Tracks parking lot they put a boot on my car. They knew this event was going on and instead of sharing their 50 space parking lot for 2 hours on a Wednesday night when no one would be at their restaurant they decided to make a quick buck booting people. I go there often and will not be going again. You just got $120 from me to get the boot removed but you could have had much more if you continued to have mine and my friends business. Shame on y'all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PooBjOmZb1UO92I4Moa8Tw"
  },
  "6muzooLavcrS4jKbB82y-Q": {
    "date": "3/10/2018",
    "text": "DO NOT GO TO THIS PLACE. We got towed last night and reported the towing incident to the bartender right away. She called the towing company and said they would waive the fee when we picked it up in the morning (she was super understanding about the incident). The towing company refused to release the car without payment and said nobody had the authority to make the agreement to waive payment. I called Tavern and spoke with Dre, their dedicated person to handle towing incidents (because they need one), and he essentially told me I was stupid for not reading their signs and even though I was a patron and bought several beers and some tequila at their establishment it didn't matter since I went to another bar down the the street during the night. I told him that they were providing a horrible customer experience and I didn't understand how they could do this to paying customers (I had receipt of our purchases). His response was that he didn't care about my business or if I ever came back. I understand that they want paying customers parking in their lot, but punishing these same customers if they go anywhere else is ridiculous and their customer service is horrendous. Who tells a customer they don't want their business? I will never go back, but I guess that's what Dre wants.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sQSZ51aqIHG60qz51wYV4Q"
  },
  "DWX0HJsiBMS_-ECkpqPtnA": {
    "date": "9/27/2017",
    "text": "TERRIBLE bar. first of all the drinks are shit, second the parking is shit. and third if you spend money there, but walk over to the bars next to it THEY WILL TOW YOUR CAR. i have never heard of a car towing a paying customers car this is absolutely ridiculous.  on top of that the towing company, address, and number are completely different from the lot your car actually goes to!!! so it's impossible to find. the entire thing is shady. several other customers got their cars towed that night and they were in the bar as well. and they still made us pay the $350 tow!!! will NEVER come back here and i will never recommend this place! much better bars around anyway.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "lFnNXVwIvBMjQYhGACs37g"
  },
  "fyppsE3QYkmze536JMN3_A": {
    "date": "10/22/2017",
    "text": "I cannot support an establishment that charges exorbitant towing fees in their parking lot. $350 cash, add 20% for card ($420). We went around the corner to another bar and ended up at Tavern, but none of that matters, because \"they have video evidence of you not  entering Tavern On The Tracks.\" I can understand that they want those spaces exclusively and solely for their establishment, but to be a patron and then get socked with an egregiously overpriced towing fee is unacceptable.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UtOwoMrJS-ceaTmfUNwj1g"
  },
  "4vDK7HQBSYKS7f9T_t-44g": {
    "date": "9/29/2017",
    "text": "NEVER GO HERE. This is DISGUSTING for more than one reason. The first benign that they WILL tow your car and it will cost $350. The second being the horrible food and service I received while eating here. The parking lot it monitored by a tow company undoubtedly owned by the tavern who will follow you with pocket cameras and tow you within minutes. DO NOT GO HERE.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "cS2S8lf-j1S8aMsFOEYzNg"
  },
  "ko3_A4XB-RlfJRJz7MDMXA": {
    "date": "6/9/2016",
    "text": "Without question, best chicken tenders in south end and maybe Charlotte.  They're juicy, lightly breaded, and HUGE!  (4 tenders is usually plenty). It's like they used two whole breasts of chicken and cut them in half to make 4 tenders. Also, my (non-vegetarian) friends swear by the black bean burger.  And you get the great service you'd expect at a bar.  Fast drinks, servers are attentive, and there are plenty of tvs that they're willing to change to whatever sports u wanna watch.  One of my favorite bars in south end.. I almost hesitate to post such a good review cuz I don't want it to get overly crowded   I'm sure the other food is good, but I can't help but order the chicken tenders every time I come here because they're that. Damn. Good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m9WOrsQdX2k8au9BVZ_j1g"
  },
  "ICyFldkNcvqWSvh7C8hXdQ": {
    "date": "8/8/2017",
    "text": "I've been coming here for a few years now. They get a lot of complaints on their parking but there are several easy to read signs that clearly say their lot is for their patrons only, and I've never had a problem. The absolute best chicken tenders I've ever had. Authentic blue cheese and Buffalo style food. Their drink specials are always pretty good. I pretty much love their entire menu. Besides the chicken tenders, my favorite items have to be their Tavern quesadilla, all of their sandwiches and their brunch is always good. Service is good, some servers are better than others. Always have a great time here, especially during football season. It's a must for all upstate New Yorkers if you haven't been yet!! It does get very crowded on Sundays though so if you're planning to watch the game, come early.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QqcNoVRGi7jVbc2POlR52g"
  },
  "IHGPUJ1Yv2lvi-9Hcvh-vA": {
    "date": "10/26/2017",
    "text": "This business is drowning and now I know why. Instead of making every effort to improve the quality of their business they rather make a business out of their private lot. Sad? Yes, to the extreme. If your car gets towed, don't bother asking the towing company for info about their towing business because they'll give you a nasty attitude for simply asking questions. Why the nasty attitude? Because the more questions you ask, the longer it will take them to tow your car which slows the business down when they could be towing more cars for more money. Also, don't bother googling the phone number and address from the towing sign because the information is fake. They don't have a True cost on the towing fees. It will all depend on your attitude and interaction with them. For me, it was going to be $225 cash to remove the boot from my car. If I use debit/credit then it's an additional 20% added which would make $270. For that price, I could get good seats to a Panthers game or an Apple Watch. Good thing I wasn't dumb enough to withdraw cash for them. They tried to charge my debit card but, because I have a good relationship with my bank, I was able to dispute it. The whole process took about a week to resolve. Do everything possible before giving up your hard-earned money to this sham. I understand the owner has the right to protect his property but if I'm a paying customer then I shouldn't have to go through that, ever.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qirJK513OZ9kgvv3nf6kUQ"
  },
  "VCzk6f9GAhneNeQgMYciyQ": {
    "date": "5/4/2017",
    "text": "Was a great place. Something went wrong. When the fried fish platter went from great to awful, it was the last time I eat there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fXSEXFOWnAS39RCtuWyfqQ"
  },
  "6UixIvL3ycdaWQEYaa3DJg": {
    "date": "1/14/2018",
    "text": "Would not recommend this place for two reasons. One, terrible food and atmosphere. Not clean and definitely not for everyone. Two, the parking is an absolute nightmare. Met up with someone for drinks and then bar hopping. Came back 30 minutes after leaving this place to find my car has been towed. I call the number and reach a very rude and shady \"manager\" who keeps repeating the phrase \"$350 cash, \"420 card\" over and over again and not listening to any questions I ask. I have a friend bring me to the lot to get my car. The lot attendant was a nice man and he made the unpleasant situation bearable. Ran into a couple that also got towed, who also went to TOT and bar hopped, and had a receipt to prove it. They said they had tried to speak with the TOT manager and was given some attitude and really shady answers. Seems like the tavern is in bed with this towing company. I mean, if you tow over 15 cars a night at $350 minimum, you're definitely making money off this scam. Not the way to treat paying customers and definitely not the way to keep your dingy business afloat.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n44-vnxeXVxKZM57Mph8nw"
  },
  "Ho-2cs_gG0s6-tBzvFUVJg": {
    "date": "7/22/2017",
    "text": "They're savage on parking. We parked here, walked a half block down the street to look for a friend.  Came back to the car less than 3 MINUTES later and found a boot already on the car. Staff was unfriendly and and refused to remove the boot unless we paid $150. After years of coming here, we will never be a patron of this establishment again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "9z5HfRVdxlq5LLae8ABb5Q"
  },
  "74Doi2PKFWxiQWM0IurNUA": {
    "date": "4/15/2018",
    "text": "Absolute scam. What a bunch of disgusting human beings. Tavern hired some sketchy ass towing company to tow every car that parks in their lot. They towed my car and when I apologized and told them I honestly hadn't realized I couldn't park there unless i was EXCLUSIVELY going to Tavern On The Tracks he showed me the sign and physically had to unfold it before it was readable. Once we got to the towing lot in the sketchiest part of Charlotte they wouldn't let my friend walk back to get my car with me. He told me that only the person who the car was registered to could walk back in their dark, sketchy parking lot. Then he threatened to call the police on us! These guys are disgusting, pathetic, sorry excuses for human beings. They sit in the lot and watch you walk into bars but they don't warn you or make sure you understand what those parking spaces are for. Tavern either needs to charge for the damn lot or ask people where they are going first (like they do at the other lot around the corner for AAP, slate, and all those places). Absolutely disgusting scam and $350 to get your car back. I will literally never go there again. Completely ridiculous.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GydEllHmseE6QRu-k1U09Q"
  },
  "wHMth6gpz-6Ofl34-0PqUQ": {
    "date": "11/8/2013",
    "text": "This place has a hole in the wall feel. However, for a typical sports bar, it has really good food. Great bar food! We come here a good amount because we can walk here! There is a parking lot for those that are driving. Also, they have a pretty cool roof top bar.  We came here last night to get some late night food and drinks. Both my husband and I got Red Oaks (anywhere that has Red Oak on draft is awesome!!). We also later got the beer special of the night $2 Coors Light. We ordered the Tracks Quesadilla and the wings (I believe it was Gold Rush flavor). The quesadilla was delish......pulled pork inside with a side of ranch for dipping. So good! Didn't eat the wings because by the time I looked over, my husband had eaten all of them already! Guess they were good!   Great place for bar food, sports, and good drinks!  Also, I always feel like the service here is excellent. We usually sit at the bar and chat with the bartenders.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hw5riZfnB-B7G79vBTOssA"
  },
  "wlNTsV7NwyeaqLcuYHeROQ": {
    "date": "4/13/2018",
    "text": "The owner is a con artist who has a towing company tow your car even though you eat there. Of course there are signs that tell you not to park there but when you go in there, and still get towed? And then the sketchy people will bargain with you and charge you less if you pay cash to get your car back but if you talk back the price goes up. You know the owner is getting a big piece of this money. The entire southend area is packed but walk in there late night and its a ghost town.. way to build your customer base u jack knob!! Oh and wings were cold and undercooked the two times Ive been but they dont care..  probably why their food score was one the 5th lowest in the city recently...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l2BmvpyChw1wWd6-5-ODIg"
  },
  "2eLdAyGNHE1rJKneyW_Mew": {
    "date": "6/21/2018",
    "text": "First off, let me start by saying they weren't busy. So it took us about five minutes to be seated until someone finally greeted us. We probably sat at the table for five minutes until our server brought us waters and then about five mins later asked us for our beer orders. Drinks probably took a total of 10 mins.. decided to order nachos. After the order was placed the server then told me that they were out of the cheese for the nachos so she suggested queso instead. I decided to try the queso on the nachos since it's all they had. It was decent not bad the nacho portion was very small ( I also work in the service industry and at my job our nachos are 9.99$ and you get wayyyy more). All in all, the nachos were just ehh. Had ordered another beer took about 10 mins for her to finally bring the beer over. When she brought me the bill there was a 3$ queso charge... FIRST OF ALL...I should not have been charged for the cheese when they had nothing else to go on the nachos so no. The server didn't apologize nor did she tell me that the queso would've been extra since they were out of shredded cheese that came with the nachos. So will not be coming back. The atmosphere is eh and the service is poor considering they weren't busy in comparisons to other uptown restaurants.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8B_wiMOCnyKxQR72sjkgQQ"
  },
  "re2vGONnFXnUubTKit-noQ": {
    "date": "8/2/2017",
    "text": "Would not recommend this place unless you're looking for poor drinks, poor food and poor parking. It's old and grimy inside. They have been notorious for towing cars here. Highly DO NOT recommend! You're better off going else where or to gin mill next door.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "efWhoB44xRNs2fCidHcY8g"
  },
  "79m17mZRV2HGtfSevpYcRw": {
    "date": "8/19/2018",
    "text": "STAY AWAY! The owner of this place is HOMOPHOBIC! Myself and my boyfriend came here with my sister and her girlfriend last night for pride weekend and witnessed one of the most homophobic acts I've ever seen. We came here because it was the only place in the area that didn't have a line around the corner... which in hind sight should have been the first sign. We were all sitting at the bar and noticed a staircase that looked like it led up to a rooftop (which isn't unusual in this area as most of these bars have a rooftop). My sisters girlfriend said she'd go check it out to see if it was crowded before we all moved from our spots at the bar. She wasn't but halfway up the stairs when a man that was drunk out of his mind YANKED her by the crotch and told her to \"get the fuck out you dyke.\" It was so aggressive that she almost fell down the stairs. When we all rushed over to see who this man was, turns out he's the OWNER! I literally thought we were being punked. I guess the upstairs area was closed but there was NO sign or rope telling you not to go up there. When we returned to our seats at the bar to obviously close our tabs, a few of the bartenders said this kind of thing happens all the time with the owner and offered her a free drink.... WHAT??!!! I don't understand how a place like this stays open. I repeat again, STAY AWAY.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HyxqF6D8IddMzd70wmE2GQ"
  },
  "CK__NMnhvcAso4RDEhvuvA": {
    "date": "4/3/2018",
    "text": "They will tow your car before you even get into the bar. We parked in their lot Friday night & came back out to find that our car was gone. I went back into Tavern to ask the bartender what to do since I didn't have my receipt anymore & she said \"we can't do anything about it even if you did have a receipt.\" The towing company basically stole our car & then charged us $350 to get it back. If this isn't a scam then I'm not sure what is. If you want to go here, I suggest taking Uber/Lyft or walking from another lot. Good luck!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o_AEQvyfyectYe38MT0Faw"
  },
  "lTpRlKq_9x2nSxtgK0bfUw": {
    "date": "3/5/2017",
    "text": "Loud and Crowded.  That's how I'd sum up our visit last night. Granted it was a Saturday night so you would expect a good size crowd.  What we didn't expect was our order taking about an hour.  I'm going to give them a little bit of a pass here because it was clear the kitchen was short staffed.    We arrived at 7:00 and asked for a table to get a quick bite before our show at Amo's.  We were told there was a wait because the kitchen was backed up. We should have left and tried another venue but stayed and took our chances.  The hostess ended up scratching us off the list because she said \"she couldn't find us\" but once we got that straight we were seated and ordered our food.  Two of us did not order, the other two ordered the Steak Salad.    Soon as we ordered the music went off and the basketball game came on.  Cool, I thought, we get to watch a great rivalry game.  But did the volume have to be on 11??  We could not hear each other and could not have any kind of conversation.  We sat there staring at the screen and each other unable to communicate.  Our food arrived about an hour after we ordered and the Steak Salads were of really good quality, so I felt it was worth the wait but with all the other issuse that night, it may be a while before I go back.  I'll keep you posted with a follow up if and when I do.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vgrDnLY8ry2Q0oxYjgTW6w"
  },
  "pBzogsFIdb_zrpTt-k86fg": {
    "date": "10/1/2017",
    "text": "This place is honestly not a good place to go! First of all the service is awfully slow and the food was not good at all! My chicken wings had a ton of hairs in it and I was honestly thinking how many wigs can I make with all of this! Secondly, the people that work there are really slow and did not seem to care about the customers! I heard other tables talking about how rude the employees were being and the fact that they have a terrible cleanliness rating should have been a tell tell sign not to eat there! I will never eat there again and no one really should! Who would want to eat at a restaurant that serves hair and undercooked meat??? Hot Taco is a way better restaurant right around the corner!!! Go there for a good time!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZKGyPVIhD1O7W9kvXuK3Ww"
  },
  "kf3yGjxW6-cVnCKon-MW4Q": {
    "date": "1/14/2018",
    "text": "DO NOT GIVE YOUR MONEY TO THIS BUSINESS!  They are aligned with a very shady towing company Carolina's Towing Llc and practice predatory towing. They sit and watch you to see where you're going and there are no clearly marked signs right where your parking we were not familiar with the area and it was a parking lot that was in between quite a few bars we went to meet some friends and came back and our car has been towed we were then pointed to a sign that was at the entrance of the parking lot but not very visible especially from where we parked and upon calling the number for told you needed to pay $350 cash or $420 debit or credit to get your car back. After calling the number multiple times we were hung up on twice after asking questions regarding their policies this is a very shady business and there have been many people that have had the same thing happen to them it should be illegal. Their customer service is terrible they are rude and unwilling to give you any information or answer questions. This is a dirty scam and the Tavern on the tracks is in bed with this company and most likely receives a kick back from the amount of cars that are towed which is actually illegal. We plan to take legal action against both Tavern on the Tracks and the towing company. Please be aware before you give your money to this business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 0
    },
    "photos": [],
    "user_id": "PdoFNCUoGqLALrgAO7Erpg"
  },
  "Bp6ZyfcnyDWKwXmKccbXfQ": {
    "date": "1/26/2017",
    "text": "Best wings in town!  And the Bills fans on Sundays are highly entertaining.  Great spot to watch the game, and great atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xi4m_q0o2LiGHqMBF2PT4A"
  },
  "Nfz1qFoq8NuA4q7CqPqPaA": {
    "date": "6/17/2017",
    "text": "We have ordered from this location a couple times after out first order being great.  The last three times have been HORRIBLE!!  Garlic Mashed Potatoes?   More like $1 instant mashed potatoes.  We have complained numerous times and nothing improves. I make better mashed potatoes in my own house!!  My wife got food poisoning and the queso was like spackle!  Disgusting.  Avoid this place as they obviously don't take pride in their food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "VJZuGXzlQ-zZdtcuTHITUw"
  },
  "ZyDqt_aK_9RrRVakg_dsSA": {
    "date": "12/7/2017",
    "text": "This place is disappointing due to the service. The toasted ravioli and po-boy are good and inexpensive, but I doubt I'll be back anytime soon unless I have a few hours to kill waiting for my food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H3c2bEw66tk2hp92nUpDCw"
  },
  "GMylWrmQfi03zZfHq9QbZA": {
    "date": "10/9/2015",
    "text": "It is basically a sports bar focused on horrible teams (Michigan, Buffalo...ugh).  In spite of the pathetic sports regalia, the atmosphere is good, the food is great, and they have lots of screens.  It's one of my favorite lunch spots.  Go Bucks!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ghYSbxQuYxL1Dn68iMJf6g"
  },
  "edk3vmjGGuv1aab8q9dQtQ": {
    "date": "11/10/2017",
    "text": "An intriguing alley stroll led me into the infamous Tavern On The Tracks where I feel right at home. Elylise ( a stunning beauty) was so genuinely hospitable and made me feel welcome and at ease. I stopped for a Bud but quickly slid into Fiesta Mode with $3 Coronas!!! #Yummmmm #TavOThaTrax #FunDayFriday",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I8JeRBUtW9mDpLjF6zQidw"
  },
  "LjE0sr85vnE55STKpCOInQ": {
    "date": "8/13/2018",
    "text": "If I could give zero stars I would. I would purely not waste your money here because of their parking lot. They hired a towing company that literally stalks the moves of any patron parking there and if you don't immediately go into the restaurant or immediately go straight to your car after leaving they will tow you. I was there for almost one hour and went to one bar for quick drink after leaving tavern and my car was towed. There was a lady in the lot that worked for the towing company saying she \"saw me\" not go directly into the restaurant because I was finding where my friends were parking. The fact any restaurant condones this behavior or treatment for their patrons is beyond ridiculous. Screw this place. Screw the owner. And screw the towing company. I don't normally use yelp because I know it ruins restaurants but I couldn't care less if this restaurant failed. I want my $300 back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dCqmV04jMzIRbKtamI1Pug"
  },
  "p-059G8djnusL-0FV7wX4Q": {
    "date": "11/5/2017",
    "text": "This is my go to spot in Charlotte. They have excellent Moscow mules, but be wary if they're out of copper mugs because the ones that come in plastic cups are no good. Some menu highlights- loaded fries, toasted ravioli, tracks chicken, and the black and blue burger. Go to this place if you want good food, solid drinks, and a staff with a very high turnover.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eQEH6z-FPBBLOWkw1dcvAw"
  },
  "UOPsJNxCQ34lw6hed-89zg": {
    "date": "11/22/2017",
    "text": "My Girlfriend and I decided to have a night out on the town since we never really get much time these days to find enough time to spend with each other since having a 1 and 1/2 year old.  I suggested we should go up by Tavern on the Tracks, which is an upstate NY staple that reminds me of home and the warm feeling you get of being at a pub.  The problem is my friends who are also from upstate NY were at Riverbank or whatever the name is of the new bar, so I parked at Tavern with the expectations of heading over to the Tavern  after I met up with them not knowing that there would be people looking to tow with the intentions of extorting 350 dollars out of me.  WAIT I OWE 350, FOR WHAT?  My car was towed for parking in an establishment that I have come to for years to watch Bills games that I felt like at home to find out that really I was being screwed.  The day before Thanksgiving my sons car seat was locked in a garage in some shit neighborhood because I parked in a stupid gravel pit and I didn't buy a stupid beer from you.  I wouldn't mind if it was a $100 for the tow, but 350.  Thanks for ruining my holidays with your extortion.  I will never support tavern on the track ever again as they have fell to the greed of the world.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3Tblfjm5D4YDBSXIl705UA",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3Tblfjm5D4YDBSXIl705UA/o.jpg"
      }
    ],
    "user_id": "QSCJ8kGwbwLW_uuJOLC7_w"
  },
  "b8Ov_7pUrvrviJrHUMrZYg": {
    "date": "11/27/2017",
    "text": "Worst experiences here. Not only does their service absolutely suck and their food not worth anything, they are also overpriced and have a super sketchy parking service going on. I parked in the lot and was planning to bar hop but had to walk to helles and dunkel down the block to bring someone their keys first. I was back in less than 20 minutes and was booted.    The guy that was doing it had been sitting in a car in the lot watching people with his shoes off and sticking his feet out the window (his name was Anthony). As I'm trying to discuss how to get this boot off my car, the guy actually there doing the toeing comes over and interrupts me to talk to the guy about getting beers for them! Both of them are working and one in towing cars, but both driving and working, and they are drinking! Unprofessional and untrustworthy. The guy told me it was 120 cash or 144 with a card. I never once said I wouldn't pay, but that is ridiculous! I had to call my friend to come help me pay for it as I didn't have the money on my cards. However, after bugging him cause I was veryyy broke, he had told me I could split it between cards. I still didn't have enough that way so called my friend. My friend came over and got a little sassy, but he was being rude to her so it was justified. He didn't like her being sassy and when she said \"Bullshit\" about something he said, he then said \"Just for that, you can't pay by card anymore, only cash!\" And after saying that and being called out on it, started lying saying that his card reader wasn't working. Mind you, I had been next to him the whole time and without ever picking up anything the whole time, he magically managed to go from being able to take two cards to not having a working card reader. Liar!!! Then he kept saying that because the card wasn't in the name of the owner of the vehicle, that he couldn't take it! I repeatedly asked him to show me written proof of that law and to prove his card reader was broken and he refused.     She went and got the manager at Tavern on the tracks and the tow guy wouldn't stop fighting with me and wouldn't let me pay and threatened to have me towed then and there. He continued to lie and be disrespectful and untrustworthy. Once the manager came out, the guy lied and said he didn't say anything like it and that his card reader wasn't even with him but the guy with the truck had one. Eventually, my friend just went and got cash and I got the hell out of there. But I can tell you what, I along with all organizations and charity groups I'm involved with, will not be giving this place business ever again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZcwyINWmBRWnxbqtSsu9Cw"
  },
  "zn_bO2n7xKQdfX7lYfVTOg": {
    "date": "9/12/2015",
    "text": "By the time we arrived, we were all super hungry and short on time. In need of some libations, we all ordered beer, however, when they came out they were all slightly above optimum temperature and lacked carbonation. Think something may be off with their tap system.   Incredibly ravenous, we started with the salsa and guacamole. The salsa was fine, if you like Pace picante, but the guacamole was basically inedible. It tasted fishy and I am still a bit unsure why.   I ordered the black bean burger with a side salad. Yes, I know this doesn't set me up for success, but I was assured it was housemade, like everything else at this place, which is highly commendable. The actual burger was OK and the execution was kinda strange (it came on a pita). Side salad was meh.  The husband's fish and chips were absolutely delicious though! Everything was perfectly fried and tasted wonderful. Would definitely recommend ordering if you find yourself here.  Friends at the table also enjoyed the chicken wings and French dip. The waitress was nice enough to let us sample the wing sauces (our pal swears by the wings, but we don't eat meat, so we were intrigued). All the sauces were very good and again, housemade.  Understand my experience would have probably been better if I had gotten something fried, but if it isn't good, don't put it on the menu!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FDXKBjnMiKg36m6sYRliCw",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Black bean burger with a side salad. Not a fan.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FDXKBjnMiKg36m6sYRliCw/o.jpg"
      },
      {
        "img_id": "IQCuAjhZG7W7k-T2ASDQqw",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Fish and chips were really really good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IQCuAjhZG7W7k-T2ASDQqw/o.jpg"
      },
      {
        "img_id": "m_y5OS43ZSCpC9KcJjiOmA",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Chips and salsa. Stay away from this app.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/m_y5OS43ZSCpC9KcJjiOmA/o.jpg"
      }
    ],
    "user_id": "_kPm0L6KX9H_CqFoi5x_fw"
  },
  "o564xSbD3GyZudB-vZrJTQ": {
    "date": "8/12/2017",
    "text": "I'm a big fan of TOT - its a simple no-frills bar that serves up some amazing food. When I lived in South End a few years ago my wife and I would walk here regularly as they always had decent beer specials and it was one of the few places open late for food. That still holds True today as my wife and I popped on on Wednesday night to catch the end of the Panther's pre-season game. I like that they always have Red Oak on draft as it is my wife's favorite beer, and they hold True to their northern roots by having some other beers on draft (like Lebatt) that you normally don't see in this area. For food, I always recommend the wings (gold rush is amazing) and the quesadilla (odd - i know, but it is really good!). Pro tip - if you order a bunch of wings to go, let them sit in your oven at 200F for a few hours and they will become fall off the bone tender. Just learned that last night. Anyways, my only gripe about TOT is what makes it great. It is a Buffalo Bills / Michigan bar which means they don't pull for my home teams and they can get crazy on game day. However, when we had the 'snowpocalypse' in 2015 and everything else shut down, they laughed and remained open - good for us because we could walk there at the time! While the bar scene in that particular area has become very competitive, don't hesitate to pop into TOT for a more relaxed and enjoyable experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nvHJFFr5R74ug5NOh2VDPg"
  },
  "Rjx2zk8sPnuQVWH3Au-V1g": {
    "date": "12/3/2016",
    "text": "Beef on weck was uncooked and coleslaw tasted rancid Just not terribly impressed  Service was ok  Wings were good",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DY-B0NPg-ZyWUaNFyloBnQ"
  },
  "__cBWMg3X_JEZKt2AdEmWQ": {
    "date": "1/10/2011",
    "text": "I like this place more each time I come back. Right next to Amos', you can come grab a late night drink and snack after a show, and next to Gin Mill, so you can grab some food before/after drinking. Perfect.   It's a nice place to just chill with a few friends over a couple beers while watching some sort of sports game, or to plan some marvelous activity. Definitely a more toned down place, so a good place for a moment of recollection during a bar crawl. Bartender is nice. Drinks are cheap. Food is good for bar food and cheap. Atmosphere laid back. Park on the corner of Bland/S Tryon and the entrance is through the parking lot.   For future reference: Only a block from the Bland light rail stop, good stumbling distance.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "53QaFbmZojYK0vv3RQagcw"
  },
  "QQJGfXJe79CkO99ewNs7tg": {
    "date": "7/4/2012",
    "text": "We've been lunching here for years, the food is generally okay at best and works out fine for lunch. Occasionally we have stopped in for a Sunday game but it's a very one team kind of place.  Last night, the eve of the 4th, we had been uptown walking around, we took a cab home and asked to be dropped off here to grab a quick bite. The bartender took a very long time to get around to us, the room was fairly empty, and she seemed shocked that we wanted to order anything? We didn't really understand her suprise.  The quality of food was soooo bad, we left most of it on the plate. A hint to any server, if a customer leaves most of their meal behind, ask them if the food was ok or if you can do anything else for them.  We left, feeling very eh about both the server and the food. What a shame.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "8HLIPPPCuc_-Lt6WwMnJBg"
  },
  "6nppXVvM9bxviQZC62ehYw": {
    "date": "10/1/2012",
    "text": "OK food at best.  Good for beer.  I have gotten unlucky because I have gotten the same bartender the past three times and she has the social skills of my bar stool.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LwvPZ1bQt5-Zl1xxPberVQ"
  },
  "GUdgVdJv_7UD4sIR3HPLSQ": {
    "date": "2/14/2011",
    "text": "Pleasantly surprised by the food here.  Came on a Monday night so it was a little dead.  Some patrons were at the bar, but seemed like my friend and I were the only 'diners' at the time.  The wait staff was friendly and the food came out pretty quick.  I had a cup of chili (since it was cold) and some of the hand breaded chicken fingers in garlic hot sauce.  REALLY good!  Originally I was going to order my two picks separately, but the waiter advised me to get the combo which was cheaper and came with fries.  I always believe it's a good sign when people are trying to help you save money or get more bang for your buck [within reason]... I know at movie theaters they try to sell you more popcorn for a smaller amount $, but it's already high to start with!  No dice!  Back to Tavern.  I only really went here to drink and go out, but I'd say this is a solid 3.5 stars as far as eating goes as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "NYorhUYGgd8Tj1V6iCzu7w": {
    "date": "4/25/2015",
    "text": "Good Location in South End Great Wait Staff and Food very Good Try the 2 Dollar Mimosas Great Deal",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S0wAeqKZuqlgZktzkc7_Sg"
  },
  "zTZ_NxgHogNI-cVK_DnCPQ": {
    "date": "9/2/2016",
    "text": "It's been a while since I've visited Tavern on the Tracks and and when i walked in i could instantly tell a difference. And its an awesome one! I was told that the change was in due part because of the new GM. My friend and i sat at the bar on a busy friday night and Jamie was our bartender. She was clearly busy but we never had to wait very long for our drinks. She was also very entertaining, very comical and seemed like she enjoyed her job. The other bartenders were also very attentive. I'll definitely be back more often. Big ups to the amazing change Tavern on the Tracks has had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gLvy44LqTO3ptTHRiXgamQ"
  },
  "jU9BawvZk6Ck4rU9UQtyIw": {
    "date": "7/18/2016",
    "text": "Yummy to go.  Steak salad was excellent and filling.  Bean burger and fries a big hit. I would happily go again to The Tavern.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QvH4kc0L904T55144vPGqg"
  },
  "b8tNRH-H3dbsxilhI3XgHQ": {
    "date": "8/15/2011",
    "text": "This place has moved into the 'Favorite Bar' chamber of my heart ever since Morehead Street Tavern cleared out a few months back. Having come here several times (mostly on Thursdays and after concerts), I am happy to say that this place has a very healthy balance of:  Good atmosphere Decent drink specials Friendly crowd Indoor/outdoor options Surprisingly good food  I know I know, that last one doesn't seem too likely, but it's True. The 'Steak in the Grass' filet sandwich with sauteed spinach is to die for. My friend also got a serious fried bologna sandwich. It was as thick as a hamburger, no joke.   Though I prefer a slightly smaller and more cramped atmosphere for my drinking hovel of choice, Tavern On the Tracks took in our miserable and bedraggled happy hour crowd after the demise of Morehead like a True champ. For that and all of its other fine qualities, I will continue to raise my glass to it.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "7bwh6A4cl8DqZV44kAjWjA"
  },
  "e5vzZJZrh1WRX4oFvMD-Hw": {
    "date": "7/19/2014",
    "text": "Just plain terrible. Stopped here for a bite to eat after happy hour at Gin Mill. Ordered the Steak in the Grass filet sandwich cooked medium - it was served bright red and rare with a pitiful side of asparagus. Not to mention a cockroach fell from above and scurried across our table into my friend's lap. Received a small apology and look of horror from the waiter. Definitely will not be retuning.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tCCvQgwpZ3i8iCOw1Dfd0A"
  },
  "jv4FwUUkHkkto8WqbicMpw": {
    "date": "10/17/2011",
    "text": "If I was basing this review purely on the fact that I am from Buffalo, I would have given it 5 stars!  What better way to spend a beautiful Fall Sunday than the patio, sipping on the largest $5 bloody mary, and cheering for the Bills!?  They also have great specials on Labatt Blue.  They have some Buffalo Classics like Beef and weck and fried bologna sandwich.  I have to say, I was disappointed by their \"buffalo wings\".  They were severely lacking in sauce and they were very mild in spice.  The meatball sub was very tasty though...redeemed.    Advice to other fans:  This is a Bills bar.  You will not find another game, and I really wouldn't take your chances asking.  If you want a seat in the bar, I suggest you get their long before the game begins as this place get PACKED.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Z74kA3qXszsBZjFNJUEMEQ"
  },
  "rGVrcWyehEd-6eM7B9Dedw": {
    "date": "12/31/2014",
    "text": "We went before the Belk Bowl so the crowd picked up as we were there.  Our server was prompt, polite, had humor, and knew the menu. Wife had the ribs and they were juicy with a good ketchup based tangy sauce. She had the side of vegetables and they were well prepared and seasoned.  They were not over cooked and not crunchy so just right.  I had the fish fry and it was great....  tangy tartar sauce... the large portion is huge...  I had to take a piece of fish to go...  fries were good and the slaw was awesome.....  the only negative was it was a little to dark and at our age made it hard to read the menus...   other than that....  good eats...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_GyT3LI9b4NpPncNA8w2hg"
  },
  "ohf909jNUHcmQH5qvyu2JQ": {
    "date": "4/1/2016",
    "text": "Regardless of where I'm at after a brewery stop (or several brewery stops) I find myself always ending up at Tavern on the Tracks. The old school feel of this place reminds me of my northern roots (and with good reason since it is a Buffalo and Michigan bar). Despite the staple of Labatt's always being on special here (I believe), the French Dip with fries is the reason I end up here. A good quality shaved beef on a long roll with melted cheese and the perfect amount of au jus. The fries have the perfect amount of skin left on them. I have had a lot of inconsistency with service unless I sit at the bar which I recommend if you go in solo. However if you are going there to watch a game none of the bar seating really has a good view of a TV without twisting around. I do occasionally bike here and a bike rack under the deck would be appreciated. I also met a client here for lunch once and if memory serves, I was asked to use the neighboring bar's wifi (this may have changed).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S-aWpC4zwEiypgmY98nsvg"
  },
  "_6mLHvv3g_SZMOQ-Wjkeew": {
    "date": "3/29/2016",
    "text": "Tavenr on trakes! Ate beef on the stick real goos;! Also grill hame and chese is good! Lot of beer on tape what could go wrog! Drinj magic hate, sycamores, unknown wow! Be careful don't make fun of buffalo bills ok please!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B9wtH9CLdpAuIopkpaLGWw"
  },
  "mzL6eOgVj6gErZyXrIS9xA": {
    "date": "11/21/2011",
    "text": "Being an Ohio State FANatic.. and living here in Charlotte, Home of the Friendly Fans. A group of 3 or 5 of us went (Me being a OSU, a few others MichiCan't fans and another being a Carolina fan)  Since I know how the fanmanship (if thats a word) goes around this city, I had no worries that I would run into any trouble. Anyway, my buddy goes here alot (MichiCan't fan).   HIGH PRICED DRINKS The crowd inside was cool, (I love the tension, and the back and forth w/ other teams fans) The food was ok.   Just look at the \"app\" part of the menu. Seemed kinda all over the place. Is this a Sports bar or some check \"mid scale\" knock off?  I think i had a beer and a shot, after I sawed my left arm off and gave it to the bartender, I made a exit to a OSU bar (Strike City). I didn't get any drinks from there so it was cool.   Knowing my buddies they probably added a drink to my tab since i'm on enemy grounds.   Over all, its a ok place, kinda pricey IMO.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xhlcoVm3FOKcxZ0phkdO6Q"
  },
  "50NS17uQJrPW4SsEy_DOeQ": {
    "date": "10/13/2014",
    "text": "Came to Charlotte for the NASCAR and ended up spending a day here for football Sunday. Great atmosphere, great food and most of all a very accommodating staff. Even though it was busy they still kept up with our needs. When I come back to Charlotte, Tavern On The Tracks will certainly be on my itinerary.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_WyROQlz7GxLNNE1Bm_1ZQ"
  },
  "vtkDIks3eSFUseh8OczHtA": {
    "date": "11/19/2013",
    "text": "If the staff was nicer, this would be my favorite place. The food is hands down the best bar food in town. But get take out. Eating there will take away from the food. Every time we've been there, The staff has been absolutely miserable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NlUSfv3XIzwL7ZWLQHTddw"
  },
  "BqHpG9sahcmQwhwtf8dDFw": {
    "date": "5/16/2011",
    "text": "I guess this review is 2 sided.  One side for the food (great!)  The other side for the actual bar (Meh.)  Food- The food is really tasty and pretty cheap.  Please order anything with blue cheese, it will change your life it is so delicious.  Chicken fingers are awesome too.  Burger is good, fries are good, bloody mary (though not a real food) is great too.  My only gripe is that they have Beef on Weck which is a total Buffalo thing but the roll the \"Weck\" wasn't right.  The whole point of the sandwich is to have a roll with rock salt and caraway seeds, this had neither.  Fail.   Bar- As a sports bar they need better tv's to watch said sports. It's a Buffalo/Michigan (NOT Michigan State) bar which is an interesting combo.   I went to college in Buffalo so it has a little piece of my heart regardless.  My husband went to Michigan State and got the evil eye on Michigan vs. Michigan State game day when we wore his MSU shirt.  I mostly go here because it is at the end of my street and laziness almost always prevails.  They have tables and tv's outside which is fun for an afternoon of game watching and drinking!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5k1P5jLOBdjAKsxmE5uwmA"
  },
  "EztNDrDqHV8ZlcuXlM_haw": {
    "date": "8/25/2015",
    "text": "Some friends and I came in Saturday night (pretty late actually) and asked to sit out on the patio. It wasn't very crowded and the hostess seated us outside. We sat out there for about 10-15 minutes and no one had come to take our orders. So two friends went inside to get drinks from the bar. About a minute after they went inside a waiter came over and didn't introduce himself or anything just asked for our order. So I told him oh I'm sorry but our friends went inside to order. He got really upset going on about how they can't have people just going back and forth as they please. I said I'm sorry but they just walked in and described them to him. He went to look for them, comes back out really mad and says well I can't find them what do you want. At this point my patience was wearing thin but as it was my Birthday I really didn't want to spoil the evening. I calmly said oh I'm sorry they were ordering for us as well since we waited so long and no one came out. He stormed off in a huff. Needless to say no one ever came by our table again. I personally have never been to this particular bar before and to be honest I'm not likely to choose this place again. I understand people have bad days and it was pretty late but the reality is other bars were far more courteous that night and I'm more likely to frequent them instead. Besides the drinks were only okay...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhYUDP1vR7CSRi2cvfai0Q"
  },
  "V9gCeJSZ4VCXRtCvkQpsGQ": {
    "date": "1/1/2012",
    "text": "This place had cheap Yuengling, Jager specials, and they were willing to put on the Rangers game. Any bar that does that and gets me messed up on a Monday night is fine with me.   If you are a fan of Buffalo sports and Michigan football, you will dig this place. They have menu items like beef on weck for the transplanted Western New Yorkers.   The bartender was friendly, didn't give me any trouble about the Rangers, and kept the drinks coming. If the same happens for you, fortunately the light rail is close by.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gF3csxEmIEA9cJFCMSdbyA"
  },
  "kkZZQ6SsIx-Yvd6rM4wQhg": {
    "date": "6/22/2013",
    "text": "Service was horrible, bartender came charging at customers and rudely demanded ID's when they have clearly been checked by the waiter... then proceeded to tell customers that they had no idea what they were talking about ... I waitress/bar tend myself and know the rules/how to be respectful to a customer in all circumstances ... I would not recommend coming here especially when wait service didn't care for business from a large party!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JlTEv3ZAHTCDvt94fOjWOQ"
  },
  "5TMh_bRlIjiXVKSVIl98_Q": {
    "date": "12/7/2015",
    "text": "Im an Ohio state fan so it's like stabbing my eyes out walking into this place on Michigan game day ( this is the Michigan and Buffalo Bills bar), but Tavern is one of my favorite bars in Charlotte. It's older, but has its charm. They have a nice sized patio and Lots of TVs. I've came here a couple of times and have nothing, but good things to say.   Here's the breakdown:  Drinks- they always have drink specials and on the weekends they offer $2 mimosas. Plus, they don't overprice their drinks.   Food- Yum! Everything I've had here has been amazing! I love the salmon BLT wrap- they load it up!!! The Buffalo chicken wrap is a staple item- can't go wrong with it and their wings are also tasty!! I recommend the goldrush sauce. All in all the food isn't gourmet by any means, but for bar food it's pretty good. Nothing fancy here.   Service- like I said, I'm an OSU fan, so if they can deal with me since Michigan fans want to kill me then this bar rocks!   Go bucks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EtFYEN0sbxkZOOt3DE7vWg"
  },
  "8NrOVQCi7E54cueZaAVDOQ": {
    "date": "10/12/2017",
    "text": "Seems like a happening place on game day. Bar is centered in the building and offers a lot of countertop space. We had chicken fingers, they were surprisingly good. Seems like they have decent drink specials and the location is convenient to a good number of apartments. I cannot give a good positive or negative based on the fact I went during likely the busiest of weekends for the bar, but I'd certainly say this is a good place to have a beverage and enjoy some bar food... So go get some!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O5_xBtoZA32GGIsbrujM7g"
  },
  "hOF1qA71k-Z8qSYrboMR7A": {
    "date": "5/22/2018",
    "text": "Has always been a favorite place to eat and catch a Michigan Game but now a bit concern about going there with the reports of aggressive towing. Have made a point of going for years to watch games with fellow fans but would rather not put up with the hassle of fighting to get my car back when. I park in a designated area. Change the practice and make it the experience I have loved since I moved here in the 90s",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pqXV9gDi6wGRGI6sN2yyDg"
  },
  "sxJN8798_Lo15EdIo4kY3g": {
    "date": "12/30/2017",
    "text": "Don't eat here. Customer service and thier Affliate company Carolina Towing are the worst. And yes even if you are hired through a third party company you are still an Affiliate of the primary company your doing the work for. I came here to pick up food in addition to another restaurant parked my car to get the food for my family that I pre-ordered and then pick myself something from here and they booted my car, while I was getting the other food. If dummies would have given me the option I would have gladly paid $120 for food instead of paying to remove the boot from my car, at least I would have had food to eat for New Years Eve. The restaurant probably gets a cut from the tow company.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HoJ4eE6Lsc0j_6YPy9qtaQ"
  },
  "zN3TwA7HAzMNxGzuK8Zujg": {
    "date": "12/16/2017",
    "text": "This place has potential as a chill spot; however, it is so poorly staffed that it loses any appeal it might possibly have. If you don't mind self-absorbed wait staff who have no clue about customer service, then you will love this place. However, if you actually enjoy the experience of going out and having a server who is attentive or actually knows what real customer service is, then this is not the place for you. Do yourself a favor and go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "DKK9GMiM9nntoGEuuzakIw"
  },
  "Juk0nr817jt1evAto4u8pQ": {
    "date": "3/11/2017",
    "text": "If I could give this restaurant zero stars I would. Their customer service was the most horrendous experience I have ever had. They called my autistic brother someone with \"special needs\" and the manager said he  \"wasn't sure if they could serve him.\"  I tried to confront the manager about the situation and he was beyond disrespectful. I will never step foot in this restaurant ever again and I hope the manager is fired for his blatant disregard for individuals with special needs. People who work in customer service should be kind, open minded and understanding to all individuals regardless of ethnicity, race, gender, or disability. Needless to say, I am very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "7LKORfiptPffjndu4Yj-yg"
  },
  "nDYM9UAI_aT71ZzWOXC1_Q": {
    "date": "12/3/2017",
    "text": "This is by far the most disgusting place I've ever been in. The silverware was dirty with dried food on it.  The plates were dirty and the waitress was coughing all over the place.  Please, if you value your health stay away from this roach trap...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y0vR0NoXXy4utd13tXKp_Q"
  },
  "imsAXr2pv3tg15ao3HkFXg": {
    "date": "12/14/2017",
    "text": "I had never been here before, heard good things & wanted to try it. I go a little after 10 to have some drinks. Park in their parking lot. I'm not in there for more than 45 min come out and my car has been towed!!!!! The towing company.. super sketchy said he watch me come from hot taco and decided that he should tow my car.. long story short.. ended up having to pay $425 to get it back & i called up there to let them know what happened to see if something could be done and they said nothing could be done, it was out of their hands... just not a good idea to go here!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TUbKJX0pcY3jfoftU6MTSQ"
  },
  "txPVbAllUdvOfC8Ubc04fw": {
    "date": "4/13/2018",
    "text": "Look I have lived in Southend for years.  This is a staple of the neighborhood and has great food (try the fried ravioli or the chicken tenders).  The staff turnover quite a bit but everyone has been friendly.  BEWARE of parking though, they have a company that boots your car if they think you might even consider going to another place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nJiNGQjuq5j40VNv7YGe8g"
  },
  "eS-9HcfjwdiJfk9VTr0nFA": {
    "date": "4/13/2018",
    "text": "Place is progressively going down hill, resorting to towing cars of their customers (intentionally or not) now they are on the list of unsatisfactory sanitation grade. I wouldn't send any Bill's mafia to this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sjB2_187aZivqBR-exjOIA"
  },
  "I16I1XGP17bRXEV6o7R7Yw": {
    "date": "3/22/2015",
    "text": "Large, large bar food menu! You want it, they have it! I got the southwest shrimp salad and it was delicious. It came in a large tortilla bowl and was full if flavor and veggies.   Tavern has a great outdoor patio, many tv's and local beers. Friendly staff and daily specials.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Obk11sbuX8FARq4ED59XOQ"
  },
  "TQPuFOrkfItX80b2UwovAg": {
    "date": "3/12/2014",
    "text": "Are you from Buffalo? Well, this is your bar.  Bills games on Sundays. Sabres during hockey season. Warning: if you want a seat during football season.. get there early. The place gets packed. If you don't enjoy Bills fans, well then you should probably stay far away on game days. TOT is also a Michigan bar.  Hands down the best thing here: the bloody mary's. Fantastic homemade mix. It's served in a tall, carafe... complete with celery, olive and pepperoncini garnish.   Pretty decent bar food here. This may sound odd, but one of my favorite things on the menu is the stuffed banana peppers. Garlic, bleu cheese, parmesan in a bread crumb mix melted provolone served with bread and balsamic glaze. I also like the steak in the grass. TOT does brunch on Saturdays and Sundays... including an omelet you can make your own way.  Dog friendly patio complete with TVs. Great place to have a drink on a nice day.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "-yygQK3o7RYRdbxtQpp9Tw": {
    "date": "5/21/2016",
    "text": "I have never had a bad experience here.  Sometimes the bartenders are more friendly than others, but that's really my only complaint.  The hot banana peppers are so good! They are addicting, and they are bigger than I ever saw banana peppers.  They also have a decent selection of local beers on tap.  And they are open late of course!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cS2vDBZrWmE0hyfDdx9fGA",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cS2vDBZrWmE0hyfDdx9fGA/o.jpg"
      },
      {
        "img_id": "s3vbxp6eW5LpN6GYUdCNQw",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/s3vbxp6eW5LpN6GYUdCNQw/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "28S2gJnWOQZFtgqnyHUwWw": {
    "date": "8/28/2018",
    "text": "Horrible place - does not even deserve one star. Terrible service. We will never go here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8LY1CaasZMzcNnBI_qXckw"
  },
  "nqxFDcH1sNXodg1w1EDpRQ": {
    "date": "8/28/2016",
    "text": "It's not TERRIBLE. But it's not the best. We sat on the patio and I mean, I know how it is when you get busy and someone sits all the way outside but 7 minutes before you're greeted after we went in and told them we were sitting outside- is kind of ridiculous.  It's unfortunate the Cuban wasn't very good either. I had to wash it down with ranch dressing because of how dry the whole sandwich was.  The Tryon chicken was great though (says my other half)  I still don't know the servers name but she did say sorry for taking so long to check on us, she was busy cleaning ..... Hmmm I love trying new places, this wasn't the worst I've ever been to lol but step it up TOTT, this place has potential because of its location in South End.   Rip to The Cuban (Pictured)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AE24nDWaBzu-8BbScz0TyA",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Rip lol , this sandwich needs to be buried it was so bad.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AE24nDWaBzu-8BbScz0TyA/o.jpg"
      }
    ],
    "user_id": "Wm0ZnkOvjadD8bEyXtNVYQ"
  },
  "q4d7TvJ-VpjHCxqr8GMihg": {
    "date": "11/8/2017",
    "text": "So Sunday my group of friends d & I were watching the game at Slate/Oakroom which was super crowded barely any room to stand so me and one of my friends decided to walk to Tavern on the tracks to try to have a drink at the bar and catch up. We walked in and sat at the bar, there were 5 male customers at the bar sitting around us and it was around 4pm. There was only 2 female bartenders working - both brunette and the bar itself had a few tables with customers but nothing too crazy. We sat at the bar for 10 minutes - the bartenders never acknowledged us for 10 whole minutes. One time one of the girls even got right in front of us to grab beer but she didn't look up. After about 5 minutes since we been there about 5 feet away the bartender sits on the ledge to talk to a male customer and didn't even look to her left to try to help us. Finally after 10 minutes of obviously ignoring us she walks over puts two napkins down and say hi how are you what can I get you? So we ordered a beer and a drink and she asked if we wanted to keep it open or close out so we said close out. She left the tab in front of us and didn't check on us again for another 15 minutes. We had put the credit card down as soon as she put the tab down because like we said, we wanted to close out. We had to wave one of the bartenders down to tell her to run the card she walked past us and ignored us and we had to wave the other bartender down to ask her to run the card. After she did - we closed Out, and we are never going back again. Customer service is everything - please improve your bartenders customer service skills.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rl4RPB_Jm343W-z49Inqpg"
  },
  "aIEHke9whckxFYRBl9mAKg": {
    "date": "10/26/2017",
    "text": "Used to be a great spot but my last few meals have been close to terrible. So one more chance, I got a to-go order for lunch today. Get back to work and the order was wrong. Not a huge deal but it was inedible! The lettuce and tomato that was supposed to be on my sandwich was close to missing. Like some fell on my plate while they were making another one. Long story short, I threw it away.  P.s. We miss the real fries you used to have.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jdQX4wVnqCThF7mRXKbIsA"
  },
  "iW8lROVwZcJyEGxXcY_h8w": {
    "date": "8/4/2017",
    "text": "I've been coming to Tavern on the Tacks for a few years now, Huge Bills fan! I love this place! Its like walking into your home town bar. The food is better than average sports bar food by far. Is it a 5 star restaurant? no, its not, its a sports bar/dive bar and that gives Tavern on the Tracks its personality. It has a nice patio with plenty of TV'S inside and out and parking has gotten better since they started enforcing parking in their lot. If you want good entertainment on a Friday or Saturday night, come out to watch the people who are unable to read the (parking for Tavern customers only) signs that are posted all over the place get towed or booted. Look, you have nobody to blame but yourself if you park in Tavern on the Tracks parking lot and walk of to go somewhere else other than Tavern on the Tracks, you will and deserve to get towed or booted for being ignorant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wf71T2m1KHobO_5cHDyoEA"
  },
  "Ms8HJ24GIYSCbZkpEI4T3w": {
    "date": "2/22/2018",
    "text": "Please do yourself a favor and DO NOT step foot in this place. We had a group of friends that were hanging out at Hot Taco, so we decided to stop in for a margarita before heading to Tavern on the Tracks for food. Less than an hour later my car was towed. I had the choice of paying $350 in cash or $420 on credit and they refused to give me a receipt after paying in cash. This restaurant is affiliated with a predatory towing company. Please stay away!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "VNrXcFk57BsWi-6GqJ0Pvg"
  },
  "U5d0bOllJ28MMSSbbROThg": {
    "date": "3/19/2018",
    "text": "I used to love this restaurant.  But, I went last Friday and the service was very bad and worse, they towed  my car.  I was in the restaurant the whole time-- was a paying customer using their parking lot-- and they STILL towed my car.  They comped my meal, and I didn't have to pay for the tow, but it took almost 1.5 hours for me to get my car back.  All the while I sat without being offered even a drink for THEIR mistake.  Very disappointed-- it will be a long time before I'm back again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "d3dKIcISXriSm-_ez5S0qg"
  },
  "PdlwRc0TnTEin3YsbIq5dw": {
    "date": "1/3/2018",
    "text": "A good place for casual drinks and apps with friends!  A group of us came to Tavern On The Tracks on a Friday night.  The bar is definitely a sports bar- nothing fancy, but that is exactly what we were looking for. We were quickly seated, even though it was pretty busy!  They had quite a few drink specials going on and lots of people were getting beer towers.  We stuck to some local craft beers.  I ordered the Tracks Quesadilla, which was stuffed with pulled pork and jalapenos.  It was surprisingly delicious, and super filling!  I also tried the Toasted Ravioli, which were essentially just mozzarella sticks shaped like raviolis, but they were good as well!  For a low key spot to catch up with friends or watch a game, I would definitely recommend Tavern On The Tracks!  Ask about their drink specials- they always have some good deals going on.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8YGcNsfWjls-dh88N8xK5g"
  },
  "ByPbyTiTI-ULphyIjFgscg": {
    "date": "10/13/2017",
    "text": "I've been to TOT a few times and I'm never impressed.  It's kinda the place we go when all the other places are packed.  They do have an outside deck that is nice, but the food and service is so so.  I feel like this place just hires young girls that don't know what they are doing to work the restaurant.  The problem with that is it attracts your frat boy crowd and the service kinda sucks.  My last meal I had there was the wings.  They cost $16 for 12 and there was nothing \"jumbo\" about them.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YDZQnUeaPGmMkd_nipLN1g",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YDZQnUeaPGmMkd_nipLN1g/o.jpg"
      }
    ],
    "user_id": "x8e1Cc1lh835Q1CpHAD0RQ"
  },
  "8cxxPJrXITVpHCr6VzXbQg": {
    "date": "6/2/2018",
    "text": "Best service we've had in along time. When you go to uptown Charlotte, you typically get rude service. But not here. All the bartenders are exceptionally nice!  We had great conversation and great Service. Will definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8dX-x9chHwgysZO9J1o-Qw"
  },
  "JttnVVp3WA91I6MMttOE4w": {
    "date": "5/10/2019",
    "text": "Orginally from WNY and in Charlotte for a conference. Awesome Buffalo vibe with great beef on weck and decent wings. Great service. Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mv7MhBjGZK9ByYwyIWko9g"
  },
  "EED3eOzxmB0zYYe7LhzWpg": {
    "date": "8/4/2018",
    "text": "DO NOT GO HERE! Your car will get towed even if you are gone for a minute. My fiance and I were out of town planning to meet with friends who live across the street. We went across the street to get our friends, came back our car was gone. We decided against eating because of the UNETHICAL human beings who BROKE into our car and hauled it off because \"we were gone more than 30'minutes\" which we have proof we weren't. Tried to reason with them but all they care about is their $300!!! It's so cruel and awful that they do this to customers! How is his business still running? Hope karma bites them in the rear end! They stole from 2 human beings who was doing nothing wrong!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3fdhs6fqXZ2-7VL-QImFA"
  },
  "RexMwQ_nnRBfgpE7hgz_yw": {
    "date": "3/24/2019",
    "text": "Service here has gotten horrible over the years. I'm getting over it. The only reason I even come back is because there play hockey every now and then. The service has just been pathetic.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GSIYvrnNS3LYfATk0WD8vQ"
  },
  "6jCvnULlQS8lltjXfK4mSw": {
    "date": "10/25/2018",
    "text": "Always love the wings but Monday the wings were not up to par. It was like fryer wasnt hot enough to fry. Wings were chewwy. Service was great tho. Not hating.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_dE0rOmWVYRpGI9CbeYdxA"
  },
  "wJF9e4eBs7DSQKhOGqU8ZQ": {
    "date": "2/6/2017",
    "text": "Out of all the great pubs in Charlotte, I wouldn't waste my time here.  The drink selections were mediocre. I ordered a pale ale. that was on special because I didn't want to pay full price, and the drink was a bit flat. The atmosphere is a bit dark and divey, and my friend and I bounced after one drink. The food didn't look great and quite honestly there are tons of places to go for food and drink within walking distance.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hh1M-3aDJZVTwwYYy9AnA"
  },
  "AQB9EEM58yAsAgpyYWT4_g": {
    "date": "6/14/2017",
    "text": "Tavern on the Tracks is okay.. it's got your basic bar food, solid drink specials, and a old tavern feel. It's a Buffalo Bills bar and the Bills fans are something else. So be aware on Sundays in football season. You can expect this place to be crowded due to its location. Right off the Blue Line and right behind All American and Hot Taco.   Nothing really to brag about. I do enjoy getting the nachos. Their wings are okay too. Nothing special but it will fill you up. It has a nice patio with plenty of tvs. The bathrooms are small and most of the time not that clean. But this place isn't claiming to be some fancy hip new restaurant. Tavern has been here for awhile and has stayed the same.   I haven't had an issue with service. It's never been phenomenal but I don't really expect that walking in. Read some reviews and make your mind up. If you decide Taverns not for you then there are plenty of other places to look too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tHVaQJWxIkMO0DamWIuJzQ"
  },
  "i9MY-N77-C_2jL3slFAXfw": {
    "date": "3/1/2019",
    "text": "Heard the meat pasta is great-wish I could rate it 6 stars. One of the best places in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4-g-SjbSWVKuVyV6qSwdpA"
  },
  "j_9wzsondUklgl_gRneLEw": {
    "date": "3/1/2019",
    "text": "The food is awesome. Don't expect for service to be super speedy, but if slow down and enjoy the atmosphere, you won't be disappointed. Can't go wrong with the nachos or wings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BRQ4lS5pod7xXSHcZxuqzQ"
  },
  "ZF3kgiSfATiCu_P15CEc3g": {
    "date": "12/1/2015",
    "text": "Tavern on The Tracks is conveniently located in South End, with a decent parking lot as well as on-street parking on nights and weekends.  I've been here three times now for food and football games, and each time has left me with a positive experience. Despite being crowded during games, they wait staff is always fast and friendly. I don't think I've ever waited more than 15 minutes for food here, despite ordering at halftime during a packed gameday crowd.  The loaded fries are a great snack to split. The wings are pretty good size, and are super tender. I'd recommend the gold rush sauce, it's dyn-o-miteeeeee. Another great option is the Salmon BLT wrap (my wives favorite); it's loaded with salmon, and cooked to your liking. If none of this piqued your interest, then I'd recommend the good ole chicken tenders and fries. They're huge tenders, and hand breaded .. not the cheating kind that comes frozen in a bag.   PS: This is a Wolverines (Go Blue) and a Buffalo backers bar!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4-Oh0TN8-b9gj12_VUZmAw"
  },
  "dCws2aj4qlh8hAZgdPA4Ig": {
    "date": "1/14/2016",
    "text": "Stopped by one weekday afternoon around 4pm, prior to the after work crowd. There were only a few customers, but the atmosphere was friendly. My date and I sat in a booth and enjoyed some chicken wings and burgers for us both. My cocktail (I believe it was called South End Cosmo) was yummy and pretty strong. Great bar food, very filling and a friendly wait staff.  I enjoyed the decor and good hearted sports banter from fans of opposing teams while watching football highlights. Definitely recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "aKY2rlnSL5nOfnXmyaTetg",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aKY2rlnSL5nOfnXmyaTetg/o.jpg"
      },
      {
        "img_id": "msB41c6DwxJYGZlSKk0kvQ",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Cheddar/Swiss burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/msB41c6DwxJYGZlSKk0kvQ/o.jpg"
      }
    ],
    "user_id": "7U3H1iJZ04FbadJtt2Npjg"
  },
  "fZZ7E1VvCdPjoahi34_AOg": {
    "date": "2/26/2018",
    "text": "Don't ever go to this place EVER!!!!! We went for a drink after dinner and parked in there designated parking. We went in for a few and walked back to our cars and they were towed!!! Carolina towing llc is connected some how to this very shady place!! Both companies are shady. They watched us go in and not an hour later both mine and my friends car was towed!! Cost us both $420 dollars to get our cars out!!! How is this legal?? Both companies should be put out of business for being shady and very unprofessional!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkoUHHYWLmxf6f_DTRi_EQ"
  },
  "PSkvAtnp23YeNdHP4wDI-Q": {
    "date": "1/20/2018",
    "text": "I'll keep this short. Used to be a great spot to drink with a couple friends and watch sports....now they have towing companies hawking the parking lot for people that don't\"stay\" at tavern and the bartenders are Incompetent. Not a Place to avoid but 100% not place to visit if you don't have to.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9StzjOgFx9CXQKoxfR_W8A"
  },
  "_u3JQxBjF4jx3WJVxl66nw": {
    "date": "7/20/2017",
    "text": "This place is trash. It's coated in grime. Maybe theyre going for the divey look... But they are just straight grunge. Also, if you park in the lot next to their building they WILL BOOT YOU THEN CHARGE $150 TO UNLOCK IT.   There are some \"parking enforcement\" men there that extort you for $150 in CASH to unlock the boot they put on your the second you get out of your car. The owner of the bar owns this lot and decided to make a little extra cash money off of the nice people of Charlotte. Sorry people don't want to go to the dump you call a Tavern.   Apparently this is now legal practice in Charlotte so patrons beware.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 15,
      "cool": 0
    },
    "photos": [],
    "user_id": "62eyJU5GG9e028P_6dDinQ"
  },
  "XCqIFDD-deefnq43OOI6vw": {
    "date": "9/4/2018",
    "text": "One of the places I've frequented in the South End area of Charlotte, as I support all businesses in the area because we are a community, but after tonight I will no longer. After seeing the Towing Racket they have orchestrated first hand makes me resent ever supporting their establishment. I parked in their lot because I was meeting a party of friends for dinner. Once parked, my colleagues called to let me know they were in the area at Hot Taco and to stop by for a quick shot before joining my party for dinner. I was literally at Hot Taco for 15 minutes when my party at \"Tavern On The Tracks\" called and angrily stated they just towed my vehicle. In disbelief I briskly walked to the restaurant  to see the tow truck pulling off with my car, while trying to understand how that happened so quick when I've always patronized their establishment and considering I work and live in the downtown area; but to take notice of another tow from the same company towing a guys car who parked there after me. The tow driver then stopped at the steps of the entrance of the restaurant and handed the round Latin bouncer some cash, from there I knew it was a set up. As a community we have to look out for one another but we also shouldn't support Businesses who deliberately take advantage of those who pay their bills, regardless of the night. All my colleagues at Wells Fargo Securities and friends who live in the South End area will unify and ensure Tavern On The Tracks doesn't benefit from the growing economy of Charlotte. Bill Acquario the community will not stand for this and we are all well aware this is a regular occurrence. $300 paid for a debit transaction to release my vehicle smh",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SV2EPfwQGRnHSBfbjr3AFQ"
  },
  "dHm6ButkQLfmCPgUN9lDbQ": {
    "date": "8/20/2018",
    "text": "Do not go to this bar!! Not because of the aggressive towing but because the owner is a homophobic racist. I went to this bar on pride weekend. My friend tries to go upstairs to see if there is a rooftop and a man who turns out to be the owner grabs her. The owner assaulted my friend by grabbing her from the stairs and telling her to leave you dyke. She said I am woman do not grab me like that and the owner said you better start dressing like a woman. Totally homophobic. I don't care if your the owner you are a POS.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "AXeT0AyjCYirMGtldGoFaA"
  },
  "Yu00S4275kWw7ZGz7kUq1w": {
    "date": "4/9/2018",
    "text": "If you park in the lot next to the restaurant, there will be predatory towing company looking to ruin your night and your bank account and charge you as much as $500. Do not go to this restaurant or area. 0 stars if I could. Also - if you do end up getting towed, the tow lot is in a very sketchy dangerous area in Charlotte, so make sure you do not go alone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "61099CQrEMUo8xhqvZdBXA"
  },
  "n42ykY5DBpZp5masmBrcOA": {
    "date": "6/6/2018",
    "text": "Food was pretty good, nice juicy wings. If you like your Buffalo wings nice and crispy make sure you inform your waitress they are great. I've met the owner he's from Buffalo like me so I we know about wings a very nice guy also.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "foF7Ic7elrIS13sdFh2CUA"
  },
  "yOoewhPHR-Vw2dAF5eWHXg": {
    "date": "7/29/2012",
    "text": "The worst place I have ever ate at. Don't go hear after 1:00 am. We left a bar to look for food and we ended up here. Big mistake should have went to McDonald's instead. When we showed up we asked if the kitchen was still open before we were seated and they told us yes. We sat outside, ordered food and a beer. The waitress offered us a bucket of beer instead and we told her ok. When the food came out the wings were not cooked we had to send them back this was around 130 when the waitress came back she told us they could not re grill them or make more because they had already closed the kitchen so they took it off the bill. Than the waitress told us we needed to go ahead and pay so they could close the registers. After she brought the bill back they turned off the outside lights so we were left in the dark to finish our dinner and drinks. We asked a waitress if the could turn the lights back on and she said she would have to see and rolled her eyes. At 145 the manager came to the door and told us we needed to leave. We told him we still had a bucket of beer to finish that his staff sold us. We told him it was rude that he turned off the lights after we paid and he just said WOW! and walked away. He came back to the door every 5 mins and stared at us until we left at 2:00 which is when most bars downtown close. Even the Gin Mill next door still had a packed house. We will never eat hear again. Most unprofessional staff I have ever seen. The food sucked too. STAY AWAY!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qju9POH-u9lcQch02qwxlg"
  },
  "299XXGMsvX5Tn4k1LQxLTw": {
    "date": "5/2/2010",
    "text": "Sunday lunch crowd was a little sparse.  So we were there with a 10+ table, and our order was right behind theirs.  So the food took a little longer than expected, and the black and bleu burger was a bit drier, and not med-well like ordered.  A-OK.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CMiWWB_1pjczZcl6PPvN5A"
  },
  "MEdVRxU63BjDxyg_SuOxvw": {
    "date": "4/27/2011",
    "text": "This is definitely a townie bar.  Because of the apartments next door, it's almost like Cheers on some nights- just a bunch of regulars sitting around drinking.  This bar is definitely not trendy.  Personally, I like it that way.  The food is good, the drinks are cheap, and if you live in the South End area, you can't beat the location.  Carissa is really the only bartender that's any good though.  She's the type that already has your next drink waiting for you before you've finished the one you're on.  The others are slow and kind of standoffish.  If you want a bar just to go, watch a game, grab some food, and just relax, this is a great bar to go to.  It never gets super crowded outside of the Buffalo sport nights and everyone there makes you feel right at home.  I would avoid the bar like the plague whenever teams from Buffalo are playing (unless you're a Buffalo fan), those people are obnoxious!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yy7jVB58zKWXakvaEH47gA"
  },
  "8b7MGldAv-EVJjPTEzkY1g": {
    "date": "6/2/2019",
    "text": "Met my boys for a late lunch here as they have claimed they have the best bacon cheese fries.  Well, they were right.  They use waffle fries with just the right amount of cheese and plenty of bacon.  The ranch dressing for dipping simply added to its taste.  So good we ordered two!  The chicken wings are very good as well.    This is a restaurant in Uptown that has that local \"hometown bar feel -  a square wrap-around bar is the focus of the restaurant.  They have a full bar.  You can tell they had their regular customers as you saw laughter and camaraderie amongst the bar patrons.  Plenty of televisions to watch whatever you wanted.   There was also a few electronic games to play.  The service was excellent.  It seems as though its the same staff that has been there for years.  So friendly and helpful.    My boys say they draw a big crowd when the Buffalo Bills play.  So if you are a fan it would be a great place for you to spend your afternoon watching football.  Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zrA9UHNy2J5tFyDWegCqRQ",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Inside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zrA9UHNy2J5tFyDWegCqRQ/o.jpg"
      }
    ],
    "user_id": "fS0kFv5UdbQLBy1Rq3xuwA"
  },
  "LR-aNy3CQIDSfk6Dmi59JA": {
    "date": "5/12/2019",
    "text": "Honestly I wanted to like this place.  Just passing through town on a Sunday.  Went there based on reviews.    First off, we were stopped by a drunk guy at the entrance wanting to play \"rock, paper, scissors \".   So, we walk in and incredibly loud rap music was blaring with a lot of swearing.  I'm no prude but he, it's supposed to be a nice comfortable restaurant, not a college bar.    We were sat only to see 4 or 5 guys SLAMMING a boxing machine the entire time we were there.  Ok, now onto the food.  Took waitress recommendation for a Beef on Weck Sandwich (same as a French dip but on a bun, not hoagie roll).  Fatty roast beef, just gross.    Had buffalo chips as an appetizer.  They were ok, but nothing to write home about.  Out of Miller light on tap and bud light, seriously, both?    Fresh cut fries.....ummmmm, refried several times, gross.  Didn't even seem fresh cut at all.  Seriously, everything about this place was a huge disappointment.   I had fish, and it was undercooked.  I asked for it well done specifically.  The waitress was nice, that's about all I can say good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ZVV6RJjRJ595MLgidVzNA"
  },
  "VScgpJUyjVUOEkuNvpnFnw": {
    "date": "3/25/2019",
    "text": "Let's start with the food. It's alright. Wings are okay, although you're better off going to Buffalo Wild Wings. Beer selection is okay. Staff can be kind of rude at times.  What is really at issue is the corruption in how this place conducts its business. What kind of place steals customers' cars from the lot and then charges them $420 to get it back? They even did this to a mother of two and tore the bumper off her car, causing over $1000 in damage, only to be given the runaround for two weeks before the \"towing company\" would accept any responsibility.   My car was towed as well, even though I was in the restaurant the whole time! Fortunately, I successfully contested the charge on the credit card, which I recommend you do if this happens to you.   What is happening is that the owner has decided this is how he supplements his income, as \"Carolinas Towing LLC\" is giving him kickbacks under the table.  Please lend your business to honest establishments, not this scam.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "y-BoMzLNRRRZn-_4UZozSw"
  },
  "WA3vkJQe14njHCH3uGoXOw": {
    "date": "3/18/2019",
    "text": "I guess I like this place more than most ...because I walked here. Looks like people get their cars towed here frequently.  My experience here was pretty good. I was craving some wings and John H. said it was decent.   So: Some really good Nineties music + cute waitresses + really good wings made with house made sauce (the Gold Rush has just enough heat) + Legion's Juicy Jay + great company = fun night.  Go for the wings and beer - get down and dirty - and leave your car at home!!",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "5jJjY5_R06Og56VfjIc66A"
  },
  "usQ1jYFrNi1eARsqVyVZRg": {
    "date": "9/9/2018",
    "text": "Yes, it's a Bills bar. Yes, if you park in the lot and don't immediately go in the bar you will get towed. Just know that going in and you're totally fine. This place has the normal grungy bar scene, is understaffed & the food is average at best.   When we arrived it wasn't very crowded, yet it still took our waitress forever to get our drinks, then another forever to get our food orders, then another forever to actually get our food. Catch my drift? And I'm typically a very patient person. Before it got crowded, our waitress did nothing but complain about how busy they were and that there weren't enough of them working. No one complained to her face, she just offered up all of this as a fact and not even apologetic.   Anyways, the food-the menu looked great and the food was your average bar food. The buffalo blue chips are literally potato chips with hot sauce poured over it with some cheese and banana peppers on top. I was hoping it would've looked like a little more effort was put into it. The best thing out of what the table ordered was the French fries covered in cheese, bacon, and scallions. I also ordered the bbq chicken flatbread, and it was a disappointment. My husband burger was just okay (per him). At the end of the night, our friend paid with gift cards (WHICH HAVE AN EXPIRATION DATE! WTH?!?!). It took the bartender or whoever a solid 20 minutes to figure out how to calculate it....  Basically, I would only come back if my friends forced me to.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "73X08EP1Kd-lua89xIC_yw",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Buffalo Chicken Flatbread (small)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/73X08EP1Kd-lua89xIC_yw/o.jpg"
      },
      {
        "img_id": "8PTALVz60krYUpV90mBe_Q",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Bill&amp;#39;s Mafia Burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8PTALVz60krYUpV90mBe_Q/o.jpg"
      },
      {
        "img_id": "h1s0aThcnTyCaGuTunD5rg",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Loaded Buffalo Chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h1s0aThcnTyCaGuTunD5rg/o.jpg"
      }
    ],
    "user_id": "yfgsLSvLE99m4qSZblkDkQ"
  },
  "iof7zsyoMuoX0gzJ8s2BcA": {
    "date": "7/10/2019",
    "text": "Places like this are a dying breed in this area of Charlotte. An unpretentious sports bar where you can enjoy greasy food, and cheap beer. Their wings are among the best in Charlotte (try the gold rush sauce), and it was here I discovered my love for the Buffalo staple known as the beef on weck. Nothing fancy but they provide friendly service and some great bar food. Please note that on Sundays if the Bills are playing you better go somewhere else if you want to watch a different game. Every TV will be dedicated to the Buffalo Bills. Also they are known to be very strict when it comes to parking in their lot so do not park there and walk to a different bar or you will likely be towed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yewf3rGkynR_-IN-4u-D8w"
  },
  "aeV-D9s3zUABSSMDQK6bKQ": {
    "date": "7/15/2019",
    "text": "I've been here a few times. Usually just to coat my stomach after I've had a few. Went for lunch the other day on a work break and was excited to see some new menu items. Got the Philly cheesesteak cause they advertised my favorite ingredients: peppers onions and provolone cheese!   Got the plate - a 1/3 full Philly with 3 pepper pieces and a couple onions with 2 slices of half melted kraft singles...  Damn. I'll stick to this place when I'm drunk.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hxYeWjbgNNvR2UOSlaJs2g"
  },
  "it6gdALZd0KCIGgCr-XJsQ": {
    "date": "5/28/2019",
    "text": "Just updating my previous review. I've stopped coming here years ago, not because of the food but because the people who work here seemed to be unhappy and wanted to spread their misery around.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZvmC522FAwxt8qT1jxqliw"
  },
  "Zg0PLX-TgVsvG7tCGwS37A": {
    "date": "10/28/2018",
    "text": "My new fave pub!!!!! Always seen this place jumping while I was at work and have never been. Well I decided to look on Groupon for some money saving food ideas...since it's the holidays and I'm sticking to a budget AND guess what pops up first??? This baby...15$ for $30 worth of food AND there wasn't any restrictions on using the voucher for alcohol purchases. WIN WIN AND WIN!!! But back to the food and atmosphere. It was great. A Saturday at 5pm and it was the reserved day for Halloween and we got to see plenty of costumes. The waitresses here was even dressed up. Looking at the reviews of this spot and everyone raves about the wings and the special sauces. Hands down this was the best wings that I have eaten at any bar place in a very very long time. They were hot and fresh and cooked just the way I love it. Our servers Tiffany, Tim and Jeff in that order-yes we had three of them because we decided to sit at the bar, were absolutely amazing and engaging, which I love especially when seated at the bar. There are multiple televisions here and they also have a gold interactive game. This is a spot that I am definitely coming back to and hate that I've waited forever to get here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_qVP6qa5JYsg4sOUf5S52Q",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. He was thirsty",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_qVP6qa5JYsg4sOUf5S52Q/o.jpg"
      },
      {
        "img_id": "Pi2bf8ESTkDeHIcwl9AlGA",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Sex on the Beach. It was so delicious!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Pi2bf8ESTkDeHIcwl9AlGA/o.jpg"
      },
      {
        "img_id": "uNUHdMk7UsaADR4r2mwxBw",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Moses???? Or a __________. You decide‍",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uNUHdMk7UsaADR4r2mwxBw/o.jpg"
      }
    ],
    "user_id": "vBxT4_bjFrbZEarWz6vsCQ"
  },
  "J-zIHj-oX0vGdSHr1PPc1g": {
    "date": "3/9/2018",
    "text": "I don't actually know how the disgusting people that work here sleep at night. They tow cars as soon as people walk in, even before they enter the intended bar. If your car gets towed and you call the number to pick it up, it's the \"bouncer\" who says you can't pick it up same day. Gives no reason. I asked the employees, bartenders included, how they sleep at night to which they responded \"we don't\". Don't fund this place. It is disgusting and filled with unethical human beings.   I would rather eat a dead rat off of the side of the road in Durham, NC next to Duke University than ever find this place with one penny of my own money.  Pictures for effect.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mQ0M9jLc_SJ-5BOIGSYZpg",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mQ0M9jLc_SJ-5BOIGSYZpg/o.jpg"
      },
      {
        "img_id": "to_GL220AbK4uKuHCGx2jg",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/to_GL220AbK4uKuHCGx2jg/o.jpg"
      }
    ],
    "user_id": "ukkBpsBw8GFz0RAU1K2oGA"
  },
  "CrKIFOPAdkR96PwucHyKfA": {
    "date": "4/3/2019",
    "text": "Stay away!  I went there for lunch with workmates in mid March. The food was not good.  Much of it was undercooked and not so nice to look at.  Even the French fries were undercooked. I'm talking like still off-white on the outside and cold in the middle.  Who messes up French fries?  Someone else had chicken wings, and they were also not appetizing.  I won't be back there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dksppmS5T8IFx0qz_vcE5w"
  },
  "znKH2Fg3tXS4n9wDwQ6IGQ": {
    "date": "10/9/2018",
    "text": "The food is subpar at best but worst of all ownership clearly does not care about customer satisfaction.   Chicken quesadilla was just a pile of soggy tortilla, cheese, rubbery chicken, and grease. Would not recommend Tavern on the Tracks to anyone.   First 1 star Yelp review I have ever written.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zbrsz-dgfaMCnYcmQyNHGQ"
  },
  "4UuF1IGOorUfs3oK46NREQ": {
    "date": "7/3/2019",
    "text": "Good food (travels well via by Grubhub too!). Very friendly, down to earth staff. Unpretentious place and people. ...Where everybody knows your name. I love hanging out here. Kinda dark & dingy in the best possible way.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ivOMqBopa8ammYK2xlaCiQ"
  },
  "Uk_fILuWSQEZ0KziCU9c5w": {
    "date": "2/15/2019",
    "text": "DO NOT GO HERE. Went to this bar and was actually drinking and eating there and not even 10 minutes went by went to get something out our my car and my car was gone. No one could take responsibility, give us their name, or actually have a reasonable conversation. This place is just scamming you to make you pay whatever price they want you to to get your car back. We were told $200 and then the price kept escalating. We had the police involved and because of the city law they can't do much. SERIOUSLY DONT GO HERE. please share if you had a similar experience because this place seriously doesn't deserve to be in business. We will be taking this situation further and already have contacted they city council. Don't believe me? Watch this. <a href=\"/redir?url=https%3A%2F%2Fwww.google.com%2Famp%2Fs%2Fwww.wsoctv.com%2Famp%2Fnews%2F9-investigates%2Fthe-number-one-place-for-getting-your-car-towed-in-charlotte%2F753731253&s=ea50facdc760719736d3f64b142efeac463b93787ea3022ca3da9844f5e9df38\" target=\"_blank\" rel=\"nofollow\">google.com/amp/s/www.wso...</a>",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MvS7PV29e6HGNev9ZBC9nw"
  },
  "aNGcNX1Zfnid7Zj4kvwt_w": {
    "date": "6/26/2019",
    "text": "Went twice in 2 weeks  great bartenders! Beef on Weck and the Italian sausage sandwich! Amazing! Great Local Pub! No pretenses! Loved it!! Felt safe for an older gal on her own!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NTNhmD1iI4QG8iF32MXzSg"
  },
  "95UWdiEWRl1r0s8YATMMaQ": {
    "date": "3/1/2019",
    "text": "There were multiple hairs in my chicken tenders and our whole group got food poisoning. Do not eat here. The server called our group a derogatory term... I won't repeat it here because it's too offensive. Please don't spend your money at this excuse of a restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "802xS72S-bH4uzMtyCrASQ"
  },
  "TdMEFIOjdZqkdrtfgEt6Yg": {
    "date": "5/10/2017",
    "text": "This is a decent spot if you're looking for somewhere to go with a group for happy hour.   Just a few notes from my visit:   1. They have daily drink specials - but ask what they are so you're not surprised when what you ordered isn't actually a \"special\".   2. The black bean burger is good - not great. But it's not a typical frozen patty so that's a win.  3. If you get a salad - order it with the warm bacon vinaigrette dressing.   4. Wednesday is trivia night. Even if you didn't go to play...you're going to end up playing.  Tip! Try to be there early so you can find a decent parking spot.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "irWsQsEdR4_XIbAomdwg2w",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Black bean burger w/ side salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/irWsQsEdR4_XIbAomdwg2w/o.jpg"
      },
      {
        "img_id": "EgAWwQaN-fHMWGBB_aVIzw",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Loaded Fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EgAWwQaN-fHMWGBB_aVIzw/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "wUzwX3W02n9BTHI2vQN9GA": {
    "date": "10/29/2018",
    "text": "Great atmosphere for Bills fans! This bar supports 4 different teams from up North, so those far from home can get their fix. Food was a little lackluster especially the specialty mac and cheese, which needed a little more flavor. Chicken wings had a good variety of flavors available, and had a good thigh/wing ratio. Unfortunately ours tasted a little undercooked, perhaps they just were taken out a bit early. The crust of the flatbread we ordered was a bit overcooked. Overall a solid standard food experience. Service was good, especially considering how busy they were!  P.S Nathan Peterman should never pick up a football ever again. Circle the wagon",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EDeVj4rChGXqH9Y_4v2Cug"
  },
  "I9yfPCuz_PjT6Jwybnwg7w": {
    "date": "7/17/2018",
    "text": "I came here to check them out for Charlotte Burger Week.  I went during the mid afternoon so I didn't have any trouble finding parking.  I do see how on a busy night it would be extremely difficult to find a place to park or even a place to sit inside.  I wasn't sure where the entrance was so I just went inside through the patio.  Still not sure if that's the main entrance but it worked!  I was promptly seated at a table by the bar.  There are no chairs with backs here, only backless barstools.  It's not that big of a deal, but I like having a place to lean back especially if I'm going to kick back for drinks and a football game. There's not much to the inside.  It's just a basic bar but be aware that it is a Buffalo Bills bar.  If you aren't a fan of the bills then you probably aren't going to want to come to this bar during football season.  The waitress was also the bartender and was very attentive.  She kept my drink full and made sure my food order was good.  I will say that the burger they had for CBW was impressive.  It it was a half pound burger on a brioche bun with blue cheese crumbles, Frank's red hot, and onion straws. (Plus the basics of pickles, onion, tomato and lettuce.)  It was $6 for the special and I ordered a side of homemade chips with ranch dressing.  The burger was juicy and delicious. I couldn't even finish half of it because it was so filling.  I took home half to eat later!  The house made chips were cold.  There were crispy but I would have preferred if they had come out hot or at least warm.  Considering I was the only person in the place eating, I don't think it should have taken 25 minutes to get my food.  Their ranch dressing was nice and creamy but they charged 75 cents for it.  I get it.  You have to cover your costs but at least tell me when I order it that it's going to cost extra.  Overall, the food was decent but I wasn't super impressed and  I'm not sure if I'll be back.  The patio did look really nice for drinks and I might have to come check that out with some of their famous bloody mary's I've been reading about on the Yelp.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TlwMVJ-bpUqLe1AbM-xTvg",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. The bar area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TlwMVJ-bpUqLe1AbM-xTvg/o.jpg"
      },
      {
        "img_id": "ghwVjA_cN4QxjKIHF-3i6g",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Clt burger week",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ghwVjA_cN4QxjKIHF-3i6g/o.jpg"
      },
      {
        "img_id": "D_aOvVo2C7jRsX8C-co3hw",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States. Home made chips and clt burger week burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D_aOvVo2C7jRsX8C-co3hw/o.jpg"
      }
    ],
    "user_id": "9eFi-CKKmdlwpoHVja9Y6g"
  },
  "hf5Of7Sc1EkF-i-X0oKXoQ": {
    "date": "5/29/2019",
    "text": "Great wings, however I called to see if they would play the Stanley cup finals game tonight with the sound on and they said only if there were enough people.... at a sports bar. Literally not any other competing sporting events tonight.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZdSOrL81cZvPVRFTCYJQIg"
  },
  "s06YayRKxxpGo1KLXrFEvg": {
    "date": "12/16/2009",
    "text": "Another great lunch spot! They do have the best wings!! (Gold Rush Flavored)  The service is here nor there but the food is always exceptional. For the most part The Steak Salad and the Grilled cheese are always good I also get the Steak in the grass just to mix it up a bit!! A good Sports Bar",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "SCqaYcRbmXKm6vgyMeIYfg"
  },
  "hGKyhLTu9NfjtgZ2QFfP-w": {
    "date": "3/16/2015",
    "text": "The beer was good and the sandwich and fries were fine, but I'll never come back here because of the appetizer. Please please please do not charge me nearly $8 for salsa and guac when it's obviously Tostitos salsa and pre made guacamole (that was flavorless). It's one thing to just be lazy (and it's a bar so whatever) but to charge me this much money for it is disgusting. Please don't rip off your customers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vCxwxGridsNKVK4QAWCIMA"
  },
  "6CoidAkJI2LMOwzb-UFZaw": {
    "date": "10/12/2010",
    "text": "I frequent this place for lunch when its warm enough to walk over from the office.  The food has always been tasty  - I suggest a salad they are fresh, huge, and delicious.  Its not the cheapest option for lunch but they will get you in and out of there and you will be satisfied.  This is also a great place to grab a drink after work, for the game, with a crowd any occasion really - I like this bar and the staff is friendly. Enjoy!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJafm7vGSkUI5ocgYkCWkA"
  },
  "XL6vmTfT49SG_3PdKI-lXg": {
    "date": "1/3/2012",
    "text": "Stopped in here with several friends a few weeks back during a weeknight and was pleased with the service.  I think I would like to visit more often but it's just not THAT convenient to uptown really.  I wasn't floored by the drink specials either.  All in all it's a fine spot to grab a few beers and anchor down for a while.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "g-8C3KUix6da-sQWSrhTMA": {
    "date": "1/26/2014",
    "text": "Try the beef on weck! It's the best I have had. Laid back sports bar atmosphere. Not the best beer selection (get some more local CLT beers!), but best bar food in south end by far",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rVLJpAELlvwHtZLNECIuZg"
  },
  "Cfw51dLTGizjroylelmETw": {
    "date": "6/19/2011",
    "text": "I'm sorry, a bar this close to Amos' and uptown that closes at 1 on a Saturday night? Some friends and I had just gotten out of a show at the Milestone and came over for a drink. It was about 5 after 1 and we were informed that they were closed and we should go to the Gin Mill. No problem buddy, I'll do that from now on.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "I6DOULDVlRpIHuhV3rQpTg"
  },
  "nRoj9pzRr8w-fZiZ1u48QA": {
    "date": "1/13/2015",
    "text": "Tavern on the Tracks is one of the most welcoming bars around Southend..the staff is very friendly and upbeat, and the owners are always present helping out and making sure everyone is having a good time. Great wings, great flatbreads, great drink specials",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7PAZWXeL2FE8SiAk48ZacQ"
  },
  "9Rs0xUYH0mliaQt9HlrE5w": {
    "date": "7/1/2012",
    "text": "Always a great spot for some chow & hang out w/ pals!  The Fish Fry special on Friday is just fantastic; more fish than you can handle.  Not exactly a Buffalo fan, but the atmosphere is cool.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6FafMEVexkpqku_cMcZaQ"
  },
  "8cAuOy4Gd5J9JZhhkryHAg": {
    "date": "9/30/2008",
    "text": "I headed here with my momma one night to grab a bite to eat. We got a seat outside on the patio, so I was happy. It was my 1st time here so I didn't know what to expect, but was pretty happy with the place.  I never went inside, so I can't speak to that, but the patio was nice & had some tvs as well. It was trivia night while we were there & the questions were really difficult to hear outside, so my mom & I decided not to play.  Anyways, the food here was a little better than I expected. I was thinking sports bar food just from the look of the place, but they actually have a pretty good menu with plenty of intriguing options. The food is above average, & you'll pay a pretty decent price, but it's well worth it on the patio.  I didn't know what to expect from Tavern On The Tracks at first; I mainly thought sports bar with average food. But I was surprised at how good the food was & how nice the patio atmosphere was. I can't speak to what the inside is like, but patio seating is a nice relaxing atmosphere to enjoy on a nice night.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kjYbPkrbgPMVUAjungJ4Aw"
  },
  "FVvbaTcoFEWwlpxSIMwoxg": {
    "date": "9/13/2005",
    "text": "This place has a nice, neighborhood tavern atmosphere and a great menu.  The ribs were excellent!  My advice is to stay away from the fried ice cream for dessert; it's not very good.  A good menu, great prices, nice wait staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jukdpc6K4eSmBIOdLz2UWg"
  },
  "lQS5GoU88AKyfUdCv6asUQ": {
    "date": "1/12/2012",
    "text": "First trip here was unsuccessful. I just can't gvie any bar under 3 stars though because they have alcholol. The place was ok, this is definitely more the type of place to sit down, have a few drinks, and watch a game.  The bartenders were really nice, but probably because there was only 8 of us at the bar.  What was a turnoff though was there was the news on three channels.  If I am at a bar, I don't want the damn news to come one for one specific reason.  This reason being the idiot nexto ime will engage me in a conversation about whatever crappy story is on the news.  I don't want to discuss I485 construction, kitty fashion shows, or politics. So bars, please never have the news on tv. There is no dance floor and I didn't hear any music.  I will try again and hopefully it will be filled with more people.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ulLNJBYJz_2Pu4uG_BeqoQ"
  },
  "c10O9NuCQPR45uHcs6B1hw": {
    "date": "4/15/2012",
    "text": "I have been going to this bar on and off for about 5 years. Its in a great location. I feel safe if I go alone. The food is awesome considering you are at the bar. The staff is great. When they see me walk in they automatically know what beer to pour me. The people who go to this bar are very friendly. The age range of people who typically come here are 21-60. They also have a great patio all year around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YwI4nPXLAiMUt6yFa_RsFQ"
  },
  "Lr3o2P74nqdCKBTtBhgewA": {
    "date": "10/12/2011",
    "text": "While visiting Charlotte, we wanted to see more than just the touristy Uptown area, so our first night in town we took a stroll down to Southend and did a bit of a pub tour.  This was our first stop, as we saw their inviting patio as we were walking by (also, I'm a sucker for anything railroad themed).  We each had a local NC beer here, which were both tasty and inexpensive at $4 a pint.  Our server was very nice, and not pushy when she found out we weren't there to eat dinner, but were just having a drink and enjoying the lovely weather.  Because of that, I can't speak for the quality of the food here, but everything that went by our table both looked and smelled great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-rBPL3ntdbLnTw3uwZLfQw"
  },
  "agxSodEqNN1vFnequhZ7Kw": {
    "date": "11/1/2010",
    "text": "I was out on a Thurs night with some friends who were hungry and it was a little late for most establishments.  Luckily the Tavern was close and open.  It seems like a respectable and friendly place.  They have classic bar food options - and push beyond burgers and sandwiches with entrees like Salmon.  The atmosphere is good to hang out and watch some sporting events with friends or just chill and talk.  I did not partake in the food, but my friends were satiated and seemed to generally like what they got.  The only hiccup was some mashed potatoes that weren't heated up enough.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "f47N37WU1_PsQKxvZdaTwA"
  },
  "04uFcglWLCI_NUdkFQwe1g": {
    "date": "11/2/2013",
    "text": "Terrible service.  They were not busy.  Took 10 min to get a beer.  20 min to get appetizer and 40 min from ordering to getting food.  Also waited most of that 40 min without anything to drink.  The also switched from pint glasses to plastic cups that held about 40% less but charged the same.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1f7jCBfvFg6IluxHNnHYHg"
  },
  "uEVQwOYt1IYscEl2EJdYlg": {
    "date": "9/28/2010",
    "text": "Tavern on Tracks...great location off the light rail with an outdoor patio and parking! Busy on game day and at lunch. Plenty of TV's, including on the patio, though the ones on the patio are the old \"boob tube\" type. Typical bar menu, but more in depth than others. Lots of sandwiches AND salads. Great wings and a great beer selection. Had a recent issue with a to-go order, but it was rectified. Just make sure you keep an eye out for your order if you're at the bar. Overall...a nice neighborhood pub w/food.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "c8cur4lMkQsHoUEqm-qwxg"
  },
  "A5xi5euvmISz2ZAAmAB8Ow": {
    "date": "4/24/2011",
    "text": "Best wings in Charlotte, hands down!!  Awesome bleu cheese to go with them and great fries.    My wife got the Friday Fish Fry and said it was fantastic, and the cole slaw was outstanding.  Also serve Beef on Weck, which my dad approved of.  Great place for Buffalo transplants!  Was great to watch the Sabres beat the Flyers in OT there.......",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4eq9dwlfxq8hOcJ-GNxNw"
  },
  "zqaCpISLvNylFctRo9oTnw": {
    "date": "7/17/2010",
    "text": "Its been a while since I've been here but the last time I was there the beer was not cold at all and the staff just didn't seem that interested in making sure you had a great experience. I love the location but not sure when I'd go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ibZzVC6UWgIPrEZiXs-DBA"
  },
  "6NHbtQNEUbvjhzsxQ2Tfbw": {
    "date": "4/21/2010",
    "text": "A  Buffalo NY inspired bar conveniently located within walking distance from my apartment.  As other reviewers have said it has a chill neighborhood tavern vibe and the outdoor patio is pretty sweet for some nice weather outdoor lounging. A big plus for me was finding a decent \"beef on weck\" in the south!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "II09TH8Z4YLLIOwIZhTJCg"
  },
  "LzzUA5qE3ZPV8wFZ8UtjKQ": {
    "date": "2/16/2006",
    "text": "Tavern on the Tracks has friendly servers and great food.  It has the atmosphere of a sports bar but the menu of a quality restaurant.  On the top of my list are the \"Steak in the Grass\" sandwich, the chicken terriyaki, and the grilled chicken sandwich (with buffalo sauce on the side!).  In warmer weather, the patio is great for lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "iKVA8_-_BnpJ-2L7CSwiZQ"
  },
  "9uuuwf1u_jwaObuwwi-RKQ": {
    "date": "4/12/2016",
    "text": "Sweet waitress but shitty food and the place looks like it hasn't been cleaned in a while so I cannot imagine the kitchen. Will not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aNBoacKOlWzhgijth1st8g"
  },
  "h1wvA34FhEe4hs-KveKYQA": {
    "date": "4/16/2012",
    "text": "Salads are pretty good. My sister LOVES their steak salad. And the chicken salad is pretty good although it was pretty chewy the last time....  I do like how they chop up each veggie as opposed to throwing a huge mound on top of the lettuce that you have to repeatedly cut up in order to eat.  Usually we get takeout from here. I did venture in one time to pick up our order and was left standing for quite some time. Did not appreciate this and now that I think about it, I havent been back since. Meh!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "CHf8EbvYLUUCpQxP9_lP7A"
  },
  "p7HodJcKcjLSc6qMuvejiw": {
    "date": "6/1/2016",
    "text": "The cooks can't seem to get it together at this place. I've eaten here numerous times with issues happening more often than not. On 2 separate visits, the fries have been so undercooked that they were not edible. Another time, someone ordered a cheese burger, well done and it was medium at best. He sent the burger back and they took the 2 halves and put them on the grill, which burnt both open sides of the burger, but still didn't cook the meat through. There is no way that this should be an acceptable \"fix\" for something that is undercooked. Our waitress even told us that the cooks are not good here and she has issues with them daily. Management should be aware of this and those people should not have a job. There are enough people looking for jobs that would be willing to put forth the effort needed in this type of position. Go hire them and get rid of these lazy employees.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7eEnPTOrXq13eunc-4iMNw",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7eEnPTOrXq13eunc-4iMNw/o.jpg"
      }
    ],
    "user_id": "VAonxcB-NoEaUn5bcIb56g"
  },
  "R5nS9YlYl7t1x1W06HccQQ": {
    "date": "5/20/2016",
    "text": "Great local bar, cool low key atmosphere. Large patio, great location. Not the best specials but it is south end. Food is always above average bar food. Beef on Weck is yummmm",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5CM5bCBxU-YgR75BDe-yw"
  },
  "sKn-kS5O61OmfT4vzWZ9hg": {
    "date": "5/28/2017",
    "text": "Wings were great! Ravioli was great! Servers were awesome! They said they were understaffed but I couldn't tell. Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CNwvOw_grvZgivnUXcGmWw"
  },
  "PIMz2Xt4q-hfnzxwXz2nsw": {
    "date": "5/5/2017",
    "text": "Just got the Chipotle Chicken Fingers Appetizer... OOOOH  MY GOSH.  so good.  Tender, nice size.  I will be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8MPTwwGLc48Azfsa-hjHAw"
  },
  "qLy9UcyQEQo_c5fpSIUDBw": {
    "date": "6/16/2012",
    "text": "Great location on a friday night (although the crowd does die down considerably by 11:30). I ordered the Beef on Weck which is a rather bizarre mix of cheese, beef, and horseradish sauce (that looks like Ranch). The flavors were interesting and the crust was decent (not really pizza crust though), but it was hard to eat given the large amount of salt. One of my friends who had ordered the same thing was regularly chugging down water and we both ended up not finishing (saltiness becomes unbearable when you're no longer starving). I do have to give props to the servers here though because they're super friendly and chipper.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wfos2QrWHTcwhFrxBJzbGA",
        "caption": "Photo of Tavern On The Tracks - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wfos2QrWHTcwhFrxBJzbGA/o.jpg"
      }
    ],
    "user_id": "haEqV41MSa3d4KFuMia76w"
  },
  "1WSvumcA1skUZiakaNoO4A": {
    "date": "4/3/2013",
    "text": "Stick to the basics. Don't be an idiot. The same way you don't wander into shady neighborhoods when you're away from home, don't order something you would get at a fancier place when you're at a sports bar. That being said, Tavern on the Tracks serves hearty and great versions of pub food classics. The trick to this is little fan fare (no pun intended), fresh ingredients and meals are prepared to order. All of your simple Gordon Ramsay stuff. The portions are generous and traditional, the way they should be at a sports bar.  Cheap beer. Cheap beer that is not Bud, Bud Light or PBR. Which means cheap beer that doesn't taste like used beer or give you a splitting headache and the runs. Tavern runs $3 beer specials on all pints pretty regularly, althought I'm not certaiin which days. This is a pretty large place inside, so if it's not game day or big minor league basketball game, there is no real issue with seating. As mentioned by others, this is definitely a Buffalo Bills bar which means I stay very far away on Sundays, since I'm a Pats fan and don't want to catch LOSER-itis. J/K! I could only wish there was a place this great as a home base for watching a Sunday game.  Very important, the atmosphere and people in here are decidedly WAAAYYY less douchey than at some of the other places in this neighborhood. You don't need a silver-plated spoon to ride this train. This is a very laid back bar and has a Northern feel to it.    Keep it simple and that's what the Tavern does. The buffalo tenders and wings here are some of the spiciest I've had in Charlotte. Anyone who says otherwise, did not get the \"steam-engine\" flavor. Even drunk, finishing all these will be difficult. For any pub, wings are the equivalent of filet for a steakhouse. The fish and chips is another fried greasy hangover comfort remedy that is a can't miss here. I've tried a few of the sandwiches and while not mind-blasting, they are satisfying. This restaurant serves fresh cut fries that are pretty average. While I always go for fresh anything, these fries are pretty limp most of the time. This is the one area that needs improvement. I cannot speak as to the quality of the hamburgers (a True pub food staple) as I rarely get them anymore. Being informed is a great way to ruin your fun. I've heard mixed reviews.  I'm not saying that if you order something other than wings or beef on weck, it won't be good, but don't be surprised if the pasta you order is not as great as your favorite Italian joint. In comparison, humble pub food AT A PUB will be the best tasting food to eat of all options. (This service announcement isn't just for this particular restaurant...its a general common sense thing, like put cold stuff in refrigerator). Not sure why I'm so ornery about this today.  I don't get the fascination people have with sitting outside on the patio to eat. Most of them don't even smoke. That also being said, the patio is nice and if I had friends, I might understand sitting out on a nice day to have a meal. However, the television sets out there look like something my Dad brought home in 1983.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "4f1k-DnBUxXe6vVzksrrHA"
  },
  "5SCXC4_oQbbYdlKXDE2DXA": {
    "date": "10/12/2011",
    "text": "Tavern on the Tracks is another good place for WNY transplants.  I don't frequent it nearly as much as I did when I lived closer.  One of the former co-owners opened a similarly themed restaurant in Fort Mill called Towne Tavern, but the menus have become more and more separated over the years since they aren't affiliated.  TOTT is a rare place for Charlotte.  It's much more of a blue collar bar than a lot of the places in the area that are more yuppyish.  The inside seems cavernous with high ceilings, a huge bar, a split level, and a big outdoor patio.  The building dates back to the early 1900s so it's rustic.  I used to see a lot of local celebrity athletes in there, but not so much anymore.    The food is mostly above par, but I think they may have expanded their menu a little too much and not everything is good.  The wings are extremely good, reminiscent of those found in WNY, but WNY's not as famous staple - the beef on weck sandwich - is not a True beef on weck.  The fish fry is inconsistent and the pizza, once served on Nirtsche's dough (a former nearby pizza place operated by WNY'ers) is now served on pre-made dough.   My wife ordered shrimp once and it smelled very foul.   There are some decent menu options though like steak in the grass.  This is normally a sandwich in WNY but the take on it here is that it is served as a filet with melted mozzarella and spinach and mashed potatoes on the side.  It's very good.  The pastas and apps have always been halfway decent too.  My recommendation is too check the Buffalo Bills and Sabres schedule and stay away when they're playing.  The parking can be very tight, so use the light rail if that's an option (that is why it's called Tavern on the Tracks).  There are some train themes going on in there too.  When an order is ready, a whistle sounds, and they also have a drink called \"Wreck of the Ole' 97.\"  Tavern on the Tracks is definitely a decent place to hang out, have some drinks, and eat some decent bar food.   If you're a Buffalo transplant, have the wings here, but go to Lebowski's for beek on weck and haddock fish fry's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s4cki7AiOrOjb5r-ZpbJUw"
  },
  "6bpE_CYRvR4LnOnaRrgmrw": {
    "date": "10/9/2016",
    "text": "Just standing at the bar for the last ten minutes waiting to get my to-go order while the Bar tenders discuss how much their last customer tipped them. The irony...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hzKJmf6ZGHyzRk7YaCsRAg"
  },
  "7-fSO1GyvsSKVNzKeeMRhg": {
    "date": "4/11/2014",
    "text": "2 words: Toasted Ravioli. End of review. Just kidding. So this is a Buffalo NYers' spot. If you need a place to watch the Bills and what-not, here you go. For everyone else (myself included), I come here for a good ole pub/bar experience. Nothing fancy. Solid bar food. Doesn't totally break your bank.  Service... well, most likely I have had a few too many to drink by the time I leave here, so my memory is a little cloudy. From what I can remember, service is not the best, but it's acceptable.  The only thing is, parking in this area is a major pain. Be careful, you don't want it to be towed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M4yYtAXehUzaHB1ghl6EXg"
  },
  "GkuppSi1yVM0YSMXta-uCQ": {
    "date": "8/12/2013",
    "text": "Truthfully I've only been a few times now but have yet to be wowed so not my first destination choice. First time I hit up Tavern was last football season and I was beyond excited to get to the bar to join my friends and watch the Niners game (Go San Fran!). The place was decently busy and we order a round of drinks. The service is good, no complaints there, but I was a bit turned off when a server asked us to quiet down when someone in our group dropped a swear word... apparently there was families in the bar but my first thought was it's a sports bar... in the midst of football season... during a playoff game. Nonetheless, we stayed the rest of the game and watched the Niners dominate. Yeahhhhh  : )  I recently went over after work and posted up on the patio with a friend of mine for dinner. They were hosting trivia that night, which I love, and we opted to play but couldn't hear any of the questions on the patio...bummer... but we didn't want to move inside since the weather was so awesome so we sacrificed our scorecard. I picked out the steak in the grass sandwich, which is a filet topped with provolone. Quite tasty and pretty much exactly what I expected. Hey, it's pub food... but I'd order it again.   On another occasion I had the buffalo chicken sandwich... this thing was massive and the chicken breast was bigger than the bun itself. Highly impressed with the portion size and loved the crispy coating on the sandwich.   I'd most likely stop by again to grab a meal if I'm in South End debating where to go but I'll probably stick to watching my games at another bar.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "woT2AcKuonN5L1N8h1HGMA"
  },
  "0eR9DVb62OLwDVwzUfK2Tg": {
    "date": "12/3/2017",
    "text": "Came in tonight for dinner around 7:30 pm. Even after a Panthers away game there were maybe 7 people in the restaurant and a guy walked by the host booth where we stood and told us to seat ourselves. After 15 minutes we realized no one was going to acknowledge us so I went to the bar and told the bartender what had happened and she said \"WHAT?!who told you that? He didn't tell us he sat you\"  so I sat back down and she had someone come serve us shortly after. We ordered 2 appetizers and some entrees. 30 minutes later our entrees come out so I kindly told the waitress to please cancel our appetizers because obviously there is no need for them now. (Note she hadn't mentioned why they hadn't been out yet or what the wait was) and she said \"ummm I think the cook already made them\" and walks away. After that she never came back to give us refills on our waters, never asked if we had everything we needed or if the food was okay. Please invest in training your staff. I love your food but time after time I have came back in hopes of a good experience and you let me down over and over again. With ten people in the restaurant it's not that hard to provide a decent experience. We sat under the \"go blue boulevard\" sign on 12/3/17 at 7:30 pm",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gA0qnicqYAQaclM9AwWQBA"
  },
  "2G7Y4N8RoRummkNP_vKc1g": {
    "date": "12/19/2015",
    "text": "I love the atmosphere of this place, but over the past two years the food has really gone down hill. The steak salad used to be amazing, but now every time I order it the onion straws on top are cold and nasty. The fireball Pork Sandwich used to be awesome, tonight it was a pork chop, definitely not pork tenderloin. I used to come 2-3 times a week, now about once a month. Sad.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zFywv_U__nrtar1oEnJtpQ"
  },
  "faPjdaqp6pJcNFv0DPsnRA": {
    "date": "1/7/2014",
    "text": "Not sure why, but this was my first trip here since 2008. Sometimes it's hard to give ratings to a restaurant/bar when you really only want to rate your experience with one aspect. So, my 4 stars is simply for the bar, specifically on a Friday because of $3 drafts. They had a few good choices too. I'll be damned if I can remember exactly, but I know I had an OMB Dunkel and there were a few others that sounded like contenders for the next round (maybe a Dale's Pale Ale?). Don't expect a World of Beer selection of craft beers on draft, but enough to make it a reasonable spot to return if you're looking for a dive bar feel in Southend with a few good options on the cheap on a Friday.  It's more of a grabbing a drink with some friends rather than a taking your special lady out type of place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jm67TDhh8t1VHPACeORuOg"
  },
  "wkP5jEQ1ghKhX8aW8pk9AA": {
    "date": "11/28/2015",
    "text": "I really enjoyed finally going to this place!!  I have live in Charlotte for years and just have never gone.  We went with friends of ours to watch the Hurricanes/Sabres game!  I was so happy that they turned on the sound se we could here the game!!!  Most places don't since other things are going on!  My friends ordered the stuffed peppers!!  Yum!!  Then everyone had wings and I had the tenders.  I loved the Chipotle honey sauce I got on my chicken!!!  Very good!  And all the wings were tasty!!!  The service was also great!!  I hope to be going back soon for another game!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zGD1LkmZLX2FrVbj0iTtzA"
  },
  "t185fDVPgS5nH78-U0-fcg": {
    "date": "5/11/2014",
    "text": "Great bar food. Good menu. Love the wings. Great choir ce anytime.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w78OGZsl9x19Lt-U8MNhMA"
  },
  "nJWRVUbku3HcAmhQno02Hw": {
    "date": "8/15/2016",
    "text": "I visited this place for the first time. The service was amazing, the food was fantastic. Our only complaint is waiting over 10 minutes to get our beer. Our waiter was extremely apologetic and let us know the bartender was backed up due to a large party, however when I went to the restroom there were only a couple people sitting at the bar, so I didn't quite understand. I would gladly visit again however I hope this isn't a recurring issue with the bartenders. It's a shame, that's the only bad taste left in my mouth.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xh1nieUj_cugOyI5In2I8w"
  },
  "TOQR3cn6qRNi9gdymLcuLA": {
    "date": "9/21/2010",
    "text": "I recently went to Tavern on The Tracks for dinner....at a table not at the bar....so I had the chance to experience a real meal as opposed to their wings that I normally nosh on while sitting at the bar. Was I surprised! I thought this place was good for just bar food but they had an awesome appetizer selection (the hot peppers were terrific) along with steaks and pasta that was out of this world. I wasn't expecting much from their entree selection but was pleasantly surprised by the flavor on the steak along with the spicy cajun pasta they offered. I  This is the bar to go to if you're a Michigan or Bills fan ---get their early as it fills up (sometimes you don't even have room to stand comfortably)or if you're just looking to get you're drink on after work for some beers ($3 pints on Fridays). They have a spacious wrap around bar with good views of the tv's and a nice porch. Easily accessible from the Light Rail but sometimes parking can be a pain in the butt.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "l-tDF960t9BakjyH34XfTA"
  },
  "50NS1OHZmIgogBrd5KKcsQ": {
    "date": "8/10/2011",
    "text": "I've only been for a couple of drinks so far, so take my thoughts with a grain of salt.  Service was relatively quick and there was a decent beer special, but other than that I didn't really see anything that stood out about this place.  First of all, the door is basically jammed, me having an ankle injury that day, didn't make my first impression that great.  I literally came shoulder first through the door.  I sat with some friends and took a couple minutes for me to get a beer.  There were some tv's and some stuff to look at, but seemed like no real substance to the place.  With so many other places to drink in the area, I think the only time I'll be here is when taking a break from Amos'.  I'll give the food a try some time and update accordingly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wnFWoQ63F9-ohUQ-C0AeIw"
  },
  "jjyT8qam_CwYyGf4KCWekA": {
    "date": "2/7/2016",
    "text": "Recently ordered this... came with no shell, no guacamole and was much smaller with only 4 shrimp... not sure if they changed things or what but I was highly dissapointed, especially because I talked coworkers into getting it and everyone was let down...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LnEKl52m8S0bx5p1xx4-zg"
  },
  "6_ybNv7bRaqZYK7OvWzFvA": {
    "date": "3/23/2018",
    "text": "ZERO STARS.DO.NOT.GO.HERE.  I signed up for Yelp just to WARN others.  I've lived in Charlotte for years and have never had such a terrible experience anywhere.  By far the worst establishment in the city.  My car was towed and the tow company demanded $350 cash or $420 credit to get my car back.  If I didn't get it by midnight it was an extra $75 fee and additional fees per day after that.  The bar and towing company are in on it together.  They have someone in the parking lot watching you leave your car in order to tow you immediately.  I was not the only vehicle to be towed.  When the others arrived they were told $350 cash.  When we told them we paid less, the Towing manager became infuriated and told them it didn't matter and tried to block them from seeing our receipt by putting themselves between us and the others.  The Carolina's Towing company car lot is in a very unsafe part of town with sketchy people roaming around everywhere.  Our uber driver said he witnesses this at $400 a car DAILY and would not let my wife and her sister (who was planning on moving to CLT) out of his vehicle because it was NOT safe.  Tavern on the Tracks should be absolutely ASHAMED of themselves (manager Robert) and I have no idea how the City of Charlotte allows Carolina's Towing LLC to operate in this unethical manner by taking advantage of its tax paying citizens!  Shame on all of you.  I'm disgusted and will never be back to this establishment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ny8AjO6j4F2f2pgJ_8blBg"
  },
  "kIa0zI4pM1yAZVcm8yh1Kg": {
    "date": "4/25/2017",
    "text": "I enjoy stopping by this place because I live right down the street and they have some very good French fries. Food and drinks come out promptly and service is good as well. They also have trivia night, so come in with a group of friends and try and win some free drinks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ix07ynGboc1LReuRMOEj7w"
  },
  "Y59ffMO-M4XZt7WfvF8YMg": {
    "date": "8/3/2016",
    "text": "This place is awesome in Southend-- but, they need to fire the bar tender with long brown hair because she is so rude!!!!!! Barely poured us any wine, not nice and overall unpleasant talking with her!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOAZt4J39xKyh0WFHmGW0Q"
  },
  "kgbtlkm2eLneMjwVl-9-nQ": {
    "date": "12/22/2017",
    "text": "I had the meatball sub and it was delicious. They had my order ready to go as soon as I got there and were very fast and courteous. Will definitely eat here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RPZm5wDHPREgcKPrCWx_1Q"
  },
  "5wSmQn_1CMXz6l_0-97-LQ": {
    "date": "10/1/2016",
    "text": "Yeah.. so I just tried to place a to go order. I was told that because of the Michigan game they were not taking any orders. Ok. Now if you know about a game that's going to be popular please provide the appropriate staff to accommodate. Poor customer service folks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZIkieLfCyJEfMq2-Q53nKg"
  },
  "MxqxG1YBXe6mTCWyrBA00w": {
    "date": "9/13/2016",
    "text": "A buddy and I got here at 11am this past Sunday so we could watch the Buffalo Bills game with other fans. We easily got a seat at the bar in the back close to the restrooms. They had four bartenders working, which being a career bartender myself thought that was sufficient. All 4 of the bartenders seemed to be focused on the front of the bar closest to the patio. One girl stood between my buddy and I for a half hour before being seen. They took her order, but we sat there for another 10-15 minutes with empty beers. Finally the bartender asked my buddy what he wanted and he told him. I told the bartender that I would like a Blue light and put the drinks on my tab. He put my friends drink on my tab...but I sat for another 10 minutes before a different tender got me a beer. We both had 1 beer the entire second half of the game. It seems to me they were not prepared or organized to handle the crowd they had although it is the hotspot every Bills game.  This was the last time I will be at Tavern on the Tracks for a Buffalo Bills football game. I really like their food, and when their slow the service is ok and will definitely be back for a beef on wyke, but not for a game.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hWwzGBKWjA3fP0t8r5zATQ"
  },
  "Swd-lgwTriBsAXoIx67FMw": {
    "date": "11/18/2016",
    "text": "Definitely a solid Tavern in South End. Decent selection of beer, spirits and I appreciate the double sided food menu with plenty of options.  I opted in for the fish & chips...enjoyed the fries as they were definitely seasoned and the fish was a nice seasoned filet. My homie had the wings and you know what I appreciate about this place....the cook came out and asked him how he'd like the prepared (straight grilled or fried, etc). Those are the things I appreciate from a customer perspective and I admit the wings were damn good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XrgcHURVAe_wys_jdweKLw"
  },
  "n2gEdGBTh1VaK97PtYFBkA": {
    "date": "10/8/2015",
    "text": "This is a fun small bar along the light rail.  Kinda divvy but I think that is the look they are going for.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jDuI1ZfBxcL5iWEJOWK89w"
  },
  "ykZDE4VHQ8438xilhX3-ew": {
    "date": "11/28/2016",
    "text": "Popped in for drinks and appetizers. Nice establishment. Good menu options. Only warning is to double check the bartender on her beer knowledge. She said it's all up in her head but she was embarrassingly wrong.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T7C71zJiYoSDy6IzwMMIrQ"
  },
  "QCeoUptt3RpEuuGpbD1dtg": {
    "date": "3/28/2015",
    "text": "We stumbled upon this place when our original dinner plans had a long wait - and I'm happy we did! Even though it was Friday they had a great drink special of $3 drafts, including my favorite Red Oak. We started with the ravioli appetizer which came out promptly and was generously stuffed with mozzarella and lightly fried. I had the steak, medium well with asperagus and mac and cheese. Even though slightly cooked past the medium well I ordered the meat retained the desired tenderness and it was well seasoned. As a huge fan of asperagus I was happy to see several stalks cooked at the perfect point between crunchy and soft. The only disappointment in the meal was the mac and cheese which was a cross between pasta salad and mac and cheese, but I suppose I could be spoilt with the creamy twice baked traditional mac and cheese of the south. The meal for the price point ($14 for my 9 ounce steak and two sides) was excellent and we will definitely return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wbvjiDpw0FoZDeqbzAIcDQ"
  },
  "tpZuFB6Vj7-qFU50K-tO0A": {
    "date": "1/14/2015",
    "text": "One really can't go wrong with Tavern. Really feels like being in your local neighborhood bar. The food is always great. One of my favorite bars. You won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FjVJ1BJ2Y26vL41UdSxDKg"
  },
  "odUE627XTuu0HxdMY409Aw": {
    "date": "5/20/2015",
    "text": "This place is adequate. Happy hour is not very special. The servers don't smile. The food was OK. We ordered the stuffed banana peppers and loaded fries. The fries were just OK. The banana peppers were a novelty that wasn't worth the calories.   I have been eating my way through Charlotte in the past few weeks and i have found much better places. I say try it just don't expect too much.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "a3iAiWQo58P1-xd4S4cYmA"
  },
  "fxvSpA26l4DrnSdQIqtYWA": {
    "date": "9/14/2015",
    "text": "This was a perfect little spot! Service was excellent and the food was really really good. I had the pork quesadillas and they were out of this world! Have definitely made a note of it to come Back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V4aEZQ51JfJm4Dgonh6_uA"
  },
  "POsfIlfROTILASW3fpUi_A": {
    "date": "3/5/2016",
    "text": "Horrible experience! My friend and I came for a the Duke UNC game - we expected the place to be busy. We were shown to a table shortly and right after we sat down we were told the table was belong to another party. We were asked to wait at the door again and no one came to apologize or tried to find us another table besides saying there was nothing they could do. Two people came after us got a table while we were asked to wait. We ended up leaving the place without ordering. I mean, it's ok to be busy but the waiters and the manager were rude. Definitely not coming back",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JWp3eb_DTYhDuEFAptNKUw"
  },
  "fhYEixk4rdzD6hLczby1JA": {
    "date": "8/6/2016",
    "text": "It's been a long time since we have been to tavern on the tracks. From what I remember our experience was alright. They had decent food, we had the chicken quesadilla and wings and beer. They were tasting good, just the usual taste nothing special. Service was a bit slow, they just had one or two servers that night. It's got a nice ambience, they got some games and stuff too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F4Abg96un5mT019hdstmVA"
  },
  "wHT63VvKriJBeUAfkn0Ppw": {
    "date": "9/9/2016",
    "text": "Love watching the UM games here. Really fun place and fair priced beers! You have to get here early if you want to sit down and watch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BRHFt-Sdq3Xi_J0pZD3Zbg"
  },
  "Lx7wcNovBpv5BZC1DZxOHw": {
    "date": "4/14/2013",
    "text": "I love when you can find a bar that has awesome food and this is one of the better ones in Charlotte.   I always get the steak in the grass  sandwich, which is a 6 oz.  filet served open faced with sauteed spinach and provolone cheese that comes with your choice of side for only $9. They also have amazing fried raviolis. The meatloaf is also pretty good.   They always have great drink specials going on, even on the weekends.   The last time I was in was a Wed and they had BINGO. its been over 10 years since I have played and I cant lie, I had a blast!  They also have a patio which I will be enjoying in these up coming warmer months.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oHdCkOf9gHSMhvJd4JbVrA"
  },
  "sCb3vPNIvcQ791Pbslsdeg": {
    "date": "7/17/2016",
    "text": "Being from Buffalo, this is a great Buffalo restaurant . Bill stuff all over the place, a great owner, AND  buffalo wings, Beef on Weck, and Sahlens Hot Dogs ! Three of my favorite Buffalo foods right here in downtown Charlotte, I could not have been happier, we had a fantastic time",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EpyFHllmNiw7xk1f-rcMuQ"
  },
  "opQSf_5wXE74fmB0zXkjRg": {
    "date": "11/22/2014",
    "text": "I came in with a very large party close to closing time and the wait staff were very cool and awesome. Very impressed with that.  If the kitchen staff was pissed we did realized it because the food was amazing and very large portions. We all ended up share our food with each other because all of  our plates looked so good.  Will definitely go back again... at a reasonable time.  Also this is a Buffalo bar. So if you like the Bills and Sabers this is your place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "690lClPHEn8UaSy0S0HWPg"
  }
}