{
  "n6ZkuB07VguHUfdT6OGeAQ": {
    "date": "2/11/2009",
    "text": "I have had their calzones before and thought they were good but we decided to try the pizza tonight.. A large pizza with pep, sausage, onions, mushrooms was $18. The pizza was fair - lots of grease and the crust was too chewy for me!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Gwg_z6yzFxvH8KuoiMSSw"
  },
  "qmtlNvjbzTtuDEiq-fqoyg": {
    "date": "2/1/2012",
    "text": "WOW!!!  It does not get any better than this - we had a large party of 10 of all ages  celebrating my sons birthday and Hawthornes did a superior job with customer service, food and just plain friendly.  Caitlin was our server and she was awesome!  It felt like we had our own personnel server.  Wonderful service.  As I told her as we were leaving, we usually get take out because of our age children but no need to - we felt very comfortable there and were taken care of superbly!!!!!  Delicious food.  Thanks you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6VGSkPKZ6OENZNU3UleXKg"
  },
  "3Yuq3nV6LSXMblPgziGwmQ": {
    "date": "4/20/2011",
    "text": "Food is always great and beer is always cold.  Hats off to you guys and we love our server Kristen never have to ask for anything she knows our orders.  Kids love her and always wants to go up there to see her.  Keep up the good work and thank you kristen for always taking care of us!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3sZXdyJHgo2P8F8B82vEOw"
  },
  "09Ir0V41rd_TlcZGZeaxXA": {
    "date": "6/4/2013",
    "text": "We stopped in for a quick munch & a couple beers.  We were greeted by Megan at the bar & she made our experience FANTASTIC!!!!  Very friendly, knowledgable & took great pride in the establishment and her work.  The chili queso is delicious and a variety of good beers.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "9euBoJoMJcOc609IH1nOAg"
  },
  "0seplvy48s1D4pvL_J4cvw": {
    "date": "6/24/2014",
    "text": "Horrible horrible service! Waited 15 min for my soda. Not busy! I l left! No one bother to ask if I needed anything",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3yKYuv13K9OcElioIkFRQ"
  },
  "xi_1JLqBlQCRBOL0OrVdmg": {
    "date": "12/1/2013",
    "text": "Best pizza in Charlotte. Reminds me of New York, Boston style pizza. Nice huge slices. Took me 2 years to find a pizza place that deserves repeat business. I just wish they delivered. Staff is very down to earth.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZrzLUixUSApjgyH3-s6XFw"
  },
  "hiHnWREUPc1r6nGOhmvHdg": {
    "date": "6/15/2012",
    "text": "My wife and I have been to this Hawthorne's a few times, and though they've always been good, our first visit was noteworthy for being perfectly executed.  Excellent service: the waitstaff has a good knowledge of the menu and is able to answer questions and make recommendations when you're not sure about your selection. Consistently quick with bringing food to the table, clearing dishes, and taking drink orders. Great waitstaff are great for NOT being noteworthy, they just make the meal progress and everything happens at the right time, with very little fuss.  The pies are excellent, try the special-white (ricotta, pesto, sundried tomatoes), and the plate of meatballs as an appetizer. The food has been consistently better than most other pizza places in the area.  The beer selection is good, with a couple options on the list for beer-snobs, and not unreasonably priced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NaORI-qPPhej_Ce_sRH2Iw"
  },
  "s0r7Boc89kq1Zr83SNNcvA": {
    "date": "4/11/2013",
    "text": "Ive been here a few times to grab a quick bite and a few beers. Never disappointed! cant say ive had there pizza so ill review that at another time. love the chicken club! service is always good.  Saw a couple gentlemen next to me get wings and they looked delicious! Try the chilli cheese dip its good (the chips are thick not the cheap greasy thin crap)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jfy2usYXLrH8LAPyWgMXyA"
  },
  "5LWEWsvqFNDtPRPWYNSUCQ": {
    "date": "2/27/2014",
    "text": "Hawthorne's pizza was fairly decent, but *very* greasy (I think they used cheaper cheddar cheese mixed with the mozzarella).  Much more expensive than I'd expected!  Service was polite and timely, though.  I probably won't order from them again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9d0lbfpNXe38WV8W5FyKQ"
  },
  "wdy_DC6-puFhDS2XUf6nwA": {
    "date": "2/9/2014",
    "text": "Came here for lunch on a Saturday afternoon after hearing rave reviews. Nice space inside got a decent seat. Had a chicken and spinach calzone that was pretty good. Service was top notch here. Only thing negative I can say was that there were kids running all over the place, but it's all good. I was young once",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cSV0Hey39adDKpUg4uXiXw"
  },
  "f77rtUqCbxQT3klNO68xqg": {
    "date": "3/20/2013",
    "text": "Hawthorne's has several spots in the Queen City--but on my first visit to the Ballantyne location I was greeting with superb customer service, with the GM even sitting in my booth and asking if we were enjoying everything. I am a sucker for great customer service. Regarding the food, I sampled a few items from chili to sandwiches to pizza and everything was pretty good. Ironically one of my favorite dishes was a non pizza item..it was an italian sandwich. I think the patio is ripe for spring/summer nights and the bar (of which I indulged in a Tito's vodka lemonade) is great for game watching (if you're into that kind of thing) and tasty drinks.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "b99tjloA0KavKBW-BNe2lA"
  },
  "mIa1c5U7iiKxZ6ZSKBzsvg": {
    "date": "8/24/2013",
    "text": "We ate here last Saturday. It was a great time. The server was friendly, excited about his job and the restaurant. We ordered a large pepperoni and the sausage meatball onion mushroom pizza. It was great. Not the best pizza in town but good. The garlic knots was the winner at our table. They were huge and covered in garlic. Definitely the small order was plenty. The best part was Magic Barry. He is there ever Saturday night. At first we felt bad that we had no money to tip him but he graciously told us not to worry. That the restaurant pays him to be there every Saturday night. The kids loved him and he spent so much time doing magic tricks at our table. It was awesome. The girls can't wait to go back just for him... :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9Q9KdL89e2s5DN9ZeIs2A"
  },
  "qpQeNQgtlrkG2qViD8yrog": {
    "date": "12/29/2012",
    "text": "I've heard good things about this independent restaurant and was happily surprised with our visit today.  We were greeted by a smiling host and I noticed how clean of a restaurant it is even at 1pm on a Saturday.  Our waitress Lauren was very friendly and knowledgable to the menu.  Our \"Crew\" pizza was piping hot and full of flavor.  Service from start to finish spot on.  We were even told by multiple staff to enjoy our day upon exiting.  Overall a very enjoyable experience.  My only caveat is the parking; I never had liked the layout.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U96FpJ6l1IcM4h8iMwmHgA"
  },
  "L4PHO11UV7zbCPGLiXI7Jw": {
    "date": "8/26/2015",
    "text": "The best food real NY style !! Server Rahul and manager Anthony make you feel like family !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c76C3ae4q1DZTfF21ymHJg"
  },
  "iA99PANhmJHi-ASbhYBXAQ": {
    "date": "8/16/2015",
    "text": "Chicken Marsala is terrific.  ...Generous portion...even for take out.  The side serving is mashed potatoes....delicious...great comfort food selection....comes with broccoli so consider it healthy.  Wait staff very friendly and  courteous.  After only two visits,  greeted me by name.  Of course that's a nice touch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JW0vauu_3xT3ZRMOA0IbwQ"
  },
  "xzQMVGLY_0JRyXh-M7kPmw": {
    "date": "3/8/2015",
    "text": "We got take out tonight so I can't comment on the experience in the restaurant but the staff that handles the take out were very friendly and quick.  Got the Elizabeth pizza and it was great.  Great soft, doughy crust.  Just the way I like it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GDVBeur1T34c_KVr3tSe8Q"
  },
  "oLtjjqtM1xhGqcUpgPpaxw": {
    "date": "1/10/2011",
    "text": "Anytime you decide to open with 5-6 inches of snow on the ground... You're a winner in my book!! THanks for the delicious pizza!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-Ym165PtzE1EAdz9XSm2iw"
  },
  "0MAYqXCp741xPGN9_a5tOw": {
    "date": "5/6/2012",
    "text": "more of a thank you than a review. hawthorne's hosted my daughter's post-season soccer party and were outstanding in every way - the food was great as usual but the staff were outstanding. I can't imagine trying to wrangle 30+ people (most under the age of 7) flawlessly, but they made it look easy. my sincere thanks to the managers, Julia and Dana as well as to our server, Amanda... I'll continue to recommend hawthorne's to any and all that want a great neighborhood pizza place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ql-17MqVgeIywBlbVon_sQ"
  },
  "i5iAUU_uGk0_vwL1JepPnA": {
    "date": "10/16/2013",
    "text": "Not truly NY-style, but okay in a hurry and has ample parking.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0vxYuuiQBvZhApojPINzsQ"
  },
  "K9X5vKBglbPhknsRhQIZeg": {
    "date": "12/27/2012",
    "text": "Very good pizza.  Wait time was a little long, but staff was friendly to me and my 4 year old so it was fine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aTvRlCkHm3oLl0P7BxOgjw"
  },
  "U8A2DsccH-XjFM7Njbs8Og": {
    "date": "5/22/2013",
    "text": "From what I've seen, the Italian food seems to be pretty good but being on a diet, I order salads.  Do not waste your money on a salad here.  I got a simple side salad with shrimp.  The greens were partly brown, tomatoes were literally soggy and the six tiny shrimp still had the tails on them.  I wasted ten dollars on this 'meal.'  The service was good but again, third bad experience with salads.  I 've gone here because of the convenience but from now will run through a fast food chain before going back to Hawthorne's.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1XzE4jD5B_CThRtVPDLVxA"
  },
  "V80uOeYsZHLYNTKwM1m4Nw": {
    "date": "3/31/2010",
    "text": "Finally tried Hawthorne's last week after waiting a couple of years post-Mellow Mushroom.  Yawn -- really nondescript taste (though a couple of the topping combinations were quite interesting -- including pulled pork on their take on the Hawaiian pizza -- nicely done!).  No reason to pick this place when Brooklyn's is just over at Rea and Colony.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FyQrUamokaPLDrBxGmzPnA"
  },
  "hDOlzpDpKG4Ev3_IN14JVw": {
    "date": "4/20/2011",
    "text": "I am a regular at Hawthorne's based on consistantly great food and an an even better mix of \"friends\" who work there. I am recognized by name whenever I walk in and my \"friends\" put up with ME! I especially appreciated Mary on my visit there this evening. She went out of her way to take care of the customer (including getting me a warm towel to wipe my hands with after eating viscous but great wings). PLUS I think she really looks GREAT with her new hair did!!! LOL Seriously great place to visit and feel welcome!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Xe9zuNCRUzQ0d5Xq3FHEg"
  },
  "mKQgLKfrC0GNGHyQ0lICAw": {
    "date": "10/28/2015",
    "text": "Great pizza & family friendly place. My kids love the outdoor patio. Friendly service & the manager is very involved. Good stuff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fkvMee3_ocKKqMoP76YJhg"
  },
  "jLiyFadxwxlzAQEsWkOKqQ": {
    "date": "9/26/2015",
    "text": "Wow...we haven't been back in a while and let me say that this place has gone down hill.... First the manager rolled our sever under the bus when our app took so long to come out. That blew us away, why would you blame the server who works for tips and now her table thinks she screwed up. Well that for sure would affect her tips... Next a restaurant that does not have sweet tea in the south? What restaurant does not have sweet tea? I guess since the change in management is really affecting this location. I asked for garlic powder and they brought a salt shaker the was not even half full, turns out that was all the garlic powder they had in the whole restaurant!!! Wow that's poor management.They charge for specialty pizza and it is so thin that you can't get it off the pan they serve it on without it falling apart. I guess if they are going to survive they need to change there management staff and turn this place around. Not sure we will be back and those of you who do go be very cautious......  You have been warned....!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Pprmq_L57hGsHxG-_LUNbQ",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States. This is all they had in the whole restaurant",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Pprmq_L57hGsHxG-_LUNbQ/o.jpg"
      }
    ],
    "user_id": "Muu8wYuUOq1v1VtIFPt1Mw"
  },
  "oIHNdcnlTyhvBOMomuocCg": {
    "date": "3/5/2013",
    "text": "Hawthorne's has several locations and what is great is the taste and quality is very consistent across them all from what I have seen and tasted.  It was during the week and I happen to be in the area and was craving their penne Ala vodka. So I called in an order to go.  It was ready in just 15 mins. Came with two slices of  fresh hot Italian bread. Um mm heaven.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oHdCkOf9gHSMhvJd4JbVrA"
  },
  "FDeVv0kNu58PL8YUZ54RLg": {
    "date": "6/1/2013",
    "text": "I love the Ballantyne Hawthorne's and this store is on my way home from work, I thought I would give it a try.    This location, situated in a strip center at the corner of Quail Hollow and Carmel is easy enough to find, and get into and out of no matter which direction you'll go when leaving.  Parking was ample.  Arriving around 5:30 on a Friday evening, there were only a couple of other tables sat.  The staff, dressed all in black, was standing around in groups.  Both young men standing at the host stand had their backs to the door and I had to make myself known.  The restaurant is loud, just from the hum of business.  I then saw a gentleman with balloons strung around his waist making balloon creations.  You know what else carries balloons?  Clowns.  I hate clowns.  And while trying to enjoy my dinner, balloon squeaks and eventual pops was really not what I was looking forward to as a way to end my work week.  Tables that were sat after me got wait service before I did.  I was regretting my decision to not just head to the Ballantyne location.  Because of the lack of crumb snatchers in the restaurant, the balloon dude then made some for the stagnant wait staff. But the food would be great, right?  Yeah!  The food: Mozzarella sticks ($6.95):  6 small sticks served with marinara.  Thick coating on the sticks that tasted a little bland, but you don't want to overpower the cheese.  Marinara was tasty.  Not worth $7, but fine. 9\" white pizza ($9):  I love white pizza and it is usually really good or really bad - this was good.  It hit the table smoking hot, cut into 4 pieces on a small pizza pan with a pizza serving spatula.  The crust was thin and crispy.   Diet Coke to drink (yay Coke products) and it was kept full by my quiet waiter.    I was too full for dessert, but it looked like there were some good choices.  I watch Hawthorne's Facebook page and they do a lot of work with the community and with kids eating free on Tuesdays and a balloon guy, they are definitely family friendly.  LOTS of people came in and out with takeout orders, so it stayed steady for business.    The food was a 4, the overall experience was a 3 though - I'll continue to support Hawthorne's and their great pizza at the Ballantyne location.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eGSTTXOJkXpMjT-mQDefww",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States. Mozzarella sticks with marinara",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eGSTTXOJkXpMjT-mQDefww/o.jpg"
      },
      {
        "img_id": "V4QZMRl1GF00zGtGXcKJng",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States. White pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V4QZMRl1GF00zGtGXcKJng/o.jpg"
      }
    ],
    "user_id": "zsZBYWYEmLLs81_f-HHM8w"
  },
  "IJyrEguInu9Lpl47-XC4jA": {
    "date": "11/19/2015",
    "text": "Have been going to Hawthorne's ever since the first one opened in Elizabeth. The Adams' are great guys who run a great local business. This location is closer to our home now and have been here many times. Never a bad experience - one of our favorite pizza joints in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t3RUgootsj5d_BpcMtgnsA"
  },
  "UyQU8DSQm0_Zh-OzfCpcVA": {
    "date": "1/17/2013",
    "text": "I absolutely love this place.  Delicious food every time.  The Tuscan Salad is one of my favorite dishes, and get the pesto pizza with pepperoni on it.  YUM!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vKoECqqh4Q07gP_arEtMAw"
  },
  "0Q7X5tn_o0gkN6_6NRVVxQ": {
    "date": "9/1/2015",
    "text": "Just moved into the neighborhood and got the barbecue chicken pizza - it was just the right amount of sweet. Delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "APzVA8OnlWzn_Ji3FVGfHQ"
  },
  "IrneQpKKRO0v__QHs4r3lw": {
    "date": "1/15/2013",
    "text": "Since becoming pregnant all I can stomach on a regular basis is pizza and this place has been steady in the rotation. We almost always eat there and have always had good, friendly, efficient service.   Have tried several of the apps and they are very good. Typically get a salad and small pizza and it always seems to hit the spot. The only reason I am not giving 5 stars is b/c I was told they couldn't make a calzone without ricotta and that just seems strange to me and when this baby mom is not in the mood for ricotta- this simply will not do.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "v-MSmR4gObTkdKiW-lp96A"
  },
  "Grk0v-IFLxNc7c521rZMkw": {
    "date": "10/31/2012",
    "text": "Awesome garlic knots, meat ravioli and great staff. Love this place!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CKRfBUqQGaVCYTKN5kDrzw"
  },
  "p7VvKPqvvpcYtir-lmDluA": {
    "date": "4/17/2015",
    "text": "Does anybody in town make a thin crust pizza? The service was great, very attentive gal but I need to continue my quest to find a truly NY slice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d-xImQdoBuylR6KKCZxUOw"
  },
  "3fM9w08X-9OBwEfGB9wYxg": {
    "date": "3/5/2015",
    "text": "They forgot my ordered. And I had to wait another 30 minutes. They didn't say anything to me",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZSr8OSVHfrXXYoymAPM58w"
  },
  "dG5xXSLUoVKiILNTykuHtg": {
    "date": "4/1/2014",
    "text": "With all the other good pizza places nearby, I think I'll pass on Hawthorne's in the future.  The service was weird and we weren't overly impressed.  The anti-pasta salad was good for a starter.  I got a calzone for my meal and it was so flavorless.  I guess I should have added a topping or two to have some taste, but I am used to plain calzones being delicious.  It was a total waste of calories.  The people I went with got a specialty pizza that they weren't so thrilled about either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "K1osyO04_hXoDKyGqe_V2Q"
  },
  "a6jnF7uDXJNMR8crDAXRSA": {
    "date": "6/7/2012",
    "text": "I've been coming to this Hawthorne's location pretty much since they opened, and I don't think they've ever screwed up an order.  Pizza is delicious and if you haven't tried the Buffalo Wing Pizza, give it a whirl.  Meatballs for the calzones, or for a side dish, or even for a sandwich are also spot on.  They almost always have a new beer special on tap, so be sure to ask your waiter about that as well.  Definitely recommended, might be the best pizza in the queen city.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cM5nBvgS1Lmmto_dCfwY3Q"
  },
  "IB5Zw6sFHwz_wBW2AvB9rg": {
    "date": "2/10/2012",
    "text": "It would literally be impossible for a restaurant to screw up a to go order more often than this Hawthornes location. I live within walking distance, so my friends nad I order (or make that used to order) Hawthornes all the time.   I'm not kidding around when I say THEY SCREWED UP 5 OUT OF 5 OF MY LAST ORDERS!!!!!!  Perhaps it makes me an idiot for keep going back, but the staff is nice, so I tend to give them the benefit of the doubt, but that ship has sailed. Last order there was a piece of paper in my cannoli. Time before that I asked for the pasta sauce on the side, they left it out completely. Order before that they didn't give me ranch or blue cheese for my wings even though I said it on the phone, and then asked AGAIN  when I picked it up if it was in the bag. Time before that ordered a salad for my boss at work along with some other stuff and there was no dressing. (It's too far to drive back, so I had to go back out and get her fast food.)  The other day I was there they of course left something out, so I walked back. The manager knows they screw up my orders a lot, just because I'm constantly having to come back and complain something is wrong. So she offers me $10 off my next order.... She said to just come back and say the female manager told me to take $10 off my order. So I did, AND THE PERSON ON THE PHONE REFUSED TO GIVE ME THE DISCOUNT!   I don't care if this place was so close it was in the kitchen of my house, I'm never ever ever eating at this craphole again.    Seriously this place is the single worst restaurant I have ever been to in my entire life in regards to getting your order right. It is seriously mind blowing how bad they are. AVOID AVOID AVOID AVOID!!!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "O4hS3xBc6kt_1dpKqDOsLw"
  },
  "_G-1IhTSaB1DAArh9C4DYg": {
    "date": "11/7/2014",
    "text": "This is my go-to place when I want yummy take-out and don't feel like cooking. Right around the corner, not too expensive, ready in minutes, huge portions, and deeeelicious. We always get their Ney Yorker pizza with pepperoni and an order of garlic knots (which are addictive to say the least!). My other favs include the Buffalo Chicken Tenders Salad and the Sausage, Peppers, and Onions Pasta in a creamy tomato sauce.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ET3OjKglazr9KvhXCxuwdA"
  },
  "gocRxFgs7LYtT3gu9UYJXg": {
    "date": "3/4/2015",
    "text": "Good pizza and great for families! ! im pretty picky with pizza and will say when its hot and fresh out of the oven its good stuff. My favorite dish is the muscles appetizer....and the warm spinach salad too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tFHwm4HmSBGrkO4YEOV8Qg"
  },
  "Xg3ff9tlWuAyx1QKCflKWg": {
    "date": "9/28/2014",
    "text": "Really good pizza and wings. The pizza was def a hit! I do recommend this place and they have a full size arcade inside. Great place to bring the kids or to simply sit down and have done drinks. The service us friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cHt6QJzR8FXvuOxDaimV_A"
  },
  "DwasFMvcHjZcXWYhUEy_Eg": {
    "date": "5/25/2014",
    "text": "Pizza is amazing and their homemade balsamic dressing is the best in town! I like it for dipping my pizza crust as well on on a Tuscan salad.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Gy9q0nYxxTB-or0oMh7-ig"
  },
  "hX-xBAxgSopoG53uxVxn7A": {
    "date": "5/11/2014",
    "text": "Perfect ..... again.  Consistency counts and this place has it.  Love.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mcsAPnM42EjISfbEtR5frQ"
  },
  "bCmdY6Cf637CFu_qW364YQ": {
    "date": "4/30/2016",
    "text": "Good place and friendly service. Carter was great. Management and Carter checked in with everyone all the time. Wait was long because they drop a pizza and remade it. However coming and explaining it gave it a personal touch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "flUjZQkg93UWLxjzzQuC2A"
  },
  "LZRnmMsMyDc0uXgIwgiBzg": {
    "date": "7/15/2017",
    "text": "We just ate here this evening. We were promptly greeted & seated. We got the garlic knots, which is a MUST HAVE! Oh my heavens, talk about delicious!! My mom & I split the manicotti, which was the best manicotti we have ever had (and we are pasta lovers, with lots of experience). My fiance had a calzone which was also very yummy & fresh! My favorite part of this experience was overhearing Dave, the manager giving a newer hostess feedback on her performance. He was so pleasant, and let her know what a great job she was doing. It was SO nice to overhear that because you just don't hear that much anymore. We will definitely be back, and highly recommend this place! It's also very Family / kid friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "pjBPizmAw8UZEU6AgFSX8A"
  },
  "Qmi8vTcrC1ozRxowAH1x7A": {
    "date": "12/15/2018",
    "text": "Ordered a large Pepperoni Pizza to go, brought it home and there were about 2 1/2 pieces of Pepperoni on each slice. Not sure if this was the correct amount, but i feel ripped off. Pizza Hut gives you more on a slice. Sent a contact on the website and didn't hear back from them. We've been at this location many times, but this may be our last. there are many pizza places in Charlotte and i expected better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kg6mMQY-O-jXvz8CkxESYw"
  },
  "s6D9uwa59tC7IWhCnVsf-A": {
    "date": "5/26/2015",
    "text": "The worst steak and cheese I have ever had! I asked for it to be on a wrap rather than bread and it was, however there was no cheese on it at all. I unwrapped the entire thing to see if there was any at the bottom if the burnt steak and did not see any. I asked the waiter if there was cheese on it and he said, there is so little cheese you can't see it! What? He didn't offer to add more or anything although none existed. He brought my side salad in a togo box without me asking for it. I couldn't even see what was in the container the way he brought it out. The steak was burnt crumbles and just tasteless. HORRIBLE! They also did not have Dr. Pepper or Pibb.  Also there were lots of loud kids in there playing the crane machine at the door, which made me want to walk out as soon as I walked in.   As for the waiter, he would ask if we needed anything as he was walking by not bothering to stop. To sum my experience up bad service, terrible food, plain drink choices, and way too many kids. I would never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5rzBgtakV-K7YW3zLqCHGg",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States. Burnt steak from philly steak with non existent cheese..terrible",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5rzBgtakV-K7YW3zLqCHGg/o.jpg"
      }
    ],
    "user_id": "1T4L-307j6UuGLHObfJ5xg"
  },
  "Xhq1hwHyqu6dMpQm84MhPQ": {
    "date": "9/21/2017",
    "text": "Soooo was 36 weeks pregnant, had the inducer pizza at around 9pm just for fun and I started having contractions at midnight and had our baby girl the next day!!! Manager was amazing, telling us all the success stories and whatnot. Will be back for our next pregnancy. BTW pizza was amazing!!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5hPYTo1-CO8pNR1XDE6kbA"
  },
  "TeVXX8_4-DBip2PPRSGiHg": {
    "date": "7/16/2018",
    "text": "I have ate in the restaurant and gotten to go food a few times. Everything has been wonderful. I have ordered pizza, pasta, and even the Greek salad. It was all wonderful.  The serve is great and they are very kind. Overall great food, atmosphere, and drinks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qO-FenCNj-P3XpQi11Q3BQ"
  },
  "Ln5kAh-wQ7RMYmufqHQeVg": {
    "date": "9/5/2016",
    "text": "Good Pizza, good drink specials.  Pretty typical for a Pizza Place.  If you are looking for a good place to go with the family or some friends for Pizza you could definitely do worse than this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ixcfs1u6_Bqs3NehRbZppA"
  },
  "dTT5ah4TEukMOkG7IV-hSQ": {
    "date": "3/18/2017",
    "text": "First time at this location for lunch today. Not too busy. Selections on the menu were plenty. Prices fair. We were fortunate to have a lovey waitress (wish I remember her name) blond hair braces who took amazing care of us. She was on top of it. Drinks always full and real nice to our small baby. Will definitely return and highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SSf4DIq4a826Bl_kJASnoQ",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SSf4DIq4a826Bl_kJASnoQ/o.jpg"
      }
    ],
    "user_id": "spX1hYXpJzc9apJYaHiMJQ"
  },
  "FoMnMMbifJnmC9iW6uRKkQ": {
    "date": "2/27/2017",
    "text": "We've only had pizza and beer at Hawthorne's and I can say they were as good if not better than friends told us. Growing up in the north a pizza person tends compare any and all pizza to that. Or maybe I'm the only only who does so, that said we'll be back. Our service was attentive but not over bearing, server was extremely kind and friendly. Our pizza had just the right amount of sauce vs cheese, as well as toppings for those who do toppings. The best pizza is cheese only if left to me, therefore the sauce must be good. I honestly have nothing other than great things to say about Hawthorne's, I'm certain we will be back when on that side of town!! The best news ever.......I just realized there is a Hawthorne's very close by!! They offer several draft as well as bottle beer, the draft was ice cold, the best way to enjoy a great pizza!! Thanks Hawthorne's for having great pizza!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eFXTD5FIeAdzPngNPgZPjQ"
  },
  "X045rcyTTj03ELgn0PBhhQ": {
    "date": "4/30/2017",
    "text": "Pretty good, my husband got a huge pizza and delicious. I had a 10\" gluten free, the crust was a very thin almost cracker like. Not my preference but it was fresh and tasted good enough. No reaction from cross contamination which is always a huge plus!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RlyCk7CsaI6kIuvJ5PPSfg"
  },
  "cM6H9kZJJgGqbDZ2nSgDDg": {
    "date": "1/27/2018",
    "text": "Love this Hawthorne's! We live across the street and eat here often. We've tried pizza, calzones, pasta, sandwiches - all awesome! Love their new menu, and the service is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OIz-3rLtrg0lZ-OhyAoaxA"
  },
  "HFqOlIgVs9CClHwc9IlASQ": {
    "date": "7/10/2016",
    "text": "I've been here a couple of times, and I have no complaints about the service or food. Well, I take that back. Tonight we ordered garlic knots as an appetizer and there was so much garlic on them, I first thought they were a plate of biscuits and gravy. We didn't want to bother our server, so we just scraped it off, but I was surprised the kitchen even sent them out to us like that! Now, don't get me wrong, the knots themselves were great. The bread was wonderfully baked, just way, way, WAY too much garlic (even for garlic lovers like us). Our entrees, however, were perfect! Our waiter, a tall African American guy with glasses, was top notch! If you get him when you come here, you definitely won't he disappointed! I like this restaurant overall, just wish they'd chill on the garlic!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5iNLke-gO3V5Vop8A18MVQ",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States. WAY too much garlic on the garlic knots",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5iNLke-gO3V5Vop8A18MVQ/o.jpg"
      }
    ],
    "user_id": "lDg4dOR0wf3i7qSgbyzBzA"
  },
  "Gz7MVeW4MUGMog5fVBghhQ": {
    "date": "12/11/2017",
    "text": "I left a review 2 months ago & was asked to contact them via email. I still haven't received a response. Annoying considering the fact that I took time out of my day to write the email. Very unprofessional.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pl4lJjK30T9Fc-znMzJH0Q"
  },
  "0LPmUFpq_zx0Hsh-CCwtSw": {
    "date": "7/13/2016",
    "text": "Food is inconsistent.  Inside temp was way too hot for a summer day.  Cannot enjoy meal when I am sweating",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_RqlooYFO_tlwCM_JrY_4g"
  },
  "gg-epH6o1zerKroD57z7Vw": {
    "date": "5/13/2015",
    "text": "This location has gone, in my book, from five star best pizza in CLT only a few years ago, to three star pretty mediocre very quickly, I am sad to report. Why?  Pizza itself seems different; namely, the crust. Have they started using different ingredients in the crust?  Not sure, but it is starting to taste a bit off - you can taste that problem even more easily when you reheat the pizza. Noticed it for the first time perhaps a year ago.   Other issues?  Some staff at this location are very friendly; others look at groups with little kids (to wit, us) and seem to overtly groan- and then aren't that friendly to deal with. But, I guess if you're a waiter, kids are a pain: they can be noisy, make a mess, and don't usually spend a lot ok booze. However, since it seems to hold itself out as kid friendly, they could prepare their staff better for the possibility of families showing up.   And, in a town with some pricey pizza places (yes Wolfman, I am looking at you), Hawthorne's seems a little costly for what it is (regular NY pizza).   Still, we continue to eat here often and I hope they sort out whatever that issue is with the crust - it would start to creep back to four stars if they did!  And it would be great if they delivered.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LrW1IlMqL8G529jaqM6M-Q"
  },
  "OGWprPVxJPQ_cHOK8F0ddw": {
    "date": "1/16/2017",
    "text": "The pizza was ok. Good environment. Terrible service. Our waiter was awful. She was so mad especially after we gave her a 20% tip. She was just shook her head and said \"is that it\" like honestly. Wouldn't recommend this place all because of this annoying waiter and bad service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UMipHLIVcGiAZ_e0NxZOPA"
  },
  "aAym4qA0vB1MnMvThcmyZA": {
    "date": "9/2/2016",
    "text": "Pizzas are all good every time I've got them. Sicilian is especially good. Spaghetti is average. Lasagna has carrots and celery in it...Seriously, who does that? And tomato sauce in it is over salted. Ambiance of this joint leaves some to be desired. It's great if you just want some quality pizza.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tW8uaQ8zK1Jghiab2C_h0A"
  },
  "S0wfWdhPibzimbB4Kw4NJw": {
    "date": "11/19/2014",
    "text": "This is the real NY style pizza, we added ham and pineapple and it was just perfect, so delicious.  Very kid friendly.  The place was packed when we went and the wait was super short! Very fast service, very friendly servers.   We also had the mozzarella sticks, they were ok, we are sticking to the pizza, so perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RhhOcV7ShW1EiPldEW_VkA"
  },
  "Oaw1jDp-vMok9OS841EyOA": {
    "date": "8/31/2014",
    "text": "Hawthrones was exactly what I needed after a day at the US White Water Center! The drinks were cheap and delicious, the garlic knots were AMAZING and the pizza was so tasty. I would have liked the pizza to have a little less grease but that's a personal preference and I will absolutely be back again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NVMt7OojnXq0-n_8Xw_88A"
  },
  "xbFRA-YW8JGNoJi_XmsPxQ": {
    "date": "7/4/2017",
    "text": "Hawthorones has really good service. They let me juul in here which is a big bonus for me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZPxBs6AjOihB2tJv2pxyKg"
  },
  "KR-9q0jWYi8YcuM3saThfQ": {
    "date": "6/8/2016",
    "text": "Lunch slice and salad with blue cheese. Pizza was bbq chicken and my extra anchovies. Good thin crust pizza, but chicken must have run when anchovies were added. Salad was fresh and good. Blue cheese dressing is a 4 out of 10.  Gorgonzola pasta with chicken is delicious. Must try! Served with Penne pasta. I might have preferred thin spaghetti. Expensive. Waiter is faster than a speeding bullet taking the order. Give me someone my speed that knows the food. Price:$$",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hpi59AsZfCWuJscaoAGh3w"
  },
  "ZHw6FxzeQqz0ABLcklCW3g": {
    "date": "7/5/2019",
    "text": "This place was so yummy!!! We ordered the spinach and artichoke dip (wish we remembered to take a picture) and it was the best we have every had!!! You could taste each ingredient: spinach, artichoke, cheese. No added spices, cheese was perfect and didn't overpower it! The rest of the food we had was awesome too!! The manager was super nice too. Definitely come here and try it! I'm glad we did. We'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OaVKgtxWJjqShHAN2ZYSHg"
  },
  "jBMTXI6Gjxr1C__vR8sbtA": {
    "date": "7/31/2019",
    "text": "This was one of our regular lunch spots until today.  The lunch menu has increased significantly in price and unfortunately the service didn't measure up.   The salads went from $7.00 to $11 and the portion remained the same. My friend was told the special of the day wedge salad was $10.   The salad was not your typical wedge as the lettuce was shredded and she had to ask for the blue cheese crumbles.   When the check came her salad was $10.99.  She questioned the manager who proceeded to tell us yes the lunch special is 10.99.  Lol.  Unfortunately they lost a few lunch regulars which is too bad because the food is always consistent.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M1wkmJcsPAIF3Ja8h9Ik4Q"
  },
  "6WQU3dLct7s4EmsxRNLOIw": {
    "date": "7/28/2019",
    "text": "As a resident of Quail Hollow, there are not very many decent restaurant options between there and the Southpark mall/Fairview area. Hawthorne's is among the most disappointing of these. For years, nearby residents including myself have longed for a decent and quick place to grab good food at Old Town Village, as it's literally a walkable distance away, and yet Hawthorne's has consistently only provided overpriced, mediocre food. If you're looking for pizza, you're honestly just better going to the Brixx on Fairview. My sister did go here recently and had an experience that was slightly improved from that of the past, so I'll give her the benefit of the doubt and give Hawthorne's 2 stars instead of 1. Nevertheless, I highly discourage anyone looking for good food from going here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h1qJeffazQuVgE8YyWFvLw"
  },
  "CwKs3bVO3VjXmpGCC48bag": {
    "date": "6/26/2019",
    "text": "Hawthorne's is a great little place.  We went there on the spur of the moment, got a table on a busy Monday night.  This happened to be 3.50 drafts, which they had several choices to pick from.  We all ordered a beer and then some wings and an 18\" pizza... way to much food, but we don't have a problem with taking leftovers home.  Will definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2yw-Qe03UYWs2i3GeSsjjg",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2yw-Qe03UYWs2i3GeSsjjg/o.jpg"
      }
    ],
    "user_id": "9AboejL_57umuYXm3dyiqA"
  },
  "eghxQOHVen9f_eXoSPnb1A": {
    "date": "4/5/2018",
    "text": "Im not ordering a take out chicken Parm from your restaurant anymore!!!! The simplest little detail, don't smash the foil wrap into the sandwich so half the cheese comes off.  I'm done.  I like this place,  been here a few times--the good is always good.  My rub is take-out--love their Chicken Parm Sandwich, but only if you eat in house.  I'm going to stop ordering for take out.  Ordered the sandwich twice this week, the second order I got two sandwiches.  The first time this week, got home only to find all the cheese, which makes the sandwich, all stuck to the aluminum foil the sandwich was wrapped in.  This time when placing order, I asked if they could wrap the sandwich different so we don't lose all the cheese- they also use enough aluminum foil to wrap several sandwiches.  Need to rethink how they wrap their sandwich.  Needless to say, got home only to find the foil mashed into the sandwich, pulling all the cheese off.  Again, won't order takeout out anymore.    Good place, and the food is good, but not for takeout.  Have to say, received feedback from owner and very positive response correcting the issue.  Refreshing to k ow feedback is received and taken seriously.  Can't wait to go back for the chicken parm sandwich.  Well, have to say, it's refreshing to have a restaurant read and act on the feedback.  John reached out several times, and was sincere with receiving feedback.  Went for dinner the other night which is always good, and our server Brian was great.   Went back today for my favorite chicken parm sandwich, takeout, and the cheese was not stuck to the foil!!!  Great restaurant and it's clear they care.  Cheesecake continues--back to thr",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Hemk_Eum9UGejkfgicvAjw",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States. Cheese-gate continues!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hemk_Eum9UGejkfgicvAjw/o.jpg"
      },
      {
        "img_id": "2zs97OzRpFXKoJtMBphX_Q",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States. Now this is how to package the chicken parm!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2zs97OzRpFXKoJtMBphX_Q/o.jpg"
      },
      {
        "img_id": "yuHxgipzZXdt6whoq1TiIA",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yuHxgipzZXdt6whoq1TiIA/o.jpg"
      }
    ],
    "user_id": "SVndZxvQAnZ59AT9xLckRg"
  },
  "9WHxOWgU5LQB_fnv1T-eFA": {
    "date": "7/30/2019",
    "text": "Found a piece of a metal nail in my pizza. True story!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rzGQTsB-VM64NAGtwEfzCg"
  },
  "qMLdUjz0KXdmA4v5QFa0YA": {
    "date": "6/25/2019",
    "text": "Hands down the best Pizza in Charlotte!!! Not only do the make the best food they are so community oriented  by sponsoring local High Schools to help with athletics, PTA , appreciation nights etc. the atmosphere at Carmel road is family. They employee local students as well!!! This place is a must eat at!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GIw-Qn7AvIYFTbDVrERIXA"
  },
  "HoJ4DY7UU36-6M-pjJS_zw": {
    "date": "8/13/2018",
    "text": "This is an okay Hawthorne's location. I sure do miss the one over near Plaza Midwood. Used to go there more often and it just felt much more right. Hard to explain.  This isn't a bad stand-in though, especially since it's close to home. They've got a full bar with a good beer selection and lots of TVs on all the time. The food is exactly the quality and quantity you expect of Hawthorne's. The garlic knots are incredible. We always have to request extra marinara though. And oddly, the two containers of marinara tasted a bit different from each other. Not bad, just inconsistent.  We got pizza and salad and it all checked out. If compared to another local pizza place near here that shall not be named, we'd pick Hawthorne's every time. Price wise, the value for your money is great too. Get the garlic knots, I'm telling you, you won't be disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjYXOBnladFYhciGBSgAMw"
  },
  "dRty7AZaOTpCTdmw5aWy8A": {
    "date": "2/1/2019",
    "text": "Stopped in for a fundraiser. Ordered fried calamari. Yum!! Had a glass of red sangria which was a nice compliment to calamari. Friend of mine ordered garlic knots which were HUGE and delicious. Will definitely order those next time we come back. Casual atmosphere. Family friendly. Will definitely revisit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xqXlZbd4bdOB3OJD60zXlQ"
  },
  "cLbtrC1_yVcz_w312Kbv6g": {
    "date": "2/17/2019",
    "text": "We ordered the Pepperoni Sausage Sicilian 18\" pizza with an antipasto salad to go and were extremely underwhelmed. It tasted like a frozen pizza, but definitely not a good one. In fact we're going to Teeter now to get DiGiorno instead. What's worse is this pizza was recommended in a \"Best Pizza\" article from the Charlotte Agenda so now I don't know who to trust.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kOgKZ7Y2yA6h-7BzTX61OA",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States. Weirdest sausages ever",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kOgKZ7Y2yA6h-7BzTX61OA/o.jpg"
      }
    ],
    "user_id": "kdiutLZT-1LryNaSKf_0cg"
  },
  "jVm2UCeoWUh7pFvw2-56DA": {
    "date": "6/17/2018",
    "text": "Pretty delicious pizza! Our family goes here often and we can always find something everyone loves.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4IYfTxmI0sboz5KZHRHt0g"
  },
  "Ik0oVdvRCtzUyY3T35xZfQ": {
    "date": "12/23/2018",
    "text": "This was my first time trying this restaurant and I am really impressed. The customer service was great the food looked and tasted amazing. I had the shrimp po boy sandwich and I loved it. I would definitely recommend to friends! I look forward to trying the pizza in the future:)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZg6TDzSQKXwLtuufSuJnw"
  },
  "dEaGNLewKrvMaPq0BdnTng": {
    "date": "2/2/2019",
    "text": "Looking for prompt/great customer service, look elsewhere. Young servers who don't really pay attention to customers. I sat down and waited 8 mins and no one came to take our drink/meal order. I walked up to the host that set us in the booth and told him we haven't been helped and he said he forgot he sat us down? It was 4:15 pm and only about 4 other parties in the restaurant.  Host had apple air pods in and was eating when I approached the counter to remind him we were waiting. My actual waiter seemed polite enough and got the order correct, but no apology for neglecting us as he chatted with other servers while we waited to been served. I would not return when this team was working the floor. Thanks, but no thanks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xvO6CneawbyNu5F7W5MicQ"
  },
  "D5XJU6wc3DLBUdL9mNcUvw": {
    "date": "10/3/2018",
    "text": "Short staffed but you'd never know it!! Justin and the bartender are awesome!!! Food prepared pretty quickly and super yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6--ly1T7vzmrozv4Vv8Tgw"
  },
  "eV9dzRgrRbY_QyANoNeeBA": {
    "date": "8/5/2018",
    "text": "Friendly welcome from a very happy and attentive staff. Nice selection of beer. I only sat at the bar but the onion rings were good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQFG40gBfnlSd6qhdK9_Iw"
  },
  "09t98g5GkMyMoLxgHop8-A": {
    "date": "8/2/2018",
    "text": "I'm in this jawn right now smacking on this scrumptious scromboli... aye fam.. this place is I'll chill. I enjoyed the food and the drink the cheese be soooo melty..!if you round the way, pull up on them !!! The food bussin!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K18IBHgFw-SIxoVa-newYQ"
  },
  "sxny--F_mKOiJBLfXAQHYQ": {
    "date": "9/27/2018",
    "text": "Local bar-  friendly staff good  atmosphere. Food is a little pricey but never had a bad meal.. definitely recommend if you want drink and a causal night out",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvB-mkQR_dGQslHUG9lG-A"
  },
  "w4jewW3cCeymkDkoKZIXOA": {
    "date": "3/1/2018",
    "text": "Ordered here twice.   First time I ordered a pizza since I heard people rave about the pizza and have being brought up in NY for 20 years, decided to give it a try. Unfortunately I used the postmates service to deliver my pizza, was not so good, AT ALL. Was highly disappointed. Will try again, though.   I ordered the fried cheesecake and the plate of cannolis tonight and the fried cheese cake is to DIE FOR! Cannolis are DEF worth a try as well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bm6rNuMl8vF8t2Y0PKu2lA"
  },
  "voy_fJfxZyYYNm77H0QaEQ": {
    "date": "10/24/2015",
    "text": "I frequently drive past the Hawthorne's location in Elizabeth, telling myself that one day I would stop in to give them a try. One evening after work a friend and I was in the mood for some Italian dishes. We were in South Charlotte, making this location an easy choice. We were greeted and seated quickly, with most of the other tables families with young children.   Normally I would have tried their pizza, but I was in the mood for pasta that evening. The service was very friendly and accommodating. The calamari appetizer was great. I wasn't as impressed with the bread that was given with our pasta, but that's a slight issue. Some people don't mind firm, heavily toasted bread but it's not my preference. The spaghetti and Alfredo were both delicious.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jckG7_4fWbyXyfQZ1yi2QQ",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States. Fried Calamari",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jckG7_4fWbyXyfQZ1yi2QQ/o.jpg"
      },
      {
        "img_id": "eH-jgBAwUElEeqfhcFLhEA",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eH-jgBAwUElEeqfhcFLhEA/o.jpg"
      },
      {
        "img_id": "VyExkDRldvdxE9HMf30Hsw",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VyExkDRldvdxE9HMf30Hsw/o.jpg"
      }
    ],
    "user_id": "7U3H1iJZ04FbadJtt2Npjg"
  },
  "GRS26ixH-nU9eHBr_Xt_9A": {
    "date": "7/26/2018",
    "text": "Great customer service clean environment.  I was greeted as soon as I walked in the door. Kid friendly and plenty of staff. I love eating here with my family! Great place for a date or a family environment! Staff is on it ! Thank you Hawthornes at Carmel!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W-57oFA4Sz0g7cUpQWm3OA",
        "caption": "Photo of Hawthorne's NY Pizza &amp; Bar - Charlotte, NC, United States. Awesome customer service! Clean environment! Great establishment!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W-57oFA4Sz0g7cUpQWm3OA/o.jpg"
      }
    ],
    "user_id": "UrhAbXBj3fiWbJiAWMohRw"
  }
}