{
  "XWvJlxOLXUQ04Ypmy4mU6g": {
    "date": "2/21/2015",
    "text": "I went late on a Saturday night and they were out of two items that added heat and flavor to the burrito (the corn salsa and the spicy salsa). These are two things that I look forward to adding to my burrito every time. I was upset; however the 3 employees were extremely helpful and nice.  The guy in the kitchen made hot salsa while I waited and was able to get hot salsa.  The other 2 ladies were apologetic and provided superior customer service while I waited.  I walked in happy, got upset and walked out happy (not easy to do in a 10 minute visit)...The place is neat and clean and there ingredients are always fresh... I have been  multiple times and this was the first time they were out of something I put on my burrito!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HW3eDXM-lFL22QC_xHFvsA"
  },
  "UyEg3PGSdafPB-5zVdDucA": {
    "date": "1/28/2016",
    "text": "I love Chipotle but this one was not up to the usual standards. I got a steak burrito and it had an unusual amount of rice in it. Everything in it was average and a little salty. I tried the chips and guacamole as well. The guacamole was really good but the chips overpowered everything with salt. Definitely not a Chipotle to return to.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IaL-c8HCfVq3y8U_D7NQLQ"
  },
  "RHSpdsty9Sp1uwnBDSR_IA": {
    "date": "7/4/2015",
    "text": "This One does not live up to others!  The tables are dirty, long wait, A/C unit dripping on the floor from overhead, creating water on the floor, chips were stake and the sweet tea was never refilled!  Not going back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mHDv-Lz1GQrbcdSUPpF29Q"
  },
  "AHpgNT3HJrT-BUMlAKwNiA": {
    "date": "7/21/2011",
    "text": "When I moved to Charlotte from Ohio four years ago I PRAYED for the day they'd open a Chipotle down here! It pains me to admit it, but before there were any in Charlotte I did drive to the one by Hanes Mall in Greensboro to get my fix. Yikes, I know, right?  Aside from the food being great (uhh, obviously if I'm willing to drive 2 hours for it!) everyone at this location is super friendly. I had only been in there two or three times for lunch when the staff recognized me as a familiar face. They're very accommodating, and in stark contrast to the employees at several other 'quick' restaurants, they seem genuinely happy to be making you great food, and to be working together.  I've since turned several friends and co-workers on to this location as it's convenient and quick for many of us during the work week lunch hour.   As with any Chipotle location, if you need to get in and out quickly you can call or fax your order in so it's ready when you arrive. Or if you're feeling *really* fancy you can order AND PAY using their online order tool or their iPhone app and just grab your food and run! At first I worried about the accuracy of this method, but not once have they messed up my order or had me wait for it when I got there.   **My favorite from this restaurant: Steak burrito with black beans, corn salsa, sour cream and cheese with a  side of chips and guacamole THEIR GUACAMOLE IS ABSOLUTELY DELICIOUS! (but does cost $1.80 extra on your burrito...but is so worth it!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8SGFiwAK3Yh68vfPhbT9qw"
  },
  "d8YlhnjbWa6Xv6Ejg9h-VA": {
    "date": "12/27/2016",
    "text": "If you like cold food, terrible service, a disgustingly dirty restaurant and ridiculously long waits than this is the place for you! Came in to to eat today around 3pm. Was told there was a 5 minute wait for white rice. No biggie, I'm a server myself I understand these issues. So after waiting 10 minutes for the damn rice, they don't have any cheese and take their sweet ass time getting more of that made as well. In the meantime the line is getting longer and longer. After the staff wants to give us an attitude (like its my fault they suck) I can't even find a damn table to sit at because every single one is dirty. Floor looks like it hasn't been swept in over a week. Best part to top it all off? I bite into a chip that's so stale it barely crunches. Last time I ever waste my money at this location. From now on I will drive the extra 15 minutes to go to stonecrest because their store makes this one look like a joke.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ep-EclzqZScvoj7pW9Pu0g"
  },
  "wuomchlEcqtb6hNn9--X3g": {
    "date": "12/23/2015",
    "text": "I visited this Chipotle for the first and last time. I was astounded at all of the food on the floor in the kitchen in plain view of the patrons.  The impression left with me was that Chipotle is sloppy and careless in how they prepare food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qzsuqz2GYiM2p5zaOcNFUw"
  },
  "NasDOM__9WCukChr8HNtFg": {
    "date": "9/17/2013",
    "text": "Based on other burrito places in the area, Chipotle on Pineville-Matthews Road was okay.  The burrito I ordered (pork) and drink was a bit higher in price compared to other burrito places.  All drinks are coke products, no issue there.  The burrito itself was good, though it had a lot more rice than other products in it.  The facility is next to a Japanese steakhouse and has limited parking as a result.  Limited seating, with one spot constantly being dripped upon by the A/C above.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBs9C8XnE8Py8yji7EF3nQ"
  },
  "vrOXyU2I8E8SpW_nzelgsA": {
    "date": "10/14/2012",
    "text": "Nothing bad to say. If you love Chipotle you will just be happy eating here. It's a nice location and the food is always good. I started eating Chipotle when they opened in Colorado before they were a chain. This location is on par with the original. Go eat and enjoy a burrito the size of your head!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ENEuYgsrbvnXzxh6WUhQ_g"
  },
  "SXTAyLR8N_gwhiRYQ0oGDA": {
    "date": "11/17/2010",
    "text": "I'm so excited about the opening of this new location!!!! its only a couple of miles from my house and so far it has not been packed when I go in. (that is until word gets out about it. lol) The staff is friendly and generous with the portions, they have not skimped me once. The whole place is nice and clean plus the condiments ,and utensils were filled.  Being that its brand new I had to check out the bathroom which was clean. lol (yes i have an OCD issue with bathrooms being dirty. check previous reviews. lolol) But like I've said before when the bathroom is clean that typically means the staff is clean.  I LOVE CHIPOTLE:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GIkEueeahJdLXziC4yqbUw"
  },
  "JppYCfnaZPnYoxWEqi06pg": {
    "date": "8/13/2014",
    "text": "Disappointed. Not the usual Chipotle experience. Food did not taste fresh. Place was not clean. On the plus side, it wasn't crowded.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "N86x1_H8-1XKG2BtkdB6Xg"
  },
  "ElTSEn-5qVsB8KUJJWjBdQ": {
    "date": "3/21/2012",
    "text": "Chipotle has the best burritos in town!  Seriously, much better than Qdoba's, Moe's, Salsarita's, et al (I don't include Phat Burrito in this, that's a whole separate category).  Offer great portions and I highly recommend the steak burrito.  Just remember to use some Chipotlaway once you're finished!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ghvFYbQJxT_tu_fwsyjKjg"
  },
  "g_xKINzVNT6ERljqENRFlQ": {
    "date": "12/21/2010",
    "text": "I'm not a huge fan of Mexican food, but if anyone I know ever tells me they're in the mood for Mexican, this would probably be where we'd end up.  I ordered a bowl with the lime rice, pinto beans, chicken, sour cream, etc.  It was absolutely delicious!  I have a fairly common gene that makes cilantro taste something like awful soap, so I was disappointed to find that they did not offer rice without cilantro.  I picked out the larger pieces of cilantro and the bitter flavor of the smaller pieces were overpowered by the immense flavor of the other ingredients.  Overall, I loved my lunch at Chipotle and WILL be returning for seconds!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3yDvgbqy8j9WfyFnkOxuQQ"
  },
  "x3cJqBALiMn7QExm-Gb7Yg": {
    "date": "4/29/2014",
    "text": "Good value for fresh food fast and cheap however poor customer service is why I will only give this restaurant 2 stars. Line staff was extremely rude and rushed order. I eat at other locations and knew exactly what I wanted and I still felt rushed!!! Also staff tried to give me a dime size portion of meat on a taco order. When I asked for a more adequate serving I received a serving of attitude instead!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3jQuJcuCuuvGvSUpyeRpFg"
  },
  "wnm9HcGue9ya_16NTFpcHQ": {
    "date": "2/20/2015",
    "text": "Love love love, Chipotle... Did I mention that I love Chipotle? I would have given it a 5 star rating but the employees there have a hard time deviating from the normal. If you ask for something like extra items or leave off ingredients, they have a difficult time and really slows down the line. The line staff here sometimes have an attitude that is not normally seen at usual other locations. Just my personal opinion but I think it's just poor management. There is a particular manager there who seems overwhelmed and not on point. Several times they are short of items on the beverage line, ie lids, forks and such. I asked why one day and they told me that they forgot to order. Come on people, really?  I don't want to use a bathroom hand towel for a napkin. Just a personal preference. But the food is consistently good like other locations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WmcwosiEffNjzp2vA2XCHA"
  },
  "LkUjPgSkIgixLkrQ1B4dMA": {
    "date": "1/28/2013",
    "text": "As a strict vegetarian, normally if a place serves me a vegetarian meal with a hidden piece of beef in it I cut the place off forever. But chipotle is so good even I had to come back again. 5 stars for food deliciousness. 1 star for not avoiding cross contamination.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "45r0gDQRtGWEHnaVb4Iy4A"
  },
  "3WWJZwpS10CrsPyf4Ry-Gg": {
    "date": "3/9/2012",
    "text": "Taco Salad rocks!!! Great food and freindly folks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uB1yje63LhAZNBQW4WX--w"
  },
  "sZcJHjmHiEFodJskNuRGhw": {
    "date": "1/27/2011",
    "text": "Glad Chipotle has finally come to Charlotte.  If you want fast, very fresh mexican food this is the place to visit.  They have burritos, salads, burrito bowls, and tacos-all very good  Have been eating at Chipotles around the country and they are consistently great.  The thing that sets them apart is they are very clean, well staffed, and prepare all the food and meat fresh daily.   I dare you to take a close look behind the counter (and in the bathrooms) at some of the other chains like Qdoba and Mesquite, etc.  I have, and I will not return.   I suggest you hit Chipotle now before everyone else in Charlotte finds out about it , this location already has challenging parking.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8LNPN1SFOt0p1HuKp5tDSA"
  },
  "_x7EHkMhPBifzjwY84Y0Cg": {
    "date": "4/18/2017",
    "text": "Their service and food quality have been going downhill, and today's visit marked the worse experience.  I need to go to another store from now on.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8R7fxXZFMmE7VVwJktA8AA"
  },
  "esUVOXuUHO2TnavVZ689WQ": {
    "date": "11/18/2016",
    "text": "Terrible food. Terrible service. I can go to 7 eleven and get 3 12 packs of soda for the same price as one burrito.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H_pRIVSQnRAK5nQ3W3Q12w"
  },
  "V2590id-FfDvIiblNOIAEQ": {
    "date": "12/2/2014",
    "text": "Useless people.. don't know where to complain now.  They are treating me all the time like crap. It is a guy all the time working there in dinner time. I hate the way he treat me always. Is it because I am foreigner?  I already complained to chipotle and a nice customer service guy ensure me that they will take care of this store . But I guess this specific chipotle people not going to change at all.   first they don't smile , it's okay if they don't want to but they don't give me food what I paid for. I am tiered of giving a chance. And I don't have any other  chipotle near to me now so done eating chipotle. I wish I could complain for this humiliation.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hliNkN7PIPekLq2FqJPYqg"
  },
  "UdYNdhsFFapidjOqN6x5_w": {
    "date": "6/14/2015",
    "text": "The place is disgusting. To the point I threw my food in the trash and left. There where maybe 8 costumers the most at the moment (not busy) and there was food all over the floor and tables(looked like a foodfight just happened) and there where only two forks left.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2YRrz667RN42v_0HqXBx5g",
        "caption": "Photo of Chipotle Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2YRrz667RN42v_0HqXBx5g/o.jpg"
      },
      {
        "img_id": "7fFwN5P01tepZXFtAyE9lA",
        "caption": "Photo of Chipotle Mexican Grill - Charlotte, NC, United States. Someone &amp;#34;swept&amp;#34; but forgot to pick it up",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7fFwN5P01tepZXFtAyE9lA/o.jpg"
      },
      {
        "img_id": "j8iumzuHcp_Cin-e5X5jTw",
        "caption": "Photo of Chipotle Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j8iumzuHcp_Cin-e5X5jTw/o.jpg"
      }
    ],
    "user_id": "8gjzc2Dy9ZM9JjAmUSlk4g"
  },
  "IiTjXUbGZ1yq_M_7s7eftw": {
    "date": "10/29/2013",
    "text": "As a frequent Chipotle customer I was completely blown away by this location. The staff was very friendly and courteous. The steak burrito bowl that was made for me was outstanding. The steak was cooked perfectly and this location definitely did not skimp on the steak. I received two scoops and couldn't have been more happy.  The guac was excellent as usual. Thought I received a few less chips than I am used to but the extra steak more than made up for it. Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jp7Jcw8EGqkBC3t8dek-tQ"
  },
  "ODJ2x8ynI-hH2x_-zYEmjA": {
    "date": "6/22/2012",
    "text": "As an avid Chipotle-goer, I'm rather fond of this location. The locale is perfect to stop by for a quick lunch or dinner on the way home. All of the Chipotle oldies and goldies are here. Massive burritos and perky salsas.   The manager of this location is stellar. She is so kind and always loves to chit chat. Very ship shape shop. No complaints! The outdoor patio is very cozy and quaint.   The only gripe with this location is the entrance/exit. Good luck getting back onto 51 if traffic is heavy. Near impossible to make a quick turn and head towards 485/Park Rd. Also, if traffic is moving, you'll most likely never be able to make a left turn onto 51 without a never ending line of cars waiting and honking behind you. Beware! It's a tough one!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "AG4vp4zf8Q6SSsAzsZ_crQ": {
    "date": "8/31/2014",
    "text": "I think I like Salsarita's better. Chipotle is definitely better than Moe's. The service was not stellar. No smiles at all. It was my first time in a Chipotle & the assembly line mentality left a bad taste (figuratively). Not heading back anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xCcLViSSdXZJv0O3hk_gqw"
  },
  "uYqEHjDqEOMJvwz0vBLsQw": {
    "date": "6/10/2015",
    "text": "The filthiest chipotle I've ever been to. Dirty tables stay dirty until you bring it to their attention. Took 15 mins to go through a line with only three people in it , just to get a bowl meal. Managers excuse  was some imaginary online order no one was working on in a meantime. A few more people in line were not happy about the wait time. And no apology when a customer complains.  Going to void this location!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ox_yqwM3Pd8-SbQDVxgbg"
  },
  "COSayBT4IpSzb2MS-xoCmA": {
    "date": "4/13/2015",
    "text": "The workers there were great, and Chipotle always tastes good..... BUT my biggest pet peeve is when a Chipotle doesn't give good portion sizes and they definitely need a lesson!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GCGqq0y3ePoN_9vsjOxKHg"
  },
  "FNN6dyJJIWQjUhOv16egRg": {
    "date": "8/9/2014",
    "text": "My sister and I LOVE Chipotle. She comes to this location a lot. I go to many locations and have never had such a bad experience. We counted 15 people working...15!!  There was ONE employee who came to the counter and took our order. Everyone else appeared to be doing 'something' or just chatting it up laughing and trying not to make eye contact with all the customers waiting. The line grew longer and no one else came to help her out. Needless to say...if there was an option to give negative stars this would be one of those occasions.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EeFXN9rXgj9LeEkwhEMooA"
  },
  "bUJB8W8aPbL-2mmUIzu84Q": {
    "date": "11/19/2010",
    "text": "YES, Chipotle within a mile from work. New go to place for lunch? I think so.   New location, clean space, friendly food servers, yummy food. This location's food is consistent with other locations, meaning the food is delicious. Lunch lines aren't long yet, yay!  Only gripe about this particular location is the parking. The parking lines are drawn very inconsistently, with a couple super narrow spaces that make no sense. And trying to turn left out of that plaza, can take a long time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "53QaFbmZojYK0vv3RQagcw"
  },
  "E7NxIIKDIEMJuPkyamHR_g": {
    "date": "7/3/2015",
    "text": "Worst chipotle experience I've had. Waited forever in a not so long line. Asked for medium salsa and they put hot on it. Sweet tea was out when I got my drink cup and I asked them to refill it and it never got refilled while I was there. Chips were stale. A/C unit was leaking and dripped on me. Very dissatisfied with this chipotle. It is one of my favorite restaurants and this one let me down big time...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lVGlLhopvhl2KZUB7BxVyQ"
  },
  "cpp6-XU88Y-pGdudcMTMQw": {
    "date": "2/14/2015",
    "text": "Long story short - food - great - staff - not great at all. I will definitely not be back to this location as long as some of the unfriendly, rude, crappy staff is still there. I'll change my review if things change but, until then - if you care about good customer service - avoid this location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UJdV27tvroF63sIKvaKmTQ"
  },
  "FDPi7PFjLmS-NLpsZZN4oA": {
    "date": "6/8/2015",
    "text": "Not sure if Chipotle has gone down the tubes or if it is just this location. The people were nice but the food was terrible. Not the typical taste. They gave you very minimal portions and it didn't taste fresh. I was really sad about that because I lover Chipotle. So Moes has been my go to until I feel like trying Chipotle again",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dSPEP179zmruzjmQGhLAng"
  },
  "WpywY-LPercnDT7GvYB8tA": {
    "date": "1/4/2015",
    "text": "The food was okay, although lower in temperature than it should've been. The problem was the service. I ordered a veggie burrito and the employee didnt even put veggies on it until I asked, twice. (Yes they are supposed to come with it.) There was one girl on the line and she made our two meals along with the three people's orders behind us, so my food stood there for a very long time before she came back to it. I had paid and was looking at my completed meal (it was to go so all someone needed to do was cover it up) for quite some time as she put beans on other people's food. The workers were slow and they were maybe understaffed. I would not go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iywUEYp4fLsR-GEzTqQs8A"
  },
  "xKbwqhX5T5emBGMrBLhPeg": {
    "date": "5/6/2015",
    "text": "Hey its Cinco de Mayo thought I Would try a Chipolte .... never been....this location was disgusting....tables weren't wiped clean, floors dirty to where your shoes stuck to them,  There was a huge container of sour cream obviously dropped floor spill 5 feet long and not cleaned up had to step around....  I should have paid attention to the low rating on inspection....the work space where food was was filthy...workers spent more time telling each other what to do than helping customers......  Fresh I dont think so.....I will never go back to this location.....where the heck is the manager to allow this to go on.................  Chipotle as a franchise should inspect this store as they are representing their brand......What a horrible experience in uncleanliness.....yikes.....don't bother going here....find another !!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4CPpYOo1NNgFigfdcXvKFg"
  },
  "xXrIFcf9Ft-rW-nnbV2HVg": {
    "date": "4/3/2014",
    "text": "The service here was so poor! The staff was so rude, slopping the toppings in the bowl, never making eye contact! If the guacamole wasn't so delicious I would never go back. I will avoid this location when possible.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RJq3r6nkrgbZhhPrp4tjLg"
  },
  "00v95i5LR0jx7zxFLlZUOQ": {
    "date": "9/12/2014",
    "text": "The people at this Chipotle are SO nice!! The food is awesome as usual and they are very generous with their servings. Love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aa42o1FPRUw9LKCmqh0L8g"
  },
  "HO5c3cn_XIB1CGslsptBAQ": {
    "date": "10/11/2014",
    "text": "We love eating at Chipolte, but this location was the worst experience I have ever had at one of their restaurants.  They were out of chips (no chips at a Mexican restaurant?!) They were out of lettuce. Black beans were crunchy (must have just come out of the can). Bathrooms were gross. Tables had not been wiped down and cleaned. This was on a Saturday night at 8 pm, so it was inexcusable to not have the basic food items available.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pB8WjKyYc1fJEdgvAeXbxA"
  },
  "jMHCpQ5SjPYgCZJvj9w2ow": {
    "date": "4/23/2013",
    "text": "This is by far the nicest Chipotle I've been in. Very clean, very modern-looking, friendly service. Everything was fresh, and prepared well. SO excited to have found this location!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AbSs-tdETsOubnWh65DHkA"
  },
  "oGmTB81xHGhy4b3hghVtUQ": {
    "date": "8/20/2012",
    "text": "What is not to love about Chipotle!  Awesome fresh ingredients, plenty of choices fresh delicious guacamole!  What I love most about this place is that even though the menu is not extensive you know every time you go you will get the freshest products made the way you want it!  Today I decided to get a chicken bowl...skipped the burrito to add extra cheese and sour cream (at least saying it that way makes me feel better). I had it topped with the hot salsa, corn salsa, sour cream, cheese and lettuce....chips and guac on the side and you have yourself a great meal!  And it's so filling....I promise you will have enough for two meals...great meal and great experience!   LOVE LOVE LOVE this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W0ZXKhCeL7uPWUcrWnzSVA",
        "caption": "Photo of Chipotle Mexican Grill - Charlotte, NC, United States. Chicken Bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W0ZXKhCeL7uPWUcrWnzSVA/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "DM4WwwIquAvIMEqJus-zDg": {
    "date": "4/15/2016",
    "text": "I always love Chipotle and have never had a bad meal. I dont like them running out of ice and never having limes though. The staff always seems nice and the foo good though. So no ice for my soda, I will survive. I do like that i can have a wrap just the way I like it",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5keMAmic7zzrnM5mVefBw"
  },
  "7-6q5_NJtUObdWrxrFlfcg": {
    "date": "4/14/2016",
    "text": "I'm just always happy after eating here I mean I love Mexican ya know anything so a place I can go in and get fresh all natural ingredients for a burrito/salad/bowl is always a win in my book. I must say I do prefer this place over moes or qdoba as the ingredients always seem to be a notch above in flavor and quality.  I adore their honey jalapeno vinaigrette on their salads and I cannot guarantee that I have that salad dressing name right all I know is that its delicious and when they ask if I want it I say heck yeah.  I think my only complaint is that its a bit pricey and nothing comes with chips and I don't know what kind of salt they use on their chips but I'm addicted so yes I'm upset that chips don't come with my meal but yes I will still pay for them :/   This particular location is my favorite as the service is always super fast and friendly and parking is always easy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_EBGLn2zi2n4G5Fd9kAsPg"
  },
  "696qXcAs7UOvR1DF6MR_XQ": {
    "date": "7/1/2017",
    "text": "The staff and management at this location is horrible, and the food suffers as a result. I normally love Chipotle and have stuck with them despite the numerous issues they have had (credit card data hacking, food issues,  etc.), but after going here I think I am done.  The food was dry and a bit stale. The servers were rude and appeared bothered to have a customers show up. It wasn't just with me but with others ahead of me in the line too.   It is too bad to see this chain go so far downhill as Chipotle once was, for me, the best 'fast food' I could buy.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1zPDrWuO1aDHuioXvh_3YA"
  },
  "OqMSVg8XRhfa3cEEZGoWxQ": {
    "date": "10/17/2013",
    "text": "I love Chipotle, but whoever made the guac yesterday really messed up. There was so much salt in the guac that was almost all you could taste.   I must say that the staff here were probably the friendliest bunch of staff I've encountered at a Chipotle.   While the guac was terrible, the rest of the burrito was great. Excellent and really delicious which I always get coming here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YRcaNlwQ6XXPFDXWtuMGdA"
  },
  "QZ3lm7z4FCv59xHjdXtHNA": {
    "date": "1/20/2017",
    "text": "We are here over the weekend for a late lunch and I've got to say this place is the pits.  The food was cold but the service was even worse and incompetent.  I have a large family but when I order 3 kids quesadilla meals and I get just one quesadilla,  there's a problem.  When you make me go back through the long lines because your servers take forever to make a burrito, to correct YOUR error, that's an even bigger problem.   To top it off, I used a gift card to help pay the balance and your worker didn't apply the balance of the card and simply threw it away.  This place was great when it first opened but today, it's a dump.  The bathrooms were disgusting, the seating area was messy and your staff are rude.  I will never go back here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "be4Vp-EWjtCDgYdGtE2auQ"
  },
  "5D1x_0zt7BlqtyudmzCFqg": {
    "date": "8/9/2017",
    "text": "This chipotle on pineville Matthews is dank!  Fast. Tasty.  I've been blessed with BOGO cards a lot.  Of course I do eat there 4 times a week every week.  I love it there.  Thank you for being cool!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6XxUziYK9Tr018pSqf_6ZQ"
  },
  "bS6UBOLUxmWqryBFBkdOew": {
    "date": "8/14/2016",
    "text": "So, me and a friend were wanting something to eat after we went to Carowinds and we decided to go to this location. I decided to order a huge burrito and the manager (Ashley) folded my burrito for me. Engaged in conversation with the staff that I had never eaten at Chipotle before and so the manager (Ashley) after we had gotten our food came and talked to us. She was probably one of the nicest people I've ever met - I got to talk with her about the love of Jesus and the calling on her life - she got blessed! We were very impressed with the atmosphere of the restaurant - everyone was nice! I believe corporate should recognize this place! Wonderful restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "740KN5N59Xc7C3kk-mmbPw"
  },
  "AyW53eQu_v8BKZEZwwq_HA": {
    "date": "1/27/2017",
    "text": "Horrible staff.  Don't bother ordering online- they won't make it until you get there.  Just go to moe's down the street",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uzpKcG1VoRC-MsMKojOedg"
  },
  "xkdTUUm8-0VmA7A4CuwU3A": {
    "date": "12/30/2016",
    "text": "This chipotle has the best customer relations! This place accepted my coupons and were very polite about it and didn't give me a hard time. Also, it was nice that the employees weren't in robot mode when they ask what you want and move you on, they actually start conversations and it felt so nice. This is a model chipotle and should be honored. Also, all ingredients were fresh and restaurant was clean, along with clean restrooms.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yUg8ZVVqHKDWtJcJGxFb9Q"
  },
  "XoZY43wuRlzcD2bstc7M1w": {
    "date": "4/9/2015",
    "text": "Customer Service is top notch!!! Love this place! Food is always fantastic!!! #customerforlife",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z1zcaMOUyizQUnc715TG4Q",
        "caption": "Photo of Chipotle Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z1zcaMOUyizQUnc715TG4Q/o.jpg"
      }
    ],
    "user_id": "5_5IBQcoUtTe2sLIIY99eQ"
  },
  "_tRkISEo0I---7lQe4cOLA": {
    "date": "1/26/2014",
    "text": "It is 7:00 on Sunday night 1/26/14  I just got home from a horrible visit to what in the past has been a nice experience. With my family of six, we were all hungry and ready for some good fresh food. As we started to go down the food building line we ran into a girl rolling (or trying to) the burritos. She was yelling out what do you want...which was totally over the top...but she also was not listening and put things in our food we did not want.  I watched her roll one of the burritos into a ball...literally looked like a small baseball. As she carelessly did this she of couse tore the tortilla...when I mentioned it to her she responded oh yea I was getting another one...which I doubt....as I could tell She could have cared less about any of it.  We just moved on sorta of just rolling with it. When we got to the table...one of the burritos had a hugh amount of salsa in it even though the person did not want any tomatoe at all.  Once again he said its ok...but really, for a $7.00+ burrito it should  at least be done correctly. My wife went back to get it done correctly...she asked for the manager. The cashier went to the grill guy...who apparently was the manager on duty...he just ignored my wifes request to speak with him. He walked to the back and was just going about his businessn like no big deal.  On the 2nd request he finally did come over...my wife pointed out that the line worker was just putting on items at will..he said he noticed and would take care of it.  A replacement was finally made after standing at the front for 5-10 minutes. When my wife opened her quesadilla the cheese was not even close to being melted. I decided to take it back up as she had just sat down again. I showed the same \"manager\" the quesadilla and asked hime to have the cheese melted...I watched him put the item, which was in foil, on the press and push down on it...he seemed unhappy to be bothered. When I got back to the table my wife opened her item and it was like one with the foil...totally preesed together and unable to eat.  I again had to go back up...showed it to him...he was startled at this point and did remake it. Now back at the table I was ready to finnaly start eating my dinner. My back was to the line and my kids started to get real uncomfortable. I asked them what is wrong and they mentioned that the line crew were all looking at them and laughing.  Now sometimes thing just dont turn out...i get it \"Murphys Law\". BUT when the employess are being this disrespectful to their guests it just crazy.  As more people came through the line the \"burrito Rolling Loud Girl\" was intentionally (almost yelling) how are you doing today I'M GREAT...then laughing.  We certainly did not go in tonight looking for trouble...just a good  no stress meal...that of course is not what we got.  I did get the cards of the General Manager Marcus Davis and Apprentice Nichole Franks. I will call tomorrow and let them know about the apalling treatment. I have run restaurants in the past and would certainly want to know about such an event. I look forward to their reply. Good luck to future visitors...looks like a hit and miss place now. Patrick M",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "bWsCJCXJz8Qeege03xQAxw"
  },
  "-_nLEClKQ21OoZxw6bxcoA": {
    "date": "2/5/2015",
    "text": "I love Chipotle, so it hurts me to give this location only a 3 star rating.  It's a typical Chipotle so when you walk in you wait in the long line (there is always a line at Chipotle)!  The lines move pretty quick so no complaints there.    When We got closer to ordering there were about three people in front of me going through the toppings part of the line, once they got to the lettuce part...all three of them had to say \"Can I please have more?\".  The girl was, not exaggerating, putting like five pieces of lettuce on all the dishes.  I thought maybe she's learned a lesson and I won't have to say anything.  Nope!  Had to tell her twice, \"a little more please, a little more\".  I guess I could have said  A LOT more but I don't like being rude when it comes to my food.    My burrito bowl tasted great like always, but my 3 star review is for the cleanliness of the restaurant.  It was disgusting!  All available trash cans we overflowing to the max!  I overheard one gentleman telling the people at the counter that there was no more room for trash, and I heard him ask this when I started eating.  When it was my turn to throw stuff away, the trash still had not been taking care of!  People were just leaving their trash by the drink station or just leaving the mess at the tables they were sitting at!  The seating is already VERY limited so you could see where this could be a problem!  I love Chipotle, but this location will be hard to visit again anytime soon.  :(",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x-1oCEXf8unHrA_zfr6QXQ"
  },
  "1VHUudVGlVnEwTHNQccGHw": {
    "date": "2/28/2014",
    "text": "Have been to this location multiple times and this was by far the worst customer experience I've had at any Chipotle. Line staff were rude (especially to my preteen children), double-charged me, and short-changed us on our chips and salsa order.   Makes me wonder if Chipotle has become just another chain. . . .",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hHnlsYTD9rluEVGJDacXXQ"
  },
  "qrZ7e643Kr1Vyvbwxo5REA": {
    "date": "1/3/2015",
    "text": "I have been a customer of chipotle for over 10 years now and this I by far the worst chipotle I have ever been to. The management staff is terrible and treats their employees like your ordering from an assembling line. No personality at all. When ordering you can hardly understand them because all they focus on is getting to the next person. And when you do answer them back, they don't even listen and have to repeat yourself two or three times. Get ready to have your blood pressure raised while ordering. The food is always never ready and I find myself always having to wait for something to be cooked. Usually I wouldn't mind waiting for hot food, but it comes with a cost. And that cost is the rest of your burrito is cold from sitting waiting for the food in the assembly line.   Overall, because of the poor management and atmosphere I am giving this a 2 out of 5.  The only reason I am giving it a 2 is because, well its chipotle and I love the food for over 10 years. Fix the management and allow the customers to have an enjoyable experience and I will come back. I'm tired from ordering from a manager who spends more time yelling to hurry hurry to his employees to get to the next person and eating cold food. Can't wait for the location in Stonecrest to open!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hj36gwmw7108inU3BFxEjw"
  },
  "1HAu081b9ocaUJcfeA9fdA": {
    "date": "2/1/2012",
    "text": "This Chipotle (on Hwy 51 beside the Catholic High School) is ok but not as easy to get in and out of as the one on Providence Road.  For starters, they share a parking lot which is not laid out very well. Second, getting back out into the flow of traffic on 51 can be tough, even if you are taking a right out of the lot.    So, today I stopped in to grab some lunch to take back to the office,  and found that the service was pretty slow compared to my other visits to Chipotle.  3 people had apparently ordered online and were now standing around waiting for their orders, which had not been prepared prior to their arrival. This sort of discombobulated  the entire line staff and the cashier.    When they finally took my order,  things flowed a little better until I got to the checkout.  There I had to wait for awhile so that the cashier could sort & bag the orders for the folks who had ordered online.  They need to figure out how to streamline the fulfullment of online orders so that it is more smooth and efficient.    Still, it's Chipotle - so the food is fresh and tasty... always a good choice when you want a quick and inexpensive meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "nBRwMBRowxPiiG66ADGYRQ": {
    "date": "4/21/2016",
    "text": "I have consistently good experiences here. The crew is always polite and the food is delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OU_uyMOjoUhLa1RTZQCmMQ"
  },
  "tYxO3ufyfFR5M3bfg-ULrw": {
    "date": "3/6/2016",
    "text": "Love this location!! Chicken always perfect and sooooo friendly!!! Thanks guys! Keep up the good work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mNjK_H5Z-XVucUOFPEZJXg"
  },
  "u7qUFt6il53CYnO2lAyGpw": {
    "date": "10/25/2015",
    "text": "Love Chipotle so it sucks that this location has such rude employees. Also, they ran out of chips one day when I was there! How can you be a Chipotle and run out of chips! Gosh! The cashier that checked me out was super rude, the only time she spoke was to say the total! Rude, rude, rude!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OqGS5VgyoycnuA-lZOU-bA"
  },
  "33tGxaDsBXYaFovhosq0kw": {
    "date": "2/18/2014",
    "text": "My husband had been craving Chipotle after Snowmaggeden began on Tuesday. Luckily after breaking out of the house Friday we had Valentines day dinner at Chipotle. Although not romantic, the food was great. They were out of chicken, so we traded up for the steak. My husband got the steak bowl with black beans, corn, salsa, and sour cream, while I got the steak quesadilla.   The quesadilla is technically only on the kids menu, but if you, as an adult order one, they will make it accordingly. Also the adult size is around $6. I thought it was very good, and I tried some of my husbands bowl which came with a side of guacamole. You could tell the ingredients were fresh but my husband was a bit disappointed for lack of chicken.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7JLpACO44A3xVXnOt1Z_A"
  },
  "qwvpzILnDioreeBf0S9ffg": {
    "date": "6/13/2019",
    "text": "Always quick! Always hot! It's legit.... thanks Chipotle for always hitting the mark! I used to love behind this location but now I have relocated to Stone Mountain",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E0xJJ6oqETzISbwbNij7gQ",
        "caption": "Photo of Chipotle Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E0xJJ6oqETzISbwbNij7gQ/o.jpg"
      }
    ],
    "user_id": "nCuv2BqIYecLYyJDD7OkVQ"
  },
  "mlrSJtB3v97lbA5vDG2klw": {
    "date": "6/8/2019",
    "text": "I think it was time to update my review since it's been a few years. They open at 11 and I came around 11:05 to order food to go. There was only one person in front of me. There was only one person on the line and they were doing a large order. We both waited a few minutes and it was pretty obvious that the whole line wasn't fully set up. The girl in front of me ordered a salad and they didn't even have lettuce yet.   I finally placed my order-burrito bowl with steak. It's my go to. I was pleased with the generous portions and the lady that was helping me was very friendly. Their corn salsa is sweet and crunchy and I love their red hot salsa. I checked out in no time without any issues.  Overall, it's an ok experience and it can be hit or miss.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "zdSxvU22s32JrtCsXxpY-w": {
    "date": "5/12/2019",
    "text": "I love this place. This location is always amazing. It has new management and the new GM is amazing , about time they let a women run the store",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Ewp-fdvWouN_atzqrkB6Q"
  },
  "rW3JpzUSpW4VRlX9Lf1KEA": {
    "date": "7/25/2019",
    "text": "This by far is the worst store I could possible eat at. The young woman that's the GM is rather rude to her crew and the food isn't all that. I wouldn't recommend this locations. I would take my money else where like he mall location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pcotDrPrCopAOw0jnQnYiA"
  },
  "9tOatfTbh3i9z8cm5zVBSg": {
    "date": "7/15/2019",
    "text": "Had a Saturday lunch.  Food was hot, delicious.  Staff was friendly.  Child friendly.  Reasonably priced.  Could use more parking.  Will definitely eat there again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z83POZtKQ2VJjUDPco_t_w"
  },
  "BORFn4MfaARPDxn0tAckXw": {
    "date": "7/26/2018",
    "text": "I've been coming to this Chipotle location for over 3 years and I'm still in love with their food! In my opinion Chipotle's food has more flavor than Moe's, Qdoba's, & Salsarita's food (Even though Qdoba comes in a close second). You can choose from a bowl, burrito, salad, quesadilla, or tacos. They have kids meals as well that are quite big. The chips are crispy and perfectly finished with a squeeze of lime and sea salt. The salsas and guacamole are divine as well! Most of the staff are kind and helpful but there is a good handful of staff members that are rude and unprofessional. Overall, I will continue to come to this Chipotle location because of their flavorful food!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "uoFMF4culI4Z7_3Cwws3JQ"
  },
  "pKrcxixyi3qJaS1Qgla2bw": {
    "date": "12/20/2018",
    "text": "While I always love the food, there are three main issues with this location.   The first issue encountered is the parking lot. It is one of the most poorly designed parking lots ever. It is tiny for the amount of traffic it receives, and badly designed. There is only one exit and turning out of it is almost impossible if there are any other people, and there always are other people.   The second issue is that there is not enough seating for the amount of traffic coming through.   The third issue is the cleanliness of the facility. It always has food or liquids on the ground and it seems like the tables are never cleaned by anyone but the customers.   Like I said, I like the food, but the facility is just always getting on my nerves.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PtpFOaY-HttFBvarKwCLRw"
  },
  "vcyx43EgvEURFw6D304-Qg": {
    "date": "5/2/2019",
    "text": "I like eating at chipotle. Your food is really good.The food there is healthy.I go there a lot .My whole family like it. It is so good. I want to go there every day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rikSaX-Gi6BAwOzCosTA0A"
  },
  "FVX9scgvMVYhbk0uAKn9wQ": {
    "date": "2/12/2018",
    "text": "Currently 5 employees standing around, no customers online. Every table in the restaurant is dirty. So I wiped a table down for me and my husband to sit at thinking the employees would take a hint and come clean up. They didn't. A few students are sitting at the tables with no food or drink purchases quietly working on homework.   I love chipotle, I beg my husband to take me here often. It's so convenient for us to run in and grab food. Chipotle is life!! Just not this location. Management needs to recognize a training opportunity. To teach there staff to be aware of what's going on in the restaurant.   Today my bowl was basically soup. So disappointed. 4 of the employees have long hair and there was no hair nets in sight.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Slny6DHILkNeWl0Xlipe0A"
  },
  "BJWQv4J0HFlapf31Quy9sA": {
    "date": "12/9/2017",
    "text": "my favorite spot. I will never have anything to say bad about chipotle. chipotle is life!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6uvvMwqxlVT1c6iVrqf-wg",
        "caption": "Photo of Chipotle Mexican Grill - Charlotte, NC, United States. chicken bowl with guac",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6uvvMwqxlVT1c6iVrqf-wg/o.jpg"
      }
    ],
    "user_id": "k9pA-xp_9pg6xu_eFYwYig"
  },
  "4Bt-oepH2aHgBJf3qny_cw": {
    "date": "2/21/2018",
    "text": "Welcomed me as I walked in the front door. Food is good. No wait. Plenty of parking spaces. Clean and orderly. Prices could be better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cbJAEjSq_saZ0CNgnMa2HQ",
        "caption": "Photo of Chipotle Mexican Grill - Charlotte, NC, United States. Veggie bowl",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cbJAEjSq_saZ0CNgnMa2HQ/o.jpg"
      }
    ],
    "user_id": "Gb9Y_f1xslY1mDvvHBXaLg"
  },
  "PAlXYSGYJoBxO8ZXM7LWfw": {
    "date": "3/13/2018",
    "text": "I actually was unable to successfully eat here. It's probably for the best so I didn't get salmonella.   I politely asked an employee to change gloves since I have an allergy and she actually verbally scoffed and rolled her eyes and made a scene. We proceeded to leave. Avoid like the plague if you have allergies of any kind.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d4DaQF9NADwqwE_KBxVT5A"
  },
  "U2fBuenLi3urEfE5A_4VMw": {
    "date": "1/16/2016",
    "text": "So after going across the street to Flip N' Chicken and their cooks not washing their hands... I came right over to chipotle and the service was outstanding as usual. THANK YOU!!!   Everyone was polite, clean, wore their gloves, had clean hands, and made sure they did not go in an area involving food if they weren't the food handlers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QVdgKrxWySuHqFzT-xG35w",
        "caption": "Photo of Chipotle Mexican Grill - Charlotte, NC, United States. CHIPOTLE yet again showing the others how it&amp;#39;s done with perfection!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QVdgKrxWySuHqFzT-xG35w/o.jpg"
      }
    ],
    "user_id": "bEs1d3_QBUoQB_AjTP-28w"
  },
  "DIiiUak7z5ejOfAMuC0jDQ": {
    "date": "9/16/2018",
    "text": "This is by far the BEST I have every had... The food is blazing amazing.. super clean environment... Highly recommend this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UHV0B24i_IVOKyXcRe9IeA"
  },
  "OIm0KbaWE4kvdHOKzW7qRg": {
    "date": "10/4/2017",
    "text": "Could only imagine if I was a small child who wasn't paying attention and may have choked on it. Do better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oN0ZOkIeWf_ck-Hwp5agDg",
        "caption": "Photo of Chipotle Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oN0ZOkIeWf_ck-Hwp5agDg/o.jpg"
      }
    ],
    "user_id": "ubMyXWQ6HLqzt_Rl_xbxog"
  },
  "rNqdTBCzvHvTzn7AcP7vWg": {
    "date": "3/11/2018",
    "text": "Im so sorry, but,, i have to walk away,,, the burritos were soooo small!!! I cant pay for that.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "r6318XU21FtxAcEwxYPKHA"
  },
  "Ym6EMAFxcYArJeLKf05cVQ": {
    "date": "9/27/2017",
    "text": "Really good ... quick. Very knowledgeable staff. Good location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "avkCj6jnszCk1pe1XlTDHQ"
  },
  "pB4DlINWuOlkjKARxffYhQ": {
    "date": "1/12/2018",
    "text": "Rude. . i eat at this chipotle multiple times a week, and I just finished ordering got to the register and Emily charged me. I proceeded to ask her for lemons and she opened the fridge and said sorry we are out, so I asked if she could please cut some ? And she said no, sorry. I said, why is that? She responded, \" because, not right now Im in the middle of something\". I said , \"are you serious\" and she said, Yes and turned away. Customer service is a part of every job and I feel Emily would benefit from customer service training this is NOT the way employees should act . I am dissappointed, that Chipotle allows this behavior. (If you check the cameras, there was no one in line when i arrived at 8:40-8:45pm) & i observed 4 employees walking around in the kitchen . this was not a difficult task.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MFQt5sFeebDiX60RBBlJYA"
  },
  "gkrfM4BT8jxasfiYs-MpAw": {
    "date": "2/1/2018",
    "text": "Love chipotle but go to a different store, portions at this one are consistently smaller than every other store, it's clean and people are friendly but you definitely get 20-30% less protein here",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KVelE1o6ATnkTguQzH60pw"
  },
  "Uyl6KQXBc_ocbvb3FghB5w": {
    "date": "10/2/2016",
    "text": "By far the nicest Chipotle I've been to in MONTHS! Josh and Angel made me feel like a valued customer, not just the \"chicken burrito bowl\" lady. Thank you for such great customer service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_8J9SuwNpOW--2TzArpvXw",
        "caption": "Photo of Chipotle Mexican Grill - Charlotte, NC, United States. By far the nicest Chipotle I&amp;#39;ve been to! Josh and Angel were so sweet and made my chipotle experience , the best !!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_8J9SuwNpOW--2TzArpvXw/o.jpg"
      }
    ],
    "user_id": "73_Sd80mlcqioDn53hW1IQ"
  }
}