{
  "5azYCG__h_SGbFv1Ye_4AA": {
    "date": "10/3/2012",
    "text": "What a disappointment! After seeing all the great reviews, we walked all the way there from where we were staying... only to find that it was closed. Had there been hours listed on their Yelp profile or website - or even a phone number - we could have found this out without wasting our time.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2mYNkQatbLIg6mhQzDiGNA"
  },
  "URAw9n8YTV_PMuTY5580Qw": {
    "date": "2/12/2013",
    "text": "My family and I have been going to the 7th Street Market every Saturday for most of the past year.  We usually hit Pure Pizza, Not Just Coffee, Cloud 9, and Orrman's Cheese Shop.  We had seen Bonsai Fusion Sushi but we were a bit skeptical of how good it would be... for whatever reason.  We recently bit the bullet and tried it out....and it was fantastic!  The ingredients were so fresh and the two chefs/owners are great guys and always very accommodating (especially since I live north of Charlotte and often can't get down to the market until close to closing time).   So far we have only had a few of the more traditional rolls but we are looking forward to trying one of the many delicious sounding signature rolls.  My daughter now craves their sushi and looks forward to our weekly pilgrimage.....just one more reason why we love the 7th Street Market.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NnMCDFCsaiJ3OgvzZJJ-cQ"
  },
  "Ey4LOwNrmryljtqe1j6DWg": {
    "date": "3/12/2015",
    "text": "Nobu the sushi chef is one the hardest working chef in Charlotte, they are my go to when I need the sushi cater.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XRBGHzR9xYf62KXC5ksRng"
  },
  "wV8f0p3P6BmI8PiRaJaSjA": {
    "date": "6/16/2015",
    "text": "Great food but don't visit if you're pressed for time. I've been 3 times and 2 of the visits involved waits ranging from 30-40 minutes (for a to go order). Call ahead, expect a long wait or go elsewhere",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N14t3rgdErOrrIKNsu_qvQ"
  },
  "TH84hgQEKIc-eb6iiddRUw": {
    "date": "10/28/2014",
    "text": "i like the sushi man that make sushis!!!!!! i look forward to eating more of his sushis. yuuummmmmy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IffhK3RuMrv2qBJLsCswPg"
  },
  "-ncKODY-FfcTeyzdS6ndVQ": {
    "date": "11/16/2012",
    "text": "This review is for the lunch special only. I may seem a curmudgeon for my two star review but I'm actually a pretty nice guy. Some sushi background may be in order.I'd eaten a lot of sushi and enjoyed it almost everywhere, but that changed pretty dramatically the first time I had the assorted sushi plate at \"japanese i.\" When I tasted my first bite I almost said ewww. That piece of sushi had such a dramatic flavor, in fact every piece of that nigiri-zushi plate was as  singular in taste as wines made from different varietals, actually even more so. \"Japanese i,\" had become the standard (fairly or not) by which all other sushi is compared. I got the lunch special with the following rolls: salmon, tuna and yellowtail with avocado. The rolls were competently made; they didn't fall apart when I ate them. They all fell within the \"they mostly tasted alike\" category which  is the largest sushi category in the Charlotte area. The servings were generous; I would have been full on two rolls.The accompanying soy sauce was the saltiest I'd ever tasted - very little subtlety there.  All in all, a poor experience and even though I'm curious about the beautiful and expensive fusion rolls, I'm reluctant to go given my lunch experience. After all, it's all about the quality of the fish, and the fish here was mediocre. \"Japanese i\" is now closed, a casualty of the recession.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yrI-1AuDg38Mgx4PeO_0EA"
  },
  "wEOsSIUVOspVIPjh1WH0YQ": {
    "date": "12/5/2013",
    "text": "This is a great little shop to get a health lunch of sushi.  The owners do their best to keep the fish they use to be as fresh it can possibly be. The portions are just about the right size.  They can be found in the 7th Street market along with other eclectic vendors.   My meal was about 14 dollars with out tip.  So if you in the area check it out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "apwx9mVErPHhQgxFnlvcjA"
  },
  "I8ardTubs8nALB0sv9-GHA": {
    "date": "6/1/2017",
    "text": "Great food but hours are impossible to predict despite website, Yelp, etc. In the last 4 months, they have been closed at least 5 times when we visited during their advertised hours. Hard to eat at a place that is closed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XBMV_f_yyizr4pETMc_x_A"
  },
  "dWQhxY43tLEMrP_WvDN8RQ": {
    "date": "3/12/2013",
    "text": "Bonsai's sushi isn't the best I've had. It's certainly not the worst though. This little corner of 7th street market seems to serve decent sushi at a decent price.  Some of the rolls are more imaginative than others such as some sort of roll with mango and shrimp tempura. The guy making my sushi was super nice and when he noticed that I wanted to go find join my friends at the table offered to send it to me once it's finished if I wanted to sit down!  Ultimately the problem lies in the rolls they have on offer. They're forgettable sadly enough. The quality is okay, the price is okay, the creativity is okay and so this place gets rated as an okay place.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "zZYHZwmBl9Af4pI-aLXBFA"
  },
  "npkgtvJ-iyte0FEEr3NMKw": {
    "date": "3/7/2013",
    "text": "Located in the 7th Street Market, among a few other great places, is this \"little\" sushi counter.  I ordered the Kani Salad, great ginger dressing, and the Top Gun Roll, which was probably was of the best spicy tuna rolls, topped with tuna, salmon, and hamachi, in Charlotte.  The reason I am giving it a 4, and not a five, two things stick out. First, the roll was a little small, 6 pieces, for $12?  And, I am not a typical person to complain about the price of sushi, but $18 for lunch, and it only 6 rolls and a salad, seemed a little high, when other sushi places in downtown offer a roll, salad, and egg roll for less than $10.  I would definitely go back, but will be sure not to get suckered on the speciality rolls, but rather try some of the lunch specials others mentioned in their reviews. Overall, great sushi!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "eEYRCLAww25nb5GAtHW6xQ": {
    "date": "12/4/2015",
    "text": "We are a bit spoiled with sushi in Chicago and didn't expect much - but were pleasantly surprised.  Excellent sushi, very fresh and pure, seaweed salad is unrivaled.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FOLeUSzkcD2us1iz6kEuhw"
  },
  "W1CewGqBjO_yB_X-bq9Mjg": {
    "date": "8/18/2015",
    "text": "Get the sushi burrito.   Bank of America employees get a 10% discount.  You're welcome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V7ouHsPmYP9KjYsGc_aeQw"
  },
  "dBYkqMDJvjLCThb9tUcBMg": {
    "date": "11/3/2012",
    "text": "I love this place for the fresh sashimi that just melts in my mouth.  The freshness so good it reminds me so much of heaven - which would be a sushi restaurant in Little Tokyo. I usually go for standard fare - basic sushi rolls and sashimi.  I think I might have to break free of this habit and try the other things on the menu like their specialty rolls or their burrito.  As for the time... they are staffed until right before 5pm (I asked one weekday) even though the 7th Street Market is open until 7pm.  Very friendly, they offered to make  my take home if I call them around 4:30.  And it would be ready for me to pick up at 5pm. (I work right across the street from them.)  Love it.  I should get that number for you off of my desk at work...  Extra perks: the personable staff, the 10% off BofA discount, the free parking with validation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "_YtbR3DlDDoqk9Q2bqAurQ"
  },
  "JvmdJlCuGIlOUZIRRIS14Q": {
    "date": "9/13/2012",
    "text": "Found inside Seventh Street Station this sushi counter is fast, fresh and friendly!  It is a tiny counter with a few bar stools if you want to sit and watch the sushi made.  Otherwise there is seating in the common area.  The staff will bring out your order if they arent super busy.    Excellent roll options - my fav is the Godzilla (with cream cheese which is 50 cents extra).      They have lunch specials and discounts for some employers like Bank of America ec.  If you park at Seventh Street Station parking garage they will validate you!  I have made this my Friday lunch spot - yum!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "htiVdsiY_rBmJc65aZ3YAA"
  },
  "GP1f_ECkonC2iWDFbwILYg": {
    "date": "8/2/2012",
    "text": "Walked into 7th Street Market I had my mind on Fran's filling station but my co-worker mentioned that the chef behind the sushi bar was actually from the old Cirros (sp?).  I'm glad he told me and I'm doubly glad I ate lunch here.  It's a solid lunch both from the food and taste plus the costs.  $11 for 3 rolls and the rolls are 8 piece rolls!  You will be hard pressed to beat that uptown I think.  The service was great and I will certainly be back for my sushi fix.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "LrF_WUV54w1l6PN1CAiGMA": {
    "date": "12/2/2012",
    "text": "Stopped in here for lunch during a weekday which would likely be the reason it wasn't very crowded.  We were greeted and served immediately!  The two staff members that served us were so funny and personable.  They held a conversation with us for almost the entire time we were there!  The sushi prices were great.  In fact, it was so cheap, my friend and I ended up with too much food.  Thankfully, they have boxes and chopsticks to go!  The sushi tasted good but it wasn't the best I've had.  However, I think sushi is always relative to price.  So if you're not wanting to spend a lot but want a decent roll - stop in here!    Added bonus - the 7th Street Market, which is where Bonsai Fusion is located, will validate parking for up to 90 minutes.  Make sure to bring your parking ticket in with you and stop by the door on the way out to swipe it in the machine!  I also enjoyed that after our meal, we were able to stroll around the market and pick up a few items.  Overall, it was a very pleasurable experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WPNPOHwyyzDH2QBI9ketcg"
  },
  "9FxsDWGrQm6qdOgQhd4vkA": {
    "date": "3/26/2015",
    "text": "I've been to the 7th street public market so many times but I've always put off trying Bonsai until recently. I ordered The Hulk and I must say it delivered. The guys behind the counter are friendly and informative and the coolest thing is their rolls are named after movies. Will definitely return soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aihRtdsX5RXWxgKmPGG1xw"
  },
  "4dTRKl6QlE9SncEY_xeIgg": {
    "date": "11/6/2012",
    "text": "Rocking lunch special. Not just for standard business lunchers Mon-Fri. I hit up the market one Saturday afternoon and was excited to see the $9 for two roles $11 for three special was the real deal. Their fish is very fresh and the service was on point. I like the retro movies playing on the tv that marry well with the movie themed menu items. I had the Philly, tuna and avocado and tilapia and avocado - well I split this. Great for sharing with  hungry boy and great deal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XatJ1Tkqw5dw5n7WeWr_FA"
  },
  "A0CQVlFsUDi8756APQOVMw": {
    "date": "8/20/2015",
    "text": "Why is my sushi not cold.  The top of my salmon should  be completely raw.  Not look like it's been cooked partially.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "COmEgn2Sgi3I2QdLH9o40A"
  },
  "_5awoEIFAxtxM_v9U8KN6w": {
    "date": "10/11/2012",
    "text": "Talk about great personalities - we had a great time talking at lunch with the Bonsai staff ! Super friendly and quick service : ) +1 star alone for this.   We took advantage of the three roll lunch special for $11 - but I wish we had went with two for $9, because it was way too much food for my dining partner and I (we had six total)...I was stuffed, and we had a lot leftover! These were pretty basic rolls, but the sushi was fresh and they honored my request of keeping the tuna whole (not a fan of the chopped type).   I will say next time I may get some of the other special roll options because the rest were pretty basic, I like a little something extra in mine. I may also check out the burrito since it looked pretty awesome.   The rule to remember with parking: it's validated for 90 minutes BUT*** you do not validate it until you're ready to leave or you'll run out of time, they only give you 20 minutes to leave after it's validated. There is a machine by the door next to Bonsai (ask and they'll point you in the right direction).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "igtQbM2CTgxGZjIgPzE6kQ": {
    "date": "5/13/2015",
    "text": "Quality sushi for a good lunch price. It's located in the 7th Street Market so there's plenty of other things to choose from if you're going in a group.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "55ONu5DpPgNRM1Xy0kjo1Q"
  },
  "0-amDyNnbbw1UiDIfeWChQ": {
    "date": "12/28/2013",
    "text": "Just tried the sushi burrito and it was very good. The combination of flavors worked great and would highly recommend and order it again. I could have used for more tuna but that's the only drawback.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "U3oy-qGgx8pUQ_s39AUkUg"
  },
  "EsSwRCftJYM0tLFi9ePp7Q": {
    "date": "6/30/2013",
    "text": "My hubby and I finally made it to the 7th Street Public Market - and we're so glad we did. Bonsai Fusion is a little sushi spot among the other cool vendors in the market. I had the Die Hard Roll - very good! And my hubby had the bean curd roll - which was also tasty! The next time we're in the market - we'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "hc71knjnXMI9wG_Oo9hpoA"
  },
  "UMZGjpxPUn6E5dek1CqOew": {
    "date": "8/6/2013",
    "text": "Love this place and the dudes who run it.  Moved to Charlotte last year from Oregon/California and have STRUGGLED to find any sushi that my west-coast-spoiled tastebuds could tolerate.  After too many overpriced, flavorless, disappointing sushi meals, these guys swooped in and saved the day.  Fresh-ass fish, creative rolls, great prices (especially on the three-roll lunch special), and extremely friendly proprietors.  I'll come in on a Saturday, bang out some lunchtime sushi and then hit up Not Just Coffee. Good livin'.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GJFnizUjihxZUPiBc5_Nzw"
  },
  "Prg2gCsJOOcweJ4IwztcZQ": {
    "date": "6/14/2015",
    "text": "awesome sushi! i'm glad to give it a glowing recommendation. wish my mom would give me a glowing recommendation of love. she doesnt though. i'm a disappointment. anyways, awesome sushi!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XAdt99uAYWm7t8RD1qONxA"
  },
  "FDBnAF6lQ7eJxcUwV1fZ1Q": {
    "date": "3/8/2013",
    "text": "Even though there was a line, the sushi came out fresh and well presented. The miso soup tasted lightly fermented and much more delicious than the packets I usually drink at home. I really enjoyed that Bonsai Fusion keeps escolar on the menu. Many sushi places either don't carry it or use the \"white tuna\" euphemism to offer escolar and other white fish, but I appreciate that BF is straightforward about what fish you will receive. All in all, Bonsai Fusion is a good lunch spot and I will likely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9qclfIjg-5WmX16Gd0qasA"
  },
  "S8BbvLszywE_GMDZIXz9-g": {
    "date": "8/25/2016",
    "text": "Nice guys, great concept, delicious food! Do your self a favor and eat the sushritto!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u2mZPsTg3ptg3Rc2W5gflQ"
  },
  "nF_WJJRtAowHYQNPEy45ng": {
    "date": "7/28/2012",
    "text": "Yay, Chef Nobu breaks out on his own and establishes a sushi bar Uptown! Although the address says it's on 6th Street, Bonsai Fusion is located inside the 7th Street Public Market. Park in the garage, bring your ticket to be validated.  It's the smallest sushi bar in Charlotte, with a whopping 4 bar stools, but if you are one of the lucky ones to snag a seat, you are set for a tasty treat! Don't let the 4 stools fool you, there is plenty of seating indoors or out on the patio. They make up for their small bar with huge smiles, generous rolls, and gigantic flavors that will make your tastebuds do somersaults!  There was a fantastic special running when I was there: 2 rolls for $8 or 3 for $11. Hello, sushi for a steal of a deal! The sushi is creatively named, inspired by the 80's. Ask for the Blue Velvet! Nobu and his business partner do a fantastic job and put out some of the most delicious sushi I have ever eaten. They are very creative...have you ever had a sushi sandwich? I hadn't until my stop here and it was delightful.  If you love sushi, you will want to come here. Don't let the casual and small space deceive you, it worth it's taste in gold!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8KeWGCzkvMRpReOLjJaN6Q",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Special roll...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8KeWGCzkvMRpReOLjJaN6Q/o.jpg"
      },
      {
        "img_id": "5S46EusN8s40UZa9PQRIDg",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Risky business roll...yes, that is bacon and yes, it should be on there.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5S46EusN8s40UZa9PQRIDg/o.jpg"
      },
      {
        "img_id": "1nHdU69cD5ooijwPI-ATLg",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1nHdU69cD5ooijwPI-ATLg/o.jpg"
      }
    ],
    "user_id": "Reuq65EOFI938Yg8xgff9g"
  },
  "29DnphQEOB2vd0w8e8UsQg": {
    "date": "4/14/2015",
    "text": "Bonsai is a great option for fast casual sushi at seventh street. The staff is very friendly, though it will take a good while to get your food during peak hours. I recently tried the Incredible Hulk roll and it was amazing! The edamame hummus and honey chipotle sauce was outstanding. I love coming here when I have a good amount of time to wait and get some good affordable sushi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HfmoZIuNSWlN0J9-AgVWRA"
  },
  "H6VV3XW9RjSCNUgnlEMavg": {
    "date": "8/31/2017",
    "text": "This is my go to recommendation for out of town guest (as is the 7th street market in general).  This place is the definition of bang for your buck!  I would put their quality of sushi with that of any in Charlotte and their prices are half that of the other top ones.  Their lunch special is 2 rolls for $10 or 3 for $13 if you want to fat boy it up!  But my go to is the Sushi Burrito and they recently expanded to several other options (although the OG Hulk is still my favorite or the Hulk Smash if you are fan of spice).  If you are intimidated by the burrito- you can get it in the bowl and it is less messy but just as amazing.  If you haven't tried this place out- go today!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SZCel0TJaklCQN24R4lfwQ"
  },
  "FhtyhEbxBdUGtUXBsGcIjA": {
    "date": "2/28/2018",
    "text": "This is my second day in a row trying to eat here.  They say they are open and once again I am here and there is a closed sign! No answer on their phone when I called, too bad I was looking forward to it so much.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Is89tJ9x7cTsbomCG6SYOA"
  },
  "7feUtEuffQOCcYwIRm0-Dw": {
    "date": "3/7/2014",
    "text": "Having been to 7th Street Market a handful of times, I was hesitant to grab sushi from this place.  I don't know why I waited as long as I did - their fish is pretty fresh.  Me and this one stylish (and cool!) chick grabbed lunch here on a Thursday afternoon.  I ordered the 9-piece sashimi lunch special - 3 pieces of tuna,  3 pieces of salmon and 3 pieces of white tuna.  All for me!  It was a little pricey at $14, but I guess you pay for quality.  To be fair, quality is good compared to the rest of Charlotte.  CA still has the best sashimi/sushi available on LOCK DOWN.    The dudes that own the place are friendly and nice.  No complaints there.  If I have a hankering for sashimi mid-day, I know where I'm headed.  dmo out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oJBUXpkWLEQMwRWi4XQnxA"
  },
  "A6N7jpwIWE7bqa-nmOmw0Q": {
    "date": "4/17/2016",
    "text": "Found this restaurant on Yelp after searching for good sushi in Charlotte. After reading many reviews about many of the sushi restaurants and gathering that many Yelpers were disappointed in the freshness of food... I chose Bonsai Fusion after seeing that many reviewers complimented Bonsai's \"fresh\" sushi. I thought the restauraunt would be stand alone but it was actually in a very cool indoor marketplace w/ several other small eatteries. There's a big wall next to the small sushi hut that has pictures of all the specialty rolls and they're contents. 6 or 7 seats sit in front of the sushi chefs that are very friendly and prepare your food. The sushi is presented in an aluminum container that serves as a throw away container or a to-go container w/ lid. The sushi was very fresh and much to my liking. I highly recommend this spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JyJGLqDpZ2kJ2Lh3cC8JfQ",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. California roll w/ eel and avacado added to the top, smoked tuna roll, and an interesting specialty roll. Very fresh!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JyJGLqDpZ2kJ2Lh3cC8JfQ/o.jpg"
      }
    ],
    "user_id": "Xu8Grx5gxAkeIWNgpZIvaw"
  },
  "KpAR3JWSOWm-SexMFmUeLg": {
    "date": "5/13/2016",
    "text": "I love their sushi.  The salmon avocado and spicy tuna rolls are my go to.  The fish is fresh, and the sushi chef and staff are very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q2aUxvR6J4tD1fC2o_rw5w",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Sushi Love!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/q2aUxvR6J4tD1fC2o_rw5w/o.jpg"
      }
    ],
    "user_id": "F3X3Nvi0Ml7hiTWCGanE6A"
  },
  "Tg9xDCtFBRtkCXKOI1tlaw": {
    "date": "4/18/2013",
    "text": "I've never been a sushi person...  Luckily, I've been challenging myself to try new things and I have happened upon some of the best tasting things ever... Case in point, the Twins roll at Bonsai...   Shrimp tempura inside topped with shrimp and fresh mango finished off with a refreshingly light pineapple aioli... Did that sound mindblowingly delectable?  Because it was...  With the sriracha and soy sauce sidecars?  I was incredibly impressed... All of the ingredients were light and fresh... I'm going to Captain Obvious it right now and say that wasabi was blazing hot... I loved it!    I'm not sure how pricing goes because as I said, I'm not up on the cuisine, but $9 for this roll seemed fair... I was full, but not sluggish and that's the best way to finish a meal when you have things to do afterward...  The boyfriend's not really into sushi either... I think I'm going to take him here for his first time, too... Because, confession, I might be a sushi person after all... I definitely know I'm at least a Bonsai person...",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "ttZSRwCZiFMXwUO2Vr9pBg"
  },
  "XF5h2adXRDtte9uyD6X_lA": {
    "date": "10/13/2015",
    "text": "So I found this place within the seventh street market in uptown while venturing out, I will say that this place is surrounded by tons of competition but surprisingly for someone who's not crazy about sushi I throughly enjoyed my spicy crab and spicy tuna roll. The price was what really got me....for $10 bucks you get a heck of a lot of above average sushi. I would certainly recommend this place, however do keep in mind it's in open market so there is no chatting it up with your sushi maker lol.!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Uowi2_I5CTIXB-FHH7gVw"
  },
  "gU2usuBX6bTPIeM0czUC4Q": {
    "date": "4/11/2017",
    "text": "I love the food here!  I've been a few times and always have a great experience.  I usually get 2 rolls and have one with meat and one with veggies only (Pretty in Pink is my favorite!).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QdsSGFxPPlbFwEbiMoGl3g"
  },
  "GOQnJfTKeN1BPOWvTySsLw": {
    "date": "4/12/2015",
    "text": "The sushi was good and there are some good vegetarian options that were fun to try.  The problem was the waiting! When I got to the stand, it was awkward because no one greeted me for over five minutes and a couple was sitting right in front of the register.  When my friend joined me, he was surprised I wasn't already waiting for my food.  When I did order, I thought the rolls would take maybe ten minutes to make.  There hadn't been anyone in front of me and the chef was talking to the couple at the counter who were eating.  Another guy kept assuring me it would be \"just a minute\", but over 15 minutes came and went.  Finally, they suggested I have a seat and they would bring it to me.  I pointed to a table outside and told them I would be there, which both staff acknowledged.  I waited forever outside too.  I finally went back in to cancel my order and the guy handed me a to-go bag and was like, \" oh we couldn't find you.\"  2 rolls took about 40 minutes to finally get to me.  Won't be returning.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_H2upTwnMntssc2fAzRV8Q"
  },
  "287eFrlWqtL4ig70ru4rVA": {
    "date": "2/19/2017",
    "text": "Fresh sushi.  I had the sushi burrito which I customized and they were not the least happy about all the changes but it was delicious.  The person who took my order later came and said they were working on a sushi burrito menu.   For now they only have the one option.     I look forward to hearing there again.   It was worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "flZsGIiuhIvV3jOXFUMcBg"
  },
  "ueQz0U_RjLeoKnJo0-JwFQ": {
    "date": "8/13/2015",
    "text": "Great food, awesome people. Don't let the \"little stand\" foolyou. The food is delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0rQMPo9q9g90cXS0QqhWWw",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0rQMPo9q9g90cXS0QqhWWw/o.jpg"
      },
      {
        "img_id": "JH162ZIzc9KXsDsjTSIuIQ",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JH162ZIzc9KXsDsjTSIuIQ/o.jpg"
      }
    ],
    "user_id": "iSiFB8DEYPkppAY7WQ1sNQ"
  },
  "G-ut2_wT4VA4WTzy5Y5CDA": {
    "date": "9/21/2012",
    "text": "For as much time as I spend in 7th Street Market, Bonsai was next on my list to check off. I'm a sucker for sushi and really love a good fresh roll made with local products.   These guys are a small setup, right next to Tasty Yo, in the market with an easily readable menu. Not too short and not too long. They have all of your favorites -- California, Spicy Tuna, veggie and so on. I really dig that they have lunch specials. Sometimes I'm in the mood for old reliable, but there are times I'm looking to be blown away by something I've never had before. That's what happened this week...  Two words: Sushi Burrito. Holy mess this thing is amazing. Spicy tuna, avocado, all of the regular sushi veg, rice, and a brilliant chipotle-honey sauce rolled up in a tortilla. Absolutely fantastic flavors. When I was in San Fran, there is a place that specializes in sushi burritos, and I wish I had a chance to try it. This totally satiated my hunger! Would love to see this on rice paper or a large nori wrapper instead of a flour tortilla. Maybe soon!   Prices are fair. Around $9 for lunch. Bonsai has totally won my trust and patronage. Can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8rRDQYvJYbcu5PYJ9v1zMQ",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Sushi burrito",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8rRDQYvJYbcu5PYJ9v1zMQ/o.jpg"
      }
    ],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "gTeib0rPAXbdO5VBIqyKPg": {
    "date": "9/20/2015",
    "text": "My husband and I moved to Charlotte recently from NYC and this is the only place we will go to for sushi. We have tried so many other sushi places in the area, but this little gem surpasses them all.  Nobu is quite a gifted food artist who is also down to earth and humble about his skills.  The food is amazingly fresh and prepared masterfully.  You will not be disappointed!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UgeQ4jZUvh8aknnOmvKRwg"
  },
  "pi3YgR28YqUmvqvTe-VF1g": {
    "date": "6/30/2015",
    "text": "Good value for sushi... I've had a sushi at a few different places around the country and this as good as any.  I'm not a Sushi expert but this place makes me happy for lunch.  Plus it's healthy right????? I come for lunch pretty often now.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5IMFlMJa8y5IVuXX-53nGw"
  },
  "Ulpnq1lJVW1RxHeX9IcTbw": {
    "date": "9/5/2012",
    "text": "While waiting on the Daily Show taping during DNC, my boyfriend & I were starving.  Enter 7th Street Market & Bonsai Fushion!  These guys used to provide the sushi at Dolce Vita in NoDa, so we know they're good!  Menu is solid, especially for it being somewhat a \"pop-up shop\" type set up.   They were very clean.  We went with the Avant Guard roll & Blue Velvet roll - SO good!  And yes, as others mentioned, they have specials & lunch specials, which make so much cost sense! They offer a variety of beverages from the drink cooler.  You can sit at their bar or sit at the tables within 7th Street Market.  Prices are reasonable & fall in line with what you'd expect from regular sushi restaurants.  Plus, if you're military, fire, police, B of A employee, or hospital employee, they give you 10% off with a valid ID.  The guys working are very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "exEElE4pG-ZwoCMwoYddeg"
  },
  "H5cUUeArziKU9G9InCgBfw": {
    "date": "7/3/2015",
    "text": "This is my favorite lunch stop after an Uptown run.  Nestled inside the 7th Street Public Market, this little stand is a delicious way to grab some high quality sushi and sit outside and watch the Lynx rail crowd come in and out.  Absolutely try the Sushi Burrito - they're freshly made as you order and combine great sushi, rice, wasabi, soy sauce, and crunchy lettuce into a hand held wrap.  Really unique and extremely good!  My other go-to is an order of tuna and salmon sashimi.  They always have high quality, nicely colored, and flavorful fish.   Very friendly staff - grab some Saki from Assorted Table (also inside the market) and sit at one of the five sushi barstools and watch them work their magic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1H9zrIinEOfsL3Vpie3PyQ"
  },
  "U0hAE1KBlQDe4c9w442D7w": {
    "date": "12/17/2013",
    "text": "These guys are great. They take a tremendous amount of pride in their work and their menu and strive to offer something unique to the Charlotte area. If there was ever a handcrafted sushi experience, this would be it. Very rarely do I order off the menu, I ask Nobu what's the freshest he has and tell him what I'm in the mood for. And he'll have something incredible rolled up in no time. I highly recommend that path vs. the path most traveled, aka, the menu. But, for the menu traveler, you'll find fun there, too. All the rolls are name after 80's movies!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8tTFcZVOk-MBWhQZz8J_pw",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Sunrise Roll. Spicy tuna with quail egg. Heavenly.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8tTFcZVOk-MBWhQZz8J_pw/o.jpg"
      }
    ],
    "user_id": "Grd_3yK9ycK-hBhymjgyeA"
  },
  "03kG2N7QMdwSRvNF9O3B0A": {
    "date": "11/6/2016",
    "text": "Had a lovely spur-of-the-moment late lunch at Bonsai today. I stopped in about halfway through a 10 mile bike ride. I ordered the Philly roll and added avocado for a $1 up-charge. NBD. I sat at the counter and my roll was ready pretty quickly. I watched them make it and I chatted with the chef - he was very friendly. I had low-sodium soy sauce for dipping, and they gave me a fork because I really struggle with chopsticks.   I'm pretty sure this place down BOGO rolls during M-F lunch... highly recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rmZ9gUyoGHYSsGkg5mzZHw"
  },
  "cPpQlJEgwqSaym6KbSs0Tg": {
    "date": "12/7/2017",
    "text": "Not sure who is rating this place.  It's a small sushi bar in the market.  Kind of cool.  My issue is with both the fish and rice.  Tons of rice under each piece of nigiri.  Way too much.  One of the few places I've been where the rice takes away from the taste of the fish. Bland.  Yellowtail was fishy. Salmon was decent.  Crab and eel good.  Can't comment on the rolls, since only had nigiri.  Staff was cool.  Just can't recommend.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "_AU7QGZMGBJdBdcdAxAi0Q"
  },
  "XDfyEOsof8jbEkO7CK_BBQ": {
    "date": "7/5/2017",
    "text": "This is a cute little sushi place inside the 7th street market. I heard that they started carrying poke bowl so I had to go check it out! Since it's inside 7th street market it's a bit difficult to find parking sometimes. Usually around lunch time there's more people there so there may not be any tables available.   I got the small salmon poke bowl which had salmon, mangos and avocados in it. It was really good! At first glance, I thought I wouldn't keep me full since it was so small but surprisingly it was just enough and not cause me to overeat.   Pros- Very flavorful. The salmon was fresh, mangos were sweet, and avocados were just ripe.   Cons- $8 for a small poke bowl is a bit expensive. The large is $14.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yt7HuJd5gQucGXQqPyyhRA",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Salmon poke bowl (small)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Yt7HuJd5gQucGXQqPyyhRA/o.jpg"
      },
      {
        "img_id": "z2y6bP70BNRzn2fBGb3dRg",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Salmon poke bowl (small)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/z2y6bP70BNRzn2fBGb3dRg/o.jpg"
      }
    ],
    "user_id": "bWbwoUFKKgEIkMMjXxVrbg"
  },
  "pl1oKQLiFudccgKctYQLrw": {
    "date": "1/29/2017",
    "text": "Bonsai is a little sushi counter in 7th street that turns out some awesome sushi. One of the better 'bang for your buck' deals in the entire market has to be The Incredible Hulk roll - which is a sushi burrito. This thing is massive and only $10. Last time I was in 7th street my wife and I ended up splitting it as it is plenty for two. Pro tip - this thing is SPICY! I enjoy a little heat, but normally order without jalapenos to dial it down a bit.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tJVY7KznJz5wIXA-SN54Jg",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Incredible Hulk &amp;#34;roll&amp;#34;",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tJVY7KznJz5wIXA-SN54Jg/o.jpg"
      }
    ],
    "user_id": "nvHJFFr5R74ug5NOh2VDPg"
  },
  "4EbyZHE2hZRkvZK5PCFqKw": {
    "date": "12/4/2017",
    "text": "Yum! I ordered the tuna poke bowl when grabbing lunch with my siblings last week and I was not disappointed. Great mix of fish, veggies, and rice - and definitely more than enough for one person. My brother ordered two sushi rolls and was also very happy. I would eat here again in a heartbeat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "4yVDdFFcVAVf9RvfHkje5Q"
  },
  "7ugdOAys3RNN817jWhxpJA": {
    "date": "11/18/2017",
    "text": "This place always seems to be buzzing, which I do not understand after having tried it. Ignoring the opinion of a friend who mentioned this place was not good, I went to try out their poke bowl. I got the large salmon poke bowl, and for $15 I was thinking this may be a great deal. Now...if you've ever had a good poke bowl, I'm going to go ahead and say avoid this place at all costs.   When the bowl was handed to me, I was kind of shocked that they decided to pair mango with the salmon, on a bed of rice. It was as horrid as you may think it sounds. The combination was just not floating my taste buds. Eating each item in the bowl separately seemed to help a bit, but I have to note as well that the salmon was very subpar. I'm pretty sure I've had better salmon from the prepared sushi section in a grocery store. Anyways, maybe their sushi rolls or burritos are better, but I wouldn't spend money here again to try that theory out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "COe0w76Znl_TxcIZKkTKHw"
  },
  "wDge7hSwWVg20-cTNR_KNg": {
    "date": "4/3/2016",
    "text": "Been meaning to try this place for a while but the hours are so darn limited, not to mention impossible to actually figure out (both Yelp and Bonsai's own website list the wrong times). Anyway, I finally made it on Sunday afternoon.  To be honest, I was pretty disappointed with this place. I guess I just assumed that it being located within the public market would somehow make it special, but it failed to stand out from the crowd of uptown sushi places.  I ordered the Terminator Roll. It's not even listed on the website menu (which is True of a few of the other specialty rolls as well). If I recall correctly, it had shrimp tempura inside and spicy crab salad, fried shallots, and kabayaki sauce on top.  To be fair, my main complaint with this place was not the quality, but rather the price...After tax it came to almost $12 for 8 average-sized pieces. I just think there are much better options for $12. Having said all that, I'll probably cave and give it another shot one day.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1MbmNVsuIvIkUb1HuJ922Q",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Terminator Roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1MbmNVsuIvIkUb1HuJ922Q/o.jpg"
      }
    ],
    "user_id": "SjvZj-PpWRQr7TLKS7T1Rw"
  },
  "OEfmu5hM2ItDVbpNq5lKKw": {
    "date": "3/18/2018",
    "text": "Was in Charlotte for a convention over the weekend. Charlotte or \"uptown Charlotte\" does not have that many dining options like a normal city would. Most are either bars or \"high-end\" catering to the moneyed finance and banking industry folks.  Thus, it was nice to see the 7th St, Market, -- a food hall that Charlotte is trying to emulate from other cities. Again, much like Charlotte itself,not that many options -- mostly pizzas and pastas and bars. So, I was glad to see they have sushi palce! Sat down at the counter, and as soon as I sat down, guy with the bandana (pictured by one of the Yelpers here, Lauren S, and here's the link of that self-important and disdainful \"sushi chef\" <a href=\"https://www.yelp.com/biz_photos/bonsai-fusion-charlotte-2?select=upHktVLERX03noz7kV7slQ&reviewid=x4DxzRxSRHstMvGJE72_FQ\">yelp.com/biz_photos/bons...</a>) asked me, \"can I get you anything\" in a very threatening and unwelcoming voice. I just sat down, and is it okay to look a the menu first (up in the board above them), I say to him. So, he said go ahead! And when I ordered and he asked if there was anything else, I said no, nothing else as I was planning to get my drink somewhere else ( to which he murmured and mocked what I just said under his breath). When the sushi rolls were served to me by their server, a young bearded hipster who thinks he is the hippest and coolest person around, he looked me up and down, and just placed the rolls in front of me aggressively.  As for the sushi itself, nothing spectacular or ordinary even. It has the look of  sushi roll, but tasteless or flavorless. It's like a copy of what a sushi must be.   I must also add that while I was at the counter, they were making fun of the people in the Market (this was St. Patrick's Day) and they're saying that everyone thinks they're Irish or white on St. Patrick's Day when they are neither of those two.  I doubt that my review will make a difference and impact to this place, since this is only the affordable sushi option in uptown Charlotte, and must get packed during lunch hour for the green bankers, who think this is the best sushi one could have. The place reeks of arrogance, which understandable since they cater mostly to arrogant finance industry .",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "MfQmIz_QXVFAU5Gf-USs1A"
  },
  "R1qER5T_IOGeWnc0Yaoljg": {
    "date": "8/26/2017",
    "text": "Hours on yelp and website are wrong.  Drove into town from Monroe for this one, and the chef was flippant and rude.  \"We came here based on the hours on your website.\" \"That thing hasn't been updated for 3 years.\"  \"We went based on that, since the hours on yelp were 2 years old . . . And we assumed it (the website) was up to date, since you guys pay for it.\" \"Well that's too bad, we're closed.\"  Needless to say, we won't be coming here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "YDyrvTND9NxTJbMJVHVuiQ"
  },
  "UBTyaY70s3Zb_IqnusQVow": {
    "date": "3/16/2017",
    "text": "Sushi burrito amazzzzing! Very filling, I forced my self to finish it as I wasn't going home to put it in the fridge but could def make 2 meals out of it! Would love to see other flavors of the sushi burrito in the future!  Only thing they have odd hours one time I tried to go and they said they were open til 7 & it was well before 7 & and they were closing up shop me and another customer got turned down.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FhqgZHUjzV6x9uYNs05Q5A"
  },
  "WoDWFq3e5mEaMzD5TF6CXQ": {
    "date": "8/15/2017",
    "text": "7th Street Market has so many great food options it is hard to choose one. I decided to get lunch from here for me and my son. We loved it. His tuna avocado roll was delicious and full of tuna. The avocado was very fresh and he loved it. I had a sushi burrito. It was awesome! The fish was very fresh and had a great combination of textures and flavors. Service was also very good. I would eat here again on my next trip to the Market.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9Iy269paaYw9KrNoUvRPVw"
  },
  "7JpgNLPH459jgEnoa8rK1A": {
    "date": "8/18/2015",
    "text": "I came here for lunch during the work week last week. Bonsai is located inside of 7th Street Market. Haven't been to 7th Street Market yet??....put down your computer and go, like, now!  I decided to order the sushi burrito. After I ordered, they gave me a card to put on the table I was sitting at so that they can bring it out to me when it was ready. Took about 10 minutes or so, which was very quick.  The sushi burrito was in a spinach wrap and had spicy tuna, edamame hummus, lettuce, msc veggies, rice, some kind of sauce, and jalapenos. Great size portion and very filling. Next time, I am ordering sans jalapeno because that thing was spicy!! This burrito was so tasty and I thought the spicy tuna in it was very fresh tasting. Definitely will be ordering again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Lg2s7uycaCeQHusyR4i6qQ",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. The Incredible Hulk!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Lg2s7uycaCeQHusyR4i6qQ/o.jpg"
      }
    ],
    "user_id": "Hw5riZfnB-B7G79vBTOssA"
  },
  "gZGE-tu8CmbGvOIeaaiR_A": {
    "date": "3/6/2018",
    "text": "Just yum! Everything here is so good and the portions are a perfect size. Great lunch spot choice with quick service.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VWb7P7Fa71mONKHkH-xjjQ"
  },
  "pXGjJjHi90B9uVo3WK0jVQ": {
    "date": "8/17/2017",
    "text": "Excellent! The menu offerings are very creative and they have the freshest fish I've ever had in Charlotte. I highly recommend Bonsai.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bGzErBHfaDmoqkuv0ZiAPg",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. The Chow Chow sushi burrito was delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bGzErBHfaDmoqkuv0ZiAPg/o.jpg"
      }
    ],
    "user_id": "6WLP4E8Eiek2yjiApJN-Xg"
  },
  "vtF2FJnVbk2QQPBihY2A5Q": {
    "date": "7/12/2017",
    "text": "As it is located in the 7th Street market you can pretty much sit anywhere in the market place, outside, or just sit at the sushi bar. The salmon and tuna were fresh, the avocadoes and mangoes were just perfectly ripe.  Surprisingly, the sushi burrito was not wrapped in nori, but it was wrapped in spinach tortilla. The flavors work well, but I would still prefer the nori wrap over the tortilla. Also, I do think that the price for the poke bowls was a bit much.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LutWrXrun--zL0nHJnYaLg"
  },
  "9NkEtT5Ld2XoWdY1of35Sg": {
    "date": "7/2/2017",
    "text": "Great little spot for creative and fresh sushi, loves the poke bowl. Great seaweed salad too. Friendly and fast helps also!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kMbJZrGH6Lpg97rleWs7ZA",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kMbJZrGH6Lpg97rleWs7ZA/o.jpg"
      }
    ],
    "user_id": "zPrnD3FdU7zouX0JhJgOrg"
  },
  "E0lxwAWt69drCfxUcd3iJA": {
    "date": "6/1/2016",
    "text": "This place really hit the spot. I was actually trying to get here to try the sushi burrito for awhile and I ordered \"the Incredible Hulk\" when I was here a few days ago and then realized this was the place I bookmarked!   I got the \"sushi burrito\" and it was amazingly delicious and super filling. It had rice, tuna, avocado and a bunch of veggies in it along with jalapenos which I forgot about my first bite which turned out to be spicy! I definitely didn't finish it,so remember it's very filling!   All in all really delicious and super friendly service as long as it's not too busy in the market its decor let worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qanLmtME3Jn888y7QqM9Bg",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. The goonies roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qanLmtME3Jn888y7QqM9Bg/o.jpg"
      },
      {
        "img_id": "itsRCCW2pK3Vh1Lz5tdnOg",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. The Incredible Hulk. Sushi burrito!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/itsRCCW2pK3Vh1Lz5tdnOg/o.jpg"
      }
    ],
    "user_id": "OWAJHLaGTLJ0FSzenCrPwQ"
  },
  "dYChObds5u9e-XDJydVQKA": {
    "date": "7/8/2018",
    "text": "Had the large poke bowl and it was delicious.  It had a bright, citrus flavor and the yellowtail was very fresh.  We also had the sushi lunch, only down side was that it came with eel and shrimp.  Definitely would have preferred just fish, but both were typical sushi fare.  We'll definitely be back to try more!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r8eYO_Mk3POQMuO8F5c02A"
  },
  "66OivbhgNbvQv0-pciln9g": {
    "date": "3/28/2018",
    "text": "Always love this place! Great quality especially for the price, nice and casual, but choose wisely what time you go because it can get packed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mYSi6TCbumnu_VyBUo4FGA"
  },
  "ZZJ5bwQOaORGF1q-NCyBLg": {
    "date": "4/24/2018",
    "text": "Had tried this place a few times in the past, but food always seemed to take forever to come out - my coworkers were typically done eating their lunch before my sushi had even arrived.  Figured I'd give them another shot after a few months hiatus. Somehow the service got worse.  After 25 mins I checked to make sure my order wasn't lost in the shuffle.  This wasn't a particularly crowded day at 7th street.  After a few more minutes I asked to make my order to-go, as I needed to return to work.  Got a very rude and antagonistic response from two of the employees.  Will not be returning here.  There are several other establishments in 7th street market I would rather give my business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wj029j4JLxT9Fi3yLBOH4Q"
  },
  "TBwTsPvSAqhPZgn-g2wEeA": {
    "date": "7/1/2019",
    "text": "Here's the thing. I'm sure their sushi is good. But I can't get passed their sushi burritos to even try anything else. I. Am. Obsessed. I can't even think of going to 7th Street Market without having a sushi burrito. Even writing about it is making me hungry. My husband and I usually share the OG and the Everything Well Done and go halfsies. They are both utter perfection. The staff is always nice, and there is plenty of seating within the market. We usually grab a beer, wine, or kombucha from one of the other vendors and hang out at a table. I highly recommend making this a regular stop!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9AWSbPOdrFNpzZ--m1wlNQ"
  },
  "7horjLSEoz9ZgOwvb4xulA": {
    "date": "11/11/2018",
    "text": "This is a great lunch spot in 7th street market, where there are plenty of delicious options. The sushi fish is fresh, the service is quick, and it's a good value for the food you get (2 rolls for $10.50).   I have had their sushi burrito, and it's tasty, but I'm honeslty a huge fan of their rolls. They have some delicious speciality rolls (top gun roll) that are amazing combinations of fish and veggies. Their staple rolls are also delicious, and are good sized rolls. I use the spicy tuna roll as my judge for all sushi spots and I love that bonsai's is all chopped tuna with the perfect balance of heat and spice. It's not just a dollop of siracha (sp?) on some fish, but rather a blend of spice within the roll.   The hours are different than listed though, we went last week and they didn't open until 11:30, so just check before you venture over. But go early, because they do get busy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "otw1xVFzfzDrC4wOkSrxSA",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Two rolls: spicy tuna and California",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/otw1xVFzfzDrC4wOkSrxSA/o.jpg"
      }
    ],
    "user_id": "RBNPf_GF8dWlWPxWvkyJXw"
  },
  "fyTgBBscf98-41aMwxLyoQ": {
    "date": "8/18/2018",
    "text": "Being a sushi fan, trying a sushi burrito had been on my list for a while. This is the only place in Charlotte I know of that makes sushi burritos. This is one of many great options inside of 7th Street Public Market.   I got the Incredible Hulk burrito and boy was it good. It has a little kick to it from the jalapenos which was good. The fish was fresh tasting. It was a little messy to eat when you add soy sauce to the equation. It's a decent size, but I was still a little hungry when I got it for dinner.   You order and pay at the counter, take a number, and find a seat anywhere in the market. When your food is ready, they'll bring it out to you. I got mine pretty fast.   I've also heard really good things about their sushi and poke. I'll definitely be back here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rSOqB5AAMvOnoDg0yFJVLw",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Incredible Hulk sushi burrito",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rSOqB5AAMvOnoDg0yFJVLw/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "KnMS-GmCAv1Us21MIRSTWA": {
    "date": "8/3/2018",
    "text": "Great spot for a quick meal when you are uptown. Two words: Sushi Burrito. Just do it.   Bonzai offers a variety of sushi inspired dishes like poke and of course sushi rolls. My coworker wanted to go here for a sushi burrito which was something I hadn't tried yet. He didn't have to twist my arm, I was up for the culinary adventure. I got one that had spicy tuna and mayo. Most of them come with certain veggies like lettuce and I was weary of beets, but there wasn't a lot of it. Of course there's rice and your choice of spinach wrap or nori. I went for the spinach wrap.   When I got my burrito, I was impressed with the size. It was larger than I expected and had a good bit of tuna. The flavor was amazing. There's several sauces used and every bite was an adventure. There was crunch from the veggies that added great texture. I tasted a spicy mayo, cilantro and sweet sauce. I would definitely order again.   The only hiccup was that when it comes out, it's wrapped in foil and when it was sliced in half, I had to pick off some small bits of foil.   Bonsai Fusion is in 7th Street Public Market. During lunchtime, it's a bit crowded as multiple restaurants are there and everyone shares seating. If it's nice out, you can sit outside and watch people on the rail.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2hju15JgnycpEpJTLVYwBQ",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Sushi Burrito: The Hulk. It lives up to it&amp;#39;s name.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2hju15JgnycpEpJTLVYwBQ/o.jpg"
      },
      {
        "img_id": "b-W7lxeD0_0Dndijt9-faA",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Sushi burrito!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b-W7lxeD0_0Dndijt9-faA/o.jpg"
      }
    ],
    "user_id": "0cG35-H4SbjjTTSlNoK3fw"
  },
  "TnoPFJIl7lasmfiCoJKw9A": {
    "date": "4/27/2019",
    "text": "The \"Twin Roll\" has mango and pineapple included in a shrimp roll. It was sweet and savory. It didn't take very long for them to make and I enjoyed the taste of the roll. It was slightly expensive for the amount of sushi in the roll.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c_59SQTLTIuXkSANEGAPVA"
  },
  "_fY7nf8SWw5vAOR2ycVGmg": {
    "date": "4/20/2019",
    "text": "I am a sushi fan, however I didn't know sushi burritos existed. I love burritos and I love sushi, so when I saw this on the menu at 7th street market, I thought 'hot damn, I need to try THAT'.   I got the OG- the hulk burrito and my goodness, it was better than I could have expected. If you don't like heat, then I recommend getting it without the jalapenos, but I love a good kick in my mouth so I really enjoyed this. My boyfriend does NOT eat sushi, or fish, at all. He bravely took a bite of this, and to my surprise, he took 3 more bites after the initial, and said 'wow, this is actually really good'. So there it is, just do it. It will turn non sushi eaters into a believer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p2kJ06BpbxTyZEgrTDJ4jw",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. The hulk",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p2kJ06BpbxTyZEgrTDJ4jw/o.jpg"
      }
    ],
    "user_id": "7VuZiicBY7eBG-Osj5-iZg"
  },
  "xT2S9lO0pEZuoQwN5wK_6w": {
    "date": "6/20/2019",
    "text": "I was disappointed by my experience here. I grabbed lunch to take back to work at around 1pm. I ordered the tuna poke bowl to go, along with a seaweed salad. When I got back to my desk I noticed that my bowl didn't contain any avocado, nor any green onion as advertised. Not sure if they ran out of avocado or what, but I am now eating a very sad bowl of green peppers and edamame with a few chunks of tuna thrown in. The seaweed salad, however, was delicious. I'd probably choose Pokeatery next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CvHS9Q93eD8HKcbj9FIvQg"
  },
  "9VEOXwCH71fyEu0v1MBi6w": {
    "date": "6/11/2019",
    "text": "The sushi burrito here is delicious. The fish tastes fresh, and it's a huge amount of food for the price (it lasts me two meals almost). There's this super spicy sauce that goes along with it--if you love heat, this sauce has got it. I can't wait to be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uhH5SkUQR0QGMTknKvcDVg"
  },
  "ywVetHLSFOOPF8K8aNcv-g": {
    "date": "5/24/2019",
    "text": "Skip the burritos (wraps).  Paid $11 for a tasteless pile of crap.  Menu made it sound good but it wasn't as described.  No sauce even though it was supposed to have it.  Of the 10 items listed as being inside the wrap, it was missing 6 of them.  Seriously the worst thing I've eaten in months.  I threw it in the trash.  Should have asked for my money back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Cp6MX8pn9MzsD559QpVfA"
  },
  "aRx5nuJk4K7uRaT52HLWBw": {
    "date": "4/9/2018",
    "text": "From all of the sushi places that I have tried in Charlotte, Bonsai Fusion is hands down my favorite!! I highly suggest ordering the \"Top Gun\" which consists of a spicy tuna roll topped with tuna, salmon yellowtail and avocado.  I have also tried to salmon & avocado roll. The fish is so fresh and delicious! During lunch hours (11a-2:30p), they offer certain rolls at a special price of 2 for $10.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "39BUNKwo6INJvYNsLT8Vag",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Top Gun roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/39BUNKwo6INJvYNsLT8Vag/o.jpg"
      }
    ],
    "user_id": "ePHT83jEzKzip0lcQV_54Q"
  },
  "liTGkmyFJj9E0lxPz8V35g": {
    "date": "8/20/2017",
    "text": "I've had this spot bookmarked and was excited to try it on a recent Saturday afternoon. There was no line so I was able to walk right up and order. Not seeing a roll on the menu I wanted, I asked if I could build my own. A nice young lady took my order - a shrimp tempura roll with avocado and cucumber, topped with salmon, eel sauce and spicy mayo. Once she wrote it down, she talked in a huddle (no lie) with the three other employees about what to charge me. They settled on $13, which seemed kinda steep to me but I had high hopes.   I had a seat and after a few minutes, my roll was brought out. I was underwhelmed just looking at it. The presentation wasn't great and it seemed kinda small. Also, half of the pieces had salmon on top and have had avocado. The taste of the roll wasn't memorable.   I wasn't blown away by the taste, the presentation or the price. I don't see myself going back here. I can go to cowfish or eez and pay $13 for a roll that is tastier and an overall better value.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rFyK5YJjT1BpYN7ubrXBLQ",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Random Roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rFyK5YJjT1BpYN7ubrXBLQ/o.jpg"
      }
    ],
    "user_id": "QGKOTCbS-gpAMWPADGmf0w"
  },
  "mY9DvO00bQMCGmlnzdy8Dg": {
    "date": "7/17/2017",
    "text": "I was recommended to check this place out as the GF had a craving for some sushi burrito/poke. So, Bonsai Fusion it was, and on top of that I thought there was going to be free parking so we got there roughly around 10. Surprisingly, when everything opened up (and Bonsai opened up at 11) I found out that the parking is only good for 90 minutes. You're probably wondering where to scan it. It's actually part of the bakery restaurant. You go up there scan it and it says validated. OKAY... to Bonsai!  So I ordered two things. A small tuna/salmon Poke and a sushi burrito. I believe this sushi burrito included spicy salmon and tuna. Anyways, they were great. I thought both were fresh and it  was filling.  The burrito was wrapped in a spinach tortilla which to me was interesting. It was different as my previous experience it was wrapped in nori. I'm thinking it's wrapped this way so it doesn't get soggy. Makes sense. Even if it id get soggy I think I would have still preferred the nori.  Soy sauce was offered, but I found that I didn't really need it with the burrito and I was quite satisfied that eating it by itself was worth it.   The seating around this place are plentiful, but if you want to sit at the bar there's a very limited amount of seating. Definitely a place that is an in and out. I think it works as a take out spot and should be on your list if you're a sushi/burrito/poke lover. I know there are new places opening up in Charlotte soon, but this will be a good comparison to start off on.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "VtFAo8NgoEUHNKE_6-T9-w",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Tuna Salmon Poké",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VtFAo8NgoEUHNKE_6-T9-w/o.jpg"
      },
      {
        "img_id": "qO37bypHG1A2zpjXIlSb-g",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Sushi Burrito",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qO37bypHG1A2zpjXIlSb-g/o.jpg"
      }
    ],
    "user_id": "j9Z1dcoZrwn8Ul9JTnjjug"
  },
  "pHyyqVM0V2FxGKT5oeidHg": {
    "date": "12/26/2018",
    "text": "Bonsai Fusion is the reason I became a regular at Seventh Street Market. They have got the best sushi in Charlotte. A sushi roll or two from here is perfect for a quick bite, the staff is friendly and super fast and accommodating every time I stop by. I usually order their super fresh and skillfully prepared avocado cucumber roll, it's a steal for $5.50 a roll and is just enough food to fill me up. Parking at the Market is easy validated when you purchase your food and it's right off the highway so it is a must try in uptown, super convenient.  Edit the young black dude who always wears a hat is the only bad thing about this place. He has zero customer service skills, is rude and yells crazy loud across the building in front of customers",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9p8F6h0pYNZrtJ_fR4aUA"
  },
  "x4DxzRxSRHstMvGJE72_FQ": {
    "date": "3/10/2018",
    "text": "We came to 7th Street market just to look around and decided on some sushi. This was a great find for specialty sushi! We had the Die Hard Roll (specialty spicy tuna) and the Twins Roll (specialty shrimp tempura) and both were great. Glad we tried it.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "upHktVLERX03noz7kV7slQ",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/upHktVLERX03noz7kV7slQ/o.jpg"
      }
    ],
    "user_id": "2NKOI38yFcoAWkDEBZDq1w"
  },
  "TPvVEHgt1F4iyHftZhKDwg": {
    "date": "8/13/2017",
    "text": "This was my second time at Bonsai Fusion and today I went after church. I love going to 7th street market because there is always something for everyone. Today, I wanted sushi.   I wanted to try something different than the standard roll so I tried the salmon poke bowl that comes with salmon, avocado, and mango on a bed of rice. Don't let the mango make you think twice about this dish as it is a complement to the other flavors. I will definitely try the tuna poke next time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IQEZ-EMXaSClU5OHrakc7A",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IQEZ-EMXaSClU5OHrakc7A/o.jpg"
      }
    ],
    "user_id": "qTOPqeg6jkBHqpcLG3JpSw"
  },
  "85vO8A8KWOLt_9jjH_VQVQ": {
    "date": "7/9/2017",
    "text": "Husband and I were craving sushi after a hard workout at Dowd.  We found Bonsai Fusion on Yelp and decided to give it a try.  It's located in the 7th street market.  There is a parking deck connected to it and they validate parking for 90 minutes.  We order the OG Hulk burrito and the ET roll with two drinks.  There was only one sushi chef working so it took a while to get our food.  They were really polite and told us they were short staffed today.  The burrito was AMAZING.  We will definitely be back for another one to have individually.  The portion was big and it was very flavorful.  The ET roll was amazing as well but was a very very small portion compared to other sushi places we go to.  Next time we come we will each get the burrito and bring our own waters in or grab a beer from another shop in the market.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IcaHId9cnYtL5jPH6lmxgA",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. OG hulk sushi burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IcaHId9cnYtL5jPH6lmxgA/o.jpg"
      },
      {
        "img_id": "_NnAiOWgi2-CiOt-CwGXTw",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. ET roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_NnAiOWgi2-CiOt-CwGXTw/o.jpg"
      }
    ],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "Hhg0UnRccJruzsc_nRr-vQ": {
    "date": "7/30/2018",
    "text": "I'm obviously obsessed with sushi, considering I just about eaten at every sushi restaurant in Charlotte. Bonsai is in a very convenient location, the quality of the fish is okay, the flavor is where it lacks to me. I give them 3 stars because they are fast and a great location if you work in Uptown. I definitely don't go outta my way to eat here, it's a little pricy for me given the flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dXSlQyPCWrGEZJyhN2Hn-g"
  },
  "ggdsj88mb0w1LchivdVH3g": {
    "date": "3/29/2017",
    "text": "I trekked over to 7th Street Market on a Tuesday just before noon to try the sushi burrito at Bonsai Fusion that I've read so much about.  Just before noon, there were only 2 people ahead of me waiting for food and tables available inside.  By 12:15, it had gotten quite a bit busier.    I ordered my sushi burrito and took a seat.  It was delivered to my table in about 10 minutes with a scoop of wasabi and some pickled ginger.  This \"burrito\" was delicious.  It was packed full of tuna and veggies - the flavors blended nicely and the wasabi and soy sauce complemented the giant sushi roll well.  It was more than enough for a meal - I left feeling quite full.  Overall, wonderful experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "smKCewAgQEfYYaYy4FoErw",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Sushi burrito!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/smKCewAgQEfYYaYy4FoErw/o.jpg"
      }
    ],
    "user_id": "P0g72ss7P25E4A1Sb-LT_A"
  },
  "5hX2hragHD850NGAneGpdw": {
    "date": "10/2/2016",
    "text": "Does anyone else have a hard time choosing where to eat when visiting 7th Street? I mean, I will literally walk in circles around the market two or three times, hemming and hawing. #firstworldproblems   More often than not, I land at Bonsai for their wonderful sushi. (That is, when I don't get a crepe. Or, a pizza. Or, a grilled cheese. See what I mean? Lunch time decisions are hard!) Anywho, when Bonsai is your choice, you can't really go wrong with anything on their menu. All of the speciality rolls are great, albeit just a dollar or two over priced. I have dreams about that sushi burrito. The seaweed salad is delicious. Their lunch special (two rolls for $9.00) is great.   Bonsai is a wonderful addition to the cool, vibrant 7th Street Market!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TqQMM2xgkoNHfq3O3Ss7Xg",
        "caption": "Photo of Bonsai Fusion - Charlotte, NC, United States. Top Gun roll and seaweed salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TqQMM2xgkoNHfq3O3Ss7Xg/o.jpg"
      }
    ],
    "user_id": "eVxYV4jI-618bnRCDniowQ"
  },
  "QqJUetAQ9fyoMzPe791NYw": {
    "date": "4/9/2018",
    "text": "I have such a hard time choosing what to eat at 7th street but tend to go for the the sushi burrito from Bonsai!  One of the first (or maybe the first) in the city to roll with this trend and I am a fan!  It's a lot of food - like a traditional sushi roll but twice the size and then wrapped in a tortilla.  So good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vRMlt2TBsH5_efNSJLGD7w"
  }
}