{
  "4hqQFtGhl1VhL6fhsjpXqw": {
    "date": "8/7/2018",
    "text": "So first time ever trying it . Order apps with some friends . It came out and I was okay (fried calamari) . Waited for my 22 oz steak ($45 plus bone marrow butter $3) and added auto crab cake. So i asked for medium. And received a steak and it was like well done . Kept on cutting it and still too cook. Everyone else steak was good except mines . Waiter came back . (She was new ;Elizabeth was the name ) ask if it's okay . I didn't want to complain  because I felt bad . But she called her manager. He was why . I told him it was over cooked. So after the meal . He told me he comp the steak and a few of my drinks . Lol ($30 comp for food error ) I didn't ask for a comp. or a comp on my drinks as what he told me . But I thought it's funny you should just comp the steak instead of my liquor . I can pay for my own drinks and food. Like they can't beat the cooked steak of : Beef and bottle Oak steakhouse  Ruth Chris  Del frisco. Sorry guys about complaining . $275+and up bill and gratuity . It's not worth it here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JivfTZ65UanWqhYwiIII_g"
  },
  "blhIF69F2xaGfYVzN15Bhw": {
    "date": "7/27/2017",
    "text": "Let's set of by saying you may need a hard hat, parking is some what limited durning the construction,it's going to be great when complex is finished, I will start of the restaurant bartenders are great, very polite and knowledgeable of the beverage and food selection, then we go downhill with that, the spice shrimp app, it's brought out in a hot ass metal skillet and you're told not to touch it  but you're instic is to move it, how you can reach it and  eat,  a thought, tie something around one handle, just saying, I could have bounced the shrimp of the floor they were so over cooked and the soggie bread in the middle made no sense, how won'ts to eat that, unless it's in French Onion soup and even then it has some texture left, the flavor of the beurre blanc was ok, but nothing to crazy, I do think a little more tweaking and they will have things in place, so until next visit",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "anxFpWvWPcL9YWKtZAgDtw",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Spice Shrimp App",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/anxFpWvWPcL9YWKtZAgDtw/o.jpg"
      }
    ],
    "user_id": "Z8sNz_pHjV1opvI9H1tfQQ"
  },
  "WjUFwpczH4jYuj6E7Io1Aw": {
    "date": "7/22/2017",
    "text": "The Porter's House is in a lovely shopping center that is still being finished.  I might add the architecture to this place is simply breath taking, I feel like one of the junior architects must be a brilliant guy.  Maybe his name is Chris, perhaps we play golf together.  Let's get into The Porter's House.  The Porter's House is tucked away towards the back of the shopping center, so its a nice little stroll from the parking lot.  There were plenty of points where we felt vulnerable to attack from ninjas or thieving pirates, but thankfully we survived without incident.  We were at the Porter's House for Restaurant Week, so we didn't dip down into the depths of their menu.  It looks well structured, full of goodies, and if I win the lottery we'll be back again soon.  I have kids to pay for, so it might be a while to save up for their college and a quality dinner like this.  They handed us an iPad of beer, wine and cocktails.  The hostess informed us that any wine bottle over $50 was 20% off.  Lady, you didn't see me park my car cuz we walked over here, but I drive a 2006 Chevy Cobalt, I don't get a bottle that doesn't say Barefoot or Charlie Shaw on it. The beer menu was stocked full of great bottles.  This is a beer drinkers menu.  They have Gose, sours and all that other garbage your hipster cousin blogs about.  My wife ordered some fancy drink, maybe a Margarita, I didn't catch the name, because I was soon licking the sexy deliciousness of my Westbrook Siberian Black Magic Panther (Imperial stout) from my mustache.  I drank my beer and stared into the beautiful brown eyes of my wife, when a bearded gentlemen approached to refresh our waters.  He inquired how I liked the Westbrook Stout, I told him I had died and gone to heaven, which was disappointing because where was my Dad?  He made a recommendation that I should try the Prairie Artisan Ales \"BOMB!\"  I mentioned I hadn't yet, so he had our waitress drop off a small glass to try.  I like my beer like I like my women, dark and heavy.  This stout was delicious and with a coffee and chocolate flavor, but the chile peppers burned in my mouth long after I finished the glass.  It was a good beer to try, but since I was already in a wild affair with my Westbrook I didn't order a full glass.  Fun fact, the bearded man didn't come back to the table to ask how it was. If he had and it may have escalated into a full blown beer convo, he'd find out I'm a faker, where all my Untapped reviews say....Mmm its good. I can drink beer, but can't talk about it.  For my appetizer I ordered the bacon which was different then I imagined.  It came in three thick chunks with some relish.  When you combined the relish and bacon into one delicious bite, it was an orgasm of flavor that would make a nun blush.  My wife's shrimp cocktail was good, but I didn't need a change of pants.  We each got the Steak au Poivre.  They were cooked perfectly, the presentation was like art, with an appropriate helping of mash potatoes and the green veggie that makes your pee smell weird.  My wife's cut was different than mine we thought, mine was tall and thick, hers was wide and short.  Both were the same amount and cooked to the desired temperature.  Mine to medium, light pink in the middle, my wife's medium done.  Personally, I think well done is in bad taste.  It sits there burnt waiting to be smothered in ketchup by some mouth breather, like the president of the United States.    We finished our meal off with desert; my wife getting the most delicious piece of carrot cake. I was only offered one bite of.  I couldn't unload my apple pie enough, as I hoped my wife would feel bad and maybe goes halfsies.  But when you are indulging in a carrot cake like that, wedding vows are on the back burner.   I walked to the find the men's room so that I could weep bitterly that I had chosen the apple pie, and immediately the staff saw that I was walking around lost and were quick to give me direction to the men's room.  Now if I were to tell you the highlight of the visit was the lavender soap in the men's room, that would be a lie, but to say its on my top 3 favorite things about this place is more accurate.  I debated taking a soldier's bath so I could rub down my entire body in that sweet smelling deliciousness, hoping it would share the smell with my sheets tonight, but I was afraid someone may walk in.    As I walked out of the men's room I noticed the bar was stacked full of discarded wives enjoying hand crafted cocktails and chatting with their girlfriends, while their husbands were enjoying dinner uptown with their mistresses. If you are a divorce lawyer or a young man looking to score a cougar to party with while the kids are at school this is the joint.  We walked outside of the restaurant and found the sidewalk crowded with people who had valeted their vehicles, because waking 100 yds. at night to their Range Rovers is not nearly as fun as waiting 30 minutes.",
    "rating": 5,
    "rated": {
      "funny": 12,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "EWqprVqPER91tM1-bb12bQ"
  },
  "NM7p37GXZ0r_6f6soMtjIg": {
    "date": "8/10/2017",
    "text": "Really appreciate the staff's effort to make it a great experience. Really caring individuals!   Unfortunately, objectively considering food and wine, would be hesitant to recommend.  Wine by the glass was lacking and overpriced. Would suggest adding a solid Chard, Pinot Gris at reasonable price point.  Scallop appetizer was full of flavor and cooked great. Calamari app was heavily breaded and thick.Salmon was nice but overdone-crispy edges.   Again, staff really seems to care. But, huge gap in delivery of timely service (3 hr meal for dinner) and quality of dishes given price point. Additionally, the noise is quite loud inside and seating a bit awkward.   Look forward to this place improving and changing my impression from tonight to one of complete favor! It has a lot going for it!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "1y-g8qFIGc6NZUfIwgKQ3g"
  },
  "vVUtpEQ_3jx2YXFlQvLGJA": {
    "date": "11/26/2017",
    "text": "Hands down has the best bar in South Charlotte. We have quickly become regulars for both the drinks and food and it never disappoints. Staff treats their repeat customers like royalty and makes it any easy choice when we can't make up our minds on where to eat. Go see Marty at the bar, he has infinite knowledge about bourbons and wine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gkDtzZch1YyUlWkrKoeeZw"
  },
  "hGmR4AT-hU9_19MWvpFSxA": {
    "date": "10/26/2017",
    "text": "My husband's coworker suggested this place for our anniversary dinner last night.  It was beyond amazing!  Everything was perfect - from the friendly valet (made suggestions and even remembered it was our anniversary when we left), to the hostess, busboy, our great server, and of course the food.  The steak was so perfect all the way through I thought it had been sous vide.  The wine selections were varied and interesting.  The bourbon and bacon onions left me drooling.  We had a great time, and our server even brought us a complimentary after dinner drink and cheesecake to go - without even knowing it was our anniversary!  Will absolutely recommend to others and will be back.  Thanks for a great dinner, one of the best we've had in this area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "glO0jsX_ujpkjUGnZmomAA"
  },
  "MDflRjzWqF9odUlXbmaE7w": {
    "date": "10/21/2017",
    "text": "Beautiful shopping center location is very nice kind of hidden in back of shopping centers what they offer valet you walk and restaurant very beautiful modern",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y87tYtJCYS_gxGuGjHqzAQ"
  },
  "MIDuk71ginkY0iH3NTOuLw": {
    "date": "6/25/2018",
    "text": "We came to Porters House for our anniversary. It was not a busy night but our waiter, Scott, was beyond attentive. He had a great finesse of not wanting to bother us to making sure we had all we needed. The food was great as we had the shrimp appetizer and both had some serious beef dishes for our entrees. The way we were treated will keep me as a life long customer of this place. I cannot say too many positive things. If you have a chance to celebrate a special event or just a night out, with or without kids, this is the place. Ask for Scott. He will ensure your experience is excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sNVxI28VQoWNdZafmFytag"
  },
  "tJ7A-tMQmgLMjVroXFpfzg": {
    "date": "11/13/2017",
    "text": "I wouldn't recommend this restaurant to anyone.  The steak was tough, service only adequate.  Our server had a VERY loud voice as though we couldn't hear although we were the ONLY people in the dining room.  The music was fine for a teenager but certainly not acceptable for a quite evening out when one would like to carry on an adult conversation.  We ordered the filet but it was more of a marinated sirloin.  We had to send one back because it was blood rare after ordering medium rare.  I was expecting something comparable to The Capital Grille but it was more  like Outback - actually not as good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I3zpJHvI1knb8oVxvc7DTw"
  },
  "sg74Oc3FYVvFPOfoFf6jIg": {
    "date": "3/16/2017",
    "text": "Absolutely beautiful space with antique wood floors. Amazing craft cocktails! My favorite so far with a house-made pistachio syrup. A huge wine selection, good food and great homemade cheesecake. 24 hour applewood smoked slab bacon with an apple-fennel slaw: a truly satisfying elevated southern cuisine restaurant. They do prime steak and seafood equally well here. Can't go wrong with the veal chop or Halibut and has a plethora of sides to choose from.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hE6q4SX5YF_hf3qjnipviw",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. The beautiful bar area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hE6q4SX5YF_hf3qjnipviw/o.jpg"
      }
    ],
    "user_id": "kf6P6raMn4mpALVlH4RIHg"
  },
  "Hym4ZJOmiBzYLKOmnULvYw": {
    "date": "4/29/2017",
    "text": "Service was good. Food was NOT.  Theme of the day was SALT. Everything was over salted. Mashed potatoes were unedible.   $45 Ribeye would be more appropriately priced at $25.  Would not recommend.  Over priced and over salted.   Will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XM9h5KrXwiPxuOnTSluanQ"
  },
  "Ll2STewblB9WWZO4sEZ80A": {
    "date": "3/19/2017",
    "text": "At there last night. From the beginning the staff was arrogant and unwelcoming. The salmon was cooked well, however the vegetables were ice cold. My steak was tough and unseasoned. Having eaten at 3 of the top 5 steak houses in America, I was expecting more.   Worse yet, never was asked how the meal was by any staff. Never told thanks for coming, even upon leaving. The valet guy did ask about our experience. We said thanks for asking and shared that my steak had run the 5th race at aqueduct.   Porter's House has a very high opinion of themselves. In Texas they would say all hat, no cattle.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "k_4Shk3xJldw1K7v49aRGw"
  },
  "naiOn2cxs_cx99uS1Q3W_Q": {
    "date": "4/26/2017",
    "text": "Second time at this new \"modern\" chophouse since they opened in the beginning of March. Probably the best food in the past 2 years of doing once a week date nights. Apps, Mains, Sides and yes, the cheese cake! Phenomenal! Thanks to Eric, Scott, Ellis and staff...great job and looking forward to my next date night there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wwRRJNepJk74UFKbcCOMyQ"
  },
  "OhVXOz-Qty8Xe5oOpRIXlg": {
    "date": "10/21/2017",
    "text": "Went there last night for dinner. From the outside it looks great! Walked in and was sat right away which was nice, the staff was great but the food was very off. It felt like this place was trying to be too southern and a great example Is their lobster Mac and cheese! The sauce was made with what seemed to be the entire can of ol bay to the point that after our third bite we could not eat any more and the lobster looked as if the shell had been taken off but both of us ended up pulling shells out of our bites. The steak was ok, I guess they used a cast iron or something as there was a pretty deep crust on it.  Also was served with their own steak sauce (if you go to a steak house, you're not looking for a sauce)  after our main course we asked for coffee and the dessert menu, we received the coffee but no menu. After about half the cup we decided that it was time to go.   If you're looking for something different this might be the place but a steak house that can complete with Del Fresco or RC it's not",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fmJJzIlYpLMApCZsPyYsxQ"
  },
  "xjLk4f8-uIR01zs0Pge0RQ": {
    "date": "8/9/2017",
    "text": "My husband and I had been busy all week and wanted to go out for dinner on the last day of restaurant week. It was late and we decided to go to Porter House. What a great choice. We were one of two at the restaurant since it was late, however the staff was so pleasant and didn't make us feel rushed at all. The food was phenomenal and you have to try their dessert! The carrot cake is fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mDdX8zm9LUZVOrrtbMO0Mg"
  },
  "P6ouESjUBa_puD6hOJtR7Q": {
    "date": "3/19/2017",
    "text": "We made a reservation for 3/3 to celebrate a birthday.  Our first trip to Porters and our last.  This place cannot compare to Dressler's restaurant at Birkdale or Metropolitian!!  Promptly seated.  Two waitresses were assigned to care for our meal.  It was confusing one would show up and ask us something, the other shortly doing the same.  We ordered mussels for an app.  $12 for 6 mussels that were overcooked.  One ordered the yellowfin tuna, the other 6oz filet.  Both meats were delicious.  The beef is al la carte, pretty pricey for a piece of meat alone.  Ordered the Brussel sprouts with bacon.  While this is a portion enough for 2, the sprouts were almost burned, not charred.  We waited 5 minutes to get drinks, and 5 minutes to get our check back.  No one wished our birthday person, happy birthday.  While this lack of acknowledgement did not ruin the day, it was a little disappointing.  The parking or lack of spaces while all the construction is underway is a negative.  We are very disappointed.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GErTVRXn2vdh2Lzryh3s0w"
  },
  "JWWSjXirRL4Pn-QuVxhZGw": {
    "date": "8/29/2017",
    "text": "Great menu and great food. Food was cooked perfectly and the seafood was fresh. Very good atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NBoAjuT4juzEeHIOEekBRA"
  },
  "anEtsnBxbuzxE_YE2xDMIQ": {
    "date": "6/26/2017",
    "text": "Spot on!  Meal was incredible from start to finish.  This is the best new restaurant to hit South Charlotte (or even Charlotte) in ages!  Had Tuna Poke, East Coast Shrimp (wow!!!!), 6oz Filet, KC Strip, mashed and gratin potatoes, Peas and Carrots, and Brussels.  A fabulous French Sauv Blanc and Prisoner Red.  The sauces and roast garlic were a brilliant add to the plate.  We were too stuffed for dessert!  It was delicious from start to finish.  Service by Courtney was awesome!  Can't wait to go back.  We are headed back this week for our anniversary!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7L3kFnsVoFLHrHl8dVAbBA"
  },
  "uUBC_j6Sysn5-IVPHodh_A": {
    "date": "3/27/2018",
    "text": "My wife and I decided to give The Porter's House a try for date night, let me start off by saying that the service and ambiance were on par with what I would expect from a higher end steakhouse.  The food however was not up to par in my opinion.  We ordered the 14 ounce ribeye, the whole Branzino fish, a side of brussels sprouts, and a side of mashed potatoes.  The steak was cooked to a medium rare like I ordered but it lacked much flavor, i've been to a ton of higher end steakhouses across the country and I can tell you that this steak ranks on the lower end of the totem pole.  The Branzino actually tasted pretty decent, but not at the level that I would expect at a higher end steakhouse, it was cooked with fennel and a variety of other herbs and accompanied by some greens and split grape tomatoes.  Both sides we got were also pretty mediocre, the brussels sprouts were cooked with bacon and a pickled red onion, but the texture was off, it tasted like they were blanched and just quickly pan fried but not cooked long enough in the pan to have that nice crispy texture that makes brussels sprouts so darn tasty.  The mashed potatoes were ok, I could tell that they were house made and not instant because of the chunks of potatoes in them so that's a plus, but overall the food didn't agree with my palette nor my wife's.  I prefer Flemings, Ruth's Chris, Del Friscos, or any of the other steakhouses with similar price points around town.  Total price of meal before tip was around $102",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7L0AzRHWW4lddy8MaSyaxA"
  },
  "QfPmAs-9WJojibST-PwfBA": {
    "date": "7/30/2017",
    "text": "So, I heard that the Porters house is part of the Dresslers restaurant family. Once inside- I am totally believing it! Interior, hostess stand, service, cocktails & food was exceptional!  Our server was Eli. Extremely knowledgeable and very helpful. We came in for Queens Feast 7/2017. Both craving a beer, we ended up ordering signature cocktails after Eli explained the craftsmanship involved.  Really a wonderful night out!  Quick service without feeling rushed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZTQy8j3-fBAAaG028ZmVig"
  },
  "VZe7TCpJjfQT-8mi2zds5w": {
    "date": "5/27/2018",
    "text": "From beginning to end, this restaurant has exceeded all of our expectations. We have dined there more than a dozen times and every time we go to The Porter's House , the  service is uncompromised. The staff is super friendly, well trained, and highly skilled in their craft In addition, my company has had corporate events arranged with precision    Best bets: East Coast Shrimp, Homemade Melted Pimento, Heart of Ribeye Au Poivre You must try the homemade cheesecake for dessert.  Their private Bourbon Room is an extra bonus for groups up to 6.   One of the 5 best restaurants in Charlotte",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IX--0riBDXqLxZzQcs-qTw"
  },
  "i6FX7a92EFxj7vYQ6Ip5GA": {
    "date": "11/25/2018",
    "text": "Two and a half stars is probably more accurate but I'll round it up..  Service was excellent.  We had the baked pimento cheese which was absolutely incredible.  The sides that we had were also pretty good (sweet potato souffle was great).  The steak, however - was not what I'd expect from a high end steakhouse.  It was cooked to the temp I ordered (medium rare), maybe slightly medium rare plus, but it was very tough.  Not a great cut of meat, not much flavor, but the price point does not reflect that.  Since this is a steakhouse first, I can't recommend it but I'd definitely get the baked pimento cheese again!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gyu-birU9vhnSkjl4xppYQ"
  },
  "iojsGvs2XCR_kf6Q-H3qDg": {
    "date": "5/12/2017",
    "text": "Never have I paid so much so eat such bland food. Scallops were greasy and bland. $85 porterhouse?  Bland, cold, and rare, not the medium we requested.  Brussel sprouts were limp and bland.  Fingerling potatoes were salted well but still not well seasoned. I feel like I was robbed.  I'd say something but we came in in our sweats looking practically homeless, I'm sure they would think we were just trying to get a free meal. Ah well, if these are the worst of my problems then I count myself lucky indeed.  Service was fine which is why I give it two stars, otherwise I'd go 1 because it was edible.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6O5Q0kyHUqcc_Vl2_uVCbw"
  },
  "qdzsGNwiGPXJNn83vRM_bA": {
    "date": "7/28/2018",
    "text": "Less than impressive for the price and not comparable to other steak houses. The food and atmosphere wasn't bad but just not impressive.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n7f9cvjQ5WxVeYG5MlOibg"
  },
  "EI0Q2dY2Sp12O_nyKS4IAg": {
    "date": "3/7/2017",
    "text": "3 stars and that was for the appetizers, which were really delicious. We were there with a large party and... so I can forgive some service hiccups. But not the eternal wait for food. And then after all that wait... I got a black plate with a lonely piece of meat and three sauces in those little metal ketchup cups. They say you eat with your eyes first and my eyes said W. T. F.",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F38OFtlwhMJC7SZMHwJEXA",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. My lonely little steak. On a cold black plate.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/F38OFtlwhMJC7SZMHwJEXA/o.jpg"
      }
    ],
    "user_id": "ddxkaHleFPC7RHJ3iEKbvA"
  },
  "I7nMukIRnM2aCskGvcmimw": {
    "date": "10/24/2018",
    "text": "The food was 4-star but the service and experience was underwhelming. First, the valet was too busy playing Fortnite to notice we pulled up on the side right next to the valet sign (not stand) or hear me when I tried to get his attention. His interaction with my husband was along the lines of \"I need the key.\" Hostess was friendly. Server never gave her name, was friendly and congratulated us on our anniversary but didn't interact beyond doing her job. The knives were so dull I could barely cut the pork chop.  The server brought us a complimentary dessert to celebrate the occasion, however, I'd mentioned ordering a dessert and would have preferred to pick what I wanted as the \"special\" dessert didn't impress me, so I left disappointed.  Might want to think about branding as the bag for leftovers was a plastic bag with \"Thank You\" on it, which about on par with inexpensive Chinese takeout. Nothing to impress potential diners.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9lS15AkdSN1dZcBE5I8ILw"
  },
  "rt13xAHWMvy7hi6l-K99Dw": {
    "date": "4/23/2017",
    "text": "Great Easter experience. Everything we order was delicious, from the calamari to the salads to the ribeye and shrimp and grits.  Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SxNfZP1qxPsSEXUo5k6hiA"
  },
  "r2Z0upShuVk9H2D8ja4YfA": {
    "date": "3/4/2017",
    "text": "This is newly opened and I'd like to chalk up last nights experience to them working out the kinks so to speak, but given the nature of the issues, I'm surprised of the type they were for a restaurant trying to establish itself in the high dollar price point group.   First,  the menu I had actually had a different printed price for the same item as another menu at the table.   Ok, easy fix.  Second, my friend was shocked  that  bread service is not free...yes, you must pay for bread up front.  We did order the bread and cheese fondue, but they bring you out a huge bowl of cheese but like only  5 small pieces of toasted sour dough baguettes.  Third, my 6 oz filet midnon was ok but for its price I've absolutely had better.   Ruths Chris is still my fav with its 500 degree plates.  My filet was ok taste wise but horrible temp wise, it was BARELY warm.  Fourth, my friend had the chicken which was 24 on his menu but 26 on mine, and it was an extremely small portion plus none of the vegetables that came with the chicken were cooked properly.  I tried a piece of the onions and it was raw/crunchy and burned to swallow as a result.  I did say though that the flavor was good.  My friend being a former restaurant manager was appalled.   He had no forgiveness for not knowing how to properly saute onions etc.  Same with the carrot, he could barely stab it with his fork.  Fifth and finally,  the presentation lacked; my filet came out on a big plate with a burnt  roasted half garlic bulb and 3 sauces.  Just would expect better given the price point.  Given how expensive this place is, I am not sure if we'll go again till I read some reviews that show improvement.   This side of town can use restaurants like this to provide upscale dining experiences without having to go to the Southpark area, and I hope they turn it around.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Iaq_OL1q7vbR2S8tvFP2CQ",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. 6oz filet mignon.  Ehh",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Iaq_OL1q7vbR2S8tvFP2CQ/o.jpg"
      },
      {
        "img_id": "X35ncnhFYgD2oTiv3_cvgg",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Wedge. It was decent. Not enough blue cheese crumbles  though.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/X35ncnhFYgD2oTiv3_cvgg/o.jpg"
      }
    ],
    "user_id": "P14bqC_Ynbp8O3tLePRKSw"
  },
  "f4Ju79_bDS8l215obPA32A": {
    "date": "3/16/2017",
    "text": "Meh. Expensive, food is good but much prefer Dresslers and Dogwood. Those are two of my favorites I'm town and Porters House is not quite there yet. Didn't enjoy the menu as much and was very expensive for what it is.  Thankfully Mom's cheesecake is just as good here as it is at the others.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ne8pJ3SlhQxLouq9IhVAg"
  },
  "jmZCmcp6vAyHfybbHFwo8A": {
    "date": "4/4/2018",
    "text": "Would absolutely recommend! Hands down the best salmon I've had in my life! The ambiance is great, the staff is extremely friendly, and THAT SALMON. delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "muwl4Wqi2IYn53R8DSW5wQ"
  },
  "By0hdB9nlQsYG1JIJXV1xw": {
    "date": "2/11/2018",
    "text": "Went here last night for a birthday dinner with my family. Food was fantastic, we start with tuna poke which was to die for, along with calamari and bread. Then our main meal were amazing. My ribeye was perfect, others got filets, fish and chicken, we had no complaints. Then we even had dessert which everyone seemed to like, I didn't try any because was full from dinner. The wait staff did an amazing job. We had a party of 12 and a child, food came out on time and no waiting to be sat. A great nice restaurant in Waverly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m9pWdDo2R_T-jVMYqYeKKA"
  },
  "9EDHbVOKJwCFph-coLwHkw": {
    "date": "3/12/2017",
    "text": "The service was wonderful and the food was excellent. We got the calamari as an appetizer and the sauce was delicious that was drizzled on top, nice and spicy. I also enjoyed that the calamari was not in ringlets, it was more elegant. The scallops were delicious as well.   For the entrees, we got chicken, halibut, salmon and tuna. All came out with a great presence and tasted delicious. The mashed potatoes were just as delicious as the other Dressler restaurants which meant a lot to me!   For dessert we got the peanut butter chocolate cheesecake and the creme brulee and both were to die for, very moist and great flavor. I'm very picky when it comes to creme brulee and this was very satisfactory.   Our server was great, very fun and welcoming! I will definitely be going back. There is also a room with an homage to bourbon and whiskey, having a husband from Kentucky, this was a big plus for me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MUxCILBVYxPqcf9L5TWYQQ",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Cousin&amp;#39;s halibut, she said the black rice was amazing!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MUxCILBVYxPqcf9L5TWYQQ/o.jpg"
      },
      {
        "img_id": "tVrMT_-0jYcDldU-kozl8g",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Blackened chicken, delicious! The mashed potatoes were great and the vegetables were cooked perfectly.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tVrMT_-0jYcDldU-kozl8g/o.jpg"
      }
    ],
    "user_id": "Vkn5-vlB89kNL59Y9cBC7w"
  },
  "SeVaVc0bcZoqjaCkaqGWHQ": {
    "date": "5/19/2017",
    "text": "We were a party of four. My fellow diners had the filet and enjoyed it. I ordered the mussels. The broth (the most important element of the dish) was so salty, I just sent it back. The Halibut was small and just ok. The rice which was touted in the description was mediocre. I think if you are into steaks, you would enjoy this place. It's a great looking restaurant with good service and good valet service. Oh did I mention ... I think it's way over priced. I doubt I shall return",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cTny8IX2tqRtolSRPBxG2A"
  },
  "Ek3olp5MXS8fvC30QLqMRw": {
    "date": "11/21/2017",
    "text": "We SO wanted to like this place because it's close to home, though will never visit this establishment again.  I should have known when it was so easy to get in on a Saturday night.  We heard mixed reviews and figured we would give it a try.  First I asked for a wine recommendation.  The waitress convinced me to try this wine with a hit of grapefruit.  Turns out it was a $12 wine cooler she brought out in a can.  That commenced my worry.  The apps were okay.  The bacon strip was all fat and undercooked, and the hushpuppies were decent.  Then the main course came.  Our steaks, ordered medium-rare were basically seared.  Very raw, but hey, we're okay with a little undercooked filet.  That is, until I bit into a huge piece of connective tissue that ultimately ran through my entire cut.  I told the waitress and she proceeded to tell us a story about how she accidentally cut connective tissue into many steaks at the restaurant.  Then walked away.  No offer to replace or accommodate.  My husbands steak was a decent cut, though seemed no better than what you would get in Harris Teeter.    The Lobster Mac N Cheese tasted like mustard and was a liquid consistency, and the sauteed spinach looked like it had been freeze dried.  I would be surprised if they put a touch of butter in there, it was so dry and tasteless. The potatoes au gratin were decent, though by that point I was so nauseated that I'm not sure I trusted my tastebuds!   A total waste of an anniversary night, a sitter, and too much $$$.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jtooop-HVdhwY6nld_Sqgg"
  },
  "56d1gxC8Srpe29QybgwDBg": {
    "date": "9/7/2018",
    "text": "Overpriced for very average food. I love Dresslers so had higher expectations. I even gave it a second chance with a different group. Everyone felt the same way- the taste of the food is very meh while the price is high. Unfortunately will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tug3GEOy6XwZ23M-xLW_7Q"
  },
  "6LXSucBrapsGjlxCRQKv7Q": {
    "date": "5/7/2017",
    "text": "The new Porter's House is lively and smartly decorated. The service was friendly and eager to help, sharing that on the recent weekends business had jumped dramatically.....The reason, the food was great! We had fried oysters and the grilled heirloom tomato salad to start. The oysters were amazingly sweet and the salad was tasty with a generous portion. We both had the 6oz filet that was perfectly cooked to medium rare, with the sides of Brussels and mushrooms. Delicious!  My only recommendation would be to top the Brussels with caramelized onions vs. pickled onion, but that's a minor point.  For desert, Mrs. Dressler's Oreo cookie cheesecake. The MOST amazing cheese cake we've ever had. So light and fluffy! We will be back soon! I'm sure it will be hard to get in once all the surrounding construction is complete.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MSpfugq2B6xBm4E6_3vkbg"
  },
  "mXvU8_iMTqPTULMipoGrog": {
    "date": "3/6/2018",
    "text": "Amazing atmosphere and the food was even better.  We came from Lake Norman and it was so worth the drive. We will definitely be going many times again in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mnKxGvYvY77FdIqXmLiuHw"
  },
  "wB-X-OOZ_qbJM8MWDk7rKw": {
    "date": "3/2/2018",
    "text": "The food was amazing. Just the right amount of char on the steaks, which are HUGE, and expertly cooked. The waitstaff is perfectly attentive while letting you enjoy your company.   The menu and the drink/wine list are equally impressive. I truly cannot say enough good things about our experience tonight.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "25Yb4jvrS_jImxRVASB-pg"
  },
  "ijpujCoshz1JEzcGJxeFKw": {
    "date": "1/19/2018",
    "text": "This is the perfect example to why I love restaurant week.  I would have never known anything about this restaurant. But I loved it! I had the wedge salad, heart of ribeye, and the apple cake. I loved everything! And the service was excellent as well! The steak was cooked perfect and the mashed potatoes were amazing! Would highly recommend The Porter's House!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DQm7jUd0HKefwY0ZlbdaKQ"
  },
  "FUT7sgW_mTZRnK3QKQVL_Q": {
    "date": "6/24/2018",
    "text": "Solid 4 if not 5, but brace for the cost. Server was great, food was really good, atmosphere solid, but price was high. The sausage plate was out of this world.  Filet cooked great. The duckling potatoes were phenomenal. Mom's cheesecake and fantastic coffee were absolutely the way to end the meal. Like I said, 5 star but for price. Wife and i split a filet with a lobster tail each, sausage plate, mushrooms and potatoes added coffee and dessert and it was around $165 without alcohol. Just thought that a little high. I would go again for a special meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zynfOy36AZ0WsoGUYAjQaA"
  },
  "60slsDxroqON2vX0u1AnRQ": {
    "date": "3/19/2017",
    "text": "We finally had the opportunity to visit late on a weeknight for dinner. My fiance and I had been very excited to check this place out. Being a new upscale restaurant in the Ballantyne area was pretty intriguing.   The bar menu had a good selection of wine and bourbon. I only ordered wine on this trip. But I would be very interested in trying out some of the craft cocktails.   The service here was good. Our server was able to offer suggestions on menu items and was able to give detailed descriptions for any items we had questions about. He was attentive and knowledgeable.   The letdown of the night was the actual food. I would not recommend any of the items we ordered. The lobster Mac and Cheese was not worth it. The side dish is typically a favorite, but I was disappointed. It was basically noodles with shredded cheese and lobster on top.    We both ordered steaks and they were over cooked. I ordered medium rare and it came out closer to medium well. Our server offered to remake the steak, but when the manager brought it back out it was still over cooked. At this point my fiance was already finished with his meal so I didn't bother to send mine back.  We spent $120 and I don't think it was worth it. I would not eat here again. However, I would probably come back to grab drinks on date night or with a group of friends. I enjoyed the atmosphere of the restaurant and bar area.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 11,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qqB9k3gx9_x8ZCW-0ptQ8g",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Lobster macaroni and cheese. Not worth the $15",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qqB9k3gx9_x8ZCW-0ptQ8g/o.jpg"
      },
      {
        "img_id": "mhuR_NXKxOPjY-Xtasv6dw",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Heart of Ribeye. Extremely over cooked.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mhuR_NXKxOPjY-Xtasv6dw/o.jpg"
      },
      {
        "img_id": "qpIA0feVjSpUSer17G_zOA",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Smokes Salmon appetizer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qpIA0feVjSpUSer17G_zOA/o.jpg"
      }
    ],
    "user_id": "etyGh4GyR-lzPuvjlHDkIw"
  },
  "qXMXHh4Fga-j9eU6zYEfCA": {
    "date": "3/17/2019",
    "text": "Mediocre. I make better steaks at home. Often go to the bar - getting tired of the same old limited menu. And do you think you could get some friendly bartenders!  A solemn bunch.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3vSeW0PLLryJb3n7CyVIhw"
  },
  "jg20PidKYN6544nc9CdwrA": {
    "date": "4/20/2018",
    "text": "The 36oz steak was absolutely the best cut, cooked to perfection and savory at every bite!  The Yukon Gold mashes potatoes were so soft and creamy with a hearty flavor.  The table side bread was like taking a bite into a cloud, and the drinks were heavily poured.  The creamed spinach was buttery, and had the perfect mixture of texture and taste!  To top it off the service was amazing and always on top of things!  The Mrs and I will be back for another date night for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B885KcTPLi3sn5cxZ0BEmA",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B885KcTPLi3sn5cxZ0BEmA/o.jpg"
      }
    ],
    "user_id": "SB2AJP8zKSRjUpS54-RZ-A"
  },
  "kunUZUODZ4dot7NyKE2sug": {
    "date": "3/21/2019",
    "text": "Our go to special occasion spot or weeknight take out treat! The food is always delicious and the staff incredibly accommodating. We highly recommend the pimento app or the beef brisket app. For main meal, you can't go wrong with any of the steaks or the sweet potato gnocchi. Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fuKQyWLwRTxasb-PtUJt8w"
  },
  "uI1OyvYG7PPKpcwpazEzHQ": {
    "date": "3/12/2017",
    "text": "One of my new favorite restaurants in Charlotte! The hubby and I stopped in on a Saturday around 430pm and sat at the bar. Service was very friendly and attentive. Being new to Charlotte it was nice chatting with other transplants in a warm establishment. The place feels like it should be in Uptown or South Park, nice to have an option close to home.  The cocktails were well crafted and the small plates were a great way to sample the menu.  Everything from the salad to the scallops were delicious. The crab cake was crab stuffed just like in Maryland and the shrimp was on point bathing in some tasty sauce. The pork spare ribs were yummy and the fried oysters were pretty good too. We'll definitely be back!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NNf2l0p67CYIrlag2TaeBg",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Sampling of small plates!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NNf2l0p67CYIrlag2TaeBg/o.jpg"
      }
    ],
    "user_id": "DNhXVl921KYzSEn8s1kMlQ"
  },
  "xzJwKo0xtsApOzo2BndayA": {
    "date": "5/18/2017",
    "text": "So excited to try this place! Planned a couples night out. First if you haven't been out to this area Waverly rises like a small city as you drive up. It's crazy big with lots of new.   The restaurant sits back a little and appeared to have plenty of parking but with construction just did valet as the weather was a little iffy.   Sat in the spacious bar area for a drink before sitting down. Big drink menu, all craft beers and nice wine list.   Sat down and ordered the seafood sampler which included tuna poke. My first time trying that and loved it.   3 of us shared the huge tableside sliced Porterhouse which came with sides. So beautifully grilled and tasty. Seasoned perfectly! Tried a new wine. Had very timely service and were well taken care of. Look forward to a quick return here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hVidDZUvOiy3xl0v3WKJlg"
  },
  "iyw0auXxSxeukhWQa8LPKQ": {
    "date": "8/15/2018",
    "text": "If you don't go see Jeff for the Jeff drink you are missing out. This place is incredible food wise, but the bar tenders are absolutely insane, especially Jeff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FN3O2f0EHMw25EBbnntdHg"
  },
  "rGfK_ZoMnnzPqzUV_ujtSQ": {
    "date": "7/27/2018",
    "text": "7/27/18  Had dinner here tonight 7 day of restaurant week so we understand if things are not perfect Courtney our servicer was excellent  Drinks also very good Salad off restaurant week menu very good Entrees off restaurant menu not so good We both had heart of rib eye We understand that for $35.00 we are not going to get great however neither one of us thought it was very good Manager cane to table to see how things were nice touch Had heard from friends that this place has lost some of it  Spark and now we think so also Sad because this was our 3rd time here and we like it Will give it some time to re-group and perhaps try it again  Had dinner here last night and it was EXCELLENT!!! Ordered off the restaurant week menu and was very very  good and nice choices  Had a Great bottle of wine and as a added value this restaurant even on restaurant week offered  20% off bottles of wine over $50.00 dollars very nice touch We had a Great waitress and I really feel bad I forgot her name but we sat at a table for 2 by the window and had a   5:00 seating I highly recommend this restaurant and will go back as often as I",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dq95ut3ReIzR_30YJxyXug"
  },
  "qj-4JT1SskJ1kvC6Nd_GCA": {
    "date": "7/9/2018",
    "text": "Great food, attentive service and good value. A nice, quiet and contemporary take on the steakhouse concept. Recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "djowg_djyJ37wiesacguEQ"
  },
  "54J5Jm4UqXgeWn729WfGOA": {
    "date": "1/12/2019",
    "text": "A wonderful experience.  The food was amazing.  Great service, and not too loud.  Very enjoyable and we will be back.  So nice to not have to drive to Southpark for steak anymore!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LjlzWs-Kg7N08yBwRgsxuw"
  },
  "b73LPl5OtxnAimDvfXqgpA": {
    "date": "1/6/2019",
    "text": "I booked this restaurant for my husband's birthday dinner. While the food was excellent, the service was definitely lacking. For a restaurant of this caliber, my expectations were definitely higher...prompt service, accommodating the table I had called ahead to request and maybe if I'm pushing it, a complimentary slice of cake for the birthday occasion we were there to celebrate. Unfortunately, we won't be in a hurry to go back. If we are going to splurge for a classy steak dinner out, we'll head to one of our tried and True places, that are exceptional in both food AND service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8zy99HmZ5Tww-3O--S_3hg"
  },
  "IzeiZ45OPgz_tFGe1J44Vw": {
    "date": "1/6/2019",
    "text": "I wanted to try something new in the area and was disappointed to say the least.  Our service was slow and I felt ignored and treated awkwardly.  The food was not worth the price.  If you want to pay $40 for a chard piece of meat this is your place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PFrn0UHk83D9lKDrVBRO-Q"
  },
  "byNn1PYm0dMGji6Ny67QnA": {
    "date": "5/2/2018",
    "text": "Had a birthday here at a nicely provided table in the back, it was very well done. Food was all wonderful, not a single person in our group of 12 had any complaints (zero!). Steaks cooked wonderfully, fish light & flaky, sides all fresh & delicious. Service wonderful as well, and atmosphere very inviting, clean & cozy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iux-cHe26NkIivUXfdHq_Q"
  },
  "Um2Hm-dV7767Ydr3AanXEw": {
    "date": "11/15/2018",
    "text": "The steak is good.  My favorite is the crab cakes.  Then potatoes are a great side.  The pimento cheese as an appetizer is always good.  Good selection of wine and liquor.  Great bartenders.  This place has a good vibe to it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "owJxLKSBm9SQAtjerMSxdQ"
  },
  "Lyiwnw6Xww4sP_pj38TtPg": {
    "date": "10/7/2017",
    "text": "What a nice find at the slowly-developing, overdue Waverly Place. Only in the bar area last night, so cannot speak much about the restaurant. Atmosphere: classy/casual, nice selection of TVs & music. Service: excellent, period. Every waiter/bartender I interacted with was very friendly, helpful, concerned, but allowed plenty of time/space for you. Food: only had two appetizers, but they were delicious: calamari and shrimp. Both had a nice bite with some spices, and the calamari was perfectly cooked/textured. I was very happy with the whole experience. Wish I could have sat outside because it looked very inviting as well. When this area is truly built-out, it is going to be a seriously \"happening\" place. Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VHq5-cn5VsyrVqg1czI5Aw"
  },
  "TX5QkKnYTraYL-p0N9LaVA": {
    "date": "8/30/2018",
    "text": "I'll start on a positive note- the service was wonderful, I wish I could remember our waitress' name as to recommend her if you do decide to dine here. Nothing was terrible, and I probably made a mistake by not ordering steak at a steakhouse- but when paying $30 for an entree, I'm going to have reasonably high expectations. Had my fish been $15 I probably wouldn't have commented on it, but at double that price I have to say it was sooooo underwhelming. I'm a salt fiend, love salty foods, but my fish was way too salty and had no citrus flavor as the menu had promised. Everything on the plate was very meh and I typically make better food at home. Don't come here with the expectation that it will be a divine experience- it will just be okay.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lExriEfwXBM-wjrDiBTgQA"
  },
  "eXj-rGCbw4LTV0FBvNqhTw": {
    "date": "9/17/2017",
    "text": "Today was the fifth time I have been to the Porter's House, but today was the first time I sat down for a full dinner. We normally go to the bar and hang out and enjoy the craft cocktails and the really reasonably priced wine list. Today my wife and I celebrated our wedding anniversary and enjoyed an outstanding dinner with our server Eli. He is a consummate professional with a lot of knowledge about the food, wine, and cocktails they specialize in.   In terms of a steakhouse, comparing to venues such as Ruth Chris, The Capital Grille, Morton's, or Sullivan's steakhouse, the quality of steak is on par or better, but the quality of the side dishes is far higher. Well thought dishes out with locally sourced ingredients.   The menu also goes far beyond steak.  While I haven't tried these tempting options yet , my future visits will be spent exploring these.    I'll be back often.  Thanks guys.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "nxMXBtYn_Cqy8nraaGaljA"
  },
  "wpN6rEeW7HC49lh2cBnMmw": {
    "date": "5/11/2018",
    "text": "Ate at the Porter's House this week for the first time.  Service was really good.    Some folks have commented on the cocktails being good and they definitely have a nice selection spirits, nice bar area.  I plan to make a stop soon just to sit at the bar and have a drink.    I ordered the Rare Rare Old Fashioned and I was a good drink.  Large wine selection for my wife.    We Started our meal with the shrimp cocktail (very good - nice horseradish cocktail sauce.  Shrimp could be a little bigger but overall a nice shrimp cocktail), and the scallop app (cooked really well with good crispy finish on the outside).    We split a Caesar salad, nice salad but just your standard Caesar.   Entries were the trout (nice quantity, cooked perfectly, lintels and green beans complimented the trout very well), and the small filet (cooked perfectly medium rare with good flavor).    Overall a nice solid place, some nice options on the menu that you don't see everyday.  Went on a Thursday evening and really enjoyed date night with my wife.  Background noise was light so we felt like we could talk and enjoy our time without feeling crowded.   Looking at other reviews some folks have said for the price they would rather go to Del Friscos - I eat at Del Frisco's from time to time and yes they are hard to beat but a night out at Porter's House is about half of what you would pay at Del Frisco's so for the money I think PH does a pretty good job and I'm not sure comparing the two is really a fair comparison.  Would go back to PH again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8fBBwgWk9hQHIKZ6-0FbWQ"
  },
  "X_wAMH1P6ccNUrPrQaZ7Ag": {
    "date": "6/4/2018",
    "text": "The cocktails are stellar, the food is usually on point, with a few lapses here and there. Every time I've been here, the service has been great! Top things to try: calamari, carpaccio, ribeye, brussels, duck fat fingerlings.  Usually sit at the bar, and the bartenders are always fantastic, and manage to appear right before you need them to. We had the small private room in the front on one occasion, and I would suggest with a party of 5 -6, definitely consider checking it out for an occasion that needs a lower volume level than the regular restaurant!   Overall, great experiences had here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gdO5ibUtVBXWXBzoSSKuyA"
  },
  "XhZQhbtNrDY5PxMKUbthHw": {
    "date": "5/27/2017",
    "text": "Food was very average. Starters on the small side. Porter house steak was cooked rare as requested but my wife's lamb was raw (not even rare or medium as requested) it was taken away for 20 mins and returned totally over done. No compensation was offered. The sides were poor - potato gratin barely cooked , spinach - don't know what to say. Save your money and go to Longhorn.  Porters needs to raise its game to be a \"high end\" restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "MujuNZnGOSXsWAsYebsCnA"
  },
  "MJFVwjk1BlYdc0tvJW64lA": {
    "date": "2/15/2019",
    "text": "Everyone likes this place around me, but three visits did not make me a fan. Kind of confused what people enjoy about it. Lots of better spots for steaks in CLT.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yhK03LAwo5pNZQJAWkAAog"
  },
  "U3mG121LiBlgsLAr8o4y6A": {
    "date": "6/21/2017",
    "text": "I can hardly wait until my next visit to this restaurant!  From the moment we walked through the door everyone had a pleasant smile on their faces and welcomed us warmly. We were promptly seated and taken to our table.  Our waiter was a delight and answered our questions graciously.   For an appetizer we had the calamari which was excellent!  I loved that it was flash fried and not deep-fried. I thoroughly enjoyed the spiciness of the sauce!  We also had the tuna which was delicious.   For my entree I had the 6 ounce filet medium rare, I rarely eat my steak prepared this way but it is what the waiter recommended and boy did he get it on point!  It was perfectly seared on all sides.  And as a dessert we shared the coconut cake.  I do not have much of a sweet tooth but it is worth trying and it was very good.  We both look forward to going back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zyZTvApCT4EqMODAUdggCw",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zyZTvApCT4EqMODAUdggCw/o.jpg"
      },
      {
        "img_id": "PNGogbQBKZsgBilGtWFD9A",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PNGogbQBKZsgBilGtWFD9A/o.jpg"
      }
    ],
    "user_id": "0sS21dFMpkgudgnAMfdOIQ"
  },
  "S4hTgZq4QQyv4Xtn0ie5Lg": {
    "date": "11/9/2017",
    "text": "Great Restaurant! One of the best steaks I've ever had. I celebrated my Father's 61st birthday here and he lives on the other side of town. It was worth the drive! We celebrated with a 36 oz. Definitely enough to feed three people but we had a full spread.   We loved that the steak came out and was carved in front. It was seared amazing and cooked medium.  It came with duck fat roasted potatoes and peppers. Both were really good. I've had better potatoes but the pickled peppers accompanying the pepper was everything. The shishito peppers and okra combo that came with the steak was a great surprise. Trying to replicate at home.   Lobster Mac and Cheese -  Good. Nice Flavor. Cheesy Enough but not enough lobster to warrant the lobster part.  Brussel Sprouts - Nice portion size! Wonderfully flavored and my favorite side I tried. Love the pickled onion with bacon as those did not last.   Apple Crisp - This was our desert option. Honestly it was good. I'm a fan of blueberries. But I am not sure of the \"crisp\" part of the name as it was soft.  Harvest Mule - Welp. I liked the Ginger beer. :) Too far off the mark.  Ambience and Vibe: Trendy vibe. The decor did not really stand out. I was not sure the vibe they were going for. It was priced appropriately for what you got. Dress nicely but not over the top.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "se9GEwb_Hq3Vuqc6G2XO3g",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Peppers and Okra - Unique and amazing",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/se9GEwb_Hq3Vuqc6G2XO3g/o.jpg"
      },
      {
        "img_id": "ZguFyNE79DgR3cDLPtAWjQ",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Chessy - Find the Lobster treasure hunt",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZguFyNE79DgR3cDLPtAWjQ/o.jpg"
      },
      {
        "img_id": "RlFJ6M6vAJq1DIbh0f4Paw",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Duck fat + pickled  peppers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RlFJ6M6vAJq1DIbh0f4Paw/o.jpg"
      }
    ],
    "user_id": "Eqasd-ntQh8nMjA4R2ZdZQ"
  },
  "oHc5hkRm4eQND4Y91hGzLA": {
    "date": "5/23/2017",
    "text": "Thanks to Charlotte Agenda, again, I anticipated the opening of The Porter's House and could not wait to take my parents to dinner here for their 50th birthday. Being that the area the restaurant is located is very new and still developing it took me a few trips around the parking lot to actually find the restaurant. Tip: go back towards the apartments that are located right behind the restaurant you will see the restaurant on the left.  I highly suggest valet parking due to the construction around the building and the lack of actual parking spaces right now. You will have to park on the side of the surrounding streets or park in the mail parking lot and walk back to the restaurant.   Walking into the restaurant the wait staff was extremely nice and welcoming. The decor and feel of the restaurant was very modern and gave me a cozy and warm feel that is great for small intimate dinners or date nights. We had reservations which we were able to make online but for a Friday night it restaurant was not packed or seemed to have a wait.   I gave my parents free reign to order whatever they liked for appetizers and dinner. So we started with the seared slab bacon and a wedge salad for appetizers. They were both amazing. I loved the slab bacon, think extra thick bacon but chewy and a hint of sweetness to it.   For entrees we all ordered our own entree and shared a few of the sides. Everything is a la carte. I ordered the 22oz Prime Porterhouse and my parents ordered the 14oz Prime Housecut Ribeye and the sauteed Grouper. For sides we ordered the Duck Fat Fried Fingerling-Pickled Peppers and  the Mushrooms. My steak was huge and took up most of my plate. I probably could've shared my steak with one of my parents but it definitely made for great left overs for the following 2 days. The steak was a great cut and quality of meat. It was seasoned well enough where I did not need a steak sauce. My parents both liked their entrees but we all agreed our favorite was the Duck fat fried Fingerling. The fried potatoes had a great twist with the pickled peppers.   Even though we did not have room for dessert, I was impressed that the desserts or hand made in house every day.   Overall, the experience was great! The service of our waitress was excellent, she was very prompt and knowledgeable of the menu and cuts of meat. The open kitchen was a nice view in the dimly lit restaurant and they have a great patio area to have drinks. I think the Porter House is a great option for special occasions or a nice date night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xQA0AQX2_quNugfKqPsRCA",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Sautéed mushrooms",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xQA0AQX2_quNugfKqPsRCA/o.jpg"
      },
      {
        "img_id": "Lj_CiOPf6Wms41npRhVg_Q",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Faroe Island Salmon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Lj_CiOPf6Wms41npRhVg_Q/o.jpg"
      },
      {
        "img_id": "xM0GekchhqTtK9iE3qGv6A",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. 10 oz heart of ribeye",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xM0GekchhqTtK9iE3qGv6A/o.jpg"
      }
    ],
    "user_id": "uaeU6FBaY5by7V1Cj_2RpQ"
  },
  "SXgyYyRmqSLZ2aweatKn8A": {
    "date": "7/29/2018",
    "text": "First time there. Atmosphere was nice, food was not as nice as expected. Don't order the seafood. I guess I was expecting something more like what I had when I lived in Wilmington. $50 could get you much more than what was brought out. Very disappointed in that dish. Was told it was portioned for 2 people. Appetizers and desert tasted good but again appetizers were pretty small portioned though that's to be expected. Scallops were amazing but only comes with 2... oysters and ribeye were mediocre. Wished the price better reflected the quality and taste -- especially the cold seafood. Service was ok ... not sure if the wait staff are all just miserable to be at work or if I was just imagining it ...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1kq_6Jmshp1bJ35FAVbjZA",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1kq_6Jmshp1bJ35FAVbjZA/o.jpg"
      },
      {
        "img_id": "NdZ9Ccg_RJNhSCmLV9sLtg",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NdZ9Ccg_RJNhSCmLV9sLtg/o.jpg"
      }
    ],
    "user_id": "PWD3_6ill8i22Q4rvSGFPg"
  },
  "B9ziRCLRse6prP81HG4Dww": {
    "date": "10/16/2017",
    "text": "This place was hyped in all of the local blogs and websites with pictures of the building site and development. It is part of the Dresslers group and I love Dresslers, both the mid-town and Birkdale locations so I was looking forward to this restaurant opening.   LOCATION It is what I consider the edge of South Charlotte and start of Weddington. Which is the land of McMansions and new money. It's located in a brand new shopping plaza so they had the room to build what they wanted. The restaurant is large inside with very high ceilings, but they cram you in too close to the next guest if you sit at the long banquette like we were at. I hated that. This is not NYC or London where space is at a super premium, this is the suburbs of Charlotte so there is NO excuse to sit people so close together at an expensive restaurant like this! We were right next to this group of four 50 year old ladies what were way too loud and wore too much perfume. It was like their big night out, their wine glasses were flowing, and they started to get obnoxious and distracting.(I blame in on the new money.)   MENU & FOOD It's pricey so bring $$. We looked at the menu online before we went and the prices in the restaurant were higher and 2 of the steak portions were smaller than the website. We both got a steak, 2 sides, and an appetizer and the food was decent but not outstanding (see pic). We didn't order a dessert but the server gave us a complementary piece of chocolate cake for the road made by Mrs Dressler. He had a bite later that night and actually said it wasn't good at all- very dry and he thought it tasted like a Drake's Cakes 80's devil dog. So good thing we didn't order it.  FINAL THOUGHTS This place could have been so much more and there are sooo many expensive steak places in Charlotte this one didn't make my top 5.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-UkB3Wga9SjQwQMa6_xDOQ",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Why is the garlic garnish half the size of the steak? Are you just trying to fill a plate?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-UkB3Wga9SjQwQMa6_xDOQ/o.jpg"
      }
    ],
    "user_id": "LcahV8saJd80ACayce9MLQ"
  },
  "QW6MbrDNWFjqptQMjhCHbA": {
    "date": "3/31/2018",
    "text": "Best cocktails in the area! Every drink they made was better than the last.. so I had 5 of the best drinks of my life. The food is amazing but very pricey, I recommend getting any steak medium rare.  Overall, a no question 5 star restaurant but be ready to spend $$$$.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fPJmLQyM_1o4x0XyVg7CEw",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fPJmLQyM_1o4x0XyVg7CEw/o.jpg"
      }
    ],
    "user_id": "rgiPHZo_gt39TOMfpDISbw"
  },
  "rEkOLgE5cRt_ydoYUT1sug": {
    "date": "6/7/2018",
    "text": "Don't sit outside until they make some improvements-it is only June here and the sun is too intense and sets right in your eyes. Two things are needed: ceiling fans and adjustable drop down shades.   Nice place-we sat outside so more casual but business casual us fine. Delicious steak, but don't disregard the fresh seafood or pasta dishes. The charcuterie board here is fabulous with both cheese, meat, bread, and honey, jam, and whole grain mustard.   Wine and beer selection is great but, they have a full bar. With some interesting drink offerings. They bring an iPad to the table so selection is easy.   Parking at Waverly is a nightmare so prepare to walk-they are located back by the Hilton.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3sY-Wj7CKDb9YjQm7LG5Ew"
  },
  "UZ7WAFMs5Dwcv_GTufi4YA": {
    "date": "12/22/2018",
    "text": "Not crazy about the ambiance inside this restaurant.... it's very loud.  The appetizers were good, the steak was good, and the side dishes were tasty.  For the price, I'd probably choose a different steak house, but I was not disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c4nbcHxN336P0pkTurjAnA"
  },
  "XysO6s81CG5yDzENw3NiIw": {
    "date": "4/15/2019",
    "text": "Family surprised me with a special dinner for just being me. We ordered the porterhouse for our table with Malbec wine.  The food was great and the service fantastic!!  Great experience all around.  Staff showed genuine care when explaining how the sides were prepared and was very attentive throughout the meal.  Will definitely come back,  try those REAL mashed potatoes - absolutely delicious",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ug6897-DQOWj7sG-iaM-MQ"
  },
  "fxmPDPhPfWcmukrNESJFEw": {
    "date": "10/27/2018",
    "text": "What a fantastic experience we had at The Porter's House. My wife and I went for our anniversary dinner this past Friday. I'd made reservations and mentioned the anniversary. They treated us like royalty! Everything we tried was fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "na1ZD7bFvAUHXiV61CrCDw"
  },
  "SFJfnsQlzWHiGrPmWNmb1A": {
    "date": "11/11/2018",
    "text": "Great atmosphere, great food, and great service. We drove from about an hour away after some holiday shopping and were more than impressed. I ordered the aged ribeye, my wife got a filet, both were perfectly prepared to our liking. My wife and I were thoroughly impressed with the creativity of the menu, those sides coupled with the steaks made for a perfect night. It's fun to run across people who love what they do, work hard, and put pride into their craft. Damien the Chef, and Chris our server were both awesome. We highly recommend and will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g-MiHEVvio5BsRvWrTbg9w"
  },
  "PmOJxJxgJP2NaoM5ArgYvw": {
    "date": "12/30/2018",
    "text": "Hands down definitely an amazing place and definitely a 5 star!  Took my team to eat here earlier this week and the service and food were superb!  Had the porter house stake and it was amazing!  Cooked perfectly to order, it was tasty, juicy and tender!  It was a mouthwatering experience not to mention the Mac and Lobster sides!  The one must have is the bread pudding desert, so make sure you leave room!  Others in my party had the Filet, Rib-eye and the KC strip all amazing from what I was told.   The service was amazing including our time at the Bar as we waited for others!   The Porter house is definitely a Gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lp35aAOT-xcQwNoQgE7NLA"
  },
  "CQuB0hafVzRs-dqV2lidQQ": {
    "date": "9/8/2018",
    "text": "Ate here last night for the second time to celebrate two family bdays.  The service is impeccable, and we have no complaints.  The charcuterie plate is our favorite starter that is sure to satisfy, having something for everyone, and could be a meal in itself for me.   The other starter we had was the scallops, which we agreed were the best we have ever had, anywhere!   The wedge salad was not traditional in appearance, and lacked the wedge part that I love so much.  My son and husband had the filet, which was very nicely done.  My complaint was with the scalloped potatoes, which were drowning in a strong garlic flavor.  This brings me to the last time we went, when the only complaint was our other side dish of lobster mac and cheese, which was also drowning in garlic.   Before we could look at a dessert menu, the servers brought out a creme brulee and cheesecake with candles that were complimentary-Im assuming since I wrote celebrating two bdays when I made the reservation on Open Table.  Nice touch! It's not cheap, but worth every nickel, and we all left  feeling very satiated.  We will be back again, because this is our new favorite restaurant for nights that casual dining just won't cut it. PS.  Dogs are not happy that no leftovers came home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pzINVggc6FpfnAgnYCdKgQ"
  },
  "vFwQCDob9HymelkjqPef0g": {
    "date": "11/12/2018",
    "text": "The greeting was fresh and the atmosphere was livelier than I expected. It was the perfect amount of energy and didn't distract from our quiet dinner.  Employees all appeared like they were having fun and we were treated very well.  The flavors were ridiculous! Best Branzino I've ever had!  No kidding I ate the lemons.  My friend got this New Zealand Venison with a hearty vegetable medley and butternut squash puree in this rustic modern presentation.  If that's not a culinary term, it should be! It was a great balance and my friend finished off all of the bread top clean the plate.   I just wish it was closer to Lake Norman. Thanks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5VHwvljRL3pYcaTuztAFHw"
  },
  "qzKBZJhi6CBp3197mRDXDA": {
    "date": "2/4/2018",
    "text": "Nothing wrong with anything we ordered but food was just good, service ok. They provide the wine list on an Ipad which I was reviewing when the waiter came over and told me not to look at the Ipad but look in the back of menu to order by the glass. He had no idea I was not going to order a bottle of nice wine.  I felt like had been scolded.   I did not order any wine after that.  We asked for salt since none was on the table.  He brought a small bowl of salt.  As soon as we used it he asked if he could take it away. The experience was disappointing.   I had hoped to have a good place nearby so I wouldn't have to go to South park area or uptown for a good meal, but Porter's House is not it for me. I will still be going to Del Frisco's or the Palm.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-8ZkRgBz-VySGmwvQoAINg"
  },
  "yPB-BmbdQcbKhaHIqbgoTg": {
    "date": "5/14/2017",
    "text": "Man, I really hate jumping right into a new restaurant with a 5-star review, but The Porter's House deserves it. Atmosphere, service, selection, and food were all on point. The only thing I can ding them on is parking since there's so much construction going on, BUT they have complimentary valet, so no ding!  The fella and I were looking to live it up, and this place didn't disappoint. We started with a glass of wine and a cocktail along with the East Coast Shrimp ($12), which was divine. Our waiter, Zack, was fantastic and gave us his honest opinion on everything, which always endears me to a waiter. When we narrowed it down to the calamari or the shrimp, he steered us toward the shrimp and brought out extra bread for dipping in the buerre blanc sauce. Mmmmm.   For dinner, we both got the 6 oz filet ($30). Both were cooked and seasoned perfectly and came with two sauces - maybe horseradish and some sort of red sauce that almost tasted like cocktail sauce. The steak didn't need it but it was nice to have some options. We split the Brussels sprouts ($8), which were shredded and came with pistachios, bacon, and red oinions - yum! We don't normally order dessert, but we were living it up, so the fella got a port - Taylor Fladgate 20 year for only $10 - and we split the special cheesecake of the night, Oreo. Deeeeelicious.  There literally wasn't one issue or dish that wasn't spectacular. The place was packed, so I definitely recommend a reservation, and if you order the porterhouse, they wheel it out and cut it right in front of you - dinner and a show! As far as dress code, it felt like a place where you'd be comfortable gettin' all fancy or going in shorts. The bar also looked super cool, so the next time we go, we'll go early to grab a drink there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "QmethzRyAvZXS9m1UNJpdw"
  },
  "K3yhNojx6mXCd3EHPkqKCg": {
    "date": "10/19/2018",
    "text": "Wow.  Service was outstanding and started with the valet.  Food was well worth the price and the drive.  Had the bacon appetizer and crab cakes. All around very nice evening and great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oPBIGhQMjH30gPmCztGm7g"
  },
  "mqwoJyosOlRssBfN7krp_w": {
    "date": "2/15/2019",
    "text": "I wanted love this place so bad from the reviews. The atmosphere of this place is great. It's very classy and the staff is so nice. I thought the food would be amazing for how much it costs and it was so bad! I was so sad about it! I ordered the heart of ribeye and asked for medium steak. My steak was so over cooked and there was no red in it at all. It was also very salty. I was so disappointed by it because it's a $35. My husband also got steak and had the same issue of it being so over cooked. There are so many other great places to get steak for a cheaper price and better tase. Probably won't go again to eat there and won't recommend.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8d19d98w2eo2G2vytLz1kw"
  },
  "v4iUpu_-tv-xiN9MSk_VTg": {
    "date": "1/16/2018",
    "text": "1. The location is great, I love the Waverly area.  2. We came here last weekend with 3 other couples to have drinks and some good food. The inside had great ambiance. The acoustics were good as well as it wasn't too loud.  3. The drinks were pretty good, my wife had the honey gin martini drink and it was solid. My first drink was the prisoners Manhattan, also the most expensive cocktail on the main menu (not the iPad), and I was extremely disappointed. I switched to the rare meets rare old fashioned and it was 10x better. I highly recommend it.  4. Appetizers were pretty decent. The pimento cheese was really good, and the calamari with the Asian chili glaze was good as well. Fried oysters were just ok in my opinion.   5. Entrees....this is where most of us were disappointed. I had the 9 oz filet and though it was cooked perfectly, it lacked flavor. This was the theme with everyone else's steaks as well. My wife switched it up and went with the maple salmon and enjoyed it. This is a steakhouse, and the steaks should definitely have been more flavorful.  6. Dessert... everyone likes to end their meal on a good note, and unfortunately we did not. The Oreo cheese cake tastes like it came out of a box. The creme brulee was plain, and had a Carmel flavor or something instead of the vanilla creme I prefer. I thought they could have done a better job on this as well.  7. I thought we had an overall average experience, though we had a good time, the food lacked. Our waiter was good, so I salute you for putting up with how loud we probably were lol.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mAJO8V4y7VFUEbKNP4jhBw"
  },
  "YWSvNPilL9QlEtFCVFj3-Q": {
    "date": "7/11/2019",
    "text": "Oh yeah, now this is what I'm talking about!  Excellent service.   A filet that cuts like BUTTER. Melt in your mouth good. Cooked to perfection. Absolutely incredible.   The shrimp appetizer was also delicious, and they had a good cab too.   The cheesecake is to die for. The owner's mom made the recipe. It's a HUGE slice. I could almost eat it all and so can you, trust me.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_oicwXdBKEE7vSfU5YV52A"
  },
  "YDkj9MCXT83gGx1DeaaRFw": {
    "date": "3/3/2019",
    "text": "I wanted to try The Porter's House ever since it opened but rarely dine out in that side of town. Last night was our visit and I now understand why the reviews are good and bad.   The Good: Service. Our server was fantastic. When dining out at a higher end restaurant, excellent service is important and they had that down.   The problem is everything else. The main dining room is loud, which can be a problem if you're a little hard of hearing (getting old stinks).  My steak was mostly fat and somehow thoroughly charred on the outside and grocery-store cool on the inside: definitely not medium rare. The manager offered to make another but I declined (a few other steaks at our table were undercooked and charred).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bdlFwefJOfC8xBiezIF4AQ"
  },
  "TpWUqi1PG-R10vVJvPAI2A": {
    "date": "7/7/2019",
    "text": "1) Food was great 2) Service was excellent -- Shout out to our waitress Angela  3) My cousin was turning four the next day and when we ordered dessert, she wasn't too thrilled with the choices. A waiter, Chris, asked her for her favorite dessert and she told him chocolate cake. That wasn't on the menu, but he left the restaurant to find it. He came back with a plate of little chocolate cupcakes. The smile on my cousin's face made the day for everyone at the table.  A very heartfelt thank you to Chris, Angela, and the staff at Porters House for turning a spur of the moment dinner reservation into an amazing experience.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yXS5KgIKb3wO2Cm-wPMNpg"
  },
  "SKG6ivCd0eoGgzVTN1C6Zg": {
    "date": "11/11/2018",
    "text": "First off let me say, I really like having a Great Steakhouse in South Charlotte. We were in need of more fine dining down our way. My Birthday dinner was my reason for coming last night. I had thought about it along time because I am normally a ethnic eater but I appreciate a good steak also.  A couple of new things I noticed, and this may be because of the new chef (they said started about three months ago). That was the last time I was there.  Silverware on the table. They used to have a salad fork and appetizer fork. Last night One HUGE Fork and a Butter knife. It was very hard to eat the appetizer we ordered with this huge fork. Our Appetizer was the Fried Oysters and Clams. It was supposed to be served with a Creme Fraiche and Chili Oil. It had a Ranch dressing poured all over it in a bowl. No Chili Oil or Creme Fraiche.  Not that good. not what I was expecting. We also had a order of the Scallops which had two nicely prepared scallops with a julienne slaw of some sort. They were good. We opted to go with Cocktails instead of Wine. We had a nice variety to pick from. Expensive though, 14 to 16 per cocktail. My husband ordered the special which was the Dry Aged Filet, 59.00 but it was served with mashed potatoes and 5 shrimp. He raved about it. I ordered the 22oz Porterhouse. It was so good with the extra Bone Marrow Butter. Melted in my mouth! The two things that were lacking were the head of roasted garlic and the Bearnaise sauce. Obviously I am a condiment person, but I had thought about the head of garlic for the last three months, and you have to have Bearnaise!  I do want to mention our waiter Tyler, who has worked for the Dresslers at their other restaurant. He was a great server, always on top of ever need we had. He was pleasant and very knowledgeable about everything on the menu. He also brought me a Cheer Wine Pound Cake with Ice Cream and Carmel sauce with a candle at the end of the meal.  The quality of the food is outstanding, am I a tiny bit picky, yes, but I want to say I will go back, but I hope they fix the silverware issue and the roasted garlic and Bearnaise sauce ! Ask for Tyler he is there on Sat and Sun!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YFHrehv9nlluLMmn7eUUqw"
  },
  "T3TF2R_UCCvx_zVXYUol9w": {
    "date": "6/15/2019",
    "text": "Porters has a new chef and they have a new menu that rocks! Grilled peaches was outstanding.  Lobster/crab cakes had a fantastic taste that had no fillers.  The pork belly was to die for.  Your missing out if you don't sit outside.  New drink menu is very creative.  These are the best bartenders in Charlotte hands down!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "q3vYtAWfVzIRDUw1F4OZoA"
  },
  "QWDM4OgHKkk5kOdveoX-NQ": {
    "date": "2/15/2019",
    "text": "Please read other reviews before you go.   First off, I want to say that the staff have been extremely helpful, nice, and welcoming. We arrived 15 minutes before our reservation and were seated right away (on a Friday night). I loved the general vibe and environment of this restaurant. I like the location as well. The tuna poke was an excellent appetizer.  I don't give negative reviews so this clearly was just a bad experience that others have expressed as well.  On to the main course, the steaks were unfortunately the worst part about the entire experience. You'd think that paying $40+ for a steak would be something better than if you would have went to somewhere cheaper like Outback, but no. Both my wife and I had overcooked steaks. I asked for a touch of pink, mine came back burned. My wife asked for medium- well, and her's came back as well done. Minor but definitely ruined the experience.   Overall, for the price that you're paying (ours was $125+tip for two people), it's not worth it for the food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kt7IL2ZfF3cKS8RuLXFqiA"
  },
  "6tOwo2rtwXBrYTOj6PjKeA": {
    "date": "5/19/2019",
    "text": "Lovely food and charcuterie board. Crab cake was great and a nice generous size. I loved the cocktail and espresso with lemon. I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nFrnCbcgKlsqWkTyVKEa9Q"
  },
  "rm_dPgBZOGu8l2V62GWvLg": {
    "date": "1/8/2018",
    "text": "In a somewhat impromptu invitation to a birthday dinner, little did I know I was about to have one of the best steakhouse experiences ever! I went in not knowing much at all about this rather new restaurant but it ended up being an awesome experience!  Arrived to a private dining room. We had a reservation for a party of 10 and didn't request it, but judging by how busy and loud the general dining area was, we were very pleased from the get go. Our waiter, Ton, was a delight from the start and was extremely informative and helpful with suggestions. I was impressed at how in-depth he got with the seafood selections and had input into everyone's choices. He even mentioned a rare allergy concern (that one member of our party actually had) before the fact, unbelievable service!  Appetizers were great and although the restaurant was at full capacity, the food was coming out at a very comfortable pace. The baked pimento cheese was the table favorite with a rich base and a thick, creamy texture. The tuna poke, although small, was one of my favorites of the night that featured pickled pineapple and a much less spicy version of the dish then what I've had in the past.  The entrees were the statement of the night as you would expect from a steakhouse. While most of course got steaks, I was more interested in the trout that Ton had talked me into over the salmon (besides, plenty of people to steal bites from!). I had a really disappointing Trout dish from a North Charlotte restaurant a couple of weeks ago and wanted to savor the delicate, balanced flavors coveted by fish-fanatics! Pleased to say I was more than content with my choice! Perfectly cooked and seasoned, not too oily, light-bodied, fresh trout that was finished with a brown butter sauce and served with green beans and lentils full of flavor in their own regard. Seriously, as good as the Trout was, it was paired with the perfect sides. I'm a fair-weather fan when it comes to lentils, but these were outstanding.  The couple of bites I stole from the ones who chose steaks were phenomenal. Oddly enough, the one person who got the filet thought the Heart of Ribeye was more tender. Sure enough, it was! One of our guests had gnocchi with her veal entree and thought it lacked flavor, and I agreed it was very under-seasoned, but since it wasn't my plate I am still in awe of the food I was served!  Can't say enough good things about Ton (Ironically he was a very skinny guy!). He made every frequent visit to our table a pleasure and is a True master of hospitality. I don't give out nearly as many 5 stars as some Yelp'ers and it usually involves something besides perfect food. This experience was top-notch because of the meal, but became a memorable night because of the service.  Thanks Ton for making my brother's birthday dinner the best it could be. Next time I make a reservation, we'll be requesting him by name!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "VYdxUc2IcSnO2O6ZPnyvOQ",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Oreo cheesecake!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VYdxUc2IcSnO2O6ZPnyvOQ/o.jpg"
      },
      {
        "img_id": "w9pmXtgV9uoMIcUX5r6Fqw",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Entrees",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/w9pmXtgV9uoMIcUX5r6Fqw/o.jpg"
      },
      {
        "img_id": "3IIFcld4PBQjwDsxB2-hSQ",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Fried oysters and baked pimento cheese.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3IIFcld4PBQjwDsxB2-hSQ/o.jpg"
      }
    ],
    "user_id": "dpzAqLprtex54rXlCU-OTA"
  },
  "PMBH-kZS6DLT6NFbGrjlZQ": {
    "date": "8/7/2018",
    "text": "We ate here while visiting our in laws last month,  and since it was our anniversary, we got a night out! We felt like kids in a candy store!  Starters- Charcuterie plate which was as assortment of cheeses, and italian meats. The  capicola was the best. I want to say nothing extra impressive, just regular charcuterie plate.    Drink- Signature special Larceny Whiskey. I'm totally a light weight and was getting tipsy from this one drink. Very strong for sure, but good! I can't for the life of me remember the other beers we had but they have a huge selection. The two we had reminded me of a Lambic or Framboise beer.   Main Course- Husband ordered the 60 day aged ribeye. Being totally honest, no way that steak was aged 60 days. I should have been able to cut it with a fork like butter. A little more chewy, and a bit overdone. This alone made it 4 stars.  I ordered the filet, and it was cooked perfect. Nothing much else to say, it was seasoned just as well, and accompanied with a suggested sauce by the waitress.   Lobster mac n cheese- not my favorite, but my husband ordered it. It's fancied up mac and cheese with lobster. I like both just not mixed, not my thing. It was however flavored right, and cooked right.   We've eaten plenty of steakhouses, and I'll say this one we'd definitely come back. The drinks, the ambiance, the attentive wait staff made out anniversary great. Give it a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "718BRV9AOYODz0yz_zcc8w"
  },
  "3K_5R9qNlGEh2sgYqzexAQ": {
    "date": "1/26/2019",
    "text": "The food was bad. Restaurant week menu (so obviously not top tier ingredients, fine with that), but the calamari was rubbery and cold, and the steak was fat. Dessert was good though.  Overall, a disappointment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oQOsm_ZgHuH7vNpD3SM4ng"
  },
  "OB5mpgpD26wB8YFb6uvJ7Q": {
    "date": "12/24/2018",
    "text": "I am rarely blown away by a fantastic steak and potatoes meal since I find it quite satisfying to cook this type of meal at home to absolute perfection. In fact, with the right (quality and fresh) ingredients, it's not particularly challenging to hit a home run with my tastebuds. But this meal was truly EXTRAORDINARY and that's why I'm taking the time to write this review here.   The only things I could imagine offering tips for improvement on would be to divide the dining room up to offer smaller (more quiet and intimate) spots for privacy and ambiance - and trying to relax the prices on the menu a bit as they seem aggressively high (but I'm no expert on the margins within fine dining, so that's just an observation from a focus group of one.)  From the scallops appetizer, to the mule-inspired, pear flavored cocktails in copper mugs, to the exceptionally delicious filet and Yukon mashed potatoes, and finally a creme brulee worth writing about - this entire meal was beyond compare and a True indulgence for this writer's palate. Well done Jon and Kim Dressler - Bravo!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "S4MGcHCRjOtJZoOCZCWxSQ"
  },
  "WCs8qFW40QL2llgsoXJ5NQ": {
    "date": "2/11/2019",
    "text": "We went to this restaurant during the Charlotte restaurant week. The menu is limited but it highlighted some of your items on the menu. I had the salmon and my wife had the steak. The dessert was ok. Overall this place was good but not great the service was good but the food was just above OK. Looking at the menu prices during a non-special week I don't think I would spend my money here",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC2sg6Z5nkaMeiKC6_5Hzw"
  },
  "bOpb41SG0cPdgu_CCu045g": {
    "date": "7/7/2019",
    "text": "I brought my family there for my husbands birthday. The valet parking was easy and free, the hostess was very nice and seated us right away. It's not inexpensive but that was expected. We had 3 different kinds of steak, all were delicious and cooked as ordered. The waiter was friendly but not too familiar, the sides were delicious and plentiful. We got 3, the mushrooms were delicious, the creamed spinach was excellent, not too creamy but the spinach did not overpower. The potatoes Au Gratin were Ok. The mashed potatoes and Frites were excellent. I had the swordfish which was fresh and light although I thought the yellow rice it came on was oily and I didn't care for it much as it was heavy. The dinner setting was beautiful with lovely Crystal water glasses that never were allowed to empty. Ever. We ordered the LAND appetizer which was excellent but it needed more bread as there were only 5 or 6 pieces for 5 of us and lots of wonderful things to try on that bread. I had the waiter pick a Chardonnay for me and it was excellent. We brought food home and the environmentally friendly boxes and the way they packed it was great, easy to reheat and it tasted even better the next day. The servers were very good, on top of it, but unobtrusive. No room for dessert which probably would have been excellent too. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vph1N9rtshKimGhRVvtXvQ"
  },
  "gr6S6gLpzzUuFaN0koqEMA": {
    "date": "7/4/2019",
    "text": "Surpassed all my expectations! Tuna poke snd beef carpaccio was out of this world amazing! And the portion was huge! Not many places on the east coast have fried white rice cake with tuna poke but porter house does, definitely a favorite. Filet was seasoned and cooked perfectly. Also mexican mule was delicious and had a generous tequila poor thank goodness.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BPtnPuHOrkEJBkqX7Ds0fg"
  },
  "mDoxEaGcFA7-9zWBUqeNMQ": {
    "date": "1/28/2019",
    "text": "I ate dinner here for the last night of restaurant week. I've never eaten here before so I find restaurant week to be the perfect time to try a new restaurant without breaking the bank for something potentially mediocre.   My ribeye was terrible. Half was over cooked and the other half was undercooked. I asked for medium. I told the waitress it was fine however she still informed the manager who insisted the kitchen prepare another steak. They boxed another meal for me to go. Here is my new \"medium\" ribeye which is even worse than the first one.   I would have given 1 star however my waitress was really nice and manager attempted to make things right however the kitchen unfortunately just did not deliver.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W_gVmxSDWHS255icux_Fvw",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Ribeye that&amp;#39;s &amp;#34;supposedly&amp;#34; cooked medium",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/W_gVmxSDWHS255icux_Fvw/o.jpg"
      }
    ],
    "user_id": "Eg4xer5tI3uHpK5mQ8eNiQ"
  },
  "4KPOBacUiWfFsaCqPuEFuw": {
    "date": "3/30/2019",
    "text": "Two out of three times I like to sit at the bar when I go to a steak house with my wife. And twice in my life when I ordered a refill on my drink they ran out of my scotch - Johnnie Walker Black - and both times it happened at Porter's House. Very Strange. Does management have a problem. They have valet parking which is needed in this shopping center and their flat breads are excellent as are their burgers and fries. Their chops and steaks are also good. The food is good and the valet parking is easy. Their dinning room is fine but I still prefer their bar especially when management is on the ball. I never heard of a bar running out of a liquor, after all that is their business.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cziRQQ6D7ogpL1gQWEbqRw"
  },
  "60PSG_nSKFK3hmV8nVliZA": {
    "date": "3/12/2019",
    "text": "The Steak and crab cakes were my favorite. All menu items are shareable. It is kind of pricey. Nice ambiance. Parking is available in the garage.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LBr6x8AUBYPibZ4TvBh0JA"
  },
  "t__H6Jau69KsmkfF6FA_1A": {
    "date": "9/6/2018",
    "text": "I dined here with 2 colleagues; I had the ribeye rare, and they both had filets to medium. Two of three steaks were cooked to our specifications, and one of the medium steaks needed a few extra minutes, but the server took care of it immediately and we were promptly served the re-fired filet in a timely fashion. (I love it when a restaurant takes care of small issues very quickly and without a fuss and that's exactly what happened here.)  Steak quality was excellent, as was the charcuterie board app & wine selection.   I highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cCPlhTkRJmFHL4GsljdBxA"
  },
  "WKIQe6RKPFNpRTsk_94Clg": {
    "date": "1/28/2018",
    "text": "I so enjoyed  restaurant week here five star plus :) We had a party of 7 for a birthday our table was great an waitress fantastic.  Sometime places wont do fantastic on Queensfeast but we loved the service an food cant wait to go back.  They offered Shrimp with cocktail sauce , maple bourbon bacon or a Wedge salad for the first course.  I choose the wedge salad with feta , bacon an grilled tomatoes . A light dressing it was not your normal wedge salad.  The bacon was slap your mama good lol A side of that every meal lol The shrimp huge an cocktail sauce not over powered by horseradish . The main course offered Salmon with risotto an sweet potatoes . The salmon was perfect flaky an risotto with the sweet potatoes a hint of sweet but perfect flavor.  The steak with mashed potatoes an green beans an a sauce sorta gravy style with peppercorns.  Amazing cooked perfect an my friends said the sauce was so good made you wanna take some bread an clean the plate lol Yes I know can could we eat more lol Desert a chocolate layered mouse cake or carrot cake or apple cake with carmel an ice cream.  The chocolate cake wow so good an im not a big mouse fan but it was good. The apple cake oh wow an it was served Hot even better. It was like a bundt cake lots of delish apples an caramel pieces an with a scoop of ice cream oh my :) we were all very impressed we will be back now I will tell you they have valet which is great because so many new places at Waverly we didnt know about the valet an there is a parking garage. If you looking for a different place to eat or just a fantastic steak you gotta try The porters house its 5 star all the way :) Did i mention their bread so good herbs an sea salt on top .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XZ5b0IrF1PQiv04lB0d61w",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States. Their amazing bread I could eat a whole basket of this lol",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XZ5b0IrF1PQiv04lB0d61w/o.jpg"
      }
    ],
    "user_id": "6owWBv_F8Tqti4zmnn2ymA"
  },
  "n5JPttUk8gczz1Fib9nBmg": {
    "date": "1/31/2018",
    "text": "Craft cocktails, amazing selection and rare offerings of top shelf and mid grade items are in abundance.  Jeff has tended me bar twice now and I've had excellent service and amazing drinks both times.  The drink menu is inventive and I'm dying to try the smoke infused options, the last time I had one of those was in Asheville and it didn't disappoint and is great for a show.  Last time I came I had a bourbon cocktail that had lavender, also had a generous slice of the best cheesecake of my life.  Like holy matrimony inducing, pledge my soul to the cheesecake (or its maker) for the fluffy twist on a cheesecake better than the original.  Tonight I'm doing the apps of the wagyu beef carpaccio or the baked pimento cheese.  I've heard they have some saffron floating around some of these dishes which I am excited for.  The bar is perfect for bringing the laptop(guilty of bringing home work), bringing the girlfriends or for a date night. Seriously wanting to come back for dinner though, this place smells amazing.  Also, thank you Jesus for the valet parking as it can be difficult to get a spot. I'll be back many times.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SahLGjEwxbagjXe06v6kXA"
  },
  "AC9uM0S3h-ltcdnPbXA-Zg": {
    "date": "7/22/2017",
    "text": "Chicken entree was good however the steak was very dissapointing.  Overcooked and small.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kzUXQmSjjqC4cryuiWFEEw"
  },
  "XqswcP4LLYk5GMU0x1Nbqg": {
    "date": "3/27/2017",
    "text": "We were excited to have an upscale option in the neighborhood, but expectations exceeded experience. We were a party of 2 on a Friday night and did not experience the crowded bar area or excessively noisy restaurant that others had indicated to us.  The beer, wine, and drink list was exceptional and the food offerings provide enough variety to satisfy a broad spectrum of customers, while sticking to the steak and seafood theme.  Execution was off though.  Heavy reliance on salt for everything that we ordered (mussels, salads, steak, and fish).  The mussels were a relatively small order and at least 2 of the 5 I had didn't taste fresh.  Fish and steak were cooked to desired temperature, but again, too salty.   The server indicated some steaks are prime , and some choice. I didn't ask why, but i find that to be a bit cheesy when a server has to explain that quality may not be consistent across all orders. Not sure if it is an attempt to keep prices down or some other factor. Overall, good experience and seems to be a great atmosphere, just need to up the execution a little bit in order to make this a True upscale option for the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l1m9hQHqdiWo-51znpnJMw"
  },
  "hfyxClSOnCql_sbXESGexQ": {
    "date": "3/19/2017",
    "text": "Second visit for this fan of Dresslers and Dogwood.  First visit was during their \"birth of a restaurant\" stage where the food was good, but during this visit on Thursday 3/17, I'd say they're hitting their stride.  Favorite apps were the Shrimp which had a welcomed hint of heat but the killer was the \"bacon\" which was more like a smoked pork belly brisket thickly sliced that was moist, tinder and full of flavor.  The girls ordered the Fillet and Tuna which were excellent as expected from their Dressler's experience but the surprise was the Veal Chop that i ordered, which i haven't had in several years - it was fantastic, excellent.  I even went to the food line and found Eddie who cooked it and complimented him on a great chop.  It was also presented well with a nice mushroom sauce and gnocchi.  We over ordered, including collards and golden beets, which were so good, we took them home with us.   To finish, as if we needed it, we split a piece of pie, yum.  BTW, the service was just as good as the food.  Jim did a great job of always being there while not being in the way of the dinner.  Jeff and guys at the bar mixed some tasty martini's and Old Fashions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bZfXmrgHdwrMhbJ-THf8cQ"
  },
  "yNHJu7sSsZZskVsTHQW4dA": {
    "date": "8/24/2017",
    "text": "Service is excellent. Steaks are phenomenal. Jocelyn, our server, was extremely knowledgeable. Great to have this caliber restaurant in our neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mSxdTDDge-5bHRCh8ZFLBw"
  },
  "rBQFyWmMvrjcp-Xm1xavjg": {
    "date": "7/31/2017",
    "text": "My wife and I recently tried The Porter's House for our anniversary.  The atmosphere was nice until the bar filled up with very loud clientele... it was about 7pm on a Saturday the bar became packed.  The bar is not isolated from main area of the restaurant so the sound easily spilled over into the dining area where one almost had to yell to communicate with others at the table.  Our scallop appetizer was not properly cooked but our steaks were excellent.  If you are looking to spend $200+ on a nice dinner but have the atmosphere of Bradshaw's on football Sunday then I would say this is your place.  By the way, I love a party... but not when you are seeking a high end, intimate dinner.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gg7XzusGRSpicKQ8jS5ZZA"
  },
  "H3QupntqVHMHqFvgsvbjmQ": {
    "date": "4/30/2017",
    "text": "Our first visit to this recent addition to the Dressler's line up.   Fantastic food, thorough wine/beer/bourbon menu, and great service!  We had the rib-eye and the prime rib. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dm1QRZvgpjh24blegQlvlA"
  },
  "Ok4KWp4H6VxG1AQzdnzj3w": {
    "date": "11/13/2017",
    "text": "As a big fan of the groups other restaurants and a few recommendations I was extremely excited to try The Porter's House. I don't know if it was the fact that we dined on a Sunday, but the restaurant was dead maybe 4 other diners...I thought that might have been a sign and unfortunately it was. Our waitress was very unsure of everything and could have passed for a temp. Didn't bring bread, kept telling us our food was coming and it never did, very slow on filing up drinks etc...I will start with the drinks- In my opinion when a $14+ cocktail is served in a nice steakhouse/restaurant/bar it should come out served with a large block of ice. Here the cocktail was served with regular ice chips overflowing from the glass and was already watering down my cocktail when it arrived. We ordered crab hushpuppies as an appetizer and when they finally arrived they were extremely burnt tasting/smelling. I would guess the oil was way too hot considering the outsides tasted like burn and the insides were not quite done. The wedge salads were next and were fine...nothing spectacular. The steaks were very well prepared, but again very underwhelming at this price point. The cut seemed like something I could have gotten at the local grocery story. The strip steak was over the top fatty throughout the whole  steak. I understand there should be marbling/fat in this steak, but this was hard to cut and chew fatty. The filet was again prepared well. If also felt that the steaks were very hard to eat and cut easily due to the weird bowl shape of the plates. I have never been served a steak in something that might be able to pass as a bowl. We skipped desert. Overall I was hoping for something a little more from The Porter's House...everything just seemed lazy or just going through the motions. If you are looking for a nice steak at this price point to continue driving to South Park.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LlqcRb7xHs1aD0a0ZP_Mmw"
  },
  "5F7-yXQcXGoGmnd3DYtpdQ": {
    "date": "8/25/2017",
    "text": "My brother and I decided to try The Porters House tonight. We arrived around 5:45 to find the bar with a few people, but only us and one other couple in the dining area. Prices were around what you would expect from Del Frisco's but service, quality and serving size were not anywhere close. Appetizer of Scallops, two for &15. We passed. We both got the nine ounce filet, $40 and sides are separate. Waitress said the sides served two, so we had potatoes that were about enough for one and about $11. Drinks come in very small glasses, that need to refilled constantly. But had to get the waitresses attention each time. You can view the kitchen from the dining area, numerous cooks and wait staff standing around and laughing while playing on their phones. Unprofessional for that type of restaurant. We also saw a few other families come in and got bread before their meals, I saw other reviews that people didn't receive any bread and we didn't have it offered to us. Salt and pepper isn't even on the table, must ask for it. Very nice inside, and sure they have a hefty lease. But lacking management in all areas for a high scale restaurant. Our bill was $120, and we would put the food quality under Firebirds. Really a bad experience for a new restaurant in a great location. They said they have been open since February, and have done no advertising. The only way you would find this is thru a search for restaurants in the location. Another management fault. I don't recommend but feel bad for who ever owns the restaurant as people don't mind paying a good price for a great meal, but you have to provide quality and service or you will fail.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LUdNAslEd59I_JdlGSaWFg"
  },
  "6JILDc-ryYTcoxBEGmvN4Q": {
    "date": "7/27/2017",
    "text": "When was the last time you visited a brand new restaurant and had such a phenomenal experience, you made reservations for the following night? Never, for me. However, my meal at The Porter's House (once I could find it in the new Waverly complex) was so outstanding that it felt like they'd been there for 20 years. Beautiful, calming decor; very intune with the rest of the complex, and most importantly not loud at all, although there was an active bar scene happening. Our waiter, Mitch, was adorable and accommodating. I always try to experience a new restaurant whenever Restaurant Week comes around, so I planned on ordering from the special Restaurant Week $35 menu which I did.  I am a wedge salad snob, and judge my meal based on that first course. It did not disappoint. Quite the opposite.  It was just the right amount of dressing, bacon and baby tomatoes. My main course of salmon and risotto was excellent as well.  My friend enjoyed the yellowfin tuna (very thinly sliced, rare) from the regular menu, and said it melted in her mouth like butter. The cream cheese frosted carrot cake, as part of the special menu, was excellent as well, but I've never tasted a carrot cake I didn't love. Can't wait to go tonight with 4 other friends and watch their faces as they eat! Oh, and the complimentary valet parking was just the 'icing on the cake'.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z2CaldjqJwwB-FUZsP_aIg"
  },
  "aF1Z11rADRwvGM3Bfc3xpA": {
    "date": "3/19/2017",
    "text": "Amazing potential, but not yet at the level of the price point.  Reservation and seated promptly.  Very nice selection of adult libations and specialty drinks.  Service was good (Adam), but was far from high touch, with confidence in skill and knowledge.  Appetizers were tasty, fondue and pig candy both well prepared and presented, the toast on both lacks a bit of flavor and creativity.  We inquired about the guest, main and big house items on the menu as we were considering something for the table.  Our server was very uneducated about these entrees, to the point of asking another server, who also knew pretty much nothing about them.  With the lack of information, we chose individual entrees.  The strip was excellent, as was the veal chop, scallop was cooked to perfection.  Mushrooms were watery and could you some fine tuning.  Dessert was a wonderful peanut butter cheesecake and an unadorned creme brulee, very tasty even though lacking any garnish.  Overall this is going to be a fantastic option in the area, I wish that had polished the staff a bit more prior to opening the doors, but looking forward to seeing the results of some fine tuning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "urThcqroWgGhtyArBz0Yzg"
  },
  "u1EDhaHDbLo8PXs7nw-feA": {
    "date": "3/4/2017",
    "text": "Must agree that for the price our group was not all that impressed. Decor is modern and beautiful. The main dining room was very noisy at prime time dinner hour.  Our server was attentive.  Don't understand why Copper came in a small bottle when menu said it was on draft.  Several mishaps with timing were resolved timely - will excuse these due to newness. Calamari app was recommended to share - dry and over fried, have had better.  Chopped salad was mostly just chopped lettuce and bland- for what they seem to being aiming for here expected a little more pizazz.  Bread - a sore spot a this price point - seriously, $5 for small, dry heavy rollish biscuits.  Entrees were all excellent and did meet our expectations - tuna, salmon and halibut - nicely cooked and accompanied.  Cheesecake was some of best cheesecake ever.  Hits and misses, that is why the 3 stars,  Overall did not leave feeling like we had an amazing meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sw7xEOn6CFJvO65ywS-kqA"
  },
  "ZFUsM4R4RexOcUJ4VYp5LQ": {
    "date": "3/5/2017",
    "text": "I have to agree with the previous two reviewers. My husband and I had very high hopes for this restaurant and our experience was average at best. When the name of your restaurant has \"porterhouse\" in the name, you should be able to cook one properly. He ordered medium rare and it was well done. He had to send it back and it still wasn't cooked properly but by that time I was halfway through my meal he just wanted to eat. My filet was high quality, but very bland in flavor- like it was been cooked on an electric grill with no seasoning. The calamari and rock shrimp appetizer was modified to only calamari. It was the best calamari I've had in quite a while, so there's that. The choices for side dishes were limited but the lobster mac and cheese was tasty. I had a coupon for the free appetizer and they still charged us so that also had to be corrected. I could chalk it up to this place only being open for 10 days, but the owners have several other successful restaurants in town so they should be pros at opening new restaurants. I hope the reviews get better because this side of town needs a high end dining experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "syw7Q7gTKEXD9_e7ByJBeQ"
  },
  "U7L_ufEUvQJfXx5dMHy8rA": {
    "date": "9/14/2017",
    "text": "We had a mid-week dinner; service was excellent and food was served promptly. Portions were good and flavors were great. Good varieties of craft beers, wines and spirits. Cocktails excellent. Will definitely return in near future. Use valet as ongoing  construction limits parking (still do-able given center parking).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ZyQEkm3d38pAmr2W5dIoA"
  },
  "dN0H5vXCvQ1NOOT2LaHLDg": {
    "date": "3/6/2017",
    "text": "Great food and service. I had the fried oysters as an appetizer and the scallops as an entree which were both very outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FxNJ6VE6iFCqkDpq20GvXQ"
  },
  "uJUHeuYjITPFcwH1lEq_cw": {
    "date": "2/28/2018",
    "text": "Over-priced, over-rated. Had high hopes before it open. Actually been there 3 times hoping for better steaks. Sadly, not. Just mediocre.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "18e4TbxK1fC25NqlpTxBow"
  },
  "8gxmoC6mTlaOcbBEXRy1zw": {
    "date": "5/18/2018",
    "text": "We tried The Porter's House for a celebratory dinner this evening. The ambience and decor were great. Our server was pleasant. We ordered the calamari appetizer Android went downhill from there.  Even my Arnold Palmer was terrible, basically colored water! I had a the KC strip, the flavor was great but there was SO much gristle, my daughter ordered the 6 oz filet MW, they said it had to be butterflied or it would take too long to come out, my husband ordered the salmon and specifies well done, we ordered 2 sides, gratin potatoes and Yukon mashed potatoes. My daughter's steak was severely overdone and my husband's was equally underdone. Thankfully someone who we believe was the manager came by our table and we reported the issues- he took both plates, leaving me to eat our celebratory dinner ALONE. About 10 minutes later, when I was finished, they brought the replacement dinners. I did expect that a manager would have expected the kitchen to know how to cook a 6 oz filet MW properly without having to butterfly it! Yet, that was sadly not the case. Both meals were properly cooked the 2nd time around but again they ate alone. Eating separately completely killed our celebration and although we had planned to have dessert and after dinner drinks, we left immediately after dinner. Such a let down. Even more so because they still charged us full price for meals eaten separately and cooked improperly. Talk about cheap at a so called fine dining steakhouse! We will not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_bkLk7ZQgRXI7ksKTED0Ew"
  },
  "adP7LUICyZsCyf3pjv-3-Q": {
    "date": "4/29/2017",
    "text": "Not too happy about celebrating my daughters bday here. Presentation was good but food was not worth it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QiwMmZRXcyJD47srofI_Lw",
        "caption": "Photo of The Porter's House - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QiwMmZRXcyJD47srofI_Lw/o.jpg"
      }
    ],
    "user_id": "XSha5gJQwV8Td3Gmt8zlYQ"
  },
  "Abxxdu_ika0yZm1rWjSiCQ": {
    "date": "7/22/2017",
    "text": "The Porter's house restaurant is the best fine dining in Charlotte. I would give them more than 5 stars if I could. I was surprised from the minute my girlfriend and I walked in. We gave them our name that the reservation was under and he looked up and told me happy birthday. I was so surprised that they would take notes to remember my birthday. Let me start here with our waiter ELI he is the most professional and genuine waiter I have seen in a very long time and when he arrived to our table he even he even told me happy birthday.  He catered to our every request. I can't say enough about the food and all the wait staff and management. We both had the ribeye steak and it was the best cut and flavor you can imagine. Then the dessert (carrot cake) was just like my mom makes homemade. I could go on and on about this restaurant but it was a wonderful experience.  Thank you Porter's House for making my birthday great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HEvtYJqrvCYId91tN9jD3w"
  },
  "nX3R3VCEMEv6rGRWYE-N8w": {
    "date": "7/20/2017",
    "text": "We had dinner there last night for my birthday and it was simply amazing! Great ambiance, amazing food and delicious cocktails. Our waiter Jimmy was  friendly and so helpful. We loved every second. The staff even brought out a complimentary cocktail and dessert which was completely unexpected.  We are already planning our next visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OIY9Cph0elzK1wACaBSaPw"
  },
  "hHeLDRAc7UfoO27oQHtrFg": {
    "date": "4/1/2017",
    "text": "Awesome menu selections, great service, cool atmosphere. The veal chop was to die for! Will definitely be coming back again for dinner in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f5MYRDZ7nwLvO-o57mIM1g"
  },
  "Cj55q3JtUXZSJ6GRje2KBg": {
    "date": "7/6/2017",
    "text": "A great dining option that has recently opened!  I had the salmon (wild caught) and it was perfectly prepared.  Enjoyed a delicious cocktail to start -- well made.  The atmosphere is open with a mix of modern and rustic decor, very nice and welcoming.  I will definitely be visiting this restaurant again!  Thank you for bringing this level of dining to the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xgs4m7s1dpjSPqi-SPhdmg"
  },
  "3lhbcFu5c0tVV7npqw131w": {
    "date": "1/26/2018",
    "text": "We held a 30 person business dinner at The Porter's House on January 23rd.  First of all Kim, the private dinning coordinator, was great to work with.  She was very responsive, flexible and accommodating.  Getting a dining venue for 30 during restaurant week in Charlotte was not easy.  Kim was very accommodating in reserving The Porter's House private dining room for our event.  The venue itself was convenient and the private dining area was perfect for hosting our business dinner. The doors could be closed off for our numerous private speeches and toasts.  The serving staff was terrific at passing appetizers and keeping beverages full.  They were pleasant, responsive and extremely efficient.  Meals were served at the same time, ensuring everything was hot and just as ordered.  The food itself was great!  We all participated in the Queens Feast menu and everyone enjoyed their three course meal.  It's not often that our business meetings can be hosted with such perfection.  We had many accolades on our choice of venue.  Thank you Porter's House, and your staff, for hosting our large group!   We will return!   Connie, BAES",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U85KvsfwuHqYmM2v45BxlQ"
  },
  "UWLwKAOJZg6bH7agmoqXow": {
    "date": "2/2/2018",
    "text": "One of my favorite places in Charlotte. Awesome staff - go see the bartenders for the best drinks in CLT! Marty and Jeff are awesome. Makes me want to come back every week",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L3Kfojv4lgqThWRxuudshw"
  },
  "FhHn5kFyUM8mTKmsCgx8Uw": {
    "date": "4/29/2017",
    "text": "Was excited to finally have a good restaurant on this side of town.  Our first visit was pretty good except for the drinks.  Not so good.  Our second visit was so inconsistent from from the first visit...even ordered the same thing...calamari.  It wasn't even the same...looked different and definitely tasted differently. BAD.    After an hour my mouth still tastes SALTY from the chicken dish. If there was a no star rating I'd click on that but sadly I have to click one star. So needless to say we will not go back to this restaurant.  No quality control to say the least and please throw away that salt shaker.  I will say the service was pretty OK.  Someone put my napkin on the back of my chair when I left the table for a moment.     We got there early to have a drink at the bar.  I personally checked in and talked to the \"guy at the check in desk\" gave him my name and discussed the seating, etc.  His assistant took us to our reserved table to make sure it was where we wanted to sit and all seemed right with the world.  After being there since 6:30,  our reserved time of 7:15  seemed to roll by so my husband went to the front desk to ask about the wait time.  Well, the \"guy up front\" said we didn't check in....even got a voice mail asking \"where are you\".  My husband didn't have his phone with him since we were there so early and the \"guy up front\" was simply 5 steps away from where we were at the bar.  REALLY ????  Almost forgot to mention this so if you check in be sure \"the guy up front\"  looks you in the eyes and realizes what is going on.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zjSlnk3ddwcisecopMABFQ"
  },
  "KNdLQ-IEs-15jkzYXXqePg": {
    "date": "4/22/2017",
    "text": "Gorgeous setting inside (plaza still under construction but who eats steak on the sidewalk anyway?). The porterhouse namesake dish was superb. Great table service. Everyone working there is pleasant and professional. The Porter's House has a strong culture of hospitality and excellent service - superb food - delicious and memorable evening out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ec_GjBm6pUaiMqndohyroQ"
  },
  "XVBI3q88FQgOg6x6DD0NJw": {
    "date": "11/4/2017",
    "text": "We walked in on 11/4 evening and told the blonde haired hostess in the purple shirt we would like some drinks, bar was full  asked for a table said it was for reservations only. Which is fine however, she did not have to have an attitude and sound rude, she seemed as if she did not want to serve us at all. This lady needs an attitude adjustment and should not be working in the front! Walked out, will not return until you guys train your staff to have a better attitude towards guests!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LVpcHCIeHeOuiVIj_ZrG_w"
  },
  "7YksPVk4wS6SZU14xIJ0Zg": {
    "date": "6/9/2017",
    "text": "Just got back from an outstanding dinner at The Porter's House for my wife's birthday. In addition, this was our first night out since our daughter was born. Frankly, I couldn't have picked a better place. The food was great and the service was fantastic. We ordered two appetizers: the tuna and the baked pimento cheese. Both appetizers were decent sized portions and very flavorful (the pimento cheese appetizer would be enough for up to four people and the tuna would be good for up to three people). For dinner we got the ribeye and the 6 oz filet, with the duck fat fingerling potatoes and brussels sprouts. Awesome all around. The steaks were well seasoned, flavorful, cooked to the correct temperature, and were served with a pair of interesting sauces if you're into that sort of thing. For dessert we ordered the cheesecake which was very light and airy, and a great end to a perfect birthday dinner. And honestly, for the cost, this steakhouse is a great choice for a nice night out, and the dinner was well worth the money. Probably my new favorite restaurant in south Charlotte - can't wait to try the veal chop, porterhouse, lamb chops, grouper, etc.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7M0_VbZ1fcMlDzc7arxiw"
  },
  "nYHsmPT8cQApxtQOfGmbtg": {
    "date": "7/23/2017",
    "text": "Been here twice and both times the service and one app have been great (Baked pimento cheese with grilled bread) but that's where it ends and that's why I'm only giving 3 stars. My wife and I got the Filet there the first time we visited. We both ordered them medium and the center was every bit rare! Not worth sending back and I did not mention to our server. My experience is it's a waste of time and as other reviewers have mentioned they usually take way too long to return the poorly prepared steak and it's over cooked. The most recent time I ordered the burger and it was horrible! I consider myself a burger expert (These places have good burgers and one is practically next door /Teds Montana Grille, Bad Daddy's, Fenwicks and South 21) and this was a bad burger! Could it have been a one off bad meat or mix-up....possibly but I have had their burger at their sister restaurant Dogwood and it had this same weird taste. I can't describe it other than stating it was bad and doesn't hold a candle to the ones I mentioned above. Fenwicks is my new Fav burger in Charlotte- ridiculously good- thank me later! Lastly, if you want an excellent steak and don't mind spending extra then go to Del Friscos!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rjRHr4DmItiFBShhqlnz0w"
  },
  "dfEkr8e6kM8kd2juz7u9Rg": {
    "date": "3/2/2017",
    "text": "Hard to give them more than three stars as I wasn't that impressed for the price.  The restaurant itself is very nice inside with comfortable seating, nice decor, linen napkins and attentive servers.  The appetizer menu had a lot of great options and we had a nice smoked salmon with toast points.  It was good, no wow factor, just good.  The entree offerings seemed limited and no specials were offered.  Steaks are served a la cart with lots of larger side options.  My friend ordered filet and it came undercooked and after sending it back to get to medium well, she said it was delicious.  The side of mashed potatoes was served in a cast iron skillet which was a nice touch.  Two other guests got the beet salad with a crab cake side(it was actually an crab cake appetizer).  They said the salad was good and the crab cake outstanding-no fillers, just all crab meat.  What left me with a bad experience is the waiter telling me the chef does not substitute sides.  I wanted the halibut, but did not want the rice. He said he would have to ask the chef if it's \"okay\" to do that.  For $33, I should be able to substitute the rice for something else!!  That was a mistake to be so snobby about substituting.  Waiter came back and said it was okay to sub....and my halibut arrived over-cooked and very dry. They offered me another dish and I got the salmon which was very good. They also offered two mystery desserts at the end for our troubles.  It wasn't a terrible experience and I realize they have only been open for two weeks, but for an expensive fine dining experience, it was just average.  I walked away spending $62 for my meal and wine and didn't feel like I got a $62 experience.  I may try them again after they have been open a little longer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "LyJ8iMYAdQsM2DbSQvZvgA"
  },
  "rH4ouJdc2sC3DHW6VZajcQ": {
    "date": "10/1/2017",
    "text": "Menu was exceptional, but the meal did not meet our expectations. Veal chop was advertised as coming with a morel mushroom, and I specifically asked server saying that was the only reason I would order it. Then an over salted fatty veal chop came priced at $45 without a single morel on either of our plates. The gnocchi underneath was mushy. The appetizer of scallops (2) and bacon were very tasty. Sides of shaved Brussels sprouts and scalloped potatoes were nothing special. Cocktail menu was too weird for any of the 4 of us to figure out. Server was attentive but too many interruptions. I prefer they to come to the table and wait for diner to finish sentence before breaking in. Prices are in line with Morton's but the quality isn't there. Our table for 4 had an extension folded under that made it uncomfortable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6kibcwt-3Sl9-dPur75tTA"
  },
  "DNUVirMzn7A-y2B38yeZ4A": {
    "date": "9/30/2017",
    "text": "Best steakhouse! Their seafood is great too, fresh. We probably have been here 10 times now. Service is great.  The lobster Mac n cheese is killer, east coast shrimp and calamari appetizers are also amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AlrR_1Mm6XzZjjVpHCpoIg"
  },
  "1pz4MwhY337nCedujLEbbQ": {
    "date": "4/7/2017",
    "text": "So glad to have a good new restaurant so close to home. We've been four times and each meal was fantastic. I even brought my bookclub last month. We ate in their private room. Great space. While pricey, the food is worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "piOpsC8ya-RrXDtF52L0-Q"
  }
}