{
  "Rd_MLtb_HNF34L2KHaY5hA": {
    "date": "6/23/2017",
    "text": "I tried this place out with my mother last Friday night. It is one of the few restaurants in Charlotte open past 10PM on a Friday night. The staff was friendly and welcoming and we were seated right away. However, it took a little while before our waitress came over to the table and it wasn't overly crowded. But once she did, she was so friendly and accommodating. We ordered the stew chicken with yellow rice and shrimp mofongo and a side of platanos maduros. Unfortunately, they ran out of yellow rice so I end up getting white rice. The stew chicken was good but the mofongo was very good. Keep in mind...it was my first time trying mofongo. We had sangria which was really delicious! The music was an awesome bonus too! The only reason I'm not scoring this restaurant higher is because I had a check-in coupon for 20% off that I wanted to use but they would not accept it. The waitress told me the owner said he never \"approved\" a Yelp coupon. Apparently, I was one of a few other people who tried to use the same coupon and was denied. Personally, I think they need to call Yelp and get this option removed or just honor the coupon. Otherwise, this is a good spot for late night 'real' food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tWAHLS0REFLXIAQTBG68YA"
  },
  "iG7MRgLU2MfdQtKSMnSPQg": {
    "date": "1/5/2015",
    "text": "Very traditional Dominican food, menu is very large and full of variety, loved the chuleta frita. Went there on a Sunday night and they had a live merengue band, it was fab.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MoR7XnTlyxaUH_lDV3vw_A",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Chuleta frita with Moro, Maduros and chicharron mofongo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MoR7XnTlyxaUH_lDV3vw_A/o.jpg"
      }
    ],
    "user_id": "uctQ8rFIFfjnXhr87pEnCQ"
  },
  "1iBrr6oIMVc6417yCvEotQ": {
    "date": "7/30/2017",
    "text": "Loved every moment, great food that brought back good memories from back home. I recommend to any Hispanics in the area to come here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "To6UqpCxuRzJ9j9rdLbh0g"
  },
  "7QTx5N2LwVa7jErs1o0zaQ": {
    "date": "4/9/2014",
    "text": "Great food! Friendly owner! I'm Dominican and it's the most authentic Dominican food in the Southeast U.S. If you go during lunchtime, you can talk to Carmen, who's the co-owner and actually cooks a lot of the food. Her husband Cris is the other owner and is always walking around ensuring that everything is up to standards.  I start every visit with a quipe and a pastelito. If I'm there on a Saturday, I'll have the mondongo (tripe soup). You can't go wrong with the mofongos, churrascos, and my other favorite dish, the Canoa de Mariscos. The presentation of that dish alone is worth it.  Punta Cana is definitely one of the hidden gems of Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kC0N7bjGGuRQ6IwBl53yzg"
  },
  "lE4Isiv-qx5X3u6w-fvP_g": {
    "date": "6/29/2017",
    "text": "I absolutely LOVE this place! My husband has been several times but yesterday was my first time going. Our food was OUTSTANDING & there was plenty of it. We are from Florida and this is the closest we have come to food back home. My husband is also Puerto Rican and PR cuisine is sorely lacking in Charlotte, as you know, and this is as close to PR food that can be found for miles. Our waitresses were outstanding and I loved seeing younger kids who appeared to be family members helping out delivering bread. I felt so at home. Thank you Punta Cana for this awesome experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7fJSXzuPoq5DkJqQDETjgQ"
  },
  "1kYkdmDRrF4NnRf32XGvIg": {
    "date": "5/17/2014",
    "text": "I am on a job assignment just southwest if Charlotte always lookin for some good healthy eats since I'm a foodie and decided to cheat a little and discovered a restaurant from one of my native roots Dominican Republic. Punta Cana Restaurant and Grill. I chose to eat the mofongo with shrimp and loved the presentation. It was also very flavorful and comforting with the sauce. The food definitely didn't disappoint. Service though was a little sluggish but overall I left there satisfied.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TUwu8kdkdz2RNHqeaSKcKw"
  },
  "qrNYpgKJiWWgZhCIhUYEJA": {
    "date": "1/6/2016",
    "text": "Worst customer service ever! Just spent over $50, had to wait for over an hour to get my food. They apparently forgot my order. Waited for an hour on the table, had to tell them to make it a to go order and finally my order was ready after an hour and half. They offered me a free desert. Are you kidding? A free desert for wasting an hour and half of my time on a work day and spending over $50 on the worst service I have ever seen. I would recommend not to ever go to this place unless you want to sit there and starve!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r4lMyUVDnn8rfgMFRlQMlA"
  },
  "QCLipWRwuRnsjQJ-aGqQKA": {
    "date": "5/8/2013",
    "text": "If this review was only about the food I would have given this place all 5 stars!!!!!! I use to come to here all the  time a few years ago. Then it closed down for what seemed like a year. I was so excited when they opened back up. This is the best place for Dominican food! Everything is full of flavor and just done the right way!  When I arrived for my most recent visit I was excepting the same great experience I always have when I come to Punta Cana. After we were seated the waitress disappeared for close to 15 minutes. The whole wait staff was completely inattentive. They all were huddled in a group talking, texting, and watching the tv at the bar area. It was very frustrating. We decided to stay because the Mofungo is some of the best that you can find in town. During dinner the waitress never came back to check on the table or to refill drinks. She just appeared with the check. So disappointing when it came to the service.   Like I said in the beginning I love the food here. So I will give it another go but if the service continue to lack I will just have to order take out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "YmAqQyaFli8H9LVGhGhR9w"
  },
  "x9u5aUW_QtYRaz9sU9rFZg": {
    "date": "9/24/2013",
    "text": "Ok so I'm half Dominican and don't get to eat Dominican food a lot so I was so happy when a friend told me about this place the prices are moderate it's not fancy by any means very casual but the food is excellent and pretty authentic the stewed chicken was hearty and the tostones and yuca were super yummy if you like dominican food I recommend this place ..and for those who like it they have Goya Malta there (super gross) but most Hispanic and Caribbean ppl love it and it's hard to come by in restaurants check it out",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1zMCHFmhDKXrUbRLgcXfKg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Oye Dominicana!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1zMCHFmhDKXrUbRLgcXfKg/o.jpg"
      }
    ],
    "user_id": "iUBA75To0UvklZH7tdmX1A"
  },
  "tEILwD1E3sZ6apn9mPI2uw": {
    "date": "1/9/2017",
    "text": "My first time here and I am very disappointed. The waitress never brought any refills. After bringing out our food, she never came back to check up on the table and instead spent 20 minutes flirting with  two guys, the only other people in the restaurant, until she decided to bring out the check. Food was mediocre at best. I don't think I'll be back :(",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "akKWkunkl9KM7AJ6mpx5vg"
  },
  "-pX5APbyMj7tgfknFd6lrw": {
    "date": "9/12/2016",
    "text": "Good food.!!!!!! Pastelitos are amazing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "I082WTNp6YRoYMZV-phuLw"
  },
  "TiPNsI_Sv6qP7Inz63vrLw": {
    "date": "7/24/2013",
    "text": "Several tries later I have to take one star back.  First off for the chicharrones to be really good they have to be fresh as in cooked to order. Turns out this only happens at lunch time because it's not one of the lunch special and you're ordering from the dinner menu.  Then if you go for a late lunch as I have the moro (black beans and rice) and the maduro (fried sweet bananas) were dry.   IOW they cook everything early and the later you go the worse off you are.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZvmC522FAwxt8qT1jxqliw"
  },
  "cZtNYKpNjDCEfk4WIQMWhA": {
    "date": "12/4/2010",
    "text": "I work with some people who are of Dominican Heritage.  One of my co-workers is from Haiti and she says the foods are very similar.  We go every so often for lunch, and what you get for $5.95 is a pretty good deal.  The food may not be anything extraordinary but it is definitely good for the price.  Basically you get a choice of a meat and two sides such as rice and a couple of different kinds of plantains (which I love).  It's a nice change of pace if you tend to order Chinese food.  They also do a lot of to go business.  The service is usually pretty good and efficient when we go.  Even when I go with just another one of my plain old white American co-workers just like myself, we are treated well.  The building used to be a Wendy's which moved further down South Blvd since there was already a Wendy's within a mile or so of this one.  It can be a little tricky getting in and out of, but it it's not too bad.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "s4cki7AiOrOjb5r-ZpbJUw"
  },
  "nZzS31PU9C9ivVBWkStNNQ": {
    "date": "7/27/2015",
    "text": "When twice.First time my food was awesome. I had Mofongo with Shrimp and it was delicious. Had a piece of my favorite Dominican cake and it was a little dry but still good. I decided to treat my husband on Sunday and what a disapointment. My husband ordered Mofongo with chicken and it was terrible. Dry, cold and the chicken was overcooked looks like to much time in a microwave or the fryer. My Mofongo with Carne Frita was bad too.the meat was hard, overcooked, like rubber. My husband's  chicken with my pork could bounce from the floor  back to the plate to explain exactly how bad it was. We ordered an appetizer of Chorizo al Carbon, that by the way it is deep fried not on the grill as the menu said was the star other the evening. Don't  be confused, it was the fallen star. Terrible. It looked like poop on a plate. So over fried you could not bite it. We had to return and ask it out of our check. A piece of  one of my favorite drsserts would have highlighted the evening, but no cake available that day for a busy Sunday. We'll not be going back for now, it was a beautiful Sunday wasted. I will definitely  give 5 stats to our server. She was nice, helpful  and under all the mess she was calm and always with a smile.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8ax1I1_5EtMugo4-W-GNtw",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8ax1I1_5EtMugo4-W-GNtw/o.jpg"
      },
      {
        "img_id": "802kouAKpzh1rYECVrP3qQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/802kouAKpzh1rYECVrP3qQ/o.jpg"
      }
    ],
    "user_id": "H35-O269uLk5yOb8xxildw"
  },
  "ZPj9S1S5mWWtpuLN89WLWw": {
    "date": "7/9/2013",
    "text": "I was soooo excited they opened back up a few months ago, my lunch routine surely missed my Dominican fixin... I grew up with this style of food being made day in and day out since the day I started eating solids (not as recent as you may think! Lol). And I can say withal the confidence in the world that these guys are AUTHENTIC!!! I feel like I'm back in Dominican Republic waiting on my grandma's cooking...  Solid place for lunch/dinner/anything... I love me some Mofongo, but like I said its all good...  Now if I can stop in and NOT forget to check in.... Enjoy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OgdfBBjbGaB8iziitz0jGA"
  },
  "BzutFPuhPNR9wl651uYiQQ": {
    "date": "12/18/2015",
    "text": "Just left after having some of the worst service I've had in a long time. They sat us then forgot about us for about 15min then came and got our drink order and again forgot is for another 15min. Then came back for our food order didn't write it down and came back 10min later asking what my husbands entree was again. Then disappears and services my husband first and I don't get my food for another 10min and comes with the wrong side dish. We never received our appetizer and decide to give it to us as we are leaving. Don't get me wrong the food was good but the service was horrible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F8ozWeQd_nmVf08NkS1Ndw"
  },
  "-_JPchNHcLo5Qv7fXNFTdQ": {
    "date": "8/9/2014",
    "text": "I noticed great reviews about this place and decided to have lunch with a friend. The decor was okay for a Latin restaurant, the music adequate and overall the place looked clean. We were quickly served, however the food took over 20 minutes to arrive. My friend ordered pork in sauce with rice and beans (arroz moro). I ordered mofongo filled with pork (carne frita). Let's talk about my dish since this is where problems started for us. I thought the portion was a bit small considering this is after all a Dominican restaurant. I believe that I have seen a fair share of Latin food related restaurants living in Miami since 92 and during my youth years in Puerto Rico and the Dominican Republic. In fact, two days ago I stopped by a Dominican Restaurant in Miami and they are truly known for tasty food with generous portions. The mofongo at Punta Cana was dry with chunks of plantains still unmeshed, which is essential when preparing mofongo. There was no clear color sauce or boiled garlic water to mix with the mofongo. I cut just a piece of pork (carne frita) and immediately noticed an unusual odor coming out of the meat. The pork was rotten!!  I notified the waitress who in turn notified a waiter who looked like a supervisor and he stated that he was going to call the manager. The manager never arrived so the supervisor offered me to take the dish away and bring something else. I ordered just a side of rice with beans. My food was taken out of the check, however now that I think about it, the entire bill should have been complementary. Back to my poor friend who ordered pork with sauce, he immediately stopped eating. His food was not comp.   I will not return to this place. There is common sense with operating a restaurant and a cook plays a big role on what comes out of the kitchen. He/she must try what they prepare to check for flavor and cooked level, nothing sophisticated, but it must be done to keep customers in mind. If a cook won't eat it, then why should customers have to?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "rejdO1V12C2ZIyEv_Evysg"
  },
  "GQ3EWOwAaXP_NKcg79NP3A": {
    "date": "8/22/2015",
    "text": "Love this place! I'm from southeast Florida and miss the diverse food options there so finding Punta Cana made me feel at home. The food is awesome, resonably priced, and the staff is always super friendly and accommodating. The chicharron de pollo was disappointing, however I highly recommend the stewed chicken or pollo ala plancha as both were super yummy! I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "phg7uw3s2g_pVsNLQwEyGQ"
  },
  "WWhg4Om9zveHjSDiLqkzMw": {
    "date": "8/16/2015",
    "text": "I went here last night with the hubby and it did not disappoint. Unfortunately it was 9:30 on a Saturday night... So in the middle of our meal they started with the loud music and bright lights that were right in my eyes, no warning, no offer to move us. Kind of rude. But the food? Was delicious. Pernil pork, gandules and combo rice with plantains... It was the best Spanish food I have had in Charlotte. My hubby is PuertoRican and he ate all of his, and then my leftovers. We waited 15 minutes to be seated and (I kid you not) 30 minutes on our food. The service was SLOW bit they were really busy so I can accept that. Not the place to stop for a quiet dinner on a Saturday night, or if you are in a hurry, but if you don't mind sacrificing a little for authentic Spanish food, this is the place for you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YhKG0jWCmTM5ZWd5C-Xm1w"
  },
  "dC5rKjlJf2vcI7xoKAwmxw": {
    "date": "8/15/2015",
    "text": "I try to eat here when I'm in Charlotte. Authentic food, big portions, great staff, and super clean. Be sure to get a meat pie appetizer for $1.25, so good. We got some to take home for breakfast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VJf5HlIdxadPX934dCaaJA"
  },
  "pCePjic7rTN83UFc9oHXAQ": {
    "date": "6/26/2016",
    "text": "Such good Spanish food! Dominican food at its finest! We love coming here with the family. Great prices for the amount of food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TNSv_4uB8c_Bgy4ryVD5kw",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Great food",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TNSv_4uB8c_Bgy4ryVD5kw/o.jpg"
      }
    ],
    "user_id": "DZv2J2pVBLjNAkVmyi4U5A"
  },
  "bhgph6jeeTmGCSxqV7Wa8A": {
    "date": "5/10/2017",
    "text": "I stoped by this place and I must say the food was authentic. I grew up eating Dominican food and this was on point. I had the carne guisada with rice and beans with some tostones on the side.  I also had a chinola (passion fruit) shake which was good.  The price is very very <a href=\"/redir?url=http%3A%2F%2Faffordable.it&s=b6348e69b0ab8d203025e11d54111956ad91c2d2114ce526b7d6545c34dc742b\" target=\"_blank\" rel=\"nofollow\">affordable.it</a> all came out less than $13.00 (lunch special).  The staff was nice and struck up a conversion during lunchtime. If i lived closer this would be a spot i would visit often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b_LcThPFNEK_A5xX1rZTUA"
  },
  "TB_H4Dp6taK1zcxtWK5xag": {
    "date": "4/26/2017",
    "text": "One of my professors told me Punta Cana is one of his favorite restaurants in Charlotte and encouraged me to to check it out. I met my boyfriend there for lunch and we both commented that we'd each driven past it hundreds of times, but neither of us had ever been in. It always catches my eye because of the palm trees out front and the green lights at night. I had the beef with black beans and rice off the list of lunch specials. He got the Cuban sandwich. The servings are very generous!! My beef was tasty and reminded me a bit of pot roast but with different seasonings. About half of the pieces of meat on my plate were tender and delicious, but the other half were rather gristly. Since it was such a large portion, I wasn't too bothered by this. My boyfriend's sandwich was amazing, and he said it was the most delicious Cuban he'd had here in Charlotte. We will definitely be visiting again to try other things on the menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6nveZkv8BlhMVZierKMINg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Grilled tilapia lunch special.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6nveZkv8BlhMVZierKMINg/o.jpg"
      },
      {
        "img_id": "FBTGLdPE7KBHs_Gzs3OfZw",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Stewed Beef",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FBTGLdPE7KBHs_Gzs3OfZw/o.jpg"
      },
      {
        "img_id": "UpLCXc_4AkTNJxL4sx0KXQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Cubano",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UpLCXc_4AkTNJxL4sx0KXQ/o.jpg"
      }
    ],
    "user_id": "z2Rfm6-wy76feU0AglvGfg"
  },
  "0BghDG359uKZ7q0OCYXXBw": {
    "date": "6/25/2017",
    "text": "Just left this place and we were very impressed. The staff was exceptionally friendly and our server was fantastic! We had Quipes and Mofondo with their house made sangria. My husband asked me why we had never been here before and I had to remind him that I had suggested it several times...he just wasn't ready for something new yet. Lol. Anyway, nice job y'all and we will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xOSvMQah19rOLc1Bf-EuRg"
  },
  "D1DGic5r7H2YC8wFrI6ohw": {
    "date": "8/8/2015",
    "text": "Oh my gosh this place was soooo good!! They start out by serving complimentary garlic bread that is pretty simple, but totally works! It is really good & nice addition. I had the garlic shrimp mufungo & it was fabulous!! I came here just to have the mufungo & it did not disappoint! They also had tripe soup that I was interested in trying & our waitress was happy to bring me a sample. It was also very good! They brought by a steak sandwich that looked amazing & I'll be trying that next time!! So glad we stopped in & not exactly sure why this place only had 3 1/2 stars?!?! Give it a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ARtF0gMTrhEeBLIR-3VHw"
  },
  "JiNBNgZGrZhC0r3hWTKgaQ": {
    "date": "11/25/2017",
    "text": "The food is good but you need to check your bill for they will try to add other things that you didn't order so be aware before paying",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R0Qgsjx91aJ2x8UGuw05Kg"
  },
  "Zy096smbs2ShmFrPGgwPwQ": {
    "date": "10/31/2016",
    "text": "Good food, great service! The waitresses are always helpful and funny. Love the white rice, fried plantains, fried yuca and pork.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-CIKKPeyjqN5SD7lVfIUZQ"
  },
  "OlC6qhADfqDIMMtpQfMDYg": {
    "date": "3/31/2015",
    "text": "I have been here with two of my girlfriends so far within in one week, because the food here is delicious, and the staff are exceptionally friendly and attentive. We already have a lunch date with four of us going next tuesday, where the Camarones a la plancha is on the lunch special menu.  I at first went with my Cuban friend who introduced me to this place, and then with my white friend; we were the only whites in there, which is a good sign that the food will be highly authentic/delicious. Lots of Dominican customers. It was lovely. My husband loved the cuban sandwich, which is made with real cuban bread.   After moving to Charlotte nearly a year ago, I am happy to have found yet a new favorite. You can not beat the prices either. Everything tastes perfect! Yum!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JTV-Mcb-FbFF84eXSz-_RQ"
  },
  "DfF3x3HKwQj5HNzAqatlyQ": {
    "date": "10/17/2015",
    "text": "This place is only getting 2 stars because the music & food was good.  Other than that, the service was HORRIBLE.    Last night, October 16th, a group of went out for a girls night.  Two of my friends arrived at this place at 7:30 & were seated, the rest got there at 8pm & no one still didn't even ask for their drinks.  After having to constantly having to try to get the waiter's attention we got our drinks & ordered our food around 8:30pm.  We didn't get our food until 10:40pm.  It was making us angry because other people (I'm guessing regulars) were walking in & getting food before us.  The waiter had no sense of urgency either.  It was unbelievable.  So we ate quickly & then left.  First & last time there, no matter if the food was good. By the time I got it, I hardly wanted it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "egke54xDQFDc-Rn9Rtp9Pw"
  },
  "tqO99Q0O3RX9VfxhPX9umg": {
    "date": "1/22/2017",
    "text": "The mofongo's are extremely good their grilled chicken is amazing and the service is good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lp35aAOT-xcQwNoQgE7NLA"
  },
  "bdv6supwFinZzcJoxH1ZSA": {
    "date": "10/14/2016",
    "text": "Moro with pernil, chicken and beef empanadillas...and a side of mayooketchoo...  punta cana NEVER disappoints",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n08PecZ8XrkjhI1ncNtkaA"
  },
  "JYc3IAmON_jis3nFdU5PGg": {
    "date": "8/18/2015",
    "text": "Really enjoyed the food and service, me and my wife just entered 20 min before closing, on a Sunday night after bowling with friends and they were more than nice to accommodate us and provided a really great hassle free service. Staff was able to accommodate our special request for customizing our food a little bit. Overall a good experience and a different cuisine to try. We sure will be going back for some different dish this time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eoe3Q6fwZ6Y5cBbJ5UxLuw"
  },
  "vzRM3OHvVX7KbtDsZugbFw": {
    "date": "7/30/2016",
    "text": "Here once before and the food was very good. I came here today and it took forever to even get service. So I left",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DpPkVTfDIZt3Zr5dNZCn6A"
  },
  "BmiAOKRI9XhO3-6h4epDYQ": {
    "date": "4/24/2015",
    "text": "I'm a fan of Dominican food, and it's really hard to find. When we come down to Charlotte, we definitely hit up Punta Cana! From what I read on Yelp, a lot of people in Charlotte are looking for it too! This place is easy to reach off of I-77 and appears to be in a old Wendy's building. The decor and atmosphere inside are of decent quality, while the food is of very good authentic quality! We had the baked pork, which was tender, flavorful, and had some crispy bark! We also tried the stewed beef which was tender, lacking fat, and a nice spice to it! We had a side of Moro Rice which rocked; as well as sweet plantains! Top this off with sampling a Cubano which was tender on the inside and crispy on the outside from toasting! A definite four stars and guaranteed of seeing my third return soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kjaUSiRWhR9bF9KxOMbVvg"
  },
  "3QqN-VjQqXKN3UD5q9j5EA": {
    "date": "12/25/2014",
    "text": "Visited this place a couple days ago for dinner.  We are new in the area so we we're happy to have a Dominican restaurant near our new place in Charlotte, NC.    We arrived and there was plenty of parking which was good.  Once inside the place, we were greeted right away by one of the young ladies and she showed us to our table.  She was very friendly and got us 2 high chairs without us having to ask.  They had a Perico Ripio playing on a loop....  Same song over and over.  That was weird and annoying.  Guys were playing Dominoes in a slightly separate area of the restaurant.  I didnt mind, its what we Dominicans do!!  We ordered 2 ginger alea as our drinks and a lemonade for my daughter.  When our drinks arrived, the ginger ale had a slight after taste that we couldnt figure out.....  The lemonade however was absolutely great!!  So we ordered 2 more lemonades for ourselves.  For dinner I had the \"Bistec Encebollado\" (Beef smothered in sauteed onions) with white rice and red beans and a side of Tostones (fried green plantains).  My wife ordered 1/2 rotisserie chicken with white rice and red beans and a side salad.  I thought the food was very good!!  I judge Dominican restaurants by how good their beans are, and their beans were pretty good.  Our bill was about $41.00.  Probably slightly more than what we'd pay in NY (The Heights), but not terribly over-priced.  We'll be back........",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ngSRZH3kz4ucZQeypg_8sg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Rice and Beans with side of Tostones.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ngSRZH3kz4ucZQeypg_8sg/o.jpg"
      },
      {
        "img_id": "P7E2ilTeGxELyzu96uVT_A",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. 1/2 rotisserie chicken and side salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P7E2ilTeGxELyzu96uVT_A/o.jpg"
      },
      {
        "img_id": "bhADWFhOPoPj_8A-c57HYA",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Bistec Encebollado",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bhADWFhOPoPj_8A-c57HYA/o.jpg"
      }
    ],
    "user_id": "RApXDoOpPkUtKThblGpCOg"
  },
  "hITEcj-e7Rt8oljDntAZBg": {
    "date": "8/22/2015",
    "text": "My wife and I had dinner at Punta Cana, Saturday August 2015. Our first visit, she is New Rican and grew up eating her momies Puerto Rican food. Her momie was born and raised in Puerto Rico. I'm of Great Briton/Netherlands ancestry raised in Northern Indiana. I had seafood Paella and she had fried pork chops, white rice and plantanos. It was very good and we both want to go back. It looks like its in an old Wendy's burger place with a large parking lot. It is a family place, where you go with mommie, and children, you will hear children crying. music/dancing fridays. Punta Cana is the name of a town in the Dominican Republic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SDaNc3qcdsD3wkr7p7QTXg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Part of menu.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SDaNc3qcdsD3wkr7p7QTXg/o.jpg"
      }
    ],
    "user_id": "8GbVS5mNrg1eGitP1_bqmw"
  },
  "8cDw3B6Mbjyvk_jbXzdebQ": {
    "date": "10/5/2014",
    "text": "Went here a few weeks ago. Definitely a family oriented atmosphere. We came on a Saturday night in which they also have Salsa music and dancing towards the end of the night which was good. The food was good and ....plenty lol. The only downside was the long wait for the rest our food, but all in all, a good place to eat Caribbean food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UZd5O0KzQde6mvN6Uo3wYw",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Salsa Night !!! Lol",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UZd5O0KzQde6mvN6Uo3wYw/o.jpg"
      }
    ],
    "user_id": "dMx-PR1ujNveu6kdQU5Q7w"
  },
  "27NpFggfucpsWFz4NJv-xg": {
    "date": "10/14/2016",
    "text": "Omg the moving is greattttt. There steak sandwich is great. I heard they have a get parties on Fri -Sat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ELLxs5jT6rr31kpNd_QTA"
  },
  "chpi8ozXTxT8BtubiGfZXA": {
    "date": "5/17/2010",
    "text": "For a $5.95 lunch special, this place is solid. There are many choices on the lunch menu and I got the grilled tilapia with yellow rice and fried cassaba. I should've gotten the combination rice like everyone else, but I wanted to be different! Yellow rice was bland, grilled tilapia was just a grilled fish filet, nothing too special, and the fried cassaba was the highlight for me. Esp with the ridiculously vinegar-y, garlic-y dipping sauce. Def not going to make out with anyone after using that stuff! My companions got stewed chicken and roasted chicken. Good things were said about the stewed chicken, but the roasted chicken, I was told, was too dry. Also, people thought the fried plantains were overly sweet and mushy.   Service was friendly enough, albeit a bit slow and our checks got messed up at the end. I did like the decor and atmosphere, lots of kitschy stuff on the walls and a fantastic Dominican variety show playing on the tv. It looks like they have karaoke on Sabado nights.   Awesome.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rrcWXjFM-5JcVAiSULJg5A",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Chicken and Plantains",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rrcWXjFM-5JcVAiSULJg5A/o.jpg"
      },
      {
        "img_id": "7UX9H1ZwZRP_HFytdWy1DQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Grilled Tilapia and Fried Yucca",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7UX9H1ZwZRP_HFytdWy1DQ/o.jpg"
      }
    ],
    "user_id": "53QaFbmZojYK0vv3RQagcw"
  },
  "k-Tx6OC-wFNE70GqEmAsqQ": {
    "date": "8/5/2014",
    "text": "EXCELLENT lunch spot! Lunch special is on average $7 and comes with 2 sides. My go-to is pernil (roast pork). Their combination rice is good as well as fried yuca and plantanos maduros. Ask for chimichurri sauce, which is thick and garlic-y. The sauce they bring with the fried yuca is very vinegar-y, considered yourself warned. Service is ok in general, sometimes the ladies get too busy talking amongst themselves (which I HATE) but just ask for your check and box and whatever else you need all at once. Definitely in and out within an hour.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M4yYtAXehUzaHB1ghl6EXg"
  },
  "WbuhXYGTwXcuOUfScq4HDQ": {
    "date": "12/22/2017",
    "text": "This place is the farthest thing from authentic Dominican food . Being from Santiago and living in Miami my whole life this is not where you go if your looking for some real good Caribbean food . The tostones are frozen along with the service being very slow . Might need to change the name but Punta Cana is definitely not fitting .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HrzbJGOcLChvbj3PSxKMUA"
  },
  "DEP33AH6ZF-B8Ies8msJ7w": {
    "date": "2/18/2017",
    "text": "The food here was so delicious! The waitresses were sweet as pie and super attentive. Had the Mofongo with fried pork, rice and beans, along with their yuca fries and guava cake which was so moist and delicious that it had me wishing I'd taken some to go. Try this place if your ever in Charlotte, trust me you'll love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qp2WPwVL6prJt5lG-Fm8xw"
  },
  "mkDFzDy9yjkKqKdlTjEoNg": {
    "date": "7/11/2017",
    "text": "From the Greensboro area in Charlotte for a Doctor's appointment with my wife and daughter. We have heard really good things about this place and decided to try it out. Being a Small Business Owner helps to understand the challenges that could come with running a clean, professional and welcoming establishment. I have to say, we have really enjoyed the food which was great tasting, generous portions which is money well spent, and presentation was there. The staff was super friendly and professional, and the atmosphere was very cozy and homey feeling. Also, there was a diverse customer base(which is hard to see when people aren't familiar with the food, customs, culture, etc.) Me and my family will definitely be returning to give this place another taste. Thank you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Nk6tyA0RWRZKu-3R9Hm8Vg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Chivo Guisado(Goat Stew) with Moro(Yellow Rice and Beans mixed) and Maduritos(Fried Sweet Plantains)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Nk6tyA0RWRZKu-3R9Hm8Vg/o.jpg"
      },
      {
        "img_id": "rJr8AKRB7_LW0D5b1OIJ1g",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Chimichurri Sandwich(Dominican Hamburger) with Tostones(fried plantains).... Yummmmm",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rJr8AKRB7_LW0D5b1OIJ1g/o.jpg"
      }
    ],
    "user_id": "PIypQGeJyWJkjkHl_O9j-w"
  },
  "nycevP4srfVnxkMKzXmYeg": {
    "date": "11/4/2015",
    "text": "I literally drive by this place all the time! So I'm glad I finally got the chance to give them a try!  My co-workers and I came here for a team lunch, we had a pretty big group but lucky for us the lunch rush was mostly to-go orders. Whoop! Whoop!   They have a ton of lunch specials where you get an entree of your choice and two yummy sides.Our waitress was so kind, there was a special of the day and we all had questions about it so she brought out samples for us to try!   I ended up ordering the special, it was like a fried rice with chicken and shrimp with veggies. It was really good! Lucky for me there was a little bit of everything around the table so I already know a few things I'm looking forward to try on my next visit!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 6
    },
    "photos": [],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "pcLDO7oDOXPuxvLkRHkq5Q": {
    "date": "4/10/2016",
    "text": "Wow!  What a great hidden treasure!  Lots of locals.  Which is a good sign that it is True to customs.  Instantly greeted with a smiling face.  Ask for Karen.  Great with recommendations and attentive. We had the queso frito for an appetizer, delicious.  Well formed, caramelized cheese without the breading.  Our main course was Churrasco for the main meal with moufundo and flan for dessert.  Very reasonably priced, seasoned just right, mild on spice.  Delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hzv4FW8VqNdz0-HFMLDmgA",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Flan.  Forgot to take the picture before digging in.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hzv4FW8VqNdz0-HFMLDmgA/o.jpg"
      },
      {
        "img_id": "L1tdoGqVaiXWd4LurWjulg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Liquid paradise lives up to its name.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L1tdoGqVaiXWd4LurWjulg/o.jpg"
      },
      {
        "img_id": "m_ryfJ2_payYAJxMcydJYA",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Queso  frito.  Fried cheese without the crust.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/m_ryfJ2_payYAJxMcydJYA/o.jpg"
      }
    ],
    "user_id": "NMpKbj6L4mwLBpbZuFPw8g"
  },
  "KFx6M9yxBWtXuHDMPQsf6w": {
    "date": "11/10/2017",
    "text": "Delicious, reasonably priced, and authentic! I definitely consider this one of Charlotte's hidden gems. The staff is always friendly and the service is quick! You can't beat the lunch prices. An entree and 2 sides is around $7 which is amazing given the decent portions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7tbCYkc3_wN6_RoxHNn4cw"
  },
  "79i8aBd6O-FmCdMS5dP8nQ": {
    "date": "5/14/2017",
    "text": "Amazing food! Great customer service,  a little small,  hubby had the mofungo steak and I  wanted to try the bbq, but they were out of it, so I ended up getting the stew chicken, which was great ,very tasty I love it, would definitely go back and highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RXUYjKJdwyPPsPE5NSvFSg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RXUYjKJdwyPPsPE5NSvFSg/o.jpg"
      },
      {
        "img_id": "jiCcm8gSavf821vf3zxxWw",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jiCcm8gSavf821vf3zxxWw/o.jpg"
      },
      {
        "img_id": "L4y-SHDw7NiCJVZPGmjgwA",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L4y-SHDw7NiCJVZPGmjgwA/o.jpg"
      }
    ],
    "user_id": "RVD6wpycpGxkF_Wv61AOFQ"
  },
  "iP9Ol3owBGOzh4vL8Ut7Jg": {
    "date": "8/23/2016",
    "text": "They only deserve 1/2 star  Saturday evening my wife and I stopped by for dinner it was around 7:30-ish, the place was not full, it was starting to get a little busy but not crazy Probably 8-9 tables We ordered the mango juice which was very good. My wife ordered the torta cubana  and I ordered el Rabo de Vaca. After 20 minutes we noticed that patrons that arrived much later than we did got their dinner so we asked our server about our order  She replied \"they ordered simple meals your order is complex\" SERIOUSLY!!!! A sandwich and your star dish is complex? We saw a stew, fish plate, a few Moro and tostones plates, chicken steak etc, come on!!!  So with a broken heart and an empty stomach, we left 40 minutes after we placed our order; we didn't even get any bread!  I imagine the food maybe good, the other 6 tables of patrons that did get their food seemed to enjoy  I get it, we all make mistakes, what bothered me is that they tried to lie, if they would have come clean that they forgot to place our order, you know we would joke about it and move on.  They offered to make our order to go and for free but by that time we had lost our appetites   We hope that in the near future we have an opportunity to return and actually taste the food.  They were at least decent enough not to charge for our drinks",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "70yF-t7viVfbPyK6jB472Q"
  },
  "WFA71VcFqunXTv4ztihhSA": {
    "date": "2/20/2017",
    "text": "I have heard so many good thing about this place for months now. A friend of mine is always talking about how juicy the pork-chops are, the mofungo is delicious etc.  finally two weekends ago I went. As I walked in the hostess stand is right there. I can't really say I was \"greeted\" by the three young ladies but rather looked at. I was asked if I knew what I wanted, I said no and was handed a menu. After a couple of minutes I figured out what I wanted and proceeded to place my order. Getting help was like pulling teeth, at one point I stopped looked at one of the girls and asked if she was even listening to me. She wasn't! Finally I put my order in and waited. 15 min into me sitting there another girl had asked if my order was taken and put in the system and by the time I was ready raise hell if it wasn't. Finally I got my food. It smelled so good the whole way home. I dug in and damn near choked? Why?! Because the only moist thing in $28 dollar worth of food was the salad. The porkchops taste like they'd been cooked in old oil and the mofungo had no taste and was dry as hell.   Service was crap and so was the food!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6_rED6lCPezIfAfbkZUQew",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. $28 dollars worth of food and the only moist thing on my plate was the salad.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6_rED6lCPezIfAfbkZUQew/o.jpg"
      }
    ],
    "user_id": "jGe-d9C80ZSSPuv-9dH_fA"
  },
  "8mC15BXV49Ey1ObQY7tEQg": {
    "date": "9/13/2015",
    "text": "This restaurant looks tropical on the outside which made me feel like I was in the Caribbean. The inside is also nice as well.  I went with my family and ordered two kids meals (cheeseburger and fries) which my kids enjoyed. A side of Moro(rice and beans mixed) which had a nice flavor to it, and two orders of mofongo,one with shrimps and the other with chicharron (fried pork). I was surprised by the presentation of the mofongo. It was a great portion as well. The food was very good. The waitress brought out warm garlic bread before our food arrived. We had beer served in an ice cold glass,very refreshing.   The only thing I would complain about is the waitress, she didnt show effort or good service,besides that I would go again and maybe next time we'll  get a different waitress.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5cX27uqNr_LmxKAkBNkGpA",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Mofongo with shrimp &amp;amp; the other one with chicharron.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5cX27uqNr_LmxKAkBNkGpA/o.jpg"
      },
      {
        "img_id": "budy6vP9ioLyNe6WekNXZg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Ice cold beer and menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/budy6vP9ioLyNe6WekNXZg/o.jpg"
      }
    ],
    "user_id": "9e7Pds8czHxVVM9faBfRjg"
  },
  "x96jAYFpwU8VDNBKJu-RwA": {
    "date": "7/18/2018",
    "text": "Went here with a friend for dinner. I had the fried boneless chicken with yellow rice and sweet plantains.  My friend had the stewed chicken. She said it was good and tasty. Our sever was nice, however there was a language barrier.  It was difficult for her to understand us and difficult for us to understand her. We had to repeat ourselves to ensure she understood us or tell another server. The highlight was the pina colada. It was so good. I would definitely recommend this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0wiqr0y1-u0bbNLcbmMJVw"
  },
  "lc4amjFv6_tcTxuMUbxFFw": {
    "date": "1/9/2018",
    "text": "This is a great place to visit and eat if you want that Dominican vibe. Living in La Romana for years, it's always nice knowing there is a place near by that I can go to get that environment. The food is great and  the service is also.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ojip7bXnqm6KEkhtKhMBoQ"
  },
  "8IHcLflbn3LjkN9UQaZA2w": {
    "date": "5/5/2017",
    "text": "Coming from NYC great Dominican food, is a way of life. My family and I were delighted to find a Dominican Restaurant nearby and eager to try it out! We were not disappointed!  The food was EXCELLENT! The restaurant was clean and the staff was extremely helpful and attentive. I had the mofongo and garlic shrimp which was fresh and flavorful! I also had an order of chicharron (cracklin chicken). YUM! My brother had the charrasco steak, yellow rice & blk. beans. My boyfriend had the Bacalao which is cod fish. We were not doing to much talking, as we were to busy devouring our food! We also each ordered a tropical fruit drink which was equally delicious. Two thumbs waaaaay up! We will be back VERY soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IzUj24C6JJJsAqsmtgUMIQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Chicharron, yellow rice, sweet plantains and black beans!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IzUj24C6JJJsAqsmtgUMIQ/o.jpg"
      },
      {
        "img_id": "uZZlzlkVClFh4YmkVuUVQA",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Mofongo and Garlic Shrimp!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uZZlzlkVClFh4YmkVuUVQA/o.jpg"
      }
    ],
    "user_id": "aC2ozIv-4uLmrlAom2jzvA"
  },
  "L9eVJTaflWfI8jvjvvMdtg": {
    "date": "7/17/2016",
    "text": "Just got back from Puerto Rico so I wanted to see what the food was like here in the mainland.   Perlin (roasted pork) mofungo and plantanos maduros (fried ripe plantains).  Food took a while to get but it was worth the wait!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "L18KPTeLjsGjC4as328faw",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L18KPTeLjsGjC4as328faw/o.jpg"
      }
    ],
    "user_id": "8NIgraw6Qd2KtBkqP01csw"
  },
  "pAnXth2a_luccHRcde4m-A": {
    "date": "5/7/2016",
    "text": "My original post below is nicer than the one I'm going to leave today...  This place totally sucks!!! I tried - God knows I tried but I just can't go back and spend money at this place..  The food was HORRIBLE. Grilled chicken breast was a tasteless cracker and pork looked like road kill.. And $3.50 for a glass of lemonade... NO REFILLS.. Yeah - I'm totally done with this place.  It was ok years ago but not now.    Original review below:  I know most restaurants have different cooks and it was obvious today.  We come here quite often and have never had rubbery pork and stale mofongo.  Not good today... Not good at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "WRKK8x3pJeUKhyulHGyrhg"
  },
  "ls8jTizNbLh1gaVfFRpORA": {
    "date": "5/25/2017",
    "text": "I brought a Dominican with me along with and 2 other gringos. I have studied in DR and know the food pretty good. Food here was amazing and no issues with service, like some of the other posts said. We will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nmnVCrVjS5mwOen0lCZ6Eg"
  },
  "YgnIapshDOdgAkk1WetAjg": {
    "date": "3/9/2016",
    "text": "The food was greasy and obviously microwaved. The place was empty, freezing and the service was sad. They even tried to deny my coupon, I'm guessing because they don't make enough money as is.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oYf5m0vyL7AOXBicacw5GQ"
  },
  "kKhnETQgkuxkkryHyfCiKA": {
    "date": "1/7/2016",
    "text": "Full blooded Dominican and was looking for a authentic restaurant. We ordered quipes and they were burnt. Worst quipes I ever had. My steak sandwich was so bad I only ate half of it. My husband's mofongo was stale. First and last time eating here. Very disappointed. Service is a little slow. My husband ended up getting sick from the food soon after we left.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "0WV0V6aXRUjfRs3lQr7ESA",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Steak sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0WV0V6aXRUjfRs3lQr7ESA/o.jpg"
      },
      {
        "img_id": "nw8SRBfGVYdaHXUoxTWHBw",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Mofongo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nw8SRBfGVYdaHXUoxTWHBw/o.jpg"
      },
      {
        "img_id": "spXKlQacvAt-ivFekhJk7A",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Quipes were burnt. Not fresh at all.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/spXKlQacvAt-ivFekhJk7A/o.jpg"
      }
    ],
    "user_id": "qjwGfxSM5Jvt9_4_SKaCfA"
  },
  "HapIlxXitYydoK4qcaWKRw": {
    "date": "1/2/2016",
    "text": "The food is delicious and the prices are great. If you want authentic Dominican food in Charlotte, Punta Cana is the place to go.  The service is hit or miss, depending on the server; but it's worth it for the food. My husband and I don't live close, but we frequently make the journey just for the food. I definitely recommend coming here. You just need to ignore the occasional slow service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "6xTKq5PcNyIP-UD9DC9svQ"
  },
  "NK7cvyfNZuTj3UYn1dbRqw": {
    "date": "3/7/2016",
    "text": "The food here is amazing, I have been here a few times, it's real authentic Dominican food. I brought my co-workers here on a few occasions. I've tired half the menu and have loces everything i've tired so far!  I'd give 5 stars, the food is amazing and they give huge portions (always have left overs for lunch next day) but the service sucks and seems to get worse with every trip.  In order to get water re-filled after having been seated for over an hour, I had to grab another waiter (who also tried to ignore my attempts of grabbing her attention) and the food takes a while to be prepared ( which is okay because it's delicious) but the waiters basically ignore your table until then.  But again don't let that stop you from eating here! Maybe just take your food to go! Which is what I've been doing if late!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "minL5-jCc-9syGTBN6IN4g"
  },
  "ffEWq15Kqy1RH-cqMdLWvQ": {
    "date": "12/30/2018",
    "text": "Visited last night. First time. I had a blast. The food was delicious! After 10PM the lights go off and the dancing begins! Will definitely return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T6fNnJhKi6FfgYjcAZIi9A"
  },
  "mP5sAShS_xWjZ2oSGEdJ7g": {
    "date": "8/19/2017",
    "text": "I'll start with the food and begin by saying it's subpar. Charlotte has a lot of work to do in the Latin food department, they're slacking! The restaurant isn't the most appealing and the service was lacking as well.   There was however something that caught my attention deserves praise. I observed what appeared to be a homeless man walk in and ask for a menu with no apparent intention on purchasing any food. A woman who quite possibly could be ownership immediately noticed his need and without hesitation offered him a full free meal! It was a very kind and generous gesture and on that alone they deserve 5 STARS!   Unfortunately, they have some work to do on their food and the cleanliness of the restaurant.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "SsgQvE1wfZnujss2KIBAtw",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Lunch specials",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SsgQvE1wfZnujss2KIBAtw/o.jpg"
      },
      {
        "img_id": "3QD8Gj-7he_OhiP3i1oC4w",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Cleanliness is an issue",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3QD8Gj-7he_OhiP3i1oC4w/o.jpg"
      },
      {
        "img_id": "JHVbmu3v_ah7rEJghkf77g",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Stewed Beef w/ Red Beans",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JHVbmu3v_ah7rEJghkf77g/o.jpg"
      }
    ],
    "user_id": "HrMv8vtW9Cpgi6O5jHcojQ"
  },
  "2k-388SMl79Vkp5yOgoK-g": {
    "date": "3/28/2018",
    "text": "Came here recently to celebrate a birthday . We waited a long  time but we also had a large party so it was understandable  . The service was pretty slow and the food was ok . The portions were a good size though . My party really enjoyed the music , dancing and singing that they had on Saturday night . We'll definitely be back as we really enjoyed our time . They will also sing happy birthday to you and bring out your cake  for your birthday which was a nice touch .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OLuUKziDAxPZie7OUy00ig",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Res Guisado",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OLuUKziDAxPZie7OUy00ig/o.jpg"
      },
      {
        "img_id": "oTHKabsbiySH31kVMq8TSg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Res Guisado",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oTHKabsbiySH31kVMq8TSg/o.jpg"
      }
    ],
    "user_id": "lgwZbztTZlKbuiD88cSPcA"
  },
  "w8Pvg5vG5CjUHS9Qs59N3w": {
    "date": "5/27/2017",
    "text": "Oye pana esto ta bueno! First time in Charlotte NC and we always gravitate to Latin food we can't find back home. This Dominican restaurant did not disappoint. I had pernil (fried pork), hubby had rabo (ox tail) live DJ on sat playing all popular hits. Mango margarita was delish!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BAE60RmOkIFz_qTWv5hlZg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BAE60RmOkIFz_qTWv5hlZg/o.jpg"
      },
      {
        "img_id": "B5_wnW897iHSz181vDaNtw",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B5_wnW897iHSz181vDaNtw/o.jpg"
      },
      {
        "img_id": "97KFGUv6ZPO3FyfCkhUJOw",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/97KFGUv6ZPO3FyfCkhUJOw/o.jpg"
      }
    ],
    "user_id": "h5viH3TdqkGF3tHxyAjVSQ"
  },
  "mimemUN6eNqDdDjOU5UlFQ": {
    "date": "8/7/2018",
    "text": "Perfect.  Very authentic.  Huge portions.  Loved every bite, and plan to work my way through the whole menu.  I lived and worked in Dominican Republic, so I actually know it well.  In fact, my team there gave me a nickname \"Senor Mofongo\"!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X-TLsRmCM1nZs2dXxCUkBQ"
  },
  "zlfkMYIdMoUPF7Wnutb3GQ": {
    "date": "7/20/2018",
    "text": "Food was great. Super delicious. We met the executive chef. Great guy. Super cool place. If we ever come back to NC we def coming bck here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eD_Nn7YX5rsj7DfB9TLupg"
  },
  "oDeMiC7p-6-t1rPbEOm-qg": {
    "date": "5/19/2019",
    "text": "My wife and I are very experienced Foodies, and very experienced with all types of Latin food.  At this place, the Service was horrible, the food was horrible, and the bill was over charged.  There were only a few guests when we arrived, but it took about 20 minutes before we were waited on to order drinks.  It took about another 20 minutes or more for the drinks to arrive.  Then another long wait for the waiter to take our order.  He had no clue about the menu items.  I ordered the Seafood Stew for 2 for my wife and I, and also ordered a salad and tostones.  I asked that the salad and tostones be served first as an appitizer.  The waiter had a hard time understanding this concept.  It took about another hour for the food to arrive, and although I had again requested the salad and tostones, they came with the meal.  The Seafood Stew was about the size of a single portion for $27.00 dollars, and the quality was terrible.  Tiny little pieces of overcooked mystery meat, and a couple of small crab legs with no meat.  Then the check came and we were charged for a $7.00 Margarita that we did not order.  After a back and forth with the waiter, he \"remembered\" that it was for another guest.  I did not plan to leave a large tip based on the service. After I signed the bill, I discovered that they include a 10% tip in very small letters at the very bottom of the bill.  They have a very large space for a tip.  Very deceptive.  This entire fiasco took several hours.  In summary this was a miserable Friday night dinner and a waste of money.  This did not appear to be a one off, it appeared to be the norm.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cdd5vS0cWa0QDXGah_QYeQ"
  },
  "DySx8qyz-WWKtmAyx6u_4A": {
    "date": "12/24/2016",
    "text": "You know a Dominican place is legit when you walk in and you have a table of guys playing dominoes in the sun room.   It was my first time here and I ordered off the Especialidades de la Casa section of the menu because I wanted two sides to come with my entree. I chose the Chivo Guisado (Stewed Goat) with Arroz Amarillo (yellow rice) and Platanos Maduros (sweet plantains). I hate to brag, but I WON dinner. My goat was tender and the sauce that the goat was cooked in was rich in flavors. The rice was cooked well and didn't need anything added but I still poured all of the stew sauce on the rice. The plantains were so sweet and fried perfectly, crispy on the outside, warm and comforting on the inside.   My boyfriend got the Bistec de Palomilla (Sirloin Steak) and he chose to do Mofongo. I was very excited to try the Mofongo because it was my first time. The Mofongo was thick and filling and had Chicharron in it which was a nice addition. I ended up putting hot sauce on the portion that was shared with me. I think that I was so swayed by my meal that his tasted bland.   I also ordered a mango juice with milk that was made in a shake form which was wonderful! All portions were huge, the service was good and we would definitely recommend this place to anyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KLSYZW8duMeJA-rFySjwSg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Mango shake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KLSYZW8duMeJA-rFySjwSg/o.jpg"
      },
      {
        "img_id": "zY2WmxOn_9oOdrPS7Ts5YQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Bistec de Palomilla (Sirloin Steak) and Mofongo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zY2WmxOn_9oOdrPS7Ts5YQ/o.jpg"
      },
      {
        "img_id": "bGPr47lJI9OSbaSoqcngJg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Chivo Guisado (stewed goat), my sides were Arroz Amarillo (yellow rice) and Platanos Maduros (sweet plantains) but were sadly not pictured!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bGPr47lJI9OSbaSoqcngJg/o.jpg"
      }
    ],
    "user_id": "zWA0pKXHS0QH8rdf_kvUDw"
  },
  "0Z-dM2Q9UjVIJ2_TmXo01w": {
    "date": "10/22/2018",
    "text": "See Julio review below. VERIFY YOUR LINE ITEMS AND RECEIPTS. YOU WILL LIKELY GET DOUBLE DIPPED. Their food is OK - won't go there again. When you get your receipt - they automatically include the 15% tip. When you give your credit card - they will bring back the receipt to sign with the line item on it for gratuity AGAIN OVER THE TOTAL THAT ALREADY INCLUDED THE GRATUITY - so if you don't pay attention you will have paid a 34% gratuity. YOU HAVE TO PUT A ZERO IN THE GRATUITY LINE. However they will no provide you the original line item receipt anymore. This is clever deception and also I don't respect restaurants that automatically add gratuity - it defeats the meaning of the word : it is earned for service. So now I won't go there again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mVGhr2oYG6SuM_VNJsPVww"
  },
  "YAUJlzjxjYgWuI6vqilKHQ": {
    "date": "8/12/2016",
    "text": "This is an authentic Dominican spot that will enlightened your taste buds. I've visited this location before for lunch and the food was really good.   However, this time around there were a couple of things that could have been improved. First and foremost, the check-in Yelp offer isn't offered and we were told that the discount has been requested for removal. Hopefully, this gets straightened out because we weren't the only party to inquire. Second, the combination rice has a crunchiness to it (as expected) but on this trip the crunch made the side item un-enjoyable.   I wouldn't totally count this place out because the staff were really nice and our food was delivered to our table fairly quickly. Maybe I will try them again some time in the future and see what their pastas have to offer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cuHp8luhexZ8XP97885d8g"
  },
  "QxYtlsSzpxHjYDHnPF2ZPw": {
    "date": "5/9/2018",
    "text": "This is a good place to go and eat Spanish food, the service it's great and you have fun.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E4j6K0qfQMb7uZ8hMLcakA"
  },
  "QzW--nNghsSMKR7u-xx2YA": {
    "date": "5/29/2018",
    "text": "the food, the cocktails and the service were excellent my family and I had a good time in Punta Cana rest",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D4qSs4xEz4vGGhPor9UiOQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Perfect",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/D4qSs4xEz4vGGhPor9UiOQ/o.jpg"
      }
    ],
    "user_id": "cGgKEGNnLjzp4Iw7__sOmw"
  },
  "B6h9rrPsUYVNBK6WfOWZQw": {
    "date": "3/20/2018",
    "text": "Love this place.. Great place to visit on your lunch hour or wasnt yo crowded and there was really no wait for my food. I ordered the Stew Chicken with sweet Plantains. Very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Io_6Dt4L7gKsyNIo8kAS0g"
  },
  "dl6IbBnPsX6S-mzGDu4q-Q": {
    "date": "5/18/2018",
    "text": "Love it. Every time I come to charlotte this is a most do. The food is very authentic and the flavor is money",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J49sjQ0vsZcYDaR8lyaXQQ"
  },
  "1poP_d87B2p4OoIgbSGjYw": {
    "date": "6/25/2017",
    "text": "Great food good Dominican vibe... I would recommend to try it out! I was definitely satisfied",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4RNfQjwTPhFHtX-3hEDW9g",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4RNfQjwTPhFHtX-3hEDW9g/o.jpg"
      },
      {
        "img_id": "1pUVTSVV8oyDogXBxYqdxg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1pUVTSVV8oyDogXBxYqdxg/o.jpg"
      }
    ],
    "user_id": "jiN2FjOnxf803VlRFjnA-A"
  },
  "KIPdMlh5JrLrUoxPa5_ouQ": {
    "date": "3/23/2018",
    "text": "This place deserves much better on views on yelp. Absolutely love the seafood paella and churrasco steak !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8cLm6Ztan_LZe0fJTJFvFQ"
  },
  "Lt2c5pZi22D315pZGqkAjg": {
    "date": "2/9/2019",
    "text": "Horrible service. Wish I could leave a 0 star. Came here with my family for lunch and ordered a grilled chicken breast (which comes with 2 sides). When I finally got my order the chicken had so much salt it was inedible. They took the chicken breast back, no apology, no \"would you like something else\", nothing, just said will bring back to the kitchen. At this point I have no meal and have to wait for my husband to eat (his food was ok, far from great just ok). We asked for our check and were \"kindly\" informed ONLY the chicken would be taken off our bill but we would still have to pay for the 2 sides that it came with!!!! Our waiter said it was her job and she would get the manager. We are still waiting for the manager as he/she never came. Mu brain can't still comprehend this. I ordered a meal that comes with 2 sides, the main thing in it is crap but hey the sides that it comes with are ok so eat them without the chicken and we will charge you for 2 EXTRA sides now. I didn't even touch my sides as they were to eat WITH the chicken!! An apology and taking my meal of the bill would've been just fine. Instead unprofessional waiters were chitchatting and looking at us from the register like we'd done something wrong. Unfortunately this was one HUGE disappointment. Worst customer service EVER!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M6HvewYy1vfA59Ppy07oqQ"
  },
  "borv3ZXLvqs2DXh1CZAydg": {
    "date": "5/2/2018",
    "text": "Stopped here before a concert with some friends. My friend recommended this place. Definitely was worth it! The food was amazing! The service was okay. The guy was kinda rude but he got our order right and tended to us properly. That's what is keeping me from giving 5 stars. I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KUMlYPYIjCZ4jnIpvdjhXw"
  },
  "VnH3c0K9e1OGbOB3g2iKqg": {
    "date": "7/30/2017",
    "text": "First let me start off with saying that if you have never left the Carolina's and not accustomed to Caribbean food, please do not make posts about the food. Second, me n my husband are both natives from the North, and we know good Caribbean food. Thirdly, as soon as we got our meals pernil con arroz y tostones we both felt instant nostalgia. The food had such a feeling of home that I enjoyed every part of it. The atmosphere felt like home, currently listening to La India on the radio. The only complaint me n my husband had was our tostones falta sal (didnt have salt). If you arent going to appreciate something different please don't come here and then complain and for ricans, dominicans y cubanos looking for the closest thing to home this is it. We waited less than 20 mins to get our food and we were met within minutes of being seated!! We plan on bringing our relatives when they visit!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qi_FlWHUNi71FBM44ja6eQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qi_FlWHUNi71FBM44ja6eQ/o.jpg"
      },
      {
        "img_id": "0e5_jdUoXZkuxydF7RMdAg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0e5_jdUoXZkuxydF7RMdAg/o.jpg"
      }
    ],
    "user_id": "Apcg44dRWDDp677tXHTNOA"
  },
  "ShUIfXvW70Ls-oeghAigAA": {
    "date": "3/23/2018",
    "text": "This place is very underrated. I keep going back there for the seafood paella. The servers are super friendly. The portion size are always good to share between two people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cm-2kuKUH8l6CCVAz_xN4Q"
  },
  "T48IJZI3yFC4ZWYXw72eJA": {
    "date": "7/26/2019",
    "text": "Updating in July 2019 from a previous 2018 review:  A staple in latin american cuisine in Charlotte, specifically DOMINICAN FOOD.   The Food: the food receives 4.5 stars. This place is known for Dominican cuisine and I myself am Dominican, I can vouch for the chef here. The food is tasty, I'd recommend trying any of the \"pastelitos\". Otherwise, I was very pleased with the quality of the food, the seasoning, the taste etc. Definitely delicious and filling. I would also recommend the \"chicharron the pollo\" which are breaded up chicken chunks. If you're a vegetarian, their sauteed eggplant is delicious.   Most of the staff is friendly and generally attentive. It's nothing super fancy in here, just hot, fresh Dominican cuisine. Also, don't bother trying to check in on Yelp and use that 20% off voucher for checking in on Yelp. The owner told me they didn't do business with Yelp in 2 years and that they would not honor the coupon. Very disappointing, should not be popping up then if you wont honor it.   Will I return? Yes, the food will make me return every time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "VVxDe3-2NdjFPRj1z8Fpgg"
  },
  "lo8WMR7gFzIbbfucRxEwLA": {
    "date": "7/14/2019",
    "text": "SAVE YOUR MONEY, don't come here! I've lived here 2 years, and finally decided to try Punta Cana.  Being Dominican & Puerto Rican, from NYC I know what Dominican food should taste like.  Let me tell you, this isn't it, not to mention the pride a Dominican has in his food and cleanliness was definitely missing from this restaurant and it's staff.  SAVE YOUR MONEY, don't come here!  Tostones were burnt, the Rice not cooked thoroughly, the service absolutely the worst.  Overpriced for the quality of service and the final product.  Wow, never realized how much you miss uptown food.  Go to Compare supermarket & buy the ingredients make a fun night of it and go on YouTube and cook it yourselves.  You can do any worse yourself then they do here at Punta Cana.  That name alone comes with a standard and I can't believe they chose it for this business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC7U9HV3c6ZfZdv_xgx2Uw"
  },
  "Z8d8GMElzCR8ANyIXP3Q5Q": {
    "date": "5/22/2019",
    "text": "Dude where do I start...!  So when I get there I ask about the menu and it is apparent that I've never been here before I ask what type of restaurant is this come to find out it's a Dominican base restaurant. Instead of the waiter helping me navigate through the menus he walks away and For about three minutes then comes back and asked me if I would like a drink. I put my drink order in he comes back a minute to two minutes later and I'm still asking about a normal way to would assist someone with selecting their mail knowing that they're new to the restaurant he left again so I asked him for his advice when he returns he told me what his advice was and I chose it. The mail came very quick because there was nobody there I should've took my warning the food was not seasoned the way I was expecting it to be but it was edible and I ate that meal completely because I was hungry I asked for another drink thinking that there were refills on the lemonade oh no you pay for your lemonade each one which might I tell you the glass of lemonade if I would've known I would've asked for less ice. I was finished eating and my waiter sat down to eat his meal needless to tell you I sat there an extra 20 minutes waiting on him to send my finish eating his meal so I can cash out on my meal,  it was so bad that the other waitress had to come over and assist and take my plate. It was so bad I had to get up go to the cashier and asked to see if I could cash out my waiter got up rang the ticket gave it to me in a booklet in front of my face at at the register, needless to say I was not very happy with the service there and the mail was very expensive one meal cost me $17.95 and he added his tip into the equation, mind you he short changed himself.  So enjoy yourself going forward and take it for what it's worth it to treat one customer like this imagine how they treat the rest of the customers, maybe it's one of those restaurants where you have to know the people that own it so you can get good service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OgZqDaPjyliabkP8xST1PQ"
  },
  "8GP_LmkKDnCCCatl0Rv-fQ": {
    "date": "4/16/2019",
    "text": "The food is all that and more! Never have I enjoyed my dinner as I did tonight!    Homey unassuming family style Dominican restaurant offering some of the best I've had.  Reasonably priced and very generous portions.  I even tried Soursop juice which was delicious and good for you!   I chose the steak and shrimp combo - skirt steak cooked to order with some of the best chimcurri sauce ever known (this stuff could make cardboard taste good!) 8 large shrimp in a savory curry garlic sauce with red beans and rice and sweet platanos or plantains    The service was fast and our waitress checked on us regularly.    The only disappointment was I checked in via Yelp and was suppose to have a 20% off on my order but they would not honor it.  You shouldn't offer if you don't plan to honor.    But because the food is delicious I let it slide",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HF5OXRCM2nRM8bPEv3vnuQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Shrimp in a curry garlic sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HF5OXRCM2nRM8bPEv3vnuQ/o.jpg"
      },
      {
        "img_id": "8J9ru-5KmJA3ibyI8H7ESQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Rice n beans and sweet plantains",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8J9ru-5KmJA3ibyI8H7ESQ/o.jpg"
      },
      {
        "img_id": "Jblcyk2kSjHYvkYeHIHwtg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Skirt steak and the most delicious chimichurri sauce ever!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Jblcyk2kSjHYvkYeHIHwtg/o.jpg"
      }
    ],
    "user_id": "5_vvuAY9sOVbJtBon8ce2A"
  },
  "xR7hQRh8shWt5BT85aQpJg": {
    "date": "8/16/2019",
    "text": "Food was good sides are pretty big quantity but the main dish weren't too big.we went on a Friday night. When they had live music which gave it more interest. I just wish it wasn't too <a href=\"/redir?url=http%3A%2F%2Floud.it&s=4d1c26d56ce7fed1ff3739ebb3f5766e8cb09d25b415acde08cccd5edbaee7df\" target=\"_blank\" rel=\"nofollow\">loud.it</a> was hard to hold a conversation with the people next to me. All the food was good over all!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m0GfnlQaPg5yiMNfGrtnoA"
  },
  "Ie3YtXQFEJcGlvkMPArS0Q": {
    "date": "6/10/2019",
    "text": "We hadn't been to Punta Cana in a while so decided to stop in for lunch on a Sunday afternoon. The place was moderately full and lively. We took our seats. Unfortunately my husband cut his finger pretty good on the snagged wood on the chair. Fortunately, I had first aid cream and a band aid for his finger. Once we got him sorted out we ordered. They bring you a small basket of bread and butter while you wait. Nothing special, but I was glad to have something to munch on before our order came out because I was really hungry. We ordered fried, bone-in chicken chunks, with white rice, yellow rice, plantains and salad. It was good, but the taste of a few of my chicken chunks was off, like the meat wasn't good or something. I was a little hesitant about them but ate them anyway.  I guess I was in the mood to live dangerously. On the other hand, I always enjoy the salad. It's in some sort of vinegar based dressing and always tastes fresh. The rice is good too. Overall, our visit turned out just okay. It took forever to get the bill, and it was a bit pricey to me. Considering all of this I'd say our experience was fair. Not sure if I'd return any time soon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MI1x2EDocJYZp40hJgTMmA",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Bone-in fried chicken chunks. A few tasted a little off- putting to me.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MI1x2EDocJYZp40hJgTMmA/o.jpg"
      },
      {
        "img_id": "l-o8mqF1ydt0EdtTXFUmAA",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Fried chicken chunks, yellow rice and plantains.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l-o8mqF1ydt0EdtTXFUmAA/o.jpg"
      },
      {
        "img_id": "nZglVG5rP4H_nDMaAv117w",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. White rice and salad. Very good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nZglVG5rP4H_nDMaAv117w/o.jpg"
      }
    ],
    "user_id": "EHq8HvrDG-VaJ8rjyjVUYQ"
  },
  "0SLLMfeuSSm_u90JxdB_yA": {
    "date": "6/18/2019",
    "text": "This is the first place I've tried Mufungo from. I ordered the Chicharon De Pollo with boneless chicken. I enjoyed it, I was afraid that the plantains would be sweet but they were not. The chicken was fried perfectly and seasoned well. It is a nice little spot with authentic food. It is not the place you come to for service, just great tasting food. They have a set up for live music that I've heard is actually pretty good.  Note-this place isn't good to bring a vegetarian friend too, a lot of main ethnic foods that you'd like to try have meat or pork broth cooked in (and it does not list that on the menu). I was surprised that the mufungo had pork cooked in with the plantains and the sauce definitely was full of pork stock and bones. Although I still tried it knowing I'd have an unhappy tummy later lol",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vE-atdPSROhfiS585WdqWw",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Chicharron De Pollo without the bone",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vE-atdPSROhfiS585WdqWw/o.jpg"
      },
      {
        "img_id": "FpQA5nKpSwdvSTZ36NnIYw",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Chicharron De Pollo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FpQA5nKpSwdvSTZ36NnIYw/o.jpg"
      }
    ],
    "user_id": "UEEWfXjGCbDGfeKdQ6lG4A"
  },
  "oXbsa7mjP9VUUKFz-ob2lg": {
    "date": "8/9/2019",
    "text": "Great all around! If anyone gave it less than 5 stars they do not know what good food is! Everything we got was great. 1st place my wife and I said reminded us of CA food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qlccZO_g4Q_86vqXWa4Yhg"
  },
  "aaKv_J77hPpglzGcsAj4-Q": {
    "date": "8/21/2018",
    "text": "This place is amazing! Very authentic Dominican food. I'm from Washington heights (NYC) so I know good Dominican food when I have it. The food was sooo good. The waitress was attentive and seemed to also be Dominican.  The churrasco was BEYOND delicious. The plates also come with 2 sides.   The chinola juice was fresh and sooo good!! I had 2   This is a hidden gem in NC!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j41KAv8siG8l7hGNa2Oqxg",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j41KAv8siG8l7hGNa2Oqxg/o.jpg"
      },
      {
        "img_id": "SdR-DVBA-3q2RQXs8YVY_A",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SdR-DVBA-3q2RQXs8YVY_A/o.jpg"
      }
    ],
    "user_id": "qs6HoxvK61Hxa53IX9ilwQ"
  },
  "yC-IV6Exc3wm7g_TxJ4fAA": {
    "date": "11/30/2018",
    "text": "After initially liking this place, my family will stop eating here due to unfortunate events.  Punta Cana originally agreed to cater our baby shower. The baby shower is at 11am. We talked to numerous people months in advance to plan to have certain dishes ready for this time. Because the shower starts at 11am we had planned a food pickup time of roughly 10:15am.   Today my wife called to do a final check-in with the restaurant to make sure everything was all set. A new manager and person she had previously never talked to said the food COULD NOT be ready before 11am. We are two weeks from the shower and they now say it's \"IMPOSSIBLE\" to have the food ready for the shower. My wife tried compromising, asking if 10:30am or 10:45 would work. The lady declined. There was absolutely no way they could get it done. What if we paid extra?...nope. Utter and complete BS from someone that clearly doesn't understand how to run a business.   My wife eventually accepted the lady's excuse of \"it will take an hour just to cook the eggs\" and due to frustration ended the conversation. (no explanation of how that influences them being able to have it ready by 11am but not any earlier than that...)  We are now two weeks away from the shower scrambling to find another caterer. All the while my pregnant wife is trying to comprehend why a restaurant can have something done at 11am but not a minute earlier. We won't be returning here and will sadly no longer support this restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "VudmiL8eKqjVNawwz1wU6w"
  },
  "ER2NTsswLoTb0JHEWnAwPA": {
    "date": "5/31/2019",
    "text": "BAD BAD BAD SERVICE! Seems like you have to be a regular to get good service. My food was cold, the yellow rice was burnt and hard. A waste of money!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bytUNtzKY2vGZRWZ7z_5QA"
  },
  "yYznGSDRkHQm5wvK7BiFrQ": {
    "date": "10/9/2018",
    "text": "My first impression was excited because when I did my YELP check-in, a 20% coupon popped up on my phone.  It said that 20% would come off of the total bill.  When I showed my server this, she took my phone and supposedly showed it to someone above her in the restaurant.  She came back and informed me that they no longer participated in YELP.  I will definitely be reporting this to the YELP administrators. In the meantime, I ordered the POLLO A LA PLANCHA with red beans (Habichuelos) and Platanos Maduros.  My favorite part of the meal was the mile high pile of maduros on my plate. I have never had a serving of maduros as big and I loved every bite. The chicken was good as was everything else.  The restaurant was as clean as a whistle and quite spacious. I loved the decorations.  I always comment on the quality of the iced tea since I am a huge iced tea fan.  The tea was divine, but they did not have Sweet and Low. All restaurants should offer the pink packets, as well as the blue ones and the yellow ones! It just isn't expensive to stock all of these for their customers.  I left with a good taste in my mouth, due to the yummy food.  The Yelp Coupon still irks me and if I could give a 3.5, I would. I rounded up, based on the quality of the food and the atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tHDrmwepJkDGHPtptYvkpQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. RrAm  d",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tHDrmwepJkDGHPtptYvkpQ/o.jpg"
      },
      {
        "img_id": "U0qH8eqOHzL1qaQmMUJiEQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/U0qH8eqOHzL1qaQmMUJiEQ/o.jpg"
      },
      {
        "img_id": "pwTGjttsH6Aqc22Yq-gClQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pwTGjttsH6Aqc22Yq-gClQ/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "udgl_xQqPNTUAlaXv7JWJA": {
    "date": "11/4/2018",
    "text": "I got the skirt steak with rice and beans and avocado. It was so good !!!  So much flavor and the waitresses speak Spanish and although I don't my husband does and they spoke English to me  Will be going back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WmuqgtmO69NshIg07etHcg"
  },
  "GMvLVgx9b8N253gLtoS3aQ": {
    "date": "10/9/2018",
    "text": "Enjoyed lunch with my friend Michael.  Place looked spotless with shiny table tops, simple decor and nice wait staff.   Cute little bar at the front of the dining room. They immediately brought a basket of toasted garlic bread and a huge glass of water. I had the beef and noodle soup which was rich with yummy broth, potatoes, yucca, noodles and a big chunk of beef.   Want to go back and try many more of their interesting sounding food. Only downside was they did not honor Michael's 20% off from Yelp for checking in.  Disappointing since they have good reviews from Yelp.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CzZHxhRePTT3ZzFIkaW9XQ"
  },
  "9FzzSW6EqCpDzI8diMqQBw": {
    "date": "4/22/2019",
    "text": "Delicioso !!!  We celebrated Easter with all the family 17 people! The staff was attentive and patient , food took longer than usual of course because we were a large party  it was worth it , we all loved it definitely recommend it ,  very authentic and home made style !  And beer specials of presidente beer , best Pilsener there is",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "39phZ0ZS7RwvRoUbM8crjA"
  },
  "FNre9f5ksq1D9I9eIWGr2g": {
    "date": "10/2/2018",
    "text": "Im raised in NYC.. Washington Heights AKA LITTLE Dominican Republic.  I know good dominican food and this place has it all. The Shakes, atmosphere all feel like you are back home.  Tried the chcken stew and the beef stew both i recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nJypYhdM52dtwZLyfdpwBQ"
  },
  "2kDdaNi6zXh0pOfI4OHJXg": {
    "date": "2/9/2019",
    "text": "Always come here and it's always a great experience. My bf has the sopa de res and he loved it. I had the bistec and it was delicious. Even tho we didn't have the same waiter they were all nice and helpful to each other. It's worth coming here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1DvA6m6TENmCyv5bm5eMtQ"
  },
  "XxtSL4DKvdBvLBMP9J8zXg": {
    "date": "10/2/2018",
    "text": "Verify your receipt details!  The mofongo was excellent as usual.  My bad experience started when I asked for the check, we were a group of three but I noted the waitress was very anxious to take my card and the check back, so I checked the paper and noted that she had already added a 15% tip.  She then brought me my card and the two receipts to sign but not the detailed one, of course it had a line for the tip.  She tried to double dip on the tip.  This made me regret being the one that recommended for us to go to Punta Cana.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fk97Hzx5ZtXtUxeVYOs8NQ"
  },
  "CJZ3FPteY8cq7-CdDgDn6A": {
    "date": "11/2/2018",
    "text": "The best Dominican food in the area! Affordable prices and good portions. Very authentic and fresh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XQEmkZ7pUtNGYPdQfA3XeA"
  },
  "fdYMiJRvyL7OQ5CBKmgatg": {
    "date": "1/27/2019",
    "text": "The food was super salty. The chicharron had to much fat and wasn't cook well, very dry and hard. We ordered three different mofongo's and they where nasty couldn't eat it. It was so dry and hard. Like they over cooked everything. The fried pork chunks looked like little meat scraps fried and salty. We've eaten there before and the food has been good but this time it was nasty. Very disappointed, never again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T_eVp0JXGtZRoJ5te7KfuA"
  },
  "67Bz9capM0zFw0gtWcaDoA": {
    "date": "11/29/2013",
    "text": "Punta Cana had been a favored locale since it first opened, as the Mr. has a crazy yen for Dominican food.  The Mr. likes the chicharron (de cerdo), the chivo guisado, and the chicharron de pollo (con hueso).  He likes the pernil, though he says that sometimes it is a little dry and not as tasty as it used to be. The Mrs. agrees that the chicharron de pollo (con hueso) is tasty, though not as much as it used to be, and she likes the mofongo.  The sancocho, which is available only on Sundays, is good and as close to authentic as you will find in the area.  But she had a bad experience with rancid bistec encebollado, which tasted as if it had spent too much time without refrigeration before cooking.  On a few occasions, the platanos maduros have been overcooked and burnt.  Sometimes the chicharron (de cerdo) in the mofongo was undercooked.  Fatty pork is very unpleasant when it is undercooked. Punta Cana went through a fire some time back and has not fully recovered from that disaster.  The service is not the same excellent service it once was.  The food is now in much smaller portions, and the quality is not what it used to be.  We used to be regulars, but now . . . not so much. The Mr. and Mrs. would like to see Punta Cana go back to the wonderful service it used to have.  The Mrs. would like to have Punta Cana be more careful of food preparation and hygiene.  (The Mrs. is sensitive to ill-prepared food.) The Mr. and Mrs. recommend Punta Cana, with caveats. .",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f5JpaAIOs1GBzF-86I_c8A"
  },
  "TIcyDz7w34zCAnqPkqr51Q": {
    "date": "8/16/2015",
    "text": "As a NYC raised Dominican, let me tell you, this place is not as good as people are making it seem. The food isn't great by any standards. I've been to amazing  Dominican restaurants in NYC and this place is nowhere near that. My fiance and I, had visited this restaurant several times before last night and we will not be returning. My family is in town from NYC so we decided to drop by and get some food. At 1035PM on a Saturday night, we we're denied entrance. The \"bouncer\" tells me that one of the people in my party is wearing a tank top so he can't come in. This is the most ridiculous thing I've ever heard from a 1 star restaurant at best. This place is literally an abandoned Wendy's that was turned into a \"restaurant\". As I look around, there were a handful of men wearing tank tops already in the place so I asked to speak to the manager. 10 minutes later the \"owner\" comes over with the ugliest look on his face and looks at me like in a \"what do you want\" manner. I explained to him that my party of seven would like to spend our money in his business but we're being told we can't enter because someone is wearing a tank top. He tells me that after 1030 the dress code changes so no tank tops. I explained to him that there are people sitting that are wearing them, which he replies \"oh, they got here before 1030\". That has to be the biggest crock of #### I've ever heard. The conversation concluded in spanish when I asked him \"From one fellow Dominican to the other, you are going to turn away my business and lose it permantly because we arrived 5 minutes after your \"new dress code\" took effect. His answer was a  loud YES and walked away. This has to be the most unprofessional behavior from a small business owner even in a ever so small hispanic food realm in Charlotte. We would've never showed up if we knew something as simple as a tank top would be a problem, yet there were guys in there with hats and Jordans. If this were a top notch restaurant and we had been turned away, I would absolutely understand but not coming from this refurbished Wendy's turned into restaurant. It's sad that hispanics in Charlotte don't have many options and will probably still resort to this place as a result.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wdmJ4yK_k9k3U3unjncUvA"
  },
  "sZFPJw4O1lyizWmRHhhqfQ": {
    "date": "12/17/2010",
    "text": "Ohh I think I frequent Punta Cana enough to be considered a regular. While the food might not be the best tasting latin I've had, it sure is hearty. With a variety of different lunch time meals at $7 you get your dollars worth and it sure beats a large #2 at Mickey Ds!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MyFtpeGsV4z3zvFBnfGIvw"
  },
  "EJcDfmbOC2YYbMzAoq7Xhg": {
    "date": "12/7/2013",
    "text": "I've been wanting to go to Punta Cana for a while now, but I hate driving on South Boulevard. It stands from its surroundings (despite being in what looks like an old Wendy's) because of its bright colors and the palm trees out front. It was mostly empty on the inside and we were seated promptly. My wife and I both ordered mofongo (something I fell in love with during a trip to Puerto Rico last summer) - hers with fried pork and mine with fried pork belly. I liked the mofongo, but the pork belly was slightly overcooked and dry - almost as if it was cooked earlier and reheated for me. The portion was bigger than we expected. I finished mine barely, my wife got her leftovers to go. This is the only place I know of in Charlotte to find mofongo and it was pretty good, so we'll be back (but next time I'll get the fried pork or steak).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oY9ZkOjJJ_zShYQ4AsZ7CQ"
  },
  "r9a8KciO2HE8PDs7Q-Ukqw": {
    "date": "10/13/2013",
    "text": "I was so excited when I heard about this place I couldn't wait to try the pernil and platanos. I was so disappointed after my visit ! The service was terrible! I don't think I saw one employee that looked remotely happy to help with anything. I probably asked for bread 5 times. When I finally received my food everything was cold and my rice was hard. My husband ordered the shrimp mofongo and he seemed to enjoy it. I doubt I will be back!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lXfdCFYiybs0jFkyIEoATg"
  },
  "ZbuBxbiZTD3qhJcrdxPIag": {
    "date": "9/25/2010",
    "text": "Great place on South Blvd.  Lunch special is $5.95!  The juice is great, I had passion fruit.  I got a pork dish, yellow rice, and yellow plantains and it was a great combination.  Other items I enjoyed were the steamed bread appetizers, chicken empanadas, and the green plantains dipped in some kind of vinegary garlic concoction.  Can't beat the value!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f47N37WU1_PsQKxvZdaTwA"
  },
  "tEOpbsfs83l7ZZMv7_xZcA": {
    "date": "8/30/2009",
    "text": "I went to Punta Cana at 8:30 or so on a weekday evening and had a really nice dinner.  The place was pretty empty given the lateness of the hour, but service was fast and pleasant.  Even though it's located in a seedy stretch of South Blvd, the inside of the restaurant has a nice atmosphere for a sit down dinner.  The food was definitely interesting, maybe a touch on the bland side, though -- but I'm not sure if that wasn't just a result of what I ordered.  The mofongo (plantain hash) was something I'd never tried before, and with it I had a crab creole dish that was very tasty.  Dessert was flan which was, well -- flan.  Hard to screw up.  I would definitely go back and try some of the other specialty dishes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "fo3aQuxapB_QJ5lcCHOVIA"
  },
  "xYX8ChOrWviNLdoQEnz57g": {
    "date": "6/16/2010",
    "text": "great friendly place. I'm Dominican and puerto rican and just moved down here from nyc. I need dominican food badly and prayed this place would good enough. IT WAS!!! I loved it. my girlfriend that barely likes spanish food loved it. she ate her food, her left overs and then my left overs. she also hates beans but the next day couldn't stop talking about theirs lol. really good spanish food. a must try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LTEv4DoogRQhpLS4CIEOhg"
  },
  "wn41UxP1eWKg6WTncvhpiQ": {
    "date": "7/19/2015",
    "text": "Finally some good Caribbean food! Our whole table had Stewed Goat, Rice with Red Beans and fried Plantains. Every bite was flavorful and the portions were huge. The Music was great and the server was a pleasure. We were also delighted that the owner came to check on us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m4CZdPrp8cZuLax6OkAJgw"
  },
  "V-PcCIIBGhtNvIp0xtUsqA": {
    "date": "3/28/2012",
    "text": "This place is amazing for the money. I eat here frequently, and frequently take newcomers with me who love it as well.   The atmosphere is just okay, and the service is decent, but I wouldn't say exceptional. But the overall value is just amazing. The lunch special is $6 and you can choose from fall off the bone chicken, amazing pork, or other selections. You also get two sides which means a TON of absolutely DELICIOUS FOOD for $6!  Do yourself a favor, particularly if you are new to this type of food - or even if you aren't - get the tostones. They are the fried plaintain, and with the mojo sauce they have, it's so amazingly good.  I've been here for dinner once, and I think based on the service and atmosphere it is probably a little overpriced for my taste, but this is my absolute favorite place to have lunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "sl2Sdfg1z56Uj-FjRSFq-A"
  },
  "N5Vw9_iqT9Uivk9Qiyy8DQ": {
    "date": "11/22/2013",
    "text": "where to start....  service:  our servers took long to tend to us and we had to call them to bring refills. when I thanked her for the refill she said nothing.   the food: pastelitos: decent, more sason but still ok.  Churrasco (skirt steak).  this was a very chewy meat and it's was not properly grilled, seems like they seared it on a pan. my rice had a burnt after taste and smell. the beans........boring  wife's food: tostones where not properly pressed and then dipped back in the fryer, they just chopped the plantain and fried em!  chichrron de pollo was ridiculously bland. that batter was like a KFC chicken rip off with no flavor. this  dish should be tangy with chicken that is marinated.   conclusion: not worh it. the only way people would like this place would be if they have not eaten at la casa de mofongo in the Bronx in NYC, or la roca in providence Rhode Island. this is a poor showing of Dominican food. if you are impressed with this food then your palate is probably impressed with the mcrib from Micky d's. or maybe it's been a decade without having any kind of Caribbean food and this your first  time eating it in a while  I apologize to all the Dominican moms I know out there for how bad this place represented your food.  can I give minus/negative stars to this place? alex reyes, you are nuts for liking this place you should be ashamed and you should know better! punta Cana? more like punta caca! Honestly A Yugoslavian blind paraplegic could make better Dominican food! With that said, I gotta run cause this bootleg dumbminican food is making me perculate and I have about another hour before I make it home. in the words of my dr brothers LA CRETA  conazo!",
    "rating": 1,
    "rated": {
      "funny": 10,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "DbqrCu8IXk02l-4P8ZDQ9A"
  },
  "hcbG6puSdur0VrqPT59i1A": {
    "date": "10/24/2013",
    "text": "Ive been here 4 times and Im freakin stuffed every time. Great service and atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qtZrFx9IfrD3oHoSdgNUmQ",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Chicken, Sweet Plantains",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qtZrFx9IfrD3oHoSdgNUmQ/o.jpg"
      },
      {
        "img_id": "wsh5AYMSmoWPuxkrPeP0XA",
        "caption": "Photo of Punta Cana Restaurant &amp; Grill - Charlotte, NC, United States. Pork Mofongo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wsh5AYMSmoWPuxkrPeP0XA/o.jpg"
      }
    ],
    "user_id": "1_hk4oUjcC8JErbI_Gw61w"
  },
  "kkIMWXKQipLjtooeI1rrWw": {
    "date": "4/26/2014",
    "text": "Being a Dominican myself and growing up with parents that owned a Dominican restaurant in NY , I was excited to find a place in NC that would bring me back home. Well ... Spoiler alert ! As bad as I wanted to like this place , it didn't give me that warm fuzzy feeling of home. The food was just okay ( that's blasphemous to ever say about Dominican food ) it's my favorite kind of food ever and I felt a little sad inside especially my stomach :'( ....two stars for effort I guess",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "L2H_pz8SfJqIWHOR3v5swA"
  },
  "EAjIO_KrjoU_DLWgZ8YX2g": {
    "date": "9/28/2014",
    "text": "Stay away from this dump! I'm Dominican and the food here is far from authentic. The service is horrible. The issue there are the waitresses and most if the food is bland! You can go for appetizers like pastelitos and kipe. Also the morirsonando is good here. They do not sell here Dominican spaghetti.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cHt6QJzR8FXvuOxDaimV_A"
  },
  "ZRsXHG8-r4aveNlV0D99vQ": {
    "date": "1/16/2015",
    "text": "Food was tasty. Service was prompt, and friendly. The portions were the right amount.   came right before Christmas with family of 6. My father in law and son and I had the pork. Very good.  My wife and I liked the atmosphere and prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qy_7ivtqddEuNw_S2tsIAQ"
  },
  "zx79xT1JBOZtbl-nQfAf4w": {
    "date": "12/22/2015",
    "text": "Have had bad service here before because i don't speak fluent Spanish. But food is very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m7fIThtYjYYXJzLAEVr39Q"
  },
  "5DqaQjA0xf3KlsiCxQn7Dg": {
    "date": "1/7/2016",
    "text": "My wife and I decided to try this place because my wife is Dominican and wanted some authentic cuisine from her country. BIG MISTAKE!!! We ordered quipes to start and they came out very dark. They were burnt and bitter to the taste. We decided not to panic and wait for our entrees. My wife's steak sandwich was run of the mill nothing special. I ordered skirt steak (medium)with mofango. My steak came out undercooked more like med rare and tasted like it drowned in soy sauce. The mofongo was bland and tasted like it was reheated leftovers. I practically forced myself to eat my food because I was hungry and didn't want to waste my meal I was getting charged 15 dollars for. In retrospect that was a bad idea. Whatever they served me made me sick and I threw up everything about 30 to 45 minutes later. Oh yeah let's not forget the awesome experience I had in the bathroom. Nothing like sitting on the toilet and having the lights turn off on you so you're handling your business in pitch black darkness. If I could I'd give this place minus 5 stars. 40 dollars down the drain to eat food that rivaled the grub you get in a state prison.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fpJEa1DO8OEEtgt-7vs2fw"
  },
  "pbgCFqOOcz63nB30B7Ya-Q": {
    "date": "7/17/2011",
    "text": "Don't do it... trust me - you'll thank me later.   Being that my mother is Dominican and I've lived there, I can def say they should not advertise anything stating of Dominican ANYTHING. Period.  The chicken in the Chicharron de Pollo sin hues was disgusting! They used chicken that was just about to go bad... I\"m sure they figured if they fry it, they will cover up the gamey gross chicken. My god what an insult that was.   Hahaha what a joke their Pastelito's were.... Really? Come on now, those were just plain embarrassing.  I'm still upset about my dining experience because I so wanted to like it, but I only two things I like about this establishment is the Presidente beer and leaving!",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "oWxy_YR6n2w8e9L00hxhPw"
  },
  "X2D_JdTm4JvbE-rNcMpq4w": {
    "date": "3/29/2014",
    "text": "I am from NY and loved the restaurants that has dancing and food, this place has both but the waitresses are horrible, they seem like they are mad at something, but I did notice that on a table that had all guys they were really friendly (our table was all girls). With alot of competition around they should re-evalute there waitresses, the place also had a funky smell and it wasnt food smell. In short, bad service...bad smell.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ppbt_WJhdgc47y-au7zO-w"
  },
  "dXushy9_8wIH65lRhzpX7w": {
    "date": "1/13/2016",
    "text": "Great food and a great spot! Little rough around the edges, but that's totally a positive I have to say.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bCcEA0AGENmaanFKDSsYOw"
  },
  "Ep94E7_OtzUrzjVhX3XEjA": {
    "date": "8/24/2014",
    "text": "i ordered the chicharron del pollo it was awful. I think the chicken was soaked in the dead sea it was so salty. The peas and rice was better but not fantastic. This was very disappointing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K0z2QWZXrMoTN6tl8SWZIQ"
  },
  "qajuwTu_q0FwLjg8je3qFg": {
    "date": "11/3/2015",
    "text": "Service was fine. Got a Cuban sandwich to go. Not a real Cuban sandwich. Tasteless, over saturated with butter, fries were so bland you honestly just had mush in your mouth. I spent $10 and ended up throwing it all in the trash. Would never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rbQaBR04jAFKC7F1kllyyQ"
  },
  "-VVEt2lvVVBgNMPyuDFkKQ": {
    "date": "12/6/2013",
    "text": "I absolutely love this place!!!  My co-workers introduced me to this place for lunch, and I am hooked!  The pork, the plantains, the sangria are all fantastic!!  Very affordable and fresh, amazing food!  I want to come back for karaoke on a Saturday night sometime soon!!  You must eat here!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aND1424xk2CHyfilxZU69w"
  },
  "fHCxJlmxMeIqsbY4omILPA": {
    "date": "10/24/2013",
    "text": "I love love love Punta Cana. I am a hispanic from the Caribbean and I love my native food. I was so happy to find this place a few years ago.  I wont go into detail abotu the service because they're sometimish (I know that's not a word lol).  Some days they're really good. Other days they're not so good.  My experience always seems to be good until a person of the Caucasian race comes in or a Hispanic who fluently speaks spanish comes in.  They down goes my service.   Anyway I dont want to make it seem worse than it is. But you should definitely try it out.  the mofongo, mangu, queso frito, longaniza, pastelillo, pollo al horno and pernil !!!   My in laws love the stewed shrimp that comes out in a little silver pot.   Great place to eat at guys!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8j1VbaW8RbpZ9nUfNJgMwQ"
  },
  "LwtQUBmyp9UH5M6Y3iFA6Q": {
    "date": "9/8/2013",
    "text": "This is a Dominican spot but serves Caribbean plates from Puerto Rico, Cuba etc...  Having been born and raised in Puerto Rico, my wife and I always search for caribbean places like this when we move to a new city.  Having just moved to Charlotte 2 years ago from Chicago, this was the first place we ate at.  Big fans.  Food is very authentic and reminds us of home.  Decent prices and they serve way more than enough.  I recommend the white rice and red beans with fried pork chops and tostones (fried plantains) as a side.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EG3ztgPeUDjPQK28y8i_vw"
  },
  "5He9xLH7HAnNwe3hPF-88g": {
    "date": "5/14/2015",
    "text": "I have eaten my fair share of food here. Each and every time has been nothing short of amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XlOrvDG5T4FrCfdCHrsUKQ"
  },
  "Egd3mY2arF1xe_q2CA0HoA": {
    "date": "8/21/2013",
    "text": "THIS PLACE IS GREAT.  2 huge plates of food, 4 beers, 2 people 30 bucks.  The service is great and the place is spotless.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "iN5kL0PrH0lb_69fZ6difQ"
  },
  "bS7fIxuzZcXr_oTjaypFCQ": {
    "date": "7/28/2011",
    "text": "This place is great. Best mofungo ever --- the mound was textured with crispy, fried pieces of plantain integrated within the traditional mashed up plantain chunks. I could eat that all on its own. I ordered it with the fried pork chop, which came with the traditional gravy --- delicious. The maduros and boiled yucca were prepared just the way I like it. The garlic sauce for the yucca was potent . . . but again, that's just the way I like it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fvj9dV4e6Fu5T5tM98dCVQ"
  }
}