{
  "BZxpzto7E2XluJFfMh1TBg": {
    "date": "6/18/2008",
    "text": "Updated 3/2012. Their flights of wine and service are still good but on my last two visits I thought their food quality had slipped a bit so I think a four star rating is now appropriate.  Sorry I could not agree with Mariangela. My experiences there have all been good. Their flights of wine are always fun to try and I have never had a bad meal there. I do agree that the service is very friendly and pretty professional.  It is a good restaurant to bring guests to as they always seem to enjoy the evening. The parking is valet, but not snobbish as they parked by old pickup right up front.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cziRQQ6D7ogpL1gQWEbqRw"
  },
  "ypaXwPE1YTYkE0yWv9v8VA": {
    "date": "6/10/2011",
    "text": "Bonterra is a solid fine dining spot.  My favorite part is the building, which was an old church.  The environment is very calm, though my chair was kind of uncomfortable.  There is a small side patio that looks like an excellent place to enjoy a glass of wine and some appetizers.  The wine list is very extensive, with a wide range of prices and options for wine flights if you are looking for variety.  The service was good, very unobtrusive and helpful.  I also enjoyed the food, enjoying a delicious salad with fried goat cheese and almonds and a tasty grouper for my entree.  If you get a glass or two, a salad and entree, expect to spend around $60 per person with tip.  Though the service was solid, the food good and the environment nice, I found Bonterra to be lacking in personality.  For the price, it left a little more to be desired.  I am, however, looking forward to trying out the patio on a summer evening in the near future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "f47N37WU1_PsQKxvZdaTwA"
  },
  "-Z_fkoB68uFrBcgdRSySNg": {
    "date": "11/23/2010",
    "text": "Dined at Bonterra on a Monday night with my wife.  The restaurant is nice but due to it's open nature can get a bit loud.  The place was half full when we were there and it was fine most of the time.  The wine list by the glass was extensive.  We asked for suggestions based on several that we liked and enjoyed and were offered three similar choices.  Our selection was excellent.  Our food was also very good.  I had swordfish, the feature of the night, served on a bed of chickpeas and a grain I can't remember with a Asian calamari topping that was excellent.  My wife had the Grouper which was cooked to perfection and sat on a bed of lentils and arugula.  The arugula was a bit tough and stringy but otherwise the dish was good.  We both enjoyed a desert, my wife the cheese plate and I tried the chocolate sampler which is made for Bonterra by Barking Dog Chocolatiers.  Both were excellent.  We were served by Ramsey who was attentive and helpful.  All in all a good experience.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8Zts7elT6qOI3cZbghmcoQ"
  },
  "x19wZk8I-86fssTI5E9RDw": {
    "date": "5/15/2009",
    "text": "Food is good and the wine selection is excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sz84_SyrNYi4wsX__6haLQ"
  },
  "ZNOMYQkx2_r_Yn0bexcpyw": {
    "date": "6/15/2011",
    "text": "the drink prices in general @ bonterra are insulting bringing their star rating down. other than that the food and service are wonderful as well as the setting. i have been there twice and really enjoyed both visits. last night went with the bone in strip, rare and it was cooked perfectly which is obviously key with steak, sometimes rare steaks come out with a cold center this one wasn't, its was red but room temp which is exactly the way i like it, paired with some very fresh hericots verts (green beans) and some delicious fresh parm gnocchi. we started with some mussels and literally cleaned the bowl with the fresh baguette they served along side. james the bartender was very friendly and provided us with superb service. here is why my star rating is 3 instead of 4, we had a groupon for $60 of food, we just barely clipped that in food, she had two dirty ketel martini's, i had a hendricks and tonic and a glass of robert foley petite syrah...long story short i basically had a bill for 4 drinks it was $47 before tip, maybe i'm whining but that to me seems FN stupid expensive, $13 for a ketel martini is ludicrous. if bonterra would get their booze pricing straight i would frequent it more but those prices make me not want to go back without a groupon/coupon of some sort, i ihave one groupon left to use there, if i dont get another one i will never go back, unless its on someone elses dime.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ArVGblHkSUrdrZT90LgSFw"
  },
  "EEEhql7R4mvbBPvely-YiQ": {
    "date": "10/7/2011",
    "text": "i agree with on review above. pretty place but food was very disappointing . skip it",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "emlaur_exN_T5k7tN8wtbA"
  },
  "9XC1FlGhffp6lrnWQkriYg": {
    "date": "7/6/2009",
    "text": "This was our first experience dining at Bonterra, and I do regret that our first experience here was post the Hartwick era, but the food was still on par with the other similar level of restaurants in the area. We started with the Hummus, which was nothing to write home about, pass on this item, the bread and butter they serve is much better. We had the crab cake app which was great, simple ingredients, and the grilled asparagus was a nice touch. We decided to try the mizuna and anchovy salad, but were very disappointed because the Roma tomatoes were not even close to being ripe, and the anchovies completely overpowered the entire dish. We ended with the chick pea spatzel, This is definitely worth trying, and was excited to see the really seasonal beet greens incorporated into the dish. Beet greens have become my new favorite early summer green. Over all I really enjoyed the dinner and would recommend Bonterra to anyone.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2qYx4JxfR7MMlYmfaxfKsw"
  },
  "qlL-Xj8YzbBfrMlmpsD1uw": {
    "date": "7/21/2016",
    "text": "I was reminded of why I hadn't been to Bonterra in five years even though it's five blocks from my house.  It's because the food sucks and the prices are high.  The atmosphere is nice and the half priced wine on Wednesday is worth going back for.  But I would certainly never eat there again.    I ordered a couple of apps.  The pork belly and octopus sounded like a great combo.  It wasn't.  It was laughably small for the price.  The pork belly was so thinly sliced that it looked like a piece of store bought bacon and was lacking a depth of flavor.  The octopus seemed to be canned.  It wasn't the slow cooked then seared goodness that I was looking for. The flavors all blended together and not in a good way.   The gazpacho sounded good for a steamy Charlotte summer evening.  It was horrible.  It was a bowl of liquefied veggies that had what tasted like cup of white wine vinegar dumped into it in a failed attempt to taste bright.  It was so acidic that it was an assault on the senses.    At this point I gave up, walked home, and cooked a far better dinner than Bonterra can create.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjTG24J-UT3vs2fuwTJ9vw"
  },
  "1q3Zz-7zQ4YMdP8cTHvl0w": {
    "date": "9/21/2015",
    "text": "Meh.  I've been here half a dozen times including this last weekend. I always have a hard time finding anything on the menu that excites me.  I had the fish this time which had a nice pan sear without breading  (lovely). Call me crazy but I think salads should be served tossed in dressing, not w dressing poured on top.  There is one waiter who has been there forever. He sucks- does not pay attention at all. Jeff is better and I would ask for him. Parking not bad.  Better places to spend your money.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZAzMq_ahUOWWzejhVaOQSg"
  },
  "JngmjnhfGkB5egPW6p3nkw": {
    "date": "2/15/2017",
    "text": "Just went here for Valentine's Day. Everything was AMAZING! An extremely long wine list and our server was knowledgeable about all of it. Love that it's in an old church! Can't wait to go back and eat/drink in the wine cellar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "51Uv9HRu3SfWdE2BYmHS5Q"
  },
  "5Fqo63Ik0DgSLbLI2Ps_5g": {
    "date": "1/25/2015",
    "text": "This was a conflicted review, and it was Restaurant Week, so keep that in mind when reading.   Bonterra has one of the more unique atmospheres in Charlotte, being in an old church. There's a large bar with a vast array of wines in stock and a small second floor where the choir most likely used to sit.   Our party of four was sat upstairs. Unfortunately since our table had absolutely no view other than the drop ceiling and water station, I recommend asking to be sat downstairs. Our waiter was not rude, but really wasn't present either. There was a large raucous group of diners in the private room nearby, one of which decided it would be fun to play waiter and ask to refill our water glasses three times during our meal. He came to our table almost as much as our actual waiter.   Our table stayed full for the appetizers as he did not remove the empty wine glasses that were preset on our table. My appetizer, a cheese plate, was just ok, and noticeably small compared to the other options.   The entree I had, trout, rolled up and served on top of a stack of potatoes au gratin, did not match my expectations at all, both in taste and presentation. It was dry and had little flavor. The rest of the table had the steak, which appeared to look very good, though two steaks that were both ordered 'medium' and had noticeably different amounts of blood.   The desserts were decent, though not overwhelmingly good. I enjoyed my spicy chocolate mousse, though I could see how others may find it off putting. The lack of good service and forgettable food at such a fine dining locale will have me choosing elsewhere for a nice meal out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2tdU9vdKHFJ7Qh4A6cSVeA"
  },
  "yV116aEc9ihnYxnuFXfFIw": {
    "date": "2/4/2017",
    "text": "I don't give one star reviews lightly, but I cannot tell you how disappointed we were with our experience at Bonterra. I've never gotten up and walked out of a restaurant until I went there. We had chosen Bonterra for a special occasion. The ambiance was the only thing they had going for them.   To quickly sum up our experience- our waiter was inattentive and seemed aa though he couldn't care less when we asked questions. My husband ordered bourbon, neat and was given bourbon with crushed ice. Numerous drinks I was considering between were all unavailable because they forgot to place a bar/liquor order (and this was the weekend before Christmas). Our appetizer was incredibly dry making it inedible. We decided to pay our bill at that point and go to another restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d18Eg3pSYDvUjX7HAXSIxg"
  },
  "aV_JV-9bLdnZvwyT0Whaqg": {
    "date": "3/15/2015",
    "text": "Since there are so many really good restaurants opening in Charlotte I think this place is hurting. It can't keep up with the big boys.   The service is slow and the portions are getting smaller instead of better.  The deep fried lobster tail is still a favorite  for me. I still like the wine selection  And the bites but I find I go to other places now. This place is a little stuffy for me and there are Just so many good ones out there to try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hvs6n04dKZheWJVzhB7TDg"
  },
  "GVpy6-eBEdPb3XvVrwI3mQ": {
    "date": "8/4/2013",
    "text": "Bonterra has such potential.  It's in a renovated old church in a quaint neighborhood with a seemingly great menu.  However, it seems to be slipping.    The fella and I visited on a Saturday night and started with a drink at the bar.  Our martinis were solid, and the bartender was friendly and helpful, but we spent the entire drink dissecting how they could make the ambiance better.  Neither of us is creative, but we agreed it's time for an overhaul there.  The bar - while super cool with lots of potential - seems tired and outdated.  The music was way too depressing; they need to liven it up, or at least throw on some classical if they're going for a \"fancy\" feel.  I can't even explain what kind of music they were playing; it was instrumental, like Enya or Yanni or something.  For all the exciting postings about menu and specials they do on their social media outlets, the place itself seems tired.    We moved over to the dining room for dinner, and our server was Johnny on the spot.  He was funny, offered suggestions, and was present without being annoying.  However, our food was just okay.  The fella got the bison ribeye with grilled asparagus and turnips ($40), and it was more gamy and smokey than he had expected.  I was hoping the pork chop would be on the menu, but it wasn't, so I went with the pork loin ($28ish?) with collard greens and sweet potato mash.  I don't eat collards, so I skipped those, and the mash was about what you'd expected.  The pork was just a little chewy, and it didn't have much seasoning, but it was... fine.  Overall, there are too many other places in town charging the same amount for entrees ($25-$40) that execute the flavor and ambiance much better.  I don't think we'll be back anytime soon, which is sad since this place really could be something pretty special.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QmethzRyAvZXS9m1UNJpdw"
  },
  "9FyEoSLBIOC9r-aQG38aHw": {
    "date": "8/14/2016",
    "text": "Great wine by the glass selection.  Charcuterie was fantastic. I would recommend for drinks/apps/desserts but the entrees weren't great.  Steaks were highly over seasoned.  I couldn't finish my ribeye. Too salty.  Same for my wife's Filet.  Deep fried lobster tail was over cooked to where the meat was tough and rubbery. Disappointed as this was our first visit.  Vibe was great - but skip the entrees and go straight for dessert.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-g0euqUjlkSM9NDM1C9uxQ"
  },
  "9q_x2SjuE6Hyv864j1ImaA": {
    "date": "4/27/2015",
    "text": "Speaking only about their bar, and to be specifically their 1/2 off glass of wine night (currently Wednesdays) - this place is a nice place to hang out after work. The bar area is pretty small, and this is a popular night, so plan accordingly. They offer bar bites as well as the full menu at bar. I personally enjoy most about their LARGE wine list. Ranges from $9 to $20 a glass regularly, so 1/2 off night is a good deal. They have other drink specials on other nights as well, but this has been my favorite evening! Service is nice, the place is quaint. AND apparently they have a cute little patio area (but not sure if it counts as \"bar area\").",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M4yYtAXehUzaHB1ghl6EXg"
  },
  "CsuZ1WmKTm4243r3g29_ig": {
    "date": "1/29/2016",
    "text": "You can definitely tell this place was a church as you approach the building and make your way in. There is no main parking lot so try to get there early to claim a street spot. However, they offer complimentary valet. My husband and I had dinner here for Queen's Feast. Service was on point. We both went for the Grilled Octopus as our starter. A little on the overdone side but still edible. Flavor was a little bland but good to still enjoy and devour. Friendly staff and service was prompt and professional. For our second course I went with the NC Catfish. Loved it. I think the portion was perfect but for someone with a bigger appetite it may not be enough. Flavor was just right overall, nothing to powerful. Everything harmonized. My husband ordered NC Trout which doesn't appear to be on their regular menu. Looked much smaller than my dish. It was more on the salty side and he had a hard time finishing it. For dessert I ordered the Panna Cotta and he ordered the Bread Pudding. Both just right for not sharing :) Would I come here again? Probably not. But definitely worth checking out if you haven't.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gnpmrka2Sg42LkCW6iNiQw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. NC Catfish.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Gnpmrka2Sg42LkCW6iNiQw/o.jpg"
      },
      {
        "img_id": "Fh8vbHX3DymnwO28PSaKjQ",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Grilled Octopus.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Fh8vbHX3DymnwO28PSaKjQ/o.jpg"
      },
      {
        "img_id": "HDdl9sGJU3ZpRIqkoC1XPw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Panna Cotta",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HDdl9sGJU3ZpRIqkoC1XPw/o.jpg"
      }
    ],
    "user_id": "TyA_1wJ_irey_D46gfdppg"
  },
  "BHs_3sPBmNtY0DIqWNbSYA": {
    "date": "12/3/2014",
    "text": "Everytime I have dinner here I am filled with excitement.  There's always something new on the menu that will have your tastes buds GO WOW!  I love their cheese and charcuterie plates- and you can build them yourself or get the chef's choice.  You have to come try this plate if you haven't yet... and there's a great bar menu for lighter fare.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "S2PFB-vzaxsJnoE97oXSDA",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Their way of oysters - ummm bacon foam!  YES please!  haha",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S2PFB-vzaxsJnoE97oXSDA/o.jpg"
      }
    ],
    "user_id": "feTakdJt-j3vu6gWPDHt0w"
  },
  "Az2PPi9RnB3LeUmvaHOYmg": {
    "date": "5/25/2014",
    "text": "Excellent hidden gem in the Dilworth area. \"Hidden\" in that for as many years as I have dined in this area, I have never dined at Bonterra. Excellent wine list with a lot of very good \"by the glass\" selections. Service was excellent as well. We dined on the patio, and it was very pleasant.  We had several items and they all were great. Dinner menu is small yet there is something for everyone. We chose the Chef's selection of charcuterie and cheese, mussels, foie gras, yellowtail sashimi, the Azalea salad and the beef tenderloin -- everyone was pleased as we all shared. For dessert we had chocolate souffle and the pithivier-awesome as well.  Looking forward to coming back very soon. Highly recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-0b84SUGVN0YkG5j2MCmBw"
  },
  "bmKjxVVfaZ5GKsrHXw_wqQ": {
    "date": "4/10/2017",
    "text": "My husband and I were seated in a table in the far back on the first floor. Lovely and romantic table, except that it was very small and there was nowhere to put my purse except on the floor (yuck).  Also the air conditioning was blowing right on me (for those two reasons one star is deducted).  Why do restaurants need to be so cold?  We were still celebrating my birthday and the wait staff (although we were confused about which one was our main waiter as they came to take our order twice) was attentive but not overbearing.  One waiter gave us an overview and history of this beautiful building which used to be a church.  As to the food the fried green tomatoes appetizer was  perfectly done though I could have done without the pimiento cheese. I love that the chef can whip up a vegan or vegetarian option and he made a vegetabe dish of mushrooms, bok choy and Brussel sprouts over red rice.  Absolutely delicious!  My husband had the scallops and said they were pretty good.  The best part of all were the donuts.  We do not indulge in sweets as a practice so this was especially special treat.  The donuts were so fresh, warm and sweet with raspberry, chocolate and caramel sauces for dipping.  I would come back for the donuts alone.  Bonterra we will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kC-ewMOJUGJ-11rZngvvUA"
  },
  "U8aYGD0mH1oONe2lLDAmRQ": {
    "date": "3/5/2016",
    "text": "I have been to Bonterra probably a half dozen times and I was surprised to see that it was rated as middle of the road as it is.  I have always found it to be a good restaurant in a terrific setting, though I will say that it has never been really awesome.  We went a few eeks ago and had a good experience.  Amber has the ribeye and LOVED it, I had the filet and it was quite good as well.  I understand from my wine drinking friends that the wine list is huge and great.  I would say give it a try - the setting is worth it for one visit anyway.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mcsAPnM42EjISfbEtR5frQ"
  },
  "qN1Ph3_uZ6eeEImd5xaqqA": {
    "date": "4/7/2017",
    "text": "Bourgey to the max yo.  Kinda that middle-aged white woman spot.  I liked it, though.  Just pricey.  You should go, even if you aren't an old white lady.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v9FT1O5vdOHlzOYpyc-Y2w"
  },
  "aSs6UUQitjZt9qRk6k2vzQ": {
    "date": "11/8/2014",
    "text": "One & done! 1st & last visit to Bonterra. Service was slow. Took over 20 minutes to get our wine. Waited over 1 hour between appetizer and entree . Tables seated after us were served & left before we got our entree.   Food was ok. Appetizer, oysters were good. I had the fried lobster tail which tasted good but was over cooked. My wife had the cod which tasted good but was cold. Will not be back!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "brGIXSYILc3nvsaQ37RrRw"
  },
  "lq7ADdYmtNDEtyMaKKsozA": {
    "date": "2/4/2013",
    "text": "It has been a very long time since I have been here, and I was very pleased with my recent experience. I went with three other people for a dinner on a Thursday evening. The restaurant was not busy, but there was an event of some sort happening upstairs.  I was impressed with the interior. Last time I ate at Bonterra, the place looked a little tired. Now, with a beautiful gray paint on the walls and what looks like new upholstery and decorative accents, the restaurant has a wonderful atmosphere.  I shared the mussels with my fellow guests, and they were the best I have ever had. The broth was flavorful, buttery, and a definite complement to the mussels. Usually, broth served with mussels is pretty much just for show--pretty much useless, but we were all spooning the stuff over our mussels and dipping our bread into it. The dish also included a smear of goat cheese. I had never thought of putting goat cheese on mussels, but it was delicious!   You can't beat Bonterra's wine selection. I had a simple glass of sauvignon blanc. It fit the bill for the evening.  For dinner, I went with the Caesar salad. It was also fantastic. It sported the perfect amount of dressing, and I loved the generous addition of shaved parmesan and white anchovies. I had the salmon entree. It was good. Nothing spectacular, but still tasty. The nicely cooked salmon was accompanied by a chick pea puree, lima beans, and some sort of sauce. For dessert, we ordered decafs and I shared a bread pudding with one of my fellow diners. It was super good! Very tasty, good balance on the sweetness.  Our server was very patient, friendly and helpful, although he did make a few notable mistakes on the order. He forgot to mention that the apple and parsnip soup special contained bacon when he described it to us. When it came out with bacon atop each bowl, he apologized and set it out for everyone. He didn't give the option of getting new bowls for everyone. Of course, none of the three people who ordered the soup wanted bacon. Those who didn't wish to eat it anyway ate around it.   In addition to the soup issue, the server put in an order for the completely wrong dish for one of my table mates. She had to wait for her correct dish to be cooked and delivered while the rest of us ate ours.  Overall, despite the mixups (none of which affected me directly anyway), I am very happy with my visit to Bonterra. I hope to go back some evening for some wine at the bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "yeBcdHTf7mYrCRsKiQNZ_A"
  },
  "JjAN5tiTZrP1kn_MNPG7DA": {
    "date": "6/10/2011",
    "text": "Finally made it to Bonterra... after some planning, we got a group together to go last night.   We were a large group of 7, so I had made reservations for a Thursday night on Monday morning of that week.  The OpenTable function of the website was a little mis-leading so I went ahead and called the restaurant direct and was able to get a table.  Environment:  This former church setting of a restaurant makes for a really unique space.  There was some sort of event going on in the main center of the room with carpet representatives... it was a little tempting to slap a name tag on since they had the wine and snacks flowing pretty well.  Other than the rambunctious carpet people, the tables are very well spaced - I hate it when tables are way too close together and you feel like you are on top of your neighbors.  Plain and elegant white table cloths with nothing too fancy on top that you are afraid to break or move.  Service:  Our server, Ramsey, was pretty good.  He explained the specials and also was very patient with us since the wine menu is pretty extensive and it took a while for all of us to make a decision on wines.  It was not fast at any means, but I found myself looking for our server since I was starving.  It ended up working out since we were in good company and wanted to catch up with a lot - weddings, vacations, and other life events that we all had experienced in the last couple of weeks.  Food:  I ended up ordering the Rib-eye which was amazing - it was accompanied by fingerling potatoes and a fig sauce.  Super satisfied.  I was also impressed with the bread basket (two types of bread) and a great olive oil for dunking.  Overall the experience was good.  Definitely a \"special occasion\" type place but my friends and I vowed to come back just for some upscale drinking instead of doing the whole dinner - sit down exercise.   It will be nice to try their desserts too since they all sounded great.  We were all too full to indulge.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "jKpdGEsEONygmhzsxxZ1gA": {
    "date": "1/30/2017",
    "text": "We visited for restaurant week, so it was very busy. We got sat quickly which was a surprise. The vegetarian option was nice(nothing special) the other items on the menu the table ordered were good.  Maybe we'll give it a try after restaurant week.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nWVU026I3SJCwjKBL3ZvUw"
  },
  "4xaWrGk2MP_bJY9jaj8_wg": {
    "date": "1/15/2014",
    "text": "Wonderful atmosphere. Nice broad range of wines to satisfy all pallets.  The server was pleasant and very knowledgable.   Our meal was delicious and well prepared.  This was my first time dinning here and was for business purposes. I'll be back for personal dinning soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ulyIFWXRVtJSM04d5lvINA"
  },
  "CglS_Sp_Q1lBId6LX1-XHA": {
    "date": "10/31/2016",
    "text": "I don't hand out 5 stars lightly, but this place earned it.  It's a pricey joint, make no mistake, but the food is amazing.  The wine list is HUGE, most bottles in the $34-$40 range surprisingly.  Beautiful ambiance in a renovated church (there is now a bar where the alter once stood).  Great romantic date spot, or serious business spot.  I had the lobster tail and it was essentially a 12 ounce \"lobster steak\".  The most dense bites of lobster meat I've ever had.  I will give a restaurant a bad Yelp review if the waiter looks at me the wrong way, but this place was (I kid you not) 5 stars fabulous.  Been here before, and will def go back (once the monthly direct deposit kicks in).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bH5mALKRCqUfcuZVnH2sWg",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Fried lobster tail is amazing.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bH5mALKRCqUfcuZVnH2sWg/o.jpg"
      }
    ],
    "user_id": "9GB33_0zFwLmp2VMOxPJFg"
  },
  "eJa0nZuJ4D3sK4FZbdGgng": {
    "date": "11/3/2017",
    "text": "Great wine list! Parking is limited but free. They do offer valet. The filet was delicious! Great place for a date night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l38ZJ7akVz5hZi0FGUA_CQ"
  },
  "9QGRvWjxyw4BWgknrKIaAQ": {
    "date": "4/16/2018",
    "text": "Beware. Note that if you have 6 people or more your stuck paying 20%. Our service was horrible. The first hour there we only had bread and water. We had to ask for wine. The food came so much later after we asked for it. He forgot to put the order in. Best part was the food. Won't return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bbQ2Ww0sQEraQZgh1vvJBQ"
  },
  "DJUci04ZQ_A6gN_Qa4QGSg": {
    "date": "10/8/2016",
    "text": "Large wine selection and a unique venue. Only purchased wine and cheese board. Entrees $$$$.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ktGdG6Z0siq4AMzq_fIcqA",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Dining area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ktGdG6Z0siq4AMzq_fIcqA/o.jpg"
      },
      {
        "img_id": "rNY3Eapa-fsCVd_31C4CYQ",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Wine Bar &amp;amp; Dining Area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rNY3Eapa-fsCVd_31C4CYQ/o.jpg"
      }
    ],
    "user_id": "gT6_oAwFqgCYLmDwNi2n8A"
  },
  "eB7KtkK-xQWpJIwUjrGt2A": {
    "date": "8/23/2017",
    "text": "I hadn't gone to Bonterra outside of restaurant week once in two years.  Everything was overpriced, food was cold and inedible. The mussels were not fresh.  All seafood dishes had aioli which was unnecessary and lacked any type of real seasoning. Lackluster birthday dinner with the family to say the least as everyone was unpleased with their meal.  This place left much to be desired.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yu-tNUhzLHVhmBlQ8LFD5Q"
  },
  "Ql9P_8mG7zMVujWZ9uwTzg": {
    "date": "8/15/2017",
    "text": "Great atmosphere, quiet and quaint. Parking was valet or street self parking. Service was great, attentive but not over bearing. Wine selection was choice and extensive. I had a glass of the Duckhorn Decoy Cab, which you can never go wrong with, great tasting wine at an affordable price point. I also had the Mediterranean appetizer as my entree. It's normally a shareable for two but as my main course it was a perfect amount and left me fully satisfied. I was recommended this place by a fellow colleague and would highly recommend it anyone I meet. I'll definitely be back when I return to Charlotte next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zvVCrcJ7785Y3gkNzEm7vw"
  },
  "ebNsondtxRSylLAj6P1Myw": {
    "date": "1/31/2016",
    "text": "Went here last night for restaurant week and was a little underwhelmed. The atmosphere was okay, not amazing like I had heard. The service, again, was average, was not blown away like other restaurants during restaurant week. I had the cheese plate for an appetizer which was fine, but we had to ask for bread and our drinks took a while to arrive. I had the trout which was very underseasoned and did not blow me away. However, my husband got the chicken which was AMAZING. Again, the desserts were average. Not sure if they're trying to cut costs for restaurant week but I was not impressed. 300 east right next door is way better in all categories mentioned, and more affordable!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HfmoZIuNSWlN0J9-AgVWRA"
  },
  "rRx8MeVcxTbA6ZQC95tg5g": {
    "date": "8/2/2017",
    "text": "I like it here and will go back.  Service (both at the bar waiting for our table and at the table), food, and wine were all great!  No one in my group went away hungry or unsatisfied",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QdsSGFxPPlbFwEbiMoGl3g"
  },
  "TbqrhZuKAKZvdfvJJySADw": {
    "date": "7/27/2014",
    "text": "Elegant old Church. Beautiful details.  Restaurant week again in Charlotte and have wanted to try Bonterra for some time.  Made reservations and drove down tonight to give them a try.  It's in an old Church in Dilworth and they have preserved many of the original features.  While dining is Elegant, attire is somewhat more relaxed.    This place has some of the best wait staff I have experienced in the Charlotte metro area.  These are not kids making a few extra bucks or working their way though college.  The servers are older and professionals in theri craft.  Restaurant is the Pre Fixe arrangement where you get three courses for a set rate of $30.  Bonterra like most places allow you to upgrade your entree for a nominal charge.  In my wife's case, she upgraded her hanger steak to a 8 oz fillet for an additional $12 which was still very reasonable.  We both started with salads. She had the Kale Salad and I had the Baby Arugula. From the description it sounded very similiar to a salad I had had a Delmonico's at the Venetian in Las Vegas a number of years ago and it was indeed, very close.  She had her fillet and I have the Pork Tenderloin with Peach Sauce.  Cooked to perfection, nice and moist and full of flavor.  For dessert, we both had fruit and cheese trays which were a perfect compliment to an otherwise perfect evening.  We ill be back and probably will not wait for Restaurant Week to provide and excuse.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GGTF7hnQi6D5W77_qiKlqg"
  },
  "N2DQkllNBLnKqrttm6Y3Vg": {
    "date": "5/7/2016",
    "text": "The food was delicious and the service was great. This dinner was a graduation celebration and there were several large groups that night. The food came out hot. Our server was on her game. We both got the pork porterhouse and it was perfectly cooked. The grits were delicious but not a large portion. The deserts were the only disappointment. The donuts were a little dry but very nice flavor. I would definitely go back again and get the filet because it looked outstanding. Great spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ed6Skuzjbh_FD0GDHJhw0g",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Pork porterhouse!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ed6Skuzjbh_FD0GDHJhw0g/o.jpg"
      }
    ],
    "user_id": "0kevHgHX8i9mc2XTHhoDBA"
  },
  "Pjwgmim_vILjP42I0PpopQ": {
    "date": "4/29/2017",
    "text": "Love bonterra! My husband and I got married here since their food delicious and we wanted a quaint setting. A year later, we are still hearing about how delicious the food was at our wedding! If you visit, the fried lobster tail is a must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j2oWhaoXvhqidNcf4zJwzw"
  },
  "stQADGiQ8riF4setYH6Vhg": {
    "date": "5/14/2017",
    "text": "Food and service at Bonterra are excellent.  They don't rush you through the dining experience like so many other restaurants do today. They have an excellent wine selection and I love the atmosphere of this place!  The filet was cooked to perfection. Tender and great flavor. Other favorites at the table this night were the scallops pappardelle and wild boar.  Don't pass up dessert either. My suggestion; the donuts and ice cream.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y0UNn2jfZ6CvvgtyrDOsfA"
  },
  "gUgzyDr8th3QeYwlhVCaFg": {
    "date": "10/28/2015",
    "text": "Great spot for wine. Best wine selection in Charlotte. And 1/2 off glass special on every Wednesday. Don't miss it!! If you are a wine lover.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CYhs4XnUZsoi1-hvE651xw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Rioja braisede Meatballs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CYhs4XnUZsoi1-hvE651xw/o.jpg"
      },
      {
        "img_id": "PweH3ZAp0CluKAyFaH3ZlA",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Oyster",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PweH3ZAp0CluKAyFaH3ZlA/o.jpg"
      },
      {
        "img_id": "3TtG026EHqXcrv3eEHEeWg",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3TtG026EHqXcrv3eEHEeWg/o.jpg"
      }
    ],
    "user_id": "mGWcD7gVqC6wvkxvv99chg"
  },
  "NKEir-kmVmFzJ1-D_V0nwg": {
    "date": "2/1/2017",
    "text": "So I went a little Queens Feast crazy but in my defense this was for the Birthday of one of my besties. I really loved this place!!! The food was excellent and the service was awesome. I don't think I would've ever found it on my own but totally glad I did. The server was very knowledgeable about wine selections. He even got another sever to \"almost\" dance for my friend. My meal was the scallops and shrimp, just enough food and it was Delish!! If you haven't tried this place its a must.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CTmWaw6mWps0OmQKI0kzNg"
  },
  "Yx6aqNoRI364jzLCGe53kA": {
    "date": "7/22/2015",
    "text": "Restaurant Week Review: I have heard great things about Bonterra for several years and was excited to finally have a chance to go tonight during restaurant week. They did offer complimentary valet at the door, which was nice. The interior of the restaurant itself was interesting, although did not meet my expectations seeing as the building is over 100 years old. Sadly, the renovations have obviously taken a more modern approach and it would have been nice to see some of the original wood/brick structure. However, overall the atmosphere is pleasing.  My friends and I were promptly seated at a comfortable table in the center of the main floor. A few minutes later, out waitress came by to take our food & drink order. All was well, however regrettably this is where things started to take a turn for the worse. Let me preface by stating that I am not a picky eater in the slightest. I enjoy most all foods I come across and therefore I am writing this review solely based on my shock as both the service and food were not great tonight. Sad to say, this was an example of a restaurant that participated in restaurant week, but was unprepared, understaffed, overbooked and cutting corners on the quality of their food preparation. We waited 10 minutes for our wine to arrive and the waitress fled immediately from our table before we could ask about bread, which we could see on all of the neighboring tables. The bread (plain white bread) actually ended up coming out with our appetizers. I had ordered the Summer Gazpacho, which came highly recommended by our waitress. It was obvious that the kitchen had used too much smoke flavoring in the dish and the 2 of us whom had ordered it ended up only taking a few sips before pushing it aside. Also, the chef had made the decision to add sorghum popcorn to the gazpacho - why?! Nobody wants to bite into anything crunchy when they are eating lump crab meat. I failed to mention that we never received spoons, so for the first 5 minutes I sat there staring at my bowl and trying my best to flag down a waiter. Eventually one of my friends stood up and walked to the serving station to grab spoons. At that moment I saw the table next to us do the same. This is embarrassing for the wait staff, but annoyingly enough, they weren't even around to notice. For my entree I had the Brasstown Farms Sirloin. In general it was a nice dish, however overcooked (even though the waitress had made it clear that \"rare\" meant it would be \"mooing\", it was definitely medium). The dessert was tasty, we all had the Flan, but this too was ruined because I had to desperately signal over our waitress to see if she could retrieve our wine bottle from wherever she had taken it to 'keep it cool' and she retorted with a snarky comment about how she hadn't had time to get to it. Well DUH! It was painfully evident that Bonterra was not at their best tonight. Unfortunately, I will not be returning at my own will and I would bet the same for my friends.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g1E6lffOwZF6J4PJIxtd2g",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Blond Chocolate Flan (restaurant week) - with Topo Eight Oak caramel",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g1E6lffOwZF6J4PJIxtd2g/o.jpg"
      },
      {
        "img_id": "FdNifhnGk6oXIKr-1cc23Q",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Summer Gazpacho (restaurant week) - colossal crab, basil oil, sorghum popcorn",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FdNifhnGk6oXIKr-1cc23Q/o.jpg"
      }
    ],
    "user_id": "Q0QPm9GmpRzTPZlwyDB6WQ"
  },
  "43Aqy72zEntPLCWpoUKFiA": {
    "date": "12/28/2017",
    "text": "I have been eating and drinking wine at Bonterra for many years.  The service is impeccable and the food is always fantastic.  The other major asset is their extensive wine list.  Donna the bartender is excellent and always helpful with selecting the perfect wine for my tastes.  The atmosphere is elegant and yet welcoming.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xs-G4w58w1ZJHAoWoUUoVQ"
  },
  "_-KOyvn8QWpzCYq0S646Aw": {
    "date": "9/2/2013",
    "text": "For some reason I expected this to look like a church and that by eating here I'd have some sort of sacred experience. It barely resembled a church and it would never cross my mind if I had not read the church part somewhere.  I like Restaurant Week because I typically pick places I haven't been to. This time around I picked here because I'd heard good things about it. It is good, but just good at best.  I think the service was on autopilot. Standard, not special and maybe they felt more rushed during Restaurant Week. At times we felt a tad neglected...keep reading...  The food was good. I ordered the scallops and they arrived on a basic bed of corn. I guess I was expecting a bit more creative side. However, the scallops were very good. I also got the molten chocolate cake, but after biting into a piece of eggshell it lost it's appeal. This is where we waited and waited to get our server's attention...then when he acknowledged us, his reaction was as if this happens often. This was an opportunity for customer service to stand out. Again, Restaurant Week is busy and maybe they are just trying to get through their shift. They missed the mark on first impressions with us, but somehow they manage to keep the crowds coming in...maybe it's the historic patrons and nostalgia.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Reuq65EOFI938Yg8xgff9g"
  },
  "S_jUpggqtaD9j7AGvw-vEQ": {
    "date": "12/7/2015",
    "text": "We really enjoyed our romantic night out at Bonterra. The Roasted Leek and Parmesan dip was delicious! My steak was well seasoned, served very hot and ended up dry and a bit overdone for being \"Med-Well\". I wasn't able to enjoy most of the steak but my French Martini and appetizer were perfect.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R1l5OzPbWH8DtfrSrnNFew",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Well seasoned steak but ended up a bit over cooked and dry for a Medium-well order.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R1l5OzPbWH8DtfrSrnNFew/o.jpg"
      },
      {
        "img_id": "EQ__PhV2UBe_6pXsPXsUag",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Roasted Leek and Parmesan Dip- Amazing!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EQ__PhV2UBe_6pXsPXsUag/o.jpg"
      },
      {
        "img_id": "acjM0B0VBRcdmm0LM7oMQA",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Twisted French  Martini",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/acjM0B0VBRcdmm0LM7oMQA/o.jpg"
      }
    ],
    "user_id": "fTTcZ42UimT7zA2Tvr2otg"
  },
  "HLKZ86fOI2CDNz4yuah1yQ": {
    "date": "7/27/2015",
    "text": "We went during restaurant week in July. I wish we could have chosen from both menus because the food was just ok.  First off our waitress was a little off/ bread didn't come until we asked, only 1 kind of bread when other tables got more of a choice. My steak was not very special but I did enjoy the gazpacho. Could do better for such a beautiful space",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l6jrqB95P4alQkRHq9OWnw"
  },
  "lGtZZ14zwVYgEqLck0R1pA": {
    "date": "11/9/2017",
    "text": "Great choice for a staple southern meal in an awesomely renovated building. Emma was our waitress who was excellent and an extremely kind soul. Can't go wrong having lunch here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3uU_1ept14I5LBgIOiT-Og"
  },
  "ce5IPmDsh39Ycq0wDf-kzQ": {
    "date": "2/8/2010",
    "text": "Let me start off by saying the only reason its getting a star at all was because of our server John. He was very apologetic and very professional.  I had never been so this was my first time and unfortunately it was during restaurant week and I think that it not only failed me but my whole table as well. On a side note I would like to say that if a restaurant signs up to do restaurant week wouldn't they want to put out they're very best so that the customers come back? Just saying...  This space was nothing I imagined it to be it was very sterile and filled with old people (no offense) with such a cool concept as turning a church into a restaurant they could have done so much more color wise and maybe just more candles would have done the trick.   We started our evening with a cocktail then asked for a charcuterie and cheese plate. The cheeses good, meat very very very bad they tasted so old that they left that meaty flavor in your mouth so bad!   ok so now not only was that just bad, but for a restaurant that prides themselves on they're wine list, maybe i would agree if  they actually had any of the wines that we tried to order!! They might have a large list but carrying one bottle per wine doesn't really make you special. I kid you not our server actually had a running inventory sheet with him and 6 out of 6 bottles I asked for they did not have! We got stuck drinking wines that i wouldn't have ever ordered but there really was no choice.  Ok so we hadn't gone in with the intention of ordering the restaurant week menu but hey why not! So I ordered some pear salad that was ok. Then I along with two others ordered the Filet. It came out so cold that i had one bite and couldn't go any further. We called our server over and asked that they heat them all up. He comes back no more than 10mins later and puts them down again and not only are they still cold but they are not even a little bit edible I instantly spit it out into my napkin and look to my left and right and they are doing the same thing!! How is it possible that they could mess up on three nice cuts of meat? It tasted like they microwaved them they were so rubbery...  So at this point all the meat we've ordered this evening has been bad, Great! I am still so hungry it hurt!! Our dessert came and I had the creme brulee Thank God they didn't mess that up although we had some chocolate dessert that tasted like what we imagined cat food to taste like.  Again our server was mortified of our entire evening he took off a bottle of wine and the three of our entrees which he didn't have to do but was of course  thanked for!! I will say  that we did find it to be weird that not once did a manager come over to even apologize but left it up to his server to do everything not cool poor guy was busy!!  Needless to say after we left there we went next door to 300 east and ordered food all very good!!   I try so hard to look at the positive in a dining experience but sometimes its just that bad! I feel as though I get let down left and right in Charlotte where are the standards?? Quality??",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "SCqaYcRbmXKm6vgyMeIYfg"
  },
  "QvuUnTdQXsPfOlbAQTlZPw": {
    "date": "1/22/2010",
    "text": "Special occasion perfect... if you are a wine lover, you will adore the fact that Bonterra (good earth) has the largest number of wines by the glass in the city...  a tasters delight. I took a large group for a corporate function and everyone had a wonderful time. Everything was lovely and the service was superb, an impressive date place and a great romantic experience as well. They have a lovely private room for group dining upstairs and the staff even totally moved our tables around at the last minute when I showed up and asked for them to be moved to the balcony area, they snapped right to it. I was very impressed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MWuVbyBgP4vD24Rc7UH5xw"
  },
  "JLixxM2ogpyiNwt2Td2lAA": {
    "date": "11/14/2010",
    "text": "I really wanted to like Bonterra, but I was completely underwhelmed with my experience there.    My wife and I started with the Smoked Salmon & Goat Cheese spread, which was delicious. We also had the BBQ Duck Spring Rolls, which were supposed to be a specialty.  I found them very dry and a bit bland. Kind of like eating day-old pulled pork.    For entrees, my wife had the Filet and I had Grouper.  My dish was pretty boring- nothing special.  Her steak was pretty good, but also nothing exceptional.    For the price I felt a bit disappointed- I expected better. I loved the ambience- being in an old church was pretty cool. And the service was fine too.  But for the money, there's many better options in town.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W_uE1n0yah_-Q8MAqMT7TA"
  },
  "uF2Hrlk3Y646rvsrA1Jw7Q": {
    "date": "2/5/2009",
    "text": "I had a great experience at Bonterra.  It's a beautifully converted old church, making for a very traditional and elegant - but still inviting and fairly casual - interior.  Their filet mignon was spectacular; I ordered it rare and every bite was juicy and delicious.  We finished the meal with a dessert that was a special for the evening - a chocolate rasberry souffle that we had to request at the beginning of the meal as it was baked to order.  It came out to us hot from the oven, fluffy and heavenly.  My only negative sentiment is due to the fact that I ate here while visiting Charlotte from out of town, and I'm sad I don't live closer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "wu2TyI_yGXg51VBBb-D7jQ"
  },
  "4DRoFN9oN547TuEsnfMSyQ": {
    "date": "8/19/2012",
    "text": "One of the worst restaurants on Charlotte. I ordered a $45 lobster and was served something that was the same consistency as a rubber tire. The only good thing about Bonterra was the service and the wine selection. I'll never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zZI8i1bFQjb6tSTZU_5AoA"
  },
  "YOyZ3TTGj1w2JfxLR9M8Lw": {
    "date": "1/12/2013",
    "text": "I hadn't been there in about 9 years since my wife and I started dating (2nd date), and now I remember why.  The food is good, but way overpriced for what you get.  I got a very small piece of grouper (which was delicious) for $30, then had to pay $10 for a small salad.  My wife had a piece of chicken (thigh meat) for $24 and she was still very hungry afterwards.  If I am going to pay a decent amount of money for dinner, I want to at least be satiated.  The portion of fish should have been about 50% larger to make it worth the expense.    The atmosphere was nice and not loud.  I will just not be coming back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ddAeqxXXUWgsULhQVVSsOQ"
  },
  "NOhqboREoOV2fPvEV4LrYA": {
    "date": "1/8/2012",
    "text": "Bonterra is a great place to go for a romantic dinner for two.  The BBQ Duck Spring rolls and the Pecan Praline Cheesecake are a must-try.  Wish we would have been able to sit in the balcony section (but this may have been reserved for a special event).  Overall a pleasant experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mjzxxh0pXwzSTdgqMjd1ww"
  },
  "i02mKz4BvYXWZe-PZ45jjA": {
    "date": "7/11/2011",
    "text": "I was in Charlotte last week on business and found this restaurant on Yelp.  It was great.  Located in a renovated church, in a very nice artsy part of town (many of the shops seem to be located in renovated old houses).  They have an excellent wine list (bottles, by glass or flights if you so choose) - I had the Foley Pinot Blanc (very tasty!).  We started with the pate appetizer, then followed by the fresh Grouper.  It was perfectly broiled, moist fish sitting on top of a lovely bed of wilted spinach.  I also had side salad of fresh greens and nut encrusted goat cheese.  Then finished with Banana sorbet and cappuccino.  Lovely meal and service was great!  I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4a2SMP0wVZ6pbi_8aObtuw"
  },
  "r_dFQY1ImHFULMEaHzt1IQ": {
    "date": "12/23/2010",
    "text": "This restaurant was a beautiful and has so much potential that it pains me to relate my experience, which would minimize the restaurant possibilities. However, a guest does not pay money for potential. We were seated immediately, even though we were early for our reservation. The manager (?) offered to take our coats and was courteous. While we had to wait a little longer than I am used to in an upscale restaurant, it was not too bad. Had the gouda and yummy toasts while reviewing the menu. The best part of the meal was the duck egg rolls, amazing. I ordered duck, med and my guest ordered the chop med/rare. Someone, besides our waiter brought our meal and mixed up the dish setting. Unfortunately, my duck was med/rare and the chop was med. The food was \"okay\" and the biggest lack was the lack of service. I never saw my waiter again after he took our order. I told him of a birthday at the table, he didn't seem to care. I had to flag someone to get a check, ask another person walking by for tea (which I never received), and go to the hostess desk upon leaving to get our coats. I do not know if this is due to organization, lack of training, or apathy. However, the manager walked around and never greeted the guests or inquired. I have to admit that it appeared that the couple next to us who had a different waiter did get better service.  However, I did see several guests have to flag down their waiter and call out for coffee. I hope they get it together there...it has great potential! I have to say that I have received better service at the IHOP.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUm-kzS8Ma-UJRAV6YHh6w"
  },
  "wH43R0Rn_e0fn5k38UjuVw": {
    "date": "4/23/2011",
    "text": "Bought a groupon for Bonterra and was looking forward to a great meal with my husband.  We are working through the list of the 100 best dishes in Charlotte and Bonterra has the deep fried lobster tail on the list.  The building is neat as you are inside an old church.  The bar is at the altar area and the balcony seating overlooks the main floor.  Went on a Wednesday night to avoid the crowds.  Wine selection by the glass is extensive and the waiter very helpful in narrowing the choices.  We started with the fried lobster tail  It was good.  Moist and creative.  I liked the sauce served on the side.  It added to the decadence of the dish.   Moved on the main course.  I ordered the gnocchi and my husband had a steak.  The gnocchi was mediocre.  I love the gnocchi at Aria's and I just need to stop ordering it anywhere else.  My husband's steak was very good.  We finished the evening with dessert.  I pre ordered the oatmeal raisen chocolate chip souffle with their homemade brown sugar ice cream.  Loved the dessert.  Light and rich and not something you can get just anywhere.  My husband had the creme brulee.  It was well done and he enjoyed it.  We also had the molten chocolate cake since they did not get our dessert order correct.    They have a good list of scotch which is my husband's favorite.  It was a generous pour of one he had not tried before.  Again, the waiter was knowledgeable and helped him with his selection.  Our bill with tip for the 2 of us was almost $170 before the groupon discount.  Didn't feel like that good of a meal.  I think the meals are quite overpriced.  Well done, but there is better in Charlotte for the same or less money.   If I were to return, it would be to the bar to enjoy the appetizers and wine and scotch selections.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Ie8KJpup2kvUdUdIDKOvA"
  },
  "K7-5d-UMiEyyNTDDVmS-jw": {
    "date": "1/30/2011",
    "text": "We recently went here during Queens Fest (Restaurant Week) and were thoroughly impressed with the service, food and ambiance. The filet with the horseradish mash potatoes and asparagus was divine; and the scallops exceeded my expectations. Bonterra is definitely a Charlotte must DO ;) Enjoy!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y9obFH-Wy8ENyNSEXfZPkg"
  },
  "8hH2pz89IJ4CFfehb3DkSw": {
    "date": "11/1/2005",
    "text": "High hopes based on Wine Specator reviews and other recommendations. A large by-the-glass wine selection, although many seem to be overoaked California wines - and a few we tasted were materized and had to be replaced.  The food was just ok - the spreads were too cold and needed to be room temperature, including the housemade chicken pate. The pork osso buco was way too fatty and didn't come together.  We had a great waiter and they were extremely nice given that we showed up 20 minutes before the kitchen was closing. The restaurant is located in a converted church, but most of the interior was not preserved, so it almost feels a bit contrived in terms of atmosphere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Xi2i_i1RzKkoJ41_1JHig"
  },
  "FolD4o97bGLBhk8_jWg8eg": {
    "date": "8/20/2013",
    "text": "half off wine wednesdays, cute look, too quiet",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VBu5LDcEZtbSG68oM4QT0A"
  },
  "ZhLrttyQaOaRIzjKeM8ZnA": {
    "date": "9/13/2010",
    "text": "Tour of France wine flight was delicious.  My foie gras was scrumptious but tiny.  The grouper was prepared well.  Waiter did a good job.  Dessert fell short.  Ice cream and sorbert were grainy in texture, not expected from frozen desert.   Tab was pricey, but to be expected.  Crowd was loud that evening.  Overall, good place for a nice dinner.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "MN4nffVhWfTcxsLPXBoivg"
  },
  "xUorEAaUrzo2lhN1KVvRWw": {
    "date": "1/20/2013",
    "text": "I checked out their website, where to make a reservation I was sent to Open Table. I checked their site for the menu and saw lots of good food (duck spring roll and lamb) Well when we arrived we were seated promptly. We were looking for a quiet nice restaurant, where we could relax and just enjoy ourselves (2 kids at home with sitter) Well we seated and looking at the menu I knew something was wrong. Go figure, we were now part of restaurant week in Charlotte and I must say that SUCKED! I specifically tried to find a place that was not part of it. Well for $60 we got a small salad, 2 scallops, 1 4 oz steak and 2 slices of cake. We were cattle called in and out in less than an hour. Restaurants need to tell customers that they are part of the restaurant week because I know you get crappy service and crappier food.  Instead of slacks and a shirt for guys they were in jeans and TShirts.  No dresses for the ladies, just jeans for them too.  We felt a little out of place here and over dressed.  I specifically called and checked their website to make sure they were not part of this.  When we were seated we should have just left, but knew we were stuck cause no where else had availability.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_vKS7Kq7pAAqB5TsPKRIJw"
  },
  "xsoo3KY5AflZIz3ts3P2gQ": {
    "date": "2/16/2011",
    "text": "Not quite the most ethnically friendly restaurant.  I am aware it's in the Dilworth neighborhood and this is the south but my money spends just like anyone else. We were greeted nicely but were stared at throughout dinner and could feel the vibe coming off our waiter.  I consider myself a foodie and frequent many fine dining establishments.  This will not be one I return too.  My steak was cooked exactly the way I asked and was quite tasty.  The calamari and shrimp appetizer was also very good.  Nothing really wowed my taste buds and coupled with the service we won't be going back.  My BF had the scallops.   They were good but the Daily Grills are much better and less expensive.  If you are middle-aged and caucasian your experience will be fine, I'm sure.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CA1hazqrVmDvMDNoHx_NZw"
  },
  "J0T9vDMwRsIJroSPOcgjMg": {
    "date": "7/22/2013",
    "text": "A great place. Unique atmosphere. Excellent alternative to franchise restaurants.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iI1f1w2hzpSxJCduFklDsw"
  },
  "a-mdYcSXbxmDVJ9T65-cmw": {
    "date": "6/10/2013",
    "text": "The restaurant was ok for teh price.  The food was so so. The cat fish was too spicy. The salad was too small for $10.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xAz5oQWm9X9qNHJjSlwMkQ"
  },
  "Dq8Kwhc4PIeTd2sz_hru6Q": {
    "date": "12/12/2012",
    "text": "Tuesday night and the place was humming. The busiest I've ever seen it, which I suspect why it took much longer than usual to to get our drinks and food. The  servers here are the ultimate pros. Had the Caesar salad (w/o anchovies) for the first time; really good and presented differently from the usual.  We each had the Grouper entrees which initially appeared to be a small portion, but I couldn't finish mine. I was accommodated in having my lima beans swapped out for spinach. The grouper was very good. Entree menu is limited, but always well prepared and nicely presented. Finished with the pumpkin souffle which is still decadent. I would give more stars if they had the ability to do a better job with cocktails; no fresh fruit or herbs. The dilemma here is that it's a great wine bar with enormous selections attractively priced. The slowness id being served, without any reassurances form the staff, was another reason they earned only 3 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "97ZyDHiJosH_9P66JEprhQ"
  },
  "sAjy4da5-8GV0hT2thDmEw": {
    "date": "2/20/2012",
    "text": "Hubby and I went there for anniversary - used Open Table which asks if it is special occasion but obviously that info didn't reach restaurant.  It would have been nice to have a \"happy anniversary\" out of the waiter.  Food was just so-so and I remember the food being much better - split pea soup was featured soup - now I like a nice, creamy split pea soup (anyone from California will vouch for Anderson's Split Pea soup) but this was nothing like that - green broth with peas, some still hard, floating in the broth.  Not good.  Hubby had filet (awesome) and signature lobster tail - not so good - coating on outside had no flavor and virtually just fell off leaving an unappetizing shell on the plate.  After hearing tales of poor service if you whip out your Groupon right as you sit down (wait staff's anticipation they will not receive full tip therefore provide poor service) we waited and provided Groupon when check was placed on table.  Impeccable service just disappointing food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tz8eio3Lyf1l5uSHZAXyKA"
  },
  "mH8NECO2TMXHs9zb8lFqkw": {
    "date": "1/19/2019",
    "text": "If you like cold steak, runny soup, long waits for your meal and under cooked seafood in a stuffy setting this is the place for you! Usually Queens Feast is the opportunity for the restaurant to showcase its ability to prepare a variety of dishes....unfortunately, Bonterra failed the test. Won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mWp3lUTfYiQK_apZyu71Mw"
  },
  "v9XmZF7QRSwhmL9jfFiqfA": {
    "date": "6/8/2018",
    "text": "Planned to eat here with a 9:15pm reservation for two on a Thursday night because I had heard good things. They called me at 7:40 basically letting me know the restaurant closed at 10. I felt that was in such poor taste, I just cancelled. They shouldn't take late reservations if they have to call with an annoying warning about their closing time. Enjoyed another restaurant instead.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TI2A-iXJSSwmUY-3u3dOVQ"
  },
  "HJhmHQVcZE6EUDCFTVI7fg": {
    "date": "7/26/2016",
    "text": "I have been debating between 3 and 4 stars and finally settled on 3 because while we had some good dishes, we left feeling a bit underwhelmed.  Bonterra is in an old Church and there are tables on the first floor and some in a loft overlooking the first floor. Unfortunately, we were sat upstairs in a side room in the corner (I am pretty sure I made a Dirty Dancing reference here). The only other people in the room was a large group of like 15 ladies living it up. Looked like fun for them but it wasn't exactly the most romantic setting in the world for my husband and I, more cause we couldn't hear each other. Maybe a note that one loud group and one couple in one room, just don't mix well.   Since it was Restaurant Week, they had a pre-fixed $35 pp menu to order off of. I did notice that the menu online was a bit different than the menu that we received (aka. they replaced scallops with shrimp...sad face). I recognize that they buy very local and are extremely farm to table, so I just chalked up the changes to that. The ladies next door to us were not so pleased.   My husband and I love wine and this wine list was absolutely crazy. We decided to stick to glasses just so we could try more. When I told our waitress we needed a bit help, I thought they would have sent the Somm up but she proceeded to tell us her favorite 3 on the menu. Not exactly the help I was thinking of. We each had 2 glasses of wine during the evening and all 4 glasses were spectacular.  First course: Hubby got ribs and I got shrimp. In retrospect, I wish I had gotten the ribs too. The pickled cucumbers on the ribs were literally from the head chefs garden! Super delicious flavor. The shrimp were a nice light contrast. Good flavor and the crab underneath was solid.  Second course: Hubby got the steak and I got the paella, In retrospect, I wish I had gotten the steak (sensing a trend here??). The steak had this sauce/jelly on it that was just fantastic. Spot on delicious steak cooked perfectly medium rare (how a steak should be cooked!). It was served with these potato things that were so tasty! The paella wasn't really good at all. They may want to take this one back to the tasting room cause there was utterly no flavor to it. My hubby finished it for me though!  Dessert: I got the caramel cheesecake and my husband got the peanut butter mousse. The cheese cake was absolutely amazing. It may have been the highlight for me. The caramel sauce was 100% from scratch. The peanut butter mousse was equally as fantastic. It was a bit denser and richer, so a few bites of it was perfect for me.  All in all, a good evening. Nothing spectacular, but good. Price to value, not sure if Bonterra would make the list for a return trip. However, we had a very nice evening out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hw5riZfnB-B7G79vBTOssA"
  },
  "xZkmstm8UixAwR2kFBGgCQ": {
    "date": "6/8/2018",
    "text": "Great atmosphere, service and bartender. One of the only places that has a dry aged NY strip in town. Everything was perfect and is a great place to go for fine dinning and keeping it local",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "484wqFgGX7ait_BdbsHZAw"
  },
  "qDEAiQCalWVKqeWVV_tn9A": {
    "date": "4/22/2019",
    "text": "We celebrated an 80th birthday party here, and it was absolutely the perfect venue to do so. I want to offer specific praise to our waiter Josh, who did an outstanding job. He greeted us as soon as my mom and I arrived to set up the private room - providing a place to put the gifts, suggesting that he could remove the cake from the fridge now to allow it to come to temperature by the end of the meal, coordinating candles, and immediately asking if he could mix or pour us a drink while we waited for the rest of the party to arrive. Once the party got into full swing, I don't think a single one of us wanted for anything the entire time. Josh was an expert at giving us enough time to socialize and celebrate the birthday girl while still moving the meal along. I don't know how he got the timing of everything so right, but it was SO RIGHT. He was informative about the wine list without being pushy, and knowledgeable on every menu item. We wanted our guest of honor to feel pampered and appreciated and Josh went the extra mile to contribute to that atmosphere! Also, not for nothing, but the food was AMAZING, and the wine suggestions were excellent. I can't wait to dine at Bonterra again for my next special occasion (or just a regular Friday night!).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cr9QwiEYi0jyGMY0MOLrdw"
  },
  "Frd1fko31uzpwvCkzW0PBA": {
    "date": "4/22/2018",
    "text": "Went as a group of four on a Saturday night because it was the rare nice restaurant with 7 pm reservations still available a couple nights ahead of time. In retrospect, this probably should have been more of a red flag.  Mediocre service and food particularly given the price point. Nice ambiance. We were milked for several drinks each while waiting for our entrees without any explanation or apology from our server. Also, we had two servers who were not particularly coordinated with each other. The fried lobster tail was the only dish I would consider up to snuff.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5avezpisA3l-OfaEPc6BWg"
  },
  "fZz2XwWbBmrBt53IxRocdA": {
    "date": "6/4/2018",
    "text": "Was not a good experience, quite frankly I was scared of our server and didn't want to complain.  I felt like I had to sit there and just eat what she suggested the way she wanted it cooked.  She was not engaging at all and seemed annoyed to be helping us.  Recommend the duck medium rare and I asked for it to be well done and what do you know it was definitely on the rare side...I over paid for a meal I did not enjoy at all.  To the point I never write review and three days after my experience I am still thinking about it and would never go back there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9LzAYazbRg3pPnSBKn-2jQ"
  },
  "LdkWJzXY5gmJAqGSZZx8aw": {
    "date": "7/16/2017",
    "text": "I have to be fair because the food was palatable but that was it. I had the $41.00 ribeye and all I can say I felt ripped off. Aged beef I guess, but the taste was boring. We read a review that said the mussels were fantastic. Fantastic would not be the word I would use. Maybe I would use ordinary. Not great but not bad. The chef should take a lesson from George's Brasseries.  My wife had the duck and had 4 little slivers of unseasoned meat.  All together this place should reduce their price in half and then it might be worth eating here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O8GWloRXYgyubyQE5xbIiw"
  },
  "IWUNwBWPBl9UGUuRaMlfkw": {
    "date": "1/20/2019",
    "text": "This was my second time at Bonterra. The first was over a year ago with a group of 6 others. None of us truly enjoyed our food, the service was slow and not up to par with other fine dining establishments. I vowed never to go back, but a friend was so convinced that the restaurant was having a \"bad night\" so gave me a gift card. I finally decided to go back and give it another shot. I made the reservation over OpenTable and made a comment about our food sensitivities. We got there and were seated immediately. The waitress brought over ice water and 2 from the group sent that back for water without ice... why do people assume that you want ice?? She didn't seem happy and it pretty much went downhill from there. We ordered our meals (everyone had the shrimp and scallops over grits) and waited....and waited. Everything was super slow. We got the meals and the food was actually prepared well. About 5 minutes into it, we realized that our food sensitivities were completely ignored. The comment I made on the reservation was disregarded.... and that same ingredient was never mentioned on the menu. The waitress basically said that she didn't know because I didn't tell her...I did my job and told the restaurant. If there was a communication breakdown between the hostess and wait staff,  that's not my issue. I've never had to reiterate my point before. The wait staff has always been aware of food sensitivities based on the comment made when making a reservation. That's what restaurants that know what they're doing do. They are lucky it wasn't a severe allergy we were dealing with (please think about that for future diners). They did remake the meals, but the second plate was just dry, because I guess the sauce was what had the ingredient. The waitress didn't give us any information or guidance about it. Needless to say, I'm never going back to this restaurant. If anyone gives me another gift card for Bonterra, I'm going to let it go to waste...better than the experience you have when you actually go there!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OwRiGdRjeu8IYATimai95g"
  },
  "UpMMO2Ro1ROYwOX4rJBthQ": {
    "date": "1/17/2017",
    "text": "I was taken here for my birthday and really enjoyed the restaurant. upon entry, we were immediately greeted by the hostess and she wished me a happy birthday. We were seated at a two person table away from other patrons. I was very appreciative of this. The waiter came over quickly and took drink orders (also wished me a happy birthday).  He was very kind and answered all of our questions. Anything that he didn't know, he acknowledged it and went to find the answer.   We ordered wine, I had a Moscato d'Asti which was amazing. My companion had a glass of red; however, I am not sure of the variety. The restaurant offers warm bread and house made pickles. The bread was soft and taste, but the pickles were delicious. They were more on the sweet side, but not too sweet with great texture. We started our meal with the Mediterranean Inspired Cheese & Charcuterie Board which was amazing. I loved all of the meats and cheeses on the board and the toasted bread on the side was perfectly toasted. Even the palate cleansing peanut brittle like substance was delicious. Side note, anyone with peanut allergies may want to be mindful that this comes on the board. Next we ordered Flash Fried Calamari. It was light and crispy with an avocado sauce drizzled on top. Not greasy at all. The avocado based sauce had a lemon flavor and paired well with the calamari. For our entrees, we both chose the Cast Iron Center Cut Filet. This came with potatoes and asparagus. The asparagus had a smokey flavor, which I have never had before. The flavoring paired well with the steak. We ordered our steaks medium well, but they were brought out well done. I kept mine because although it was well done, the flavoring and juice were still present and it tasted good. My companion returned his. The waiter and manager were very nice about the whole thing and assured us that it was not big deal. The chef even came out to apologize. The second steak was perfect right down to the slightly pink center.   Overall this is a very good restaurant with great food. The management and staff handle criticism very well and work hard to ensure that you enjoy your experience. We will definitely be back to try other options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Dr1DjcL3DAO21RFhxSV5fw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Mediterranean Inspired Cheese &amp;amp; Charcuterie Board",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Dr1DjcL3DAO21RFhxSV5fw/o.jpg"
      },
      {
        "img_id": "iV4rkl8tpvaLfs_WIpxP0A",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Cast Iron Center Cut Filet",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iV4rkl8tpvaLfs_WIpxP0A/o.jpg"
      }
    ],
    "user_id": "eS-hHCh24UTOaXCwcfxzKA"
  },
  "ecJwNO9DUg6ElfuNJ0npdA": {
    "date": "1/28/2017",
    "text": "I had such high hopes for Bonterra when I went here for dinner the other night with a friend. I have heard great things so I wanted to love it. It was restaurant week. I got the mussels for my main course, the steak dinner and for dessert I got the chocolate peanut butter mousse cake.  My friend got the fried green tomatoes, the scallops shrimp with rice and the cheesecake. The best thing by far was the mussels. They had so much flavor and were just delicious. The steak was chewy and not a very good cut. The dessert was decent. All three courses left me hungry. My friends tomatoes were average fried green tomatoes. Scallops and shrimp were pretty good. Cheesecake was also just pretty good. I would say average but not my first choice of places. Not really worth the money. Service was excellent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dGUOe2TBchiGvU1BNkmTog"
  },
  "SXb0YVIvON9glA6E8w6j7Q": {
    "date": "8/4/2015",
    "text": "I was in Charlotte for business that happened to coincide with restaurant week.  A former customer and mentor was available for dinner and selected this place.  Short answer - it was a great choice!  The three course tasting menu was $35.  Add in a glass of wine, tax and tip and out the door for about $55.  The appetizer I selected included pickled and smoked shrimp.  I certainly picked up on the smoke flavor but the pickling was lost.  Beautiful and well constructed dish.  The entree of my choosing was a seafood medley.  It contained a mix of shellfish and fish but everything matched well.  I especially liked the flavors in the sauce.  Difficult to describe but bright and herbal.  For dessert I selected their flan offering.  Nice, firm custard with a rich sauce and a slight saltiness.  Another winner!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "I-wq3PJNBlaZ8tpi0SdS8A"
  },
  "_H17XNkZgxD7UpXSfmTgOQ": {
    "date": "1/12/2018",
    "text": "Just finished celebrating my legal marriage here.  Good news first: the wine cellar room was amazing! Such a cool space and it was free to reserve.   My family enjoyed the ribeye, pork chop, and scallops. Delicious!  Bad news: seriously, what's up with the filet? Four people at our table ordered it and requested 3 medium wells and 1 medium. When delivered, all four were rare, with very dark red centers. One person agreed to eat his, one person ate the edges and kept the rest to finish cooking later and two people sent theirs back for more cooking. Their two steaks returned, and one was cooked, but the other was just as dark red as before it was sent back! Thankfully, they didn't charge us for the failed entree, but seriously. Their kitchen operations needs some attention if our experience from tonight is a regular occurrence.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3sZIDIHBeRhskUA_0flTuw"
  },
  "B4cTBKFLNM4-Yg94D3Vruw": {
    "date": "11/6/2017",
    "text": "Excellent wine menu. So enjoyed the Pride cab!  Mushroom bisque was best item on the menu. Very few vegetarian options -- and little ability to adapt core menu. So had starter salad for Main. Was okay but sadly not filling at all. Carnivores seemed to be okay with menu options and desserts looked fabulous.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ffmigS9EVBHDzlBcTntYMQ"
  },
  "oK4hWrbaK-4D9XdhaT5BZQ": {
    "date": "11/17/2015",
    "text": "This place is so wonderful.  Very beautiful on the inside and out!! The atmosphere is great and just makes you feel comfortable and cozy.  Food is always great.  Service is good too.  Really good happy hour specials!!! I can't wait to go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "gYeL8Kz-Xa1MfIiwpWngpw": {
    "date": "1/20/2015",
    "text": "Paul's Yelp Elite Rating: 4.85 Stars  Yet Another AMAZING dinner during Restaurant Week....which is surprising from my experience. Met my Yelp friend Kate for dinner and I've never been here before (thus my selection for RW).   First off, I discovered their WINE BAR!!! Where the &$^!&#$! have I been??? This is an AMAZING BAR! About 200 wines BY THE GLASS! I almost soiled my pants when I saw that selection! Who does this....let alone in CHARLOTTE??? JD does that, that's who! He's the really cool owner of Bonterra, who was drinking wine next to me as we started up a convo......he's got a very educated palate (he better for offering 200 wines by the FREAKIN glass!!!), and a super nice guy to boot! He made me a deal as I brought in a bottle from my cellar (the 2008 VinStrata Oregon Pinot Noir).....no corkage fee if I give him a sampling of my wine. DEAL! Win win for everyone! Anyway, I got a Gigondas Rhone and got an Italian Pinot Grigio for my friend Kate. I actually had a HARD time selecting a wine....did I tell you they have 200 WINES BY THE GLASS??? LOL....  OK onto the meal. Just take a look at the Menu I posted a picture of. And look at the amazing dishes we both had. The Cauliflower soup was excellent, and that Pumpkin seed oil was delicate yet refined. Soup had good consistency and balance. Kate ordered the Lobster and Crab dip. That was very good too, but Kate named a not to be named restaurant (Dresslers....OOPS) that she said was even better. OK, put that on my TO DO list!  Kate got the Osso Bucco and I got the Waygu Sirloin. Both were really good, but I liked my sirloin better. While the osso bucco was very tender and good, it wasn't mind blowing. But I still thought it to be a very tasty dish. My sirloin was VERY good, done Mid Rare and that Horseradish butter was an excellent accompaniment (not too hot).  For dessert Kate got the Sea Salt Caramel Triffle and I got the Chocolate Mousse with SMOKED Paprika and Passion Fruit Caramel. Now ANYTHING with homemade Caramel I get. And both were really, really good. But my Chocolate Mousse was OUTSTANDING as the SMOKED paprika really made this dessert unique! I don't believe I've ever had a DESSERT with smoked anything (sounds kind of savory huh?)....but it worked! And with that Passion Fruit, well, it was stellar.  I hit the proverbial grand slam by selecting that 2008 (97 Point vintage in Oregon BTW) VinStrata Pinot Noir....man did that go with everything superbly (sans the dessert of course). Hard to pick a \"universally matching\" wine but I seemed to do it this night...the Wine Gods were with me! Woo Hoo!  If Bonterra is this good during Restaurant Week, I can't WAIT to return. But for SURE I'm coming back just for this AMAZING WINE BAR....  Did I tell you they serve 200 WINES BY THE GLASS? Holy crapola Batman!  Kudos to JD and the entire staff (Bartender, Server, Hostess, Chefs and JD himself) for providing me and Kate an awesome dinner experience!  Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "pBrrucfgBkq8H5aJq0q0nw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. The Amazing Offerings during Restaurant Week (Jan 2015)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pBrrucfgBkq8H5aJq0q0nw/o.jpg"
      },
      {
        "img_id": "cB61RIqhee7RKbtg0TU1Hw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Sea Salt Caramel Triffle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cB61RIqhee7RKbtg0TU1Hw/o.jpg"
      },
      {
        "img_id": "FHcDAFKzPHgw7A28jSi4KQ",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Dark Chocolate Mousse, with SMOKED Paprika and Passion Fruit Caramel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FHcDAFKzPHgw7A28jSi4KQ/o.jpg"
      }
    ],
    "user_id": "QYobbHEmhLGuS6QDqVRTLw"
  },
  "zvLpXjLSCrjD6XTeyRsRxA": {
    "date": "2/3/2015",
    "text": "Where do I begin?!  My girlfriends and I chose to sample Bonterra for Restaurant Week (Wed. 21 Jan), and our reservation was handled beautifully by the hostesses.  The bar was very crowded, and the setting was a tad awkward with the open setting of the loud crowded bar abutting the attempted ambiance of the dining room....  We were seated, served water, and given time to order... our appetizers came, and they were decent.  I was expecting more crab and lobster than cheese in the dip, but during Restaurant Week it seems most establishments dial things down a notch (though I don't approve of this), so I can almost excuse them for being a bit stingy...  Our emptied appetizer plates were promptly cleared, a few minutes went by, and we were presented with... ... our desserts?!  After exchanging awkward glances, we informed the servers that we had not yet had our entree course... they looked around awkwardly, and then cleared the the desserts... About 10 minutes went by, and our entrees arrived... Two were spot on, but one of my girlfriends received the wrong dish... so ALL entrees were removed from the table at once.  TEN MORE minutes went by, and all of our correct entrees were brought out.    THROUGH ALL of this, no one (not our waiter who kept our water glasses full, not a manager, not a hostess... ) NO ONE came out to apologize for the mistakes!!!  We were a little stunned by this as ALL of us have spent time in service!    The food was fairly good... well cooked, well served... nothing terribly spectacular... the desserts were also good and not overly portioned, which was nice...   At the end of dinner, we were presented with our checks, and I asked our waiter if he could break a $20 for me as I had no smaller bills for the Valet Service.  He asked if I could wait a moment, and came back with two $10 bills.  It was \"all he could come up with.\"  At this point, we were done.  We went out to the valet, said our goodbyes, and I asked the young man getting my car from 12 feet away if he had change for a $10... shockingly, he did... I'm amazed that a waiter couldn't come up with it!  In short... although the wine list was good, and the food was ok... the inadequate service indoors, and the valet service within an awkwardly small parking lot is enough to have made this a one-time visit for me!   I give this place 3 stars because the food was not bad, and the hostesses were excellent at their jobs.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "sl2R5RFdX1QBQX66T_IGwg"
  },
  "6a8NYTArT74l1Mp92LADyQ": {
    "date": "4/28/2018",
    "text": "The food and drinks were delicious. Everything from the cocktails to the steak and eggs; to the sweet potatoe pancakes dish. Yummy. Loved the porch action too!!  Great service. Excellent",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mrocUWFo989BDzUZ0aKa2A"
  },
  "mONatbLm774HHuIIJvauKA": {
    "date": "4/21/2015",
    "text": "Ummm where do I start? Atmosphere - check (old church with great art on the wall) Wine list - check (a billion) menu - check (basics, classics, specialties, and specials). Seriously. This place has it all. There are rooms for parties and the dining room is open and fun. The bar is cozy and busy. Bonterra often represents the Panthers and Charlotte at Taste of the NFLPA at the Super Bowl.   Opened up with the charcuterie and it was a great place to start. Waiter suggested a bottle of wine which was perfect. Wife had the fried lobster tail which is a dish famous here. Really good dish. I had the ribeye which was cooked perfectly and loved the sides too. Dessert? Forget it about. Awesome special which was a strawberry souffle. I need to get here more often. Remind me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVidDZUvOiy3xl0v3WKJlg"
  },
  "ZLP1orH1z1EVobYdsCzUlw": {
    "date": "4/19/2018",
    "text": "Never going back to Bonterra. This is the second time that we couldn't eat at the restaurant due to a private party. Very inconvenient.  And the food are not that great. Glad there are so many other choices now in Charlotte.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LetrO8RPycAEifdzDEeIXg"
  },
  "EqJoA5R2KPMej_S10Ua9Rg": {
    "date": "4/7/2019",
    "text": "Sorry, but this is a don't do for dinner. An impressive wine list and some unusual small plates or apps. Only two salad choices, and very mediocre at that. When I dine in finer places I always welcome suggestions from the server, ours, Joel, enthusiastically suggested a thick cut pork chop that was started on the grill and finished in the over. It was horribly dry. The quality of meat was low and the method of cooking made it worse, I left half of it. It wasn't too busy and I could see why, it must have lost it's luster over the past few years, it's tired. There are so many better places to try I'd suggest a pass, it's too much money for mediocrity. My companion had a rib eye, that two wasn't up to the $44.00 charge. His petite lamb chop appetizer was exquisite.  The deserts were excellent and I thought well presented.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kOslQ8i3EvtnFVkMzxZpNQ"
  },
  "Xwnti-0fQV78cLBzNLO5qg": {
    "date": "2/2/2019",
    "text": "Having been to Bonterra in past years, I was nervous about returning with the negative reviews that I see. We came and celebrated my grandparents 60th wedding anniversary with a large group. I requested that we be put into a quiet corner of the restaurant and even on a Friday night, they did their best to accommodate us by keeping the tables around us open for as long as possible. Our server Joel was awesome and very attentive. Most of our table ordered the halibut, the steak, and the osso bucco. We also split the octopus appetizer, the mussels appetizer, a couple of Magnolia salads, and the lamb lollipops. The appetizers were amazing! The halibut was so fresh and flaky. The ribeye steak was good but not super tender and in my opinion, not worth the price point.  We really had a lovely time and will definitely be back. I think the reason for the negative reviews is that during restaurant week the portions are very small and service is probably not as attentive with the amount of people in the restaurant.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LHY1GpTkKpWVfrwHVubXRQ"
  },
  "ygi8QPbwFsQZ4V8cqfzMwQ": {
    "date": "12/8/2017",
    "text": "When my coworker and I were dropped off an Uber in front of the back entrance, we were confused and worried we were dropped off at a church or bank. Thankfully, we arrived at the right spot for our holiday party and walked around to find the right entrance. The service was top notch at this location with a nice cocktail hour with appetizers and a nice three course lunch! Food quality is top notch. It's normally open for dinner and events only so plan accordingly!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "drXBvvg1oJli8bcrxDjuOw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Cheesecake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/drXBvvg1oJli8bcrxDjuOw/o.jpg"
      },
      {
        "img_id": "ae8vjfaBPs1BQvD0TKYDTA",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Filet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ae8vjfaBPs1BQvD0TKYDTA/o.jpg"
      },
      {
        "img_id": "cx2GSJWDmqNF0_GaYDFGJQ",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. House salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cx2GSJWDmqNF0_GaYDFGJQ/o.jpg"
      }
    ],
    "user_id": "wxqxIOP9SoqKY3ZxvKchqg"
  },
  "oNQDwq8-3zx0UadgYkc7Xg": {
    "date": "2/28/2019",
    "text": "Came here for Restaurant week in January 2019 and I enjoyed the favor of the meals, but the portion size left a lot to be desired. I order the octopus for an app and omg the olive tamponade was so delicious with the octopus. You know that kind of close your eyes so you can taste it better. Yum!! Also I got the filet with fingerling potatoes and asparagus with Demi glaze sauce. It was good, but after I was still hungry. For dessert I had the pound cake and it was just ok. Nothing special and definitely not the super moist(sorry only word I could you) cake my southern grammy makes. They can learn something from these grandmas in the south. I have actually dine here before like 5 years ago and while I do remember the beautiful building; I cannot remember the food so much. Maybe I will give them one more try and especially if the grilled octopus is still on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nq7CUT8IUgi8TMfsfIFicw"
  },
  "2Y8l8sUfxdjd5b5bZIiSIA": {
    "date": "2/17/2019",
    "text": "Service was exceptionally slow. Thankfully i was there for a delayed Valentine's dinner with my favorite person. Kind of liked the old church setting, even if that's a bit sad.  Sensed we got marginally lucky with the food selections, having read the other reviews.  Cheese and charcuterie board was decent, but nothing inspiring. I think I could get the meats and cheeses at Costco, frankly.  I had the lamb lollipops and the gnocchi, and both were very good choices. My wife had the fried lobster tail, which was very good when it arrived. And large.  We took about a quarter of it home to our babysitting daughter (a lobster lover) and by the time we got there it was strangely fishy smelling. She still loved it ... but that was weird. Server said they use fresh Maine lobster .. except when they don't. He said they often have supply problems, especially on Valentine's Day weekend.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FyQrUamokaPLDrBxGmzPnA"
  },
  "ypmi7yImzkPjsikhLf6mvw": {
    "date": "1/18/2017",
    "text": "My dinner group celebrated its 7th anniversary here in this repurposed church. The restaurant has been around for close to 20 years. This is definitely a splurge place but the dinner group does this for anniversary dinners.  A few of us met at the bar before being seated at the table. They have an extensive wine line and a few local beer selections as well as a full bar.  After being seated we started our ordering process. First the apps and soup course. Three of us had the Lobster bisque and two shared the fried lobster appetizer. The lobster bisque came out with a puffed pastry topping which the chef did just for our group. This soup was heaven in a bowl...or as one of my dinner mates said \"orgasm is a bowl\".   I then ordered the azalea salad and the venison to continue with my meal. The salad was beautifully presented and very flavorful. The venison was cooked spot on. Glad I changed my order from medium well to medium. The venison was served with a sweet potato pastry and variety of root vegetables. The root vegetables could have been cooked a little longer.  For dessert, I had the peanut butter cheesecake which was good but it was more of a mousse texture than a cheesecake.  After dinner, our waiter, Jeff took us downstairs to their wine cellar which serves dual purpose as a room that can be reserved for dinner. There's also an upstairs balcony that also can be used or more seating.  I have to say I love repurposed churches and I can't beleive I've lived so close to this one for years and this was my first time visiting. Great dinner even with a few flaws and outstanding service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zB-TBtFAckdhahvETepQyA",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. The wine room - available to be booked at no extra cost with 6-12 people.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zB-TBtFAckdhahvETepQyA/o.jpg"
      },
      {
        "img_id": "0P-jyaIDsi44fjHb1MSn6g",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Azalea salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0P-jyaIDsi44fjHb1MSn6g/o.jpg"
      },
      {
        "img_id": "Lk73KPVCAWtC0AuoPoyUlw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Venison",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Lk73KPVCAWtC0AuoPoyUlw/o.jpg"
      }
    ],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "svS2YOwQAcEvHSTBOpjlow": {
    "date": "12/19/2017",
    "text": "I have to say, I have been itching to try Bonterra for quite some time now and when our plans fell through because of a full-holiday buyout at another spot in-town I was thrilled (and a little surprised) when my boyfriend suggested Bonterra since we had heard it was just okay.  We made last minute reservations on open table, and when we arrived, ended up being that couple that walked through the back door of the said-restaurant, which was, what I suppose used to be the front of the church. We found the host stand, and she said it would be a bit of time until we were seated. We grabbed two spots at the packed bar, and I might have let out a huge gasp at the gorgeous bottles staring back at me.  While my boyfriend was--rightfully so--disappointed in the, what 5 beer selections that they had, I was in my own little wine-playground.  We ordered some cheese/charc from their bar menu which is a little discounted menu from their full, and it was good. As our reservation time passed, I went to the host and told her we'd just stay at the bar as we were hungry and the service with Heather was good. Plus we had the whole bar to ourselves! THE BEST. So I was a little surprised when the host approached us 5 minutes after we ordered to tell us our table was ready? We still stayed.  Mussels had great flavor. I ordered the crab/shrimp appetizer and for $22 I thought it was a steal for the portion size. Between the cheese and mussels prior, I could hardly finish it. My boyfriend enjoyed his short rib.   I didn't feel the restaurant feeling overly bloated or gross, which is always a win.  So let's talk environment. My boyfriend and I aren't super stuffy people, and he felt like we were in an old-school boys club-must-wear-jacket-to-dinner place. And we kind of were. Now, I must say, I was still in my wine-o land, and I don't think I took my eyes off of what I was going to drink next so it wasn't until we were chatting about our experience, that I was like, you know, I kind of agree. There wasn't really any sort of decor, which, simplicity is fine, but some sort of match-your cuisine to your restaurant is on many levels, important.  Even though he thought it was stuffy, you better believe I'm going to ask to go back...and sit at the bar. There's still 67 odd glasses of wine that I still haven't drank.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7kgmDR7So2cNJ5U00ImVGA"
  },
  "mSmcJWcIwuPMgwR6gDcQKw": {
    "date": "2/16/2019",
    "text": "[Revised] You can see my original comment below, which was promptly addressed by management. Although there was a snafu in communications of the offer, and the immediate response was less than understanding, once management was involved, my grievance was promptly and politely addressed. I hope to give a much better review soon. Thank you, Melanie.   \"We were so excited to have girls night here, especially with the 1/2 priced wine. Unfortunately, they advertised that it was 1/2 price. BE ADVISED: it's at the bar, and not for seating (NOT SHOWN ON THE WEBSITE THAT I COULD FIND) I was quite embarrassed when all of my 11 friends were so kind and paid without balking to the unsympathetic, but highly competent and hospitable waiter. BONTERRA. PLEASE. Update your website, and spare anyone else from an unsettling evening surprise.\"",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6vj-KI9GiQCmhDxsirny1Q"
  },
  "rVat2ETG2d-hGZkdU6JH4w": {
    "date": "8/25/2016",
    "text": "After reading through about 30 different pris fixe menus for restaurant week, my friends and I decided on Bonterra. Other menus were fairly simplistic, but this one stood out as really creative.  I had been here before for a dining competition, but it's been so long I couldn't remember if Bonterra was a competitor (it was an awesome evening though).  First let's talk about the wine list - amazing - extensive and somehow the waiters here really know the \"ins and outs\" of the wines. Our first bottle was a really fantastic Pinot Noir from Cali ($36) - nice choice John! I chose the second one, a Chilean Cab ($36) which was equally as rockin' - nice choice me! I left with a new appreciation for wine.  We each made sure to get something different so we could taste each other's dishes. My starter was the St Louis style ribs served with house made bread and butter pickles  - whoa baby - I could have eaten a full rack - for a non BBQ place - they nailed them! The shrimp, heirloom tomato and charcuterie starters were all good!  My filet was a perfect medium rare - whoever works the meat station here is the man! The deconstructed Salted Caramel cheesecake was pure melt in your mouth silky creamy goodness - loved the homemade crust as a cookie served on the side.  Our waiter, Kerry, was a supreme gentleman with a great sense of humor. We were part of the last seating for the evening, so we really got to take our time and enjoy ourselves!",
    "rating": 4,
    "rated": {
      "funny": 13,
      "useful": 18,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "AN3p6-521UtWwf7ywRlUTw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AN3p6-521UtWwf7ywRlUTw/o.jpg"
      },
      {
        "img_id": "XsXmf8OcvqnqHspdpJ5Qhg",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XsXmf8OcvqnqHspdpJ5Qhg/o.jpg"
      },
      {
        "img_id": "LAEwvDlclDq4FgEsKI6PuA",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Perfect Filet!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LAEwvDlclDq4FgEsKI6PuA/o.jpg"
      }
    ],
    "user_id": "5jJjY5_R06Og56VfjIc66A"
  },
  "DM3XVig75-0PW-Iq-KClyA": {
    "date": "12/20/2018",
    "text": "I expected great things from Bonterra as I have heard fantastic reviews from others in the past. Our start was very awkward because once we were seated and looking at the wine menu, our waiter asks us if we are sure we want wine because it gets expensive. Trying to overlook the comment we order appetizers and our main courses. All of which were satisfying. I won't be going back because a good product and bad service don't align.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VBLTh2_2tev-yjFa64gAfw"
  },
  "BkGKoyt_U-UJF36RAW_xIg": {
    "date": "12/15/2018",
    "text": "We so wanted to love this place. However, from the start it was a disaster. We had eaten many times \"years ago\" and it was excellent. This time...to start the wine list was fabulous...but not climate controlled and all the teens on staff don't know much about wine. The food was Meh but the service was absolutely horrific. We were not asked once how anything was. My chicken was ok, but my husband's filet was over cooked but our server disappeared until dessert sonhe had no choice but to starve or not eat. Later, our waiter showed up to just throw the check on the table. Just terrible....who is running this place?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RLPBGMnCw3t9Xi0_j69Rvg"
  },
  "digZdMWIbpTdv3GsLGc1zQ": {
    "date": "5/22/2018",
    "text": "Bonterra is a lovely restaurant, situated in the heart of uptown Charlotte. We have been on several occasions, typically dining here on Fridays and Saturdays. The staff is always friendly, informed, and highly efficient. The moment you park you can smell what awaits and we have never been disappointed. As soon as one walks into the entrance, the ambiance of the place is relaxing and inviting. I think the young female greeters are some of the most professional and friendly I have encountered in Charlotte.   Let's discuss the food. I always order the 8 ounce center cut filet here - because it is seasoned and cooked to perfection, and absolutely delicious. By far, Bonterra is one of the best places to order steaks in the Queen City, and easily one of the the top 5 local restaurants, IMHO. We also love the smoked brisket and scallop appetizer. All the homemade spreads are delish, and the Mediterranean cheese spread with olives is another favorite of ours. The venison and halibut entrees are also wonderful. We have enjoyed the vegetarian entree (varies per week) on several occasions. As for the wine selection - it is second to none in Charlotte. The staff knows how to pair great wines with each meal - the restaurant really excels with their knowledge and love of quality wine.   It's not the least expensive restaurant in Charlotte, but the quality, cleanliness, and exceptional service from start to finish is worth experiencing! A++ and 20 gold stars! When you're ready to splurge on a decadent meal, this one is worth every penny.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "viUHp76KWqM00dsHnNujYA"
  },
  "ZcGG5oVX6HNEJrsSldUoRw": {
    "date": "3/13/2018",
    "text": "This isn't a hidden gem by any means, but it is so different from what a millennial may expect from South End that it feels like an underrated gem.  My friends and I were a little surprised that during prime dinner hour (~7:54) on a (cold) Friday night they had open tables, but we were excited to try it and very hungry. As everyone else has stated, the main entrance is accessed from the parking lot. Once we found our way into the restaurant I was very, very happy with our choice! This restaurant has room for a coat rack at the entrance, the check in area has room to breath, the bar is gently separated from the dining room with a half wall, and the whole atmosphere could be described as classy and somewhat sedate. What a refreshing change from being packed into cramped yet echoing single rooms. I love the ambiance here, it doesn't feel pretentious, the interior feels like an upscale Italian restaurant (which it is) with white linen tablecloths and soft, bot not too low, lighting.   Our table had the grilled octopus and grits bowl for starters, scallops and chicken breast for entrees and a bottle of wine. It feels like a cop out to just write that everything was delicious and I would order it all again, but that truly was our experience. Do not blow past the Geechie Blue Corn Grits Bowl on the starters list, the duck was hidden in the plate's description!   I cannot speak highly enough of our waiter, he was fabulous and patient and made us feel special and right at home. We showed up looking 2 decades younger than and a few fashion marks off of their usual clientele and he was still provided us with the best service and wine recommendations that we would enjoy and be able to reasonably afford. We were never rushed in any way, even we were not ready to order entrees until we had finished the appetizers completely.   I will would 100% recommend Bonterra to a wide variety of friends and coworkers and will be bringing my family here for dinner on their next visit. I also cannot wait to go back on a date night!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hETgHml_EJ17ry4r_N8A-w"
  },
  "V6upbo19E51w92cUc_3fRw": {
    "date": "6/14/2017",
    "text": "Venue hunting for a wedding -   Beautiful location with a patio and 2nd floor area - better for a smaller wedding, seemed a bit tight overall.  Seats 175 total (broken into upstairs and downstairs) ~$55/pp stationed food  Pros: -Included: valet parking, all service utensils including plates, silverware, glassware, chaffers, serving utensils, table linens, napkins, tables, chairs & cake cutting service  Cons: -Bar is paid per consumption -Tents, dance floor, cocktail tables, votive candles and/or any audio visual equipment available upon request at an additional cost. Rental costs are not included in the minimum",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4tlOeA-h10Q-K6eQRnKkyg",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. patio area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4tlOeA-h10Q-K6eQRnKkyg/o.jpg"
      },
      {
        "img_id": "XnyXZ3cDwvKujQ9rNb9thQ",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. main floor",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XnyXZ3cDwvKujQ9rNb9thQ/o.jpg"
      },
      {
        "img_id": "31R6gA6IncnvL2V2zKldwQ",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Stairs (Only) to 2nd Floor Area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/31R6gA6IncnvL2V2zKldwQ/o.jpg"
      }
    ],
    "user_id": "F-TYd6eIvMIyInQrhW6oEA"
  },
  "AZtypjxfSk_lavU8JVHSfA": {
    "date": "5/31/2017",
    "text": "Really gorgeous restaurant and I was told that the building used to be a church. Nice ambiance and the service was marvelous. A good place for a big party. The she-crab soup was really good and the mussels as just slightly above average.  Several people in our group had the ribeye and fillet mignon. All of them were bragging on the quality of the steaks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xE_-bOaOwoOALhV_fsSOhg"
  },
  "wWi8h9qgPzFv9TNPSlWIoA": {
    "date": "5/8/2017",
    "text": "Better late than never...  Foodies & Fellowship...Queen's Feast Edition.  Our monthly jaunt around town brought us to Bonterra. The building is charming and quaint. It's an old church transformed into a top notch dining. The staff was very friendly and courteous. Our waiter Gary was hilarious! His timing and jokes were perfect. One foodie said , \"He reminds me of Steve Martin\".  I ordered slow smoked prime brisket for the appetizer. The meat was very tender and the bbq sauce gave it a nice dimension...not too tangy or sweet.  For the second course, I ordered shrimp and scallops. The been rice, andouille sausage with saffron aioli was tremendous! Each part of the dish paired well together. I was very pleased with my choice!!   Great atmosphere, service and fellowship!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sK0cvMLeHZismNp9-Yp5XQ"
  },
  "aflLSvQZ46ST4O0Kly2fbw": {
    "date": "7/30/2018",
    "text": "Had a great dinner with 9 Friends down in the wine cellar at Bonterra. We went during Charlotte Restaurant week  The chef at Bonterrra did not skimp on the menu. Great selection and the food was amazing. I had the PEI Mussels   and the Pork T-Bone. WOW....flavor explosion. Joshua B did an amazing job as our waiter! Bonterra is Charlotte Fine Dinning Institution!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YR6gU32uIwmCZAu1oumxSg"
  },
  "R2zb6A5do7KDg3oAPkd0vA": {
    "date": "1/24/2018",
    "text": "We had dinner there last night as it's restaurant week. Got there a little early and had a drink and some charcuterie at the bar. Heather was pleasant and attentive. Once seated, Anthony was very informative and just very professional. Really solid staff, I went with the octopus and short rib, where my lady went with the duck, and shrimp &scallops. All the food was amazing and the service was impeccable.  We'll definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qz6jpfNMNPTiqSxrIVpbKg"
  },
  "MAww4r32Q-o1SqwDz9bNHw": {
    "date": "1/24/2017",
    "text": "My first ever Yelp review so hope I don't cause too much confusion! I hope this helps those who are coming for Restaurant Week. Disclaimer: I think it's kind of long. O.O  I came here for Restaurant Week last night and I must say I was slightly underwhelmed. While I left full, I did not leave truly satisfied like you do after an amazing meal.   In terms of service, everything was a breeze. Though I was 5 minutes late, I was still seated immediately despite the bustle of restaurant week. My hostess was kind and my waiter was even better. I'd say he was the highlight of the evening. It was busy but he managed to stay on top of everything. Actually, he was so efficient, it was almost as if he read my mind whenever I needed to top off my drink or fetch a new fork.  While the food was only worth 3 stars overall, the service bumps my rating to 4. But anyways, onto the food!  Since we went for RW, it was 35 pp prefixed menu. We dined family style so we could all have a taste of each dish. There some hits, more misses.   For appetizers, we got... Fried Tomatoes...Probably my favorite appetizer. That's saying something cause I'm not a huge fan of fried tomatoes. It was paired with the lump crap and complemented by a spread of tar tar sauce and cocktail? sauce I believe. All the elements really came together in this dish.   Prime Brisket...I have mixed feelings about this one. On one hand, I enjoyed the flavor of the meat and the cornbread. But the texture wasn't there...At times the meat was juicy and succulent. Other places, it was dry. Quite confusing. Overall, the sweetbread was a nice complementary flavor but slightly dry.  Pei Mussels...My friends thought this was the best appetizer.  I thought the sauce was just a tad too sour. But, we all agreed the mussels were cooked perfectly and the bread was an excellent carb complement.  Appetizers were probably my favorite portion of the meal. Overall, they were the most tasty. PS. Just for S&G, the complimentary bread was okay. Wasn't warm or toasted. Quite bland but the paired olive oil was good! I recommend eating the bread with pepper and olive oil.  Entrees:  NY Strip...Definitely the star of the night. Medium rare was a perfect combo of juicy and tender. The bernaise sauce was tasty and I wanted more. The fingerling potatoes, though good, were hardly there. Seemed like a garnish. Green beans were nice and crunchy but again wish there was more. I counted 5 on the plate. First time I've ever experienced more steak than sides.   Short Rib...Eh. While the meat really was cooked nicely, I didn't enjoy the flavors there. I couldn't put my finger on the flavor, I thought it was gamey? It was just too dark and the flavor of the sauce couldn't rescue it. While light, the sauce was a little too tangy. The fries were excellent and surprisingly crispy and yummy but a strange complement to the meal I think. Oh well, still good.   Shrimp & Scallops...For a dish with andouille sausage, I couldn't really taste it at all. But the (2) scallops were delicious, as well as the (3) shrimps. I didn't like the brown rice with the meal because it didn't absorb any of the flavors well. Probably my least favorite entree.   Desserts:   Caramel Cheesecake... My favorite dessert. A little dense but still a nice combo of flavors. I like how it was deconstructed. Chocolate Peanut Butter Mousse Cake...I dislike peanut butter but I did like this. Texture was excellent and presentation was nice!  Raspberry White Chocolate Roulade...My least favorite dessert. It just didn't have the sophistication and completeness of the other desserts. I recommend the other two unless you're in the mood for something berry.   Sorry for the long review! I hope this helps if you're coming to restaurant week!  If I had to do it again, I'd get the Fried Tomatoes, the NY Strip, and both the Cheesecake and Mousse Cake.  I'd also come back if they had another discount deal. The aforementioned items really got my attention.  Also, remember to take a look at the HUGE wine list. Cocktails are supposedly good here too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K5_29zlJX3bMwDSbZQxANA",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Caramel Cheesecake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K5_29zlJX3bMwDSbZQxANA/o.jpg"
      },
      {
        "img_id": "pSe9o-MEX6OftggzOmeYSw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Chocolate Peanut Butter Mousse Cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pSe9o-MEX6OftggzOmeYSw/o.jpg"
      },
      {
        "img_id": "wLptVAlW8bM3SReULjsslw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Shrimp &amp;amp; Scallops",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wLptVAlW8bM3SReULjsslw/o.jpg"
      }
    ],
    "user_id": "0vY5rb0Ylajp-bhvo9Xxow"
  },
  "RFZXZBxYnZV7dEizgrhEHw": {
    "date": "7/24/2018",
    "text": "First time going to Bonterra last Saturday night  and during restaurant week.  1. The renovated church is stunning, and the artwork beautiful. 2. Our server Joshua was more than I could ask for. So professional and charming.  He gave suggestions and described menu options. I felt like he made our night special, no giggling waitresses texting on there phone here. 3. Food- I got the charcuterie plate and was good. I really enjoyed the trout as the entree. Coffee and dessert  which was the smores brownie.  Yummmmmy.   Ok one thing . I am friendly  and southern. Husband says I am to chatty. When I arrived by myself it was early and no one there yet, so I made my way to the bar and passed a gentleman who I could tell worked there and said hello. Not a word almost a grimace  from him. He later sat down at bar few seats over and i asked bartender was he the owner? Yes she said. Ummmm . Well everyone has a bad day.  I look forward to visiting Bonterra again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "swe3cf9ObJW428Jv3DVuMA"
  },
  "WrvuvtX4VciKGFp7sjGl3g": {
    "date": "7/22/2019",
    "text": "Bonterra is definitely a hidden gem! Despite having been to that area of town more times than I could count, I never noticed Bonterra tucked behind 300 East. It is located in an old church and easily missed.   We picked this restaurant after viewing the QueensFeast (restaurant week menu). Note: there was an error with the desserts listed on the QueensFeast site. They do not match the actual options. Check Bonterra's website for the actual menu. That was where the disappointment ended.   Everything we ordered was delicious! First course:  I ordered the Warm Brie- Roasted Garlic, Wildflower Honey, Sea Salt, Wood-Grilled Naan. My husband ordered the PEI Mussels - Lump Crab Meat, Coconut & Sweet Chili Broth, Toasted Baguette. Both were fantastic!!! The broth of the mussels was so good that the waiter offered to give us extra bread so we could \"sop up\" the remaining broth. This completely endeared him to us.   Second course: I ordered the Canadian Salmon - Whipped Ricotta Cheese, Fried Green Tomato, Summer Succotash, Asheville Miso Aioli. My husband had the Heritage Farms Pork Tenderloin - Barbeque Peaches, Jimmy Red Cornbread, Arugula. Again DELICIOUS!!!   Third course: We both had the S'mores Brownie - Graham Cracker Streusel, Chocolate Sauce, Torched Marshmallow, White Chocolate Whipped Cream. Need I say more?!?   Bonterra also offered drink specials which was helpful as their normal wine list was a small novel. I had the house Pinot grigio. My husband got the Church Mule which which was very good.   Great food....great service....what else do you need to hear?!?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m5Jx6ecLRRpiCFrac_PD4g",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. PEI Mussels Lump Crab Meat, Coconut &amp;amp; Sweet Chili Broth, Toasted Baguette",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m5Jx6ecLRRpiCFrac_PD4g/o.jpg"
      },
      {
        "img_id": "-7LFms2awNlOkb2wfO7CdA",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. S&amp;#39;mores Brownie - Graham Cracker Streusel, Chocolate Sauce, Torched Marshmallow, White Chocolate Whipped Cream",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-7LFms2awNlOkb2wfO7CdA/o.jpg"
      },
      {
        "img_id": "WJn6d_85c79iMII4peTifA",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Whipped Ricotto Cheese, Fried Green Tomato, Summer Succatash, Asheville Miso Aioli",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WJn6d_85c79iMII4peTifA/o.jpg"
      }
    ],
    "user_id": "ocOhn23rC6PhO_Xm_F65YQ"
  },
  "sB1uMp870VXF62bZ0Rm-Cw": {
    "date": "6/24/2019",
    "text": "The only reason I gave this restaurant 4 out of 5 stars was because of the bar tender.  My drink and my fellow diner's drinks were a bit off. Otherwise the food was terrific!   I was there for a company function and had a wonderful experience.  We started with bite sized crab cakes which were delicious and met our Boston native's requirements. Then we were served dinner rolls. The rolls were piping hot, obviously house made and had the perfect amount of crust. They immediately reminded me of my grandmother's bread- dense and thick. I ordered the filet medium and it was a perfect medium. Pink in the middle but warm throughout.  The vegetables were cooked exceptionally well and maintained a good crunch when bitten into.   The cane dessert. The options were sorbet, molten chocolate cake or creme brulee. I opted for the creme brulee. The size was perfect. It was served in a shallow dish and had a beautiful crunch and a sprinkle of dried strawberry for an added touch of flavor. This creme brulee was not only the perfect amount but it was also warm all the way through the dish and not just warm on the top.   I highly recommend trying this restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhbSzQfGKkB7_CON8ShmWw"
  },
  "-yQWcd0U4GrgUObVOCrZJw": {
    "date": "3/15/2019",
    "text": "When we visited Bonterra, it was for a sort of appetizers-as-dinner, plus we didn't really sit in the dining room, we nabbed an awesome seat off to the side of the bar, which was almost completely private. Definitely suggest it if you can work it out for yourself.  The only downside is that you're in the bar - which for some doesn't work simply because of the location, plus you are served by the bartender, which can be both good and bad (as depending on the level of activity, you can get the short end of the stick). All in all for us it worked well, though because there was a party of some sort going on, the food service was a bit slow.  As to the food, it was good, but not great. Some items were excellent - notably the meat and cheese board. While some spots make you choose a single meat and cheese at a time, they load you up at Bonterra. Totally worthwhile.  The other notable one here is the lobster. We decided to split the dinner portion, because it sounded as if the add-ons were worthwhile. We noticed others who went with the appetizer, and in fact even our server suggested that it might be a better choice. I think if we do it again, we might take that route. It was still tasty. Just something to think about. It was a bunch of lobster.  If you are more of a wine drinker, as opposed to the many who prefer beer, this is your place. They have a huge wine selection. Now I'm not a wine drinker (or much of a beer drinker, mind you), but just behind the bar they have plenty. I'm sure they have others somewhere in case those run out. Probably worth visiting on that alone.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "62GNFh5FySkA3MbrQmnqvg"
  },
  "235JXPhLHwXynW9OL3hVDg": {
    "date": "1/28/2019",
    "text": "Here's the Queen's Feast low down:  APP - Octopus vs Lamb Lollipop Both of these were delicious. The octopus had a great grilled flavor and perfect consistency. Came with 4-5 smallish pieces. We asked for the lamb medium rare and they nailed it. The olive tapenade went nicely with it. Came with 2 pieces.  WINNER - Both  MAIN - Duck 2 Ways vs Gnocchi  The sliced duck was flavorful and melts in your mouth. I didn't care for the croquette, though. It could have used a sauce. I would have been fine without it and more sliced duck. The portion was pretty small overall. The gnocchi was a more generous portion and had a rich sauce. The sliced duck went really well with the gnocchi.  WINNER - Both  DESSERT - Chocolate Bread Pudding vs Strawberry Cheesecake In isolation, the cheesecake tasted better. However, taking into account the weather and the rest of my meal, the warm bread pudding was more complementary.  WINNER - Both  CONCLUSION - Find someone to go with that's willing to do splitsies, because everything here was great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "YscjZezxLirEjK_bK82uAw"
  },
  "TnT71gPX_gc8ucE4FD1NsQ": {
    "date": "1/31/2019",
    "text": "I have been here 2-3 times now for Wine Down Wednesday.  Half prices wines! They have over 200 wines by the glass. I really haven't found selection like this elsewhere in Charlotte.   I love getting to try a bunch of different styles of wine I've never seen before. Also, the woman behind the bar is fantastic. You can let her know what tastes you like in wines and she will help you pick one out. Her pours are also generous.   I love that this place is in an old church, but I feel like it could use some updating. Feels a bit stuffy and unrelatable to me.   I've heard great things about the food and look forward to trying it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sAbHdUgrjMOiQQLNh0H0YQ"
  },
  "p1fQEHIrOesA7Uma8U0roQ": {
    "date": "1/26/2019",
    "text": "I went to Bonterra for Restaurant Week with a group of friends and we thoroughly enjoyed ourselves.  The restaurant is located off of East Blvd inside an old church. They have complimentary valet parking but we opted to park our car on the street.   The wine list here is extensive. They are known for having wine by the glass that you can usually only purchase by the bottle. The list was actually a little overwhelming but our server was very knowledgeable and they had a list of suggested pairings for the items on the Queens Feast menu.  I am vegetarian so my food choices were essentially made for me since they only had one vegetarian first and second course (this doesn't bother me- some of the restaurant week menus have zero veggie options). I ordered the magnolia salad, gnocchi, and pound cake. Everything I ate was heavenly. The gnocchi was rich and creamy and the pound cake was seriously to die for. They also put bread on your table that is dense and delicious with olive oil for dipping.  Bonterra is a great Restaurant Week pick. The $35 is a great deal because their menu is generally more expensive. We will absolutely return for a formal occasion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bQ5vdMu80hQBlsJpoQEP4g",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Queens Feast menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bQ5vdMu80hQBlsJpoQEP4g/o.jpg"
      },
      {
        "img_id": "CQ2POr4AMaUPCG2zdPv8hg",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Pound Cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CQ2POr4AMaUPCG2zdPv8hg/o.jpg"
      },
      {
        "img_id": "PaKtVnLFUkChKtNqhKgbHg",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Magnolia Salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PaKtVnLFUkChKtNqhKgbHg/o.jpg"
      }
    ],
    "user_id": "dPxR3kJmlX6mAYGyAWheOg"
  },
  "KW74AUfN_4-81yNa6SqI2Q": {
    "date": "2/2/2019",
    "text": "This restaurant has been around for a while, and for those Charlotteans native to the city, I've heard some great things about this restaurant because of their large wine menu. I went on a double date with some friends and we left thoroughly disappointed -- the portions were not of value, soup was cold (barely luke warm), desserts were bland. The only thing that was decent was the wine recommendation. Don't get me wrong, the service was great and the ambience was cool, being in an old church, but I come to restaurants for the food and this food was not worth the value in both taste and portion.   For appetizers we ordered the She Crab Soup (which came out cold when it should have been hot), the octopus (which was disappointingly literally 4 small slices of octopus), the Scottish Eggs (which was the only thing I found I liked, and it was just OK at that, with pimiento cheese instead the yolk), and the lamb lollipops (so much fat and not enough meat on the particular cut. There was also hardly any seasoning on them).   For entrees we ordered the scallops (underwhelming, with only 2 scallops in the dish), Duck Two Ways (you can't even classify it as two ways...the sliced duck breast that came out contained 3 slices of duck that were about three inches by an inch in size, and then the second duck was Confit which was 2/3 the size of a golf ball deep fried...how is a grown man supposed to walk away full from that entree?), and the gnocchi (very savory, sauce was OK, and the only filling portion of the night).   For dessert, strawberry cheesecake (which was a very small portion) and pound cake (which was super dry and thankfully accompanied with ice cream because that's about all I ate).   This place was OK, but didn't give me or my friends enough cause to come back or suggest it to our friends.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XrNL5BaLc1sJcoR3jnwJfQ",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Measly Octopus appetizer.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XrNL5BaLc1sJcoR3jnwJfQ/o.jpg"
      },
      {
        "img_id": "gtMHAd_4g6Cc-uK-IDLAKA",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Scottish egg appetizer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gtMHAd_4g6Cc-uK-IDLAKA/o.jpg"
      },
      {
        "img_id": "ouXbJ7Q9u4-kSIRDGiO5_w",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Pound cake dessert is dry.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ouXbJ7Q9u4-kSIRDGiO5_w/o.jpg"
      }
    ],
    "user_id": "8JiNjuhu1J45St3mEoQCfg"
  },
  "d6QDfU0tI935TOmGp1H2Ag": {
    "date": "7/28/2019",
    "text": "I went here during restaurant week so you do have to choose from the options provided. Not a huge fan of the ambiance. Wine was good. Heirloom tomato salad was nothing special. Filet was great, so tender and awesome flavor. Creme brulee was okay. All in all, this restaurant was good, but I probably wouldn't go back unless it was restaurant week again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-oE5GF93iTBZfeuGbWdcww"
  },
  "GcI8246KXQBSsPC4iBUzow": {
    "date": "1/7/2019",
    "text": "I am a fan of their 1/2 price wine Wednesdays!  It gets packed but the choices and the apps to go with it are really good.  Thursdays is burger day and they are amazing as well.  Spare decor in an old church in Dilworth makes for a lovely event space, special occasion or just a wonderful dinner any evening of the week.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "6mDn8x-1FNg4YgftUHJPAg": {
    "date": "10/14/2018",
    "text": "My first visit was during restaurant week. The restaurant was selected by the guest of honor and you know I am always down for someplace I have not previously been! I started out with a great glass of Harlow Ridge Cabernet that I enjoyed. Dinner was as follows:  1. Smoked Brisket & Scallop - Cast Iron Charred Corn Salsa, Alabama White Sauce. 5/5 2. NC Sunburst Trout - Anson Mills Rice Grits, Summer Succotash, Fried Pickles, Asheville Miso. 5/5 3. Vanilla Bean Creme Brulee - Fresh Berries. 5/5  The entire meal was delightfully delicious! I paid $35 + tax and gratuity. This was a fabulous Restaurant Week deal. I definitely look forward to my next visit to this restaurant where the food and service are excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VELUmFkF54wLDr9NAZtoDQ",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Vanilla Bean Crème Brûlée",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VELUmFkF54wLDr9NAZtoDQ/o.jpg"
      },
      {
        "img_id": "AWEUsuphR35EQMMD6Q_hug",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Smoked Brisket &amp;amp; Scallop",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AWEUsuphR35EQMMD6Q_hug/o.jpg"
      },
      {
        "img_id": "J-8YfW41DG2we_G-m3ET6Q",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Harlow Ridge Cabernet Sauvignon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J-8YfW41DG2we_G-m3ET6Q/o.jpg"
      }
    ],
    "user_id": "7PiRdxYF-Uvzn2fHqdtU1Q"
  },
  "ovrgTW6eM50EwrMmLEJPEg": {
    "date": "7/24/2019",
    "text": "Nothing short of fantastic! It was restaurant week, so I started with the lamb brochettes. I was stuck between that and the cucumber avocado soup, which also sounded good, but ended up with the lamb. It was tender, flavorful and the sauces were unique, but they paired well with the lamb. Then I, as well as everyone in my party got the filet Mignon. It was out of this world. The sauce was amazing (I'd literally drink a gallon of it). I don't normally eat fingerling potatoes when they come with my steak, but I tasted these ones because they looked good, and boy they were. I'd eat a bowl of them at the movies instead of popcorn! Anyway, thank you Bonterra for an amazing meal and I hope to return soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_okwApnbYsPgzXFJyudQmA"
  },
  "Od-7nUj-B1koxmnJxURAbw": {
    "date": "1/22/2019",
    "text": "My fiance and I came here for restaurant week this past Saturday night. We sat at the bar for a drink and waited for our table to be ready. I've read a few reviews about this place regarding bar service and they are all spot on. The service was beyond slow. The bar was maybe 3/4 full and we arrived at 8:30pm. There was one server who was not attentive in the least. When we finally asked to place an order she took my fiance's wine drink and before I could give her mine, walked away.  When she came back, she asked the couple next to us what they wanted. She did the same exact thing and only took her order before walking away. This certainly had nothing to do with us being men. I just think she clearly could only do one thing at a time and it was flat out awkward. Eventually, I got my drink and we went to our table.   After that poor experience, we had a superb meal. I wish I could remember our server's name because he was fantastic. While I was thinking of ordering the famous scotch egg, he suggested we try their P.E.I. mussels (by the way, he brought us the scotch egg to try free of charge which was overrated as he initially explained - sorry chef it was not good).  The mussels were a huge portion and they were so fresh. They came with a few pieces of soaked (in the mussel broth) bread.  We also ordered the petite filet and squash gnocchi which he highly recommended. He was so passionate about us ordering them and stood behind his chef's food. He was absolutely right!  I even overheard another server saying \"I have been in the food industry 10 years and never recommended a vegetarian dish in my life...besides this one!\"   Both the filet (double wood fired) and squash gnocchi were knockouts. I am still craving both  For dessert, we ordered the strawberry cheesecake and poundcake which were quickly polished off because they were so savory.     I highly recommend visiting this spot, especially because the ambiance is so unique. The restaurant was a former church and the set-up, especially the two back nooks, lend to its special atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0PgffBi1GluYJ-d_o226Ww",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Scoth egg",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0PgffBi1GluYJ-d_o226Ww/o.jpg"
      },
      {
        "img_id": "eLd-IP_e0EXO0V4qP9nDpQ",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. P.E.I. Mussels",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eLd-IP_e0EXO0V4qP9nDpQ/o.jpg"
      },
      {
        "img_id": "1pTUPWf7rwwTDQNQskslAg",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Pound cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1pTUPWf7rwwTDQNQskslAg/o.jpg"
      }
    ],
    "user_id": "Cgw0C6MfzhyfKwwyO_Mupw"
  },
  "aj17K8ZBL2iWydyx2E_Dew": {
    "date": "2/16/2019",
    "text": "Goose and I were quite disappointed with Bonterra on our recent visit on Valentines Day. From the service to the food, everything was bad to mediocre at best.  First of all, the service was incredibly slow. We were seated at 7:15 but our drink and food order wasn't taken for at least 20 minutes, despite waiters and staff circling around. Our entrees didn't come out until 9pm. We saw other tables who were seated after us get dessert before our entree even arrived. My food was a little cold, but at that point we were so tired and hungry that I didn't even bother sending it back.  Second, the food was disappointing, especially for the price ($140 per couple for four courses). To quote Goose: \"the quality is what I would expect from a subpar Longhorn.\" It was edible but absolutely nothing nice enough to warrant the price point. My tuna was served with soupy rice and over seasoned greens. Not impressed. The salad and desserts were fine, but again, of average quality.  With Charlotte's incredible and booming restaurant scene, I can't see this place gaining traction with young millennials and will probably die out as it's clientele does too. Suffice to say we won't be coming back and discourage others from doing so!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hh1M-3aDJZVTwwYYy9AnA"
  },
  "bRuKeYKh5xqtAziux-Lw6w": {
    "date": "2/9/2019",
    "text": "Went to this restaurant for restaurant week - and it was honestly nothing short of amazing. My friends and I shared all of the appetizers, and I can honestly say the Scottish egg was the winner. The portions are small but with the three courses - all very filling. The service was great, which was surprising because usually during Queen's Feast it is a tad lacking. I will be sure to return for a date night, as the food was phenomenal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OOnyiDuSpGytT-NxWToCqA",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Scottish egg",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OOnyiDuSpGytT-NxWToCqA/o.jpg"
      },
      {
        "img_id": "6f8WGLarwrLjsPCJRtwe5w",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Desserts!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6f8WGLarwrLjsPCJRtwe5w/o.jpg"
      },
      {
        "img_id": "llfxaiT7uEmAqUp-gzmWQg",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Steak with fingerling potatoes and asparagus",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/llfxaiT7uEmAqUp-gzmWQg/o.jpg"
      }
    ],
    "user_id": "oMcBz3NfDnpJ0ktVosC1cw"
  },
  "2cLREuqGBHeaCIjyHBmhCA": {
    "date": "6/1/2018",
    "text": "Bonterra is one of my favorite special-occasion / splurge dinner restaurants.  The menu changes based on seasons, and it is always a delight to see what new options are available.   I have never had anything but an amazing experience here.   I order the scallops anytime they are on the menu.  Other than that, pick something and I'm sure it will be amazing.    The wine list is extensive with lots of great options in the $40-$60 range.  The beer selection is minimal here - go with the wine.  If you need wine recommendations, the servers can readily guide you to a selection.    Bonterra has 2 private event spaces.  I had a small wedding reception (25 people) in the upstairs loft.  The service and food were impeccable and were wonderful additions to a great day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YwfrHXAxmkkWs8u0OTjC6g",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Scallops",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YwfrHXAxmkkWs8u0OTjC6g/o.jpg"
      },
      {
        "img_id": "Yxl_EkvdvTzgQIxszNil5Q",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Sliders",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Yxl_EkvdvTzgQIxszNil5Q/o.jpg"
      },
      {
        "img_id": "fsR1kZ9srUTl1TJvmxCbbQ",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Stuffed mushrooms",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fsR1kZ9srUTl1TJvmxCbbQ/o.jpg"
      }
    ],
    "user_id": "P0g72ss7P25E4A1Sb-LT_A"
  },
  "m3fETP7lEH63Mkvq3bVK1g": {
    "date": "12/19/2018",
    "text": "Good experience at Bonterra last night.  Service was good, food was good.  Appetizers - cheeseboard and octopus. The charcuterie board was well laid out and was a hearty portion. The octopus was very tasty as well, only 1 tentacle.  Dinner - I had the scallops and they were very good! 4/5 stars  Cheers",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bSD1k7XighmY9hYFx3iXgg"
  },
  "Q_uxo9idVbBu_NpF1KTACQ": {
    "date": "6/22/2019",
    "text": "Taken here on Father's Day also my birthday. .  Ordered the lobster tail at servers recommendation as it was a \"signature dish\" of theirs. It was grossly over cooked tasteless and parts were full of sand or dirt. I was ill after eating. My wife and daughter were not impressed with their meals either.  We liked their charcuterie and bread but everything stopped there.  Typical Charlotte restaurant.  Overpriced and underwhelming. Pisses me off.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mj41KhWycLWz9nXY5UTYeg"
  },
  "k8NYufu1wjqqtCfsLUivsg": {
    "date": "3/14/2019",
    "text": "I had a perfect meal here. Wine selections were excellent- lots of different flavours for lots of palates. Just the bar-appetiser menu is super generous. We got a cheese plate that had wonderful flavours and SOO MUCH CHEESE! You would have to have a complete cheese fetish to complete it. Which my wife does. But she couldn't. But we tried.  My vege smoked tomato cheesy gnocchi were insane.  The olives were also excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DoIQwK6Ba9q_Hf2LwrXiEw"
  },
  "QQRvDcwxOG9ASqlU428hrA": {
    "date": "6/15/2019",
    "text": "Beautiful atmosphere, very helpful wait staff! Charcuterie was wonderful, great wine selection. We both felt that our entrees arrived a little on the cold side, but we didn't want to make a scene about sending them back - plus it had already taken a while for them to arrive in the first place. We had a decent experience but I don't feel like we need to go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YTm3bBonrHBgSjEAyIekcA"
  },
  "xtChTDgIHNsjeSwiSaXNGA": {
    "date": "2/5/2018",
    "text": "This had been on our list of restaurants to visit and decided to take advantage of restaurant week. As expected they were packed but the service was great and didn't feel rushed.   We ordered the Duck 2 ways and scotch egg for appetizers, salmon and shrimp & scallops for the main course and cheesecake and brulee for desert. The smoked duck breast was delicious and could've had a whole plate of that. The main courses were also really good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R-LLAEcZB_weROrfQz2J2w",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/R-LLAEcZB_weROrfQz2J2w/o.jpg"
      },
      {
        "img_id": "CGX3VL4T7nJim7RRotOwug",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CGX3VL4T7nJim7RRotOwug/o.jpg"
      },
      {
        "img_id": "gvv4J7LHXO4mxLRvfOp3sg",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gvv4J7LHXO4mxLRvfOp3sg/o.jpg"
      }
    ],
    "user_id": "CgG6X3k3DGSL2RR3ekzfsA"
  },
  "QjMVFRjF1LnaBqXTiLWzmg": {
    "date": "1/23/2015",
    "text": "I have been anticipating Bonterra for over a year but haven't made the time until this most recent restaurant week.  Unfortunately my experience will not have me going back for more. Our server was not helpful in the wine selection after he named off about six bottles that they were out of, including my top two selections.  It would have been helpful to have some suggestions.  When our appetizers arrived, it was evident that they had been plated way before we ordered because they came out in just a couple minutes with an extremely hot plate and moderately warm food.  The other two courses followed suit.  I really enjoyed the flavors of the roasted duck paired with root vegetable hash and green beans.  The osso buco was not a table favorite as it was fairly plain and lacked any real flavor.  Our server let us know that they were out of the trifle dessert that we requested, leaving us with the panna cotta and dark chocolate mousse.  The panna cotta was amazing with local honey and a sweet brittle!  Unfortunately the mousse was not very good at all.  I could see how others would enjoy the bitter dark chocolate and paprika but we took one bite and it was pretty much inedible.  While the food was not horrible and there were really delicious items on the limited restaurant week menu, it was the experience and service that really left me with an unpleasant taste.  Throughout the three course meal, our server, our server appeared once - when the appetizers first arrived.  We eventually had to stop the hostess to get our check.  The whole dining experience seemed like a factory assembly line, trying to get customers in and out of the restaurant quickly with no sense of warmth.  I really didn't feel that the value of the service and food was worth the amount of money I spent.  I'm sure the menu and experience is probably a lot more pleasant outside of restaurant week, but I thought the whole point was to bring in new patrons and build repeat customers.  This place has so much potential, but I most likely will not be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7PbgeWBXgqPUKx8XrFJb9g"
  },
  "dJKD3r2FJ_ailPrafRhYHw": {
    "date": "4/13/2014",
    "text": "Honest opinion: I had a wonderful experience! So much so that I had to review this from our dinner here last night.  Food - I am a big fan of charcuterie plates! The mister and I went for the Chef's special that included two types of meat and two types of cheese for $19. I expressed to the waiter, Jeff, that I love hard salami (and that's what we got!). There were two diff kinds of spread - one was mustard (which my husband and I did not care for) and the other looked like seeds of some sort that was part sour, part pickled, part something that was complemented the crostini and cured meat. - We asked for their short braised beef with pickled veggies (banh-mi style) and were blown away by the flavor. The meat was succulent, juicy, and tender off the fat (starting to salivate)... It's a bit on the small scale for $10. I would order two of these next time!! - Entree - I ordered the scallop on top of a bed of hominies in miso broth. Loved it! I can see people may be turned off by eating the hominy, but I grew up eating them.  - Dessert - Jeff recommended the souffle that was dee-lish. It had a wonderful presentation and a great finishing touch to end dinner.  Service - Ask for Jeff B! He is attentive, will listen to you and get you what you want. Considerate about the timing of each food brought to out to us. We were super pleased with his excellent service.   Place - I honestly love the place. Outside it looks a bit meh (church reno to a restaurant). Inside, was large, high ceiling, and had a comfy decor.   Price - This restaurant is pricy! A dinner for two, depending on what you order, will be around $100 or more. Portions are a bit small for the entree, but perfect that it gives you enough room for dessert and feel satisfied. For great service, great food, and nice ambiance - the money we paid was worth it.   All in all, I was left satisfied and full.  We were not overly full where you cannot move, feel bloated, and in pain. My husband and I would totally come back here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4m_44zfmfIEnvWxj-qf3XA"
  },
  "KgglpLKjNLSx5CU_JU12Cw": {
    "date": "1/23/2012",
    "text": "This was my first visit to Bonterra and one for which I teetered between a 3 and 3.5 rating. Overall it was a pleasant dining experience; I'd give it another try.  Scene: Biz/smart-casual attire and dressier, depending on your occasion. Good for romance, deal-sealing and refined evenings with friends. Bonterra is a converted church; I believe the bar and its glorious display of wine is positioned where the pulpit once was.  Food: Delicious bread made in-house. I started with a healthy portion of field greens with cranberry-champagne dressing and proceeded to the short rib, which was tender and flavorful, though my cut bore a giant bone that made the (edible) portion look bigger than it was. A side of goat cheese gnocchi completed the entree. The chocolate molten cake was gooey indulgence.  Wine: Holy selection--an overwhelming by-the-glass menu with a pretty good mix of grapes and regions.  Service: Poised and attentive despite the crush of Queen's Feast diners. To the latter point, however, I will say we felt rushed from our table at the end of our meal. While we were aware of the next seating crowding the bar area, we still were finishing our drinks. Our server had brought our check only minutes before and returned to ask, \"Are you going to pay that?\" I would've suggested feigning ignorance and starting to pick up the check presenter (e.g. \"Oh, I'm sorry! I thought your card already was in here.\") versus his more pointed phrasing. Also, another staff member came to \"arrange\" our olive oil and salt/pepper grinder not once, but twice, despite our meals having been consumed already. We got the point.  Misc.: The hosts were friendly upon arrival and seated us promptly, though I would suggest a different coat-check system for busy nights. Numbered tickets would be a safer, less awkward bet as opposed to the host/diner sifting through dozens of coats on a rack, or worse, said diner's coat walking out with someone else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wWAJ5WEAs7kL7e20RT79kQ"
  },
  "aL8x95DboP48T04JT4Gusg": {
    "date": "9/26/2011",
    "text": "Oh, Bonterra. I wish I made more money and could eat your food every day.   This beautiful restaurant, located in an old church, is definitely one of Charlotte's best. I've been there twice - once during restaurant week and once with my dad and boyfriend. Restaurant week was great - I had the soup of the day (a carrot something, it was divine) and the mahi-mahi (also amazing), and a peach tart (good). Didn't think that meal could get much better, until my second visit.  We started off with a bottle of Malbec. Solid. The wine list is extensive but pretty pricey. We shared the tomato basil dip (a little too whipped for my taste, but the guys loved it), some olives, and proscuitto. The house-baked bread, prepared fresh every day, is fabulous.   I had the Arctic Char with risotto and mole sauce. To be honest, I was a little wary. Mole with char? I thought it would be too heavy or overwhelming. Instead, it was amazing. The char was perfectly cooked with a little crust on the outside. And OMG the mole. Oh that mole will be in my dreams. My dad had the ribeye and loved it; my boyfriend had the veal porterhouse and enjoyed it, as well. We were stuffed, but split the creme brulee for dessert which was, you guessed it, pretty darn good.  That char, though...man oh man, get yourself to Bonterra now.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SB7Dd-10J_t6fgA8BMa_-Q"
  },
  "cj_0TadqHeshTxnGohiN8A": {
    "date": "1/10/2015",
    "text": "New Year's Eve Disappointment  I took my family to Bonterra to celebrate New Year's Eve and they offered a prix fixe menu. The only word I can use to describe our dinner was 'disappointed'. I feel bad for our waiter who was great, but the kitchen failed miserably. The table sent back four bowls of lobster bisque three times until we gave up. Either the broth was cold or the lobster was cold. Then all but one of us sent back our main dish due to seriously undercooked meat. 'Medium' is not gelatinous and cold, but that's what we got. I sent my filet mignon back and never bothered eating the follow up hockey puck. The waiter was obviously exasperated with the situation, but we tipped him the normal 20%. I have to say that $600 for that dinner was a disaster and we shall not be returning diners. To note, I've eaten here five or six times in the past, and the first was the best. However, as the restaurant scene in Charlotte gets better, there is no reason to roll the dice here any more.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Te_00KdDUNpvGXuSPZEVw"
  },
  "d_6PYhaS41165A9ymO7yIA": {
    "date": "6/12/2011",
    "text": "The place is nice. Free valet is great. The entrees are the worse in the city. I've been there about 8 times. I get gift cards and I have tried almost everything. Please don't waste your money. If you have to go. Order the appetizers, they are awesome. Steaks are the worse. Their deep fried lobster tail is a joke. Not worth mentioning the rest. Great place for cocktails. The chef needs to go back to culinary school.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "XO0UfcfbYOrcjtggHeZN2w"
  },
  "I9lgzF3BWI2wE9dWY1jTQQ": {
    "date": "3/22/2011",
    "text": "Besides finding GLASS in our butter, the service was very slow and food was not worth the price. For their selections and quality of the food, the menu would be better suited at the $15-20 range and not high $20's-30's.   In addition, our reservations were incorrectly made and the waiter was extremely skiddish and unknowledgable about the food.Furthermore, when we notified management of the glass in our food- the bar manager promised someone would call me the next day to 'right their wrong.'   Three days later I called and after being hung up on, I finally spoke with John, he asked me what I wanted after I explained who I was. After I told him I was promised Bonterra would 'right this wrong,' he then tried to pass the glass of as ROCK SALT. I told him, 'uh, no. it was not rock salt, i can tell the difference. besides, rock salt would not cut my gum.' Finally, he offered a refund or gift certificates-- I accpeted the refund. John told me it would take 36 hours to process. A week later, still no refund was processed. I again had to contact Bonterra. John emailed me back: \"We do not have access to your full credit numbers and exp date. We were waiting to hear from you so we could process.\" Bonterra has my cell phone number, my husband's cell phone number and both of our email addresses.   I was quite surprised by the complete lack of urgency and pure laziness by the owner. I guess, if I were running a business and someone found glass in my food, I would act hastily to make sure my customer's image of my restaurant is not tainted.  Now, not only is there a cut in my gum left from my experience at Bonterra, there is also a bitter taste in my mouth.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "hpwtfwzLFdeYq4yAJ6d-bQ"
  },
  "qDiYEbfxV_0982Kkk6JOdA": {
    "date": "1/22/2016",
    "text": "Gorgeous place. Bit too pricey for the portions. Salty trout. Ceilings need repair. Waitress a bit too much. Save some money and go to Halcyon. Our birthdays went unacknowledged too. Timings of the delivery of meals were awful. Felt rushed and it wasn't crowded at all!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cOdJInBq-yVCQqALCt8Yrg"
  },
  "iSLjuUDib4fCBSD_yiD-ig": {
    "date": "2/19/2013",
    "text": "I purchased a $50 gift certificate from Half Off Depot since we'd never been here and I'd always heard good things about it... The wine list was pages and pages long...  I actually recognized a few of the wines and felt a little good about it... lol We started with the Black Diamond Cheddar, which I thought was great and the boyfriend thought was meh... I had the filet with asparagus and some sort of derivative of potato... I was thoroughly impressed... It was perfectly medium well and the asparagus was relatively crisp, even though it was sort of mixed with the potato situation...  The location is beautiful and the valet was very great since it was super cold out... I did love the little coat rack and the guy taking coats upon arrival... I really liked not having to stick my coat and scarf on the back of my chair... What can I say? It's the little things... I'll definitely go back once I get another one of those gift certificates or have a special occasion because this place is pretty cool and their prices reflect that... lol",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ttZSRwCZiFMXwUO2Vr9pBg"
  },
  "wRbaanmWOxA8Erm5tGVHZg": {
    "date": "2/19/2016",
    "text": "While I understand that restaurants have fixed menus, and raise their prices, for special occasions, I do not expect  to receive poorer service. We dined at Bonterra on Valentine's Day. I wanted it to be a special evening. The food quality was average and the service was less  than average. Our place settings had a bread dish. However, we were never offered bread. Why set the table with a bread dish? At no time during our meal were we asked if we wanted coffee. This is highly unusual. We were asked several times about wine!! I know it is more profitable to sell wine, but that does not serve everybody's needs. Each course was served incorrectly. One of the servers promised to get dessert right - he didn't. In general we felt that they were more interested in turning the table for the next couple. For the price I do not think I would return to Bonterra.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C-rX-E5tAdqWJFUF1_XIfA"
  },
  "tbMoAXD0kTF97P_0pWwp0Q": {
    "date": "12/21/2011",
    "text": "Spectacular dinner!  Recently updated menu.  House made breads.  Incredible wine selection.  Reservations not required, but not a bad idea.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DieN3Cc5NrnOro8KGWh0lQ",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DieN3Cc5NrnOro8KGWh0lQ/o.jpg"
      },
      {
        "img_id": "KBIY6YnKTEJhyRewJJR17Q",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KBIY6YnKTEJhyRewJJR17Q/o.jpg"
      },
      {
        "img_id": "IbqYJdYhibwp_-aKRUT7Xw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Superb Reds",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IbqYJdYhibwp_-aKRUT7Xw/o.jpg"
      }
    ],
    "user_id": "jKx0XOTrnT6gHiiRZ-UVKg"
  },
  "a1Mn_65u_j6-DMEYCnmvhg": {
    "date": "5/5/2011",
    "text": "Went here for dinner last night with a corporate account where the intent was to entertain and fully explore the menu, prices not an obstacle.  We got the private room experience with the table down in the wine cellar and, while totally separated from the rest of the restaurant, we were pretty well taken care of.  Room for up to ten while we gaze into the bins of their reserve wines.  I was a little surprised we had just one server for a party of 8, and there were moments where we had to do our own wine re-pours, but I still felt like our server was never gone for too long and was diligent in taking orders, making suggestions, and getting plates to the table.    I would be remiss note to mention the bar, however.  Since Bonterra is known for their extensive wine-by-the-glass list, this is worth a visit and the other patrons beside you are a literal who's who of the Charlotte movers and shakers.  For example, our local NFL-franchise owner was in the house last night.  You could totally make a night out of just hanging at the wine bar and doing appetizers, especially during the happy hour specials.  But back to dinner, we started off with an assortment of cheeses and charcuterie which was chef's selection and was just an OK mix.  Nothing over the top or adventurous, but all picks you would expect, which was a little *yawn* boring.  We also had calamari and rock shrimp.  Our two orders were a little light on the calamari, but at least they were not the uniform rings heavily battered and deep fried.  There was a light sauce on the calamari but not on the rock shrimp, which were also battered and fried.  That plate was a little bland, but the seafood did all taste extremely fresh.  The misstep dish was the BBQ Duck Spring Rolls- nice presentation, but the flavors were never apparent to me and I've frankly had a better roll at the take out Chinese places we all know so well.  Overall bland and not enjoyable.  Main courses included the fried lobster tail, which was huge and juicy, putting a new spin on this dish for me.  Also got into the huge U-10 scallops served on a perfectly done butternut squash risotto.  Scallops can easily be overcooked and become tough, but these were just right.  Also got to have some ahi tuna in curry sauce and crusted in pumpkin seeds, which really hit the spot in terms of flavor, without overpowering the taste of the fish.  Flavors were balanced and presentation was well-executed.  All of our dishes were served piping hot, which was notable since we were not close to the kitchen.  For dessert, there was a molten lava cake, creme brulee, tiramisu and a cheesecake.  Most were tasty.  Note some of these were not made in house, but from the small Queen City Bakery.  The only misstep was that the tiramisu came out basically frozen, like ice cream, and our server had no idea if that was the intention of the kitchen's presentation.    This is definitely a restaurant to splurge with and go have some great wines you likely can't get from just anywhere.  Too bad the kitchen and its menu can be hit or miss.  While there are moments to get excited over, there also also some land mines to avoid.  For the prices charged, everything offered should be a shining star.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AwyM03qzhwgyskBruurWQw"
  },
  "liV1yhBEafqy9EAPKPh32w": {
    "date": "1/24/2014",
    "text": "Let me start by saying that I dined here during restaurant week.  While their menu is typically outside of my price-range, I had heard several rave reviews and thought it might be a great \"special occassion\" type of restaurant.  As you can tell from the pictures, the interior is formal, yet comfortable.  Bread was brought to our table (basic slices of cold white bread) and our waiter offered \"there's some olive oil on the table if you want it.\"  I guess I was expecting him to pour some on a plate and maybe added some cracked pepper or seasonings.  For my appetizer, I selected the caesar salad.  It was a basic salad, a decent portion size, and overall good.  I was a bit confused when their menu differed from the posted restaurant week menu.  My main dish was the salmon, which was pan seared and served with four small baby carrots and an herbed couscous.  The fish portion was 4oz at most.  The entree was good, but just simply nothing special.  For a fine dining restaurant I expected a more unique selection of entrees, rather than a basic salmon and sides I could have prepared at home.  Finally, for dessert I chose the NY Cheesecake with raspberry coulis.  Dissappointing to say the least - it was good, but again, equivalent to what I would have expected to get in the grocery store and topped with a meager dribble of the raspberry sauce.  Overall it was an average meal.  Restaurant week has potential to draw many new customers into Charlotte's restaurants, yet after this meal, I have no interest in returning and paying an even steeper price tag for a standard meal at Bonterra.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DbTzqWvQhha5PASOpoQs0w"
  },
  "g-2DFyriNODLxMwFRB7nHQ": {
    "date": "2/15/2016",
    "text": "Went for Valentine's day, and was less than pleasantly surprised at the $129/couple fixed menu. I'm all for not wasting food, but we received pretty small portions of every course, which at that price is unacceptable. The medium rare strip I ordered arrived beet red and cool throughout. Although tender, it was barely pushing 7-8oz and came lined with thick gristle on 2 sides. Wine and service were good, but couldn't help feeling ripped off. Will not return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GkH7bvxjSC5w2WodWXfdmA"
  },
  "mcg8kkYFRjCs10CB455rNg": {
    "date": "10/19/2010",
    "text": "Went to Bonterra a few years ago and didn't have the best experience, mainly due to the service. Decided to venture here over the weekend while the in-laws were in town for a birthday dinner. Had a 9pm reservation and we arrived early and sat at the bar. For those who have not been, the wine list is extensive, but what helps set it apart from the rest is the amount of wines by the glass available. So many to choose from and the bartender was knowledgeable. Went with one of my favorite...a Petite Sirah.   We were seated at a nice 4-top and greeted promptly by our attentive waiter. Did not hesitate with recommendations and I went with the Venison Au Poivre, which came with swiss chard and a potato cake and blueberry chutney on the side. The flavor of the peppercorn crust and the blueberry was awesome and went well with my wine. One of the best venison meals I've had in terms of flavor. Oops...before I forget, started with the lobster bisque, while good, was not great. The lobster cake in the middle was a little fishy and the bisque was a little thick for me.   For dessert my father-in-law and I pre-ordered peach souffle's, while the ladies decided to wait for the regular menu. Fast forward to the end of the meal. After the waiter took our plates, we waited and waited and waited for dessert menus and coffee to be offered. Unfortunately, w only saw the waiter again when the souffles came out. At that point my wife asked for the other dessert choices (this is when I mentioned that we had a birthday in the group) and he quickly let her know...they decided not to get them. Still no coffee offered,. For a nice place, I shouldn't have to ask for everything IMO. At the end of the desserts, the waiter brought the bill and wished my mother-in-law a happy birthday. Nice, but a complimentary dessert would have been nice or a removal of one souffle from the bill. I say this because the table next to us had a birthday and a dessert with candle came out.   All in all, 3 stars for me. Waiter was attentive and nice, though the end of the meal made me a little aggravated. The place is beautiful in a big church and the menu is ever-changing. Still, I couldn't help but leave with a \"ok\" feeling. Again, much better than the first time though.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "c8cur4lMkQsHoUEqm-qwxg"
  },
  "9lhnrmdZMCQHLipo7cN27Q": {
    "date": "3/20/2014",
    "text": "Do yourself a favor, don't wait until restaurant week...pony up the buck fifty....get yourself a nice app, bottle of vino, and a few meals. This place is great, from the service to the atmosphere to the food. All around solid place. Skip restaurant week and go and have a nice meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V2Xf66_JNljiA4sK8vnH5w"
  },
  "-QiWqCq-CdRNOYiZIeqf6A": {
    "date": "3/3/2013",
    "text": "I hadn't dined here in years, as it was one of those restaurants I stopped going to during the recession because of their prices. My friend and I decided to treat ourselves this past weekend, but we were both disappointed. I'm a cocktail buff, and the bartender offered Stoli and Absolut as examples of their best vodkas. The bartender did something I consider a cardinal sin: She used Rose's lime juice in my cosmo. The wine list was good. For dinner, I ordered an appetizer version of the fried lobster tail, but found it lacked flavor and was a bit rubbery. The butter beans we had as side dishes were tough and chewy. The service (a waiter named David) was professional and efficient. Bottom line: Bonterra still charges premium prices but doesn't deliver a premium experience. I don't plan to return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "h4ed1egs6b_DW-mMZs0j-A"
  },
  "fNinVJHyB55iQOmKpYe7gg": {
    "date": "9/9/2010",
    "text": "I visited Bonterra on Valentine's Day a year or so ago and was very impressed with my date's choice.   This restaurant is old/classic and upscale. Very mature, prim and proper, and somewhat elitist. However, I have to agree with the review below stating that there were a lot of old folks present. At 24, we were the youngest couple in the building. Most of the patrons had gray hair, but that wasn't a problem. :)   The food was good, but not worth the hefty $200+ bill. The service was satisfactory, as the wait staff was attentive and helpful.   Nice restaurant, but I probably won't visit again... at least not anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yqRU7dBgC9ByIvW6E2uUGw"
  },
  "kNCoHLiiVna9cqUHAwV1hQ": {
    "date": "6/19/2011",
    "text": "You just can't beat the beautiful restaurant. It is located in a quiet section of Dilworth off the main roads in a beautiful old church which also offers outdoor seating for those beautiful milder evenings.  A friend and I met for drinks after work and sat in the bar area. It took awhile to get served since 1 bartender was serving the dining room and the bar (along with taking bar orders for food.) Our server was wonderful once she took our orders and even made a few suggestions for drinks and food. The bar offers a discounted appetizer menu between 5-6:30PM. There was a nice selection so my friend and I decided to make a few choices to get a feel for their food.  The wine came and we were amazed at the choices we were offered by the glass. They don't overstate that they have a great by the glass selection. When our food came I was a little underwhelmed. The Duck Egg Rolls had bone fragments in it. The crab cake was delicious with chucks of crab and little to no filler. I would definitely order this again. The mussels were fantastic. I even had to ask for extra bread so I could soak up the sauce left over. It was YUMMY! The last thing we ordered was the \"infamous\" deep fried lobster tail. We were thoroughly disappointed. The lobster tail had no flavor except for the very light breading which fell off when we tried to cut into it. The sauce really was the only falvor we found and it just wasn't up to all the hype. I would rather have had a good boiled lobster tail with some great butter dipping sauce infused with some herbs.   We did order and share the dessert which was a torte and so well worth it. It was light with a thin layer of cheesecake at the bottom. The raspberry flavor didn't overwhelm but added to the dessert.   Overall I would go back for the happy hour appetizers and drinks but would definitely not get the lobster tail or the duck egg rolls again. I'm not sure it was worth all the money but the discounted bar menu would make it a great place for after work drinks again without paying the full price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqNz_fSAHXEV9z_S8EFivw"
  },
  "zFlMTpDFzQwkNAcMTP_9wA": {
    "date": "1/17/2013",
    "text": "This is suppose to be one of the best restaurants in Charlotte. Sorry, I disagree. If they where they could afford to hire great servers. How many times do u have to ask for a glass of water??? It was Thursday night and only a hand full of people in the place. (Sad). I will say the food was good. The wine list is impressive and priced properly. But the service was horrible. Oh the asparagus was cut and was all stems plus a head. They only served about 2 spoons of cauliflower. Come on people give us enough to taste. Salad was good as was the filet. Won,t be going back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YsNQKQM-TymHllfOLRib0g"
  },
  "xRCH64RCo-IiOF21-9qBNA": {
    "date": "4/19/2015",
    "text": "Normally I love Bonterra, but this time the Filet Mignon was tough. And, the Lamb Rib appetizer was all fat. I've never had a tough filet anywhere before,this was disappointing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1_rtLh8wSRR-Gpugpf72Gw"
  },
  "Pj_vhTdKEakpH4bgvPFERA": {
    "date": "11/23/2015",
    "text": "I really liked this place; The food, the building, the ambiance. I have been twice- one a date night and for Restaurant Week. Both times were excellent. I know people who have booked the upstairs room and the basement wine cellar rooms and thoroughly enjoyed themselves so keep that in mind if you are looking for a place with a group of 10-30 people like a rehearsal dinner, milestone birthday, etc.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LcahV8saJd80ACayce9MLQ"
  },
  "RYZxHXDMTytoVy6p3Ftcrw": {
    "date": "2/15/2013",
    "text": "I went recently during restaurant week and wasn't really that impressed.  The atmosphere is cool, but the food was just ok.  One thing to note if you are considering going during RW is that they do not allow you to swap out sides.  I know a lot of places do that, but I don't understand why if you are willing to exchange it for a different side that is on the RW menu.  Oh well...  I had the pork chop, which was decent.  My girlfriend had chicken, which was good...but tasted like something I could make at home.  I was forced to get a dish with a side I didn't like, due to the reasons stated above.  Needless to say, I would not go and pay regular prices...especially since they are pretty expensive.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nFgdvXE0NfqQodRq1xICaw"
  },
  "xdDF1jXZYLNMk4vzB0wjqA": {
    "date": "2/16/2016",
    "text": "My boyfriend and I went to Bonterra for the first time this past Valentine's Day for dinner.  Bonterra is usually closed on Sundays but was told they open their doors for special holidays.  The downside was that we could only order off of their 4-course prix fixe menu.  For the entrees, I ordered the steak (which was cooked well), and my boyfriend ordered the chicken.  We enjoyed our meal but think we would have enjoyed it more if we were able to order from their regular dinner menu which has a lot more options.  Either way, Bonterra is great for a nicer dinner, and they have a large selection of wine ranging from inexpensive to expensive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z5uw1jgk-B-S4e9Nb8S-XQ"
  },
  "waTVRI7k8bZEKEG0nlHi5A": {
    "date": "10/19/2010",
    "text": "This past experience at Bonterra was, well, surely better than last time but I'm still not a convert to this gorgeous restaurant. To set the scene, hubs and I took my parents here for a late dinner in celebration of my mom's birthday.   The Good: The herb butter for our delicious bread, the amazing and extensive wine selection (especially wine by the glass), the lovely interior (it's an old church renovated into a restaurant).  The Meh: While my mom loved her scallop dish (I ordered the same), I thought it was just ok. The scallops were cooked perfectly but the sweet potato puree was entirely too sweet for my liking and the dish lacked texture. I also tried some of hubs' peach souffle and I didn't taste much peach, only eggy souffle. For the record, I'm not a huge souffle fan, so take that for what it's worth.   The Service: This gets a category of its own. It's traditional paced/slower service which can be just fine. Our server was very polite and friendly and provided some great suggestions in terms of wine and entrees. However, he became a bit absent nearing the end. Yes, we started dinner a bit late at 9 pm, but I expect that great service to continue through the end of my meal. He must have misunderstood us, as the gentlemen at the table pre-ordered their souffles but my mother and I would have liked to order our own desserts. By the time the souffles (and our serve) returned to our table we honestly didn't want to wait to order another round of treats. He also didn't offer us any coffee to finish off our meal. Yes, all these things I could have gotten up from the table and fetched him, but I wasn't in the mood to chase.   So, Bonterra, for me, is just ok. I wasn't blown away by the food or the service but I wasn't super disappointed either.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "u9CbiJaRApFca8IBqKhtXw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States. Scallops!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u9CbiJaRApFca8IBqKhtXw/o.jpg"
      },
      {
        "img_id": "OUxUqU1Kk_W8u7grUOxEZw",
        "caption": "Photo of Bonterra Restaurant &amp; Wine Room - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OUxUqU1Kk_W8u7grUOxEZw/o.jpg"
      }
    ],
    "user_id": "qlC607Cyp0Mj91vDFvkp3Q"
  },
  "a0fT_r2fQhsxu86UF9PelQ": {
    "date": "3/14/2011",
    "text": "Oh Bonterra. I wanted it to be love, but it was just Meh. I had heard good things about it over the years so I was psyched when a Groupon deal came out so I could give it a try.   I was expecting to be blown away by this \"restaurant in a renovated old church.\" In reality, I was underwhelmed! It was so blah inside - cheap looking (outdated booths, all white walls, outdated artwork). Very little ambiance. Loud. Not intimate at all.   Our waiter was so super busy he could barely speak. I expect better service at nice restaurants - tell us specials, ask if we have questions, don't act like they are too busy to spend a second at our table. We had to refill our own water and wine glasses and felt like we waited a long time to order and get the check. If the waiters have too many tables, management needs to take care of that. This is not chilis - it should be about quality not quantity!  The food was good, but it wasn't life-changing. We started with the fried lobster tail since it was supposed to be famous. Just my opinion, but I prefer savory boiled lobster. The frying really stole from the lobster flavor. We each had steaks that were really good, but again, not life changing (I'll stick to Del Frisco's).   We would have stayed for dessert but we waited so long for the check that we just wanted to get outta there. I will say I was happy with the reasonably priced wine list. They had good choices under $30, so at least they offer that.  Too bad, I was really looking forward to this place, but now I know. Luckily we saved a little with a groupon. I would be super disappointed if we hadn't saved anything!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RS5JztShXARj8kDJoDs0-g"
  },
  "HCylLlFZal0jf_Ca2fuyNw": {
    "date": "6/30/2011",
    "text": "I haven't enjoyed a dinner like this in a while. We each ordered separate flights of wine and created our own wine tasting. They have many great wines to choose from. Both the food and service were fantastic.   Oh and its a great singles hot spot for anyone in their 30s - 40s",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oHdCkOf9gHSMhvJd4JbVrA"
  },
  "chFysZcUU2eBHX8gL9d-3g": {
    "date": "7/24/2013",
    "text": "The only time I had set foot in Bonterra was for a rehearsal dinner \"after party\" so I knew the space was beautiful, albeit a bit hoity toity, but I had never had the opportunity to dine there. That's when our good friend Charlotte Queen's Feast comes along, to ensure the peasants can dine like the nobles twice a year.   The service was friendly, prompt and professional. I began with the Salt and Pepper Calamari as my first course. Although I did not detect any Asian spices (as described on the menu), the calamari was very flavorful and crispy.  I enjoyed my first course, however in comparison to my dining companions' first courses, it was at least twice as large. I was worried that my entree would be enormous, so in an effort to conserve my appetite, I only ate about half of it.  For my entree,  I chose the scallops with a low country succotash. I thought the dish was fantastic, only I wish there had been more of it! Two scallops were not enough, especially considering I had only eaten half of my first course.  I chose the molten chocolate cake as my dessert.  It was good, but not extraordinary. I had similar sentiments about the rum raisin bread pudding as well.  Good flavor, just a little dry and lacking a certain oomph.   Overall, I genuinely enjoyed this dining experience and would return. My main critique is that the portion sizes were inconsistent, which I found that to be super distracting!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oz1Tz4LUlLw_UAgEkUiCvw"
  },
  "ZwNTnGu6CluzPSUxx2BUBw": {
    "date": "6/11/2013",
    "text": "I love the fact the restaurant is an old church and is still reminiscent of Its past.  The menu is seasonal and always changing which is nice.  It is pricey though, I had the scallops (3 to be exact) over some overcooked vegetables for $28.  My boyfriend had the bison steak which was very tender served with potato salad for $40.  The appetizer menu was moderately priced compared to the entree items.  We had the pimento cheese with crustini which was very hard and cold.  It would have been better with warm pita wedges.  The wine selection was large and our wonderful waiter Ramsey assisted us in our selection.  I was very pleased with the Riesling he suggested for us.  For dessert we decided on the Bananas Foster which I didn't think would be exceptional but I was mistaken .... It was my favorite part of the meal!  They even make their very own ice cream one pint at a time and the caramel was the best I've ever tasted!  We used a $50 voucher I purchased from Half Off Dept the reason we went.  I would go back for dinner again to see what new menu selections have been added.  It's worth a try for a nice evening on the town ....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UhZWp2oHWLGWZuARHBQtKg"
  },
  "5Qg5qn0DNCBENMxk88EuuQ": {
    "date": "2/4/2013",
    "text": "Bonterra kind of sums up for me what is just so average with Charlotte restaurants... there's just nothing special about this place.  I can't think of any compelling reason why I would want to go back... good 'ol average CLT dining for ya.  So here's my reasons - been here twice, first on a regular occasion and second for restaurant week.  First time I was not thrilled with the food or service.  One dish came out luke warm and neither were all that special.  At one point we had to flag the waiter down to get a refill on the water.  Second time was with a group for restaurant week and we had all sorts of issues... a few dishes way overdone, a few came out cold and it took forever between our apps and entrees, then the bread pudding dessert was just terrible.  I would give that experience 2 stars but since it was rest week I am going to be lenient.  Then there's the wine list... I'm all about wine, and this place is all about wine, so this should be perfect, right?  Sorry to say, but save for the California selections, the rest of the list is mediocre at best.  There are a TON of wines offered by the glass, but most came out as oxidized and were way past their \"drink by\" window.  Had to send one back because it was just awful.  Great concept to offer so many by the glass, but unless you're going through a new bottle every 1-2 days, they will go bad.  My advice, trim down the glass pours and shift the selection mix to not be so overweight California - most of those wines just make your food taste bad unless you eat steak.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rBeLMCroqUSl3a0k3iP84A"
  },
  "MxM3ZE4Ffj_08lMwktDMZQ": {
    "date": "10/7/2013",
    "text": "Visited a few months ago for Restaurant Week in Charlotte. Walkable from my girlfriends house in Dilworth so that was a plus.   Atmosphere was classic and quaint - I mean it's in an old church! Service was amazing as the waiter was spot on for timing and recommendations on what we should order.  Really enjoyed the Pork Belly app - it's small, but worth it! They had an issue with my entree from what I recall it was made wrong. They RAPIDLY solved the problem and had a brand new plate out in less than 3 minutes.  All around a great place to visit if you are in the Dilworth area looking for a fancy meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBnlaFpkCOIhHVe9deuM9Q"
  },
  "TLWvrB48CdVPHIelARtm0g": {
    "date": "7/26/2014",
    "text": "Shame on you!  I have eaten at Bonterra many times and always enjoyed it until  tonight. My wife and I invited  some friends to join us during Resturant Week. They had never tried Bonterra and joined us based on our recommendation.  The food, what there was of it, was good.  The portions were embarrassing!  The salad  was tiny.  The entrees looked more like an appetizers.  Two small slices of meat over a tablespoon of mashed potatoes, a few ounces of salmon over 6 snap peas and a teaspoon of couscous.  The desert was a joke.  A teaspoon of ice cream with 3 small, stale cookies.  The service was terrible. It took two hours to eat this snack and the server never checked on us.  Don't participate in Resturant Week if you are not going to serve a real meal!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2xLmnoHzwbYC3P0lo-pN4A"
  },
  "SB79c9ekz4-jeuukMvNN7Q": {
    "date": "6/24/2012",
    "text": "Was the food good? -Yes it was quite tasty.   Was the space/location convenient and architecturally interesting? -Yes, the space was beautiful, located in a historic church in Dilworth/Southend.   Would I go back? -Probably not... Why? Because, if I am going to drop over $100 for a meal for two, I want to have my socks knocked off & honestly, Bonterra didn't knock mine off. T  he general ambiance of the space, which has oodles of potential, is kind of bland. Our service was no better and no more personable than what you could receive at any chain restaurant in the country.   Our server was nice enough, but he wasn't very attentive and didn't give many menu/wine suggestions.  I wouldn't turn down an offer for someone else to buy me dinner from Bonterra, but I certainly will not be using my own funds to buy dinner here again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_siniUb8CoN9of4mhAtj_g"
  },
  "CKEAB2MBFL4ndQz-uDbyUg": {
    "date": "7/22/2014",
    "text": "Okay. So, yes, I did have high expectations. I waited more than a month to go to this place because of schedule conflict, not because it's restaurant week. It wasn't worth it. IDK. Maybe it's because it's restaurant week. But that's not a good excuse. The interior didn't look much like what it looked like on the internet, the calamari was too cooked, my wife's pasta was almost as hard as twizzlers and the desert was too sweet. I would not recommend this place to anyone.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "44aGjKTAg81bi9NtTqqhQw"
  },
  "D9fG1GJ5yWqRyrewjSRTDg": {
    "date": "7/22/2015",
    "text": "Expected a nice dinner with great service. Instead our party of 4 got below average service.  My steak was not medium rare and was sent back.  Desserts arrived with no utensils set to eat them.  Gentlemen came and cleared table of empty dessert plates and all utensils once again leaving the last 1/2 dessert untouchable.  We later learned this was the owner - no conversation while he was at our table.  I suggest you try another restaurant that appreciates your visit.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iGGP0gxdJ42bDQuiVxXonQ"
  },
  "ppTmTe15ovL95ys_fAix0Q": {
    "date": "4/9/2015",
    "text": "My wife & I were invited to join a group for a Wednesday 1/2 price wine Happy Hour. How pleasing to find that this offer is for the entire day & includes all of their wines. What a selection! The crowd is older, well dressed and friendly. Street parking is available as is valet. We did not dine. Bar seating is grab if you can and the 1/2 deal is for the bar only so be prepared to stand & mingle if you can't score one of the 12/14 very comfortable stools. Light snacks are available for purchase.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d-xImQdoBuylR6KKCZxUOw"
  },
  "U-KoAgwG7MtC3rdwth08NA": {
    "date": "1/27/2012",
    "text": "Don't ask me why but I keep singing Maria Maria with Bonterra in place of the Marias ...weird I know, but I've been doing it ever since we planned to go for Restaurant Week. Anyhoo - My experience started when I pulled in the parking lot. The way they positioned the sign it appeared that half was reserved for valet- wrong. All of it was reserved for valet (I was told not to park there and rarely carry cash) so I turned around and parked in the lot down the street. My friend had the same issue so perhaps they should move their sign.   We received some bread with oil so no delicious herb butter as others mentioned. The bread was not warm nor particularly flavorful so it was just ok nothing special. I ordered the filet but asked if I could swap out the sweet potatoes for literally anything else as I honestly cannot stand sweet potatoes in any form but fries. He just said NO - the chef was strict about that which I suppose is understandable (to be fair no substitutions was written on the menu) but at least offer to ask or heck even pretend to ask. I then just asked if I could have my sweet potato on the side instead in order to avoid that maple mess from touching my beloved steak or broccoli rabe/raab (not said in those exact words mind you!)    I get my steak and  it is served upon the mashed sweet potato and under that was the broccoli. I transferred the steak immediately to my small plate and asked if I could get some fresh broccoli on the side. He said \" oh they shouldn't have done that\" and thought yea they shouldn't have but you're the one who brought it out and served it to me and it is bright orange. Anyway, after speaking up I was happy because I received even more broccoli than previously however I had to eat off my side plate for the duration of the meal. I will say the steak was cooked perfectly (rare girl here) and seasoned nicely with salt and pepper. I tried a bite of short-rib which was spectacular but it was paired with way over cooked gnocchi.   Other dishes I ordered were the pappardelle with rabbit. Quite tasty, although I would have liked a richer sauce. I tried my friends feta croquettes which were good and I also liked the frisee salad (awesome dressing). Another friend ordered the soup which had way under done chick-pea's in it and was not very good.  The desserts we had were good. The consensus at the table was that the praline cheesecake took the prize. The chocolate molten cake was good however the green tea ice cream was my favorite but melted extremely quickly because it was scooped with a melon ball (yes really) and the plate was warm. I initially wanted the rhubarb trifle but it mysteriously was not on the menu nor was it mentioned ....bummer.   The venue itself is very nice- an old restored church. I will say my napkin was ripped to shreds , not what you expect when it's suppose to be fine dining. The napkin was also white and I wore black, but I didn't fault them too much because that's nitpicky. The big issue was that the service was downright cold and distant. I realize it is restaurant week but we had a late reservation and the place was not overly busy, I think our server could have done a much better job.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "l5nyK85KFAvEdGaj07QNog": {
    "date": "8/20/2012",
    "text": "Its not that I didn't like Bonterra...but as another reviewer said- I would take a free dinner here anyday- but if I had to choose i wouldn't be bad. Bonterra isn't terrible but in a city with such a burgeoning food scene Bonterra just can't keep up. Their wine list is impressive and glasses start at $6 so its quite affordable. However, their dinner prices are exorbitant. We started with the calamari and rock shrimp ($12) which was fine- pretty standard. I had a delicious rack of lamb and mint cous cous- which was fabulous but $32. My partner had scallops which came highly recommended - I couldn't sample because sadly I am allergic but he seemed to enjoy his dinner. There just wasn't anything innovative or superior about the menu. Maybe I've just had too many fabulous dinners out in Charlotte.. But then again, what a great problem to have.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XatJ1Tkqw5dw5n7WeWr_FA"
  },
  "w-AK0lctxS7ZiCpjXECAQw": {
    "date": "10/26/2009",
    "text": "We recently visited Bonterra for the first time in many years to attend a wine tasting.  Of course, the wines were all wonderful and the service was very good. The appetizers served included a plate of assorted Charcuterie and Cheese with toasted french bread, Fried Calamari and Rock Shrimp, Crab Cakes, BBQ Duck Spring Rolls, baby ribs  (which I passed on) and for the finish, hand-made Chocolates.   My favorites were the Calamari,  Crab cakes, cheese, and chocolates.    I would definitely recommend Bonterra for a special  dining experience - the ambiance and wine selection is awesome and the chef uses fresh local ingredients which is nice.   If you are not a wine connoisseur, don't be intimidated by the huge selection - the bartender and wait staff can certainly help you find something to suit your palate.    However, dinner can be quite pricey, so be prepared for a bit of a splurge.  If your budget is too tight for a full dinner, this is also an excellent place to go for appetizers and excellent selections of wine by the glass... or stop in after dinner for dessert and drinks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "XOrtnxYn3bh0q5REkwZRFA": {
    "date": "7/23/2015",
    "text": "My absolute favorite place to enjoy a great glass of wine. Amazing service. Very knowledgable bar tenders and servers. I highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hJ1HXZZRd85Q33nHwI1MfQ"
  }
}