{
  "QfXFcEyUIfbwXlpxXHVk1w": {
    "date": "10/28/2014",
    "text": "This place is my fave. Always go here with my mom when we need to shop at Super G Mart. I usually order the thai boba tea since it's my favorite drink to get there. What I like most about the place is how they have such a huge selection of beverages. I think one time my mom tried out thai tea with STRAWBERRY BOBA and I had nooo idea that existed. Now, that drink is her favorite. The people working there are friendly as well.   I have tried the food there. I ordered the um. something something red bean paste noodles(???not sure of the name). In the picture it has carrots and cucumbers. It was my first time trying something like that, and omg . yo. just thinking about it makes my mouth water.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IffhK3RuMrv2qBJLsCswPg"
  },
  "Eh95VJG5t3KXeG6HQ10auw": {
    "date": "8/7/2015",
    "text": "In the back of the Super G grocery. The check out lady Vanessa(I hope I got her name right) was very helpful in helping me pick out the veggie, BBQ, and Kimchi BBq buns. I also got the shrimp dumplings and the green apple green tea. All for under $11 For anyone who has been to Chinatown NYC for some dim sum this is right on par. I am not a huge fan of the buns but only because it is a lot of bread. She warned me about the paper on the bottom so that was not a problem. The Kimchi bun she recommended and it was my fave. Next time I am getting a sandwich they looked great too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "BnTHzlmPgpds0ElThgrUgQ"
  },
  "n4-eRIMjdDJbeEGYEBtgLQ": {
    "date": "7/1/2013",
    "text": "I often stop by this place when I'm shopping at the Super G Market.  I usually get the Vientnamese pork bun which is my favorite.  It is 100x better than the ones over at Century Market (Asian Corner).  Now, they finally accept debit/credit cards.  Prices have increased unfortunately.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NB6wPq86V2l4k9e4yht5rw"
  },
  "nJPCz6DUBFXzLM-8iicjkA": {
    "date": "8/28/2013",
    "text": "I love that there's an authentic shop to pick up freshly steamed buns and treats in Charlotte! My son and I love to explore the many aisles of Super G mart, in search of new noodles, seasonings and other food items to try. And we always stop at Honey Buns for a BBQ bun and thai tea. Many filling options, but my favorite is the BBQ pork. I am excited to buy some to serve my parents next time they're in town!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "swUxTfJ96XZJ0ufmljJiXQ"
  },
  "TnJZ1x64eAAxRTyAhi5slA": {
    "date": "2/28/2013",
    "text": "Best dim sum cart alternative in town. Sticky rice, shrimp balls, won ton soup, and bbq steamed buns are bangin'.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "fvj9dV4e6Fu5T5tM98dCVQ"
  },
  "R3X0zDzMV911CPV1faCK4w": {
    "date": "6/15/2012",
    "text": "Was waiting for this place to finally open inside the super G mart international market on independence.  Being an expert of these delish buns and the steamed appetizers shi mu, and shrimp dumplings.  being asian american.  I had the barbcue pork bun and the shrimp dumplings.  they were so Delish ! Fresh ! on the small side.  but still good.  cash only.  price from $ 1 to 2.75.  I m a fan ! will have to try the sweet rice next.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ZW-XoteNlRuuK-19q1spmw"
  },
  "eXEmtlyufBRE2IPL_pVDCA": {
    "date": "7/8/2017",
    "text": "The food is good enough to be called Asian fast food.  It's very disappointing when an eatery displays menu items and not make them, hence one less star.  The service is also kind of slow.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-ZAACaiYtfN64y2z3IYLA"
  },
  "PTIsO09p4vJ0xLBbklp6tw": {
    "date": "7/11/2017",
    "text": "I just can't get enough of Honey Bun's because the food is very delicious and mouth watering just by looking at the pictures that are hanging on the glass wall. I love their BBQ pork bun along with the shrimp dumplings (there's a deal of 4 for $2.75) on them. I really love their lychee slushie and you can really taste the lychee flavor. Their Thai tea is also good as well. I've also tried their Taiwan braised noodle dish and it is absolutely delicious, great portion given in my opinion. Their shrimp and wonton noodle dish is really good as well. They should definitely expand and have another location closer to uptown or in NoDa or Plaxa Midwood (only cause I live nearby hehe). The manager, Sallie, is absolutely wonderful, she checks to make sure you received your order and that everything went well for your visit. Great service. Wish the seating area was a bit bigger but it's out of their control. This place never disappoints!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "SQGpQ03D2JjsmelZvb7lAg"
  },
  "-1e8T7rGw7dcEJYCAx_98g": {
    "date": "1/28/2013",
    "text": "Quick note: CASH ONLY  Located in the back right of Super G (kind of a food court-esque set up) and next to a Korean place. Tons of people partaking in the grub from this place, which is always a good sign.   Passed by whilst shopping for some other items and saw they had some seasonal veggie steamed buns and dim sum. Take a look at my photos, but the sight of those steamer baskets drew me in. I knew I didn't stand a chance of walking by without sampling the fare. Luckily, I had some cash as they only accept cash at the register. However, it's super cheap. I grabbed some sticky rice dim sum and two veggie steamed buns for less than $5. Such an awesome snack to have while shopping.   They had tons of other options -- pork buns, shrimp, etc. I'm sure they are amazing, and if the veggie options were any testament to the rest of the menu, I'm sure you won't be disappointed. Next time you find yourself at Super G, be sure to stop by.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "lTi-ELQDABFxJdm_uNOGmg",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Glutinous Rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lTi-ELQDABFxJdm_uNOGmg/o.jpg"
      },
      {
        "img_id": "5oauevTl-FNlvCBSOwrlAA",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Veggie Bun",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5oauevTl-FNlvCBSOwrlAA/o.jpg"
      },
      {
        "img_id": "3880dzPqSdTmh4ZQXmfUTg",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3880dzPqSdTmh4ZQXmfUTg/o.jpg"
      }
    ],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "IkMKwAdHECzDNDICpq2ttQ": {
    "date": "8/2/2017",
    "text": "I originally wanted to eat at Korean Restaurant, but they were closed for 30 minutes so I grabbed a veggie and red bean bun. I had never tried these types of buns before and was pleasantly surprised by how delicious they were! They are also super convenient to eat in the middle of shopping. I can't wait to go back and try something new next time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YXWsUo7I6YRZHf0W8batSA"
  },
  "l64WTEW_4PyyP37UNJ3WEA": {
    "date": "9/19/2013",
    "text": "Not the best bun I have in other place.  The xiao-long pork bun is a huge disappointment!!!! The bun is so dried, I supposed to have juice dripping out.   The sweet rice dim sum taste like it's ordered from supply store.  Over all I would go back for the drinks",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Wh808ZyxTdl-b7B7rfAtog",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. The store front",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Wh808ZyxTdl-b7B7rfAtog/o.jpg"
      },
      {
        "img_id": "QOCn92LOfaRU9d-KfqIu9Q",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Xiaolong pork bun",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QOCn92LOfaRU9d-KfqIu9Q/o.jpg"
      },
      {
        "img_id": "GuPL0op-avB1VpXD9spcHw",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Thai ice tea",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GuPL0op-avB1VpXD9spcHw/o.jpg"
      }
    ],
    "user_id": "sUh8f9Ez1h6tSINztKG0lA"
  },
  "h2ESSpwXbmRer7v8XDzpMg": {
    "date": "10/18/2014",
    "text": "What a classy, hotel-ish restaurant with a plethora of payment options and grand decor.   Jk. Cash only and half melted tables.    But still, the buns and milk-tea fusion bubble teas are pretty good and worth getting - namely the BBQ pork or red bean buns.  This place is a good, cheap pit-stop for when you get hungry while grocery shopping!",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KTgCN7nb-Dmnyma9quy4mw"
  },
  "yrohUScXDM4azrDqhVFdpA": {
    "date": "8/28/2016",
    "text": "Love the banh mi sandwiches and how cheap they are! The house fried rice and the Beijing noodles are also delicious, as well as the buns and sticky rice. You can't go wrong with any of the food here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JYUVcr1_mriyo9DQMo0DhQ"
  },
  "ZQgNqqtHIJyeXf9IICpe4w": {
    "date": "11/21/2016",
    "text": "Top notch buns. Every time I go to super g I stop by here for the vietnamese pork bun. Sometimes I specifically buy groceries here just so I can get a bun lol. Place is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LufACxS8RUPyVmai_pdcxA"
  },
  "qRwYzGX-I17tXKTNje6kng": {
    "date": "8/29/2016",
    "text": "Literally one of our go-to places for a light snack (all the steamed buns have been great, and the bahn mi was delicious), a frequent for \"takeout Chinese\"dinner too, and the absolute BEST bubble tea/smoothies we've found in Charlotte! Only downside is it can take a while sometimes if it's crowded, so if your in a hurry I recommend calling ahead. Or if you're not in a hurry, then use the time to browse all the amazing selection of Asian/Hispanic/European groceries they carry at Super G Mart.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qRfMtCMCzdJ28wzc6wJCcQ"
  },
  "G2oXqEhfBhfXk_Px1pWHHA": {
    "date": "1/3/2016",
    "text": "I have been going to this place since they opened. They have wonderful food and their buns are a quick snack when walking around the store shopping. I always go to then when I'm in Super G.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "1pbnrEYKJIPVU5V5p8WBHQ"
  },
  "sdpuAsKygqYZ2x7WH6JP3A": {
    "date": "2/21/2016",
    "text": "I made my order at 1 30 pm and waited for 40 minutes and still not ready and I went up to ask why it's taking so long and they were like we had no idea , turned out they forgot to make it, wow, never in my life have I seen such blatantly bad service and they didn't feel a little bit sorry about it.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JstLo8g345jCgRLWSvMEPg"
  },
  "Bk0LI3fLwjJDDgpsos7Huw": {
    "date": "4/2/2013",
    "text": "If you find yourself on Independence @ Village Lake you might as well  pull into the SuperGs parking lot and for a couple of bucks find out what the noise is about.   I've eaten at honey buns a half a dozen times and the buns were always freshly steamed in bamboo baskets - they had to fight with the city to be able to use those, the health dept was demanding stainless vats instead.   Now, not all buns are equally tasty. I found the Korean to be bland, the Americanized BBQ pork tastes like any crappy BBQ because it's made with the same catsup based BBQ sauce. To me the Korean bun is surprisingly bland and the Chinese buntastes just like a dumpling, good but mild.   The Vietnamese Bun with egg and sausage is their tastiest bun, the Kimchi bun is also fun and make sure to try the Pearl rice balls and to as for hot sauce to sprinkle one everything.  You can literally pig out for 5 bucks (cash only).   Then you can walk to the next counter and for another $6-8 get a Korean dinner to take .... a Blade Runner experience all the way.   Fun, cheap not recommended for the hygiene neurotics.  note: closed on Mondays",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZvmC522FAwxt8qT1jxqliw"
  },
  "_pHiUGjy95T2CK0SwaxH_Q": {
    "date": "9/17/2012",
    "text": "This is the kind of place that you're not sure you want to review. On the one hand, you want everyone to know how awesome and delicious they are. But on the other, you don't want every douche-bag out there flocking and ruining the damned place for you.  Super G, some love it, some hate it. I happen to love it and don't mind the stench (which is pretty strong and offensive, think seafood). Nestled inside Super G there lies a little piece of incredible awesomeness; Honey Buns dumplings.  Honey Bun, next to an awesome Korean restaurant, is in the back of the store in a public seating area. Behind the plain counter there are rows of bamboo steamers full of a wide variety of dumplings and fillings. I've had nearly all of them by now and they all taste delicious.  I strongly recommend the taro ones (sweet), the BBQ pork and the shrimp ones. They are very, very, very afforadable and filling. They average $1.25 and never go over a couple of bucks each. Two or three and you're good to go for lunch.  One of the coolest deals is that you can get six plain, whole wheat and brown sugar dumplings for $3.50. These things are each the size of a grow man's fist and taste incredible on their own.   BUT, if you wanna make it something special, take them home, make some glaze (<a href=\"/redir?url=http%3A%2F%2Fwww.cooks.com%2Frec%2Fview%2F0%2C174%2C158183-255192%2C00.html&s=43f71a18a74669879147eaee03ac1ce70ecf99b1a2a9437ac458acd172872e4e\" target=\"_blank\" rel=\"nofollow\">cooks.com/rec/view/0,174...</a> ), and spread it over your dumplings, springle some brown sugar and cinnamon on top and stick in the over at a low temperature until it all marries together in a gooey mess, cool and enjoy!  One last thing, leave your yuppie plastic at home, Honey Buns (like the girls off Wilkinson with the same name), only takes cash.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "s7XIFcwZnhEUMzSZ4EiAHA"
  },
  "k1RvnZSqwOhoG7MbG-wsFQ": {
    "date": "8/2/2015",
    "text": "After reading Yelp reviews I showed up with my debit card. My wife and myself wanted boba tea. Total came up to be $8 . Too bad they have a $10 minimum charge on the card.  Wtf Honey Buns. This is 2015. Why are people still doing this? My wife made me order more stuff to get to $10 but they have lost me as a customer forever. And we drink a lot of boba tea.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ixp2yUjPsDqaLCinyE1Yew"
  },
  "Z4B_NI-PKD32QIV9qwNT_A": {
    "date": "6/17/2015",
    "text": "I always get the shrimp dumplings or Vietnamese pork buns! Can't go wrong with those but the bubble tea is not consistent. Sometimes overbearingly sweet and whenever I feel daring and try a flavor out of my comfort zone, I regret it. Try the royal milk tea half sweet.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dZ5kZgryiwS6h3LE2-TtqA"
  },
  "FYdLv25J-Z5JP5O22mfOdA": {
    "date": "8/7/2014",
    "text": "I ate here many times, but today I noticed that they always over charge me. Tax for restaurants here in Charlotte is 7.25%, here at honey buns  always charge me 10% tax. Btw you Guys only take cash only! So.....I don't even know if you guys pay your taxes!   Another time I brought some buns here, ate it the next day and got really sick! Try not to sell people your left over from week before. I hope health inspection can come and check your place out.  Never returns and never recommended to anyone again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "-Z7qT8zAczflAlu8TonYGg"
  },
  "bKGwEnEgj5X84mGh0c3B-A": {
    "date": "6/1/2012",
    "text": "Wow! Wow! Although I really hate shopping at Super G's because of the smell, the only think that keeps me shopping is Honey Bun's!!!! These Buns are amazing! Fluffy and light! These things blow my mind away. I love the vegetarian one best... I've tried the pork, meh, shrimp, meh, BUT the vegetarian is the BOMB!   Everyone is super nice... A bit stingy with the sauce, but if you ask, they will give you more.   If you can get over the smell of the market, get yourself a soda and mosey on over the cafeteria section and gets some buns! Cash only.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "oWxy_YR6n2w8e9L00hxhPw"
  },
  "By-HlzGulqtZrcXv4XolKQ": {
    "date": "5/8/2015",
    "text": "Fast service and great big buns. Wonderful texture and flavor, a bit skimpy on some of the fillings. The wonton noodle soup was delicious and filling",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zPrnD3FdU7zouX0JhJgOrg"
  },
  "mdfR0NElyKbNkfUZqJcUlQ": {
    "date": "3/22/2015",
    "text": "This place is awesome. I stop by every chance I get. I love the bbq pork bun and the siopao reminds me of moms. The prices are good compared to the ones in the frozen food section you more for your money, and they are FRESH!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I8Qr3pjyXIoKDkLy1qYThQ"
  },
  "QR8E6wCI7Td57eDnQE1BYQ": {
    "date": "11/3/2014",
    "text": "delicious variety of buns! and so many types of teas (bubble, milk, taro). among the buns, I love the red bean bun, teriyaki chicken bun, and bbq pork bun. They also have really good beef noodle soup and their shrimp fried rice! Very nice people too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qSOZ3rgIWYSmf2kkeooh6A"
  },
  "hxBt4gCsh_qVWNU5hSCMNA": {
    "date": "12/8/2017",
    "text": "A small corner eatery in this huge Asian grocer. I am truly impressed. I missed some of these dishes. Like the wonton soup with noodles. That was a treat for the family to drive to Chicago from Milwaukee to have something like that. Now I don't have to drive 90mins for some. They also a small varies of Dim Sum dishes. Yet they offer enough choices to please everybody's craving. From banh mi, Bakery, bubble teas, dumplings, and steamed buns. I finally have a chance to visit which I'm happy i did!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "3MDK5mBrVQC3-1E-BfZcsg",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3MDK5mBrVQC3-1E-BfZcsg/o.jpg"
      }
    ],
    "user_id": "jcURiDqCLY7AOqo8KClJnQ"
  },
  "ikfrj8yVYQgDwryGGNQTzw": {
    "date": "7/22/2018",
    "text": "No witty comments here...What a great find. I watched them make fresh buns while waiting on my noodles. Ate the buns while watching buns being made. Ate more buns while eating my wife's chicken fried rice. Ate another bun. Shared a table with a nice family. It was very busy but the people running the place kept things moving along. Fantastic value, super fresh, and the market a foodie paradise. Felt like a Sunday in Vancouver. It is all about the food, period. Also had a hot pot and it was really good. Deeply satisfying.  If they served craft beer it would be overrun by hipsters. Please don't serve craft beer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N61YD78Yq6nQEq7fv6mFgA"
  },
  "JGtHUiqhc5S1Oc1iXsEThA": {
    "date": "4/28/2019",
    "text": "Love honey buns! Great deal. You are in the super G so you don't come for the super nice atmosphere, But it has its charm. Lots of different kinds of buns. The dough is fluffy and the filling savory.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cinu04Hv3x7OHxHqYCGE6Q"
  },
  "zcoxrxIgUn3-1bjjxkGmsw": {
    "date": "10/7/2017",
    "text": "Our go to spot for snacks that turn into meals! Dim sum items that I have yet to find a good restaurant in the CLT area. If anyone has suggestions/spot please do let me know.   Great food and boba teas too! They do have banh mi sandwiches.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wcTg054UYener5u00Su_iQ",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wcTg054UYener5u00Su_iQ/o.jpg"
      },
      {
        "img_id": "gCkZj3zl1cE7anCBOEe08g",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Purple-ish ones are taro",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gCkZj3zl1cE7anCBOEe08g/o.jpg"
      },
      {
        "img_id": "e5BJr9Xdcd9OX8a5ecutPQ",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Buns on buns on buns!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e5BJr9Xdcd9OX8a5ecutPQ/o.jpg"
      }
    ],
    "user_id": "v5foKzst8IUVIx_oBi7jxA"
  },
  "1_mXJm1uoB3RvW5vANuwmw": {
    "date": "1/20/2019",
    "text": "Absolutely my favorite place to eat. The buns are delicious and the service is fast. I highly recommend the taro and custard bun. The chicken fried rice is also very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3fscTz406wwG5oEHvwGHBw"
  },
  "tBGMIz6JErrnlVXU_-l6zg": {
    "date": "9/22/2018",
    "text": "Pork shumai, shrimp dumplings (ha gao), bbq pork buns, and custard buns!  We grabbed this mini dim sum meal to go.  The shumai is a packed, meaty bite of savoriness.  The shrimp was well seasoned and springy fresh.  The buns are the highlight of the dish though.  The bun is soft, fluffy, slightly sweet, and just firm enough to hold.  The bbq pork filling is marinated very well, salty, sweet, and meaty.  The custard bun is sweet, creamy, and has a light milky taste.  The soft creamy texture goes great with the warm, airy bun.  We also grabbed the combination banh mi sandwich.   Loaded with pickled carrots and radish, which is a little thicker cut and retains that crisp crunch.  The pickled vegetables are both sweet and sour.  A great complement to the seasoned meat, pate, and topped off with cilantro and jalepeno.  A very pleasant meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aM8RjyXJiIsiVjegubit3w"
  },
  "L1GzukBprsgce5TsCVrwCQ": {
    "date": "7/27/2018",
    "text": "Excellent food and tea - hard to find then we realized it was inside the grocery store.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4bI5HTfy1W2OnzBk2whlNA"
  },
  "mN8sK3j9ch0q0gFcGAj9SQ": {
    "date": "3/29/2017",
    "text": "Our to go spot if we're wanting banh mi and buns. They also have teas and smoothies. It's even more convenient to be located inside Super G's grocery store.    We've tried both of the beef soup and the wonton noodle soup. Wonton noodles are pretty simplistic with bok choy. It's my favorite.   We usually get the drinks (Thai tea is the top best. Matcha green tea is my regular) banh mi (combination) sandwich and for buns, I love the Vietnamese pork (brings back childhood memories) kimchi bun and for a little bit of sweetness, I like the red bean bun.   The prices are pretty good and great if you're wanting a quick lunch.   All the employees are courteous and patience while you decide on what to order. They are also willing to explain item menus.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3GM5ZSvc3aglZ4eAArQHLw",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Red bean bun and Thai tea. Great combo together for dessert treat.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3GM5ZSvc3aglZ4eAArQHLw/o.jpg"
      },
      {
        "img_id": "jYzMSEwTu6wKuGZSuDgRGw",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Our usual order. Combo banh mi (non-toasted) Vietnamese pork bun (bun bao) BBQ buns and bed bean bun.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jYzMSEwTu6wKuGZSuDgRGw/o.jpg"
      },
      {
        "img_id": "JC_I9Y9ZC8IAlo4Kmk7GXQ",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Thai tea",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JC_I9Y9ZC8IAlo4Kmk7GXQ/o.jpg"
      }
    ],
    "user_id": "x53Dwd0eSh8wuqCI7_fVLQ"
  },
  "i0-FQWL3faWVz8QaBPLs_w": {
    "date": "7/4/2015",
    "text": "Wow I was pleasantly surprised by Honey Bun after walking into Super g mart today! And btw, honey bun accepts credit/debit cards now, yay! I suck at carrying cash.   Anywho, we ordered a teriyaki chicken bun, chicken fried rice and a lavender boba tea. Everything was great! The $1.65 bun was huge and fresh with great flavor. The rice $7.99 was literally the best fried rice I have ever had! The veggies were fresh and crisp while the rice was just perfect. It was a huge portion as well. The $3.25 lavender boba was also the best, it wasn't too over powering and didn't have any weird food coloring in it. It was an additional 75 cents for the boba but so worth it.   We will be returning for sure!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "foGvoiglOAqcfMqQFwofHQ",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/foGvoiglOAqcfMqQFwofHQ/o.jpg"
      },
      {
        "img_id": "V73h6cLXRITxOrTJBy3eBw",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V73h6cLXRITxOrTJBy3eBw/o.jpg"
      },
      {
        "img_id": "kVPU233oTs97UkU682QNJA",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Chicken fried rice!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kVPU233oTs97UkU682QNJA/o.jpg"
      }
    ],
    "user_id": "C5QsUsQg5I3dMdLM02SXGA"
  },
  "16LF9TMUfEAN8PskP6VyDA": {
    "date": "2/6/2017",
    "text": "LOVE THIS PLACE!! Best banh bao in Charlotte, although the place is quite small don't let that fool you(; I always get their Taro, Red bean or veggie bun. Taro is my favorite!! I've been here for years and they're keep getting busier and busier(which is good) I also like how beautiful & fluffy their banh bao looks, it doesn't look lumpy or soggy like some of the others I've had. I've also tried their boba, it's pretty good but the banh bao is definitely why I come here.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 11,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "0Hs-klEc07HZoRdC9ASwiw",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Taro bun (-;",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0Hs-klEc07HZoRdC9ASwiw/o.jpg"
      }
    ],
    "user_id": "RpYeOtqujjc1ce3gYB_4vw"
  },
  "ImEshya1YjCgqyuUNa7EtQ": {
    "date": "9/11/2016",
    "text": "To wait or not to wait that is the question! Well today it wasn't. I gladly waited in the line to get some of the delicious Banh Bao Buns and Strawberry Banana smoothie with all the fruit Jellies. The wait was about 20 minutes but this allowed me to watch the new video they display of all their menu items even the drink items with the prices. I was mesmerized. I'm glad they have the video cause now I have to return and try some of the other dishes like the Taiwanese noodle soup and the fried rice. I was at Super G the day before at opening  (8am)to grab a few items for the Vietnamese dinner I was making but the Bun shop was not open. I was a little heartbroken because I made sure I had cash and was really looking forward to the some buns for lunch.  To be honest I really appreciated that the girl at the cash register gave me the large cup with my small order cause it was a lot of jellies for the small cup.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EzLW2R30gNzSMe9eR4F8_Q",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Mango peach smoothie with all the jellies",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EzLW2R30gNzSMe9eR4F8_Q/o.jpg"
      },
      {
        "img_id": "PMeUMDFWIPT7OxSBZGMR6g",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Vietnamese Banh Bao",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PMeUMDFWIPT7OxSBZGMR6g/o.jpg"
      }
    ],
    "user_id": "12iozmUYN_gvAng9kMLs_w"
  },
  "E6xIBwnvwCuWYYr23G6KZw": {
    "date": "7/1/2017",
    "text": "The food is quick and delicious!   Here is what we bought buns from Honey Buns. They were the following buns 1. Taro Bun 2. BBQ Bun 3. Korean Bun (This is one was our least favorite).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JlTEv3ZAHTCDvt94fOjWOQ"
  },
  "IeHgqLYH8e6GhdqO5_lZNQ": {
    "date": "2/11/2018",
    "text": "I had a few different buns here today and they were all very very yummy. The red bean bun kind of tastes like Nutella to me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mp1hvAy2OeRzhAV9_FH8Fg"
  },
  "prmqN0tY1oZmXm3t9h3ZuA": {
    "date": "11/4/2017",
    "text": "Very good surprise inside of a grocery store. The buns are pretty good, the banh mi sandwiches are average..too much carrots and not enough meat. They have boba tea which is pretty good. I haven't tried any other dishes yet though. Pricing is a little high for being inside a grocery store.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eyF70xMaM-JmKsxB84RhHw"
  },
  "W8W3EpeoGzP6fMFuD2bbrg": {
    "date": "11/22/2017",
    "text": "This is real Chinese food. Absolutely fantastic and authentic. Some of the best wonton soup I have outside of China!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3bapa5zuGQOsFipcgLPDjQ"
  },
  "9YLsBPDlBc5dYUnLvd71VQ": {
    "date": "5/4/2018",
    "text": "my bun boy pal and i go here semi-frequently just to stuff ourselves with buns and sometimes some tea. i'm loyal to the custard bun but bun boy always gets the red bean; it's a constant argument over which is better but it's definitely the custard",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TrmmO2zn0tny4KPNJI7IQ"
  },
  "dmAOWi--tgI2bilcJS9WoA": {
    "date": "6/8/2016",
    "text": "I don't know who Honey Bun is but I love their buns and boba! They now accept credit cards with purchases $10 or over. I highly recommend the Spicy Kimchi Bun and any boba milk tea or smoothie.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PVyZXgOkVtnU6966FDFhuw"
  },
  "C_o-qGsoinH7gFGjvkUqHQ": {
    "date": "10/9/2016",
    "text": "Great place to Sunday- do some grocery shopping and get some \"dim sum\". Their shrimp dumplings are not the best in texture but taste wise- theyre the ticket. Make sure you get some of their red hot chili oil on it too. They have your asian drinks too. I get the Kumquat Green Tea- its also the ticket!  On the other hand- their veggie bun and their sweet rice dim sum kinda tastes like cadaver so I would avoid those on my next go around.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_E5AHEgUYewV_dj6ZtlVkw"
  },
  "ZADvE3LofDhmIIQOxfhHFg": {
    "date": "3/11/2018",
    "text": "This is a cafeteria-style Asian fusion stand, located inside an Asian supermarket (the Super G Mart). It is next door to a good Korean stand and to an Asian bakery. Honey Buns does dim sum style dishes, mostly pork buns (and variations on same), but also some soups, fried rice, dumplings (limited quantities particularly on weekends), bahn mi, and some sticky rice dishes (most always sold out). The food is good, quick, and cheap. Get your meal, grab any open spot at a table, and chow down.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1daXf5ODG7GuW4wAcR4ojA"
  },
  "IT1HkdcAi1iXzIdvoBVAeQ": {
    "date": "10/14/2014",
    "text": "Not too many other options in town to get fresh made buns.  Most of them have very little filling, but they're still a great deal for only about a buck.  Good, but not great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wnFWoQ63F9-ohUQ-C0AeIw"
  },
  "uuYNDI82SUV5Af4Gc50Zyg": {
    "date": "7/3/2019",
    "text": "I love coming here for their red bean buns and custard buns! Definitely one my favorite places! Always a great place to get food after shopping around Super G Mart",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1ti4AqIzmqs91IgksKBWsg"
  },
  "R3s6GFwmvAIxGyj4Js2weA": {
    "date": "3/19/2019",
    "text": "So I came here because I love trying different bakeries, especially Asian ones. I was really craving an egg tart and I hoped to find one here. They have a lot of different items at the bakery and then there's a dumpling shop and Korean food stall next to it. Everything I got was okay (3 egg tarts, 1 curry puff, 1 red sesame ball and a Thai Tea). Not great but it helped satisfy my craving.   I really liked the variety and I would definitely come back to try the other food stalls. Plus, it's awesome that is in an international market so you can shop for diverse foods when you're done eating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "V44fle_19J5kGsFl1aBdEg"
  },
  "caHdpYQQ9smmXPF2MTSEIQ": {
    "date": "7/10/2019",
    "text": "This place has a great variety of affordable Asian food. It is located within the Super G market. You're not supposed to bring your shopping carts into the dining area, so eat before you shop, or just be prepared to leave your shopping cart parked at the entrance. They serve noodle soups, buns, banh mi, boba tea, dumplings, and fried rice. I do think that the buns are overpriced considering the small size of them, but otherwise, you can sample a lot of food without paying a fortune. I had the Shrimp and Pork Wonton Noodle Soup ($7.50). The noodles are delicious, and they give you plenty of dumplings. However, they hardly include any choy. I barely had a full bulb. Boyfriend had the BBQ Pork Sandwich/Banh mi ($4.49). It was a small sandwich, but the bread was nice and crispy and the carrot and radish were nicely pickled. The meat was good too. The BBQ Pork Bun is priced at $1.25 each. Don't be fooled by the photos, most of the buns are priced EACH - you will not receive four buns (as pictured), which we did not realize because we were trying to be quick with ordering since we had arrived close to closing (they were turning customers away at 8pm and telling them that the kitchen was closed). As a result, we were disappointed to receive only one bun, but it was still tasty. Milk Teas and smoothies are mostly $3.50 each (16oz), plus an extra 50 cents if you want to add boba. The drinks are delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "URWpOVK9fAmpQvntMa9LOQ"
  },
  "t_bXvgxdCUJZ1ccpihVBAQ": {
    "date": "11/18/2018",
    "text": "This place is tucked in the corner inside of G Mart, a Korean grocery chain. The food here is great! The drinks are even better. There's a large variety of both. The lines are always long here but they get you in and out pretty quickly. I love that they have pictures of menu items so you can see what you're getting, for those who aren't familiar with Asian food.   The restaurant is pretty broad. There's Taiwanese beef noodle soup, Vietnamese banh mi and buns, Korean buns and Chinese dumplings - some are Hong Kong inspired. I always stop by for a variety of buns and drinks to take home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "41n-o3Pd-jiJHDfOL35PLA",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/41n-o3Pd-jiJHDfOL35PLA/o.jpg"
      },
      {
        "img_id": "m8rg1Jv0Xyqt58oncQVjVQ",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m8rg1Jv0Xyqt58oncQVjVQ/o.jpg"
      },
      {
        "img_id": "kcdkwpOeU3jDGFk2jShS9w",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kcdkwpOeU3jDGFk2jShS9w/o.jpg"
      }
    ],
    "user_id": "-Anyb0vB5LrW273whytNRw"
  },
  "tq-EvOug8aqL8k74GRKaCw": {
    "date": "11/10/2018",
    "text": "This place is awesome. There's always a line but it goes by fast. The hard part is waiting for the yummy buns and your boba drink. My preference is the Vietnamese buns. It's a nice big bun with some pork, veggie and egg inside. Steamed perfectly. The shrimp dumpling is really good too and they usually sell out fast so I was lucky enough to get some this trip. I thought it was 6 shrimp Dumplings to an order but I guess it's only 4 now. Their Thai tea doesn't taste like the powder Thai tea so that's a good thing. In the beginning they only took cash but now they take card as well, with a minimum amount of course.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jmh2SoNxINhjcb8VmBJQSw",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jmh2SoNxINhjcb8VmBJQSw/o.jpg"
      },
      {
        "img_id": "mUdNzTMV3iXV4SNYm3jS1g",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mUdNzTMV3iXV4SNYm3jS1g/o.jpg"
      },
      {
        "img_id": "Tu6Jeyy6RpoPLoaG3gI0xw",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Tu6Jeyy6RpoPLoaG3gI0xw/o.jpg"
      }
    ],
    "user_id": "uGrZg9TypPdVnDgwp82VfA"
  },
  "CaA_ExwlsInpJ8pastRSCw": {
    "date": "4/15/2019",
    "text": "I was thirsty and had wanted a boba drink or tea with chopped fruit the other day but wasn't sure where to go close by.  I decided to go to the honey buns cafeteria and try theirs out.  There's a big drink selection but got the coconut milk tea with boba.  Seems all these milk teas taste like chocolate milk no matter what flavor I pick.  The drink was fine.  I got the bbq pork sandwich.  It didn't look that appetizing and neither the smell.  I think there was more mayo than expected.  I didn't care for my sandwich at all.  Next time I'll get the wonton soup.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uqBa-AegWpeaOYqjklrtjg",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. BBQ Pork sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uqBa-AegWpeaOYqjklrtjg/o.jpg"
      },
      {
        "img_id": "7deWEnrX1sWO1jlsSe5_LA",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Coconut milk tea with boba",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7deWEnrX1sWO1jlsSe5_LA/o.jpg"
      },
      {
        "img_id": "FGiALAfuZFVcjPKRumvq-w",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Drinks galore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FGiALAfuZFVcjPKRumvq-w/o.jpg"
      }
    ],
    "user_id": "DaUJvHMmKoDDT3vB_ltJ6g"
  },
  "MeEdfGXfTfQDV3bK65HS9g": {
    "date": "6/15/2019",
    "text": "The Taro bun was nasty. I wouldn't eat that again. The bun had absolutely no flavor. The filling tasted like a slightly sweet nothing lol the customer service sucked. Prices were reasonable. I would not return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1KDqkfayyr6yCQpIdyTXWA",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Taro Bun",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1KDqkfayyr6yCQpIdyTXWA/o.jpg"
      }
    ],
    "user_id": "Iex5VpXE2i6hIaXZX2gujg"
  },
  "vpn4uBIV1Cp19QNAd0ZL9w": {
    "date": "5/23/2018",
    "text": "Not the place to buy obnoxious military vehicles that represent the worst qualities of Americans. That's HUM-V Buns Cafeteria.  Named after my porn star girlfriend, this is one of the better places to get Boba in North Carolina.  Honey Buns is a wonderful little spot inside the International Food Court in Charlotte which as a city, is really starting to have some great International options - that are still completely off the radar.  Here are two good bubble tea shops in this grocery store, and this one has nice milk tea, and good lemon black tea, as well as tasty buns and other good baked goods - as you can see from my pictures. I might like the neighbouring Hong Kong Place slightly more (especially for milk tea), or they might be dead even - the next time I come to Charlotte I will be trying both for a second time.",
    "rating": 5,
    "rated": {
      "funny": 21,
      "useful": 22,
      "cool": 23
    },
    "photos": [
      {
        "img_id": "VWPQtjAn-rD9fbU5UUD7TA",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. No of course it&amp;#39;s not all for me (hides)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VWPQtjAn-rD9fbU5UUD7TA/o.jpg"
      },
      {
        "img_id": "OBaFP9JKSEq5WBQy-ed34w",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. It&amp;#39;s the 24 hour race at lemons",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OBaFP9JKSEq5WBQy-ed34w/o.jpg"
      },
      {
        "img_id": "kyXbNbsA3ZPPGmCEjurWLQ",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Check out my buns",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kyXbNbsA3ZPPGmCEjurWLQ/o.jpg"
      }
    ],
    "user_id": "Hi10sGSZNxQH3NLyWSZ1oA"
  },
  "ctjxOUzpw-8xDtGkCA9anQ": {
    "date": "11/12/2018",
    "text": "Stopped here for a bahn mi snack and was so delighted.  Perfectly toasted roll with fresh ingredients.  Matched up with the best Boba Thai Tea.  Also tried an order of the steamed pork meatballs and shrimp & pork shumai.  Both excellent.  Reasonable priced! Friendly staff too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "thOV9ZSbe2AVJMHSBM9F9g",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/thOV9ZSbe2AVJMHSBM9F9g/o.jpg"
      },
      {
        "img_id": "VBYOY3u1PCRpXVA8AcAqGQ",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VBYOY3u1PCRpXVA8AcAqGQ/o.jpg"
      },
      {
        "img_id": "EHc42AVEX38fD4k35jodaA",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EHc42AVEX38fD4k35jodaA/o.jpg"
      }
    ],
    "user_id": "U71g1EIo1jLvJLj1xoj3zA"
  },
  "P4iD4jkc89pJBbI2uS75pw": {
    "date": "2/27/2019",
    "text": "Located inside Super G Mart on east independence blvd. The only place in Charlotte where I have tried the buns. I wasn't sure what they were called because I first had this bun in Chicago and the place was called Bao place. Assuming its the name I tried to find here later to realize it's called Bakpau or Bakpao or simply buns. honey buns is a nice small place for these. We could not try the vegetarian bun as they were over around 7pm. But got to try the chicken bun. not at all expensive , but it's more like a food court nothing fancy. Do try if you love to explore different foods. They have even sweet bun options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qwsZWhs3BCzlOW3dder5aw"
  },
  "QS6dHilGcBwoto_lm91IBw": {
    "date": "1/21/2018",
    "text": "How did I not know this place existed? Having some Asian family and them being raised in Hawaii, some of my favorite food growing up was the buns my grandma would bring back to Kentucky after a visit to Hawaii. I've bought frozen buns, but had no idea I could get them fresh in Charlotte.   This is the real deal. Honey Buns is located in the Super G. They have a variety of dim sum and buns, both savory and sweet.  They also have fried rice, soups and bahn mi. I ordered a Chinese Pork bun, BBQ pork bun, Korean pork bun and teriyaki chicken bun. And I also ordered the wonton soup with noodles. My order was to go. The buns were just like I remembered. Dough was soft and not too chewy. My favorite flavors were the Chinese Pork and the bbq pork. The Chinese Pork had a great classic flavor with cabbage and scallions. And the bbq pork was a nice sweet sauce with tendor pork bites. And by the way, they are really affordable, with the most expensive bun being $1.99.  The soup was packed to go so the noodles and dumplings were packed separate from the broth which helped the noodles not get too soggy. However, when I got home and assembled, the noodles stuck together really bad. The broth was light and not too salty. And the wontons had an amazing flavor. It's probably better if you eat it in the store, but if I got it to go again, I would just order the wonton.   I will definitely be back, especially since I didn't get to try the sticky sweet rice dumplings.   Authentic buns at a great price!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "M7L8OvPCB2CGoqR0gnQZUQ",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Top: BBQ Pork, Teriyaki chicken. Bottom: Chinese Pork, Korean Pork.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M7L8OvPCB2CGoqR0gnQZUQ/o.jpg"
      },
      {
        "img_id": "17FSXeKmdqvJMIEZacHijg",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Wonton Noodle Soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/17FSXeKmdqvJMIEZacHijg/o.jpg"
      },
      {
        "img_id": "Auajp--2L4ekCmAaGOvsAg",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Buns!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Auajp--2L4ekCmAaGOvsAg/o.jpg"
      }
    ],
    "user_id": "0cG35-H4SbjjTTSlNoK3fw"
  },
  "VRHA7DPwyP29maRjoYzb5w": {
    "date": "12/21/2018",
    "text": "Great eaterie. The buns are huge and flavorful. I got 3 huge portions of buns which tasted like heaven. Keep an open mind and grab a bubble tea too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pGmJ8zOFBRqA0-eP9DOikg",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pGmJ8zOFBRqA0-eP9DOikg/o.jpg"
      },
      {
        "img_id": "gUPfpQ2uteaB0xVXF600QA",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gUPfpQ2uteaB0xVXF600QA/o.jpg"
      },
      {
        "img_id": "6kAOvLJosrfvCZ6PyNiWRQ",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6kAOvLJosrfvCZ6PyNiWRQ/o.jpg"
      }
    ],
    "user_id": "FBgIisykTi3wPckKfG9y2A"
  },
  "d3ZMnYcfxHpSfuRGraZzgw": {
    "date": "5/22/2018",
    "text": "I made my first visit to Honey Buns through helpful and enticing reviews on Yelp.  First off, without reading reviews you wouldn't know that this establishment was located as one of three anchors in a food court in a truly international grocery store/mall called the Super G Mart.  The Mart is to the right of an eclectic Asian strip center.  The food court is in the back right side of the Mart.  The Mart itself is an incredible experience and you have to walk through much of the surprisingly large facility.   The restaurant (booth) was a little hard to figure out but you go to the left counter.  To your left will be about twenty or 25  sheets each describing a menu item m, it's name, and cost per unit or units.  There were four broad categories of items including varieties of fried rice, Asian sandwiches, bowls and of course buns.  I went with buns since this was a bun place so I had to go with buns.  I ordered three, it came to around six bucks plus another buck for the Diet Coke.  The pics and descriptions were very helpful but so was the guy who took the order. The three different types of buns I ordered were each different and delicate.  They make buns all day so they are very fresh. I sat at one of the tables in the court and helped myself to the hot sauce.  The clientele was a Mix of Asians and nots and of eat in and take out  The Korean Food stand was closed but looked very intriguing.  The Hong Kong Bakery was awesome featuring a variety of American and Asian deserts and cookies as well as Asian and European breads.  Next time I will visit these other places although the bun place will surely remain my True honey !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "0--UDi26tOq3K6KmuQtKvA"
  },
  "HTPBUk61BtIdXP_Em5hYGA": {
    "date": "10/17/2018",
    "text": "I've been reading about this place. I've been inside the store a couple of times but never stopped to eat. I wasn't thrilled with what I had I believe because I took it home to eat instead of eating there. And taking home steamed items allows them to get a bit soggy. My mistake.      I had shrimp dumplings,  Pearl meatballs, Korean bun, and a Chinese bun. The fillings were good and seemed made in house. They have a large selection of dumplings and buns along with soups and fried rice.  I just need to remember that Bunny's is there. And need to go back soon.  Because what I had was steamed it was bagged and ready in a blink of the eye.     Young lady at the counter was very welcoming and friendly. Then offer canned pop, Pepsi products, to drink.     I also would like to try the Korean stall right next to it.  What I had today cost $10 and was well worth it. Also be aware that there is a $10 minimum to use plastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "M0cI78odeq_GKqLzk8sIrw"
  },
  "D11u4pork-v4dL2KhGPI0w": {
    "date": "8/20/2017",
    "text": "I like buns, hon. Ok, ok. Have I overdone it with that joke? But seriously... I had my first buns at Honey Buns last week and I'm now obsessed!   First things first. Honey Buns is located INSIDE Super G. When you enter the grocery store, first marvel at how clean the store is and breath in. If you're lucky, Hong Kong bakery will have something in the oven and it'll smell like you're literally inside a birthday cake. Next, turn right and head towards the back corner. There you'll find a magical food court housing Honey Buns, along with Hong Kong bakery and a Korean restaurant.  Next. Check out Honey Bun's menu, posted to the left of the register. There are pictures of every dish to help you navigate. (Although, a lot of the buns look the same, so I'd actually suggest going by the description of the stuffing instead.)   Once you've decided what you're getting -- I had to write it down I wanted so much -- head to the register to order. I had the BBQ pork, teriyaki chicken, red bean, and Vietnamese pork buns. All were delicious but the BBQ was my favorite, hands down. Throw in an order of glass meatballs (just so-so) and a diet Pepsi and my total was $11.50. So cheap!",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 11,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "uQICheHCYbFKEyWzJyYXvg",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. BBQ pork bun",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uQICheHCYbFKEyWzJyYXvg/o.jpg"
      },
      {
        "img_id": "CDBd3DgQsAZmSMt3zKukiA",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. BBQ pork sandwich (banh mi)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CDBd3DgQsAZmSMt3zKukiA/o.jpg"
      },
      {
        "img_id": "n_ROTmfWYx6nddoz1mIuhg",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. I like buns, hon.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n_ROTmfWYx6nddoz1mIuhg/o.jpg"
      }
    ],
    "user_id": "eVxYV4jI-618bnRCDniowQ"
  },
  "FGv4yfcUu_JINPByOYZsyA": {
    "date": "8/19/2017",
    "text": "So first of all, Honey Bun's Cafeteria is located in the Super G Mart, so don't be like me and drive around the shopping center twice looking for a store front! It's in the back right corner of the store.  With that out of the way, STEAMED BUNS! A lot of trendy and upscale Asian cuisine restaurants are starting to feature them on their menus, and they're charging a huge premium for them as well. I went to a restaurant close to Uptown a few weeks ago and paid over $10 for two teeny tiny steamed buns! If your a junkie for dim sum and don't want to take out a personal loan to support the habit, you're going to be really happy with Honey Buns!  The menu is very simple with pictures of everything they offer prominently posted on the front of the shop. Today was my first stop at Honey Buns and I tried the Teriyaki Beef, Vietnamese, and BBQ Pork buns as well as the steamed shrimp dumplings.  For the price, the steamed dumplings were outstanding. It was nearly all shrimp with the only filler there to keep everything together, great texture and mouthfeel with a slightly chewy outer dumpling.  As for the buns, you can't beat the price! $1.65 bun and it is massive, see my pictures. You could easily get two buns and a soft drink and have a hearty lunch for $5. I added soy sauce to the supple and springy buns and tore each in half to find a generous meat filling in each. My favorite by far was the Teriyaki Beef but they were all great.  As far as the food court itself, it's no frills which is fine. The market has not been renovated or updated in a long time, but by no means is it dirty or run down; just keep in mind it's not going to be like walking into a Whole Foods that opened within the year! One thing I will note is the bathrooms (located between the 'Korean Restaurant' and the Seafood market in the grocery store side) to appear to be recently remodeled. Imagine my surprise when I walked in and saw all tile with a granite countertop, clean toilets, and motion-activated sink, soap dispenser, and paper towel dispenser! Love it!  You'll likely notice when you walk in that there are two other 'restaurants' in the food court. \"Korean Restaurant\" as well as a counter simply named \"Banh Mi Sandwiches.\" If you look behind the counter it appears that they all use the same kitchen space so I assume it's just an easier way to keep the lines moving based on what you're there for and organizing the prep/ready-to-serve items more easily. Also on the far right side of the food court is Hong Kong Bakery that has some amazing cakes and pastries!  Next time I'll definitely be trying either one of the broths, a noodle dish, or the Fried Rice that my Yelp Friend Hashani recommended. Special thanks to Hashani for her review, I probably wouldn't have crawled out of the comfort zone and tried this place otherwise.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "zRzGYk_N7GmKY6CSiUtoEQ",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Teriyaki Beef Bun",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zRzGYk_N7GmKY6CSiUtoEQ/o.jpg"
      },
      {
        "img_id": "ywP0lAGjpWM6qflFiuyfPg",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Vietnamese Bun",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ywP0lAGjpWM6qflFiuyfPg/o.jpg"
      },
      {
        "img_id": "LCQ_bCb5XkuvsCpEReD0ew",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. BBQ Pork",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LCQ_bCb5XkuvsCpEReD0ew/o.jpg"
      }
    ],
    "user_id": "dpzAqLprtex54rXlCU-OTA"
  },
  "ZRAfb0_1cSmd2BBxN2qMgw": {
    "date": "3/16/2019",
    "text": "This is the closet you will get to authentic dim sum in North Carolina. Everything on their menu is excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-mLOLtm15hl5IowV__OY3g"
  },
  "k4XUwJJ3X4knOxGbqp9a8Q": {
    "date": "4/17/2018",
    "text": "I enjoy coming to Super G and always try to patronize the food vendors in here . I  love coming to Honey BC and getting their custard buns ( so yummy ) . I've tried other things before and didn't like them , recently I got a fried rice dish , I believe it was the house fried rice and some shrimp Dumplings . Rice tasted over cooked and almost gummy , I couldn't eat the shrimp dumplings due to the gelatinous texture of the inside mixture and hard texture of the actual dumpling . This could just be my personal taste but I will stick To my custard buns in the future . They also make boba drinks which look tasty and seem to be popular .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ZWcubmfVIS7r6QSzCBjU9Q",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZWcubmfVIS7r6QSzCBjU9Q/o.jpg"
      },
      {
        "img_id": "WVZDhUts8LPp1gXz8bhTTA",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WVZDhUts8LPp1gXz8bhTTA/o.jpg"
      },
      {
        "img_id": "Hn4rPP0U9SWickP5uO7iQw",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Hn4rPP0U9SWickP5uO7iQw/o.jpg"
      }
    ],
    "user_id": "lgwZbztTZlKbuiD88cSPcA"
  },
  "nJlcH202sNpTuGbVndJMxQ": {
    "date": "4/5/2017",
    "text": "I come to Honey Bun's for buns.  And I like them!  It is inside of the grocery store, so if you're not familiar with the area, you have to go INSIDE the Super G store to get to the buns.  It is usually busy every time I have been there.  The staff is nice and swift with taking orders.    I order to go each time and I have tried the red bean, taro, and BBQ pork buns!  My favorite is the red bean, however the pork has a pretty scrumptious flavor.  They do accept credit cards, but my order is always under $10, so I just bring cash.  I haven't tried any drinks or anything else, but would recommend this place for sure-at least for the buns!  Who doesn't love a nice set of buns?! :)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "J7ymvg8hl1QyaPKs3ffMDg",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. BBQ Bun! Good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J7ymvg8hl1QyaPKs3ffMDg/o.jpg"
      },
      {
        "img_id": "hKLF_sEVFKqxXhwAsJONng",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hKLF_sEVFKqxXhwAsJONng/o.jpg"
      },
      {
        "img_id": "KCBFeBVfa5AeldPfmKueeg",
        "caption": "Photo of Honey Bun's Cafeteria - Charlotte, NC, United States. Red bean &amp;amp; BBQ Pork Buns",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KCBFeBVfa5AeldPfmKueeg/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "nyoCdZUTMEFARvcRy7O8aA": {
    "date": "3/19/2019",
    "text": "Love the Bbq pork, chicken teriyaki and red bean buns!! The quirky location of being in the back of the grocery store makes it even better, the food is quick and delicious and staff is friendly!! Plus you can't beat absolutely stuffing your face for for under $15",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B6w97BuL8VPzth2-TRPkKw"
  }
}