{
  "M80v-j2O-cNB0Ni_NZGdNA": {
    "date": "7/14/2018",
    "text": "What an amazing hidden gem. This place has only been open about 4 weeks and my friends and I met for brunch. It was amazing. I had the \"bikini\" and it tasted like biscuits and gravy. Then the blueberry ricotta pancakes were amazing.  Also had the tuna tartare that was delicious. I went back on a Friday night and had the octopus, kale salad, and the pork tenderloin. All amazing and just like when I lived in Madrid Spain for a summer. They did an amazing job!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dy3z-USsyaCpmqjbwfhC3Q"
  },
  "cyXwhMwcofgmbSfAEFwMOA": {
    "date": "9/22/2018",
    "text": "Awesome service and an amazing ambiance! Would definitely recommend to anyone in the area, their tapas are delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eziQz_7rgYNFZdXK_U4Llg"
  },
  "OyUSIl2W0jerOm5qoSknWg": {
    "date": "3/11/2019",
    "text": "This place always delivers with food.  Over the summer I went to Spain and these are some of the exact tapas they have there and they are delicious (las patatatas bravas) are definitely recommended.  My last trip here I was fortunate enough to have a great waiter named Grant.  Some serves don't interact at all, some \"interact\", but Grant he INTERACTS.  If you're having a bad day 9/10 times he will be able to cheer you up.  If you're having a great day 9/10 times he will be able to make you laugh.  Grant not only talks to you and makes you laugh, but he genuinely cares for you.  I asked if they had a Shirley Temple and he responded they did not, but that did not stop Grant from making me happy by making something as close as he could get for me.  If you happen to go to Bulla I definitely recommend the croquettes,  paella (for larger parties), and las patatas bravas, and if you are fortunate enough to have Grant you will have a great time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "duJIO1awB-nMHGQ30uRCCw"
  },
  "tDuJBGrFTCrw87M_lDPCnQ": {
    "date": "2/9/2019",
    "text": "Amazing dining experience. The flavors are authentic that just pop in your mouth. The wait staff are awesome. They are professional and know the menu well. They make the right suggestion that makes the meal complete.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P5bTeRNMUgVc6IqJ0OYCqw"
  },
  "mIvLZwbkmd2h8dN-pfX97Q": {
    "date": "6/24/2018",
    "text": "This is my favorite restaurant in Charlotte and they've been open only for 2 weeks.  Seriously, after trying this place my wife and I want to go visit Spain.  We came for lunch last Monday and came right back tonight, less than a week.  Try the grill octopus salad.  The Gambas shrimp was perfectly seasoned.  The service was also amazing.   Everything was perfect.  I love this place!!!! Go try it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "83mFs_8BVhwhR20G-up6Bg"
  },
  "qr-paIHea_VPqbyD5SHkqw": {
    "date": "9/3/2018",
    "text": "Great place to eat, great service and a wonderful environment. All the tapas are top quality, well thought out menu with good prices. Try the Churrasco, definitely my favorite on the menu and be sure to leave room for dessert!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wz2HbUDP3jCbLmxZIRE_1g"
  },
  "LvDv1scJspT-vlY6nj5TtA": {
    "date": "9/3/2018",
    "text": "We went here for brunch and it was really good. Couple of hiccups but overall a pretty pleasant experience. A very beautiful restaurant and we look forward to checking it out for lunch and dinner",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0oLRw2wROxFtfxyhKXqDmQ"
  },
  "OT6VnzJ1oknCI2YPmW5I1w": {
    "date": "7/7/2018",
    "text": "Tried it out and the four of us had an awesome experience.  Great vibe, cool bar and most importantly, excellent food.  Started with chorizo and a cheese plate - very good.  Moved on to ceviche, gambas al ajillo, and both the chicken and pork pintxos...all fantastic.  My favorite was the pork pintxos although I'm not huge into seafood. Everyone else's favorite was ceviche.  Last round included croquetas (everyone agreed some of the best we've ever had), patatas bravas (same - 2 servers recommended them and they were bith right) and the tortilla (disappointing - the only thing but it was very average). Overall loved it and we will all be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "puWzWYS65qqZOK1dzq6SMQ"
  },
  "pKJQC-nb3kegbFsfPybx8A": {
    "date": "7/1/2018",
    "text": "We had an awesome time at Bulla! The cocktails were delicious-- the Spanish margarita was amazing as was the lemon gin cocktail. All of our food was great, but the tuna tartare was definitely the stand out dish! The service was great-- Sebastian was excellent! We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c4wagccY8mSd69Hi0ioriQ"
  },
  "Mx2-WLCtgZawJVz3anMAHA": {
    "date": "8/25/2018",
    "text": "2nd time to the Bulla Staff always pleasant and great to chat with. No complaints with food  definitely worth a visit  Drinks are good but really need to increase the alcohol pour  A gin and tonic shouldn't be mostly gin ! Great place don't get me wrong but unless they change the drinks you will leave sober and hungry ( small plates ) after $150 tab",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ANbFakuTzB2vPa2ET2ZDUA"
  },
  "shLQhR-DqmCO6X7VZQVQvQ": {
    "date": "8/19/2018",
    "text": "Great meal!! Fantastic waiter, Sebastian, took good care of our table. Everything was delicious... especially dessert. Will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pRZs4xr0dyz0C_LYARAOCg"
  },
  "RUCdjILpaPao1a6yIV1-8A": {
    "date": "7/8/2018",
    "text": "Went last Thursday, the atmosphere, service, and beverages and food was phenomenal!!  We will definitely be back!  Ham and peas was great!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i0NDxuSK07ubYrbFcP8ebw"
  },
  "VWKcqbTySe3S6HziaWbllA": {
    "date": "8/8/2018",
    "text": "We dined at Bulla as a family for my wife's birthday. The food was outstanding, the service was on point. Tashima, our server made, us feel right at home. A.J. the manager stopped by to welcome us. We loved the atmosphere. I would highly recommend Bulla. Be adventurous and try new things. You can sample the tapas or go for a larger entree. The calms were wonderful. Please take time to dip the bread! The Arroz Caldoso was delicious.  Our family well definitely be back. Thanks for making our special occasion even more special.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x_TLaJO1nyRroAlf6HVlbg"
  },
  "JJ9WoUDC4gecqsZyqkRm_g": {
    "date": "7/26/2018",
    "text": "What an incredible menu and dining experience. Attentive service, thank you Zach for taking time to explain our choices...I'll definitely be back and recommend this restaurant to my friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cJ6yZVZUG_lJvmv1xD4qEA"
  },
  "uJrEMwhOvbZmWuBbMFdwFA": {
    "date": "6/20/2018",
    "text": "Enjoyed our first trip to Bulla.  Beautiful open  interior - quite a transformation from Chuys!  The service was friendly and prompt.  The food comes out as it is ready, so we felt everything was well seasoned and the temperature was just right.  I, personally, did not venture into some of their specialties, but ordered Shishito Peppers, Roasted Oysters, and the Manchego Cheese.  The individual cheese selection was a nice portion size and came with some delicious glazed pecans, mini breadsticks, and toasted baguettes with fig jelly. Others in my party tried the salmon and the roasted octopus salad, and were pleased!  Bulla is a nice addition to South Park, and offers something unique to the area.  I look forward to visiting again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LbazvWSHAATmrgxvrOuERA"
  },
  "ItgwB0_xf77_iOvIFFzltQ": {
    "date": "1/20/2019",
    "text": "Food and atmosphere was good. Can't say I will be a regular here but definitely glad I tried it. We ordered several tapas and our favorites was the Monditatos, Jalapeno Ceviche, Tuna Tarte and Ham Croquettes. The duck and paella was delicious!! We ordered a variety and shared them with the tables. The sangria was just okay but my friend really liked the Bullfighter! Good place to try not for dinner if you have a big appetite and don't want to get full otherwise you will spend a lot on small plates. Dessert menu needs some work.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T7sq-BIRWAI7J0va3sC7Yw"
  },
  "1-7LySkfbjohgMo13VdJ8g": {
    "date": "11/4/2018",
    "text": "There have been so many restaurants in this space, and none of them seem to work. This newest one has a great interior decor, and some great food ok the menu. For some reason, however, it just doesn't click for me. It has a corporate or chain feel, which is a feel I just don't associate with tapas. We went at lunch and it was not that busy, but I still felt overly rushed. I like a fair amount of wait staff attention, but this is one of the few restaurants where I though the waiter was just too attentive. Our guy stopped by seemingly every minute, constantly offering unwanted menu suggestions. I would not rush back - there is not much personality in this restaurant, and nothing unique. There are many more exciting options for tapas in Charlotte and more unique places close to this place in South Park. But it's worth a try once. If you're considering trying it, I would suggest you sit at the bar after work and have some drinks and tapas. That's where this restaurant has the best chance of success. The bar looks generic but cool, and if you work nearby, you could do drinks and apps there to check it out and then press on somewhere more interesting for dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LrW1IlMqL8G529jaqM6M-Q"
  },
  "3iNY1P3pIHkTa_5HK_p5CQ": {
    "date": "8/11/2018",
    "text": "What a great experience. The food was excellent, the ambiance swell and our server, Sebastian, was off the the charts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vRmTPJU9pafKAALi2TWh5w"
  },
  "n_kxxanUwvZL4JB1BEbRjw": {
    "date": "7/13/2018",
    "text": "Was looking for something different to try for a lunch out with my mom. Bulla hit the spot in every way! The decor and atmosphere is nice and not stuffy. The server (Matt) was knowledgeable and offered suggestions that were perfect. The food was delicious!! Tuna tartar was amazing and the Chocolate dessert ( can't think of the name of the correct name) was a perfect ending. Can't wait to come back and visit with the hubby!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ky8ovT9MuknWDN4u69LcUQ"
  },
  "vr6Z3A5jEqQXj1XRLeekYA": {
    "date": "7/9/2018",
    "text": "I went here for a friends get together. We always do tapas for dinner with this group. We really enjoyed the wine, service and food! I would definitely go here again. The only reason I'm not giving it 5 stars is because the ambience wasn't as cozy as some other tapas restaurants I've been to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OGQDdMgrZNklvWr9BSld4Q"
  },
  "cHQC7B6Rc9-LmtwA9Hv1TA": {
    "date": "7/19/2018",
    "text": "Second time to Bulla in two weeks for dinner and nothing but amazing!!! Came here for my birthday and everything was so delicious. My favorite this is probably the pork and veal meatballs and patatas bravas, so good!!  Calamari was great, chicken skewers to die for, Salmon/spinach platter amazing, along with everything else we tried. Churros were my favorite!!! Thanks Bulla! Excited to try their brunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iYX-himi9lmT2xi6l_mJxQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iYX-himi9lmT2xi6l_mJxQ/o.jpg"
      },
      {
        "img_id": "6wrOvIweYH5SxxyCJEdvLw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6wrOvIweYH5SxxyCJEdvLw/o.jpg"
      }
    ],
    "user_id": "8oofaDz2nL0gzvAXaLbR4w"
  },
  "UIhTKhs84VwT4-EK0bok3g": {
    "date": "12/30/2018",
    "text": "What an exceptional dining experience we had at Bulla. First of all I would like to give a big shout out to our server Alexis who was not only professional but was also fun to talk with. This establishment has the classic Spanish tapa feel where the food is shared and arrives scattered.  I would say that it is not 100% Spanish but it was very close. The ham croquettes paired with a fig compote was our favorite dish we had to order two. However all the food was delicious and you can not go wrong with anything there. So go with some friends/family and time to fully enjoy the Spanish dining experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cVSP8voALaOAseTtcj_nfw"
  },
  "y0Hzq-H3lPKjHtnVoT9pbA": {
    "date": "5/17/2019",
    "text": "This is one of the very best restaurants in Charlotte that I've ever eaten at. The ambience, table service and menu options were first rate and none of the dishes disappointed.  From the bar drinks, to small plates and house specials, this place is not-to-miss for anyone in or around South Park.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1PNkHk-qkXMOzSUhc9jzmw"
  },
  "H2qK7SkSWanZlakVdcD7Tw": {
    "date": "1/9/2019",
    "text": "The paella is so good! My husband and I have had authentic paella from Spain and this was pretty close to the the taste. Make sure you tell them that you want the rice to have a crust because the second time I had it the rice was too soggy. The tapas are also delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nBDeJpMzXPHC4yqFOuTVxA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nBDeJpMzXPHC4yqFOuTVxA/o.jpg"
      }
    ],
    "user_id": "5CglUrJxJjTj0GWTBECNjQ"
  },
  "8bCSYI8_38fFd1-LP7LU6A": {
    "date": "12/28/2018",
    "text": "This is a new restaurant and it's the new tapas style eating which I enjoy. The croquetas were good but could have used a bit more ham- bechamel is cheap but jamon is not but a little more would really zoom up the taste. The fig jam that comes with it is excellent to. We had the bulls egg which is such a simple but great idea- a fried egg over homemade chips and truffle oil- so awesomely good! The brisket montaditos had an amazingly good rich flavor but I as not impressed with the pulpo- too many potatoes and not enough pulpo.The paella was a bit disappointing, not enough of the smoky saffron and too much tomato sauce.  We had an excellent chocolate cake but the Torrijos with turron ice cream was the winning dessert. Would definitely recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l6jrqB95P4alQkRHq9OWnw"
  },
  "Ol6BeMYerPBEe91yLAMzSA": {
    "date": "5/12/2019",
    "text": "The Hazelnut waffles and pancakes were excellent. The Pantxos were also great. Service was good. Obviously packed on mother's day but nice shareable portions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HBcWG2QrnW3E4y8H3phf_w"
  },
  "eQjFd_W0ErnK3ldAQ_3bjQ": {
    "date": "12/14/2018",
    "text": "Oh I loved this place!  Perfect for our girls night out.  The tapas and drinks were so good!  I enjoyed the lavender tea cocktail it's is a flavor explosion and a must try.  The paella, cannoli, espaniola and pumpkin brulee were amazing.  The wine list is also amazing and unique, they have a variety of California and Spanish wines you normally don't see on the menu in our area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jg-7KgJqqm8BuSIZO6p9NQ"
  },
  "tppNetCoHdVlf-cekaII3w": {
    "date": "12/20/2018",
    "text": "Though ingredients are fresh, their dishes aren't authentic Spanish tapas.  Service was great and price is reasonable.  I will be back likely because it is close to my hotel.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0dQgoqRVcP1KF1MPzZJqSw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0dQgoqRVcP1KF1MPzZJqSw/o.jpg"
      },
      {
        "img_id": "ozRCF2mGQs5hN6iKn1_v3Q",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ozRCF2mGQs5hN6iKn1_v3Q/o.jpg"
      },
      {
        "img_id": "o-5sAljmAOGmbDXMLd0ExA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o-5sAljmAOGmbDXMLd0ExA/o.jpg"
      }
    ],
    "user_id": "UvySW_5LIxlvoTIJc4AuHw"
  },
  "gCpawIvPOo1_xNEXQ69_1g": {
    "date": "6/2/2019",
    "text": "Great food and great people. I am telling everyone this place is amazing! Everytime.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tgO2aA2s1BxEq-xbwkYvIw"
  },
  "D9XV9_DEXGZyhPR_ggBXyg": {
    "date": "5/5/2019",
    "text": "O.M.G. This place is amazing. The paella is incredible and can easily be split between 3 people. The burgers are incredible as well. Definitely would go back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1YZ6OxIIdg7eVhk5s8dEnA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Paella",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1YZ6OxIIdg7eVhk5s8dEnA/o.jpg"
      },
      {
        "img_id": "LdpVkdAvnrileNqFwBOHyQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Churros",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LdpVkdAvnrileNqFwBOHyQ/o.jpg"
      }
    ],
    "user_id": "23ru7_FeiKitUEbwCnuSeQ"
  },
  "4Bzm3Trc52k--vcf_RlFcQ": {
    "date": "12/16/2018",
    "text": "I decided to give this place a try and I was not disappointed. I especially loved the grilled  Octopus Salad. I loved it so much that I ordered a second helping. Simply light and amazing. The red snapper was also very good but the portion seemed small. Great food, very good service I'm a lively place. I highly recommend Bulla. I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "admU0BwuzAeX_L4QzlPNxg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/admU0BwuzAeX_L4QzlPNxg/o.jpg"
      }
    ],
    "user_id": "1LNvkt9m8vj9h3koTDLYFA"
  },
  "Ly6rdG9c2SZF0uDV5fKSoQ": {
    "date": "10/6/2018",
    "text": "Me, my other half and our little one were heading to Cowfish tonight, but after we heard the dreaded \"45 mins to an hour\" knew we couldn't wait that long... little one is a 13 mo toddler and it was already 5:30 pm, so we were on borrowed eating time!!   We headed next door to Bulla - Everyone was professional and courteous and I never once felt like I got the \"they are bringing a baby here?!\" Look.  Food came out good and wine was served meticulously, with traditional service steps and tasting.  Our server was probably the best server I've had at a restaurant in charlotte in years (and I've come from a bartending background so can appreciate the craft!) and we were in and out without a toddler meltdown!   Check this place out... it's good people,service and food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AdUnOk0GklETx2duKMFq_Q"
  },
  "mgdbkqXbsxm4hlN-YFgAcw": {
    "date": "7/18/2019",
    "text": "Great food. Too pricey for what it is it should be 35% less on the food price, keep the drink cost where they are. There making a ton on the booze anyway.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iFVWVsU4B4JaqjvgjHgm0Q"
  },
  "WcLeDOxj2l0LL6wQCX0h9Q": {
    "date": "4/6/2019",
    "text": "Their 3-course brunch is to die for. Great value, natural ingredients made to order, and discounted drinks to go with it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "viY8htJFnBqQMLXAU__yZg"
  },
  "SAdi5Y9u1a-a9G_mU_ddjQ": {
    "date": "4/13/2019",
    "text": "Okay.  Nothing bad or good to particularly say.  Helpful right?  I really liked the sangria.  I went with a group so I probably got to try 10 or 12 dishes and nothing stood out as really good; everything was just fine.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1wk9_DqXX0fiW0pyhNdQBQ"
  },
  "NeyUuceahHiMPWhp207HTA": {
    "date": "9/3/2018",
    "text": "What an excellent place! The food was phenomenal. .. we started with a meat & cheese plate then had the ceviche, clams & pork belly, gazpacho and meatballs. All flavorful and unique.   The service was A+. Zach was attentive, made recommendations, kept our drinks full and our plates and table clean. We were never rushed and stayed for over 2.5 hours. Thanks for a great night, we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "1c3rodMUalUBCeaFg5kcDg"
  },
  "ReSBmoYRQDXpFOq4Mbn1EA": {
    "date": "3/31/2019",
    "text": "There are not many taps places in Charlotte and I'm glad that I came across this restaurant! I went there with my husband after a shopping trip in South Park Mall. Our waitress was very nice and helpful. Some of the tapas have pretty big portions so they worth the price. The sausage and cheese tasted wonderful - highly recommended. The only thing I would complain was the salt in the octopus salad was not evenly distributed; a little disappointed, but the octopus was tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ducknPApQ7_js5La-JFp3w"
  },
  "WOXLROhx9jEqtnL7rtZPgQ": {
    "date": "12/5/2018",
    "text": "Delicious tapas menu with a great rotation of specials that makes coming back frequently always a treat!   I recommend having a reservation, otherwise there can be a 30+ minute wait on busier nights!   Great new spot in SouthPark that we just can't get enough of!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "blm3GGeoiKnklarZvt4CUA"
  },
  "g2QGIKVNguk5zjIcrBDl1w": {
    "date": "3/30/2019",
    "text": "Food is fantastic.  Unfortunately the service was horrendous.  The bar and kitchen were backed up all night, and drinks were 20 minutes plus between order and service.  We were charged twice for an item we had to beg them to bring out.  We were told the manager was going to come and speak with us about the experience.  Guess what, we had to wait for that too.  This was a mess.  No matter the quality of the food, this place has no chance of this is what the service will be.  ...Edit- the manager gave us a $20 gift card as we left.  We will give it another chance.  Really, the food is fantastic.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDNPxOAGxRxy_zm4AFFWcg"
  },
  "POqfOpEqgn4N93x5mC_H_g": {
    "date": "12/29/2018",
    "text": "A must try spot! Love this place! We were in the mood for tapas after doing some shopping at Southpark and decided to stop by and check out Bulla. The food was absolutely delicious!! Everything we had was so tasty, from the food to our drinks. Our waiter, Erlan, was so nice and helpful and recommended some great plates. We will definitely keep this place in mind from now on!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EOqq2P2f_jmtZRtSum5Tew",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Kale salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EOqq2P2f_jmtZRtSum5Tew/o.jpg"
      },
      {
        "img_id": "uOc_u9e71zoqofSo1sSkAQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Chicken Paella (Delicious!)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uOc_u9e71zoqofSo1sSkAQ/o.jpg"
      },
      {
        "img_id": "AHG2I1YJyYMWJLkEPec9eg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Garlic shrimp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AHG2I1YJyYMWJLkEPec9eg/o.jpg"
      }
    ],
    "user_id": "oFXwXITWsZdJ2Hj2kbzd1w"
  },
  "MWFLjG88fqGXmIoOD8fLXg": {
    "date": "3/4/2019",
    "text": "Cleary, a FIVE star experience today at Bulla Gastrobar!  Everything was perfect!  I took my Mom there for lunch and neither of us had ever been.  She kept asking me why I like to always take her to a different restaurant and I was explaining that it's just fun to try new places. (If she knew that I called her SET IN HER WAYS, I may get spanked.)  The minute we walked in the door, her questions ceased and she was in awe.  The atmosphere is alluring, right from the get go.  They are a Spanish tapas restaurant, but also have full plates for very hungry sorts. I loved that they were playing Spanish music. It added greatly to the ambiance.   One pet peeve I have, for instance, is when I go to an Asian restaurant and they are playing Elton John.  It just doesn't add to an Asian experience!  I digress.  So, I ordered the VERDE salad, which came with kale and brussell sprouts and some citrus and was tossed in the most lip smacking lemon maple dressing you can ever imagine. I ordered a piece of salmon to go on top of it.  Every bite was a trip to paradise!  Mom had the chicken sandwich, served Spanish style (bocadillo), and also had cubed fried potatoes that were served with a grated cheese on top.  She went for an almond flavored vanilla ice cream to finish things off.  The one spoonful that I had almost broke my resolve to not eat sweets.  The service was impeccable.  In fact, the server was a burst of good, happy fun!  Go check it out.  Beautiful bar area.  Open kitchen.  Whimsical things on the walls. Yummy food, which the Spanish would call SABROSO.   It was such a great surprise and I already want to go back for more!  Two Thumbs Up!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "85HGrckO-GCdNNbhflZInA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/85HGrckO-GCdNNbhflZInA/o.jpg"
      },
      {
        "img_id": "xaamQhPkDYXyGOvC2FUBtw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xaamQhPkDYXyGOvC2FUBtw/o.jpg"
      },
      {
        "img_id": "NYsnh9XY-EkViv6qzzNU9g",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NYsnh9XY-EkViv6qzzNU9g/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "2bWTWOLSpRwC-SHipOAAPw": {
    "date": "9/11/2018",
    "text": "I was pretty excited to finally come here.. It Been bookmarked since it pops up on my Yelp news.. Stopped in on a Saturday for lunch with a few of my friends.   Walked in and was greeted by the hostess. Nice and have a cheery smile.. As we waiting for our other 2 other friends. Tamisha greeted us with some water and menu.. She seemed to be very helpful. Knowledgeable with the menu and very accommodating. I wish that was consistent thru out our time there but not soo much toward the end.   Restaurant: 5/5 nice layout and clean, somewhat romantic. The patio will be open soon.  Drinks: 3/5 mojito was ok.. the mints wasn't muddled so I couldn't taste it.. and seem like the sugar cane or something else is missing.  Food: 4/5 chicken and waffles. The crust of the chicken was excellent. To big pieces of chicken. However, because the chicken was soo big. The two waffles that comes with it wasn't enough. Shortage on the sauce also. I'm not really a sweet or maple syrup type of person.. but felt that i had to have the syrup with it as a finishing touch..  churros s'mores: 5/5 I'm in love. Nice melty chocolate with an awesome marshmallow with it. Churros was a good size and served warm. Heavenly Staffs EXCEPT TAMISHA: 5/5 everybody was consistent, manager or even the assistant manager all came by and check up on us.  Tamisha our waitress: 3/5 She was consistent til toward our last 30mins there. Her friend came with flower that day, soo we didn't not exist for that time. Couldn't get her attention for nothing. And there were 4 checks. She charged one of my friend a total different price. His check was $23. But came back with the debit card for the amount of $35. And didn't attached the itemized check like it did before. While we were trying to figure out our check. We tried numerous time to get her attention.. But failed miserably. Finally when we did get her attention. It was even more confusing.. somehow, she just refunded the difference. No apology. Nada. I really want to come back because I really want to try the paella. Alway been my favorite but I'll let them works some things out before stopping by again!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "8oFjPgFz4Qeh_gI4v_O_Nw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. After my not soo great review.. Bulla blocked me on Instagram!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8oFjPgFz4Qeh_gI4v_O_Nw/o.jpg"
      },
      {
        "img_id": "kykuE3udvmFntwmRTBpzIw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Heavenly. Warm churros with nice melty chocolate with perfect temp marshmallows. Yum!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kykuE3udvmFntwmRTBpzIw/o.jpg"
      }
    ],
    "user_id": "jcURiDqCLY7AOqo8KClJnQ"
  },
  "j9gaaqo7FsM04akP6onsNw": {
    "date": "4/13/2019",
    "text": "Food was delicious, great service, beautiful ambiance one of my favorite restaurants.  My mom had the sangria and loved it.  The meatballs are my favorites,!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yrnPcIldLMlsS_ORugkZEA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yrnPcIldLMlsS_ORugkZEA/o.jpg"
      },
      {
        "img_id": "O_241K4LOZCVhLOfR3x8qA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O_241K4LOZCVhLOfR3x8qA/o.jpg"
      },
      {
        "img_id": "6lM2DRRQmYGF_LlGdF0tHQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6lM2DRRQmYGF_LlGdF0tHQ/o.jpg"
      }
    ],
    "user_id": "_AanVdLSYmYS_H15-dg6jg"
  },
  "o5sC1lLKrLipsOIqxJWkTg": {
    "date": "7/13/2019",
    "text": "Enjoyed a wonderful brunch here today.  Alexis provided great service and described the entrees thoroughly.  I had the Bulla Benedict.  My husband had the \"price fix\" brunch.  We shared the smoked salmon appetizer which was delicious.  He had the Huevos Bulla which never disappoint and churros for dessert!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a-Hs6QSk2pJjOerJPApbbw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Salmon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a-Hs6QSk2pJjOerJPApbbw/o.jpg"
      }
    ],
    "user_id": "udxKFs17p3Jb4Ur2cXtnSw"
  },
  "raOKRo9Zc0GjuWVYNQouHQ": {
    "date": "7/12/2019",
    "text": "I don't brag about places but this is by far one of the favorite places to go. Paella (on point) all tapas are delicious. The guys are always friendly and service is great! Top of the top",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wHUbktqzHZAfabHQnV0dMg"
  },
  "Okx8ivibE3eg_m9RXyhMrQ": {
    "date": "2/16/2019",
    "text": "Not impressed with this restaurant, the minute I walked in the place was not invited, got to the bar and the bartender look at me but turned his back and continue to have a conversation with a friend after a few minutes he came over and asked me what I wanted to drink, gave me my drink and walked away didn't ask if I needed to see a menu, I called him back and ask him for a menu, I ordered jamon serrano and cheese, they brought me my order but I have to ask for utensils to another bartender that happens to walk in.  Horrible service will not go back.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fk8eMPZ7_dR-u7kpms3w5Q"
  },
  "Xv1_MYRog1576L7f8S69zw": {
    "date": "8/11/2018",
    "text": "Absolutely my favorite Spanish restaurant in town. Everything I've had so far was so good. The drinks look good as well but I haven't got chance to try it out myself. The service is superior.   Things to try if you are a first-timer:  1. Cheese and meat platter (I forgot what they call it on the menu)-I was told all the cheese they use are imported from Europe. 2. Tapas-of course! I love all of them but my favorite one is patatas bravas. 3. Paella- if you like seafood.  Take your date there and she's going to love it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YiK2umoE4Xf3LRaALbgalQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Pealla, patatas bravas and cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YiK2umoE4Xf3LRaALbgalQ/o.jpg"
      },
      {
        "img_id": "kELWBjV7_AZgBJQ8UF8yMA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kELWBjV7_AZgBJQ8UF8yMA/o.jpg"
      },
      {
        "img_id": "u0yepEBlbpZEmTBe3Ts0JA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Cheese and meat platter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u0yepEBlbpZEmTBe3Ts0JA/o.jpg"
      }
    ],
    "user_id": "f0Mo6uZ65XNFT1DwIF83uQ"
  },
  "4cO9up4Us55YiMe3VVK-Ww": {
    "date": "6/15/2019",
    "text": "Ladies Lunch - 8 friends met for a leisurely Saturday afternoon ladies lunch today at Bulla. Everyone agreed that the food, sangrias and desserts were all delicious! The servers were friendly and attentive to our requests.  I will definitely go back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mjsX2JKAmdQtJGjdlnIjLw"
  },
  "fJoQTwGmbcj3gpelVQKHMA": {
    "date": "1/22/2019",
    "text": "My husband and I have been already twice at this place. We even booked for Christmas Eve, it didn't disappoint!  They have real tapas (the real ones!) and their winner to me are the cocktails and sangrias. Their rose sangria and the beer sangria are just amazing.  The paella is really good to go with the fam but for a friends night out I would do several tapas, everything is delicious! The montaditos were my fav.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AK6ioEjZt-dfdSXSeGtc9A"
  },
  "9Aa7D6w0aLxWZ1oUolrCJg": {
    "date": "6/29/2018",
    "text": "I liked this place!  The ambiance is nice and I like the way the whole place is open. We tried several of the small plates and they truly were SMALL plates.  I would advise sharing with two people as opposed to 4 because it was hard for  the four of us ladies to get full without having to spend hundreds of dollars.    The ceviche was the crowd favorite.  It was seasoned to perfection and so flavorful. Delicious  The croquettes were also amazing and the veal and pork meatballs were SO good.   We tried the brisket which was our 2nd favorite.    We then went ahead and ordered the burger because it came with the potatoes and it was one of the best burgers I've had.  The meat was so juicy and the arugala added a nice touch. It was just so good.   Honestly there was not one thing we didn't enjoy.  Knocked off one star for service.  Had to constantly ask for water, took forever for our wine to come to the table, waiter wasnt super present when we needed him, they were out of one of the wines we wanted which was disappointing...but overall, good experience.   I will be back and I recommend!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "TB9ibgXVrq1B7-fajbsu8g"
  },
  "v6TrajwurMTP7tRwZYSYuA": {
    "date": "6/2/2019",
    "text": "I thought the food was adequate and the service was fine.  I am not as impressed with this restaurant as I was when it first opened.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2rU9wu1Po2I0JEN8-AptYA"
  },
  "5-JhTpyfH-8Tx-5PA0dssA": {
    "date": "5/28/2019",
    "text": "Very expensive and medicore food at best? I had the most expensive thing on the menu with giant prawns and two of the prawns were rancid. Maybe you just need to know what to order? Or maybe this is another south park place doomed to close? Time shall tell.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UOWlt_27s4YoD1xATtqy5A"
  },
  "2VCvofSya4lXFWQRze8dUg": {
    "date": "6/27/2018",
    "text": "While visiting friends, they took me to dinner at Bulla. First, I love the set up of the place. It's large and airy with big tables, and lots of space to enjoy good friends and good food and drinks. We were seated at a cozy booth in the bar. The bar is decorated beautifully, and is very modern. We started with drinks. I had the Sangria Blanca which made me feel that I was back in Spain. It wasn't too sweet, but fruity and delicious. For tapas, we shared the gambas, brisket, pork skewers, ham croquettes, manchego, and coppa. Everything was very good. Our server was very sweet, but it seems they still have some kinks in their service. The server seemed to have too many tables, and things took a little longer than necessary. I know the place is new, and will perfect things as they go. I look forward to returning on my next visit to Charlotte!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "JFf9CEPd0yNBN9oSmeZNGg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Sangria Blanca",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JFf9CEPd0yNBN9oSmeZNGg/o.jpg"
      },
      {
        "img_id": "kzGLw5htEIHiSnIuJFvqnQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Coppa and manchego",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kzGLw5htEIHiSnIuJFvqnQ/o.jpg"
      }
    ],
    "user_id": "hF-pUC7PVALNjcxU1cDbGA"
  },
  "4EVAN-qtQuIyySUJIqEoyg": {
    "date": "5/29/2019",
    "text": "If you're looking for a great place for tapas style definitely come here. They have friendly staffs, refreshing homemade lemonades, and great food. Their strawberry or blackberry lemonade we're fully sweet, but not to tart. It's quite refreshing during this hot weather in Charlotte. Our waitress, Grace, was amazing at selecting a few mystery courses for my friend and I as a first timer. She chose Ham Croquettes and for dessert she chose Torrija, brioche with ice cream and honey. We also had a salad called Verde and it's probably the best salad dish I've had. The lemon maple dressing compliments the bitterness of the kale and brussels sprouts and who knew asparagus could taste good in a salad. Anyways, our next dish was the ham croquettes. The jelly paired with the ham croquettes very well. Our next two dishes I hope the next time they perfected was the ceviche and the montaditos. I'm picky with ceviche because most restaurants doesn't cure the raw seafood well in the juice. Most of the time they add too much lime, which happened in this case. I'm sure the plantain chip would be good in the ceviche if they were to simmer down the lime, but other than that I'm sure they would fix that issue next time. Last, but not least Montaditos, it was almost to perfection if the brisket wasn't as dry. I wish the brisket could be a little bit juicier and less dry. Other than that the flavors were there. I'd definitely come back to try some more from their menu and try the food that were lacking a little. If they were to perfect it the next time, I'd give them a 5 stars for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2oGxb9FVdguP2KjMUIBy9A",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Montaditos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2oGxb9FVdguP2KjMUIBy9A/o.jpg"
      },
      {
        "img_id": "HBqXm9vfONGTYuf85uPbNA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Strawberry lemonade, ham croquettes, blackberry lemonade, and Verde salad.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HBqXm9vfONGTYuf85uPbNA/o.jpg"
      },
      {
        "img_id": "_88bLxGKimkp8ocRr0BKlA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Torrija",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_88bLxGKimkp8ocRr0BKlA/o.jpg"
      }
    ],
    "user_id": "726o7MhWq9mxHmT2oAbSeQ"
  },
  "CsC36KR14fkZ7SkkuJu24A": {
    "date": "7/27/2019",
    "text": "Once again Bulla Gastrobar did not disappoint.  From the manager Lethr. To the server Grace  the experience was amazing. I am not from North Carolina. I come down here to take care of my mom  and terminal ill dad.  This place have been a God sent. Grace had my mom Laughing after a long day with my dad. To come to a place were you feel welcome and they remember you is refreshing. Please do come and enjoy their amazing food,there are no word to describe how fabulous their  food is and their amazing service.  Grace and Lethr you both are amazing. Thank You.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v1hBpyIC98GbDwOdB1WLlQ"
  },
  "X8r7gKo4pIQLFqrpzLE_sA": {
    "date": "5/1/2019",
    "text": "Holy Moses!  This food was amazing.  Probably the best meal I've had in Charlotte after living here for four years!  The meats and cheeses were so different and wonderful.  Loved the jam and the candied walnuts.  The ham croquettes were straight up sinful.  Gazpacho, pan con tomate, ceviche, montaditos, all exceptional.  And finally we got our seafood paella to cap off the night, it was everything I wanted it to be, and the giant prawns on top put it over the edge.  The whole meal was made even better by James' perfect service.  Plate changes, refills, and attentiveness without being overly present.  He knows what he's doing!  A perfect night out with my family.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c6fjWBujqWAZgPzU64_Xlw"
  },
  "odMyJTjejjT95qZ3Vs9C9Q": {
    "date": "6/23/2019",
    "text": "This food is delicious! Great, fast service. I love it! This is one of the best experiences I had for brunch! The bartender, Grant really takes ownership of your experience and led us through the menu in a fun, exciting way. The mimosas and sangrias were excellent as well.    I highly recommend. Ask to sit in Grants section.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fakPpkDGYDPkDaGzGGJ0dA"
  },
  "RKLTA1TSyQ6OSnzhI1UgVA": {
    "date": "5/11/2019",
    "text": "Another great meal at Bulla. Our waiter Josue was very professional and friendly. We had several tapas: all well designed. I expected the chorizo stuffed dates to be a bit spicy but they were not. The meatballs were tasty but could have been a bit hotter. The coconut flan w passion fruit sorbet was amazing. Make sure you have a reservation as they got very busy after 7pm.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U96FpJ6l1IcM4h8iMwmHgA"
  },
  "TRD9YRjh22FnTZLL1DRZlA": {
    "date": "6/13/2019",
    "text": "I absolutely love this place, the white sangria is nothing short of amazing, the food is delicious and the service is always great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZplY5GTAcgiMOTTjrvrfGQ"
  },
  "Z_30wTavcVQAq_yMT2JYgA": {
    "date": "7/30/2019",
    "text": "Our new favorite restaurant in Charlotte. Great ambience, waiters are really good and the food is awesome. We had about 10 of the small plates in two visits and they were all great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UynHnnDHgB3ihFHQznrJZQ"
  },
  "10NplB29jkhcAcyc_sCkgQ": {
    "date": "11/1/2018",
    "text": "Came for lunch, we asked to be seated inside and not near the patio and we were sat near the patio where it was humid and we were not greeted from the server which we have been sat for 10 mins already and the restaurant was slow and there were only 3 tables at the time. It was my first and last time there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BM0z3YmiP2uKbpnwC5yKWQ"
  },
  "EAAIUJO-v8a31uqAwne8ww": {
    "date": "4/11/2019",
    "text": "A friend of mine called who was staying near Southpark, and given that we both enjoy tapas I took a look to see what was near him and found Bulla.  We really enjoyed it.  It was helpful that the weather was great, had I known you could sit outside I might have asked for that option over sitting inside.  That being said, we enjoyed a bunch of different tapas, including the Chef's Board, which had a nice selection of meats and cheeses, the sauteed garlic shrimp, albondigas, pulpo a la gallega, tuna tartar, and fried artichokes.  My personal favorite was the montaditos, which is brisket, tomato marmalade, guindilla and tetilla cheese served on small bread sections.  My wife and I have been fans of Malabar, although driving to uptown mid week is not always easy, so this location was a welcome change.  The service was good, albeit the server Alexi had a script he was going to get through despite my every effort to get him to stop and take a breath while I asked questions.   I am looking forward to going to the Tampa location when I am down there visiting my granddaughter, I think she will enjoy this place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6CA9Ir4HQmc4rrY-KhtD1w"
  },
  "1K8qt3xFZ_8dxmVW-aAUmw": {
    "date": "8/14/2018",
    "text": "We had lunch recently sharing the Verde salad and seafood paella. The paella typically takes 30 minutes so we called ahead and placed our order, they were very accommodating with our request. Both items were delicious and well paired with recommendations on wine. The menu describes the paella as Valencia style and having been there I can say they pull it off! This is not a small plate but rather a large pan which is great for two to three people to share. An abundance of prawns, clams, shrimp and calamari blended with the perfectly prepared saffron rice was awesome! The staff is attentive and knowledgeable. Being only a couple months old they seem to have everything working smoothly. Try it you will love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gqs90N_P6CPkaGI0IjsePA"
  },
  "g0o-GVujtYbJBWn5tyKdHA": {
    "date": "8/10/2018",
    "text": "It is apparent this restaurant has hired and trained it's staff very well. The host, wait staff, bartenders, and manager were beyond knowledgeable and extremely professional.  The food is gorgeous to look at and plated beautifully.  My biggest complaint is that everything we ordered last night was so SALTY you couldn't taste the food!  (Ceviche & calamari were two of the worst offenders).  Someone needs to rip the salt shaker out of that particular Chef's hands!!!   My date and I experienced puffy hands, feet, and were dehydrated by night's end!!!  Lol. We looked like a couple of puffer-fish!   (Note: We've dined at Bulla Gastrobar three times in the past and have never noticed the high sodium content. Therefore, we conclude that not all chefs at the Charlotte location are heavy-handed with the salt shaker).  We will happily return in the future but will request \"no salt\" next time as the atmospher and staff are fantastic!  This is a hoppin-happenin'-hotspot in my neighborhood that is a must for all \"foodie's\" looking for a True culinary experience.  Happy dining everyone!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xchHEk8NurLZ9Iz0qgsgCg"
  },
  "uVffeitNu1SYB_n4TGfLUg": {
    "date": "10/2/2018",
    "text": "I lived in Spain for 2 years, so I had some pretty high standards walking into Bulla...  That said, I found myself very happily surprised at their authenticity and quality of food.  First: The Tortilla. Spanish tortilla is one of the most popular and controversial dishes in Spain. Some add onions and peppers, others consider that blasphemy. Some tortillas are undercooked with gooey centers, others are perfectly well done. Either way, crafting a perfect tortilla is a delicate process. I can definitely say that the tortilla at Bulla could stand up to any tortilla I've enjoyed in Spain (and thats a lot!)  Second: The Menu. I have been to a lot of restaurants in the US claiming to be authentic Spanish. This is the first I have been to that honestly supported that claim. From the tetilla cheese (which I have not seen since my time living in Galicia) to the gambas al ajillo and pan tomate, the menu truly covered all the bases. They even had peas and ham on the seasonal menu!  Third: The Service. Our waiter, Zach, was knowledgeable of the menu and was attentive and timely while also giving us space to enjoy our evening.   Overall it was a wonderful evening and I was so excited to share it with my boyfriend and tell him all about the different dishes. This restaurant is a great addition to South Park and I would recommend it to anyone looking for an authentic taste of Spain.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D0ZXOgRxF7wrisKmOE25Jw"
  },
  "cZ9PyWHFJGJtdw6S247nYQ": {
    "date": "9/9/2018",
    "text": "The food is excellent. Authentic Spanish food with bold flavor. We ordered many small plates to share. We left happy, full, and with a desire to return soon! Beautiful decor and fun ambiance.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xz15Xrbah6HjTN86B0ostQ"
  },
  "2O7pxoD44w7sjP_N-9UrLw": {
    "date": "3/31/2019",
    "text": "Food is pretty decent with good variety of small and large plates. Extremely loud inside environment. Difficult to hear your own party without yelling. Service, especially the bar is terrible. Asked for a cocktail straight up. Rather than serve in a tall glass after being shaken it was served warm with no ice. Manhattan that I asked for was served with an orange peel not a cherry. Seriously? I've never seen that before. Time to get drinks while at table was ridiculous as well. Beer and wine, shouldn't take 10 minutes to serve.  Place wasn't even that crowded for a Saturday night. No way we would go back. Quality of food is only thing that gave it 2 stars.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LlLw8clT2_CZtkkGzdTixg"
  },
  "N3lx-Psi6HVWZlUY64s6yw": {
    "date": "6/15/2018",
    "text": "I want to like Bulla, I really do. Maybe it's growing pains, I don't know, but dinner there tonight was disappointing. Service: our waitress was nice, but also tough to find or flag down, I'd see her walking around chatting it up with other staff, but we saw our water/busboy more than her. Food:  1) patatas--hot and tasty, but left under a lamp, so served to us with congealed solid sauces on top, and just tasting of nothing but fried oil. 2)tuna tartar---sesame oil and mush? No bite or texture whatsoever. 3) tortilla--tasted basically like a potato gratin, no egg really, garlic aioli was good 4) croquetas--again, mush and fried oil, didn't get any ham taste period, fig jam was a good complement 5) huevos bulla--SALT AND TRUFFLE, the chips were soggy before our waitress even mixed them up, but they were salted; the ham was salted, it was just so much salt and then mashed with truffle oil.  Our drinks were decent, I had their mule, my wife their bougie Palmer, and then we shared a bottle of Albarino.  All in all, nothing to write home about, I think we will come back and try the larger plates, but the tapas and service left much to be desired.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ySrgGSc7u9FzHaPX7vpgOw"
  },
  "2BokAHzPEmsL1vkWKBX8ng": {
    "date": "6/29/2018",
    "text": "Everything we had here was amazing! We tried the tortilla Espanola, Bulla Burger and the cannelloni. The sangria Blanca was delish and our waitress was awesome. She explained all of the dishes on the menu and was very friendly. We will return soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nwTRwJZFkqtDEdxunzpZDQ"
  },
  "psDT8YXTk9PEznmmFnDJQg": {
    "date": "7/25/2018",
    "text": "The food and wine were both quite delicious! The staff was very attentive throughout the entire evening, and we were even given ideas on which spot to check out next for our night out. I look forward to returning and trying more dishes!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ap4XE9E6jiHJkKUQDF3lSw"
  },
  "tOFmdx6RFJSHCTlGJ04nQw": {
    "date": "9/13/2018",
    "text": "I've been for brunch and lunch which both offered pre fixe menus and regular menu options. Don't let the idea of tapas scare you into thinking small portions. A 2 course meal each had us stuffed. Try the cerveza sangria- so refreshing. Enjoyable atmosphere and delicious food. So many option... I'll come back for them all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rE9Wgjnwuvng7Dr9JcFVyQ"
  },
  "YxRcHzWI2nE3V_os-U2fgg": {
    "date": "6/29/2018",
    "text": "Great place and great food. This place is definitely a must try in charlotte! It has great tapas and the paella is amazing!! Sangria is also a must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ks9_htX_qr3NGff0wPvyHg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Real sangria!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ks9_htX_qr3NGff0wPvyHg/o.jpg"
      }
    ],
    "user_id": "yOJgpmhvSusIcAuD5PL3nQ"
  },
  "j8fnCp3CyPNh4WrDMKW5vw": {
    "date": "8/17/2018",
    "text": "So delicious! Great atmosphere- took a friend here for her bday and we sat at one of the booths between the bar & restaurant, which gave us a nice open view of the whole beautiful place. Margaritas were great. We shared everything we ordered- particularly enjoyed Gambas al Ajillo (shrimp) and Calamari. Tuna tartar is not my thing but theirs was good! Tip: Save room for desserts! The Churros and Torrija were two of the best desserts I've had anywhere in a long time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P8yMO4XWVcrkIf3rv2GkPA"
  },
  "DVQQVpNsGanftGNnrwr3yw": {
    "date": "2/17/2019",
    "text": "So happy to find a Bulla in N.C.  We have one back home in Miami that we frequent, but this one blows ours away. Service is on point and flavors are so perfect. I would highly recommend visiting Bulla when in this area. Perfection at its beat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2zQeU2Trv6-Gz7gHHWj-QA"
  },
  "Woiw3BhgDwQDXmsnLYbD8Q": {
    "date": "2/1/2019",
    "text": "Husband and I went for snacks and drinks on a lazy Saturday. The ceviche was SO fresh, citrus-y, and spicy--everything I was craving. Its lime-based, not tomato-based, which was a nice change. Queso fundido was rich and savory. Drinks were creative and a feast for the eyes. Everyone we came in contact with was great. Next time we'll have to go for a full dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z-MywWR-uyrTh_cs6kuvzg"
  },
  "l6VpMdfW-NvNoluC-D8k0A": {
    "date": "9/3/2018",
    "text": "Everything we had (which was a lot) was delicious and our waiter, Quintan (I think) was awesome and took great care of us.  Favorites were patatas bravas, shishito peppers, and tartar de atun.  Yummy drinks too.  We took our time and were seated ordering literally everything on the menu for 3 hours.  Great place for a group dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d3d1HA7g7K5n2dmdCpp6MA"
  },
  "E-3UatBphT8jXv4X_BgqNw": {
    "date": "8/11/2018",
    "text": "This has become one of my favorite places. Everything I have tasted there exceeds my expectations. The pairing of cheese, walnuts and jam on the crackers just excited me. The chicken with avocado and the salmon over the spinach was absolutely delish. I went back for brunch and the eggs Benedict and salmon spread just had my mouth dancing! Enjoyed the cocktails and the staff. The manager actually recognized me from my first visit a few months ago. Great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m62APm7P1cmcibpv9XRTNg"
  },
  "_EC7Xy58BuWOhuK6GMjpFQ": {
    "date": "10/25/2018",
    "text": "I adore tapas and this place as great tapas! My order recommendations are shishito peppers, octopus, croquets, and the seafood paella. The paella is huge! I ordered it with 3 adults and we all left stuffed! Cocktails are stout and well served.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QPHv6D5kz_OidWnXC67izg"
  },
  "sAU19wZsiNspjWpiWFll2w": {
    "date": "8/23/2018",
    "text": "Yummy tapas! Cool atmosphere' Our server CBass was great!! Looking forward to coming back fior patio time!! Put your furniture out!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTnErcGQOILFmDYFz3FOIw"
  },
  "BcTwHtzcNub3XOaGi1lMvA": {
    "date": "8/23/2018",
    "text": "My experience was wonderful! The food and drinks were the best! I would highly recommend this spot and Richard, the bartender, was exceptional and very attentive. Darnell,the Sous Chef, delivered entres' that made our experience top notch!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6zXq0vosc8EceKNowC0UXw"
  },
  "Nx5ot9uIvSMSxgsKUQH5uQ": {
    "date": "8/26/2018",
    "text": "We were looking for a new restaurant to go to for restaurant week and I had been hearing good things about this place so we decided to give it a try.   We had an early reservation and the restaurant was pretty empty when we got there. We were seated right away.   Unlike a lot of places, their restaurant menu was mostly made us of things that weren't on their regular menu. We started with the Huevos Cabreados and the Ceviche de Jalepeno. Both were great, but the Huevos Cabreados were my favorite. It was a big portion and the flavors worked really well together. For our main course we got the Seared Ahi Tuna and the Braised Brisket Caldoso. The tuna was pretty good, but it was lacking a little bit of flavor. The lemon sauce made up for it though. The portion was very small. The brisket was amazing. The portion was huge and the flavor was absolutely delicious. The addition of the crispy chicken peas added the perfect crunch for texture. For dessert, we got the Crema Catalana and the Churros con Chocolate. We really enjoyed them both.   The service was really good. Our waitress was really friendly and we got our food very fast.   We were really impressed with the food here. I'm surprised more people haven't found out about this place yet. I highly recommend trying it out. I can't wait to go back and try their regular tapas menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e5f0Ex5Cytlrx3gqpBRAWQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Churros con Chocolate",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e5f0Ex5Cytlrx3gqpBRAWQ/o.jpg"
      },
      {
        "img_id": "6fK4oIs1WaCPOC5q2ZzyKg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Crema Catalana",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6fK4oIs1WaCPOC5q2ZzyKg/o.jpg"
      },
      {
        "img_id": "b-zYMwO9_E9lfx5oYX2NIA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Braised Brisket Caldoso",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b-zYMwO9_E9lfx5oYX2NIA/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "U_04XQzDcMnqC43NCUEqOw": {
    "date": "3/11/2019",
    "text": "Just wanted to say that we did another brunch here (on time, this time) yesterday morning.  Grant (behind the bar) was amazing once again, and our waiter (whose name escapes me, sadly) was phenomenal.  I really do appreciate how attentive everyone at this restaurant is.  Even the manager came to check on us.  It shows a genuine care for your patrons, and you guys should be proud of what a great restaurant you've got!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zdWx0hfhKLN7xAsBDdb6Tw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Brunch time!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zdWx0hfhKLN7xAsBDdb6Tw/o.jpg"
      }
    ],
    "user_id": "sl2R5RFdX1QBQX66T_IGwg"
  },
  "YSKwAXkaqbd9gGBKvzkKqQ": {
    "date": "8/12/2019",
    "text": "Grace is AMAZING!  The absolute best.  One of our favorite places to go without question!  Love everything about Bullas!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k126ieddzogSQj_Wwwb4cw"
  },
  "Z0xeMDe4mWPnA0xX68ZQNQ": {
    "date": "7/27/2018",
    "text": "I stopped in for dinner on Tuesday. And I was greeted with an hour wait for a table so my friend and I grabbed a seat at the bar.   The bar is nice, it's busy but you can comfortably order a few dishes and still enjoy the experience.   We ordered a variety of items. The tabla mixta offered a decent selection of meats and cheeses. I enjoyed the shrimp dish, it had a hint of spicy which is always a favorite for me. The pork skewers were just alright. And the meatballs could have used a bit more flavor.   Overall, for me everything was just okay. I wasn't blown away by anything.   I will say that one issue for me was that it took the food soooooo long to come out. I guess that's the kinks they are working out being a \"hot and new\" restaurant.   Either way, for now I'd only come back to try the dessert and grab a drink. They have churros that I'm excited to try!   So stay tuned for an update.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tUeDcAGNRWhJ6MwZ7qj2gg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tUeDcAGNRWhJ6MwZ7qj2gg/o.jpg"
      },
      {
        "img_id": "5rZWROJ_i1RGj8-I0PB56Q",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5rZWROJ_i1RGj8-I0PB56Q/o.jpg"
      },
      {
        "img_id": "C_1ZNlzqRgm4TSecIS7kVA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Pintxo Moruno",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C_1ZNlzqRgm4TSecIS7kVA/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "IvR3UuhvpmRBPkBo0yPYhQ": {
    "date": "7/30/2018",
    "text": "Bulla gastrobar is a modern tapas restaurant that started in Miami (Coral Gables) and expanded into different states. All the locations I've been to have a similar vibe and the recipes try to stay True to traditional Spanish flavors.  This location had a nice interior and was spacious, well lit, and airy-- just like their Miami location. Lots of wood with a great bar space. All the staff seemed friendly.  I really like tapas and Bulla does a great job at keeping their recipes legit. Pan con tomato is delicious and they don't skimp on the tomato. I felt like I was back in Spain. It was really fresh and tasty, though the bread got soggy pretty quickly. I also got the patatas bravas, which were tasty and crisped decently, but were completely overly smothered in the sauce. Flavors were great though. This was probably my favorite dish in terms of flavor. I also got the gambas al ajillo and they were okay. I was slightly disappointed that these tasted like they had slightly turned for some reason. I'm not sure if it's the vinegar that was used to cook this (not sure if there's vinegar in this, but it had a sort of taste that made me think they use vinegar), but it had a funk at the end that didn't sit that well with me. They do use plenty of garlic, but this dish just didn't hit it home for me.  Overall, the food was good and the service was great. I sat at the bar and ordered off of their happy hour menu. Charlotte has a law against discounting alcohol so there were no drinks on the menu, but there was some food with different tier pricing. This place is on the pricey side for tapas, but portions are decent. I think the flavors across their locations are pretty consistent, which is notable as I think that's something that is pretty difficult to achieve. A solid four stars for the great ambiance, great service, and generally good food, except for the shrimp.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "v5f5bKZCyjGfKoNqU0d3Xg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Pan con tomato, Gambas al ajillo, and patatas bravas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v5f5bKZCyjGfKoNqU0d3Xg/o.jpg"
      },
      {
        "img_id": "o_v2f8n2L7a9Y5tHezH20g",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Happy hour menu (mon-fri from 5-7pm)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o_v2f8n2L7a9Y5tHezH20g/o.jpg"
      }
    ],
    "user_id": "ZUppoBswhXfab0j1RwNwgg"
  },
  "m1NRQHEdEers7AfpzBDOpw": {
    "date": "3/5/2019",
    "text": "Two of my friends and I had reservations for Bulla last Friday night. Overall, we were impressed.   I was seated immediately. My friends had been before, but I was new to Bulla. The waiter (Alexis) said hello and told me he would bring some waters and give me a tour of the menu once the others had arrived. When they did, he gave us a very thorough overview of the menu, including his personal suggestions - and why he suggested them. It was incredibly loud (as it was a Friday around 8pm) so he did his best to talk loudly without shouting. We started with a meat and cheese tray, and progressed from there.   Atmosphere - I loved the openness of Bulla. It used to be Chuy's and was almost overwhelming with all the colors and their decor... granted it is a HUGE space. Given that, Bulla did a great job opening things up. I love the high top tables mixed in, the bar in the middle, and the kitchen for viewing.   Food - like I mentioned, we started with a meat and cheese tray, which came with olives, sweet walnuts, two cheese and two meats. The waiter suggested to accompany the tray with a Spanish bruschetta, and we took it. It was SO GOOD with the cheese. We also got the tuna tartare, the ham and cheese croquettes, and an order of the cannelloni. We loved all of it, and I ate more than my fair share of the croquettes.   Drinks - pretty solid wine list! And the waiter gave a great suggestion to my friend, who had a second glass. I also had La Madrilena (twice). SO GOOD.   Service - I think our waiter was having a slight off night. He was AWESOME and SO NICE but I think it was so loud he missed a few things. We asked for a dessert he suggested, but it never came so we assumed he didn't hear. And at that point we decided no need to ask again. Same thing with the check. I don't think he was unattentive or forgot, I just think maybe he couldn't hear. I'll give him the benefit of the doubt. But this is why only 4 stars instead of 5.   I really want to come back with my husband. It is a rare tapas place you can go with just one other person, and be full and enjoy a few things without breaking the bank. But it is also a great place to go with more people.   Thanks Bulla for the great Friday night!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uCAOZSm9uOs7iT1uPIHJug"
  },
  "RbdbdasIfpuTvqqgxT4DJQ": {
    "date": "3/3/2019",
    "text": "I went here for dinner and loved it! Their vegetarian paella was very tasty and had a lot of flavor and vegetables in it. It was very filling. We also had the pimientos, which was my favorite dish-- they were tiny, flavored green peppers. I also liked the batatas bravas-- the sauce they put on it was very flavorful and just a tiny bit spicy, which tasted good with the potatoes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WP1YqGihZugMb92Y7AKRFA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Vegetarian paella",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WP1YqGihZugMb92Y7AKRFA/o.jpg"
      }
    ],
    "user_id": "A4jPuGLqJiz17m1NkA2QLQ"
  },
  "DSHd5soIbIr3snpYsUfA2Q": {
    "date": "1/1/2019",
    "text": "I absolutely love tapas so when trying to figure out somewhere to eat ahead of the Avett Brothers show I was happy Yelp led me towards Bulla.  The place was hopping when we arrived for 6:45 reservations and we were seated promptly.  We ordered a couple cocktails, the Proper Gin & Tonic and a Spanish Margarita.  If you're not a fan of licorice, don't get the G&T as there's some star anise involved but my wife loved it, including the little bottle of Fever Tree that came along side so she could mix as much or as little as she wanted.  The only downside was how long it took to get the drinks with the bar backed up as we were midway through the meal when they finally landed  In terms of food we tried a number of things,... the Tomato Bread, Manchego plate, Garlic Shrimp, Jalapeno Ceviche and Albondigas.  Yes, we were really full when we left.  The food came out quickly and was all pretty tasty.  Now, it's relative...  The tapas at Bulla is not as refined as what you would get at Curate in Asheville but then it's a chain so I'm grading on a curve and giving a definite B+.  One tip... If you don't want your server standing there running down their favorite 2-3 items from every section of the menu, just say you've been there before when you're asked if it's your first time.  It was a bit much and I'm assuming it's standard operating procedure.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 13,
      "cool": 7
    },
    "photos": [],
    "user_id": "33v8c5ftrKuDGTw1ZQ2toQ"
  },
  "dGos98xzqISdc7nYLVEdkw": {
    "date": "1/3/2019",
    "text": "Go now! Go right now!! Huge trendy venue with a massive patio, amazing food and cocktails with a killer happy hour!!   When I saw there was a Bulla in Charlotte I texted all my Miami friends with overwhelming joy. Alas- a Taste of Miami right here in North Carolina! There was one in Miami down the street from me and it was amazing - always super busy all hours of the day. I could not wait to experience the 3 course brunch tasting menu!! My husband deciding to do the same so we could try a lot at one time. Avocado toast - amazing, flat bread - so flavorful! First course down - second - Bulla huevos...Honestly- didn't love this one - the potato foam was so good but the chips weren't great - it could have used another egg too. The shredded pork with potatoes was fantastic but a little dry- if they added the potato foam on top it would be unstoppable! I should have stuck with the Bulla Benedict's. Lastly - for our last course we got the hazelnut waffles. WOW! Light fluffy waffle quarters drizzled with Nutella, toasted almonds And shaved chocolate flakes topped with the most delightful whipped cream. I could not wait to have the ricotta pancakes - I would dream about these in Miami but something wasn't nailing it at this location. There were a bit dry compared to the moist and bushy cakes I was expecting. The cocktails though- you def need to try the lavender cocktail and the sangria Blanca! I can't wait to go back for dinner and happy hour!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "OYGTEJAZaGQ41WEnOaCgoA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Sangria Blanco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OYGTEJAZaGQ41WEnOaCgoA/o.jpg"
      },
      {
        "img_id": "I9nipU9aiXAKjanA2q6XlA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Lavender cocktail",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I9nipU9aiXAKjanA2q6XlA/o.jpg"
      },
      {
        "img_id": "rHEO1MS89dbu6uycAYklkw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Hazelnut Waffles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rHEO1MS89dbu6uycAYklkw/o.jpg"
      }
    ],
    "user_id": "efIUqTt53jnyx6QlR9ehsg"
  },
  "YJJRyPW3eGbtczH6hUKS3g": {
    "date": "6/27/2018",
    "text": "This was my first time at a True Spanish Tapas restaurant. I loved the openness throughout. The ambiance is very inviting yet still private to your party at the same time.  The servers are very knowledgeable and can assist you with recommendations and questions which made ordering easy.  While you may get excited with you see six different types of queso, it's truly just the Spanish word for cheese. Not the dip that we all know and love lol.  The steak was my favorite dish. The sheshito peppers on top are not hot at all. They are actually somewhat sweet.  If you are a seafood lover you will has SEVERAL options here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "JVj_69zYnmzWnUY_U9YgSA"
  },
  "9hJqv53RSeX5FDqsntzc2w": {
    "date": "11/21/2018",
    "text": "Bottom line: If you're looking for a new restaurant to try, Bulla Gastrobar should be first on your list--absolutely worth the visit. Incredible!  We came to Bulla on a Wednesday afternoon for an early. We chose to visit given the great Yelp reviews and the fact the restaurant is within walking distance from Southpark Mall. The restaurant offers a warm and inviting ambience--perfect for everything from a casual dinner to a nice date.  From the moment we stepped inside, Alexis made us feel at home. Without prompting, he took a fair amount of time to walk us through his favorite offerings within each section of the menu. I love that he didn't hesitate to tell us which dishes we should pass up. Alexis played a big role in making our visit as good as it was, so make sure to ask for him when you visit!  We ordered the tuna tartare (although the tuna was good, the crispy wontons, diced avocados, and delicious sriracha aioli are what made this dish come alive) and the huevos bulla (an incredible medley of eggs over easy, truffle oil, potato foam, house-made potato chips, and some of the best serrano ham I've ever had) to start.  We followed these up with the salmon (Bulla tops their salmon off with a lemon sauce that really sharpens the flavors in the dish--definitely worth checking out) and the cannelloni. Bulla knocked the salmon out of the park, so I was pleasantly surprised when they blew the park out of the water with the cannelloni--what a dish! The veal and pork were excellent and the mahon cheese was delicious.  Finally, we opted for the caramel apple cocktail (for lack of a better word) and torrija to end the meal. The cocktail was good (great caramel, wonderful whipped cream), but the torrija was, like the cannelloni, game-changing (the brioche was delightfully sweet, while the nougat ice cream was simply to-die-for).  All told, Burra Gastrobar delivered one of (if not the best) dining experience I've had in the Charlotte area to date.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "C9SXbEJRPhThD5CSTXGalA"
  },
  "HyrSmQ-2O7lo-QikBSbGnA": {
    "date": "5/10/2019",
    "text": "Food is always great! Service especially Grant at the bar is always beyond helpful! Managers and chefs always around and ensuring a great experience.  I've been to every Bulla multiple times!  (coral gables, Doral, Tampa, Atlanta, Plano & winter park)  Best patio!  Most consist food and drinks And best service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7HR_ldZqiqO1dZ6ZlaasiA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Bar area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7HR_ldZqiqO1dZ6ZlaasiA/o.jpg"
      },
      {
        "img_id": "gerL_D1Gmv_lC8FjrdQOQw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Bar area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gerL_D1Gmv_lC8FjrdQOQw/o.jpg"
      },
      {
        "img_id": "pYM0Gd30KYS2BK3jQZNtjQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Bar area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pYM0Gd30KYS2BK3jQZNtjQ/o.jpg"
      }
    ],
    "user_id": "XBbJMMaKzkB0a-835_egHA"
  },
  "1QndP1YV0WveizbCGmrS6A": {
    "date": "10/25/2018",
    "text": "I've now visited Bulla for drinks, lunch, and dinner, and I can't believe how great it is every single time. I thought my first experience was just a one-off (maybe I had wine goggles? maybe my friends were super fun that night?), but no, it's literally that great every time. Great food, great service, and great atmosphere.  I'd love to recommend certain dishes, but everything I've had is good. I've done tapas dinner and split a lot of things, and I've done lunch entrees. For dinner, I will say the Huevos Bulla were a little weird just because it was like thin mashed potatoes, but the flavor was still solid. The albondigas, ham croquettes, and pintxos were amazing.   I got the pintxo y tostada de aguacate for lunch today, which is basically a super fancy way to say chicken skewers with avocado toast and onion and tomato salad. I ate every last bite and wanted to lick the bowl. The chicken was SO juicy and tender, the bread was crunchy on the edges and soft in the middle with delicious avocado, and even something as basic as tomatoes and onions were tangy. I don't even like tomatoes that much, and I ate all of them.   Speaking of Spanish words I can't pronounce, the bartender was incredibly knowledgeable about the wine list, and when I told him I usually like a pinot noir, he knew exactly what I'd like.  Do yourself a favor and get to Bulla!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "QmethzRyAvZXS9m1UNJpdw"
  },
  "7t6zVgYZ1mVO0MqZQiTipA": {
    "date": "8/18/2019",
    "text": "Great burgers! Atmosphere is wonderful! And our waitress, Grace, knew so much about the food and the menu. She is top notch, and an asset to this restaurant! Definitely will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "52xHBVVjxH9oPeyV3CvQuA"
  },
  "0Ox2IkSlJRl2VgPG3NQc9A": {
    "date": "10/2/2018",
    "text": "I patiently awaited the opening of Bulla. I heard great things about this place from a friend from Miami. I came here for a late lunch/early dinner with my mom. Fortunately, it lived up to the hype.  Some big pluses for me:  -We left full, which doesn't always happen with tapas places. I mean, we were too full for dessert full- which is saying A LOT for me. I usually need like 12 dishes at a tapas place, and left full splitting 4 with someone else.  -Service was above and beyond- even during the \"awkward time\" of day we were dining. Hostess, servers, food runners were all overly friendly and attentive -We didn't like one of our dishes. They didn't do anything wrong, we just didn't like the taste. They took the dish off of our bill- we didn't even complain. They had just asked us our opinions of each dish and we told them.  -Setting has perfect ambiance and it is very open/inviting.  -We came in at late lunch/early dinner time of day and they offered us both menus. This is so accommodating and so not normal.   Dishes:  -Albondigas- veal and beef meatballs were AWESOME! -Gambas al ajillo- yummy garlicky delicious shrimp -Pintxos- Chicken skewers with greek yogurt- also delicious! I especially loved the sauce. -Potatatas Bravas- potatoes with a sauce on it- this is the one we didn't care for. It was just the taste of the sauce which is a personal thing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "dGUOe2TBchiGvU1BNkmTog"
  },
  "X5oPcz-7ygIThTrvg20-Bw": {
    "date": "7/29/2019",
    "text": "Went for mother day this year for the first time. Amazing food and atmosphere. We got a bunch of small plates and shared the table. They even gave my mother a rose (very cute touch for Mother's Day!). The sangria",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U24Kb3mPESuNINt-vcdONw"
  },
  "W8-uJOu6U_khIvssYzlGSw": {
    "date": "12/1/2018",
    "text": "Wish I could do 4.5 for this visit.   Bulla acknowledged my review right away & made me feel as if the feedback was valued.  Given that Bulla has locations throughout Florida, Atlanta & Texas, this level of reach out was unexpected.  I agreed to return to Bulla.  From start to finish, the experience was exponentially different. From the person who had reached out about the review greeting me when we were seated to Lorenzo & Thomas being on point w/an upbeat joking attitude. Customer service was over the top & that alone would've made the overall affair 3 gold stars.  And the food - let's start w/the end as the beginning.  The Copa Bulla aka deconstructed Caramel Apple was fabulously self-indulgent.  If I worked there, I would be eating this all shift long.  It is the Caramel Apple you love to eat w/o the apple juice running down your hand w/no lack of caramel.  The CREMOSO DE CHOCOLATE aka triple layer chocolate cake as decadent as you would like it to be. W/the chip on top perfecting an already fantastic presentation.   Olives, Tetilla, & Mahon tasty together or separate.  The olives have a great flavor. Beware the company that you are enjoying this experience w/because the olives do have pits so it might not be something to order on a date as you try to gracefully place them in your napkin.  The Tetilla was so mild in flavor it is not something that should be eaten after eating the butternut squash soup or the potatoes w/garlic aioli.  The Mahon stands up to being enjoyed after any of the other tapas.   Creamy butternut squash soup was simply luscious allowing the butternut squash flavor to stand on it's own w/a simple salt & pepper preparation.  The Tuna Tartare ranked alongside any poke bowl & the only menu choice that I'd skip the next time because I eat a ton of poke bowls.  The crispy wontons were a touch bit on the more oily side so leveraging those as the silverware the taste that came thru was more the oil than the tuna & avocado.  Potato tortilla stands up all on its own.  For a female, it could be the meal unto itself.  The garlic in the aioli is subtle & not overpowering.  I'd pump up the garlic a hair since the potatoes themselves need a touch more spice or the garlic would enhance the potatoes a bit.   The kitchen ran out of hummus & forgot the crispy calamari on the ticket.  If the kitchen is running low, letting the front of the house know sooner so they can inform patrons before they place the order.   Expect to spend a minimum of $30 per person & that's w/o a beverage alcoholic or otherwise.  $40 per person gives you the opportunity to experience a full range of the small but mighty menu.  I'd go for the higher side to take advantage of being able to indulge in dessert.  My dining companion being pescatarian, allergic to shrimp & not a fan of octopus I was respectful of what she could eat. The experience overall from customer service to the meal was delightful. I look forward to enjoying some of the meat, paella & octopus dishes in the future!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z3KXVyJ2NfNC0dEo7YHzjw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Copa Bulla aka Caramel apple",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z3KXVyJ2NfNC0dEo7YHzjw/o.jpg"
      },
      {
        "img_id": "Rr6RMamEaEJnV-7rg6crEA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. 3 layer chocolate cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Rr6RMamEaEJnV-7rg6crEA/o.jpg"
      },
      {
        "img_id": "4pN6dnNTXe2xegTUNsaWVQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. 3 layer chocolate cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4pN6dnNTXe2xegTUNsaWVQ/o.jpg"
      }
    ],
    "user_id": "xqUn2yqxQRq5MrthbRb-7Q"
  },
  "yDf0WD1RfYjbFePf12CM6g": {
    "date": "11/18/2018",
    "text": "The kale salad, montaditos, and churros were phenomenal. However, I was disappointed in the pulpo a la gallega.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fDmVXxmboDwwzPp_JQmH1g",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. One churro left",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fDmVXxmboDwwzPp_JQmH1g/o.jpg"
      },
      {
        "img_id": "ryiOfjut3PEwMM7IfJ5JCw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Manchego",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ryiOfjut3PEwMM7IfJ5JCw/o.jpg"
      },
      {
        "img_id": "HXqAkS2lyq5eazTRq1NAjA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Montaditos - brisket",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HXqAkS2lyq5eazTRq1NAjA/o.jpg"
      }
    ],
    "user_id": "YscjZezxLirEjK_bK82uAw"
  },
  "SPIzRR84HAsbZduUYOMpwg": {
    "date": "6/12/2019",
    "text": "Frank is awesome!  Great recommendations!  Everything was fresh, cooked perfectly, seasoned and paired nicely and brought out promptly. Cocktails were good, flavor forward. Will return for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "grmC0x7VX57-3eFXU4Xj1Q"
  },
  "Cdz8vzjFQf7Kw5eu1JAkIg": {
    "date": "6/14/2019",
    "text": "Sangria was a big hit, we tried a ton of dishes and it was all delicious. Staff was excellent as well. No complaints from our group!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PcEsjw4yZT61UdbEMJZz2A"
  },
  "YBeQQy5kuAPtNCx-SyC3PQ": {
    "date": "5/10/2019",
    "text": "Great Spanish food but a little price which I guess is expected in this area. We started out with the cheese board which was great. Love manchego cheese. We also shared the garlic shrimp which were good but for $10 I would have liked to get a few more than 6 shrimp but they were really good and came with bread to dip in the garlic butter. The cannelloni was also very good. Rich creamy bechamel and cannelloni stuffed full of ground pork. The food was really good and I'll prob be back for a nice night out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tet2YCyLGoVqX8Zw-aoAew",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Garlic shrimp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tet2YCyLGoVqX8Zw-aoAew/o.jpg"
      },
      {
        "img_id": "o1ZvoNtRLJYQ5lYFKEIYHA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Lunch menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o1ZvoNtRLJYQ5lYFKEIYHA/o.jpg"
      },
      {
        "img_id": "NJUMvFraAjgiWEJuZa_Bng",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Cheese board",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NJUMvFraAjgiWEJuZa_Bng/o.jpg"
      }
    ],
    "user_id": "oHdCkOf9gHSMhvJd4JbVrA"
  },
  "UWxiHMa9YBTfzyemKqloAg": {
    "date": "1/12/2019",
    "text": "Tasty, tasty, tasty!!!! There have been at least two other places here since I've been in Charlotte. Neither of which felt like they fit this space.   BUT Bulla is a breath of fresh Spanish air! The Mrs. and I popped in for a brunch to fuel up before heading over to the mall and were very impressed with how they redesigned the space.   They were serving brunch when we arrived and had a good variety of meats, cheeses, tapas, a nd entrees. We shared the Albondigas (Meatballs) and Verde Salad which were both tasty. I ordered the Pollo Al Chilidron and the Mrs  had their juevos rancheros. Both were fresh and full of flavor.  Everything about our first  experience here was 5 star worthy with the exception of the service we received which I'd have to give 3.5 stars.   Absolutely worth trying and going again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "otFl9gp_7ZQxNc_oNNglEw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. So much food we had some to-go",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/otFl9gp_7ZQxNc_oNNglEw/o.jpg"
      },
      {
        "img_id": "pIZUQuPHw4K9kfL7oqrlHQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Pollo Al Chilindron",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pIZUQuPHw4K9kfL7oqrlHQ/o.jpg"
      },
      {
        "img_id": "NeGThUBjUzWLYB0gi-Uslg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Verde Salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NeGThUBjUzWLYB0gi-Uslg/o.jpg"
      }
    ],
    "user_id": "C-bX7XJMO6YcV5ZiDJ_h9w"
  },
  "PfueVTD7DtQsL4zMe7pFBQ": {
    "date": "5/19/2019",
    "text": "Update : Visited Bulla with the family for dinner and everyone loved it! Best dishes of the night were the chicken skewers (so moist, much better than the pork ones in my opinion), meatballs, garlic shrimp, kale salad (my favorite in Charlotte!), and the iberico jamon (pricey but delish!). The paella wasn't my favorite - it was good but Miro has a better one. This one wasn't as savory and lacked the crust that I love. The desserts were amazingggg! We ordered the chocolate mousse dessert, bread pudding, and seasonal cheesecake. Not a crumb left! Since this was a farewell dinner, our server Julia gave us truffles and two free lunch entree cards for when my cousins came back in town. Awesome food and service to match!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ck57GS1bIz9XiXvJZ-yUdQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Tuna Tartare",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ck57GS1bIz9XiXvJZ-yUdQ/o.jpg"
      },
      {
        "img_id": "i_QagL9i2H_YNtQr9jAWMg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Kale Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i_QagL9i2H_YNtQr9jAWMg/o.jpg"
      },
      {
        "img_id": "B79y3t0ia-hsibZH2V6iZw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Albondigas (Meatballs)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B79y3t0ia-hsibZH2V6iZw/o.jpg"
      }
    ],
    "user_id": "LHY1GpTkKpWVfrwHVubXRQ"
  },
  "CcKSSnF2k_9vBa5Kh0Zgiw": {
    "date": "12/21/2018",
    "text": "I LOVE BULLA! I read reviews that it was hard to get a table...highly recommend opendoor! We booked a table that day and were seated right away when we arrived.  First off, big fan of any dining that is an experience. The food is delicious, the staff is amazing, and I love the decor. You instantly get transported to a Spanish/Mediterranean restaurant with its high ceilings and airy decor. Our waiter recommended the rose sangria and i was so happy he did! The berries and strawberry puree are the right amount of freshness and sweet.   The menu is mostly tapas so come with an open mind and ready to share!  Big favorites:  Try the avocado/mascarpone/crunchy bread appetizer. It's the bomb.  The meatballs. YUM The pasta bravas-super filling and perfect to share   Not so faves:  The beer sangria we wanted to love but it just didn't hit the spot for us. If you're a huge beer lover I'd recommend trying it!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "eG7-aVEChsCBXDA5kUwTdw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eG7-aVEChsCBXDA5kUwTdw/o.jpg"
      }
    ],
    "user_id": "zKAhsLmkOpB3hPrwE2xmJQ"
  },
  "K4EPm3FZblbtvJsKXSIU8w": {
    "date": "2/8/2019",
    "text": "So many wonderful things to mention about Bulla, I am not sure where to start. I came on another occasion attempting to have dinner on a Saturday night without a reservation, what was I thinking? Right, so this time around I knew to arrive early and I knew to sit at the bar.  There were tables available and the manager offered to extend the happy hour menu to a table but we actually liked that the bar area sine it lent itself to the fresh air in the 70 degree weather almost mid February (the south has its perks).   Drinks were great! I started with the red sangria. I personally do not like sweet sangria, I like a little bit of a \"bite\". This was perfect. We then ordered the pork skewers or what they call \"Pintxo Moruno\", Garlic Shrimp and Albondigas (meat balls) - all were very delicious. I then had my second cocktail, the Bougie Palmer - FABULOUS!!! It is sweet but not obnoxiously so, with a tart bite and its aromatic essence is just so pleasing. We then ordered another round of food, we tried the Ham Croquettes and the Pan con Tomate. These were my personal least favorites. Most of these items for the exception of the pan contomate were on their happy hair menu. Its worth giving them all a shot honestly. My last night cap was the Spanish Margarita. This was my least favorite cocktail but was it strong! It was all enough to make for a very pleasant evening. Our bartender was very friendly.   The location is where the Southpark mall is, that said, parking can get tricky. There is no valet, so be prepared with time to look for parking. You may get luck, you may not. There is a lovely back patio area so I am looking forward to a drink or two or three ; -) in the summer!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s0eBmy_M86XiYkce_sOv6Q",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s0eBmy_M86XiYkce_sOv6Q/o.jpg"
      },
      {
        "img_id": "yCXr_llV6BVVZqyYLUqlIA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yCXr_llV6BVVZqyYLUqlIA/o.jpg"
      },
      {
        "img_id": "rgxNwzEGCeBtq2Ei4vUMAw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rgxNwzEGCeBtq2Ei4vUMAw/o.jpg"
      }
    ],
    "user_id": "k24kSTpZHUdEd-QYXLy3fQ"
  },
  "1ohBMjhQ70ExM1GHLOmbgQ": {
    "date": "8/24/2019",
    "text": "Tonight's experience was awesome. We made a reservation and were about five minutes late. We put in a special request to not be at the bar because I'm allergic to alcohol and will break out in handcuffs. To accommodate that request we had to wait a bit. The manager apologized and offered us a free tapas because of our wait. When we sat down our server Bianca was prompt, efficient, and very friendly! She made sure to notify the kitchen of a coconut allergy at our table. Another server, didn't catch her name, also came by to fill our waters frequently so we were never left waiting for anything. The teamwork among the staff makes for a good customer experience. The food was the best I've had while visiting Charlotte. Overall one of the nicest experiences I've had at a restaurant (I'm usually a good judge after working in the industry for many years). Would definitely come back the next time I am in town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YSPsDvaQxGzKteTIbgNCtQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YSPsDvaQxGzKteTIbgNCtQ/o.jpg"
      },
      {
        "img_id": "-kJ6FZj_s668WJ7-W7jN7g",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Ceviche",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-kJ6FZj_s668WJ7-W7jN7g/o.jpg"
      },
      {
        "img_id": "d_hNmWNuocxUHtIv9W5ogw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Montaditos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d_hNmWNuocxUHtIv9W5ogw/o.jpg"
      }
    ],
    "user_id": "VC-rLeVXTqt3rE1Nltzbjg"
  },
  "F4F3ip7JF_MofMkUsyq0Bg": {
    "date": "11/20/2018",
    "text": "I came here with my husband for date night to give this place another try. We had reservations at 7 and got sat at a nice table in the main dining area. Sebastian was our server and he was amazing. He was helpful and funny and was very informative and personable.   We decided with the calamari. It was much better than last time. We also got the shrimp which were delicious. My husband wanted to try the ceviche and he loved it. He said it tasted so fresh and it paired well with the shrimp. We also got the meatballs. So tender and the sauce was so good. We lastly got the chicken skewers. Very tender and the cilantro with it was delicious.   Overall, amazing experience. We can't wait to come back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "WYJA6icLpiue_IXZ4s03BQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Chicken skewers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WYJA6icLpiue_IXZ4s03BQ/o.jpg"
      },
      {
        "img_id": "PK1aVZJQ3Ihx6xg_NbAN2A",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Meatballs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PK1aVZJQ3Ihx6xg_NbAN2A/o.jpg"
      },
      {
        "img_id": "Zy3lOe4xtwUW1ey9VJwy2g",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Shrimp",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zy3lOe4xtwUW1ey9VJwy2g/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "No4iytm2cwEkHzan-RsxAA": {
    "date": "7/6/2019",
    "text": "Came here for dinner on a Friday night after moving to the area. The hostess and manager were extremely friendly and it was a great way to start the evening. Our waiter was great at the start of our meal and we ended up getting a pitcher of the Sangria Verde, which is fantastic. My wife and I split the queso fundido, Steamed Octopus and potatoes, and the special Shrimp Fritters.  The food is mediocre at best. I know the Octopus and Potatoes have extra virgin olive oil on them but it was drenched and turned into a pool on the plate. The octopus was massaged and steamed nicely but their was absolutely no flavor to the dish other than olive oil. Queso was alright but Chorizo had no flavor or spice. The shrimp fritters just had an off taste to them, almost like they were premade and reheated for when an order was placed.  Our waiter I think sensed the food wasn't hitting us right and instead of discussing it with us, decided to ignore us for about 30 minutes as we weren't ordering anything else. Not a huge deal but it's annoying to have to flag down someone else so you can get the check.  Overall, we may give them another shot in the future and would come back for the sangria, but with so many lunch and dinner options in Charlotte it's tough to pay good money for decently cooked but flavorless food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0wbtUZA5NF20Q52DzgPjQg"
  },
  "jEdBG-zqzXfiK_I_X2oJlA": {
    "date": "8/18/2019",
    "text": "I don't usually write reviews but after last nights service I absolutely had to. I was the photographer for the large wedding party and I just wanted to say that the service was absolutely amazing. Grace,Bianca and Josve were so attentive and professional, they made the entire party run smooth. Zuny was also the sweetest person I have met and I'm coming back soon because the atmosphere, food and service are unmatched. I was go grateful they treated me with such high regard. I had the salmon which was perfect and the lemon lavender drink and I can tell you it's one of the best I've ever had. From the outstanding food coming out of the kitchen to the incredible people at the front of the house you need to come here!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ql2E3AdbSZPxqdKdV1gUzw"
  },
  "6O0MO0BJBuBMWXoVQ6IeUg": {
    "date": "4/29/2019",
    "text": "We stopped here for a quick snack after running errands at South Park. I saw on the website they had happy hour specials 5-7 so we decided to give it a try.  Apparently they have drink specials mon-Wednesday but we went on a Friday and they had specials on select tapas. I had the red sangria which was great. We tried the croquettes, queso and patatas bravas. Overall, the food was mediocre. But we did enjoy the patatas bravas, the sauces on it made the dish. The restaurant has outdoor seating that opens up to the inside which would be nice on a warm day.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jJmOU87TDILJetbOTS1f0g",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Patatas bravas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jJmOU87TDILJetbOTS1f0g/o.jpg"
      },
      {
        "img_id": "HXbkZBv0qYMyzbcoxAVZaQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Red sangria",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HXbkZBv0qYMyzbcoxAVZaQ/o.jpg"
      },
      {
        "img_id": "tjl4hLDMctKN9Q3bZihk4A",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Croquettes and queso",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tjl4hLDMctKN9Q3bZihk4A/o.jpg"
      }
    ],
    "user_id": "CuPrkCEfdsO1S4kBoL7HaQ"
  },
  "4Xkd3q_uBDTFT9k43HzeHg": {
    "date": "11/18/2018",
    "text": "Consistently good. We've been to Bulla a few times now, sometimes with small groups, sometimes with kids and each time the experience has been great.  Warm yet lively ambiance, good service and always good food. The menu is extensive with a good variety of vegetarian and meaty options. My favorites include the meat & cheese platter, among the small plates I like the garlic shrimp, hue is bulla and potato tortilla. I preferred the vegetarian paella to the seafood one; I thought the salt levels were quite high in the seafood one!  The desserts are delicious too.. if you like coconuts, have the coconut flan with the passion fruit sorbet. And not to forget, the cocktails. Some good options on the drink menu as well! Their Sunday brunch menu is also worth checking out. I'd recommend making reservations since they're pretty busy most days! And finally, it's pronounced boo-ya :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MqVEbImMF6jYybA48_cufw"
  },
  "5e6x70Pp94V8hQGNd70Bsg": {
    "date": "8/12/2019",
    "text": "I've been here twice now. Both times have been consistent with the following review. Servers are knowledgeable and excellent. They will recommend to the best of their ability and are very attentive. Managers are also very attentive. The liquor drinks are awesome. There is a gin cocktail with cucumber which I highly recommend. The food isn't great. I've had calamari, grilled octopus, vegetables, salmon, and quite a bit more in fact. Calamari and octopus were incredibly \"chewy\" (yes I know that is usually the case but this was more of a rubber texture). Salmon was slightly over cooked. Vegetables weren't anything to write home about.  If there was a way to give 2.5 stars I would. Location is great, but maybe just go here for drinks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "456NVsgLcRKUyut6dDObNA"
  },
  "4KTP1hnwvo_xRJppFtCaiA": {
    "date": "10/15/2018",
    "text": "Fresh. Spanish. Laidback. Cozy.  We went with our date night friends to Bulla and had an amazing experience. Our waiter, Sebastian, was so educated on the menu and gave us many suggestions... We pretty much tried one of everything and I don't think a single thing we had was a let down. We took our time making our way through the entire menu and we are really looking forward to revisiting.  The wine was excellent. The cocktails were delicious. The food was colorful, authentic and yummy.  I'd never had some of the things we tried so it was nice to have suggestions and knowledge from our server that helped us make sure we experienced the best they had to offer.  Thanks Bulla for being new and creative!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_MQCHNBSX0LSBMTcPAJiPQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_MQCHNBSX0LSBMTcPAJiPQ/o.jpg"
      },
      {
        "img_id": "shnhI4lJOs4YczHf2Re24A",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/shnhI4lJOs4YczHf2Re24A/o.jpg"
      },
      {
        "img_id": "4kUU1YGtUbr-8C255kkcmw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4kUU1YGtUbr-8C255kkcmw/o.jpg"
      }
    ],
    "user_id": "S_CeIOGlUspN3FIP028CcA"
  },
  "4Y8x54PjtlLLHN-7ILuusQ": {
    "date": "11/13/2018",
    "text": "We were impressed with our visit to Bulla. We came for the paella but also ordered the montaditos and the patatas bravas as we waited for our entree. The montaditos = WOW and the patatas were delicious too. The paella was decent, it just lacked something to take it over the top.   Our server Matthew was extremely friendly, attentive and personable. His recommendations for appetizers were spot on! We enjoyed our first experience here and we will be back to try some other tapas.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dUX5-huVec3Kcqd6uqyQ2A",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Patatas bravas &amp;amp; montaditos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dUX5-huVec3Kcqd6uqyQ2A/o.jpg"
      },
      {
        "img_id": "BOwr5Dv6xjFvj0PjcwoG4g",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Paella",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BOwr5Dv6xjFvj0PjcwoG4g/o.jpg"
      }
    ],
    "user_id": "CgG6X3k3DGSL2RR3ekzfsA"
  },
  "t-pqRrj9sfC-ICl9LgNLAQ": {
    "date": "3/6/2019",
    "text": "Stopped by for dinner after running errands on a Monday night. The place was deserted. We had a lovely low key dinner of potato-heavy tapas and paella. It was delish and I am already craving a return visit.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uynqJd5BkGuwjqSqtaBquQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Ham croquets, really potato croquets with bits of ham mixed in. Fig sauce was drinkable!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uynqJd5BkGuwjqSqtaBquQ/o.jpg"
      },
      {
        "img_id": "iXDdnk05p4nmHkFw2Odtng",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Cute doggy bag",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iXDdnk05p4nmHkFw2Odtng/o.jpg"
      },
      {
        "img_id": "zdbJ5d2ZiOlqYop-dB6BDg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Paprika-laden pulpo (octopus--and potatoes of course)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zdbJ5d2ZiOlqYop-dB6BDg/o.jpg"
      }
    ],
    "user_id": "eqtEDyqn1kCXwlo2OKdW_Q"
  },
  "fNQIftrny1t1o4f2s95W0g": {
    "date": "8/11/2019",
    "text": "One of our favorite places in Charlotte. Brunch is awesome! So many options. Never had a bad dish here. Service is great, atmosphere perfect!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mttwOK0A2n1cP12E5yyI1w"
  },
  "LuVYE2EwLGgnEzENdH-UPg": {
    "date": "6/11/2019",
    "text": "What's not to love about Spanish tapas?! This place delivers on your traditional Spanish tapas and has some clever unique dishes. The service is top notch and the ambience is perfect. Parking is always a pain in this particular area, but you can always park at the mall and walk over. Can't wait to come back again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oZNiC_iSQWiorPlK6u-wUA"
  },
  "Lc3yPLHZAgwRj0Gmt8XUsQ": {
    "date": "3/4/2019",
    "text": "I was pleased with our recent visit to Bulla Gastrobar. We were able to get a reservation pretty last minute, and the service was excellent.  I thought the food was pretty good, although having lived in Spain previously, I'm a tough customer to please. The chef's meat and cheese board was one of the highlights, so I definitely recommend ordering one or more of those for the table! Some of the other traditional Spanish dishes didn't wow me, but Goose thought his Albondigas were excellent. We didn't delve into the wine menu, but my Sangria Roja was perfection.  I really liked the vibe of Bulla. It's an open layout with a mix of traditional and modern decor. They have  a really cool exposed bar and kitchen, so you are in the heat of the action. It would be a cool place to hang out for a drink and a couple of bites!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hh1M-3aDJZVTwwYYy9AnA"
  },
  "tO3X8kKl2pdZ6ekY1xxgCQ": {
    "date": "6/6/2019",
    "text": "So, I guess I wasn't a huge fan... I was really excited to go to Bulla.. Spanish cuisine is one of my favorite and I was hoping it was traditional... it wasn't. The starters wer",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WzbiAVIgM4RCuEqNoS1Wcw"
  },
  "YTWi_aGjKgNBCVWLAfXNCA": {
    "date": "6/6/2019",
    "text": "Stop by the place to waste some time as me and girlfriend were trying to catch up and  awaiting the rest of our party for dinner later. I have always heard about this place but never had the opportunity to step in. I was excited to at least get a taste of the place so that I know what I am walking into next time. It was the perfect day to do so apparently because it was international paella day mixed in with the normal Wednesday special of red sangria being $5. Our server Alexis gave us a very in depth tour of the menu and I must say it was a lottt. He did a very good job and was very descriptive but it was just a bit much to process at the time especially being that we barely glanced at the menu. My friend ended up ordering the sangria while I ordered the Spanish margarita just to say I tried something different. The drinks are just the way I like them giving every bang for your buck! It wasn't too harsh but it wasn't too sweet and can see that being my signature next time I visit.  They also had a tasting of paella that was prepared fresh in the outdoor area in honor of the holiday and even that small bite was seasoned just right. Alexis did convince us to get the Murcia al vino, which is a cheese sample that had some type of sweet sauce to it and a side of what I think were pecans. We tried each item individually and then tried all three together and I must say I now see why he recommended it. I must say I am truly excited to try this place again especially with the trendy ambiance it has more than likely it will be before the summer ends",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7Q9VicpRBwJrqIpyHzZBNQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Dinner menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7Q9VicpRBwJrqIpyHzZBNQ/o.jpg"
      },
      {
        "img_id": "Ae9Xa9-ZfDG2TS-zlN3faw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ae9Xa9-ZfDG2TS-zlN3faw/o.jpg"
      },
      {
        "img_id": "AilI-qjJZuFaVC5bNfBkEw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Murcia al vino",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AilI-qjJZuFaVC5bNfBkEw/o.jpg"
      }
    ],
    "user_id": "ayVBf253VsV2Es7tD-rgug"
  },
  "pSwElCHtYl1MGuzynfeLDw": {
    "date": "7/13/2018",
    "text": "Absolutely loved our experience at Bulla.  Such gorgeous interiors and so sophisticated - way better than what used to occupy the spot next to Cowfish.  We went here for a girls night and split all of the following:  red sangria, manchego (even if you order just one cheese, the bring out a plate with crackers, some type of jam and these glazed nuts), pan con tomate (so simple and so amazing), montaditos (these were smaller than expected but really good flavor, just wish there were more!), calamari (not too heavy, perfectly crisp), and the huevos de bulla (OMG these sound very strange but this was everyone's favorite at the table, would also be the ultimate hangover cure at their brunch.  It's basically their take on nachos maybe? fried housemade chips, jamon - texture of proscuitto, fried eggs and truffle aioli.  holy moly it was so good!).  We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VdFPapSzzjrQMWyunl7qZw"
  },
  "Blz1p4rcpg2p5HOtzos8JA": {
    "date": "9/30/2018",
    "text": "This was our second and final visit.  The food was disappointing for the $$$$!  We went in early August and thought their paella was some of the best we have had all over the world.  The appetizers were disappointing and it took them 30 minutes to bring them out!  We waited the same time for a bottle of Cava.  We were quite specific about not leaving our paella under the lights while we finished the appetizer.  Too bad for us that we didn't just get up and leave.  The waiter was too busy chatting up the table behind us and acted like he was on meth or coke.  I asked to see the manager who apologized and brought us 3 meatballs - big deal!  The Serrano ham was $15 for the smallest portion I have ever seen.  We brought one of our best friends there to experience this??? Our appetizers should have been comped!  Oh well, I know 6 couples I referred there that won't be going!  Best clean up ur act, Bulla!  You will clearly be going the same way of ur predecessor in the same space.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gsPIakiKC8TL0pxgrxClTQ"
  },
  "-aLd1qIIDDoeIOLi7x4_ew": {
    "date": "8/28/2019",
    "text": "Since the weather has finally cooled a bit, it was an excellent opportunity to enjoy dinner outside on the great patio at Bulla. Walking through the inside to get outside, it's nice to know that even on a hot, cold, or rainy day, the interior is nicely decorated and there is an enjoyable atmosphere.   My friend and I shared 3 small plate tapas, which was plenty for us. We enjoyed the canneloni (incredible, cheesy, and rich), the stuffed dates (delicious), and the steamed octopus (traditional, lacks flavor).   I started with a cocktail - the Spanish Margarita. It was good, but decided I wanted to switch to wine during the food time. I asked the server for a recommendation for a wine lighter in texture, bolder on flavor. He knew what to recommend right away and he did an excellent job. During dessert, I enjoyed the Spanish licor cuarenta y tres, which was an excellent pairing with our torjillas. Highly recommend this dessert for up to 4 people.   Service was spot on. Our server was very polite, well spoken, attentive when needed, and knowledgeable. The manager also came by to check on us and I enjoyed our short dialogue.   Prices appropriate, good food, great service, excellent ambiance. A win all around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ir8HD2v8YoL-bZfP8y7B0A"
  },
  "27LXqQtXBIlup67VZMa50Q": {
    "date": "8/27/2019",
    "text": "We had a memorable tapas style brunch at this location recently and I can't wait to go back.   The selections: Chef's board - delicious selection of meats and cheeses that the waiter happily explained to us. There was also an impressive amount of olives.   Ham croquettes - creamy interior, solid choice. Patas Bravas - came out smothered in a yummy sauce.  Albondigas - these were always going to be a favorite, meatballs covered in sauce and cheese.  Tuna tartar - I enjoyed this dish with a well balanced citrus component. Everything blended together really well, and there was a sauce on the side for extra flavor.  Potato Tortilla - my fiance this dish and I have never been impressed until I had it here. Amazing! It was my favorite dish of the brunch which was even more impressive considering the humble components.   The service and atmosphere were also outstanding. I am already excited to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wbvjiDpw0FoZDeqbzAIcDQ"
  },
  "PsaDrk_kJciocTdxzCS-oA": {
    "date": "8/23/2019",
    "text": "This is definitely one of my favorite restaurants now that I finally tried it. Loved the atmosphere, ambiance and service. The food was also something to mention.   We ordered six small plates and handsdown agreed the canelones were the best thing we ate. The red sangria was one of the best I've ever had. My husband ordered Juicy Jay and was brought the wrong beer twice. He told them they must had mixed up the tap and they realized that is what had happened. Finally, the 3rd beer was correct. No problems there.  My only disappointment and complaint is that we asked the waiter if we could use the free Yelp coupon for the churros in combination with the Yelp $10 off offer, even showed him the offers and he said yes. So we ordered them right then, but was charged $8. He said he would take it off, but only took off $3 and some change. That was really wrong! If you don't want to take your own coupons then don't offer them.   Yelpers beware. I really enjoyed the dinner and will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8H337Z8cXZbB2r45PiigrA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Meatballs..good",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8H337Z8cXZbB2r45PiigrA/o.jpg"
      },
      {
        "img_id": "C2UpQYM3VEQRAuA1Uo2xAw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Octopus &amp;amp; potatoes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C2UpQYM3VEQRAuA1Uo2xAw/o.jpg"
      },
      {
        "img_id": "kZIUQwhP8RxJfX7d1-VdBg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Montaditos-ok, Patatas bravas (not good) and canelones (right)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kZIUQwhP8RxJfX7d1-VdBg/o.jpg"
      }
    ],
    "user_id": "1T4L-307j6UuGLHObfJ5xg"
  },
  "Gl-wlyn-g4MY0COmBREOew": {
    "date": "6/21/2019",
    "text": "Went again today at lunch - and was surprised by their prixe fixe lunch menu. For $18 you can get 3 courses which are HUGE and filling. Added bonus: almost always no wait at lunch.   This spot has one of the best outdoor patios in town that will make you want to take a 2 hour lunch. The rose sangria is crave-ably good. Park in the parking deck by the mall and walk over, don't even bother trying to park out front.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_pOEDJODvaBQwr_KMdG0LQ"
  },
  "1DLt6U_z8Tow4pfexZl8wA": {
    "date": "8/5/2019",
    "text": "Yummy food and friendly staff. Came here for dinner/happy hour with a friend at the bar and enjoyed the happy hour drink specials and menu. Definitely recommend the garlic shrimp! The queso looked like the top of lasagna and was delicious. The bartenders took good care of us and we definitely enjoyed ourselves with them cracking jokes and being silly. Great spot to try several dishes and share with friends/family.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fPxE0VgahKU0Xh6YQt2-Kw"
  },
  "4AP9Kv-Z0Oh3NdL8ywOjaA": {
    "date": "8/24/2019",
    "text": "The brunch menu at Bulla's is not like any other in Charlotte. The Spanish inspired recipes add a spicy kick and unexpected texture to the most important meal of the day. I really appreciated and enjoyed slurping the garbanzo frito this chilly afternoon; it's a warm stew like dish topped off with a poached egg. For a more familiar breakfast staple, order the revuelto lucio, a perfectly seasoned scramble with lots of shrimp and oyster mushrooms.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pSjNABTPc1m4ZEzhefjuoQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Brunch menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pSjNABTPc1m4ZEzhefjuoQ/o.jpg"
      }
    ],
    "user_id": "fvj9dV4e6Fu5T5tM98dCVQ"
  },
  "zd4kwMClbKipgnqKna_KyQ": {
    "date": "5/26/2019",
    "text": "I had never even heard of this place before. I was originally going to The Cowfish for dinner, but after hearing there was an almost 2 hour wait I had to scramble to find something else. Then there it was, a restaurant right next door with no wait. My family got a table right away, close to the kitchen. The atmosphere was very intimate and cozy with low lighting. I would definitely say this is more upscale than The Cowfish, but not so upscale jackets are required. Our waiter was extremely nice and did an amazing job of explaining all of the Spanish food I was unfamiliar with. We decided to do a mix of small plates and a large entree so we wouldn't leave hungry.  We started with the meat and cheese board which was fantastic. The cheese was a little strong for my taste, but the chutney balanced out the flavors and I fell in love with it. The olives had pits in them, but they were delicious so it didn't stop me. We also ordered the montaditos and pan con tomate which were fantastic as well. The chicken skewers were also something we split, and were gone quickly. The garlic shrimp my dad ordered was a nice little surprise, and the bread was delicious dipped in the flavored oil the shrimp had been cooked in.  While we had so many small plates to sample on, I wanted to get a large plate to finish. I went with the churrasco which was absolutely fantastic. The cheese grits were a perfect pairing with the skirt steak and sauteed vegetables. I could barely finish it, but it was worth it.  While this place is definitely more expensive than the Cowfish right beside it, the experience, atmosphere, and food is definitely worth the price. I would suggest Bulla for a nice date or something special to celebrate. I look forward to visiting again in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QBE2mDmJ4KB-1gmE9rgMnA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Churrasco",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QBE2mDmJ4KB-1gmE9rgMnA/o.jpg"
      },
      {
        "img_id": "OTvmb9iUBS_ySOmRVFBuPg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Salmon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OTvmb9iUBS_ySOmRVFBuPg/o.jpg"
      },
      {
        "img_id": "5PihkmE5BmmhCVsiS__WPQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Bistro Steak",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5PihkmE5BmmhCVsiS__WPQ/o.jpg"
      }
    ],
    "user_id": "chZwdGspJz5_xmm9dQnBkQ"
  },
  "vNYrOtCD6kKDY4lCQ5SX2Q": {
    "date": "7/28/2019",
    "text": "Went there on father's day, Sunday evening. Read alot of great reviews so decided to give a shot. Overall not bad.  The place is nice inside, center stage bar, comfortable booths. Beautiful patio section. Food was to die for, incredibly delicious and great presentation. A good wine selection and obviously a well stocked bar from jack to blue label. My two complaints are service and price. Now the price I understand you go in to expecting to be high, but for the portions you got here it's a little ridiculous. Service  was ok, we had the bartender as our waitress so that could of been some of the issue. But overall the if you are in Charlotte  you must come here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "26hi1Z7o_t0BQzYvYa7Bog",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Bar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/26hi1Z7o_t0BQzYvYa7Bog/o.jpg"
      },
      {
        "img_id": "a60Zwcd7j3SkKgRjiZOfpw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a60Zwcd7j3SkKgRjiZOfpw/o.jpg"
      },
      {
        "img_id": "olJqW7PQhjNsEu8jV3-qYQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Appetizers with brisket beef.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/olJqW7PQhjNsEu8jV3-qYQ/o.jpg"
      }
    ],
    "user_id": "QwyRFWdZ1d6nlb-Y5mjqZg"
  },
  "8l7h3Gw4icr8ohH4WJiX7Q": {
    "date": "7/16/2019",
    "text": "If you are in the South Park area looking for a good spot to have a good make don't hesitate in trying this place out. Honestly our waiter, Grant. Made a huge difference. He knew about all our dishes and brought everything at the right moment. He was super friendly and I loved the fact that he knew what he was talking about. I've been to different bulla locations and this one has been the best location. Portions are great and flavor is great too. My fave was the sauted garlic shrimp. The charcuterie board olive are also fabulous. The burger is a must so definitely order it. Check this place out and you won't regret it!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1H77lrUbid4NDHfPMTC3Rw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1H77lrUbid4NDHfPMTC3Rw/o.jpg"
      },
      {
        "img_id": "kRzLXJ1Lz1BVQQhdlBx0xQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Chefs board",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kRzLXJ1Lz1BVQQhdlBx0xQ/o.jpg"
      },
      {
        "img_id": "sWcAIE76OqTcihReFR6fXg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Patatas bravas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sWcAIE76OqTcihReFR6fXg/o.jpg"
      }
    ],
    "user_id": "Hzey8RHLqH3jMDhzzyPvyw"
  },
  "7Ug1L6GyM6DK2qKwNf7-Aw": {
    "date": "4/14/2019",
    "text": "Great staff, manager, food, drinks! I was so impressed and thankful that Bulla took over the old Chuy's spot in SouthPark. We came in for Paella and now my search for the best Paella in Charlotte is over! It had just the right rice crunch and just the right amount of seafood that I managed to get the perfect bite every time.  Service was great and the manager stopped by just to check in and chat a bit.  They also have a really balanced happy hour menu that you could surely satisfy your taste buds with.  So go and enjoy, tell them I sent ya!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u3TMKQ9VlqGXdH89kzGh0w",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Weekly drink specials",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u3TMKQ9VlqGXdH89kzGh0w/o.jpg"
      },
      {
        "img_id": "tX_3RjH5qP8SLwE5_gnBCw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Happy hour menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tX_3RjH5qP8SLwE5_gnBCw/o.jpg"
      },
      {
        "img_id": "YQIW-bSdCIw6-YYIVEO_FQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Seafood Paella",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YQIW-bSdCIw6-YYIVEO_FQ/o.jpg"
      }
    ],
    "user_id": "lGs3VHkhDkoR1Jh0dv443w"
  },
  "BPf46azVA6RNh05GwpNv4A": {
    "date": "3/28/2019",
    "text": "The wait for 2 was long even though we had a reservation. The manager did speak with us and apologized so that made it better.  The food and service was awesome. We tried majority of the food and drinks the server recommended to us.   The food came out pretty fast. We ended up getting a free tapas dish because it was sent to us by error. That was definitely a plus!   The restaurant was clean and very nice. I cannot wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "BdQRZjei9sGEfyxnbXncRg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Great menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BdQRZjei9sGEfyxnbXncRg/o.jpg"
      }
    ],
    "user_id": "kX-oTXuluTVcIcNVT4g3Pg"
  },
  "KkAoW7-Wzoq4hJyY4ewI7w": {
    "date": "3/27/2019",
    "text": "I had the most incredible first experience at Bulla! And for those that are having a little bit of a hard time saying it correctly... it's BOO-YA! I love it !  I enjoyed lunch with two friends from work and also received a tour of the space for future events. The manager Richard was such a joy and really took his time explaining the details of the venue. He also shared insight about Bulla and its history as well as the history of the Charlotte location.  When walking inside the decor really caught my eye. The mixture of color, texture, shapes, and sizes worked really well together, and the bright yellow and blue reflected well with the sun that day.  As the weather starts to warm here in the QC, I can wait to enjoy lunch and cocktails on the huge patio! He also shared they would host Paella Day here for what he's hoping to be 500 guests! So this should be an enjoyable place and certainly a must on my summer cocktails and appetizers list!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "rFe8Bz-CneywAL10KKLdvg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rFe8Bz-CneywAL10KKLdvg/o.jpg"
      },
      {
        "img_id": "H7xeMAAll5o9RlOuWK83Pw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/H7xeMAAll5o9RlOuWK83Pw/o.jpg"
      },
      {
        "img_id": "txkj0-H5x3HTnK07EzzXCA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/txkj0-H5x3HTnK07EzzXCA/o.jpg"
      }
    ],
    "user_id": "bEs1d3_QBUoQB_AjTP-28w"
  },
  "-lijuX8DsjZdca6mKnOTGQ": {
    "date": "7/14/2019",
    "text": "Came for the food, left with a great experience!  Bulla was the perfect spot for a girls night out. I came on a Saturday night with 3 of my girlfriends. We stalked the menu and looked at photos before hand because we are millennials, duh   We had a hard time deciding to split a bottle of wine or a pitcher of sangria, but after much deliberation we went with a bottle of Sauvignon Blanc. The wine was fine. We were expecting our waiter to do the traditional pour a bit in a glass, and one person sips and accepts for the table, but this didn't happen. No big deal though.   We each ordered two tapas. We enjoyed the garlic shrimp which came with bread but the oil I assume you were supposed to dip  the bread in, didn't have much flavor.   The shrimp were great and the ends were already off so you could enjoy without Having to do much work.   We compared Bulla to Barcelona, as their menus are similar.  Bulla impressed us more food wise, but compared to Barcelona, we found the wine and the asthetics to be a bit more pleasing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nTqwrmwnWxX6XGUCoJ27XQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Garlic shrimp",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nTqwrmwnWxX6XGUCoJ27XQ/o.jpg"
      },
      {
        "img_id": "JzRe9fXKNRq-2RO6sOAyKw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Gazpacho- very fresh and delicious",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JzRe9fXKNRq-2RO6sOAyKw/o.jpg"
      },
      {
        "img_id": "LJeM8cA_mxZyikGra3tSRg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Sauvignon Blanc",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LJeM8cA_mxZyikGra3tSRg/o.jpg"
      }
    ],
    "user_id": "K0LdtNqweb1KYJBiHyemcA"
  },
  "mDs0Cx76jRPVurgbTHvYFg": {
    "date": "3/27/2019",
    "text": "I'm in Charlotte on a little vacay, so I've been getting my restaurant recommendations from Yelp and from friends. When trying to decide today's late lunch/early dinner (or, as I like to jokingly call it, \"dunch\"), I came across the great Yelp reviews for Bulla Gastrobar.  I've been to Spain (and I've been to Tapas bars in Cali), so I was excited to try this out! It's very close to my hotel. However, I could not for the life of me figure out how to get to it! This is truly due to my being an out-of-towner! I ended up parking at the Crate & Barrel and walking over to the restaurant.  It was nearly 3pm when I arrived, so it wasn't too busy. Today happens to be National Paella Day, so the staff was preparing a little for the evening's shenanigans. I may have to sneak back over there tonight and try their Paella and Sangria!  I ordered from the Prix Fixe lunch menu and it was delish! I ordered the Spinach Salad and Bulla Burger, as well as a glass of 2016 vintage Emilio Moro Ribera del Duero. I don't think there was a single piece of spinach on my salad, however it was delicious nonetheless! I had my burger cooked to the chef's liking (I almost always choose to have things cooked the way the chef would like them prepared). My burger came with a side of patatas bravas.  I. Ate. Everything. Every last little bite! I don't think I'll ever have to eat again! I was completely stuffed! It was so good though, that I could waste a morsel! I'll definitely be back and I even recommended the restaurant to my ex-husband!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gI5QP9SG2uWaQ24Gg8jGqA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Salad (part of the Prix Fixe Lunch Menu)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gI5QP9SG2uWaQ24Gg8jGqA/o.jpg"
      },
      {
        "img_id": "1KLPpvCMN_v7mUBVteDd5Q",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Bulla Burger &amp;amp; Patatas Bravas (part of the Prix Fixe Lunch Menu)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1KLPpvCMN_v7mUBVteDd5Q/o.jpg"
      },
      {
        "img_id": "OtB2r6oDNBjeD9yrm-WKqg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Emilio Moro Ribera del Duero, 2016",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OtB2r6oDNBjeD9yrm-WKqg/o.jpg"
      }
    ],
    "user_id": "7dZmQVzcDfvHWhuWl0g3UQ"
  },
  "wK43MRiaE7tJQKcMUOKrfw": {
    "date": "3/12/2019",
    "text": "A group of four of us checked out Bulla Gastrobar this past Saturday. Absolutely delish meal!   We started off with drinks. I noticed they had a few different types of Sangria. I got the red sangria and it was very tasty and not too sweet. Later on I got that Bullfighter, which was a nice mix of flavors. Another in our group got the Boujie Palmer....super fun to say and very good!  Throughout the night, we had alot of tapas. I thought the tapas were priced and portioned very nicely: -Lomo Iberico- nicely sliced pork! -Patatas bravas- The sauce on the potatoes was soooo delish! -Canneloni- Crowd winner at the table! Definitely had a strong truffle oil flavor but no complaints here! -Gambas al Ajillo- Very large shrimp in garlic and butter. Simple and done nicely. -Albondigas- These meatballs were a perfect mixture of veal, pork, and cheese -Montaditos- Brisket on pieces of bread. Another crowd winner! -Tartar de Atun- Amazing flavors!!! One of my personal faves! -Croquettas de Jamon- Nicely portion but not one of my favorites of the night  Definitely want to go back to get the paella! Service was fantastic! Win all the round!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7jTFxAJ2GPnYQE2oqO7qvA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Lomo iberico",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7jTFxAJ2GPnYQE2oqO7qvA/o.jpg"
      },
      {
        "img_id": "NP874eioVvOXnixARpU4Vg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Patatas bravas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NP874eioVvOXnixARpU4Vg/o.jpg"
      },
      {
        "img_id": "O2xrKLgMx-45ZlvvxJbTdQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Queso fundido",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O2xrKLgMx-45ZlvvxJbTdQ/o.jpg"
      }
    ],
    "user_id": "Hw5riZfnB-B7G79vBTOssA"
  },
  "4yjtWcqegSOXbrhIV5teSw": {
    "date": "2/23/2019",
    "text": "Bulla is a newer restaurant to Charlotte and I have been here quite a bit. There were things I liked and things I didn't. It was a love hate relationship between us. I went back this last time and had an overall good experience which brings me to settle on the four stars.   The new management seem to care a lot about their customers. There were some one it first opened that didn't share the same sentiment. I'm glad they found people who do. Some of the servers that were originally there have been replaced. Some are still there from the beginning.   I found what I like on the menu and like to stick to it. Fortunately those items have remained consistent. I love the burger, pan con tomate, and tuna.   I hope that this place is here to stay & just continues to be good. When I went on a Friday night LAST time w/ reservations at 7PM, I had no wait. I think they may have got the wait situation down and under control. Fingers crossed!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "oIL90SHCXnB6PatXFT04OQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oIL90SHCXnB6PatXFT04OQ/o.jpg"
      },
      {
        "img_id": "GOq-0upa-Kg98dNq0lgjTw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GOq-0upa-Kg98dNq0lgjTw/o.jpg"
      },
      {
        "img_id": "brjqKFzM4hdZdDHfq83VQw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/brjqKFzM4hdZdDHfq83VQw/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "9KXqJ9yY2rMWv1nB-UgHtA": {
    "date": "6/5/2019",
    "text": "I love, love, love spanish cuisine, and tapas are a huge reason why. If it's your first time here, you'll get a quick rundown by the server on how it works. Basically, you share smaller-sized plates (these weren't very small, imo) with the whole table, and food comes out as soon as it's ready.   Our server, I believe his name was Jose, was super awesome. We got there at 6:45, and weren't seated at the bar, but were still given happy hour menus when we inquired about them. I highly recommend going during happy hour, 5-7 everyday, if possible. There are meat and cheese boards as well as a decent selection of their tapas from the main menu that are discounted. Otherwise, it's kinda pricey.   Food: The 2 of us were hungry so we split 5 tapas. It was enough to fill us up comfortably. I would suggest ordering one or more of the larger plates if coming with a bigger group.  - sauteed garlic shrimp: about 6 shrimp sauteed in a generous amount of butter and garlic. They came with a side of delicious, warm baguette.  - pimientos de padron: A simple dish, but tasty. I've never had blistered shishito peppers before. They have a wonderful smokey roasted flavor and sort of just dissolve in your mouth.  - patatas bravas: fried potato cubes smothered in a supposedly spicy but decidedly bland garlic aioli. It looked a lot better than it tasted. It didn't taste bad; the aioli added a nice creamy texture. My dining companion said this was her favorite, but I wouldn't necessarily recommend it unless you really love potatoes.   - kale salad: my personal favorite dish of the night and among the most memorable kale salads I've had (even though it comes with beets, which I despise). The kale is topped with barley and goat cheese, and tossed with a delightful lemon maple dressing. Not recommended for people who don't like sweeter dressings.  - albondigas: 3 veal and pork meatballs topped with finely shredded manchego and sitting atop a savory and flavorful tomato sauce.   Cocktail: I came on a day where they had select cocktails for $7. I got the lemongrass collins, an herby and refreshing drink, though not very alcoholic.  Ambience: it's southpark, so it was classy and well-decorated. The vibe is pretty laid-back.  Overall, Bulla isn't quite the same caliber as places I've been to in Europe, but for Charlotte, it's pretty darn good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pHpOJkgpOa89RZXbsxZt1A",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Garlic shrimp",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pHpOJkgpOa89RZXbsxZt1A/o.jpg"
      },
      {
        "img_id": "wBQjKRRIA9YOgaMBlTtvsw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Lemongrass collins",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wBQjKRRIA9YOgaMBlTtvsw/o.jpg"
      },
      {
        "img_id": "oGPguV0NnzXS48TBQqYPcA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Patatas bravas, blistered shishitos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oGPguV0NnzXS48TBQqYPcA/o.jpg"
      }
    ],
    "user_id": "TwCXV8ysdtRMEBU1gsOdUA"
  },
  "CGeWIrcNDNtp1ptbiZnLgQ": {
    "date": "7/31/2019",
    "text": "Sit at the bar. Enjoy the tapas. Talk to the staff. Laugh your ass off. This place is fabulous. GrB the Fred churros coupon. I did.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "n1ElB7O-GIQCqADFU1aXuA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n1ElB7O-GIQCqADFU1aXuA/o.jpg"
      }
    ],
    "user_id": "5K-Ms2PYTnnKRet50acQtg"
  },
  "gXCCs9rApe_0ZgQSuBMPDA": {
    "date": "8/10/2019",
    "text": "Atmosphere is really laid back. Decor is really nice. The ham croquettes was great! The verde salad was amazing.  The garlic shrimp could have had mor season but was cooked great. Finally the paella was good also the shrimp was over cooked but was still good. The cremoso de chocolate was the best thing we had!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mfTwMTYc0uZMvbhGbX5KbQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mfTwMTYc0uZMvbhGbX5KbQ/o.jpg"
      }
    ],
    "user_id": "8Bo8JLskbSm1_2px6pygFQ"
  },
  "1-SN8A9Pv7qkpCurEN3vxg": {
    "date": "5/22/2019",
    "text": "As big fans of Spanish cuisine, Bulla was a pleasant surprise to stumble upon while in the area. We were visiting Charlotte and had our dog with us, so it was nice to find a shaded, dog-friendly patio to pass the time on a warm day.  All of the staff we encountered were incredibly friendly and outgoing. The bartender even came over to show us photos of his two chihuahuas and talk about dogs for a few minutes after seeing our little one! The atmosphere was cavernous, but inviting. It was during that weird time between lunch and dinner, so the mostly-empty space seemed massive inside, but the patio was gorgeous. Tons of shaded seating, and enough greenery between the restaurant and the road to make it a relaxing environment to enjoy a meal.  The menu has a lot of traditional Spanish dishes, which was nice to see. Their pan con tomate was a little heavy on the tomato topping, resembling an Italian bruschetta more than the lightly-covered version we're used to when we're in Spain, but the flavor was wonderful. Their patatas bravas were some of the best we've had in recent memory! Perfectly-cooked potatoes. Crispy enough on the outside to not become soggy under the weight of the bravas sauce and aioli, but still tender inside. Their bravas sauce had the perfect balance of smokiness and spiciness. Just great, honestly, and we've eaten countless bravas in Spain to back up our praise! Ha! The gazpacho was especially refreshing on the hottest day of the year, as well. We finished our meal with their paella. It was probably too much food for two people, but we were just in the mood for it, so we dove in! It was worth it, too. Our only wish was that they had let the paella cook a bit longer to get a better socarrat, which is one of the best elements of a good paella. We may request that if we can the next time we visit.  Overall, we had a wonderful experience. The food was excellent, the service was attentive and friendly, the environment was inviting, and the menu was full of our favorites. If you can't get to Spain, Bulla is certainly a suitable replacement until you can!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zo87Sy3tEzEtrWHKnHRj9Q",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Paella",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zo87Sy3tEzEtrWHKnHRj9Q/o.jpg"
      },
      {
        "img_id": "KpuyMRbx6WpxIekt9NZ5Gw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Pan con tomate was VERY heavy on tomato mixture. Still delicious, but not &amp;#34;traditional&amp;#34; like we were expecting.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KpuyMRbx6WpxIekt9NZ5Gw/o.jpg"
      },
      {
        "img_id": "AIJD-NqPfvumDj6DwSmBPg",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Patatas bravas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AIJD-NqPfvumDj6DwSmBPg/o.jpg"
      }
    ],
    "user_id": "JiPMk9WmbJu-VfTRAKpZpw"
  },
  "Qd8vkp9l-1aGZOLRKPcSzg": {
    "date": "12/29/2018",
    "text": "The service was great, liked the atmosphere.  The food needs more zest and salt! Its a bit bland...  chicken skewers- need to upgrade the chicken to a better quality, give more yogurt sauce and less oil. Paella has a lot of seafood in it, but needs more zest too. The clams are very chewy. Meatballs are a bit bland... add some zest, some sweet onions to them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pqoIcxGxjlrbHDqwJCybwg"
  },
  "W_tf9AwIsj2BMiuMm6x7rg": {
    "date": "12/28/2018",
    "text": "Food was good and service was very attentive. Bar was a bit busy but not bad. May get even busier when they can open the patio.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1UXlJco6w1dlStFlLDo_dw"
  },
  "DMvPr-AnUHa7aBiRblwFMg": {
    "date": "11/4/2018",
    "text": "First time here. Came with friends to celebrate my upcoming move out of state. We did a lot is small plates and sampling items. It is a very good place for that sort of eating. The paella was great! Nice smoky flavor, we had the chicken. Everything we tried was good. The Bulla special appetizer with the egg and chips sounds odd, but as it came recommended we got it and everyone loved it! I would have liked more wine choices, but what I had was good. I did not try the sangria, but the others really liked it- hence why there was none left for a sample I guess!  service was ok. My water glass went dry for a long time. A personal pet peeve. Atmosphere is nice. Noisy but not too bad for a Friday night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vjc_9bnwj9pCWyP68GOZOA"
  },
  "QFEhI1imKXNoaNyhVTz7sA": {
    "date": "12/5/2018",
    "text": "The whole experience was amazing, I loved the Chicken and Waffles, the Hevos Bulla was great and my Salmon was cook perfect! My server Tashima is a keeper she gave  recommendations that were on point and very attentive and sweet.  The Managers even took the time to stop by my table and make sure everything was going well.  I recommend this place for everyone! From the food to the prices, service and atmosphere definitely a added delight to Charlotte!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFfLrm4yEW21eyDSmPIaFg"
  },
  "nTPjbZzsWxvBEZ_OmR9ibQ": {
    "date": "8/11/2018",
    "text": "Forgettable meal and experience  To start the toasted tomato bread was soggy, cheese plate (well you can't easily  mess up cheese) was fine, shrimp and ahituna were tasty.  Paella was way too salty and clams were gritty so the kitchen didn't clean them well but the shrimp, prawns, and calamari were properly cooked but the saltiness of the paella was too overpowering so the dish fell flat.   The churrasco was good but not even close to medium rare more towards medium well.   Waiter was acceptable but not very knowledgeable about ingredients.  He had no idea what clams were served in the various dishes and after asking the kitchen claimed they were little necks from the Caribbean ( little necks do not come from there).  We got no help or suggestions from the waiter on menu choices which would have been nice.  Atmosphere was fine but reminded me of a hotel restaurant.  Sorry, one and done at Bulla with better choices for Spanish tapas in town",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CXuFw-Yc88svqZNheJagTg"
  },
  "nhoKKygaCi4BDxsb0JngJg": {
    "date": "11/27/2018",
    "text": "3.5 stars. When we first heard Bulla was opening, we were so excited to have paella in Charlotte. It took us way too long to try it out; however, after tasting the paella, we weren't that upset that we didn't make it here sooner. While the rice had good flavor, there was no layer of crispy, caramelized rice on the bottom of the pan. If you've never had paella like this, you're definitely missing out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_LAALjycHOqTk4xdQt0b9Q"
  },
  "1eDELPz3cifso4S_L_tNqA": {
    "date": "10/6/2018",
    "text": "Delicious food! I was a bit skeptical but everything I ordered was delicious. Incredible ceviche and gazpacho. The croquetas are different than what most people would be used to, I assume, but they are the Spanish style and tastes great. The decoration is beautiful. I don't think I'll ever get used to how tips work in the US, but today I was glad to tip my server well, Zachary. I'll be back for dinner and hope to have him as our server again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sHZ4e2AfL-FcgfVEO-aY4A"
  },
  "VjPYMkedmv-klPOZrqXukA": {
    "date": "11/3/2018",
    "text": "Tonight was my first time here and needless to say I will not be back nor recommending it. Arrived around 5:15 to an almost empty restaurant; including the inside, outside, and bar area and was rudely told by the 3 hostesses that only the bar area was available because of their \"upcoming reservations\". Honestly ridiculous considering the amount of wait staff that was mindlessly wandering during our entire visit, due to their empty tables. Also disappointed with the menu to say the least, Not only is it very specific, but overpriced and simply not worth it. Ordered a \"queso\" which was in fact a $7 plate of two slices of goat cheese? The food menu is specific, but as is the drink menu. Disappointing to see an upcoming restaurant in a great location handle guest interactions and culinary experience so poorly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lb2-7NTdh4iBORStb6m-2Q"
  },
  "ISLPUMQ_Bb6UyoOTgJ3Dxw": {
    "date": "10/21/2018",
    "text": "We had amazing food and service at Bulla! Every dish is rich and flavorful. Our server, Sebastian was fun and very knowledgeable about the food. You have to try his favorite dessert, it's a twist on one of the desserts on the dessert menu. If you get Sebastian as your server, ask for a recommendation, he won't steer you wrong.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KjtQKYZPmEPg2oO0DofVRg"
  },
  "fO83W_8insl7TyRCuoatHw": {
    "date": "9/11/2018",
    "text": "We went there for dinner on Saturday night. The service was awesome Jay the waiter was fantastic he was very attentive and observant of things we needed and got them before we even ask for them. The food was fantastic. Fresh, original, flavors put together I never had before. I think they should have some accompaniments more readily available like chips with ahi tuna and bread with the clams and pork belly",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qJoNnjqn1hTy7Q4CfhY1lQ"
  },
  "Zs8Nb5HZ3ZUqIGfnd6EE1g": {
    "date": "6/14/2018",
    "text": "We had amazing food and cocktails.   There is nothing in Charlotte with this unique Spanish inspired menu.   The space has been transformed.  We can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "23MivLuKNIZX2uSjsnJ5Hg"
  },
  "yzcEf5jjny-78FlcC3caHQ": {
    "date": "8/10/2018",
    "text": "This is an overdue review. I tried Bulla for the first time during restaurant week and WOW! Everything was fabulous. It also happened to be my husbands birthday and although they were super busy, our server was very attentive. The food was all so delicious. We had Ceviche & potato chips with shrimp, egg and cheese and it was delicious. we also tried the brisket caldoso and it was soooo good! Lastly, crema Catalana and churros for dessert. Also amazing. I must say the only \"not great\" item was the sangria. They put ice in the pitcher which in my opinion waters it down as it melts, and wasn't as flavorful as sangrias I've had in other Spanish restaurants but I'd prob still give it another try. Overall I'd still give it 10/10 . I loved everything about it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cp783Zt1FV8sZXvrvrvL4w"
  },
  "PGlnQPKVUNoe0PWVQTEKEg": {
    "date": "10/3/2018",
    "text": "Very small food portions for the price they are charging. Had to go home and eat some cereal after we left the restaurant. Never again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F5gzN4RdPeHMxbgAfeeOWQ"
  },
  "G-RHUE-ue36wZ2uZrb3mQg": {
    "date": "9/9/2018",
    "text": "Food was great. Zach was awesome, we went with his recommendation and he was spot on! Definitely coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cu20uXc3AmBH9BCGuduBqw"
  },
  "KUbc3iWm81bCMoHhF6cbVQ": {
    "date": "8/26/2018",
    "text": "My daughter and I ate dinner at this restaurant tonight.  We had the veggie flatbread, gazpacho, salmon escabeche, and patatas bravas. All delicious and great wine list too. Best part was our knowledgeable and enthusiastic waiter, Lorenzo. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NWmukdZ4v4bnT8wgMR113Q"
  },
  "JosydxbC-NnP0XdZlnUrHw": {
    "date": "8/25/2018",
    "text": "When I walked in, I was blown away. The atmosphere was good. but what was even better was the SERVICE. yes I capitalized it because the service was impeccable. great food and good prices. if I could give more than 5 stars I would. definitely reccomend the albondigas and montaditos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3n2eCMkNfB9g_5s29GCtHg"
  },
  "FfZ1MoahegeHxM6H-ttB7w": {
    "date": "8/13/2018",
    "text": "Amazing food and ambiance!! Had Sebastian as our server and he was the best! Just had to mention what I was thinking of and he knew exactly what to get! Great wine pairings and food descriptions. Will definitely go back and make sure I get him again... wonderful!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jrPPYr7G0Q3hDszvgcCitA"
  },
  "n-rJb1YNBcR1d-VEnK5ZpQ": {
    "date": "6/17/2018",
    "text": "Ate at Bulla last night. Really liked the look and feel of the restaurant. That was the good part. As far as the food and drinks we found it to be just average. There were three of us and we ordered a couple of cheeses and meats to start off. We then had a couple of small plates and finished with Paella. Food was just okay but nothing special. Neither was the service. Left there thinking I'll be in no hurry to go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U_pzS7V7nziz0eQbGyGxNQ"
  },
  "dSpmyqeB0WQ3i38T_uSQqg": {
    "date": "6/16/2018",
    "text": "Amazing wine and food! The patatas bravas, albondigas, charcuterie board, croquetas and pintxos were all so delicious and authentic. Sangria was yummy and service was fast and attentive. We will be back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_lvqVuRdpYLFnyM6sX3Ymg"
  },
  "QEhMlyfn9Cvi9OiWEfIDTA": {
    "date": "7/14/2018",
    "text": "Hope the manager and the staff read this. I will go to no other restaurant in the area that offers seafood than Bulla. Having lived on Cape Cod in New England; their quality of seafood, especially the calamari, is exactly what the seafood comes like from the Cape Cod Bay. It's not oversized. It's extremely high quality. It is not outrageously expressive. And the place is always packed because Charlotteans realized that Bulla is THE REAL DEAL. As a resident of the Residence of Southpark (the building above where Bulla resides; all of us are elated that Bulla opened up. It was about time such a high quality food restaurant opened up. 5/5 Stars? No way. 10/10 Stars. Have the calamari. It reminds me of when I lived on Cape Cod. YOU NEED TO START COMING TO BULLA.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1L9PkJcHAfq35Hlr97xygA"
  },
  "b3_3liPj2ogtf15572bJ6g": {
    "date": "6/5/2019",
    "text": "Great service, great food, and great atmosphere. Can't say I have any complaints, and I'll definitely be going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7sZVcItCeeijp6GfNJ28ug"
  },
  "PGRihI3SIJs9sSCmih4HNA": {
    "date": "6/2/2019",
    "text": "The seafood paella blew my mind! And the back patio is an amazing experience. My new favorite spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5z_6w9VhaAUCjMhy4jH0eQ"
  },
  "Xn7G9L5s0P4-6bFpwustaA": {
    "date": "6/2/2019",
    "text": "I love the places  taste like authentic foods to me feel you are in Spain most important thing is cocktail the Best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UFvlqcZdy3zrxX0MVJGsjA"
  },
  "uBh79GfhgLPhUZjf5Qr1EQ": {
    "date": "9/2/2018",
    "text": "We visited Bulla last night for date night.  Being from Puerto Rico we are very familiar with Spanish food. We ordered tapas and they were all amazing.  I'd say my #1 would be the Montaditos and #2 las Papas Bravas. We also had the Pork loin pinxos  For dessert we had the Churros and the were delicious as well . The chocolate sauce was very typical of the Spanish type, which is not as viscous as the American Type.  Our server, Lorenzo, went above and beyond to make sure we had a great time. Great service starting from the hostess to everyone else.  Highly recommended and will definitely come back.  Enhorabuena!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O4y4vQ1fi8daGB-sfze5ww"
  },
  "eBtHnw-6JONfETh7r8344w": {
    "date": "7/22/2018",
    "text": "I love this place! I am a new resident in Charlotte and I loved the food so much that I visited twice in one week! The meatballs, shrimp, calamari, and skirt steak entree were absolutely delicious! Don't pass up the red Sangria, it's perfect! Service was impeccable once they noticed we hadn't been served. Our waiter was on point and we were never left needing a thing. Great atmosphere and a very friendly knowledgeable staff from the hostesses to the server.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G4yUPoO0lJ7EUEpXEi2--w"
  },
  "8rZt0KAm7BBJUmsR8dMScA": {
    "date": "2/27/2019",
    "text": "One of the best dining experiences I've had in a while. We went on a Monday not crazy busy which made us the cool people in the room . Lynn took such great care of us and Aric answered my crazy questions about drinks and shakers. The food was amazing with a great variety- Lynn explained them all perfectly as her grasp of the menu made the experience even more enjoyable because we knew what we ordered. Will be back soon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uJeXULxQN0cxRoYNVSJPyg"
  },
  "Aa5XjmMz9ysKDncvkcnDPg": {
    "date": "1/20/2019",
    "text": "Such amazing flavors and fresh food! You know the food is so good when you're so full but you HAVE to have dessert. And trust me, you want to get the dessert!   Cant have enough good things to say! Everything we ate was absolutely delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OWVNQl6rgou9rAAHAm4sSQ"
  },
  "T19T3L1czLwsSRw-bkSeAA": {
    "date": "11/28/2018",
    "text": "The brisket paella my god. Tried this new tapas place during restaurant week 2018. Great atmosphere, service, and food. Don't miss the scallops",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nPrXsBYtP_nAMa3VVpIhow"
  },
  "_VNoTsAhW8DmhyXR5rfxKQ": {
    "date": "2/10/2019",
    "text": "Went here for my birthday, kind of a last minute decision, but they made the night so special! All the food was delicious, great wine selection, and an amazing staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hrF_vO9l748lxxwdco0I8w"
  },
  "5l6-pxmK6fOBvcx7ZmhQ4w": {
    "date": "2/10/2019",
    "text": "Delicious food, great service. We enjoyed the queso fundido, montaditos, and paella mixta. All were delicious and super flavorful. The montaditos were my personal favorite. Their sangrias were very refreshing and if you love lavender and vodka, order the bougie Palmer!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IYdyWx768HTNKPoVjqcBsw"
  },
  "V6dHS2UGYdxPO_obqvTXDA": {
    "date": "12/8/2018",
    "text": "Nice to have a good Tapas place in the area. Sebastian our waiter was wonderful and provided great recommendations. I hope to come back with a large group so I can try a little bit of everything.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M_5ZD8CIJF5ndTTUegKjGw"
  },
  "0aP0MnLK5GAL6IBLDtN76Q": {
    "date": "11/4/2018",
    "text": "Food - Amazing. My wife and are blown away. Almost every single dish is delicious.   Service - My wife and I can't stand the service. I wish the service was instructed to stop doing the following:  -Stop touching your customers (that includes shaking hands or touching shoulders) -Don't ask personal questions  -Don't come around every 10 minutes asking if we like the food or need anything else  Here is how the ideal service looks like -Be friendly but a professional (none of the stop items above) -Take the order, but otherwise be invisible -Monitor your tables from a distance, and if you are needed you will realize it by your customers looking for service  We still come here because we like the food so much, but the service is painful every single time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i-py30rapcVKVEVFM7Zegg"
  },
  "KI3ZNHAJBN38jZbYJw_Chg": {
    "date": "12/1/2018",
    "text": "It wasn't a great start, but the food made up for it. We had a reservation for 8.30pm but our table wasn't ready until 9pm. The first drinks took another 25 minutes to arrive, so the first hour wasn't great. Luckily after that it was pretty good. The food was great and was served in a timely matter, and not all the same time. So overall, not a great first impression, but we will come back again and then hopefully we don't need to wait so long before getting seated.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y_XFPXB9Vi1dQh30Yqzeag"
  },
  "rGCXfRMeeLt9ov7vANfWqg": {
    "date": "1/28/2019",
    "text": "Amazing food! They have a wonderful selection, there's honestly something for everyone. Since it's tapas, it's perfect for sharing. The pace of the meal was perfect, with enough time between courses to reflect on your previous dish. Finally, don't skip the cocktails! The Bougie Palmer is awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b8Wv4Wq2EcVm9_m5WvOwGw"
  },
  "qR3cYMs5e2vfoqUA-Iw9pw": {
    "date": "1/13/2019",
    "text": "Our waiter was wonderful and the food and ambiance were great too . Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nfca0oGh7o-iXIHm4mHkGQ"
  },
  "Z_4xHn_pN2jfqmC21__OgQ": {
    "date": "1/12/2019",
    "text": "Best tapas restaurant in town. Paella was amazing, as well as the desserts. Try the coconut flan.  Service and atmosphere was also top notch.  Discovered this restaurant accidentally as we were intending to go to Cowfish right next door but left due to the 1 hour wait list so we decided to try Bulla.  Best decision we made that weekend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-v25t-vc6cK2-tFfDaxqig"
  },
  "vJ_X9SM1oEP-itgwZyLeEA": {
    "date": "1/12/2019",
    "text": "Been living in Charlotte for over 3 years, by far the best dining experience I've had in this city for dinner. I called ahead and made reservations, got seated upon arrival immediately. The server Lorenzo was outstanding. The food was exceptional, served fresh and fast. I will absolutely be coming back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sdf2TBk0vTaFOygL9KjBRQ"
  },
  "nFIbz73kDecchtKviNxFtA": {
    "date": "11/12/2018",
    "text": "What a wonderful experience. Came here for a date night with my wife - being curious but not knowing what to expect. The food was amazing. Highly, highly recommend the meatballs and the brisket.   But, the best part of the experience was the service. Our waiter was the best we've ever had at any restaurant. The manager stopped by to say hello. The interactions the entire team had with each other were relaxed, funny, and positive - but we never waited for anything. It was a just a place full of great food and great vibes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TXf7D2AXlwuxs3j3YuGNxA"
  },
  "eoB-wrGcV7neunTCDNuvWg": {
    "date": "10/27/2018",
    "text": "Today was my third visit and it just keeps getting better! It was brunch but I was craving a kale salad and I sat at the bar because I intended to get my food to go but then the French toast starting calling my name (don't judge me lol) so I stayed in to eat that. I got my salad to go And also ordered the ensalada verde to go after hearing my waiter rave about it. Grant, my server was very attentive and keen to make sure you were satisfied and was just very friendly and welcoming in general. He gave very helpful suggestions too. Honestly the best server I have had period that I can remember in a long time. The French toast were to die for and with great service you just can't get any better than that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WGALvTD9-zOJgnApU3blnw"
  },
  "jOVPZCh7XjYmI0Zi51ws9Q": {
    "date": "1/4/2019",
    "text": "As a native Spaniard I can say the flavors are the closest I have ever tried in Charlotte, great atmosphere, quality ingredients, excellent recipes and execution!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZoMfDLgUeYtWClMOO-ZWjg"
  },
  "b0Ho9JHWADaZR4IIXFZh5g": {
    "date": "7/7/2019",
    "text": "I came in here with my wife the other day and everything was amazing. The food was excellent, our waitress Grace recommended several different tapas including the montaditos, which was our favorite. With this great service and incredible food will definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lnive-11bgACqY8crgLzCw"
  },
  "dCCDcujvyZFCiXa2E3oCBw": {
    "date": "7/23/2018",
    "text": "I rarely give 5 stars but this place definitely deserves them based on this visit! My two friends and I showed up at 10am on a Sunday, expecting to eat brunch. Little did we know that they didn't open till 11am. That didn't stop the manager Kenny from ushering us to the bar where they opened and served us drinks before they were even ready for customers. Clint, the bartender, welcomed us with open arms and a bit of frazzle. He was undeniably friendly and made us feel like he'd never met a stranger. He was excited to tell us all about the place and give recommendations on their fantastic drinks. We stayed at the bar for brunch which turned out to be an excellent idea. We were able to chat for an hour before eating and then had a leisurely, inebriated brunch! All of our food was excellent. Fresh and creative. I can't wait to come back for tapas and drinks after work! The meat and cheese selections are all from Spain and nothing in their restaurant is ever frozen. It really feels like an authentic experience. I can't say enough good things about Kenny and Clint. They were everything that so many places lack. Friendly and accommodating even when it wasn't convenient for them. I could not be more impressed by a newly opened restaurant. Their outdoor space opens this fall and will add a whole additional layer to the romantic atmosphere. Can't wait to experience it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "UZ-jh-H84fdCt4R2Xugz0Q"
  },
  "1NekX9r6UdRlBBYon09GKA": {
    "date": "8/21/2018",
    "text": "We went for my birthday and my husband had put that in the reservation. No acknowledgement of my birthday which was disappointing.   I am Spanish and so I know this type of food. I was disappointed with the food. It didn't have a lot of taste. The croquetas didn't taste like jamon serrano. The albondigas were cold and dense with little flavor. The pan con tomate was wet and cold with little flavor.   The wine, patatas bravas and coconut flan plus passion fruit sorbet were good.  I would go again for wine and try the cheeses and charcuterie and just stick to those things.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "euP6u_W2KyAm5jp6da88dw"
  },
  "55Gh4BhCh_5tHhystRbooA": {
    "date": "7/25/2018",
    "text": "Just last night, I enjoyed a Queen's Feast with a group of girls at this trendy, new hot spot.  As expected, the place was stylish..and even offered an intimate, romantic vibe.  Given that it was on a special three-course, Queen's Feast night, the place was packed...and it was quite loud.  Of course, our group sat at the high-top tables by the bar, so that probably made our area a bit louder than the rest of the restaurant. I yearned to sit at one of the \"normal\" low tables (as our high top was quite uncomfortable...and super-tight, near-claustrophic seating at that!), in the quieter areas of the restaurant, but then you have to make your sacrifices when you join a group outing.  Now the food!!  Since I read the raving reviews, I came expecting the best.  Possibly because of my high expectations, I felt a bit let down.  First of all, I expected a lengthier selection of tapas.  Again, I was expecting too much...especially given that I've been to several superb Spanish restaurants in my past, featuring truly impressive/massive selection of tapas. Still, I enjoyed my first small tapas plate - \"Albondigas\", 3 chunky veal and pork meatballs in heavy red sauce.  Then came my second small plate (which was actually closer to HUGE!) - \"Braised Brisket Caldoso\", which was basically a big plate of slow-cooked brisket mixed with Valencia-style rice in their special red sauce.  My only complaint here - and it's probably just a personal preference - is the over-abundance of meat to rice ratio!  I would have preferred more rice, less beef...but this plate was super-charged with brisket!  Still, it was quite good...but almost too much of it.  Again, HUGE portion...enough to feed 2-3 people!  (I had to bag half of it to go)  Then came the biggest disappointment...and it was a shared disappointment with all the girls in the group.  Their Spanish-style Creme Brulee, or \"Creme Catalana\" was just simply BAD.  The sugary frosting was weak, waaay too sweet, and the brulee was cold...and tasted closer to a cheap pudding than an actual brulee.  VERY disappointing!  Although I'm a shameless fan of desserts (*oink, oink*), I was only able to muster up for a few bites.  Now, trust me...that's shocking!  Honestly, I don't think a single girl in the table finished this dessert.  THIS is where I definitely had to take away a \"Star\".  Given that it was a bustling night, and we were a  big group, I think the service was reasonably good (although there was one mix-up with an order with one of the girls)...and we didn't have to wait too long for our plates or for our drinks.  Speaking of, their Sangrias were very strong (only took 1 glass to make me fully dazed and drunk!), but solid...to be expected at a Spanish gastropub.  All in all, this restaurant/pub is another great addition to the Charlotte foodie scene...and I thoroughly liked many aspects of this restaurant.  If only their desserts (others that tried the \"Churros\" didn't seem overwhelmed either) were better...and if only they had a few more exciting tapas on their menu (but then, I'm very greedy and spoiled)??  Still, I probably WILL return in the future... probably with my husband, for a quieter, more relaxed dining experience, with low-table seating...away from the bar!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6VbKbL-5zQcLAR9dHAqfoA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Crema Catalana - BAD!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6VbKbL-5zQcLAR9dHAqfoA/o.jpg"
      },
      {
        "img_id": "7W8iolGAhOFHRvh3LKlThQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Braised Brisket Caldoso - PLENTIFUL!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7W8iolGAhOFHRvh3LKlThQ/o.jpg"
      },
      {
        "img_id": "xv1P3roiFe1BeVlFiZkndw",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States. Albondigas - DeeLish!!  My favorite of the night!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xv1P3roiFe1BeVlFiZkndw/o.jpg"
      }
    ],
    "user_id": "mCrhj_CG3_pOmDFcfKotRQ"
  },
  "YAAam3CnnT4xzGBnnRPJIw": {
    "date": "7/22/2018",
    "text": "Service + food + drinks = excellent experience.  We had the calamari, patatas bravas, montaditis, gambas, and croquetes for dinner. I'm not usually a sangria drinker but decided to give it a try and I'm glad I did the traditional red was outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VRhgY4aS49bgimPRNI1D-A"
  },
  "FWdZ-k0n5Cq1cJnIZxaInA": {
    "date": "7/6/2019",
    "text": "Obsessed! This is our fourth time here and the food and sangria are always amazing. Tapas come out at the perfect time; just as we're finishing the last one. This place never disappoints.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "We0pxtPV-WKI6JXCP7Ofsw"
  },
  "La1EDdWTZfK1AQ9sK-Rd8w": {
    "date": "11/24/2018",
    "text": "As someone who's lived in Miami for a while, I can honestly say this is one of the best, most authentic tapas/pintxo spots Charlotte has to offer! Service was amazing and every dish was fresh, flavorful, and perfectly decadent. The Huevos Bulla and Verde Salad are must trys! One of Charlotte's best restaurants that was worth every penny.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_0EvA0dSj_61Sr2FQBx8WA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_0EvA0dSj_61Sr2FQBx8WA/o.jpg"
      },
      {
        "img_id": "7qsWl2jO6N-OutU63HHeDA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7qsWl2jO6N-OutU63HHeDA/o.jpg"
      },
      {
        "img_id": "DAqs0nbc13aYzBZlaOEFCA",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DAqs0nbc13aYzBZlaOEFCA/o.jpg"
      }
    ],
    "user_id": "7tbCYkc3_wN6_RoxHNn4cw"
  },
  "djwyyT8y9W_ZfPOIiI6pyg": {
    "date": "6/26/2018",
    "text": "We stopped in at their around 3-week mark. Waitstaff was super nice and attentive. Receiving glasses of wine was very slow. I think this had more to do with wherever it was coming from than the waiter because he kept looking to see if the glasses were ready. Anyway, waitstaff seems a little green - like this may be their first job waiting tables for real. But they all tried and had great senses of humor and quick smiles. Decor was cool and hip - it is a fun place. Live music in the bar would give a better edge.  The food was just ok. I would do lunch here, but I wouldn't commit to a dinner - Charlotte has developed into quite the foodie city, so they're going to have to step up their game. Charlotte is also transient, so people have been around and know Spanish tapas and how good it can be.  Things we had:  1 cheese and 1 meat:  the cheese needs better presentation - it was as if I slapped some cheese on a plate for my kids. The crackers were nice, but not nearly enough of the jam to finish the plate. The meat we selected was really good - still boring presentation. I'm sure the preset platter was decked out better, but they shouldn't sacrifice presentation even if the order is smaller.  seafood paella: I thought it was too salty, my husband  didn't. the presentation was beautiful - the pan was missing that amazing crust around the edges that Spanish families love so much - my friends from Spain literally argue over who gets it and told me it's like the wishbone. At Bulla, nobody gets it bc it's not there. They did an amazing job not overcooking the shrimp and the shrimp didn't have that odd preservative aftertaste that cheap shrimp has, so that was a huge plus - the squid fell flat though. A little tasteless and rubbery.  ALBONDIGAS - the meatballs - they were cold and a little dry. But the flavor was really good. the sauce was really good. I told my husband it seemed like they were cooked earlier, chilled, and they had relied on the sauce to heat them back up. But it didn't work. I do this for my kids at home all the time, so I know the drill.   Ceviche -  I  can't complain. it was great. I'm not a big fan of shrimp ceviches and prefer other white fish, but it was really good with flavor.  Overall it was pretty good- but not at the level it can be. I do think the managers need to take field trips to some of the other Spanish tapas places to see what the people in Charlotte love. And maybe the amazing Curate in Asheville. I know I shouldn't compare Bulla to that place and my multiple friends from Spain when they cook at home - but Spanish food is pretty simple and to have it fall flat isn't necessary at all.  I would go back for drinks at the bar and a couple of tapas - but not a full dinner.  That said, they're just catching their stride and are pretty new on the Charlotte scene, so maybe I'd give them another shot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "OxNvjWTcd7_X1q78Y99s2A"
  },
  "Afui7CHJLKvdyUZqscB6zg": {
    "date": "6/25/2018",
    "text": "I really wanted to love Bulla but it was just ok. I had seen that it was opening so my husband and I stopped in on a Thursday night. We sat at a table in the bar area and were served quickly. I have to start by saying that it was pretty stuffy and humid in the restaurant. It's been hot so maybe they're working on getting the temperature right but it was a little uncomfortable.  We shared a pitcher of the red sangria. It was good, but not my favorite. It was a little too sweet and had a strange sugar aftertaste. For food we had the patatas bravas, gambas al ajillo, tortilla espanola, croquetas de jamon, the montaditos, and the paleta iberica. The potatoes were good, but nothing too special. They had a nice sauce and weren't too spicy. The gambas were disappointing. They didn't have much flavor except for some chili flakes and it felt like something I could make at home. The croquetas were also plain, and didn't have much ham. We did really enjoy the tortilla espanola, it was flavorful and was a generous portion. The paleta iberica was delicious, it melts in your mouth. However I'm not sure it's worth $15 for the small portion. The highlight of the meal was the montaditos, a short rib on bread dish. The meat was tender and flavorful and the tomato marmalade was delicious on top.   We didn't have a bad meal here, I was just underwhelmed by most of the dishes and drinks. I will say the service was fantastic from the host to our waitress. They made an effort to be over the top friendly, know our names, and be there when we needed but not hover too much.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "qopA1DLwDjDSIxsfCo9Zyg"
  },
  "wKuLGKUW5Jk1OSXSa4nrZQ": {
    "date": "11/14/2018",
    "text": "The kale salad is the best in town - the lemon maple dressing is to die for! I crave this every time I come - the soup was ok I didn't like that it was chilled but it's supposed to be, I just wanted to try something new :) definitely check this spot out everything else is amazing & the customer service is always on point!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N59MuKPTM8ybYDP1kTBeGQ",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N59MuKPTM8ybYDP1kTBeGQ/o.jpg"
      },
      {
        "img_id": "FSJLh6geqIJ9GJo6Ja2f2Q",
        "caption": "Photo of Bulla Gastrobar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FSJLh6geqIJ9GJo6Ja2f2Q/o.jpg"
      }
    ],
    "user_id": "Rl4RPB_Jm343W-z49Inqpg"
  },
  "lLlJtBIcNV2c769YTf6kSQ": {
    "date": "2/28/2019",
    "text": "Had a club Social at Bulla last night. Was blown away by the excellent food and service. Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tqlEWyzVjgu9Thx0fcgbBA"
  },
  "n9cNyNo_AABmSlJp2egS3Q": {
    "date": "10/3/2018",
    "text": "This place is delicious!  Everything we had was wonderful and the wine was perfectly paired for us by our server Zack. He made wonderful suggestions and we could not have had a more pleasant time at this restaurant.  But now this is what makes a delicious place stand out... we decided to walk back to our hotel, a few blocks away. About a block and a half away we hear someone running up to us. Zack, our server comes running up with our forgotten credit card. How amazing is that?  Some people just go above and beyond. Zack is one of those people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jw_AGNtjAmyepbIGhiNSdg"
  },
  "1Eyl_YvMeOSQp-kojj5pUg": {
    "date": "10/1/2018",
    "text": "None of the four of us were familiar with the Spanish dishes we had to choose from. The dishes we chose where very well presented. The Pintxos skewers of Pork and Chicken were excellent. The Tartar de Atun, Ahi Tuna, was excellent. The Churrasco Moreno, melt in your mouth skirt steak was just that. Our server, Lorenzo, was very menu savvy and a great highlight of the evening.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mjw4iMgInfNES6xykv4y8g"
  },
  "M-T-p_4v4Fu2Gb4CWXCbxg": {
    "date": "11/3/2018",
    "text": "This was fabulous. Wonderful food and excellent service! Our table received the Potato Tortilla (a traditional Spanish omlette) by accident. Nobody in particular was to excited about it, however, once we had each tasted it, we nearly fought over who would finish it.  Reasonably priced for quality and service. Casual easy atmosphere. Fresh food and friendly knowledgable staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "54cOCsBeEeWHzWvcbIlp-g"
  },
  "0RDq8nqjypRE0xiCCFiZPA": {
    "date": "5/31/2019",
    "text": "I can't believe the score on this place is so high. I love Spanish food and thought this place was mediocre at best. We got the paella which didn't have much flavor and NO CRUST at the bottom, which is kind of necessary if you're going to call it paella. The meet was also not great quality. Croquettes were very small and lacked flavor as well. B",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U7ujBdcDQWPg1WdfMCMYZQ"
  },
  "3jCJsULVooyUCHZ2P0aUPw": {
    "date": "5/28/2019",
    "text": "Had lunch here with family. I have been to Spain & had tapas & I have to say this is the best I have had since. I love tortilla espanola - this was a little on the greasy side & somewhat overcooked. Other tapas ordered were salmon rillettes - my fav, albondigas/meatballs - loved the sauce, brussel sprout salad, spicy shrimp. I wish they had ensalada rusa - not on the menu. The white sangria was delicious too - not too sweet. Fruit was very fresh & lots of it. We shared an order of churros. Very good waiter, wish I could remember his name, he took very good care of us - party of 7. I will go back if I get to Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8MY9rNISxEgXGtGaSZ6DfA"
  },
  "1Hc7ftE2aPz6WEDKqzwQBg": {
    "date": "6/9/2019",
    "text": "Made a reservation for a Saturday night and was seated right away. Our server was very helpful and knowledgeable. We decided to try a bunch of the small plates and they were all delicious- I would recommend trying the ceviche and the montaditos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_M9NXDWLgVIPRKnIdm4isA"
  },
  "RPzWbwed0XY__FYpt208Yw": {
    "date": "2/21/2019",
    "text": "Update 1. I went back and they have things in order, and the food is extraordinary. They also reached out and asked for feedback.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gg6rDJARpROtgbOV_FVRrg"
  },
  "6FIgai-iIk0x6QrRRgH5MQ": {
    "date": "2/16/2019",
    "text": "Great Low key spot for family or significant other. Away from all the chaos in the mall but still in the area. Great selection menu. Highly recommended the chicken and waffles or Salmon burger. The avocado test is light and a great starter. The best experience is the service from Alexis. He explained the whole menu and extremely courteous.  I will come back, when traveling again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4d_yy6LKoDLVJcTKasIunw"
  },
  "lP71ycm5R4IXgg8rsyPlDA": {
    "date": "1/20/2019",
    "text": "We went for brunch, so maybe the experience is different when it's dinner but only 1 of the 3 dishes we ordered was tasty (the tuna tartare was on point.) With such great reviews we expected much better food and were sadly disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j4N_WhYh8cxwul0AVoShEw"
  }
}