{
  "d5pSOUX8sb0kNHRBVHE2Mg": {
    "date": "9/24/2014",
    "text": "Great burger place! Everurjing made fresh and the loaded burrito will test your manhood. Would recommend to anyone and plan on going back very soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G-JZ9InI40Yw8KEsbJEf_A",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Double Burger combo. Made fresh and tasted great",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G-JZ9InI40Yw8KEsbJEf_A/o.jpg"
      }
    ],
    "user_id": "j5HqFgTE4rTeqxJ12LfScg"
  },
  "MQKtIGbr5DoCafYLQ0ZYXA": {
    "date": "3/8/2016",
    "text": "I have eaten here a few times and the food is good, that is if you can ever get it. I was the only one in line today and after a 10 minute wait, my order was still not taken. The 2 people cooking sure had plenty of time to joke around and converse with others  but couldn't even take my order after a 10 minute wait with no one else in line. They have good burgers but are the most unprofessional, incompetent restaurant I have ever gone to. I will not go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n-JHF2VTB5CKJQ6kz9I-HA"
  },
  "7owt4_9MTjiwomCjqIY4aQ": {
    "date": "2/8/2015",
    "text": "Awesome!  I'm from Los Angeles and it taste just like Tommy's.  The chili chesse burger is delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "XO0UfcfbYOrcjtggHeZN2w"
  },
  "SoCR3D8uUtF-UuVf3D_Z7Q": {
    "date": "7/19/2015",
    "text": "We just moved to charlotte and we love Chubz. The owner is a character. It's a fast food type joint but everything is made fresh. Not frozen. Definitely a place to check out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PGDzzU5sGgGQ_P5ey3PERQ"
  },
  "eD7WD1930C9peYdHgsVziA": {
    "date": "11/27/2015",
    "text": "The food is great.   The employees not so great.   The female complained about everything she was asked to do and was complaining about having to work in general.   They were arguing loudly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qKjOPtP2on1tZAz9H3_8Zg"
  },
  "1UnpxvChy-PxP1G8mkT8qw": {
    "date": "5/23/2015",
    "text": "The fries are fresh cut but I prefer crinkle cut. I had the chilli cheeseburger, it was worth the money. Wish the burger patty was a little thicker. Overall it was delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pc0KlwL92KZQadoIsg_6FQ"
  },
  "9V5lDhQ4QNOLN2M1c__N5g": {
    "date": "10/2/2015",
    "text": "Great service, great food! !..the place was clean and it smelled delicious when I walked in.   The server knew everything about the menu.   I had the chili burger and chili dog with fries.   I recommend the combo #12...I will be coming back here when I can",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t6PMBBnLaEaikAiuaNCoVQ"
  },
  "9zdrHdQk4K9pxajkZVjVlg": {
    "date": "9/2/2016",
    "text": "My husband and I literally just ate here. This place has the best chili burgers and chili dogs either of us have ever had! We both LOVED the food. Very affordable and so worth the stop on our way to South Carolina. Steve greeted us the second we walked in and helped us decide what we should get, he made awesome choices, although in sure you can't go wrong in this place. The whole time we were in the restaurant eating, Steve made sure we had everything we needed and carried on conversations with us. He showed us really southern hospitality. If we ever come through the area again, we will for sure go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ve3XAmKHEcuMOJQsfxjwjw"
  },
  "jg_aLMVPJpiEq6-aCOuRjw": {
    "date": "1/2/2015",
    "text": "Absolutely one of the best (what I refer to as) 'dive class' burgers in town! It's on my rotation of things I must have once or twice a month. The fries are amazing and put 5 Guys to shame. With a place like this nearby there is no reason to even think about going to a corporate fast food chain. The foods top notch and very affordable! Great staff and always accommodating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_kcJr70vIZthDNm6W-mV8w"
  },
  "a1Bz0nIPPaZUbXA_utf85Q": {
    "date": "7/10/2015",
    "text": "You know what I almost didn't eat here after seeing the  90 score but all in all I had a good experience. The only reason I came was for the chili cheeseburger and it was a decent one. Chili was pretty good burger was hand formed nothing frozen decent lunch spot I'd eat here again. Cook was friendly as well as the manager",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "du8TGiiVjQKh2NjASafCCg"
  },
  "Bt6_WSnNn_1JP-WrwubfMw": {
    "date": "1/4/2015",
    "text": "Just finished a fantastic meal. #1 Chiliburger all the way with fries and onion rings. Great atmosphere and staff. Just a Fun place. Great meal. Will be back again soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UG3UWsx-hZST0qDhHyizqA"
  },
  "B1YMJ3oTxxRBNZiX80dLfw": {
    "date": "2/1/2015",
    "text": "I had the chili cheeseburger combo and it was not all that great. Their chili did not look great but also did not taste great either. The fries on the other hand was crispy and good.  The pricing on the other hand was over priced for a burger that was not even all that great.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcD5KiJ_ACTsU6zLJR6CuQ"
  },
  "8B3sHjhKcGJiBeJvLj5_1g": {
    "date": "4/14/2014",
    "text": "DO NOT GO HERE IF YOU HAVE YOUNG KIDS.  I tried to go to Chubz today with my family for lunch. I have 2 children, ages 10 months and 6 years. Prior to ordering, we asked if they had any high chairs for my 10 month old son. One of the owners very curtly told us that they had no high chairs. He acted as if we were offending him by asking for such a thing as a high chair at a burger and hot dog place. I have no desire to step foot in this place again if they are going to treat my family like this and act as if us having children requiring a high chair is something distasteful. It truly is a shame that their attitude toward children is so poor, as I did enjoy the food when I went there previously with just my husband",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "_M-_KMme3b_G-IxPvtylTQ"
  },
  "NNrtBy-J9IR_lNQyIUKK0g": {
    "date": "7/30/2016",
    "text": "Food was fresh and cooked to order. Everything was excellent.  Gotta try the double chili burger. Staff was friendly and attentive.  Will definitely be back next time i`m in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RxjMVuaLk5g9CfIoRrWlrw"
  },
  "EiGa54UQ4tKxSM2wT-jowA": {
    "date": "4/20/2014",
    "text": "Disappointing is the only word I need to describe my Chubz lesson.  Saw this place on Groupons. I thought \"Great, a place that specializes in chili and cheese. This is a fat dudes dream come True\". The dream started out nice, as most nightmares do.   Service, service, service is what I love and what will keep me coming back for middle of the road food. I won't be coming back.  Service began great. I walked in. It was a little dead, which I don't mind. I was waited on immediately which is always a plus. But that is where first rate service ended. As I said, the place was dead when I entered. After placing my order , two other parties came in. Both of them received their orders before I did. To make up for the wait, I was given a triple burger instead of the double I ordered. Needless to say, I would have been better off if it had been a single. When you specialize in chili and cheese, then I expect some gourmet special Gordon Ramsey created chili recipe. I've had better from a can of Castlebury's. It was greasy, salty, and lacked any real seasoning. Heck, I'm not even sure it was ground beef which should give some flavor. This was more like unseasoned turkey .  The burger patties were a bit too done. And everything was basically thrown into the to go box. Of course this was just a mess to look at.  My groupon  was good for two visits. I will be chalking this up as a lesson learned. The second voucher will NOT be getting used.   Good luck to Chubz. But I will not be a returning customer",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "yZ56e1MOH2PjrBA_c01AqQ"
  },
  "6yKVSTmEmO0Wc63bThXbXw": {
    "date": "6/6/2015",
    "text": "Once again, another very good experience!! The burgers are hot off the grill and juicy with fresh toppings. The fries were tasty and so hot that you had to let them cool a bit before tackling the huge portion. This is one of my daughter's favorite places to eat. The owner seems to always be onsite and the passion he has shows in both the quality of the food and in the speed of service. We will definitely be back!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VDalaJ0_xpz3pQHHPbOTnw"
  },
  "8llUiBoB4O3HAN8hYRC-DQ": {
    "date": "10/17/2014",
    "text": "Searched out this place for some comfort food. Love hotdogs so I went for the 2 chili cheese dogs and fries combo The hotdogs were great and the chili perfect. To top it off the fries were fresh cut and cooked to perfection. Makes my list of must go to when I am in the area again. Only regret is not trying their ice cream",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yHwYqAq9tKijMJAcUbdnMQ"
  },
  "EiKnBHSxXGzGsc1ZngeH9g": {
    "date": "7/23/2015",
    "text": "I came from Little Rock Arkansas and I heard about this restaurant. I was able to locate it easily.  I visited the restaurant and ate a great cheeseburger and french fries with chili  included! It was the best burger I've had in a long time. The staff was wonderful and the service was great. If you are ever in Charlotte North Carolina I recommend you try this place. Five stars form me. Thank you so much to the staff and owner. Until we meet again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uje_XLi_Dk6fi70UbmSEtg",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uje_XLi_Dk6fi70UbmSEtg/o.jpg"
      },
      {
        "img_id": "Rj-LJvwZeiEY8eVPMMsEwQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Rj-LJvwZeiEY8eVPMMsEwQ/o.jpg"
      }
    ],
    "user_id": "S1I7r5YvxcrTASv_t7cxAA"
  },
  "nREzrfvHA9lyPRe4MbQdSA": {
    "date": "5/29/2014",
    "text": "I've been to Chubz twice. There have been some hiccups I'll discuss but first the good:  Imagine, if you will, a 5 guys. Now add decent onion rings, chili, and cut the price by $2-$3. That's Chubz. I've gotten a couple different items: Fries, Onion rings, Burger w' \"special sauce\" and the triple chili cheese.   The onion rings were a little airy for my taste, but were still pretty good and fresh. Fries are usually above average - there's some malt vinegar which is great. They aren't fried in peanut oil like 5 guys but they're probably around 90% of the taste. I'd urge the owners and cooks of chubz to be very careful to fry in small batches for customers, as one person getting cold fries probably won't come back. I thought the burgers were delicious. both times my girlfriend and I have received them hot off of the grill, with clear juices still running from them and well presented in a paper wrap. There was a slice of american cheese on each patty which was fantastic. Vegetables were pretty darn fresh and crisp on each meal item. Buns were also well toasted and not stale.  A lot of people complain about the chili which is bizzare. This is no bourgeoisie chipotle three bean bacon chili or whatever - it's chili DESIGNED FOR HOT DOGS, BURGERS AND FRIES! I don't know if it came out of a can or not and I couldn't care less. It was salty, greasy, and delicious. If you want gourmet chili I don't understand why you'd expect it at a greasy spoon like chubs (?!?). The good news is the meals come with drinks so if you get thirsty boom you're there.  And for real, get your food and eat it at the place. Chubz' location isn't the greatest (it's next to a gentlemans club haha) but please people: if you get a chili burger or dog and expect it to magically stay upright or intact without paper touching the top you're going to have *a bad time*. This is pretty basic. If you want it to go don't get chili. There's a limit to what people can do with paper and plastic. My times eating in, the presentation has been on par with the pictures I've seen for groupon which is impressive IMO.  One final nit pick: our second trip we were greeted with some \"out of order\" signs on the fountain. Inventory  management is HUGE especially when your entire menu is meal deals. Make sure that you have the soda people want at all times, chubz, and if you're a customer check before you order. I found something I liked thankfully, but I would feel pretty ticked if I was a diet coke fan and there wasn't any after I'd paid for my meal.  Expect to spend $8 or so on the best meals. I'm a big eater and it was enough for me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cpkkojfuNh4zaXHvgDZoMw"
  },
  "yLr-q9eM4dI4EAPXeC1VUA": {
    "date": "12/11/2013",
    "text": "WOW I travel all over North America for work and have found many great places to eat. This is a must go in Charlotte! I had the chili tamale and the #1 chili cheeseburger combo. The chili was just like the Tommy's I grew up with back in Los Angeles Thick and full of flavor. Fries are fresh cut and made right in front of you.  The tamale was great and hand made has a little sweetness in it to ofF set the chili just right. It is well worth every bite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "dq3ozmAZmrBP8_lfqcKmaA"
  },
  "DcXi1wcXp8OP0ieFV6VLmA": {
    "date": "7/26/2015",
    "text": "So we first came here because we heard it was just like in and out burger.  We live in Mooresville so it's a little but if a drove to get here but we've been 4 times this year. Yea, it's that good.   I always get the combo #6 which is a double cheeseburger and jumbo chili dog. I also must get a side of cheese fries.  Their burgers are fresh, never frozen and their hot dogs are 100% beef. The fries are cut fresh daily and you can just taste the difference in freshness from other burger joints. The tomatoes and lettuce they use are also always fresh and perfectly put on the burger.   The two  Owners are really nice gentlemen to take pride in their restaurant and love to chit chat and get to know you.  Please come to Mooresville Chubz...   It is located right off 77 off exit 6A. The area looks a little sketchy but trust me , you'll be fine and you'll be happy you ate there.  So, if you haven't already, go try them out. Or if your driving through Charlotte, go check them out! You won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "noEOtX9pWLtUo_QKAHVIgw",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Oh yea!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/noEOtX9pWLtUo_QKAHVIgw/o.jpg"
      }
    ],
    "user_id": "NkzTaYKc8T1lE2TI5jUHRg"
  },
  "KR2nClDcXakjqNsGwa-r3A": {
    "date": "7/19/2018",
    "text": "Favorite burger place in town!  Have a large selection combo meal options.  Some of the best onion rings I've ever had.  The hot dogs are good but the Double deluxe burger is my personal favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "39htNL0mpuW5qj_jFuaJtg"
  },
  "5nsOj8adVFM0NiKDy9zrAg": {
    "date": "9/23/2016",
    "text": "Tonight was my first visit.  The chili cheese burger and  Chili cheese dog are the 2 best friggin examples that l have had in years of testing all over.  I am passing through Charlotte on the job and Chubz is close to the airport Hilton Garden Inn. After ordering to go, I grabbbed a stool and watched a diverse line of customers some locals some newbies like me.  All were treated with a genuine friendly smile at the register.  The guys at the grill were great-and quick while keeping it clean. Charlotte is tense tonight yet  these guys in a slightly tough strip mall kept  focused on their talents.  For cultural exploration the strip is graced with a pool hall, a \"spa\" and a Gentlemens strip club. Chubz is worth trying-again and again!  They rock Gods great gift- Chili Cheese burgers and dogs.  No tofu, kale, or other gastroterrorism at Chubz. Get you some!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "POQGIQP0lc1msZAWAyDuOg"
  },
  "I_nRRTpR_GXM4_flXPiDQA": {
    "date": "4/28/2018",
    "text": "Best chili cheeseburger in charlotte! Friendly staff. Onion rings were great as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UDw0i0rTskqwlBtrY42_fA"
  },
  "2_G02xgscR_8E9PDKZpVcA": {
    "date": "6/23/2018",
    "text": "The best burgers in Charlotte! Fast, friendly service. I've had the burgers AND the dogs (with chili) and they're both AMAZING. Only knock is the fountain soda: it stinks (clean those lines). Horrible soda aside, the burgers are legit the best you're going to get in Charlotte, and the owner is usually on-site to chew the fat with you. Great guy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yQs97pqRMtqctOJwdcowuw"
  },
  "N4gDwMJgOI8Iw7zRe4GDoA": {
    "date": "4/5/2015",
    "text": "Like Tommy's in Los Angeles. If you love chili and burgers or hot dogs, this is for you.  This is not the kind of thing you can eat every week, but when you feel like a burger or hot dog or fries, they do a great job. It's a local owner, so supporting that is good.  If you like In N Out, Five Guys, Tommy's, Louis's (for my LBC crew) this place is a good stop in and they are on Foodie Call too.  Being from Los Angeles, you have tons of good options for a good burger when ever you want... but here in Charlotte finding a good (non-gourmet) grill em all style burger is not as easy - so I give them 4 stars.  Super casual.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "MWuVbyBgP4vD24Rc7UH5xw"
  },
  "RXCjj47-1tlg4pR0WAIQzg": {
    "date": "6/17/2016",
    "text": "Man, I don't know. If you're really feenin' for a greasy burger that ain't fancy, this is your place. I think I read a review where someone compared the burger to In 'N Out in California. I don't know what crack they were smoking. Chubz definitely does not give me the \"In 'N Out Urges\", nor does it give me the nice juicy grease of Dick's Burgers in Seattle, but it sort of gets the job done.   If a really straightforward burger is what you want, with little flavor and lots of grease, come to Chubz. The fries are also super greasy and soggy, which appeals to some people sometimes - that's cool. No judging. We also tried the onion rings - straightforward, no frills, no flavor. We had a bit of a smorgasbord and tried the tamales and the hot dog as well. The tamales were good once you scraped the weird tasting chili off of them, and the hot dog was just your basic hot dog. The chili was just... weird. I like chili, and this was not what I was expecting. I don't think we finished anything we ordered actually. The cheese was less cheese-tasting, so much as it was just melted saltiness.   It seems like most people dig this place, and that's cool. Maybe I'm a food snob, but I am good with Five Guys when it comes to satisfying my fast burger needs.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "2hii37dkKL4POcu6vh_6EA"
  },
  "lsox6YZKdahzQgEeCv74FQ": {
    "date": "5/13/2015",
    "text": "I commented before that I loved it and I still do, but it seems like since the last time I went, the flavor has lacked. Whatever they stopped doing they need to start again. I will still visit, no doubt and I still recommend this place. I just felt like I needed to update this review.  * Sit at the bar, if you can *",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VlcasgkqiTuPi-nVT7rEtw"
  },
  "QJN7PjBT2W51B8Wy6j6UKA": {
    "date": "11/7/2017",
    "text": "Burgers, Dogs, and Fries... not fancy just good food! Delivery at a local hotel. Service was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cnXlilhAcjZM7wSL_nKOoQ"
  },
  "Q-ee86KSXtebsDq5WqBDdw": {
    "date": "3/21/2018",
    "text": "Found this place on Yelp and SOOOO glad we did!!!! The service is AMAZING!!! But the food was better!!! Their chiliburger took me back to Tulsa!!! If you're in the Charlotte area this is DEFINITELY a burger to get!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fqJKzC8YQ_G801M_L9i70g"
  },
  "W8c9zY9K5FZXNZEIOP138A": {
    "date": "5/27/2018",
    "text": "Fantastic food and good service. This place checks all the boxes for what you'd expect in a hotdog and burger joint. We enjoyed the layout and ordering system as it gave a old school vibe that was familiar and comfortable to us. We each had a burger with fries and I added a hotdog because, well that's what you do when there's a hotdog available that you haven't tried. My son also got the chili cheese fries and we all had chili added to our burgers. The burgers were cooked perfectly and were so flavorful and juicy. The veggie toppings, lettuce, tomato, pickles and onions were all fresh and used with just the right quantity. The chili is house made and very flavorful and perfect consistency with a hint of heat, just delicious. For me the chili on the burger was a little over the top but was still very good. For dogs and fries it's a must have. We cheerfully give our recommendation to anyone looking for a good old school burger and dog shop.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uIMxiPmNHYcgMiu2YE2a9g"
  },
  "e2o6S77YqnIMq027gssIQg": {
    "date": "4/21/2018",
    "text": "What a classic burger dive should be.  Hand cut fries with a great seasoning.  Great flat top burgers with a flare to put chili on about everything except the napkins.  Big portions, decent prices and friendly staff.  You will leave smelling like a burger place, they do not have the best hood system.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "urThcqroWgGhtyArBz0Yzg"
  },
  "92cWpdaruEELYgMMFncRuA": {
    "date": "4/18/2018",
    "text": "Food - 10/10. Customer Service 100/10. The owners of this shop truly take pride in what they do here - and for good reason! I had a cheeseburger, chili cheese dog and fries and everything was beyond fantastic. Fries are crisp, the burger was cooked and proportioned perfectly with all of the toppings, and the chili cheese dog was the best I have ever had, hands down. The food came out hot, quick and fresh, as it is all made right in front of you, and the owners keep you engaged in great conversation at the countertop while your order is prepared. It has all of the amazing, heartfelt qualities that have been lost in the modern day dining of chain restaurants and fast food. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6SngPrSuZjN80dt62Lknzg"
  },
  "ISQJLzk2I_Hk2cDvWs3XNw": {
    "date": "12/3/2017",
    "text": "I would recommend this place to anyone! My wife, kids, and I went there today. The food was great and the staff were extremely hospitable. The Chilli burger was really good! I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bn3chWBBS65GYcnyIcqAiQ"
  },
  "Kaf1PMkTkqCNeqU_Bg24xA": {
    "date": "11/11/2017",
    "text": "Wow! If you are missing In 'N Out or Tommy's, this is the place for you! The food is great! I had the CHUBZ Double Deluxe and it was terrific. The Chili Cheese Fries are tremendous and an order feeds two. Great place and we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ga-855sZtC7eeiCNQ8O4w"
  },
  "YHbA3fpawyOhcslqQ2pfAQ": {
    "date": "6/15/2016",
    "text": "Not a bad burger or hotdog, I think prices are a little steep for what you get. They also up charged me a 1.00 to add chili to my hotdog/burger combo.   I would say that the gentleman that helped us wasn't the friendliest and sorta waited to take our order. Said he was by himself but we was the only ones in the place at the time.  And he finished cleaning the bar and then took our order.  He didn't seem like he was having a good day and it showed.   But I would give it another try and get a double this time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fc6JvJcRW_2QDwEWViRHfw"
  },
  "HjO4xat0add3jjHItqgw4A": {
    "date": "3/11/2018",
    "text": "Uh Yum!!  Friendly help. Made to order. Be sure to get extra chili sauce to dip your delicious fries in. I had a double. Cheeseburger with lettuce onion and tomato. Fries portion is big. The burger was tasty. I've been twice and there is sure to be a thrice!   Chubz love y'all !  You might want extra napkins.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hZ_Dh5MKdk5pqZncbl5bpQ"
  },
  "4AztvDTbonkzHePh_QOTZA": {
    "date": "7/28/2017",
    "text": "Tried a double deluxe and a double chili cheeseburger today. They were both excellent.   The owner and the workers were friendly and fun.   Had a great meal. What else is there?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4zipLdUvnn4_UCP-b2OR-Q"
  },
  "JgicyQ4dWvTZ3w7M1u-Itg": {
    "date": "9/18/2017",
    "text": "Excellent Burgers! Great service! I got a chili burger, a deluxe burger and fries. My buddy got the onion rings and I was jealous cuz they were excellent. The burgers were some of the best Ive had in Charlotte. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r6xqQuoj3NWm45_YiUPXtw"
  },
  "M3NIj-0xrp-NrzHqMldgAw": {
    "date": "7/8/2014",
    "text": "Hello friends,  I stopped by this place yesterday. After reading and lmao at Jeff's review i wanted to see who/What took over the BC old spot.   Well i had the number 4 (hot dog,burger,fries & drink) 7.50. Online i believe the prices are different. They have maybe 10 different combos ranging from burgers, prime rib sandwich, hot dogs & some sort of Tamales.  (Which i find a bit out of place as far as everything else on the menu, like why this at a burger joint????)  I'm a fry guy and this place rocks. The fries are damn good. The hot dog was good. The burger was good as well. The bread was soft and yummy. Knowing me i will be back in a day or so to try something else.   I like this spot. The owner & cook were pretty cool too. Stopping to ask if everything was good and shooting the breeze as i ate.   Go enjoy",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "IMrlb5Ss6O7D97v3rYqUdg",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. #1",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IMrlb5Ss6O7D97v3rYqUdg/o.jpg"
      },
      {
        "img_id": "boi2uPRQ_gz2uFbPWAszRg",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/boi2uPRQ_gz2uFbPWAszRg/o.jpg"
      }
    ],
    "user_id": "xhlcoVm3FOKcxZ0phkdO6Q"
  },
  "M-LzH67-7YkYCg-xcOaFNQ": {
    "date": "7/10/2018",
    "text": "If you like LA flavor--In-N-Out and Tommy's, this is your place! I drive 25 miles to get the best burgers on the East Coast. I highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GI4xPsc0mt3GX3JpffYs1g"
  },
  "h2xEm0zordSejAwgUhc-1w": {
    "date": "4/19/2015",
    "text": "I've read about Chubz several times over the years and have always wanted to try them. Today on a blustery wet Sunday I got my chance.  The shopping center it's in is a bit run down but don't let that stop you from going. The Chiliburger which is their specialty (#1 on the Combo menu) is outstanding. With the Chili, it tends to slide apart so care must be taken in eating but with that aside, prepare yourself for a great burger.  Comes with french fries and they are some of the best I've found in Charlotte. Hand cut, properly cooked with a crisp outside and a moist but not mushy interior. I'm very picky about french fries and few places do them well and this is one of them.  Service is basic.  You order at the counter and pickup on the other end.  In my case, since I was seated and they were not busy, they delivered my order to my table.  Outside of the strip mall they are in, the atmosphere is excellent. Not fancy but attention is taken with cleanliness and sanitation.  It's gotten a number of good reviews over the years and now I know they are justified and with good reason.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mNBpokC-HayZmveJQE4abg",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mNBpokC-HayZmveJQE4abg/o.jpg"
      }
    ],
    "user_id": "GGTF7hnQi6D5W77_qiKlqg"
  },
  "d-LF7UZoWS8eRzsebeLpHQ": {
    "date": "5/10/2015",
    "text": "This is definately one of my favorite guilty pleasures. They have the best onion rings in Charlotte - possibly the best I have ever had.  Combos range from $7 and up including cheeseburgers, fries and a drink. Their chilli cheeseburgers are pretty awesome as well.   It's not located in the best shopping center but there is always parking available. The food always comes out fast and you can watch the cooks grilling them right infront of you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "VaIDU3L_RbVuTO1okZrfTA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Side if onions rings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VaIDU3L_RbVuTO1okZrfTA/o.jpg"
      }
    ],
    "user_id": "oHdCkOf9gHSMhvJd4JbVrA"
  },
  "kd_q2WEHEA7szCKU3HgIqQ": {
    "date": "7/15/2016",
    "text": "Yes!!!! Oh, I gotta write more? Yes, yes and yes!!!!!   Onion rings: crispy and well seasoned.  Burger (hubby's report): delicious!  Better than his favorite burger joint.  Hotdog: yes! French fries: so perfect! Customer Service: A++ Yea we liked this place. First time here. Will def be coming back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IOtQQvbIoJHAySw1t6Xw6w",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. 10,000 calories, I&amp;#39;m sure. Worth every bit!  Deliciousness platter.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IOtQQvbIoJHAySw1t6Xw6w/o.jpg"
      }
    ],
    "user_id": "wxjUufkQ-h6rE_6agWE_4w"
  },
  "wTEoKZ_Pedn9ZTGRMALwMA": {
    "date": "2/17/2018",
    "text": "My SO and I went to Chubz last night for the first time. We used a Living Social coupon, (similar to Groupon). Antonio, co-owner, and Jake, other co-owner's son, were the best! We were greeted warmly by Antonio and we immediately felt at home. Both Antonio and Jake provided an endless source of amusement and laughter.  There CS was outstanding and they made sure everything in our order was correct. (More on that later.) The respect they showed to each other as well as the customers was proof that this place is real - real GOOD! I always check the restroom in restaurants, and theirs was immaculate. They offered us additional accoutrements to further enhance our dining experience. Now, onto the amazing food: I ordered the #3 Combo which consisted of a Deluxe Double Cheeseburger with their singular Chubz sauce. It also comes with a drink and fries. I opted to substitute coleslaw for the fries. My SO ordered #12 with a chili covered double burger, a fabulous hot dog-seriously great, with their fries and a drink. EVERY item is cooked to order, we were actually able to ask for our burgers MR, and they did it. OK, the burgers we had were OUTSTANDING! Moist, hot, cooked perfectly, tender and juicy. The coleslaw was not overly creamy, had a unique flavor and was very good! They serve very abundant sides. Their fries were handcut, crispy outside and tender inside. They're seasoned with their own concoction and absolutely faboosh! I told Antonio there we'll possibly be there once a week to ensure that we want to endorse everything on their menu. And I'm very serious! As a True foodie, chef and gourmand I urge y'all to pop into Chubz at your very earliest convenience. Believe me, you'll thank me! Tell them that Kara and Carl recommended them. (Hey, what's wrong with shilling for some free stuff, amirite?) But seriously, they're going to be one of your memorable burger/fries/dogs options in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8uuSRLXlFzrHSZRctxrNNQ"
  },
  "a-nIzB47o2-Ai2t7KJ7kZQ": {
    "date": "6/9/2017",
    "text": "Im not really sure how I feel about this place. I visited this place based on it's reviews but upon getting here had a completely different view.   When I got there, I paid for my food and watched the same man make it. He went straight from handling my money to getting meat out of the fridge without washing his hands. That freaked me out because this guy just took my money, literally a dirty piece of paper that's been held by tens maybe hundreds or thousands of people and right after jumped to go make my food without washing his hands? That was disgusting. On top of that the soda machine were out. Literally no signs on the machine just squirts water instead of soda. To me that's terrible especially when you just spent$10 on a sandwich fries and soda. The astetics just looks sloppy to me. I don't think I'll ever come to this place again.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4tfAmvjsxoS6NYADgVzVhQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4tfAmvjsxoS6NYADgVzVhQ/o.jpg"
      }
    ],
    "user_id": "sVn_rNopTpPik0iL_Xm7ag"
  },
  "Ro_yHrqEV8E3SQKJsIAJBg": {
    "date": "3/26/2018",
    "text": "This place was excellent. The chili was great and you get a lot of food for the money. I will definitely come here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LhxcE19_1ueyMi6_uCE7cw"
  },
  "Z1JoOYhRvx9sjfCofZrNyw": {
    "date": "9/19/2018",
    "text": "Awesome little hole in the wall. Will be back for sure. Ordered pickup and they were ready super quick and very friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A_C0M5dfmHNj0p9aEdqAAg"
  },
  "kP5nTGftOCI9lOVEzR_Sag": {
    "date": "3/7/2018",
    "text": "Best chili cheese burgers I've had since I moved here..... Reminds me of back home.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w2R9dpIvz5GgiG6VbHQwZA"
  },
  "KoPuMMuMzzpAt2PMHHu-IA": {
    "date": "7/24/2017",
    "text": "Nice place. Good food. Debatable prices. These 3 statements, pretty much sum up Chubz. I've been here only a handful of times. Whilst here, I've had the Barbalo wings. A chicken breast + bacon + cheese sandwich. And today, I'm trying the Double Chili cheese burger. In honor of CLT Burger week. TIP: don't be in a hurry if you plan on dining here. They've gotta have 1 of the top 5 slowest cooks in the city lol. But they do a nice prep job. And a decent presentation as well. 2nd TIP: don't get a burger without a burger bib/diaper",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nBnxd-aC3SX3UmFVOiOlOQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. No matter what mood I&amp;#39;m in, I could find something in this menu. From wings to shakes, they don&amp;#39;t disappoint",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nBnxd-aC3SX3UmFVOiOlOQ/o.jpg"
      },
      {
        "img_id": "BgDMWKOhJlIiT4DoXJexmg",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BgDMWKOhJlIiT4DoXJexmg/o.jpg"
      }
    ],
    "user_id": "leXAScJxQ_Un9qrgmDEzpA"
  },
  "wGEGrJgDI3m4Wz30W1U7rg": {
    "date": "10/10/2018",
    "text": "#1 with chili and cheese on the fries.  This place is great.  No chain joint here,  good old school burger joint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3NZJv0BpM-rc98PSVJDwFw"
  },
  "Ho6dD2tds9O9msDpIXAjGg": {
    "date": "7/7/2018",
    "text": "Down and dirty. Food is delicious. I moved from Jersey City two months ago and this place reminds me of Boulevard Drinks (almost).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uip_RTJ2FetHGAe29EIHRw"
  },
  "dOK7oQfT_J-Q79kalRMlbQ": {
    "date": "12/15/2017",
    "text": "We stopped in on our way to the airport; the food was absolutely AMAZING!! The staff was beyond friendly the cook chatted with us almost the whole time mostly about the star wars movie we're seeing tonight. It doesn't feel like a restaurant you feel like you're visiting with old friends who happen to make some of the best burgers around!!! This place is worth a visit and I'll keep hoping they come to Waxhaw",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yLD5WivN22URSmgRagHdAg"
  },
  "MkceDlp2k8QJqxSbukTv8A": {
    "date": "4/5/2017",
    "text": "I believe chili makes everything better! The chili burgers and hotdogs here are absolutely delicious. Throw in the chili cheese fried and a cold drink and you have the makings of a memorable meal. The service is great and the owner is extremely friendly. This is a must visit if you're in Charlotte or the surrounding area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yPso4yUTZb2eMFrF9GdJyQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. The chili burgers here are absolutely delicious. I always order the #5. The triple chili burger with chili cheese fries and a drink.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yPso4yUTZb2eMFrF9GdJyQ/o.jpg"
      }
    ],
    "user_id": "YEIajYxfhjUav55OdwQTOw"
  },
  "PPdwctgT5vrU4JRSWbvIWA": {
    "date": "1/17/2014",
    "text": "Every once in a while a girl needs a chili dog and some fries. So after running a few errands during my lunch break; I decided to treat myself to Chubz...well more I was lured in with their huge sign boasting \"FAT chili dogs and FRESH cut french fries\"!!!  Who wouldn't have turned in?  Since Chubz is the new kid on the block so I was excited to see what they had to offer. I was prepared to wait but when I got there a little after 12:30pm the place wasn't very busy and I was able to walk right in and order. I guess they are still building up their clientele...and that's just fine with me. I liked that the menu board was clearly labeled with all of the menu items and their daily specials (and for anyone that interested that have fried fish on Fridays!). The nice man that took my order ended up being one of the owners. He was very pleasant and made it a point to thank me for coming in and giving them a try.   I like to see that, especially for a new business! However, I was just not a fan of the food.   And here's why:  I ordered Combo #2 which comes with a Chili Cheese dog, Fries and a Drink.   Chili Cheese Dog: I just found it to be average. The size of the hotdog was great! Thick and juicy like I like 'em!  But I found the most important part--the chili-- to be just \"meh\". In my opinion, it needed a few extra spices to kick it up a notch. My other issue is exactly what Amy C mentioned...when I opened up my box (I got my order to-go) it was a hot mess. The chili, cheese and onions were spread all over the paper and that made one side of my hotdog bun wet.  And if you've read any of my previous reviews you know how I feel about wet...soggy... bread. Ugh.  Fries: Not for me. They were fresh cut which was a plus but they tasted sweet and not at all like what I was expecting. Perhaps it was the Cajun seasoning that they used but I hoped it would have been more spicy than sweet. I had a few, but tossed the rest. Grrr! I hate throwing away my $$$. Let's hope the onion rings are better!   Honestly, I'm kinda angry I wasted so many calories on this!   But I'm going to let them work out some more of the kinks (especially kicking up that chili recipe). And maybe...just maybe give them another shot.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "2jrx_FKxxHCRi4ZNv-IbSg",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Cajun Fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2jrx_FKxxHCRi4ZNv-IbSg/o.jpg"
      },
      {
        "img_id": "YuhXu65qmpdPFI7FxIkOMQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Chili Cheese Dog",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YuhXu65qmpdPFI7FxIkOMQ/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "gB1vihqdpAx2IWILf7nOtg": {
    "date": "7/15/2018",
    "text": "OK folks here it is. For those lucky few that have had an In-N-Out burger and dream of the day they move east, meaning east cost. Well I don't think us In-N-Out fans will ever see that happen. Here is the next best thing. When you go to Chubz get the Deluxe Chubz burger. It is a double cheese burger with lettuce, tomato, Chubz sauce, on a toasted bun. It is the closest thing to In-N-Out's double-double, and I think better. It was fantastic. Fresh right from the grill. Made me think of the time I had my first In-N-Out. I almost cried, cause I had finally found a place here in Charlotte that could make a burger like In-N-Out. And I feel the best in Charlotte. I would dare to say better than Shake Shack, Smash Burger. and all the other burger joints in town. And the owner of Chubz should know About In-N-Out and Tommy's cause he's from California. So folks I pick Chubz as the best burger joint in Charlotte. Hands Down the Best!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nqxmrZIefdCZ28uLEHOP8Q"
  },
  "Pe60fyLkUO1__UnqTT5UGA": {
    "date": "2/7/2018",
    "text": "My coworker and I went for lunch today for the first time based off of a tip from a friend and it did not disappoint! I ordered a #1 which is a double patty chili cheeseburger with fries and a drink. I added chili and cheese to the fries too for an extra $1.25 which was delicious. The man who took our orders was very friendly and came around to ask us how our meal was later. Even the lemonade (not minutemaid) was pretty good. I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ql4y7UK5nHB6xMxjhbb8mA"
  },
  "lf8b_7RbPnnr_y4CtVDqAg": {
    "date": "7/7/2017",
    "text": "First time here was great! Great food & great customer service.... & don't forget to get some of that extra extra special sauce!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DeVWWy0QP57lvOzesW-3TQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. food was amazing!!! &amp;amp; that sauce tho!!!! Definitely will be returning this weekend &amp;amp; the next lol :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DeVWWy0QP57lvOzesW-3TQ/o.jpg"
      }
    ],
    "user_id": "PHZA5dSGu0KlNTl5Cd248A"
  },
  "bXBSw9h-ize1r-ZiYJ5rvg": {
    "date": "6/29/2018",
    "text": "The burgers, fries, hot dogs are amazing here. Customer service is always excellent! Their Deluxe Double burger is by far the closest thing to an In-N-Out burger. The sauce they put on it is amazing. Come and check out this place, you won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CvpIJB9WXFH8PeO5jOZCsQ"
  },
  "BKZIurjYK7Jo9x7oNoZSeA": {
    "date": "7/1/2017",
    "text": "Chili is delicious! The chili dog and fries were good. A few too many onions on the hot dog. Sweet staff. Nice clean establishment. I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g9fC-TqIoo-SmaKzhTY7bQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g9fC-TqIoo-SmaKzhTY7bQ/o.jpg"
      }
    ],
    "user_id": "ldajF_g_hJ4kp63eIsrIBA"
  },
  "iRvqxNm3oVv76KxAxx7piw": {
    "date": "11/1/2016",
    "text": "Just moved here from California and I have Been looking for a good burgers for a couple of months and Jack pot ! ! ! Chubz is the place I'm happy to taste ! Fast friendly service  From Antonio the chief And I'm going back tomorrow to try the rib eye streak sandwich  They have hot dog's some EXCELLENT chill  And other tasty entries  ( go to web for menu) in my opinion they WILL do well Just by word of mouth...I was in bank of America  and and they recommend  chubz it's that good  BRAVO.. MARVELLOUS.. EXCELLENT",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mHzdgWrO9WOZsUMpbXxvpw"
  },
  "46bewxFCVRk_dWumemF2lg": {
    "date": "7/7/2016",
    "text": "Great burger! Cool small burger joint with great chili and delicious fries! Definitely coming back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ls4O35lcANH4bEb7WlBD7Q"
  },
  "wQ603q1uepFx5NvHg1cN0A": {
    "date": "8/5/2014",
    "text": "Check this joint out for good old fashioned burgers and tasty fries. We went there today. I had the number one combo which is a chili burger with the works. Great burger. The owners are from California and have tried to hitchhike on two SoCal favorites. Tommy's and In and Out. So far so good. The burger was prepared perfectly and very tasty. The Mrs. had the special which was a BBQ sandwich and thought it was great. Don't miss the fries. They are well seasoned and served hot and tasty. We will be  going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SHk9cw9nBCDFPV2tIkhlBQ"
  },
  "8baAB3BYgg0p9N1jKUAytw": {
    "date": "6/4/2016",
    "text": "Great dogs, great chili, great fries. The staff was friendly and quick. Location is kinda weird, my GPS pointed me to the gentleman's club. It's at the other end of the strip mall...ha. I will try the cheesesteak next time that I come. They also deliver within a 5 mile radius. Other things that looked good on the menu: hot wings, hand battered onion rings, and unique ice cream and milkshakes!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dpFM7Hyn1pLTKow-CT0BSw"
  },
  "XdP57tcyqbi20PMOtVOGsw": {
    "date": "1/25/2017",
    "text": "I do not come to Charlotte without eating at Chubs! This place is a must eat. I compare the burgers to Five Guys but at a cheaper price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_yUEI_Tl6Kk0hG3-yq5yGQ"
  },
  "BEK8URrrdjNtgwDj_R4hQw": {
    "date": "6/21/2014",
    "text": "Leave the wrapper on the burger or your hands will be a mess. This is a good place to get a burger and fries - both with chili and cheese.   The service is quick and the staff is extra friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jXupHuRS88DkeNcfWSO4gQ"
  },
  "7h_PVGXS46HE0EyE8onrzw": {
    "date": "5/16/2015",
    "text": "Have been here several times, never disappointed!! Always fresh,hot, and tasty! Wonderful service, always friendly!! Contributed success and we'll see you soon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BEr4DFc1a0B1ptzj1Bb0YQ"
  },
  "AlOI_hP9mWdWSY-qEaLEcg": {
    "date": "4/24/2017",
    "text": "Everything was terrific. Was in Charlotte for the night and ordered to our room for the family and everything was A+. I'm from Denver would highly recommend to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ovAUDBiudIfY2DOjf24CLQ"
  },
  "ZR6cwzYpiFjqgJmo-bCrMg": {
    "date": "7/21/2016",
    "text": "I think the food is great, service could be better.  Last time we were in the owner seemed thoroughly annoyed that we were there.  But, we do like to go when they are open.  It seems they close sometimes without notice and are no longer open on Sundays, which is a hurter for our football Sundays.  Fries are outstanding, burgers are great too.  My boyfriend really likes the cheesesteak as well. Prices are definitely higher than you would expect, but the quality is good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Owrofb34MywrG9sm1It8Dw"
  },
  "8jAaZ8zOc_7NG1Kft2yxvw": {
    "date": "6/6/2017",
    "text": "From a former Californian, this place tastes very much like an In N Out burger! I ordered the number 3 combo double cheese burger combo plain. Just meat and cheese. So, it was delicious, so much better than expected. This place is located in a strip mall by a strip club---yes, that's correct. Near a gentleman's club in a sketchy strip mall but it was decent and had tasty and fresh skin on fries. What a surprise finding this local dive burger joint. The owner was chatty and friendly and we reminisced about California and the good ol' burger joints there. I don't do chili on burgers so you're on your own with that animal but for a regular cheeseburger and fries, this is a must try burger joint. Not fancy or special but truly fresh and delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QswCcPD_5phSxLY3nyWoDA"
  },
  "6xWRa9WEnVSV6gwzkFblPg": {
    "date": "4/29/2014",
    "text": "ok, I've had a few chili cheese burgers, and do like em every once in a while, so after seeing decent reviews of Chubz, a friend and I ventured over to see if it was the real deal or not. I entered during a lunch hour, was fairly busy! I can tell people do like this place,  its a \"place your order and pick up your order\"kinda joint. Greeted by friendly staff, not bad! They have outdoor seating and even a drive thru.  #1 combo , double chili cheese burger and fries, fries are fresh cut.  Fries are fresh so is the meat in the burger however,  my fries were a little over done and too greasy. The chili cheeseburger was a disappointment.  I was imagining some good chili, but it tastes like its from a can. Carried that \"chili seasoning\" flavor if you can catch my drift.(Chili i know of never calls for chili seasoning) I barely recall seeing any meat in the chili at all.... im thinking it's canned.  After all the hype of local grass fed beef, I was excited!!  Chili isnt homemade (what i was expecting) ruins the burger...chili cheeseburger didnt live up to all the hype at chubz, I wont be traveling back..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ckNC7Ynh4ad-3es4Jb0kQw",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Chubz #1 combo, double chili cheeseburger and fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ckNC7Ynh4ad-3es4Jb0kQw/o.jpg"
      }
    ],
    "user_id": "R4l3ONHzGBakKKNo4TN9iQ"
  },
  "Wogf5ZYgvqz1DMUelNT6Xg": {
    "date": "3/25/2016",
    "text": "Great lunch spot. The staff was friendly, the food was great. I ordered the number 1 (double chilli cheese burger, fries and a drink). It reminded me of five guys but, a little less grease on the burger. Still messy due to the chilli but, they wrap the burgers so that they are easy to eat even though sloppy (awesome!). The fries appear to be fresh cut and they give you plenty - I got through about half the fries and I was hungry!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UJdV27tvroF63sIKvaKmTQ"
  },
  "WOTJ3x32lyNNXitoqSt7Tg": {
    "date": "7/17/2014",
    "text": "We were looking for something quick to eat and decided to try this place based on the good reviews.  Glad we tried it!  YUM!  We ordered the #1 Combo;  Famous Double Chili Cheeseburger,  fries and a small drink for $8  The atmosphere is casual and comfortable..nothing too fancy but not disgusting either.  We chose to eat in due to the place being clean and my hubby wanted to watch the NBA Summer League game. The staff were very friendly and appeared happy to be working there. .  Our food was ready less than 10 minutes.   Im beyond happy about the fresh HOT FRIES!..I'm really not a fries person but when I do eat them I want them hot!..These were fresh out the grease and not re- cooked or over salted. They have season salt for you to add for taste. Leave the wrapper on the Burger!  Two Hot juicy patties, fresh tomatoes,  cheese, diced onions, mustard and yummy chili. The chili isnt award winning but it has flavor. There's just the right amount of chili for it not to make the bun soggy. The meal was good and I was full.  My hubby also gave his approval.  He usually don't get full from fast food so he was pleasantly surprised.   The price is right for a Combo meal but $6.50 would've given it a 5 star rating. The meals range from $7 to $9.50 ...I'll be back to try something else on the menu like the Deluxe Double Cheeseburger AND Jumbo Hot Dog, fries and small drink for $9.50..now that sounds like a deal! ...don't forget to buy a Groupon for $16. You get TWO Groupon vouchers both worth $16 each..only one Groupon per visit, per person, per table.  So basically the hubby and I get our next meal for free! #ChaChing",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zTOI1--GfJJbhzf9MTDInA"
  },
  "h85prWLzOjq4HwATxqj3Fg": {
    "date": "2/3/2016",
    "text": "I have been wanting to try this place for awhile. The wait was worth it!! I got the #6 which consists of a burger, chili dog and fries. I needed a good cross section of the menu. Got after the dog first: good size, great chili and solid bun. Next was the burger: really tasty, fresh toppings and did I mention it was 2 patties!! Fries were hand cut, salty and super crunchy! Great joint!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DGmaWL5l_c_WX9WQCmM-tQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Welcome!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DGmaWL5l_c_WX9WQCmM-tQ/o.jpg"
      }
    ],
    "user_id": "wjH_dt5w1CrRuw_x1-bOwg"
  },
  "LNDCtASvqrXTroVIGXeVHg": {
    "date": "1/30/2015",
    "text": "I've been hearing about this place for a year, so today someone convinced the entire office to partake. No one had tried it and we were all curious. The full consensus, save the one person that recommended the spot, was that the food was truly average at best. Fries, burgers wings, onion rings, hot dogs- just regular food. Nothing outstanding.  Frankly I'm a lil shocked at some of the high reviews, if what we all had today was the norm. Are we reviewing the same place? Chubz with a 'z' right??",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3y_Op5BgB7o3k6-ULqIuyQ"
  },
  "mH3ydPmzZZpU-WSJOvQw4g": {
    "date": "5/27/2015",
    "text": "Third time visiting. They had a score of 90 posted from the health department. We were the only customers at 6:00 for dinner. Floors were dirty, tables were dirty. Gentleman whom I assumed was an owner/manager barked orders at a young girl who worked in silence. A guy came in assumedly reporting for work. Owner barked order to \"suit up and take out the garbage\" while he sat at the end of the bar watching Fox News with the volume turned up. Not a pleasant experience. Food was average. Onion rings were greasy and burnt. Will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "oIcE3Vzbqi2wRVZ96iSEug"
  },
  "tT6Wfh6YEyOBcryrA9V__Q": {
    "date": "6/22/2015",
    "text": "The 2 stars has more to do with the customer service than the food. I came here after a recommendation for a good chili dog. Although the hotdog was just okay and I wasn't a fan of the chili at all, I honestly think the customer service from the cashier, I assume management, probably affected my desire to even eat it.  I guess if you are not used to the \"correct\" way to order it annoys him. Needless to say once I realized he was being a bit of a smart a** with me, he must have seen my facial expression change because he then tried to clean it up with a small joke. I could tell that even the cook noticed that I was bothered because he kept looking our way and was overly nice when he started to make my order. I'm not sure if I'll come back here but I definitely hope the next customer is treated better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eSMG5qmwO_H_3xh50TMAGw"
  },
  "bVRC5fPGqh1pizpJ6lmEjQ": {
    "date": "4/1/2016",
    "text": "In and out on the east coast !!! Love there food burgers were good the cheese steak was amazing !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0dcZILYfEAZEq25MSm3mXQ"
  },
  "c5S4SP4eQ3yJoV32eSmNlQ": {
    "date": "3/27/2015",
    "text": "Ignored by staff and manager multiple times before I walked out.  Grill had not been cleaned since last night's closing. Fat and grease were piled up this morning as I saw her turn on the grill and put new meat on there for the first time.  Showed up at 11:20, 20 minutes after they open. Only found one person flipping burgers. Waited a few minutes for them to acknowledge me and finally just asked how do I order. She said someone will be with me in a minute. It was obvious the owner was in the back room still prepping to open up the restaurant and talking about their computer problems with another manager.  Burger flipper finally took my order and passed it off to her manager, then I waited a few minutes to ask about the drink. She had handed the cup to her other customer minutes earlier.   As manager walked by three times and ignored me I finally asked him straight out can I get a cup please while I wait for the burger. He continued to walk by me to prepare the register. Then walked past me one more time and ignored me as he went to the back room to continue prepping the restaurant.  At least Bojangles or McDonald's will acknowledge the customer when you want a fast food burger.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "GnYz3_1cFkd2dHRveSxcDA"
  },
  "u9ANo3v90WXlfzMTORbdow": {
    "date": "3/12/2016",
    "text": "First off, the place is a little dysfunctional. If you accept this, youll be fine. If you are frustrated by this, please be patient. The burgers are actually worth the aggravations of slack service, out of stock on drinks, etc etc.see the reviews below and elsewhere.  the place is newish, already a little shop worn, dont let that throw you, it is clean. Dont let the somewhat seedy neighbors throw you either, its worth the visit. Most importantly,it is worth the price,its not a cheap belly buster burger,its what burgers used to be everywhere,before mcdonalds ,hardees,changed things.  These burgers are worth coming across town for. The plain ordinary fries are nothing to write home about, so, go ahead, get the chili,or cheese,or,,best yet, chili cheese fries.  But, the star, is the burgers. This, they have exactly right. Toasted bun. Fresh lettuce,tomatoes. Have not tried the slaw yet. Chili is nice, good, doesnt linger at the bottom of your stomach,or on your breath. Burger cant be frozen, tastes fresh, clean, perfectly cooked....every time. Even the mustard tastes like Sauers all natural, not the garlicky Frenches. Get in the car, go there now.Enjoy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pK0f5jlz1dfZLiZgM2rsWg"
  },
  "RXYHPsFuDiz_RotEI1RTAg": {
    "date": "6/21/2018",
    "text": "I wanted to love this place & was ready to overlook everything (like it being next to a strip club) but I don't quite taste anything famous or special about the chili burger, chili dog, & onion rings. Was excited to try but flavor fell way short for me.  The guys are super kind & helpful. The drinks were really Good! I think it's cute they have a store pet lizard, that's different.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c9Z4a8_7-LPd0kiELH6BDg"
  },
  "DFZucX4n87kC8FzTBczCUg": {
    "date": "1/24/2019",
    "text": "Inside decor is not much to look at but food is awesome! Friendly staff helped me decide on what to order and it didn't disappoint. It is kind of hidden but so glad I searched for burger places around and found it!! It was perfect for my cheat day since I normally try to eat healthy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oe2SpZLdlwYrQSpnwo4VuA"
  },
  "NufwJMTeCYaGImSgHJEZAw": {
    "date": "11/24/2018",
    "text": "So, we are traveling back to Alabama from MD over the Thanksgiving holiday. We stop at a hotel to break up the trip and come across CHUBZ. The person who answered the phone told us it was going to be great. He then delivered the food and doubled down on his initial statement. I have to say I didn't think CHUBZ was gonna live up to the high expectations they set. Not only was I wrong... I was unbelievably wrong. Historically wrong. This place is baller... like better than Our Thanksgiving meal baller (maybe that's an inditement on who cooked our Turkey Day meal?) Seriously though, CHUBZ came in WAY above expectations. I've never really liked anything (besides pizza) that was delivered but these guys hit it out of the park. In any case... when we're back I'll be visiting again and we definitely look forward to the experience! Well done CHUBZ. Disclaimer : I know this sounds a bit over the top but I genuinely mean everything I wrote. Everyone in my family loved it. Very strong... wouldn't write this if I wasn't that impressed - Thx again  One other thing. I got the turkey club and it was the best I've had. Turkey was like they baked an entire turkey and cut chunks off. Rest of the family had cheeseburgers and cheese fries. Everyone said it was one of the best burgers they've ever had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KhxGklLWKvnzruUSuLvj8Q"
  },
  "899k0wqE1c_oJFYLe3IDOQ": {
    "date": "11/2/2018",
    "text": "Wow, I did not expect that. I ordered the double chili burger and jumbo chili dog. It was amazing! And the staff was incredibly friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xW8gUtvAr8ZBEjZC3hfWAA"
  },
  "uj896WuQch-2WoQlECpJGQ": {
    "date": "12/31/2018",
    "text": "Excellent food. I had the patty melt (super yummy) just on its own, no fries, and I could not finish it. My friends had chili burgers and they were equally good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nQJw1DUqU1elxnr7mPIZ-g"
  },
  "K_P2qI6ST90xX-2XiyK5IA": {
    "date": "2/23/2018",
    "text": "Great burgers! Great hotdogs!   Mom and Pop shop, without the mom lol  Very friendly people and they have a drive thru",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KPvdYi3x5ON6l26xnKbDJg"
  },
  "Q9D9irHxDV6qiDyDPKTvLQ": {
    "date": "3/13/2018",
    "text": "My favorite place for a great burger (and chilli cheese fries). The owner is from California so his burgers are somewhat like In and Out burgers. The secret sauce is similar. You also cant beat the value for what you spend. Check out this hidden gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3CsG0wUvWFY2JuVXaf-Z5Q",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3CsG0wUvWFY2JuVXaf-Z5Q/o.jpg"
      }
    ],
    "user_id": "CvIe6-G48IQLFg91mGatQA"
  },
  "Sijtn09jEzbJH72tjZFQug": {
    "date": "11/16/2018",
    "text": "This is one of favs in Charlotte although the food is very good and 98 percent of the time I receive exceptional service from the owner, tonight was different the cashier was very rude (I believe it was bc it was close to closing time) but everything I tried to order they were out of which I understood bc I work in the industry as well and know how it works during closing time but to say it with a attitude just lured me away from this restaurant I always recommend this place to my friends but after tonight they lost me as a customer I have been coming to this establishment since I moved to Charlotte and have never been treated this way",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o3iI7XYlkd67xvRLo4Lkkw"
  },
  "91sgz03tzoaZfoXTDJXuQA": {
    "date": "2/12/2018",
    "text": "Great customer service, cheap beer and delicious food.  The fries are fresh cut and nice and crispy.   I had the #1 - Chubz Chilidoubleburger with fries and a chili hotdog. Both were served fresh and hot.   The beer is only $1.50 for yuengling!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rkBVrMwjJlWDVhOLWpMD5w"
  },
  "DWF6vtOjK7WyybngEKuVHg": {
    "date": "3/5/2018",
    "text": "Oh my!!! If you're looking for a mouth watering burger.... look no further! The fresh meat is perfect! The chili was great and the chicken tenders were fresh and huge! The honey mustard is home made. And the fries... Holy cow! You know those salt and vinegar fries that you go to the state fair for well these are sooooo much better!! Oh wait... the owner and staff were so great! They told us the whole story behind their chili and the history of the business! One more thing.... in the bathroom they have quotes that are very inspiring!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0WWelRMtClcl4vnMPyaT5w",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0WWelRMtClcl4vnMPyaT5w/o.jpg"
      },
      {
        "img_id": "zdILvZ3UNBmwX-or3ZX8yQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zdILvZ3UNBmwX-or3ZX8yQ/o.jpg"
      },
      {
        "img_id": "vFqdrRrzVIH6MQ-U5nyYvA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vFqdrRrzVIH6MQ-U5nyYvA/o.jpg"
      }
    ],
    "user_id": "BdHJATNVTtQlbFHnTPCghg"
  },
  "LYN2nK82KWNNC8Vf9xmTSg": {
    "date": "5/2/2017",
    "text": "As burger joints go this is about as good as it gets. My burger was cooked to perfection, the toppings were plentiful but didn't take away from the burger, and the fries...awesome. Don't be taken back by the location. It's clean inside and the service was wonderful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "24e1SAOBBys9Z5U3DXI3Gg"
  },
  "6aDL7r7QX39w9H97ot2aiQ": {
    "date": "2/25/2019",
    "text": "Staying at a hotel next door before our flight back to California and popped over for a quick dinner. The owner is so fun, from CA himself, and knew right away what to offer. He gave us a personalized order experience, sure to deliver the goods - the likes of In n' Out and Tommy's from home. It was BETTER. Throughout the meal he stopped by to chat more about the food and the inspiration for his incredible menu. I wish we weren't on our way out of town and were able to come back, because the food and his company were top notch! Go out of your way to come here, and get yourself some extreme chili cheese fries when you do!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BHvmEL9VZWvvdCR-xXEXcQ"
  },
  "osBLcHsX3cFEnF_qU2_ckg": {
    "date": "9/13/2018",
    "text": "Awesome copycat of In & Out Burger & Tommy's burgers menus. A great stop for ex-southern Californians who miss our favorite foods. A little pricey, and plain atmosphere, but GREAT food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NooS72oyN7XR7k5vAOp2pw"
  },
  "VVl7YD6oyTpzzL6Yz5A0mA": {
    "date": "2/17/2018",
    "text": "Hands down, one of the best burgers I've ever had.  Also had the chili cheese fries and a chili cheese dog but the burger was the best part of my 3,000 calorie dinner. Lol",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCRL4inyEgxXGLPiCJk1iw"
  },
  "i9ROM0esGrBR0rGonlwmow": {
    "date": "8/18/2018",
    "text": "This burger is delicious... fries are fantastic and the Chili as well.  Great service to go with it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lgz8KWLk0UptNl7eVwCslQ"
  },
  "yB_3ar-P1BsPIhDjdss3_A": {
    "date": "1/18/2018",
    "text": "Amazing burgers and atmosphere. Steve is the Owner and so friendly and treats everyone like family. Picked up a quick dinner and will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fiOL6G7gcp1HEN_9o7o8HQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fiOL6G7gcp1HEN_9o7o8HQ/o.jpg"
      },
      {
        "img_id": "eFQVSsFthUCG237hL42Eog",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eFQVSsFthUCG237hL42Eog/o.jpg"
      }
    ],
    "user_id": "Ftr2OFKUx-BvGPJ8XqafHA"
  },
  "JRimhEoniCwaBokB91TYwg": {
    "date": "11/28/2017",
    "text": "Great service Wondeful staff Best burgers I have ever had Love the milkshakes and cookies!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z2AKbQs89emmBxdrinNiIA"
  },
  "8Q7MH5d-fvWsRrawNy5Cpw": {
    "date": "5/10/2018",
    "text": "I would rather see an employee with a clean apron than a dirty apron that seems to have been used to clean a mechanic's oily hands. The employees wore gloves which is fantastic being that their appearance was not up to par. The food was great! I was full by the second bite! Omg! The size of the burger! I was defeated! The toppings were so fresh and the burger was made exactly how I ordered it. I prefer Coke products over Pepsi, but to each its own. Overall, my first experience here was worth the try.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5QPwVu-tyW4LRXBO4rbUow",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5QPwVu-tyW4LRXBO4rbUow/o.jpg"
      }
    ],
    "user_id": "X1JbUXd1EymTCVLJyTKakg"
  },
  "11ZAZJGbgNYWioCyJfRBQg": {
    "date": "6/8/2017",
    "text": "This place is a wonderful take away from Southern California. We visited here with family along a roadtrip and it DID NOT disappoint. It provides that same flavor and feeling that the east coast is desperately missing.   When we first arrived the owner told us that it was like In n Out or Tommy's down in LA. He was not wrong. The food was excellent and it was definitely a reminder of past trips to the west coast. I just wish we had one up in New Jersey.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RCG9Q1kOSYwSbP37AcCwOw",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. #12 and a #1. So good",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RCG9Q1kOSYwSbP37AcCwOw/o.jpg"
      }
    ],
    "user_id": "pFMxdEUp0ccInxOx71DNIg"
  },
  "LXSQk3VhOUdbUuf_0g9cDg": {
    "date": "8/20/2017",
    "text": "My fiance and I decided to stop by because we had purchased a 2-Groupon deal for this place a while back. Our first impression was that there weren't many clientele for 5:00 pm on a Saturday evening.   When you first walk in it feels like the place is dirty and it doesn't help that it is located next to a gentlemens club. The bar counter we sat at was sticky and the station where the owner was cooking looked really greasy with all his tools being dirty. He did wear gloves when handling the food which is good but it didn't take away from how disorganized and dirty the place was.   I ordered a #6 which was a deluxe double cheeseburger, with a large chili dog, fries and a drink. When I went to fill my cup from the drink machine, the machine could not dispense water. Not sure if it's connected to a water source or it's broken. I went with Diet Pepsi instead which to no surprise it was flat and tasted moldy.   The food was mediocre at best but I will admit that I did like the burger. It tasted good but it was runny. The mayo seems to be more watered down then regular mayo. The chili was not impressive at all which makes me question as to why it's called \"famous chili\". The fries were extremely greasy and tasted as they were fried twice.   The owner asked us if we wanted to dine in or take out and I said take out. I didn't feel comfortable dining in a place with no other people in it. Anything I would have discussed with my fiance the owner would have heard across the bar. There was no music playing just a faint TV  sound in the background.   As far as price goes, it is overpriced for a fast food place. Along with the $10 off Groupon we ended up paying around $17 on top of that. $27 for 2 mediocre burger meals sounds extremely expensive and to be honest I'd rather have a decent burger at a restaurant for less money.   After our meal we felt disgusting and later when we got home my fiance got sick and threw up his meal. We have another Groupon for this place but we will NEVER go back. We learned from that mistake.   To the owner: The chili is just not good. When you base your whole business around your \"famous\" chili and your chili is subpar then do you really have a business? I think major changes need to take place in order for this business to survive, including practicing proper sanitation techniques. When your food doesn't taste good and makes customers sick then customers won't ever step foot at your place again.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "1b5o-dSfaJbi9AkdrJnDZw"
  },
  "s9ct4ye2ciXwHBj0290Znw": {
    "date": "11/19/2017",
    "text": "I've been hearing for a while that this is one of Charlotte's classic older restaurants and I finally got a chance to try it. It did not disappoint! Of all of the cheap burger joints in Charlotte that I've been to (Pinky's, The Diamond, etc) this is my favorite so far. It's in a strip mall next to a gentlemen's club, so don't expect anything fancy. We went for dinner on a Friday and were one of two or three groups there.   The food is outstanding. We got the double cheeseburger deluxe and chilli dog combo, upgraded the fries to chilli cheese fries, along with a butter pecan shake. The burger was one of the best diner burgers I've ever had. The flavor was incredible. The hot dog was also amazing on its own and the chili only added to the flavor. The chili cheese fries were delicious. The fries at the bottom without anything on them were just ok. The shakes were the only disappointing part of the meal. They didn't have much flavor, but it may have just been the flavor we got.   We will definitely be back here frequently!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "o2cFqzT-Ic-K4yMo_WnoRg",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Chilli dog",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o2cFqzT-Ic-K4yMo_WnoRg/o.jpg"
      },
      {
        "img_id": "KKb_LLp4ykpYsAJ4Tl0WZg",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Double cheeseburger deluxe with chili cheese fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KKb_LLp4ykpYsAJ4Tl0WZg/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "lZWgOGWapln9oEOyX79gvQ": {
    "date": "6/8/2018",
    "text": "We went here based on the yelp rating and the menu. The food wasn't half bad and the workers and owner were very nice. The main problem that we had was that the website through yelp was outdated. The happy hour deals and kids meal discount that were advertised were nonexistent. The food tasted great and if the buns were toasted that would be a perfect addition. I would return, the website just needs updating.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f096OrN0426rxMfbPhDpMw",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f096OrN0426rxMfbPhDpMw/o.jpg"
      }
    ],
    "user_id": "nwwyskuUFnqAHjb35FtnWQ"
  },
  "wVa-Abw9iRuF1uCdFaR9dw": {
    "date": "10/14/2018",
    "text": "CHUBZ is without a doubt the best hamburger, let alone chiliburger in all of Charlotte - I dare say it exceeds the flavors of its LA inspiration Tommy Burger.   The owner is a kind man that takes a genuine interest in his customers, and more importantly, their experience. His love of food exudes from his person, as does his jovial charming persona that always remembers a face, including my own, even after months.   My wife and I absolutely love the place and can not recommend it enough.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "dOkfZ3MR-lYq817qrArY4Q"
  },
  "2WyvgupfVfE1mQ3ZdLjYIQ": {
    "date": "2/14/2019",
    "text": "I was skeptical about this spot. I'm pleasantly surprised. I had a chili burger, fries and a drink. All for less than $9.00. You can't beat that.The fries were hot and seasoned. Staff was friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AUtqZrxmZHYK7xCvnfNr4Q",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. CHILI CHEESEBURGER AND SEASONED FRIES.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AUtqZrxmZHYK7xCvnfNr4Q/o.jpg"
      }
    ],
    "user_id": "aJgytmO_eEom6n_FgnNt_Q"
  },
  "2HtzdJwG7XRZyrlYm5KeMg": {
    "date": "7/18/2019",
    "text": "Our favorite place to eat in Charlotte. Chubz sauce and the chili is to die for! We always leave stuffed. The food is reasonably priced and large portions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZmvADZ1AJLOoB-ukGU-5yA"
  },
  "OZYPPN2CfeDjAk74HZClMw": {
    "date": "4/12/2019",
    "text": "The burgers are really good and the chili cheese fries are as well. Surprisingly the sweet tea was what put the meal over the top! Will be back to try different items on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9oWcT6_78w5MGvLwCpZq9A"
  },
  "LTgp6qxoW0gcxzH4jms0Dg": {
    "date": "3/4/2018",
    "text": "We've been seeing Instagrammers recommending this spot, so we decided to swing by. Its location is plopped in the middle of a sad-looking decrepit strip mall with transients and junkies walking through the parking lot frequently. Stay classy, West Charlotte!   Anyway, with our puppy in the car, we pulled up to the drive-through window (no menu on display, so have the menu up on your phone if you're going to do this). We were told there were 10 orders in front of us. So we waited. And waited. And waited. Not so fast food! Are they killing the cows in the back?   Placed our order and were told it would be 6-8 minutes. Sure! We've already come this far, right? It was closer to 20 minutes, actually.   Once we got our somewhat overpriced food, I was iffy about it. Sure, it was a good, greasy, trashy burger, but you can get that elsewhere for less money. The fries start off decent, but the greasiness soon becomes too much to handle. I didn't finish mine, which is next to blasphemy for me. We were given a free chocolate chip cookie for having to wait so long, which was actually a damn good cookie.   Between the long wait and the sketchy atmosphere, I doubt we will be back.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TLkPHRJX9yCJhy1kQXTe5Q"
  },
  "qB2WRj1U66zDZt-Fm8jZkg": {
    "date": "4/14/2019",
    "text": "Great surprise!  The shopping center it's in is...well past it's prime, but it's one of the best burgers I've had in a long time.  It makes me wonder why everyone isn't putting chili on their burgers.   On top of that, I don't think I've liked a group of restaurant employees this much either. They were fun to goof around with and we got to watch Tiger winning the masters together!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2KqxNH0aFwj1rC8xOAzOQ"
  },
  "IoxeKHkYQXt2ptahAs2Knw": {
    "date": "6/26/2019",
    "text": "The food is quite good. The personal service is top notch. The manager there is very friendly and the casual atmosphere made for a very relaxing visit. Jake the Shake Maker prepared us several milkshakes that were perfect.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0MrQJx8cw-2IOccnHn6DrA"
  },
  "AprHr0A50y8DI3IZ5nx3AQ": {
    "date": "4/14/2018",
    "text": "TL;DR - Delicious, no non-sense chili cheseburgers  Food - 5/5 - Yoooo!  The burger was amazing.  Went with the single chili cheeseburger with everything on it.  The burger was well seasoned and the toppings were in perfect proportions.  Chili was complementary to the entire burger as opposed to making it feel sloppy or extraneous.  In a world where people are constantly trying to push the envelop on burger toppings and presentation techniques, it was nice to have just a solid, well-constructed, evenly proportioned burger.  To me, it's like a better version of shake shack.  The fries were also delicious.  They were crispy and well seasoned.  We did not get chili cheesefries, but I can tell that the fries would hold up extremely well and be delicious.    Ambience/Decor - 3/5 - Inside has an old-fashioned 60s/70s vibe.  By vibe, I mean it looks like they haven't changed the place since they opened it except for regular maintenance.  It was exactly what I'd expect from a place like this.  Outside was a tad on the sketchy side and I'd probably be hesitant to take my wife here at night (but realistically, I'm sure it's fine).    Price - 3/5 - Not cookout cheap, but picing was fair  Service - 4/5 - It's a low overhead operation, so don't expect a ton of staff.  But the staff was quite helpful and prompt.  A bit of a hidden gem if you ask me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r59lKQbA-kw8vPzi-d0_hQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r59lKQbA-kw8vPzi-d0_hQ/o.jpg"
      }
    ],
    "user_id": "fv0nwcqNSsbm3kUiX5Ijkg"
  },
  "mMomUnVfXSU45VDepq6iag": {
    "date": "1/28/2019",
    "text": "One of my favorite things to eat when I'm in NC is a chili cheeseburger. I visited Chubz after reading some reviews. Chubz is a small quaint restaurant located in a shopping center. Plenty of parking but limited seating. When you walk in you'll see the open kitchen and a register. It reminds me of one of those old diners from back in the days. There's a huge menu on the wall so it's easy to make your selection. I ordered the # 11which is comes with a single burger with chili, cheese, tomato, pickle, mustard, and onions. I opted out of the tomato and onions. You also get natural cut fries and a fountain drink. The burger was good but if you're hungry definitely go for the double burger because the burgers are thin. Everything came out fresh and hot. The gentlemen cooking and working at the register are friendly and make sure you're satisfied. Chubz is a good spot to binge out on unhealthy food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kD_QusX_PJ026QX1_SFQDw",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kD_QusX_PJ026QX1_SFQDw/o.jpg"
      },
      {
        "img_id": "YRy_bBPzr-L_A3-gQhWPNg",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YRy_bBPzr-L_A3-gQhWPNg/o.jpg"
      },
      {
        "img_id": "HZ8YBCh2420TvtbHivvwYA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HZ8YBCh2420TvtbHivvwYA/o.jpg"
      }
    ],
    "user_id": "_drRmEXSwtAueMM9OY54LQ"
  },
  "w0QxlXxH9XcAJfO1r_UcOA": {
    "date": "7/1/2019",
    "text": "When in new towns, we always such for great burgers and chicken.  This weekend we found Chubz in Charlotte.  Absolutely one of the BEST burgers we have ever had and their jumbo chili cheese dog was up there as well!!!  We will definitely go there every time we are in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E0SIdu2gbYdNWf6cR2MQ5w"
  },
  "jVYDxTdZhFNebNPFoUPtGA": {
    "date": "3/20/2019",
    "text": "I came here for lunch as it was highly recommended by hotel staff. They have fresh cut fries and you can taste the quality in them. The burgers and toppings are fresh as can be. Friendly staff, quick service, casual atmosphere. If you want a good homemade burger this is the place for you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fDlh1AFwKohc092MZFWQ8Q"
  },
  "nArhvQVIRZnnieIKmfR7xA": {
    "date": "6/25/2018",
    "text": "This place has amazing customer service. I popped in to grab a quick lunch to go. This was my first time at this restaurant and the owner was kind enough to go through the menu with me.  I ordered a single patty burger with chili cheese fries. My order was ready in less than 5 minutes! I was definitely in and out which is a huge plus. My food was delicious. This place isn't frilly and soft.  It's burgers, fries, and hotdogs. Homestyle.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "sXccOuVx25toGWS86hS4XA"
  },
  "nQHnef0keIgPxSCqihM1NA": {
    "date": "7/19/2018",
    "text": "I'm here in Charlotte on business and look up food near me. Hmm CHUBZ FAMOUS Chiliburgers, it's close, less than half a mile.  Being from SoCal originally I miss my old school Tommy's CCB's. I hop in my rental car and in minutes I am in front of CHUBZ!  I walk in and my Burger Bro Antonio and I start talking..You make a triple chili cheese burger? Yes sir!  I ask Antonio what does he know about Tommy's in LA? He said oh yeah the owner is from California and has duplicated the chili!  SOLD!! I gotta get one of these in my mouth ASAP! I also asked Antonio (my burger bro) what comes on the CCB? He said onion, mustard, pickle & tomato. He asked if I wanted anything else on it? No man! That's all a good CCB NEEDS!! Got my double chili burger and a chili cheese dog, well a chili dog as they forgot the cheese but don't let that distract you from the fact the reason for being there was the chili cheese burger and it was incredible! Perfect in every way. It's early so I may go get that triple for later!!!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XBeR1wRZeXnQZvfjuQbHTg",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XBeR1wRZeXnQZvfjuQbHTg/o.jpg"
      },
      {
        "img_id": "qZklrx6mgzYBksxsHY0y3Q",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qZklrx6mgzYBksxsHY0y3Q/o.jpg"
      }
    ],
    "user_id": "juNeYhO3yGQnTzZJDxrL3Q"
  },
  "Ubi_mRP1_4YlVpdj_1croQ": {
    "date": "9/17/2018",
    "text": "If you frequent places with wine lists and escargot on the menu you might not enjoy this place but if you want a great chili cheeseburger with a a basket of fries piled high Chubz is a very good choice. $8.00 gets you a single chili cheeseburger, fries and a drink. Good fast food type menu with better quality and taste than any of the chains. You need to get a little of this.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uT13py5Jl8gWGGH-AOVvPQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Menu is there for all to see.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uT13py5Jl8gWGGH-AOVvPQ/o.jpg"
      },
      {
        "img_id": "eosa8bb0TqtQWHOkO1Nh-g",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. It ain&amp;#39;t 5 star",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eosa8bb0TqtQWHOkO1Nh-g/o.jpg"
      }
    ],
    "user_id": "RIvj2i7qFkxIi_tkKgam-w"
  },
  "2tLTgp5YjTsIbpF2ffqCXA": {
    "date": "3/22/2019",
    "text": "Tasty nourishment with extraordinary story. Gotten an opportunity to converse with proprietor and hear the story behind the formation of Chubz. I chose to wreck my eating regimen and requested bean stew hound and burger menu thing. I can't disclose to you which one was better as both ran down with no delay. On the off chance that you are searching for that comfort nourishment or only an incredible burger and puppy, this is the spot. I likewise prescribe the house fruit juice. It was all incredible.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RQopw32K3Aq1gJL-BWlkNg"
  },
  "vk1Yw8VJROMtGSmba7q2kg": {
    "date": "6/6/2019",
    "text": "A True \"hole in the wall, greasy spoon\" type of place. A gold mine of good affordable hamburgers, cheese burgers, and of course CHILICHEESE BURGERS.  It is a keeper!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WG6xxmslN6qLEzEFajaWlw"
  },
  "V2DWsM_xGwQg-LZXNQ5bTg": {
    "date": "3/16/2019",
    "text": "First time in: I had a double chili cheese burger with fries and a drink. I liked everything but the chili which isn't really chili, it's gravy. After taking a moment to taste it by itself, I arrived at that conclusion. Still a damn good burger and best fresh cut fries I have had In a while but they lost me at the chili. Please make a real chili, I will share a simple recipe that works well with hotdogs and hamburgers. I'll be back but no gravy for me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "htz5CnLz3D84s_sqhxEFRQ"
  },
  "aE-leTD8ioP2kidDs0MAew": {
    "date": "3/2/2019",
    "text": "Great chili cheeseburger and fries! It's sinfully good! And staff are so friendly made me feel so comfortable. I definitely recommend CHUBZ!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5lxB7WcpvBKlCFM7pnrgwQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Chili cheeseburger and chili fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5lxB7WcpvBKlCFM7pnrgwQ/o.jpg"
      }
    ],
    "user_id": "OZg5MdoTSt-XJQQWYHMgIg"
  },
  "L-qjk8IJKFe7kxDCJEGJDQ": {
    "date": "2/22/2015",
    "text": "I heard these guys had started serving breakfast so I went it to try it. I've been there 3 times now for breakfast. First time I tried the Chile Verde and it was OUTSTANDING. The pork melts in your mouth. The second visit I tried the BREAD PUDDING PANCAKES and they were AMAZING. Yesterday I had a sausage egg and cheese biscuit with their home made sausage. Let me say that the quality of breakfast here is well beyond what they charge. This is awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BlEONjCHUYGLnz0GDx4BUw"
  },
  "0P7VmCWwo5UJcMNnRXHmhg": {
    "date": "5/13/2015",
    "text": "great burgers  , good price , they take there time to buy great products , at a fair price . it's a hiiden gem",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pw2O2L6nBQT_ipHLGPcuHw"
  },
  "zRhXTvmEZNpOyTz5bHO_AQ": {
    "date": "4/21/2014",
    "text": "Slow service. Dirty Tables. You clean them yourselves or they don't get cleaned. Greasy soggy fries, even greasier onion rings. Tomato was like eating a brick it was so unripe. Burger patties overcooked and greasy. Not sure what it was they called Chili, but chili it was not. Even the self serve soda tasted soapy. Was so hoping this would be the great burger and dog place that they advertise but two trips in one on this visit. The first and the last. Maybe someday they will figure out how to complete one order before completing the next. Four numbers called before our order that ordered after us and since they sat at dirty tables near us we could see they ordered the same things we did. No rhyme or reason as to how they fill the orders. A must to avoid.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RtdXJfByCFBMnJSuV2afZg"
  },
  "wqmdqb9yv7L3cjhcRyYH8g": {
    "date": "1/12/2014",
    "text": "Summary.  Unique joint with a tasty and varied menu. Fun and conversational staff.  Clean facility with televisions and a small beer selection.  Perfect for some food fast especially if you're staying at the hotel nearby.   Now for the real story.  Never have I ever written a review of any kind before, but the food/service/atmosphere as a whole was too perfect to not reward Chubz with a raving review. I came over from the Clarion nearby with my empty stomach in need of some serious eats. Walk in with no clue what to get so i let them choose for me. I got my #1 combo, a double chili burger and fries with the fixings. I downed the burger before he could take the next order. Fresh cut, crispy, seasoned fries with homemade ketchup to go with it. Killer. I had nowhere to go, seeing I was stranded after a canceled flight and trees was playoff football to watch. They had the games on and I just sat and talked for over two hours. And let me tell you, these guys know their food. They must've felt bad for me cause they let me taste test a waffleesque pastry ChubCake which would go nice with coffee (if I coffee.) These guys are personable and generous and just fun to talk to. And damn can Chubz cook. After I ordered some hot wings to take back to my room as they were closing up they let me try the homemade BBQ sauce. I couldn't stop trying it! Smokier and sweeter every time I swear I could drink it. But anyway the wings were just what I needed to lounge and watch the rest of the game in the hotel. If you're staying at the Clarion or the Ramada please don't go to the restaurant in the Ramada, it's not even complimentary. Go to Chubz. You'll thank me. After a terrible day of air travel and being stuck in Charlotte, Chubz turned my day around with some welcoming conversation and a happy little food baby. (Pretty sure they were twins.)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "jXKUwLoH8odiVa0d71KWrA"
  },
  "mj4aKv_CkVgoZ0nYFLpjIQ": {
    "date": "6/26/2014",
    "text": "I purchase the groupon and placed an order over the phone for what we thought would be some awesome food, it looked great online. We then sent my coworker there (25min drive) to pickup the food and they told us the groupon wasn't allowed on takeout. Awesome. He spoke with the owner about it who was extremely rude, probably because it happened all day. Either way I won't be returning, my coworker just paid for it all, it was very salty which I sort of enjoyed but my coworkers were split. The fact the owner (I wasn't there so I am not sure which one) was so rude was quite a turnoff. I can go to roadhouse and get the same thing minus the attitude.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SFeRRbtkF3Z35-mE346p_g"
  },
  "ZUyfLGSqThODaxe4DTBBcQ": {
    "date": "12/28/2013",
    "text": "We liked the chili and the onion rings were great! We'll go back, again. I want to try the dessert!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VbTgMiyCAPWY7bpJ-q8ujQ"
  },
  "RCW7kqsNjicptipawEyjvg": {
    "date": "1/23/2014",
    "text": "Ok, Best burger I have had in Charlotte.  And I have some good burgers.  Prices were reasonable and the fries were delicious.  Just pure greasy goodness.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iR-spkojU-4Et3rhk_nzjg"
  },
  "tFn157SMNRS2lek96vgw8w": {
    "date": "1/6/2015",
    "text": "Chub is a great place to get made to order burgers fries  and hot dogs. Food is hot and fresh. The crew is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lLjEqZrX2QhOF4Hck_0_Ug"
  },
  "r_ezLPM4x20XVrk2w_b8YA": {
    "date": "11/5/2014",
    "text": "This place just isn't very good. Just ok. I'd rather go to 5 guys. Food was some what bland. If you want a nothing special burger or dog, come here. If not, same your waistline and go somewhere else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qNSrUmf4RFsNqdMCeKI7Ow"
  },
  "RmMLw6i6LtLIH05-7UsfIA": {
    "date": "6/12/2014",
    "text": "Great chili burger and fries! Don't know where some of these people come up with the low star reviews but I eat out an awful lot and this place has few peers in the burger and fry department. Definitely give it a shot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eDIt1NPMZfEeh6OqIPeI5w"
  },
  "Sb9MJgcRoIsK4fQTbqMzyw": {
    "date": "8/16/2014",
    "text": "Although the food was good my experience going there was not good. When we were greeted at the window my bf asked what was on their hamburger and was told to read the menu to find out, then when our food was ready and being given told us we were rudely told to be careful cause if we drop the food its on us. I was really looking fwd to trying this place out. The food was good but not good enough to be treated like that. We wont be coming back due to the poor customer service by the older man that waited on us.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iPoWo9I43Rt9fN15XuKobg"
  },
  "oJrDN4NFSQQjQ7NSEglSYg": {
    "date": "1/24/2014",
    "text": "I've been here twice now.  Reasonable bang for your buck and the food was good.  What prompted me to review the place wasn't the food so much as the service.  I arrived around noon and the place was pretty busy.  I ordered a double chili cheese burger and waited.  When the two order numbers after my number were called, I asked about my order (which they had given to the guy behind me by mistake) and they had to cook another burger.  The guy calling the shots on the line (black guy with a little bit of a beard) instructed the grill guy to put on another burger for me and said to make my double a triple.  I always appreciate it when a business offers me more than a \"sorry\" to make things right, even though I'd have been just as satisfied getting just what I ordered to begin with.  We all make mistakes; we're all only human.  It is how mistakes are handled that make all the difference.  Thanks guys, you rock and I will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "roVs7Uw24my8uUWCEfP0Kg"
  },
  "PT4eQo8Ia6_5g7vsbeaMPg": {
    "date": "8/23/2014",
    "text": "i would say this place is pretty cool. the burger was just ok the chili was very messy and salty the burger patty didn't really have a taste to it. the fries seemed as if they were cooked in old grease. the service was great though. you would think a new burger spot would be crowded but not this afternoon. I would come back when I have another groupon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2Iis1nP9wr6Eyx69jNzUg"
  },
  "S1fg9tYzGWKbG73dmwUpxQ": {
    "date": "8/28/2019",
    "text": "So, I am in Charlotte, North Carolina on business and I am heading to a great Mexican place when out of the corner of my eye I see a sign declaring \"Famous Chiliburgers.\" Intrigued, I continue down the street to my Mexican restaurant (that has an amazing spicy octopus dish) and pull into the restaurant, but the words \"famous chiliburgers\" are lingering within my mind, haunting my brain, rattling chains and all that supernatural ghost stuff. Car gets back in drive and in a few minutes, I am in this nondescript strip mall's parking lot looking at the place Chubz Famous Chiliburgers.  Being from Jersey, I grew up with places offering great burgers and hot dogs slathered in chili. After relocating to Florida, it was a bit of an eye opener to realize that places offering great greasy spoon style burgers and great chili dogs are far and few between. Well, I found such a place here in Charlotte, North Carolina.   I ordered their #12, a double chili burger and a jumbo chili dog accompanied by fries and a drink. A bit pricey at $12.50, but it was a lot of food and not only filled my stomach, but filled my homesick soul with a taste of Jersey.  The hot dog was a quarter pound Sabrett, deep fried then finished on the flat top. The chili was more a west coast style (omitting tomatoes and focusing on beef broth as its liquid), good and a good accompaniment for both the hot dog and the cherseburger. The cheeseburger also leaned more towards a west coal style, smaller, but they make it a double. It gives more surface space to create a char on the burger.  If you find yourself in Charlotte, seek this place out. It is a taste of what a burger and hot dog should be and inspired an ocean of memories of great meals of the same variety up in the Garden State.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4zoL6Zt-0QZpo5Ab2rU0xw",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4zoL6Zt-0QZpo5Ab2rU0xw/o.jpg"
      },
      {
        "img_id": "rMyqrJ_6ZHDGxonFIt-q2g",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. #12, a double cheeseburger, jumbo chili hot dog, fries, and drink.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rMyqrJ_6ZHDGxonFIt-q2g/o.jpg"
      }
    ],
    "user_id": "gcMPEkEXekKN6mYhLUI-Rw"
  },
  "ZEEDaUf9Pg37Fyj4jKtSwg": {
    "date": "4/1/2019",
    "text": "I'm a big fan of Chubz. That being said, I'm not a big fan of their location. It's located right off a very busy street and near a \"gentlemen's\" club. However, I've only been during the day so there's not much sketch activity happening. Thankfully, they deliver weekly to my business park so I can get my fix quite easily that way.  My first visit, EVERYONE was so friendly. I did call in for my order, however, they don't put your burger on the grill until you get there and let them know so there's no reason to call ahead. The guy I spoke with over the phone, who I assume is the owner/manager?, likened their burgers to In&Out. Spoiler alert: I liked Chubz a lot more than any In&Out burger I've ever had.  My first visit, I had the #10 combo which is a single deluxe burger that comes with lettuce, tomato, onions, pickles, and chubz sauce. Your choice of fries or onion rings as side plus drink. I chose fries. I didn't really taste the chubz sauce so don't worry about it being overpowering if you order a burger with it on it. Overall, it was a really good burger. The fries were fresh and hot with just the right amount of crispiness.  For lunch on a different day, I went with their regular hot dog and onion rings as my side. The regular hot dog comes with ketchup, mustard, and onions which, coincidentally, is how I like my hot dogs. The onion rings were my favorite. Thin onions fried in a light, puffy batter. I completely overate these and made myself a little sick. WORTH IT, though!  Seriously, pay these guys a visit!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 12,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "lkvUYp58z3grJxeI3Om-tA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. #10 combo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lkvUYp58z3grJxeI3Om-tA/o.jpg"
      },
      {
        "img_id": "L4kKDqvqdPreBRLmc3aH2w",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Closeup of the #10 burger (single patty with lettuce, tomato, onion, cheese, and chubz sauce)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L4kKDqvqdPreBRLmc3aH2w/o.jpg"
      }
    ],
    "user_id": "SBi0TYUSIrct8WSTyK6DFg"
  },
  "rY0cC7BdzTuz9HmfPAUiDw": {
    "date": "8/26/2019",
    "text": "Three words - CHILI CHEESE FRIES! So good and a meal all on their own! They are a must try for sure but if that isn't your thing, their plain fries are delicious too! They have great burgers and hot dogs also!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P-sTb7ZtzDvEtW7wSZi5LQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. The best chili cheese fries ever!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P-sTb7ZtzDvEtW7wSZi5LQ/o.jpg"
      }
    ],
    "user_id": "nenbhiy5qMBYDRCNIwMOTg"
  },
  "1ZOe2lzOR8odx5_bOY3ZIA": {
    "date": "7/10/2019",
    "text": "I had a delicious #1, I believe it was. It was a double cheeseburger with cheese and chili and I added bacon. It came with fires which I upgraded to chili and cheese and came with a drink. The owner was very friendly and fun to chat with. He really tried to find what your style was to recommend something you would really enjoy. It worked! I was very pleased with my choice. Chili was a little sweet and not spicy and really complimented the burger. The fries are some of the best I have had recently. Along with the chili and cheese, I used the house seasoning and this really topped it off. I would definitely recommend this place and will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2sqdUtLEXJjRyuZbZG2lxA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. #1 double cheeseburger with chili cheese fries and house seasoning.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2sqdUtLEXJjRyuZbZG2lxA/o.jpg"
      }
    ],
    "user_id": "JXBOsuS4wIIRqgBWwA4-zA"
  },
  "1ZjNQ0u6oWQ6cbvN6bkjIQ": {
    "date": "8/21/2019",
    "text": "Awesome chili burgers. These are soooo good. Their onion rings are especially good too. I never ordered anything here that wasn't good. I just stay away cause their good is so very bad for my waist line. :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YeXGSWZhwCLIjtWZJdO44A"
  },
  "RgG-7mtIokelupDbyTpgig": {
    "date": "8/12/2019",
    "text": "If you're in the mood for a good cheat meal--this is it. Not a fancy experience, but these burgers are seriously delicious!!! It's in an unassuming spot and has that \"we've been here for decades\" diner feel, which is my favorite. The chili perfectly complements the burger without overpowering the meat. Definitely would eat here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xlemtd19n4X0yhpWZDIzgg"
  },
  "RbbzThCpKss97ObaH3bcqg": {
    "date": "7/7/2019",
    "text": "CHUBZ gets my vote for best burger in Charlotte. My wife and I have been going here for over a year and it is consistent time and time again. I always go with the number 3 which is similar to in-and-out burger but will leave you feeling some type of way about in and out after. Wife goes with the number one chili burger and loves it every time.   Staff is great and shop is clean, if you want a great burger and fries-you must try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3SX5W86Fhv5kQW_eoYMpng"
  },
  "BcVcTc4D2WtDvMMvFJJh0g": {
    "date": "9/15/2018",
    "text": "5 Stars!  Located in a strip mall, this place is top-knotch, even with it being a few doors down from a gentleman's club.  The guy making the burgers was very friendly, pleasant and courteous. The burger is very fresh and made while you wait.  If it were any fresher he would have to have the cows in the back. The ingredients were mmmmmmm.  I got the patty melt and it was one of the best that I have had. The fries are fresh cut and as delicious as the burger.  When I was there, the guy working was a one man shop and it took some time to get my food after I ordered, but it was well worth it. However, I did visit during a tropical storm. The guy making the burger greeted me as soon as I came in and thanked me multiple times while eating and as I was leaving.  If you like burgers you must check this place out. I definitely will be back before I leave.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "19Le5k7cchQh3ed1aY4LhQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/19Le5k7cchQh3ed1aY4LhQ/o.jpg"
      },
      {
        "img_id": "GN3RezNvQ-mkVHUwkOGylA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GN3RezNvQ-mkVHUwkOGylA/o.jpg"
      },
      {
        "img_id": "T24IKaGpIKGlfMeiHQVUxQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T24IKaGpIKGlfMeiHQVUxQ/o.jpg"
      }
    ],
    "user_id": "xalgcjscRLNPuyaAeKNThA"
  },
  "zACenKhi8G_DESHDnqazzA": {
    "date": "6/6/2019",
    "text": "The employees were very nice. The food was great! I moved here from California and this is much better than In and Out or any burger place out there. I will tell the people I work with and recommend anyone in the area to try Chubz. Quality stuff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "35uCQMzQqZINPEtmqxTYlA"
  },
  "bOC9muzjrjzr9xzlFFaC4A": {
    "date": "6/20/2019",
    "text": "I keep coming back because it's so good! Great customer service! Fresh and Hot!! Seasoned perfectly, and you can add the special seasoning salt to your fries! Great for lunch and dinner! You won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zzUQd2KjWDHJWmeOIuc2WA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zzUQd2KjWDHJWmeOIuc2WA/o.jpg"
      },
      {
        "img_id": "MD5ODjJTQ9O7-GCHvgU36A",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MD5ODjJTQ9O7-GCHvgU36A/o.jpg"
      }
    ],
    "user_id": "Om_HXiKg37qOdLQkNr_2bA"
  },
  "zgKdjG5tQ98ejaqVJCHD-Q": {
    "date": "7/20/2018",
    "text": "Feels very divey when you walk in.  Pretty good burger.  Made fresh and while you wait.  Nice thin slice patty.  Got a single deluxe and chilli cheese fries.  Will be back to try other items on the menu.    Update:  I've gone at least once a week pretty regularly.  Everytime I go I swear it's the best burger I've ever had.  Get the chili cheeseburger.  It's amazing!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IOTJmZo7oXKGxJKtnVQMDw",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IOTJmZo7oXKGxJKtnVQMDw/o.jpg"
      },
      {
        "img_id": "VVo6aenu3tbPKgT9cz8O5g",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Jumbo Chili Cheesedog, amazing",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VVo6aenu3tbPKgT9cz8O5g/o.jpg"
      },
      {
        "img_id": "0gjMle_HlR-VRtKbRNBVKw",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Chili cheese fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0gjMle_HlR-VRtKbRNBVKw/o.jpg"
      }
    ],
    "user_id": "bqhfMozc8Wp1ty_zDOis_w"
  },
  "uBMYo8qDTsQoF4boMljp6A": {
    "date": "8/6/2019",
    "text": "Amazing burgers, very friendly staff, very great vibes. Good place to eat my favorite thing, burgers except with chili!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hYmIGQQHhEqudgjBR3SBrQ"
  },
  "9wJPtrSZ8vfe7SgFuUpuPw": {
    "date": "7/10/2019",
    "text": "Excellent burger! Everything was fresh and the owner was super friendly. Adding the seasoning salt to the fries definitely was the icing on the cake!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bTnE7EsbLehpdsbF4johlA"
  },
  "n7G0fI-LTHD64oLYW1q6nw": {
    "date": "7/10/2019",
    "text": "So I've been here a few times. I've tried the #1 #3 and #10 and they were all really good. It is always fresh and super hot which probably was a bad call for food on this 100 degree day haha but I stuck it out. I have 4 stars for a few reasons. The food is really good, always fresh, and original, however the reason I gave 4 stars instead of 5 is simply because of two factors. The location is not the best it is in an area where there are a lot of known drugs and prostitution and two simply because I feel like the building needs a remodel on the inside. It is just not visually appealing. Besides that the food is great and the people are always pretty cool and always open to recommend their favorites (which surprisingly are not the most expensive things on the menu). Will definitely repeat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BDVTfIgXHwLMHibHMgI0OQ"
  },
  "wo3dLh5JVNqNlebU1RASgA": {
    "date": "7/24/2018",
    "text": "I've been eating at Chubz for a few years now. The location used to be my beloved Krispy Kreme but I have since forgiven them for taking over the space. The food has always been consistently delicious. Chili cheese on ANYTHING is a guaranteed mess of goodness and those onion rings?!?! OMG! The barbalow wings I tried were crispy and sauced really well. I think there are only 3 flavors available, barbalow, hot and plain and anytime I can get the options of all flats Im happy. One item that I can't stay away from is the Chili tamale. I had never eaten one before and it is sooo good to me. There's the shredded beef, chili and cheese on top, its salty, kinda sweet, the corn taste from the tamale. Man, I've eaten it cold it's so good. I'll continue to  stop thru when Im in the area and so should you.",
    "rating": 5,
    "rated": {
      "funny": 12,
      "useful": 18,
      "cool": 13
    },
    "photos": [],
    "user_id": "QTa8pZizjqByJrNr9AVszQ"
  },
  "3KkaUXVK4Ki_2qob7BJ-xQ": {
    "date": "6/7/2019",
    "text": "Best burgers in Charlotte!  I travel across the country for work ... exploring food along the way ... and the Chili Cheeseburger is unrivaled anywhere I've been. Sensational. A taste explosion.    The Double Cheeseburger with Chubz sauce is their version of an In and Out Double Cheeseburger.   It is as good if not better.   The fresh hand-cut fries are consistently melt-in-your-mouth divine.   Chubz may be Charlotte's best secret. I can't figure out why there's never a line out the door.   Run don't walk.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mZAdWnLCqmKT36Md7YZO7w"
  },
  "6kEguUnd4mnPk47y2zOfAg": {
    "date": "6/8/2019",
    "text": "Best chili cheese burger ever! Treat yourself to a double and enjoy 2 well seasoned patties. Push yourself past the sketch of the plaza this place is in and get there! If this joint was in Southend the line would be out the door! Side note... The fries are delish, but the onion rings are worth the wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lp0NjYXpSbgt7HAUT1Ry_Q"
  },
  "FqubyT28xZav4rUfsOQNAg": {
    "date": "6/30/2019",
    "text": "I've eaten lots of chili burgers and hot dogs in my lifetime, and Chubz has has the best IMO.  The prices are good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w-oSLNcxgcsxdGXo1FaeYA"
  },
  "8R66RTv9KBFpsiJdrTdzTg": {
    "date": "2/7/2018",
    "text": "Now to describe CHUBZ as out of the way is not accurate as it's in Charlotte with a Woodlawn Rd address but I can describe it as interesting to get too, at least in terms of how the Google Maps lady took me.  What's also interesting and may throw the less adventurous off is that it's in a strip mall that also includes a strip club and a \"toy store\".  Think adult, not Toyz R Us.  My advice would be to NOT let this throw you and go ahead in and get some food (they also have online ordering and a drive thru window if you want to go that route along with delivery w/in 5 miles for a $2 fee).  They have a number of tables and a counter where you can sit facing the grills and the dudes at work taking your order and cooking your food.  I went on a Saturday around lunchtime and it was a two dude operation. They were friendly and having fun with each other as they worked as well as with customers who were clearly regulars.  It felt like there was a pretty decent stream of folks coming in to eat, pick up to-go orders and going through the drive thru.  I chose to dine in at the counter and went with the #1 Double Chili-cheeseburger combo subbing onion rings for french fries.  I got the burger all the way minus tomato and that meant their homegrown chili and American cheese along with pickles, onions and mustard.  While the chili was good I'd say it was not the best I've ever had on a burger and the patties themselves were yummy thin Smashburger types.  All in all I enjoyed the burger and look forward to having one of the others that include their CHUBZ sauce (Not sure what it is but want to find out!).  The onion rings were battered vs. breaded and tasty/crunchy though this batch was definitely on the greasy side.  I left FULL and happy and can't really imagine what I'd do if I ever ordered a triple burger or their half pound variety.  They also have dogs and a few other things like ribeye steak and cheesesteak sandwiches.  Arnold said it best.... I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "33v8c5ftrKuDGTw1ZQ2toQ"
  },
  "ZFKX8hOY1wZH61co2P1-Ng": {
    "date": "10/19/2018",
    "text": "I really enjoy this place. I have been coming here for years. This place serves LA County Style Burgers & Fries! Save your self a trip to Los Angeles and give these guys a try. It will only take one visit and you will be hooked! It even looks and smells like a west coast burger joint! I don't even like food and here I am writing a glowing review of a hamburger stand! This place is legit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s0kVCpD8jFWdVGS5r-qsbQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. The view from a bar stool.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s0kVCpD8jFWdVGS5r-qsbQ/o.jpg"
      },
      {
        "img_id": "giKQmn-_Lr3fIOB21rSQPA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. You can almost read the menu...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/giKQmn-_Lr3fIOB21rSQPA/o.jpg"
      },
      {
        "img_id": "XvMcz-DzAOeZufEDH7MqUQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Close up shot of #10 no (yucky) onions.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XvMcz-DzAOeZufEDH7MqUQ/o.jpg"
      }
    ],
    "user_id": "XL0YUldUC3rFGwlckU_rpQ"
  },
  "7YUa4lyQFmIo011ZpJUqhA": {
    "date": "11/3/2014",
    "text": "Best burger ever! Polite and enthusiastic wait staff. And a clean joint too!. Best prices I've ever seen. Wish I lived closer so I could make this a regular check in!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fKgSrt35JKpjM0zzL0-Tlw"
  },
  "JE0ldeCUk-arqGOjlnXSTQ": {
    "date": "12/11/2013",
    "text": "I have been back three times since my first visit to chubz famous chili burgers. The food is great. I have tried their chili burger chili dog with cheese and slaw and tamale with chili. Fast service and good hot food at a fair price. They even have a drive-up window for pick up. You can either rollup or call ahead. They are added a couple menu items since I was last there. Asked for their homemade catchup it's awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bCY-ljbeJ20s5gFKnU4PgQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bCY-ljbeJ20s5gFKnU4PgQ/o.jpg"
      },
      {
        "img_id": "TXazerCh50JlsQ9y5QH4WQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TXazerCh50JlsQ9y5QH4WQ/o.jpg"
      },
      {
        "img_id": "aNebbJG1Kmu4HqBMFFv94w",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aNebbJG1Kmu4HqBMFFv94w/o.jpg"
      }
    ],
    "user_id": "86dFcSrFGVWcaNJXdg4KZw"
  },
  "u_0TXuF4-1Z0h8zD0-kmwA": {
    "date": "12/8/2013",
    "text": "OMG!! Haven't had a burger like this in a while. LOVE IT!!! And the Fries are fresh cut too!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "elqsbb35Y_KOsjQ-7wMTwQ"
  },
  "avFTczuoSM2-2qQf016ycw": {
    "date": "2/27/2014",
    "text": "Amazing burger and the fries were great too.....  And great prices...  This place is a win all the way around...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_JHsoFyNbYcorujk3i_hbg"
  },
  "cVApIH3ZSeHXCZJwMWbkvw": {
    "date": "3/17/2016",
    "text": "After a long day of work we were looking for a good place to get a hearty meal. Chubz did not disappoint! I'm from LA and grew up with Tommy's, Pink's and Cupids and this was the best chili I've ever had. I highly recommend the fresh made onion rings as well. I will be making a trip back to Charlotte just to eat at Chubz again! (All the way from CA)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o_V7zGarm5k5C9MbnoSOxg"
  },
  "9nS88sDPIbhQUkKlhIG0pw": {
    "date": "5/12/2015",
    "text": "What a great place to come to to get lunch or dinner the burgers and hotdogs are to die for not to mention their world-class shakes.    Even if you have kids with you they have a drive thru when you don't have to get out of your car",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lq0bDdy_REQ5zOWiQ98AcA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lq0bDdy_REQ5zOWiQ98AcA/o.jpg"
      },
      {
        "img_id": "h3ML2eKElHcTEv9djle1wA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/h3ML2eKElHcTEv9djle1wA/o.jpg"
      }
    ],
    "user_id": "ghNYyKxJsyvOBDFIh8YDDQ"
  },
  "aYaTTYh41pxcuccXcGzWhw": {
    "date": "1/26/2016",
    "text": "I WISH THIS SPOT WAS 24 HOURS!!! Chubz is the bomb and Steve is awesome! Support small business this spot was legit I will be back! Thanks guys!! #11 was yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UAN0OQNnyfiPpF3mw_HQew"
  },
  "v2PSSIqDBBCoRdwtR-aIAw": {
    "date": "5/2/2014",
    "text": "This place does burgers and dogs right. Quality food and price, check it out, you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2BE2RUXYvS2lEcmHivsD-g"
  },
  "ggR3TLQEfOdOFnIIWbS9bQ": {
    "date": "5/4/2014",
    "text": "Went there last night, service was awesome.  Very friendly and personable. Food was excellent at a very reasonable price. I would choose them over a fast food place any day of the week. My order was done in 5-10 minutes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N92Tg3rlTli2gJxhKzikqQ"
  },
  "W3eKIwBNEy6lwKc7ZL9x8A": {
    "date": "4/20/2016",
    "text": "Chubz was near our hotel in Charlotte, didn't want to go far so we stopped in. We are so happy we did. The chili cheeseburger,fries and onion rings were all delicious. If your ever in Charlotte check the place out. You will not be disappointed. Nothing tasted like it was frozen, not even the burger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ahurHkuuNdoeCg89Fl_H2g"
  },
  "ZT4jKbEO1TfE86aNNOchmg": {
    "date": "7/31/2014",
    "text": "Decided to stop in and what a awesome dive !! Super chili burger ...onion rings are the best I've had in years and to top it all off the staff was friendly and you can tell they care about the product they serve ... What a throw back to the old fashion type of burger joint seriously worth it ....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clcc1z9JacI-P9_ZrpYfwg"
  },
  "Yz5frtMpVkuU2oPmCIYcXQ": {
    "date": "2/20/2014",
    "text": "Great service.  I found the burgers (I had the chili burger) a bit bland. How can a chili burger be bland you ask?  Beats me but it was and the patties were a bit on the small side.  We've been there twice and would like to see more attention to the upkeep.  There were crumbs in the chairs and on the tables and they had just opened.  The dining are looked like it could use a good wipe down.  The food wasn't great but it wasn't terrible,  they just need to revamp the chili and keep everything clean.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xnXDMFu6sGRMuxNXGLGeug"
  },
  "skDEFrq2TKY6bSCvfYkLPg": {
    "date": "2/23/2016",
    "text": "Antonio and Steve are running this place into the ground. The burgers are Fantastic. Antonio's behavior is appalling! He is foul mouthed, rude and instigates customers. Johnson and Whales really failed with this guy. Help put this guy out of business. If you see a health violation like Antonio smoking then handling food without gloves, go online to the Health Deparent and file a complaint. After the way he treated me in his restaurant I will make it a point to help prevent others from being exposed to this place aND health hazards. Let's put Antonio at Chubz OUT OF BUSINESS!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TBy6QxloAS1RBarbHC0RSQ"
  },
  "cg2OgCBoApuzJScEEbz-4A": {
    "date": "7/24/2014",
    "text": "Visited for the first time early evening on a Saturday. It was about half full with customers. I ordered the combo that included a double chilicheese burger, fries and drink. Burgers are cooked to order and the food was delivered to my table in a reasonable time. My impressions: - Burger was very good but somewhat sloppy, as expected. Chili was good but not exceptional. Homemade cole slaw is available if you want a Carolina-style chiliburger - Fries were excellent, just as good as Five Guys and almost as many on the plate - Decent selection of soft drinks and fresh brewed iced tea - The table next to me had ordered the onion rings and they commented that they were the best they had ever had.  Suggestions: - Don't place trash cans next to dining tables - A roll of rough paper towels on each table is not an improvement over decent napkins  Conclusion: Yes, I would definitely eat here again and also try the onion rings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzDfJDgEBgsfHpBcn3RRvw"
  },
  "GXYzSCBZpl_94fnG7Y9_qg": {
    "date": "3/19/2016",
    "text": "AWESOME chili cheeseburgers, fantastic fries and the BEST onion rings!  We loved every bite. Everything made fresh nothing frozen so it may take a minute or two but worth the wait!!!  The staff was very friendly and helpful.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mRMxhMSFiKbzBqwyPAxCVw"
  },
  "GdOIggrENLpolEYaIAdeOQ": {
    "date": "3/1/2014",
    "text": "I'm a Southern California transplant. Chubz is the closest thing to a Tommys chili burger that you will find in Charlotte. Sloppy Mess...Excellent! Just missing the yellow Cascabella peppers. Thanks for a providing a little reminder of home. Recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2hFhpHGwVIqCuXq8NVIsRw"
  },
  "YQqEw5K1oUKQoE7AEZvUoA": {
    "date": "4/14/2015",
    "text": "This is a horrible place.  I couldln't care less about the food or the prices.  The Owner Scott as well as the manager Antonio or better known as CASPER are rude to not only their customer's, but also their staff.  The chili is horrible it tastes like it's from a can, yet the name is in the Company name \"Chiliburgers\" go figure.  If you are stranded in the area and all restaurants and gas stations are closed and starving, then this is your place.  One star is too good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-JrGzDYtpMzArRwcjxtP4A"
  },
  "gPZeD90bJv1SkEzdhuAR9Q": {
    "date": "12/28/2015",
    "text": "It's hard to find a good chili Burger, many times they are just too messy, or to dry or something else.  I had the double chili cheese burger/fries and it was perfect.  There is no beating fresh cut fries.  lt's True, the chili is just like (I mean exactly like)Tommy's out in Calif.  If you like great Chili burgers then you need to try Chubz; you will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3oSUgDGoOiKNSXtcW7sZYA"
  },
  "TEGtnuJ0An2Fw6AGnbmkcw": {
    "date": "2/24/2015",
    "text": "Solid Chilli Burger.  Solid fries.  If you are looking for health food you came to the wrong restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pBkO4xCaYWcS2uVpKCrPgg"
  },
  "WfsU62v_CMj-M_wcaV_ZyQ": {
    "date": "11/22/2013",
    "text": "Awesome pulled pork sandwich.  Fries are the best ever. Very relaxed. Prices are real fare.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OAglaodDrpYTvnIyShhJcg"
  },
  "H1WROwmfUJZbJv7fkR1DjA": {
    "date": "4/10/2017",
    "text": "Friendly service, hand pressed fresh beef patties grilled in sight. Chili cheese on fresh cut fries. Can't go wrong. Chubz also has great shakes. Birthday cake and praline are favorites. Chubz just introduced a chicken tender club that is the best club sandwich in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "40RuqusVmWMBkdy5OVn44g"
  },
  "jnSaYfjxaggaJusMBX9vfg": {
    "date": "12/10/2016",
    "text": "This an excellent example of burgers done right.  I had the double chili burger , chii dog combo with fries and a drink.  Great  food for a great price.  The guys there also are very nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_UuSG_1P60oKQMs7ZOlX_A"
  },
  "_C-IZm7Pzce4WYNsUFc4VQ": {
    "date": "3/23/2016",
    "text": "CHUBZ  is by far the best-kept secret in Charlotte! Everything on their menu is DELICIOUS and made with love, From the Double chili cheese burger (Be sure to add the apple maple bacon) served with their fresh cut hot french fries( with chili cheese on top of course), to the hot tamales with everything on them! The staff and owner are amazing! CHUBZ taste amazing, whether you dine in or get take out! Even re-heated Chubz is great!   ...And after you have stuffed your face with some homemade chili-cheese goodness, YOU HAVE TO TRY THE SWEET POTATO PIE! Warning! it may cause you to slap your mother, that's just how good it is -___-. :)  All in all I would suggest Chubz to any and everyone for any and all purposes! They also have a FREE rewards card, so be sure to sign up for that  as well, it comes with great perks!  -Chubz lover! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oMUobZ6UYx0NIL2Mi4Cm4w",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. A piece of heaven in a to-go box..\r \r Sweet potato pie. :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oMUobZ6UYx0NIL2Mi4Cm4w/o.jpg"
      },
      {
        "img_id": "-Y-f_mUFKMelJdAUbsWk1A",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. This yummy greatness is the #1 at Chubz. Its as Delicious as it looks! :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-Y-f_mUFKMelJdAUbsWk1A/o.jpg"
      }
    ],
    "user_id": "pV2-R1JGVRbCAS6CoLwmig"
  },
  "vS9epEqpztdyzP29Cx-XtA": {
    "date": "3/13/2017",
    "text": "I receive my delivery which was absolutely unacceptable they left part of the delivery at the store the other part of the order came with sauce all over the fries and the chicken tenders they didn't cover the sauce up so everything is now mixed together unacceptable and I would never order from this place again in nor would I tell anyone else to do it",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2xTtVI6h9BkEEASzLZNzpg"
  },
  "s_rdsa-sLOmWndYs3EJK4w": {
    "date": "10/29/2016",
    "text": "Simply amazing!!!!! Fresh cut fries topped with chili and liquid gold goodness!! My kids were on cloud 9. Burgers were heavenly. Best I've ever had. We will be back!!! Often!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8TTQtNAkN8inZRNLb3q-3w"
  },
  "Bn_EBVRfV_UzOkcYefnEvA": {
    "date": "12/2/2015",
    "text": "Yay! Back at Chubz again! We drove almost 3 hours for the best burger in the entire universe! #Cary2charlotteforchubz We love you Steve! (Owner, he is the bomb) We miss you Scott!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8fgKBycD93RDcOKGulqaXA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Chili Cheese fries Yummy!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8fgKBycD93RDcOKGulqaXA/o.jpg"
      }
    ],
    "user_id": "cx759vqRbbOYuQ_fq7UcEA"
  },
  "RMERP_eyS7vEaQVQACa0GQ": {
    "date": "10/12/2015",
    "text": "I'll start with the pros: super delicious burger, crispy French fries, and wonderfully battered onion rings.  Cons: they messed up my order. I ordered two burgers, one with chili on the side, and both with just meat, bread, and cheese. Both burgers also had toppings on them. Then, when I bit into my onion ring, the onion still had the skin on it! Definitely not something you like to get.  All in all, my first experience with Chubz was pretty good, but not great. I would go back and double check my order (should've done that this time)!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "spcT0xyJhmk-QL-O0FJyKw"
  },
  "4RK7SECTAkMfZrgOcsMDMg": {
    "date": "1/31/2017",
    "text": "Great burgers and hot dogs. Great customer service and fast deli every after 5pm. Love Chubz!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ACEJ_8Q-ipWsQnIAyvwbiw"
  },
  "NiHTvHT9Ymd6niO7MRAAPw": {
    "date": "9/13/2016",
    "text": "Shockingly this chili did taste pretty close to Tommy's burgers in Los Angeles. And will be back for another chili cheeseburger soon!!!! Staff was really welcoming and funny and seem to be on their game.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KN8aLwSN4irIgfJI4T1zQw"
  },
  "8DMrZ2sri42h7hY41WU6dA": {
    "date": "12/26/2016",
    "text": "Wonderful chili cheese burger! Juicy without being greasy.  I have eaten asset the original Tommys in L.A. just as good!   Chubz also offers an honest tamale. Served without chili, cheese, onions, tomatoes band dill pickles. Yes dill pickles on a tamale. Don't knock it if you haven't tried it!  I hear they will be adding  fried Oreos sometime after the first pic the year.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_aAlfachfrwFP66th7-muA"
  },
  "detrkR8mYQG2hNXbFT1UkA": {
    "date": "3/6/2017",
    "text": "This was my first time here and didn't disappoint. I got a single chili burger but could've eaten a double chili burger. Onion ring were good and fries were good as well.  Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kuXUYcCYXSGK30g7zkEV0A"
  },
  "lINp8xRbSX_tmG3zFxeTig": {
    "date": "11/15/2014",
    "text": "Great!!! I'm from Los Angeles California and was craving Tommy's burgers & In-N-Out...I yelped 'chili burgers' here and embarked on a 42min drive from Mooresville to come here. I'll tell you this....we were not disappointed!! And we will be back again. We absolutely loved it. Their variety is huge and our bill was under $40 for 5 meals. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "597g80EMSwXSpJEIgQ9b5g",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Fresh cut fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/597g80EMSwXSpJEIgQ9b5g/o.jpg"
      },
      {
        "img_id": "Emg-bohI493Yq87Y-gStJQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. And they have Mooresville ice cream.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Emg-bohI493Yq87Y-gStJQ/o.jpg"
      },
      {
        "img_id": "WiJzy-7hGG2n9Y9OsFlZdA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. They serve beer as well",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WiJzy-7hGG2n9Y9OsFlZdA/o.jpg"
      }
    ],
    "user_id": "l7DCo7MP_xO4VEQaOsBFNQ"
  },
  "XhchXHBr2n5wyiSWoCAPag": {
    "date": "8/3/2014",
    "text": "If you are looking for health food, keep driving. If you are looking for a great burger and fries. This is your spot.   Burgers are awesome  Onion Rings rock.   Fries are handcut and fresh.   Good times",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "v4KYwu8jCE0oiDzMRsQn3g"
  },
  "Z5P8DDsmhR_WQO79BHfdoQ": {
    "date": "8/20/2015",
    "text": "Great spot, a nice little gem if your from California or been to California you'll know what I'm talking about. This place is kinda like an In-N-Out and Tommy's combined they have chili cheese burgers, and what's equivalent to a double double, also chili dogs even complete with your choice of chili cheese fries. Or animal style fries. Best part they also serve beer can't get that back home. The staff is really friendly and informative don't know how many times I've been to a new restaurant for the first time. Have to try a figure out what I want or if I'll like it. The staff came right out to help identify what was what.   So, I got the double chili cheese burger with chili cheese fries. And let me tell you was even better then the Original Tommy's back home on California Tommy's chili is a little to greasy at Chubz it was perfect for me. Pricing was reasonable and a good value   Wish there was a Chubz in Ventura county Ca. I'd for sure be a regular. But next time I'm in Charlotte i'm definitely coming back   Ps they have a chalkboard wall at the sit down bar where you can leave a little message behind",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gTDLCWjn_09qe2h_WxxkSA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gTDLCWjn_09qe2h_WxxkSA/o.jpg"
      }
    ],
    "user_id": "Jk3GL46MR_1NH2BM7wpp9Q"
  },
  "o1uz6_cVxdyu6OBrVk3WMA": {
    "date": "10/28/2016",
    "text": "Great service. First timer I will be back. There are days that you that greasy cheeseburger that takes you back to those to local drivin that are long gone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hTR05OeEBMzmXlH2k_5aZQ"
  },
  "A7nTVPH5nIzABpKVS8-KNw": {
    "date": "1/12/2015",
    "text": "I met a friend here for dinner one night bc I had some freebie coupons.   Thank god I had the coupons.   Honestly, the chili on the burgers tasted like texas pete chili from the can.     The fries are home made and the patty is too, but my friend nor I could get past the taste of the chili.   The place has promise, but needs to figure something with the chili flavor.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pInF8FmKgca-OKKr02SvjA"
  },
  "jDChmSK2zqZYnvOrid6-Jg": {
    "date": "10/26/2014",
    "text": "Just had me a chili single burger and fries. They should really take the chili out of the name. It's terrible.  The fries were all hard and like pieces. I'll not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n810c8W9BoAeOtPvMeD0pQ"
  },
  "t2znlpqY44XG_iXf38JDMQ": {
    "date": "1/28/2015",
    "text": "Very good fries!!!!!! A knock off on the in & out burger A great amount of parking. Cool interior with neat stuff in the men's room Very approachable and talkative staff",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bTGm7hMJVUmBYGFQ46ar_A"
  },
  "uMPSsyEqANBdrhpbsdq2YA": {
    "date": "7/25/2014",
    "text": "Was in on a Friday afternoon around 3:45. Nobody in restaurant with the exception of gentleman that had been waiting in drive-thru who subsequently came inside due to lack of service at drive-thru,  As always when reviewing a new place I select several items.  The Hot Dogs were basically raw.  There is a \"up charge\" for slaw. The hamburger was no better than Zack's or Mr. C's and certainly cost more. The location is horrible for anyone attempting to make a left turn onto Woodlawn.  The food was not good.  Maybe for a late night drunk looking to soak up the alcohol.  The cold fries should assist with that.  I hope there is no long term lease,",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DtS1D-ZTo7eQrnkM8yhl6A"
  },
  "XB2-366KxQm8eNCgUniDZw": {
    "date": "11/19/2014",
    "text": "Charlotte needs more places like this. Tried it first because of a GroupOn deal, but now I'm a regular customer. Very friendly staff, good service, and consistency. I have only had the hamburgers, so I cannot give a review of the hotdogs or other food. I always try to tell myself I'm gonna get something different next time, but just can't help going with the Chubz Double deluxe.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q3L8xhjwOyG5FTAEtQNE1A"
  },
  "kcCaVCRkR0_lTaUPvByCeQ": {
    "date": "6/25/2017",
    "text": "I got the chili cheese burger with bacon and foot long combo. To be honest the foot long was just ok. The burger however was awesome, flavorful and extremely delicious. A little pricey but to be fair, a burger this delicious is money well spent. So yes I will return when I'm craving a very good and delicious burger. And I love that Chubz is not at all far from my house.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1C9tr_SIHRCzOKv-XKJj4w"
  },
  "RIal1yDS4rfIRByuci_l9w": {
    "date": "4/19/2016",
    "text": "Chubz is a phenomenal restaurant! Located right off 77 it's very easy to find and accessible to everyone. They cook everything to order and use 100% real beef! Oh yeah my type of burger! I've been fortunate enough to try a variety of things off the menu and never once have I been disappointed. The cooks are nice they know what they're doing and food is always fresh! The WINGS AND BURGERS ARE FREAKING AMAZING. There sauces are good I've had a chance too try them all. I love the cheese fries and just the freshness of the food. Depending on what your budget is I think it's a bit pricey but it's definitely worth it which is why I keep going back. The chili cheeseburger is so freaking good the bread is so soft and tasty. If you haven't tried chubz you have to!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aPLfU3MUvXVkHRoztLI4Fw",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. So good man",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aPLfU3MUvXVkHRoztLI4Fw/o.jpg"
      },
      {
        "img_id": "nUalB6vyL31uj0dr7jLFGw",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Chili cheeseburger! Yummy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nUalB6vyL31uj0dr7jLFGw/o.jpg"
      },
      {
        "img_id": "Y3rTsVauIVInRRD4T4jFKA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Cheese fries up close",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y3rTsVauIVInRRD4T4jFKA/o.jpg"
      }
    ],
    "user_id": "eotRnUFGGgQ-qU7nE10HvQ"
  },
  "fqfRl7Ge0paEUlv1dKZs5g": {
    "date": "6/4/2016",
    "text": "Delicious chili double! The fries are great, the wings are great, the burgers are great, the onion rings are great...see the pattern here? Awesome service, and absolutely great overall. We will definitely be coming back again. Keep it up Chubz!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SerdK2DW_2R7z1b9WU97fg"
  },
  "9OsB8IPLJTwJpuGtPj7Jcw": {
    "date": "1/23/2016",
    "text": "Ate here with my wife a few weeks ago and have not had time to write a review...we got here as soon as doors opened at 11am...aside from having to take a couple of phone calls, the was primed and ready to take care of us..he knew we were first time customers so he took the time give us a run down...after telling him I came after reading it was as close to In N Out Burger as I was going to get, he corrected the statement saying I was going to get more of a Tommy's Originals feel...this was something I appreciated \"honesty\"..  I ordered a western double cheeseburger while my wife picked up the famous double chili burger..we also ordered a side of chili cheese fries...a regular size fed both of us...the food did not disappoint and the service was top notch giving us a history of how the joint came to be...if you're looking for a fancy burger place, this is not your stop...this is a good ole fashioned burger joint straight out of the 80s and 90s..you're going to get your hands a little juicy...  Take a look around the place at the pictures and don't forget to meet Anthony pet desert lizard...if you have time, talk to Chubz himself..he has a great story to tell.  The only chain place the might hurt Chubz is the possible expansion of BurgerFi into the area..but if you're looking for a nice burger joint for reasonably priced date before or after a movie..this is your spot..  Justin and Alexis",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "zbLInEUtwlQv2jPmdgYlyA"
  },
  "qqznbAu3T_44jm74zSAGYw": {
    "date": "4/14/2016",
    "text": "I'd have to say, the deluxe cheeseburger here may be a little better than In N Out Burger on the west coast, which is pretty hard to beat. Their burgers are so fresh and made to order. So skip all that fast food junk and come get your burgers here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jOWf-K0GLMHKeOUti7oi3A",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Better than the double double at In N Out. So good. Double cheeseburger deluxe add bacon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jOWf-K0GLMHKeOUti7oi3A/o.jpg"
      }
    ],
    "user_id": "6VJxJq4CRcpDNrfrO551Cw"
  },
  "v1TeyM54C_wS3oSpmzPlKA": {
    "date": "4/28/2017",
    "text": "Stopped by today while in the neighborhood after my sons baseball game. Customer service was awesome. The burger and hot dog was really good. Not a fan of fresh cut potato fries but they were fresh.  The only complaint I had was the heat. Not sure if the AC wasn't working but it was very warm inside. Overall would visit again just for the burger.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fYBkpsjPhxXhkxD2ep4Vyg"
  },
  "--ZATd3zESjDp3vImaOy6w": {
    "date": "9/12/2017",
    "text": "GREAT SERVICE! Was in town for work when my company evacuated Hurricane Irma and came over for dinner. The guys were super friendly and helpful. Had the patty melt and it was delicious! Be prepared to get messy the #1 sign of a great burger",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s21HhCwTM3mnEaCuWFmQvw"
  },
  "IGlcmhCzjBAGu_hBPebN_A": {
    "date": "1/29/2014",
    "text": "I was happy to see another burger place filled the space of the old Burger Company which did not last long here.    Chubz focus is a bit different than its predecessor in that it sells affordable burgers, dogs and fries and the theme is chili!    I stopped in here and the place was kind of dead.  One table was occupied, a few people working behind the counter.  You'd think I'd be waiting on right away but I waited about 10 minutes before someone took my order.  The car at the drive thru pulled up after I was standing there for 5 minutes an they waited on them first.  So I was getting a bit impatient.  The someone finally waited on me and the person working the drive-thru was having register issues and the person taking my order was interrupted by that. So 15 minutes later, my order was complete.  Fast Food this is not!  Anyway, I ordered the #1 combo which is a chili cheeseburger, fries and drink to go.   It wasn't too long to prepare.  Everything smelled wonderful. Unfortunately, taste wise, I was a bit disappointed.  Besides chili, there was another theme to this meal....Salt...and lots of it.  Everything was salty..the burger, the chili and the fries.  The fries were almost unedible due to the amount of salt on them.  They were fresh cut with an extra salty chili seasoning.  The burger was the right size and covered with chili.  The standard toppings for the burger include mustard, tomato, onions and pickles which is a nice combination.  I like the concept, the prices are good but I believe they need to improve their service and cut back on the salt for this place to survive.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "-6Ksq3lTBU7cBxvkqZT_NQ": {
    "date": "5/19/2014",
    "text": "It is delicious and yes a bit sloppy but what do you expect it's a chili cheese burger.  :) The fries are interesting.  It almost seems like a combination of sweet and salty seasoning on them. My husband loves them. I prefer my fries more on the plain side. Customer service is wonderful.  I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qy9ifUacuas68Zu8sBLffg",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Seriously,  this is beyond delicious :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qy9ifUacuas68Zu8sBLffg/o.jpg"
      },
      {
        "img_id": "4d1wm1p1ekP-lKdCTp03OA",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Delicious #1 Burger combo. Famous Double Chili Cheeseburger.  Just $6.95 for the combo including drink.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4d1wm1p1ekP-lKdCTp03OA/o.jpg"
      }
    ],
    "user_id": "pBvPBJcBiJRoE9yV93S0dw"
  },
  "nlkT0HwDWcwXlsadz-Qmrg": {
    "date": "1/27/2017",
    "text": "Hours of operation are False. Ordered online drove 20 minutes arrived at 10pm and they wear closed. Please adjust yelp and website to accurate hours of operations and shut down online ordering when closed",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w_c4oN6XwG2osE88B3OQJw"
  },
  "nT9kyWutY3f5SOrFELYL8g": {
    "date": "9/12/2017",
    "text": "Unprofessional they never answer the phone and they leave early closing as earlier 45 mins. Very disappointed in them I was a regular customer",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nthuh29kw296Et96bqirtg"
  },
  "wDS5sLbff-7yUBJpDvp6Kw": {
    "date": "6/2/2017",
    "text": "I love Chubbz. Probably would give it a 5 if it was a lil cheaper. But this place is great. Not your typical fast food. They make your meal upon ordering so everything is hot and fresh when u receive it. I pigged out. I usually get the chilli dog and cheeseburger. Both great. Chubbz, I'll be back. Thanks for the good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aIt8TKiYoPk7MW-5EZqZFA"
  },
  "Hj3M87dWfS0z-LjAb2Laxg": {
    "date": "11/25/2013",
    "text": "Located off of Woodlawn, right next to the 77 exits cluster, formerly a Krispy Kreme (RIP glazed doughy goodness), is a new burger/dog joint.  And when I say burger/dog joint, that is what I mean.  That is what they have.  Burgers, dogs, fries and I think I saw some kind of chili empanada.    There is limited seating - a row of affixed stools at the \"bar\" on the other side of the exposed kitchen and maybe 8 tables with varying amounts of seating at each.  You would think because they only have 3 items with just different toppings, that it would be fast.  That would be wrong.  The two gentlemen (owners from what I saw on the website) looked like it was their first day ever doing this, but since they have only been open for about a month (I think), hopefully they will get in the groove.  We weren't in a hurry, but if we were this would have caused some angst rather than giggles.  You order at the counter and wait for your number to be called.  My order of fries (to split with my dining buddy), chili cheeseburger (there was no chili, but after waiting for 25 minutes, I was going to eat what they gave me), chili cheese dog and drink came to around $10.   The food: Chili cheeseburger - I had no chili on mine (dammit!), but the bun was toastedish and the burger was tasty, though a bit small (like Wendy's Jr. size).  If you are a hungry adult, you'll need to order a double/triple/multiple. Chili cheese dog (pictured) - Friggin mess.  It looked like they threw the dog/bun in the basket and just coated it with cheese and chili.  That being said, I used a spork to try to clean it up some so I could pick it up and eat it.  Fairly good snap to the skin, but it tasted like it was boiled.  It was fine, but I have rarely met a hot dog that I refused to eat and my stomach was eating through to my spine from waiting.  Cheese was good, chili was good. Fries - Reminded me of 5 Guys - fresh cut and skins on.  I ate a few and passed the rest onto my friend. Fountain drinks are a buck and self serve, along with sweet/unsweet tea.  If you have a craving for a greasy joint kind of lunch, this is the place for you.  I would eat there again if in the mood, and it's a nice addition to the lunch choices on this side of town, but I won't be rushing back.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "DwC1kKNVJ3c3ely5xzP6Xg",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Chili cheese dog with fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DwC1kKNVJ3c3ely5xzP6Xg/o.jpg"
      }
    ],
    "user_id": "zsZBYWYEmLLs81_f-HHM8w"
  },
  "5XCJSNzUG2PhmCfAa7I3rg": {
    "date": "10/29/2016",
    "text": "Bruhhhhhhhh CHUBZ is so legit. Man.. I have to be completely honest, when you first walk in, you get a little bit of a Texas Chainsaw Massacre vibe, but like as soon as that shakes off... The food is delicious, wonderfully priced, nice service.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iiW01DPkDIUYAND9dLtNDA"
  },
  "HoeAHAvybMoZiRZrEfzxkg": {
    "date": "12/4/2013",
    "text": "Yes! Finally a place that does it right! If you are in the mood for a burger oozing with chili and cheese that will run down your hands and make you use up a lot of towels then this place is for you! The chili is home made, the fries are hot , well seasoned and plentiful. The menu prices are very reasonable. I are their last night and got the double chili cheese combo. It came with two fistfuls of fries.  This place reminds me of the \"Chili Bowl\" in DC.  I can't wait to go back. ddc",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jzy9P_PD89jzjd-PKcx62w"
  },
  "vb5EyX4UvUyko-bp-iftpw": {
    "date": "11/3/2016",
    "text": "This place is definitely in the cut off of Woodlawn right near the 77 ramp and the hotels. I came in and ordered a few things. What I really enjoyed were the chili cheese hotdogs and hand cut french fries. The milk shake was also yummy. I think next time I come I will try the 1/2 chubs burger, the party on the regular burgers was a little small for my liking but I really enjoyed the deluxe toppings. Support local business, and give this place a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9VsUfMdfdATg7Pzf_Ypk3w"
  },
  "MhBFltcu1kP2nMxjWvoyCw": {
    "date": "12/16/2017",
    "text": "5 stars hands down. Onion rings were fantastic, had the double burger with bacon. I will definitely be back. Wish I knew about this place before.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pb12ngem7W7uOpmsHEDyew"
  },
  "66GwQrWbLxLqoTQmBpaMGA": {
    "date": "10/10/2015",
    "text": "This place was so good we ate our food and came back for seconds 15 mins later. THIS CHILI IS JUST AS GOOD AS TOMMY's BURGER( coming from an og TOMMY's customer from L.A.) We have been looking for a chiliburger spot for 10 years now and have finally found it. They also offer an IN N OUT type BURGER and the difference is the cheese and the meat. The chiliburger is a 9/10 and the IN N OUT burger is a 7/10 in comparison to Tommy's and IN N OUT.  They make it fresh when you order so expect a wait. WE WILL DEFINITELY BE RETURNING!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "32FOO_YqfXsSsnK65TIeHQ",
        "caption": "Photo of CHUBZ Famous Chiliburgers - Charlotte, NC, United States. Deluxe burger IN N OUT STYLE",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/32FOO_YqfXsSsnK65TIeHQ/o.jpg"
      }
    ],
    "user_id": "ZiDU46Y0CPRBu5Mspgd_3w"
  },
  "cTkSLtJ2EOLLjkSI7kfSbA": {
    "date": "8/15/2015",
    "text": "If you like In and Out you might like it here.  The burgers are fresh but small. Just like I&O   The hot dogs are good. They are Sabrett and deep fried and finished on the grill. I actually like that. Get the jumbo dog.  The Fries are excellent. Fresh cut and done crispy.   The atmosphere. It's a hot dog stand with Fox News on the TV and friendly service from the owner.  It's a solid good. Especially if I don't feel like walking further from the hotel.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NonCv-aBjvao13-QBeBqTA"
  },
  "p58z0hO8IgL33dC9qEsMuw": {
    "date": "8/4/2015",
    "text": "I'm giving Chubz a 4 simply off smell, can we do that? I mean I'm an avid M-F at home meal prepper , but remind me to come back for these cheat meal goodies. Handcut fries, chili burgers and hotdogs , plus my co workers gobbled it up and I trust their taste buds . Will update after I actually taste it , their speedy service and attention to customer service earned this review .",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lUXifKGBbbRUNxaPnuekXw"
  }
}