{
  "d02CGOAwngrjBJ5g6Hmvww": {
    "date": "4/22/2016",
    "text": "One of our favorite places. Staff is friendly and attentive. Food is great. Love the shrimp basket. Family friendly but also great place to get a drink! Always recommend!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "42lZvL0UTsIH3AA5t2JfXA"
  },
  "4UZXK63uBwVNQYlFdw9Fdw": {
    "date": "3/26/2016",
    "text": "It may look like a sports bar but the food was great. OMB cheese and pretzels were great. We also had a great French dip and Salmon BLT. Beer selection was also extensive. Can't wait to come again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p2rV6p-1YhHZZz80MPj70Q"
  },
  "Wx7Hr1MeZun3bUsCIOlwqA": {
    "date": "4/29/2016",
    "text": "Good food and service was just ok. Have a nice size gluten free menu. Beer prices are a little high.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "flUjZQkg93UWLxjzzQuC2A"
  },
  "DjcVLk4_J3u-zWYS4L3J5A": {
    "date": "3/14/2015",
    "text": "Noticed the health inspection had gone from bad to worse. Looked it up on line. Will never eat there again. 5 \"critical\" violations which were beyond disgusting. 3 of the 5 were \"repeat\" violations.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "ju1BGjcR5CcoMGgp6__ljA"
  },
  "z_SBbLoyqB3W4FTFpIJnuw": {
    "date": "10/2/2011",
    "text": "This place is a little better than the average Bar food.   There is a nice variety and some healthier selections.  I love their wedge salad!  The beer  selection is also very nice - they have the usual and more.    It's a fun casual place to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UhZWp2oHWLGWZuARHBQtKg"
  },
  "VMsmkUixjyslkIUzd33saQ": {
    "date": "1/2/2015",
    "text": "Casual atmosphere, bar food, but some good specials. It seems like you just have to know what to order, because it seems hit or miss whenever I go. My husband has more options than I do, because of a gluten allergy. We've tried a lot of different items on their menu. My favorite is the spinach & artichoke dip. They have a wide selection of beer and full bar. Trivia night always draws a crowd and is a lot of fun.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jsOz-dWToun2VsFcFAfGww"
  },
  "ied5R7v1qMfxHMWoV7c3BQ": {
    "date": "1/25/2014",
    "text": "Wow, I was really surprised at how good this place was! I drive by it all the time and always considered it just to be pub food so I never actually tried it until looking through google results for something good near where I live. This is by far not your average pub, the food is fantastic. I have had several of their create your own hamburgers and they are cooked to perfection and seasoned just right. The garlic tots are awesome and something different other than french fries. They have a good beer selection including seasonal/local options as well. The service was spectacular and the restaurant/bar area is separate enough that it is also family friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P8w4YBgNcYct6BeIut9cEw"
  },
  "urhgzUYV5YA6UGKNmBfxig": {
    "date": "12/9/2010",
    "text": "Love having access to a cool hang out in my neck of the woods!  The neighborhood is lucky to have The Lodge!  The bar area is my preference...low key, good music, TV access, great drink specials, & awesome food!   Went for dinner and as usual, had a great bartender/server:  knowledgeable, attentive, & personable.  Had the pot roast and a side of mac n cheese per the server's suggestion.  It was some of the best I've ever had and I was lucky enough to have leftoverst!  :)  WIDE variety of drinks and menu items!  You definitely need to check out THE LODGE....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "dk9GzM6Nni61oBdkETDFkA"
  },
  "Ic_z2yiNOWAyZmPKAl_Hng": {
    "date": "7/14/2013",
    "text": "I agree with the previous review... no online menu? our meal was good but we waited a long time for our food.. we both got lodge 'favorites' on the menu..next time I'll try something different because mine was just ok",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZN7d93LoSOsHEBQh2kk5Fg"
  },
  "zLV5OuAkzBiWmEbelz_Qdw": {
    "date": "11/22/2015",
    "text": "Had a french dip that was excellent and kids enjoyed their meals.  Service was outstanding this time as it was prompt.  Great people at this place and great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bsvcnZW0_NI-c56QiUY22A"
  },
  "82MTbTQQwmRG-Or2lp_XGA": {
    "date": "11/5/2012",
    "text": "Great beer selection, friendly bartenders, fun trivia night, better-than-average bar food.  This bar is located where I grew up in southeast Charlotte. I make it a point to stop in whenever I'm home. During the day you'll find families eating in the dining room and at night the typical crowd is local twenty/thirty-somethings. Not quite a dive bar, not quite a sports bar. There is generally live acoustic music on the weekends and trivia is every Tuesday. Trivia night really brings out the local characters and can get competitive. The first ones to the bar on gamedays get first pick of what games go the bigscreens in the bar, kinda cool. My only complaint is the location- I wish it were stand-alone and not in a stripmall. Try the fried pickles!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wfu1YP-mLfxZSb0zDGbXaA"
  },
  "aGXvq29t40swho6-Yx0viA": {
    "date": "10/4/2013",
    "text": "My husband and I just moved here from Atlanta and we checked out the Lodge in an effort to find a nice local restaurant to frequent. The atmosphere on the patio was great and the service was quick. I wasn't overly impressed with the food, but I will definitely return and try a few more things on the menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8GOS83ychvXkZ6Ti2vQkQ"
  },
  "SPU29yqVp6ynye5Ffg4feQ": {
    "date": "5/1/2014",
    "text": "food decent. Please don't let little kids sit at the bar, or in the bar area,  when adults are waiting to sit and have a beer!!!!  They are not 21, do not need to be sitting at a bar!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_IF9tnkSm-Xq7yCRynJ1cg"
  },
  "Lo4m0IxKXy0faYnNWXESoQ": {
    "date": "5/13/2015",
    "text": "Eric is one of the best bartenders in Charlotte. I don't think he has an \"off\" mode. Great food and drinks.... The cost is a bit pricy but it is less than a 10 dollar cab ride saving money and lives on the risk of a DWI or accident !! The mashed potatoes ( all kinds ) rule !!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k8OTlbII0oi8XuCZYyfcRg"
  },
  "Wc1kC4CNiL0X2nbImnpraw": {
    "date": "3/25/2015",
    "text": "Great staff, enjoy the live music",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IWPlhH7RKZVQcdu8Kne5PQ"
  },
  "ZuLw9arEFZpZnhWZAt-UMw": {
    "date": "6/21/2013",
    "text": "Ok it's the age of the Internet... No menu on line... Really?",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3kyMCzeqEmSh5aOukLixUg"
  },
  "YeKNpXDCVbkE_1rJKbjKAA": {
    "date": "2/22/2014",
    "text": "Great atmosphere and food. Love the collards! Wait staff really accommodating. Best bartender is Eric. My kids also love going there and writing on the chalk board walls.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cbl__Y4WE2S1ozYcgllXdA"
  },
  "sa-6oQ6aLXY75ogXTFgmhg": {
    "date": "4/28/2011",
    "text": "Great neighborhood joint.  Decent menu.  It can get crowded on Friday and Saturday evenings with long waits.  Great place to watch a game or down a few cold ones.  Service is OK (not bad, but not great).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ddKZervvozCcK5j6gnasJA"
  },
  "egWQ25PTuBhg9pQh-c90JA": {
    "date": "10/23/2011",
    "text": "One of our favorite places.  Great beer, amazing BLT, plenty of choice for burgers, great for kids, friendly staff",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jDyubAemYQZ_p6wmztg_ww"
  },
  "XtHd5MHX-RSsPlAV_ihMXg": {
    "date": "1/20/2013",
    "text": "Went to The Lodge today after church for the first time.  Waitstaff was excellent, and the food was too!  Highlights for our table were the fried chicken, which is the Sunday special, the fried pickles, the tater tots, and my wife had the patty melt.  We'll definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kR1Vyj_1cZZf1TAVlbrzzQ"
  },
  "5jz3qBN-JFC6HDI4BUnFQA": {
    "date": "6/14/2017",
    "text": "The lodge is one of my favorite restaurants in charlotte. The service was amazing. The managers were very helpful with all of our food allergies particularly gluten, soy, and dairy. The food was excellent and the prices weren't outrageous. Highly recommend the lodge if you are looking for a burger or piece of high quality fish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aAZD7aSOQqzf0tED71jWkg"
  },
  "FP6pnBljPqkuSrlbPMVAfQ": {
    "date": "8/30/2013",
    "text": "I just had lunch at the Lodge for the first time. i was impressed with the decor and the food was excellent. I ordered the chicken ceasar wrap but I observed the Spicy Chicken Sandwich, Bill's Fish sandwich, and one of the burgers that my colleagues ordered. They all looked really good - lots of food. Service was prompt and the wait staff were pleasant and nice. It was a little pricey for me but given the amount of food/portions it is probably about right.   When we received our bill I was surprised and confused about a service charge that appeared to be about 20%. My chicken wrap meal with water was up at $12.45 with the cost and the $2.00 service charge. I didn't understand the service charge and it wasn't explained to me so I can only speculate that it was put on our bill because we had them split the ticket among the five patrons; seems like an excessive amount to charge for splitting a ticket. I can't be going to The Lodge for lunches if it's going to cost nearly $15 with tipeach time. There are plenty of places around that will deliver food just as good for $10 or less.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sC5XveM59uhy9QcAibzqIw"
  },
  "bIKTTKLYCRzCYGvsO1fhTg": {
    "date": "9/5/2013",
    "text": "Think of Cheers.  If you go more than once you're family here.  The menu is varied and all done well.  The beer list is constantly rotating and they do a great job with the local brewers.  Staple of the neighborhood.   Favorites: Sliders: pork, chicken, or kobe  Salmon blt Chili Rib Thursdays  Spicy chicken sandwich  Tarot tots",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jASEKs8pEtgvJ--eXZnKtg"
  },
  "pqCArZTSUX_KuY8B_h0z6w": {
    "date": "4/9/2016",
    "text": "My wife and I tried it out on a Friday night.  We both got the \"fish fry\" which consisted of 2 thick pieces of beer battered cod, slaw and fries.  It was good.  We tried to go back last Friday but there was a 45 minute wait.  We were hungry so we went elsewhere.  The food is good.  It does seem a little disorganized.  Both times we've been there the hostess was not at her station and the bar was slammed.  It looks to me like they need a few more people in the front and behind the bar.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PB6X9sZyh3kmzz4CzZPxXg"
  },
  "3QwH4Cw9gmLnGZSaihg4BQ": {
    "date": "4/8/2016",
    "text": "We love the atmosphere and the food. Healthy options if you want but some good solid burgers and fries if that's your need.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FDGGqNICchtkzLdEr4RUxA"
  },
  "9FMdIdk6SsHTpP_ngtH3Dw": {
    "date": "3/25/2016",
    "text": "Drinks overpriced!  10 bucks for a single tall Jack n Coke.  Was not impressed with food either.   Service wasn't great.  Had to go to bar to get second round of drinks myself because we got tired of sucking on ice cubes.  That's when I realized that they were $10 a piece.  I'm use to $7 for the same thing everywhere else in the city. The place looks cool.  Live music was decent.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1IBo99hoq-TG5yyKrji4Hg"
  },
  "lBb1UcHiDuVbKXeoW4H9aQ": {
    "date": "1/21/2017",
    "text": "My boyfriend and I are new to the area and dropped in for a quick bite to eat. The menu had tons of options, the server was friendly, food was tasty and I enjoyed the family friendly bar atmosphere!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vNqW8L0VnRD4ek4QPYppyg"
  },
  "uxhJzKMqcNXPkIgPP99MOQ": {
    "date": "3/5/2017",
    "text": "Maybe we just hit this place on a bad night, but you'd think on a Saturday night a restaurant would be on top of their game. I'm giving it two stars instead on one because of the six of us that went, one guy liked his wings and salad.  We ordered and the dining area was virtually empty. It took almost 30 minutes just to have an app order arrive at the table. The only app served early were the Jalapeno poppers, and they looked like a sad basket with a half dozen tiny pepper nuggets. OMB Cheese dip and a spinach dip arrived at the same time as the wings, salad and a wrap almost ten minutes ( now about 40 into the meal ) later.  The OMB cheese dip should be called Salty Fondue. Tried the corn dog basket, three corn dogs that at least had some mass to them ( twice as much food easily as the Jalapeno popper basket ) but the corn dog coating had virtually no flavor. It was like corn starch and baking powder. No seasoning to the batter, nothing to pop the corn flavor. Waitstaff seemed a bit disorganized. A kid from the kitchen served the dip appetizers, and spilled a decent portion onto the floor next to the booth while trying to carry everything. The puddle ( not a couple of drops, a definite puddle ) remained on the floor next to the booth the entire meal.  This used to be a an Irish pub, and the food was spot on. Totally disappointed with this change and hope they can make the food as solid as the interior remodel looks.   A for Beer. D for Food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_1j3nHlVob6U4vcT01lZJQ"
  },
  "TWBW5tvo0Uw9S-YwE_hYbg": {
    "date": "6/13/2015",
    "text": "Really excited to learn about The Lodge. Search for a place with outdoor seating so I could bring my dog... And really scored when we found this place. Almost 100 beers with about 16 on tap - most of which are from North Carolina.  The food was really fresh - I think they make most everything in house. Eric, the manager, was really courteous and all of the staff was amazingly friendly and prompt. conveniently located with a cool atmosphere and lots of TVs with pretty much any sports event you want to see. We look forward to our next time... I think there probably will be many!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tyGbO1r_2avF6retF5Bj2g"
  },
  "RjSgqmTkziA4X4vXWJOYew": {
    "date": "2/19/2017",
    "text": "Don't go here unless you have 2 hours to spend! Got there for an early dinner at 5:20. Order placed at 5:40, no food until 6:45! No refills on drinks. At 6:30 they acknowledged/apologized that it was taking awhile and brought our 2 small children some fruit. Kept saying it was because everyone got there at the same time. Um, don't people come for dinner EVERY night. Tables around us were being served and turned over. Won't go back, won't recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_3RxXtzAlDMzdFfMp9c9zQ"
  },
  "GO-EwnLrEOxmGzK94xVC6g": {
    "date": "3/30/2015",
    "text": "My Wife and I dropped in on Sunday to watch a game and have food and beer.  The service was absolutely wonderful, the beer choices were excellent, and the food was really excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bJguBxPlnTW29tRTAF0nkQ"
  },
  "PKk-b1rkAuZPKptsCFYBqw": {
    "date": "11/10/2015",
    "text": "I love this place!  Solid food and service.  I feel like I need to write a long review but that about sums it up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1wk9_DqXX0fiW0pyhNdQBQ"
  },
  "n6P1dFM3NkEuHdQKWcbNJQ": {
    "date": "5/25/2015",
    "text": "It's pretty simple; they have great food, great beer, great atmosphere, and great service. We were told about this hangout and within a month or two we had been back 5 or 6 times.   Everything I have had to eat is amazing. The turkey chili nachos might be the best nacho appetizer I've ever had, and omg the spicy chicken sandwich is delicious.   This is our go-to restaurant/bar in the area. Go there, you wont be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YJtnuUqdWSb3El2g2uOXmw"
  },
  "__XpItvq6nnrOQ3gvft1RA": {
    "date": "12/8/2015",
    "text": "Went today....1st time ever and all I can say is ....why did I never know about this place before? The fried pickle chips are off the chain !!! Our server was delightful !!! AWESOME !!!!   Definitely gets 2 thumbs up from me !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kj4UZEeSYg63uw1h9JNTSA"
  },
  "W384ckSlif7LmZT4ShTFnA": {
    "date": "5/17/2015",
    "text": "Food is always great! Service isn't always the best. Sometimes it's a long wait after ordering.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QsBwhK8U_m7hEY7UACxFMw"
  },
  "diaVkhZLUxrjq7UZNXWm2Q": {
    "date": "12/26/2014",
    "text": "Favorite sports bar near ballantyne! Great cozy feel and delicious food! They have a ton of local brews available.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0zWAeCchSNEJX6aNxJm7eQ"
  },
  "zmrS3BY_BHduHAnnhzFLZw": {
    "date": "8/6/2012",
    "text": "Really wanted to like this place as it is convenient to my place.   The fried pickles were pretty good - a little too thick but good and hot and crispy. The fried fish sandwich was terrible and I couldn't eat it. The bun was grilled and hard as a rock and the tartar sauce tasted like nothing but lemon juice (and I love lemon!). I tried taking the fish out of bun and eating it plain and even that wasn't good (maybe it was old?). My friend had a burger and he said it was OK but he wouldn't order it again....  Took forever to get drink refills.  Another place to mark off my list :(",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Gwg_z6yzFxvH8KuoiMSSw"
  },
  "iAP-iMuanZvyykdTjsvNJA": {
    "date": "9/28/2016",
    "text": "They have a broad selection of different things! Usually home-made and fresh! Great spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sxr8ndYi7vjYzqqslwuIEw"
  },
  "1IYAhiZ22_J7eL6XN1j9MA": {
    "date": "5/24/2014",
    "text": "Went here on a weekend and was really pleased with the service and food. The selection of drinks is very robust along with a great bar menu. I had the custom burger and it was excellent. Both of my kids ate all of their food as well - which is saying a lot! The service was attentive and very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2x2gaas7D0raiWvHiJh_eg"
  },
  "zE7YvybbL7FVGyyZJqCbhg": {
    "date": "3/26/2012",
    "text": "We went to the Lodge for the first time on a Friday night. I couldn't decide what I wanted to eat, but I knew I wanted to find a new place (new to me) in South Charlotte, so I took a bunch of spins on Urban Spoon, until this place came up. It looked like a cool casual place, which was just what we were in the mood for. Since it was a Friday night, there was a little bit of a wait, but not too bad, maybe about 20 minutes.The atmosphere was robust! They had a bunch of tvs over the bar, as well as back by the tables. The NCAA tournament was going on, so every television was turned to either one of those games, or SportsCenter.   I ordered the build it yourself burger. I got the bison burger, with cheese, wasabi may, and jalapenos. Much to my surprise (and delight), it came with huge, FRESH, jalapenos. It was cooked just right, and it was delicious.   My husband ordered the cuban, and although I didn't have a bite myself, he said it was good.  Both of us got the garlic tots on the side, and they were delicious. Also, there were tons of them; I couldn't even finish them. We could have split the side order for sure.  The service is what you would expect in a sports bar type atmosphere; attentive enough, but not fussy.  I will definitely go back, and would recommend this place when in the mood for a burger!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kdkEsWs1jlAaeJoN89-mgg"
  },
  "pii1dpRD6JoMsvEy4M4H3w": {
    "date": "3/9/2017",
    "text": "First time eating here. My wife and I decided to give it a try because the menu looked promising. They were very busy and waited for a seat for 15 minutes. First, the service was horrible. It took nearly 10 minutes to get water. My wife ordered a burger well done. When it came out it was very pink in the middle. Sent it back and it still came out pink and no fries. We were assured fresh fries were coming. 15 minutes passed before we were checked on again. Waitress forgot to get us fries. We had to wait another 10 minutes for fries. After we we were done we asked for check and it took nearly 10 minutes for the check and the only reason we got it was because my wife had to stand up and go to the hostess! We will not be coming back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K455oGkK_3zOQUlcT0iZHA"
  },
  "vLzOSzbv-yjh0nDSYchg7g": {
    "date": "11/8/2016",
    "text": "We ordered 4 take out dinners. Over all they were good but the steak was extremely rare. I had to cook the steak when I got home. The side salads were excellent. The baked potato was only ok, the only topping was sour cream. I would consider getting take out from there again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o8_gZYLIfFIcsaZVhHbwgQ"
  },
  "hL83NowXimepd3X7-6o1jw": {
    "date": "11/22/2017",
    "text": "Disappointing.  We used to come me here for dinner, now it's a single bar scene, not family friendly. I ordered the salmon BLT, it was cold & over cooked.  Broccoli Casserole was steamed broccoli with a thick cheese sauce. Garlic Tots were the only thing decedent.  Also, every IPA my husband considered they were out of, so if you're looking looking for craft beer, you're out of luck.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qrj65knVdQDuJkaayBbWdA"
  },
  "nk0UJC1SRhUklA2wK-DbEg": {
    "date": "6/1/2015",
    "text": "This place was packed on a Thursday night. The back porch was busy enjoying the live music. We came to TCBY with the intention of getting yogurt, which we did but ended up also enjoying the Lodge's bbq rib special with garlic tots and mac and cheese. The meal was excellent and we will be back to try more. Any place that's this busy on a Thursday night has to be good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UZ-jh-H84fdCt4R2Xugz0Q"
  },
  "LIVbi8OhHbaH6agmOBDBIw": {
    "date": "11/18/2015",
    "text": "Came here to watch a game with friends. Typical bar. Dark with random decor. I got a burger and it was pretty good. My fiance has been before and said his burgers were sometimes dry. Service was ok. There was one bartender service the whole bar and bar area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "oqTR-ygSvKxo1pPXNZEfGA": {
    "date": "7/6/2015",
    "text": "This place has been great since day one.  We hung out here when a buddy lived next door, we mostly drank at the bar, always met friendly people and ate some good food.  Later - we started just going to eat, and maybe have a beer.  The food is spectacular. Creative food, allot of comfort food.  They always have good daily food specials and everyone there has been kind since opening years ago.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yY2iNWC34qWb3vRV61iB8A"
  },
  "G_uUjSXKT_uIEFcff6weIQ": {
    "date": "3/16/2015",
    "text": "I had the Monday special meatloaf which was good and a very large portion. In addition to helpful attentive staff we were able to enjoy the nice weather on their patio with our dog, who received his own iced water without asking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQFG40gBfnlSd6qhdK9_Iw"
  },
  "moeAWetq4RwKnwMjTS6GGQ": {
    "date": "11/9/2014",
    "text": "With an outstanding beer selection, good food and a family-friendly atmosphere, The Lodge is South Charlotte's quintessential neighborhood pub. The bison burger is terrific, the nachos superb ... and did I mention the beer selection? More than 15 wonderful taps, most of which call the Tarheel State home. We're fast-becoming Friday night regulars, and our kids don't mind a bit.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "u8ipkF_PwdoybLOz4v-p3Q"
  },
  "M5rGgWGlXa4qu0PPZmtZ_A": {
    "date": "6/8/2017",
    "text": "Worst food and worst service I've experienced in Charlotte. Granted, I've only lived her for a year but I just had to do my part to warn people about this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ek4SB_1ablcorjV6gEGz3Q"
  },
  "bQxzmKwM5UNU_4ES4kkN9Q": {
    "date": "8/2/2016",
    "text": "One of those places where you really want to sit at the bar and enjoy the company.  My wife's favorite is the Nutter Butter Banana Pudding.  Good beer selection, good food.  You can't go wrong with this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYmsjLb0zv5ux0ivc5fieQ"
  },
  "b3ijJ1KPbRUXMjqSmukbbw": {
    "date": "8/15/2016",
    "text": "Great Beers on Draft and the Food is good bar room/american, love the Wings!   Good service and atmosphere as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TUrBfRkaMCs59P4Zp1DY5g"
  },
  "H_dOf0pnSnppCY_jYGPXag": {
    "date": "7/26/2016",
    "text": "I love eclectic dive-ish places like this.  Great local beer selection, very friendly device.  It's a bar but family friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BOUGnHs61xrgzBga3NGFKg"
  },
  "OsyJ5s3IwXgn6oXufSpQ3Q": {
    "date": "12/20/2015",
    "text": "We tried this spot for the first time with to go food and had heard great things. When the food came home the BBQ sliders were awesome, the RoRo dip was delicious, but the wings were dry and tasteless. I called to just notify them that wings didn't taste good and when the gentleman that answered the phone asked me what was wrong I started telling him and he then cut me off to tell me that their wings have never had a complaint and that people have told him they're the best in town. Now, if he had given me the opportunity to actually finish my comment I was going to tell him that everything else was amazing and that I wasn't asking for anything, I just wanted to let him know that they seemed a little off. Unfortunately, he decided to tell me that I was being rude when I said I wasn't calling to argue with him so because of this direct interaction at 12:30PM on Sunday, December 20th (sharing this so you can find out who he was) I have rated them as a 1 Star for his lack of customer service and willingness to even let me speak. We eat out at least 3 nights a week and just moved literally 5 minutes down the road, because of this person we will never give this place a chance again. If you can't even listen to some constructive feedback and then tell me I'm rude when you cut me off over the phone, then you don't deserve the ridiculous amount of money we spend eating out every week when we are literally in your backyard.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "qpWqiIH8nJRvoglt18mgww"
  },
  "3xgObGsJefoma346CYKG-w": {
    "date": "3/28/2017",
    "text": "Man, this kills me, because I LOVE The Lodge- but the last two Tuesday Trivia nights, the service has been really, really poor.  Their staff are usually great and friendly, but it seems the \"B\" team comes out at night and the \"D\" team is staffed on Tuesday... The busiest week night.  No follow-ups on drinks, no attention on food.  Orders coming out all over the place, and largely incorrect.  We love this place and would order more and more food/drinks, but they have made no effort in the month of March.  Disappointing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-aU8DzpB5aC6Am36pByecw"
  },
  "E0ZaD9rRC8V1vv8Smt3rEA": {
    "date": "5/30/2017",
    "text": "This place is so up and down. Sometimes it's really good, sometimes it's like they don't even try. I love it when they're in the mood to cook it well and make it taste good and warm.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rB8tBb9dzbi2hLWesKExdA"
  },
  "3vGpq6qNLcPMLdyq952hXA": {
    "date": "7/23/2016",
    "text": "Update: after the service last week, I have to ponder on whether I will return here. Was seated right away, and food came in a timely manner. But where oh where is my waitress? I never saw her again after she took my order (someone else brought my food out). I had to get up twice and pour my own refills. I never got my check so I left money (minus a tip) on the table and left. I overheard the table by me complaining for similar reasons. PS: the food was still pretty good, but service after being served was not on the menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3QtgI2sJITkbKaXEGsyThw"
  },
  "O1tBS_lSH6D6q4Mt0rICww": {
    "date": "5/15/2016",
    "text": "Great little neighborhood spot. Good food and a family friendly vibe. Chef Joe always has good specials and I know he brings in a lot of fresh ingredients to accent them. Staff is always friendly. Good neighborhood bar for those not looking for a dingy dive. Plenty of tvs for a sports fan too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gwecnmscaT388TahwQAWIQ"
  },
  "ETe2A0BU52ukLVvNMOqzsw": {
    "date": "5/13/2016",
    "text": "Always great every time. Great specials for lunch during the week. Try the Baja fish tacos",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b1HIT-9NB-jSzJVMKLx3Vw"
  },
  "zF9LIlG3xAKk4cbSnlKhvQ": {
    "date": "5/11/2015",
    "text": "Great place to relax and meet interesting people. Above average selection of appetizers and beer. Was a bit pricy but worth it for sure.  Will tell others about this find.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wzGHRfaVjrL-_uQ44Up2PA"
  },
  "HUtmTR6joZSV9yAEDWTB9g": {
    "date": "2/5/2014",
    "text": "Where everybody know your name will hit you when you walk in. It is a great local watering hole even if nobody knows my name when I walk in because we don't come here enough. We really should though as it has a wide beer selection and terrific bar food. The ribeye sandwich is scrumptious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVidDZUvOiy3xl0v3WKJlg"
  },
  "v7resTlKSVUlGmXdz7Mt_g": {
    "date": "7/11/2016",
    "text": "I love this place! I went the other day and ordered a custom burger with sweet potato fries ($9.99). I also had the peel and eat shrimp appetizer which had plump shrimp with a tangy cocktail sauce ($10.99). Everything was quite good and good portion size for price.   I'll be honest the food is good but not mind blowing. What blew me out of the water was their customer service!!! The waitstaff was so friendly and attentive. I had two dogs with me and they also treated them with care. I will definitely be back!  Lastly, did I mention that they have great drink specials?! Give this place a try, you won't regret it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "n2mqxEMJnk28X1Tw0AzPWw",
        "caption": "Photo of The Lodge: A Sportsman's Grill - Charlotte, NC, United States. They are dog friendly!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n2mqxEMJnk28X1Tw0AzPWw/o.jpg"
      },
      {
        "img_id": "lxVf4NkxZ0IscZ0OmuTBaw",
        "caption": "Photo of The Lodge: A Sportsman's Grill - Charlotte, NC, United States. About $10",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lxVf4NkxZ0IscZ0OmuTBaw/o.jpg"
      }
    ],
    "user_id": "N-9VZPg1XI2vQvL3Fbw-Kg"
  },
  "9cbUrRSdyatBW0QdTdBZoA": {
    "date": "2/4/2018",
    "text": "Jessica is our fav but we love everyone here. The menu is big and is our go to spot. It's very family friendly and there's always something for my son's ever changing taste buds. It's a lot calmer at lunch if you don't like the evening rush like myself. When it is warmer, the patio and bands are awesome and we do trivia night here every now and then. Huge beer list that you dont really see often on this side of town. Charlotte staple with the sweetest people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9bIRjI4vYXvDDnnJVrv0Sg"
  },
  "iIJVeudORE4kgNQmivk-Uw": {
    "date": "1/13/2017",
    "text": "My husband and I enjoyed our dinner at the Lodge. I had the veggie wrap with goat cheese on a lettuce leaf and my husband had the buffalo shrimp wrap. We were both very pleased with our choices.  If you follow a gluten free diet, this place has a complete gluten free menu, at least 3 different gf beers for you to choose from, and several ciders. It was great to have choices! The only reason I'm giving it 4 stars instead of 5 is because in a restaurant as small as this one, live music can be overwhelming. We love live music but found it tough to talk during dinner because it was so loud. Maybe next time we will go on a night where there isn't live music, sit outside, or go on a night when we want to listen to live music instead of have a conversation. Overall, though, good experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "iL1XNxJpthukMmKESTPqZw"
  },
  "bVbUAIbBZ7z_PEi1WzX16g": {
    "date": "5/26/2017",
    "text": "Before today, I could safely say I've never been yelled at by any member of a restaurant. Not anymore. This used to be my favorite local bar to visit when I'm in Charlotte (which is often). Today my mom and I stopped in to The Lodge, and I had my little puppy in my arms. Now I've had a dog for almost 2 years and I know that most restaurants don't allow dogs inside. I've also been to The Lodge with my dog many times and am fully aware that they do allow dogs on the patio. We walked in the front door and headed directly to the patio door, as I always do. The bartender Eric saw us and screamed, literally yelled at the top of his lungs, \"GET OUT OF HERE! NO DOGS ALLOWED!! CODE VIOLATION!!\" and came charging at us with his finger pointing in our faces. I asked him not to yell and he said it was loud in there, but believe me, it was not loud enough to warrant that volume and that level of anger and hostility. It was seriously scary.  The silver lining here is that we left immediately and found out that the restaurant next door, Brooklyn Pizza Parlor, has a lovely patio, wine and beer, great food, and most importantly, a very dog-friendly and human-friendly staff. They welcomed us to walk through the restaurant with my doggy to their patio. So thanks, Eric! Also, FYI, Eric is about 6' tall, white guy with a bald head in his early 40's. So if you see him, give him some hell for us. ;-)",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 9,
      "cool": 1
    },
    "photos": [],
    "user_id": "89W5rxnfokTKqoCuF4MJrA"
  },
  "ogArBsx1x6oujETkTbBAsw": {
    "date": "9/18/2017",
    "text": "The food is good.  But not really anything really special--ie. their fries are the basic frozen variety.  Most of their dishes are things you could make at home easily.  It's not cheap for what it is.  But it is good.  Here ends the positive portion of the review.  Been several times.  Service seems to be slow or barely passable no matter whether they are busy or dead.  I guess that they staff up and down to the minute based on demand so that things are equally slow no matter what.    Prices are high for what you get.  They're not high, per se.  But food is not abundantly supplied.  If you pay for a sandwich and side you will get JUST enough to satisfy an average adult appetite.  Not a man's appetite.  Or a hungry person's appetite.  You get enough food to satisfy the expectation of a reasonable (though small) portion.    The worst issue really is that of service.  If you go, do not 'over expect'.  And recognize that service is slow and really just barely meets the definition of service.  Also, don't go when you're super hungry.  Or if you do, get a snack on the way.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hHpC7jS7_eug9-gNLX3oMQ"
  },
  "7v3XiFHPhYMc4_5QV1pt5g": {
    "date": "12/10/2016",
    "text": "Beer - A Food - C-  The beer selection is fantastic, and I would come back again for a drink or 2.  However, the food is not very good.  The chicken has a weird texture and the ingredients don't seem fresh.  Also, the fries aren't cooked all the way.  I wouldn't come here for the food, but if you are looking for a good selection of beer both on draft and in the bottle, this is for you.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PLkv6g7tg8oLvI1jkD9uEg"
  },
  "VxWNT4FAVMYDJ5LQoqxb7Q": {
    "date": "3/19/2018",
    "text": "This is our go-to neighborhood 'Cheers.' The atmosphere is authentic, casual, and cozy.  The menu is varied enough to satisfy many different tastes at a reasonable price. My favorite is the 'veggie wrap' but occasionally go for the bison burger. The craft beer selection is excellent. The staff is friendly and relaxed. The overall vibe is very enjoyable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fyndTXhlRhlDPBzTFHVvwQ"
  },
  "v-GMTWHFacC6l-NiU1AfSg": {
    "date": "3/12/2015",
    "text": "Another great Yelp find...I never would have found this place on my own! Off Colony & Rea Rd, it's a little out there, but it was worth the ride. We went on a Friday and they had a wait - so don't go starving.  They have a great (local) beer selection - including my personal fave OMB. We started with the Chicken Egg Rolls, which were delish. I wasn't expecting a whole lot, but they were really fresh - ingredients-wise and made to order. For my main, I tried the Spicy Shrimp Wrap with Pineapple Salsa and Avocado....definitely wayyyy above average bar food. There were lots of good options on the menu, so I want to go back and try a couple more.   Just wish it was closer to home, but it's on the list for \"better\" bar food places!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RS5JztShXARj8kDJoDs0-g"
  },
  "3qhjQsyL9I7Aa1_s8Fs6DQ": {
    "date": "12/16/2014",
    "text": "Favorite place in Charlotte!  Good food Good service Good beer selection   My husband and I have tried most everything on the menu and it is all wonderful.  We look forward to certain  specials like fried chicken! Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "alRqBnKU_4PUTvGW34Bowg"
  },
  "-1bSe6VXnAyDLgnRdWrsyQ": {
    "date": "10/20/2014",
    "text": "This place is awesome! I can't believe how many times I've driven past it without going in. The food was AMAZING!! They also have a great local beer selection - most of the local breweries have a beer or two on tap, which is awesome!  We ordered the jalapeno poppers as our starter and they we delicious. It comes with 6 poppers, which is perfect for an app. I got the cuban sandwich with a side of mac n cheese.  The sandwich was perfect and the mac and cheese was too - can be hit or miss at some places.  My husband got the philly cheesesteak and loved it. He wasn't too impressed with the coleslaw he got on the side - I tried some and I was with him on that.  The coleslaw was pretty bland and a weird texture - not the usual shredded cabbage that coleslaw is made with, so aside from that, I would recommend anything else!  Can't wait to go back and try out more food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aa0Z8VdQmxIqBn3-WbxlXA",
        "caption": "Photo of The Lodge: A Sportsman's Grill - Charlotte, NC, United States. Jalapeño poppers are great!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aa0Z8VdQmxIqBn3-WbxlXA/o.jpg"
      },
      {
        "img_id": "w0CY9jtp3w1jXVNWS4UMHA",
        "caption": "Photo of The Lodge: A Sportsman's Grill - Charlotte, NC, United States. Best Cuban sandwich and the Mac and cheese side was awesome too !!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/w0CY9jtp3w1jXVNWS4UMHA/o.jpg"
      }
    ],
    "user_id": "K1osyO04_hXoDKyGqe_V2Q"
  },
  "AkAPickRXDRjWy6aanmiWg": {
    "date": "4/29/2017",
    "text": "The chicken wings were decent but the peel and eat shrimp appetizer was brought out hot and should have been served chilled. Service definitely left something to be desired. My husband's second beer was brought out after we were finished eating. Almost $50 for mediocre food and poor service. We won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wCZdIFKTDw0AoYe_kuIoYA"
  },
  "H3jBAM9QE1Q7dC3OcZSETg": {
    "date": "3/15/2018",
    "text": "We tried this place today and it was excellent! We had a large group order for pick-up and everything was handled without issue and the food was outstanding. Excellent service, excellent food, unbeatable value. Can't ask for more",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DKNoBMzs8piwqoRWErpiCA"
  },
  "H65l761Yq-3rlPtDTmeRzQ": {
    "date": "8/26/2017",
    "text": "Great selection (especially for a local sports bar), friendly staff, lively atmosphere. Love having the Lodge in our neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qd-c3t34yfXFF5N7tuwJJw"
  },
  "hvS30PvdHM7yJG95vF9V2Q": {
    "date": "1/25/2014",
    "text": "Grandchildren love it and so do we.  Great menu and plenty of choices.  Wait staff very accommodating and especially nice to children.  I like the burger choices:  meat, toppings and there are lotsa.  Children's menu is more than hot dogs and chicken tenders.  Outdoor patio is great and in the hot humid summers it is in the shade of other buildings in the evenings, so therefore useable.  They also have lots of beers on hand.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cyuDrrG5eEK-TZI867MUPA"
  },
  "Nu9h9pw1yQCUf9e33S-wrQ": {
    "date": "9/24/2016",
    "text": "If you're looking for some great bar food and a wide variety of craft beer, The Lodge is where it's at. It's a local neighborhood bar with a bit of an older crowd, but their burgers will dance on anyone's tastebuds. The bar area is large and first-come-first serve. It's a quick spot to sit when there's a long line with the only downside being the service gets slow. I ordered a beer burger, medium rare, that was cooked perfectly. Our waiter prided himself in not using a pad to write our orders down, and to his chagrin, he got my order wrong. Additionally, our bills were all wrong at the end of the meal, with additional charges on all three. BUT, if you can overlook that, they have some delicious food, highly recommend a burger and the sweet potato fries. You'll hear live music on Friday nights and can spice up your life with some $3 mystery beers [i.e. they randomly grab a beer from the cooler for you, and you better be happy!]. Overall, a tasty, low-key spot and one that I'd return to despite the slow service.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "7D0DvTzJVPJp-3G2j2bzCg"
  },
  "4AFNLascxHcKnNefcZ3y3Q": {
    "date": "12/27/2017",
    "text": "This restaurant will always get 5 stars from me. Came to watch the Panther game on Christmas Eve and it was packed at the bar. There were 4 of us and we were seated promptly and our drink order was taken. Since it was Sunday, mimosas were on special for $3. Holy cow I would have paid double for how good they were. Jessica was our server and she was so busy but she always knew when to come by our table. We ordered the jalapeno poppers for an appetizer and they were served hot and served quickly. For lunch we ordered 2 dozen wings, they were so good. Crispy and seasoned just right. We ended up ordering more drinks and watched the rest of the game. The atmosphere is perfect for Charlotte sports. We enjoyed ourselves especially since all of the servers came by our table at some point to make sure we had everything we needed. The prices aren't outrageous and the portions are huge. Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WMOCO_KehBziMHPm1hdbGQ"
  },
  "7f0Z9Mhm4dZxn4NoiKKIrA": {
    "date": "3/25/2017",
    "text": "Won't be back. Came in around 9 on a Saturday night and the place was dead, should of been our sign. Ordered a veggie burger among other things. The veggie burger was the worst thing I have ever received at a restaurant, it was as if they blended veggies in a food processor, put it on a flat grill like a pancake and served it as a veggie burger. The consistency was runnier than a traditional pancake and can't believe it was allowed to be sent out of the kitchen, it didn't even remotely resemble a patty. Everyone else's food was below average and we all agreed we will not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wlTd-6M1pkO7zs5CgopQOQ"
  },
  "xjpFOIDXSOrl5ti6bVy9Pw": {
    "date": "4/12/2017",
    "text": "Food is amazing !!!!!!!!! Service was good. The brownie cheesecake was to die for! The nachos were very good, and I love that the restaurant is very kids friendly",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ranR2YN202ADASQT5ihpkw"
  },
  "ftVY9mJgbP53X_b0lbRA8w": {
    "date": "12/11/2017",
    "text": "The food is just so-so.  I have received salads and a horrible crab cake on various visits. The service is usually subpar.  The service on my last visit was nonexistent.  We literally had to flag someone down to order and to receive our bill.  They were not busy just preoccupied with friends visiting the restaurant.  Despite the horrible service I gave a 21% tip.  Image my outrage when I received my bank statement and saw that it had been changed to a 36% tip.  I immediately contacted my bank.  I will never return nor will anyone who was with me that day.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s3ACpwbvXyC2-ksFnbgDsQ"
  },
  "_-0ZaUSuE5LR2_YU3c945Q": {
    "date": "3/16/2014",
    "text": "Went here on a weeknight at 6:30PM for dinner. A good crowd but tables were available. There is a bar area and there is also outside seating. Waitstaff was friendly and did a good job. Menu has standard tavern fare: burgers, sandwiches, salads. Quality seems pretty good. The atmosphere is nice, too; sporty with lots of memorabilia adorning the walls and customer-written graffiti on the walls and chalkboards but not in a chain-restaurant-flair sort of way. I had a buffalo chicken wrap, which was good. Unfortunately, the side item that was included with my meal cost me an extra $1.75 because it was the fruit cup instead of other sides such asfries, tater tots,",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WM2fAgIlZJ6AviCrH5iMow"
  },
  "RdZfvIdjzo0vLhOKnklhKQ": {
    "date": "3/10/2019",
    "text": "Food is fresh! Most of their menu is made in house and the quality seems really good. We were so happy to find this neighborhood restaurant- we've ordered takeout and dined in. It's a sports bar/cafe type so don't expect a fancy interior. The spinach dip, French dip with provolone, guacamole and fries are bomb!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "98RwrN9n4Ew2Ju6IhRgUTQ"
  },
  "r67-MsfniOBp9y5B8RUoWQ": {
    "date": "6/14/2019",
    "text": "Been coming to the lodge for years now we live close to the shopping center. The past few times I've been here haven't been great. Food has been cold and lack of service has been happening. Use to be a great spot to hang out and eat. Not so much anymore :(",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yPAJRi_mECx0YMvAmA4x1A"
  },
  "x1s0CY8unjQybxeCdM4abA": {
    "date": "3/15/2018",
    "text": "I've been in here twice now, always on trivia night. The guy hosting trivia is amazing and that's actually the main reason we came back. On the first visit my girlfriend got the blackened salmon wrap. She didn't care for it but I loved it. Just thinking about it actually makes my mouth water. On our second visit we got salads which were okay. I generally give the place good marks for the food and the trivia. The beer selection is also great. You'll certainly find something to drink, even quite unique things like Delirium.  Where I felt they lacked the most was in the service. On both visits the bartenders and waiter were virtually non-existent. In particular when waiting for the check. We intended to ask for the check as soon as we finished eating and well before the end of trivia in order to be ready to leave when trivia was done and miss the rush. However from the moment we got our food we could never get ahold of a server again. Not sure what it was, work ethic or just being understaffed. Maybe they'd be better on other nights, though they were never crowded. The prices aren't the greatest either when compared to the service and quality of food. It's pricey and I think that's just taking advantage of the neighborhood. The crowd is older and you see a lot of \"old regulars\" in here too.  Still the trivia is great and the host is a super nice guy. I would recommend getting in here for trivia at least once. But we don't plan to go back again because of the service and the high prices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VGREdUwPvkZ2uYF5_b1JyQ",
        "caption": "Photo of The Lodge: A Sportsman's Grill - Charlotte, NC, United States. Blackened salmon wrap",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VGREdUwPvkZ2uYF5_b1JyQ/o.jpg"
      },
      {
        "img_id": "zbzRYbzriHBfwBNA_oQvSA",
        "caption": "Photo of The Lodge: A Sportsman's Grill - Charlotte, NC, United States. Side salad (house?)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zbzRYbzriHBfwBNA_oQvSA/o.jpg"
      },
      {
        "img_id": "4ATkgwn6uTSBBNCj9aEWOA",
        "caption": "Photo of The Lodge: A Sportsman's Grill - Charlotte, NC, United States. Funny stuff!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4ATkgwn6uTSBBNCj9aEWOA/o.jpg"
      }
    ],
    "user_id": "qjYXOBnladFYhciGBSgAMw"
  },
  "x7lbSn2wBQaFeot9hq9s8w": {
    "date": "7/10/2019",
    "text": "By far my favorite local bar!!   Fills a huge void of no bars between SouthPark and stone crest.   Staff treats you like family.  Fresh beer and upscale bar food.  It has a Cheers feel in a modern sense.  Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2DSWcI8XCngtf0dFG7HCQ"
  },
  "r0T247QoM4GRvH8DzMfrGQ": {
    "date": "7/7/2019",
    "text": "Do NOT order takeout if you plan ordering the grilled chicken.  The amount of salt and pepper in the poor entree is \"industrial\" if not ridiculous -- for the third consecutive time my kids cannot eat that entree.  I tried it and could not believe it - it was impossible to eat.  Someone needs to tell that Chef to either slow down or take it easy on the seasoning.  The rest of the team should also read TakeOut notes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5nDfzd7Z1vIZTGVnSZ91bw"
  },
  "Y2ZEVu_Oso30kx8OIuJviw": {
    "date": "6/26/2019",
    "text": "Laid back and awesome food. Plenty of choices for picky eaters. Steps above traditional bar food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5pzvSQzctdfIPJ5098sLA"
  },
  "Xx4OnaZUsvuS6CnFHluTVQ": {
    "date": "10/29/2018",
    "text": "Wow, Sorry to have to come down on this establishment but it was a total mistake on how my party was treated there on Sat Night. We arrived at 6 PM Party of 6 adults and three Babies...We were told that it would be a 20 to 30 minute wait but they assured us that they could get us all at ONE table. We were all standing at the front of the restaurant I myself had just had a Total Hip Replacement 3 weeks before. The 20 minutes turned into 1 HOUR and 20 MINUTES. We checked with the hostess over and over. She then informed us that we would be sitting at TWO SEPARATE tables!! Which Obviously we could have done 1 HOUR and TWENTY MINUTES previous!! As we sat down, breaking up our party there was a four top that they sat two People at, right next to one of our tables. We asked the hostess if she could move the people to the other table so at least we could be closer since we had waited so long. She said she was not allowed to do that since the other table was a five top!. Now I have worked in a restaurant and I understand Seating, but this was a special situation, it was a celebration and we had been very patient for ONE HOUR and 20 MINUTES. My daughter asked if she could speak to the manager. He ( a young man in a baseball hat) approached us, did not introduce himself and asked what was the matter. We explained at least three times to him the facts about our long wait and that the two top that was sat right next to us was willing to move to the bigger table, so that WE WHO HAD WAITED SO LONG could be accommodated. He did not understand. He kept saying, no he would lose money that way. I said You will be getting the same amount if we stayed at the same tables or switched?? He did not listen and he made no restitution such as buying us a appetizer or dessert or even an APOLOGY! Just Stupid Management who did not teach the hostesses about seating nor the Manager about the CUSTOMER SERVICE. We stayed and ate..No celebration.We will not be returning now. and I warn you, if you have a big party and you want to sit together, GO TO A DIFFERENT RESTAURANT!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "YFHrehv9nlluLMmn7eUUqw"
  },
  "sIdY9izZ3OeQb-UeUTwcLQ": {
    "date": "1/28/2019",
    "text": "The GM acted way out of line, was rude and made a big scene by picking a fight with patrons in front of others. Totally unprofessional. Won't be going back.  Shame.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5AEVbzwfcqrF07lsIbYCXw"
  },
  "VBZau1OtSwcUnK5Pusn3NQ": {
    "date": "11/16/2018",
    "text": "Good food and great atmosphere. Whatever you order make sure to get the garlic fries as a side!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B6w97BuL8VPzth2-TRPkKw"
  },
  "4rHPAzyxnY0tHy0UGabm-w": {
    "date": "3/26/2018",
    "text": "A great place to grab a beer and some food. It has a pub like atmosphere and it's cozy inside. They have a decent draft beer selection and a full bar. The food is better than most bars. The spinach artichoke dip is some of the best I've ever eaten. The wings are very good! If you asked for the extra spicy wings they use a homemade sauce that is to die for! It's very spicy so be careful, however! The southern eggrolls are really interesting as they use collard greens. All of the food that I've ever eaten at The Lodge has been great!  They have plenty of TVs for watching sporting events. All in all this is a great place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_CQetImJGo97dAIM0fjsSA"
  },
  "nArgTt1zHFfGiZlIA-F3Lg": {
    "date": "8/13/2018",
    "text": "I'm officially done with the Lodge. We have had 5 consecutive meals that were subpar. Our server, a male named Kelly, had 3 tables",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xem1acDVR5U51VyMKPvcEw"
  },
  "fZFdGv-2mBEmiPVhQcFJSw": {
    "date": "10/6/2018",
    "text": "I love the Lodge. Today's a great day. Staff is very friendly and right on the mark. Not sure of the barkeeps names, so I'll just call them Magnum PI, Goldie Locks, and crew cut. Great family and neighborly bar. I will be back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gqaYpPt5pwKOP4xQ22rnfg"
  },
  "syTsfQM_Flj8C_OOHIBEtQ": {
    "date": "10/27/2018",
    "text": "Absoltuly the worst dining experience!! We had a party of 6 adults and 3 children in high chairs. We were told it would be a 20 - 30 minute wait. We waited an hour and 20 minutes, and were then told we would have to sit separate. REALLY? They should have let us know that before waited an hour and 20 minutes. At this point we had no choice as everyone was hungry. They then separated us to 2 tables that were not remotely close together. We noticed an extra table right next to us, and right as we went to tell them, they sat a party of 2 at a 4 person right next to one of our tables- which they should have put us at from the get go and pushed them together. When I asked to speak to the manager to kindly ask if he could move us to that table so we could sit together, he was not the LEAST BIT helpful. He was a young dark haired guy in a baseball hat. He was a complete jerk about it, not understanding or nice, and not what a manager should be.  And to top it off, we decided to stay and eat since our kids were starving- and 2 of our orders came out wrong- one was the special written on the front of the board and was missing all the components listed for it! Absolutely terrible. Do yourself a favor and DONT COME HERE, especially if you have hungry kids. Very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ut4D6Kicbpzw5RtJxQMB5w"
  },
  "tiOQR_Y8aq-MKyoUwI0pvQ": {
    "date": "2/26/2017",
    "text": "Being my first time in this shopping center, it was a little hard to find - but we figured it out...  Came by for late night drinks after dinner with a friend of the bartender. Heavy pours are never bad for a paying customer, right?!  Busy place even late at night and it was a good environment topped off by good live music!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M3ncFIlEfaSdSpoiMINwBA"
  },
  "pL2lUY-3p1ih_RZQ0wbWpQ": {
    "date": "12/24/2017",
    "text": "My friend and I ordered the Award Winning Pimento Grilled Cheese Sandwich and the Buffalo Wrap, then we switched half a wrap for half a grilled cheese.  Long story short, I had both and they were extremely good.  Would definitely recommend both.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ETfq6fiI88P8aiZDZano4g",
        "caption": "Photo of The Lodge: A Sportsman's Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ETfq6fiI88P8aiZDZano4g/o.jpg"
      }
    ],
    "user_id": "wnJtKBTtmRh8mkTZF_UM_A"
  },
  "_9hTkEIn0aQgFvVuMwu77Q": {
    "date": "8/31/2018",
    "text": "We showed up on a Friday at 6:30 with a family of three. After a 5 minute wait for the hostess we asked to sit outside.  The hostess told us that they were not seating anyone outside due to the POSSIBILITY of rain. The sky was blue...  Even though there were 2 tables already seated outside which there was no explanation. We were asked if we would like to wait on a table inside. We said no we would rather go anywhere else at this point.  So we drove one mile down the road and had a great dinner on a patio outside under the blue sky. It was August 31st at 6:30.  We have always enjoyed the lodge but will never go back.  Sorry for the rain that never happened",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ZRJv8ht6gD0lZnoW1JBCg"
  },
  "8vybSBqE0AbyYQJAAElamw": {
    "date": "7/6/2015",
    "text": "We've seen \"The Lodge - A Sportman's Grill\" several times when we've been in the Harris Teeter shopping plaza at the corner of Rea and Colony, but we've never gone because it sounded too woodsy and bar-like.  I was searching for Yelp on someplace new for us to go and saw that The Lodge had good reviews, the photos of the inside looked nice, and the menu looked good, too, so we decided to give it a try.  We've now visited The Lodge for dinner twice in two weeks.    The atmosphere is casual, lively, and fun, the prices are great, and there are a variety of menu options, including daily blue plate specials for around $11.  There are a variety of sandwich options, too, and even a good selection of entree salads.  The restaurant has both indoor and outdoor seating, but there can be a wait on busy weekend nights because it's not a huge restaurant.  There's a good-sized bar area, too.    Our first visit, I built my own bison burger with toppings and had the yummy garlic tots as my side.  We also split the RoRo's Wing Dip as an appetizer.  If you love chicken wings and cheese but never made this at home, try it here and you'll be hooked.  It was a little spicy for the others at the table, but perfect for me.    On our second visit, I was in the mood for a BIG salad (a la Seinfeld), and The Lodge delivered with the Cobb Salad, one of many salad options.  Their salads are BIG and a full meal in themselves.    One of the kids ordered the Baby Back Ribs Blue Plate Special.  It was a FULL rack of ribs.  HUGE.  He's got a big appetite and it was very satisfying.  Some Friday, we'll come back and try the Fish Fry, a Northern favorite. :)  We'll definitely be back to The Lodge again and again for high quality, reasonably priced meals and drinks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EsyWQtz3kdLJ9h2yEK_ebg",
        "caption": "Photo of The Lodge: A Sportsman's Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EsyWQtz3kdLJ9h2yEK_ebg/o.jpg"
      },
      {
        "img_id": "RDd5v-pv2FPGygXmIza8rQ",
        "caption": "Photo of The Lodge: A Sportsman's Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RDd5v-pv2FPGygXmIza8rQ/o.jpg"
      },
      {
        "img_id": "o1s5zgTtMbXU6CfesHHh_g",
        "caption": "Photo of The Lodge: A Sportsman's Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o1s5zgTtMbXU6CfesHHh_g/o.jpg"
      }
    ],
    "user_id": "_uqIpl5tzucKuIlZZPBZRw"
  },
  "r9SitiwF6uIKSGijwXsfXA": {
    "date": "9/13/2018",
    "text": "My only complaint is the inconsistency of the sides. Sometimes the collard greens taste like pure vinegar, other times they're too salty, sometimes the broccoli is fresh and beautiful other times it's a weird light yellow instead of a bright green when it comes out. Leave the salt for the customers and try to be more consistent, please. On the flipside, their salads are fresh and plentiful, and rib night is out of this world.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "w7HZUOO-sQsQm1HJ9vNtrQ"
  },
  "OlIfcBSKshlyqyUhKyLVDA": {
    "date": "3/10/2018",
    "text": "Really great place for a sports bar type of deal ordered the banana bread beer really delicious and when I had it a long time ago thought it was disgusting I ordered a build your own Burger with bison jalapenos onion rings and bacon with mozzarella cheese it was really delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zDPakjcGdDtaEalgmJyWuw"
  },
  "AldCilsAKryvAGE-OXiu5A": {
    "date": "11/22/2017",
    "text": "HORRIBLE place to go. I went here for a friends memorial after he passed a year ago because this was one of his favorite places. We had a big group and naturally moved some tables together. Before we could do this, Melissa, a bar tender, came running over so aggressively saying MOVE THESE BACK you can't do this. There was way more to what she said...I said there's no need to be rude and we will move them back and apologized. She then decided to refuse service to myself and friends. Eric, the manager was just as bad when I called complaining at the utter nerve and disrespect. I will NEVER come back to this place ever again. These people do not think the customer is right and are so disrespectful. Please do not waste your money here. Disgusting humans and I'm so ashamed my friends and I came to that place to remember a dear friend of ours.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "WeMb7lYuGoIt77MwA4B3dw"
  },
  "fA5mALGXXzt9f8vJuNqSMA": {
    "date": "3/26/2014",
    "text": "I won't ever return. They obviously don't care about anyone except the bottom line. They have a little corner bar thing but why bother",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzDyYgv5bZB70szQMliHIA"
  },
  "gBuYUb81rlug8N1EN-fsSw": {
    "date": "5/18/2011",
    "text": "Went for lunch last Saturday.  Had a build your own burger and garlic tots.  I like spicy, so I ordered my burger with pepper jack cheese, japalenos, onion rings, bacon and the \"Lodge\" sauce.  The burger was absolutely delicious.  They could have put more \"Lodge\" sauce on, but overall, the burger was great.  The garlic tots were wonderful.  They were very cripsy and not too greasy.  I couldnt eat all my food, so I took half home and heated it up for lunch on Sunday.  Everything even heated up well. We go to lunch every Saturday, normally we kinda rotate between the same places we have been eating at for years. We will definitely be adding The Lodge to our list of places.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BmM8SPRfYxTlcURnztQn2A"
  }
}