{
  "d2dlpySt6sE09Tx-RTrnvw": {
    "date": "3/24/2016",
    "text": "Came here lit af just wanted some pancakes. Open 24 hours from Friday to Sunday it's 1:37 am Friday explain this to me. Free gucci",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "veQy7isiOJWUYrmTeCHkbg"
  },
  "4souluzt8GF0tf4pZK3MBw": {
    "date": "7/27/2014",
    "text": "Food was very salty. I think I'm bout to have a heart attack. God took too long to come out and half our order was forgotten. Anyhoo I was so hungry I ignored the salty food and scarfed it down. There seasonal fruit contained 3 canned pineapples and 2 canned grapes.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "36V5ou8KWqGEHn2vIHOY0g"
  },
  "b2X2-mxjT37pc0DnedZtMQ": {
    "date": "1/2/2012",
    "text": "My son and I love going to IHOP for breakfast. Well this was our first attempt at this location and it was below expectations. The restaurant had about 10 tables empty and we still had to wait 20 mins to be seated. My guess is they were understaffed.   Once we did get seated, service was slow and really bad. I had to ask 4 times for silverware, 3 times for a straw for my sons cup, and the food just wasn't that good. My plate was dirty. My son asked for strawberries on his pancakes and they had blueberry syrup on them - I wonder who's plate they scraped them off of.   Oh and the straw came as we were paying. Not our best IHOP experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oIudWLcr4c7syOOg7bP6nA"
  },
  "RIIeoEnphmW3XnUwtqAcXQ": {
    "date": "11/21/2013",
    "text": "Go there every other Thursday for my life group bible study and they are excellent with their customer service and the food is great and they know what I want when I get there and keeps sweet tea on my table. They like us being there b/c of what we do and stand for.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OqXlL9J2cNjY5e-6t3ZPhw"
  },
  "26K5Qqt2a4yJIffblNh_Ww": {
    "date": "8/22/2013",
    "text": "As far as IHops go, 5 stars. Super friendly service, Kay was awesome. Carolyn at check out was great too. Got my free birthday meal and just substituted it for something of equal value. Delicious breakfast and really quick.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "x6BbbotUNpCEe5pWfAoBnw"
  },
  "lqZhb41GAn9-gV21jscdWw": {
    "date": "12/30/2012",
    "text": "For an IHOP, the Pineville location is as good as it gets!  What do I mean \"for an IHOP\"?  It's a fast food franchise, whose claim to fame are their fast, and (fairly) inexpensive, breakfasts.  Frame your expectations accordingly, and you won't be disappointed.  We're especially fond of the night crew: (Spring, Tracy, and Tiffany); each are not only friendly and efficient, but they're funny as hell.  For as much as I might enter this location with a frown, I walk out with a smile each time, and it isn't the pancakes. It isn't that they're bad...it's just that they're standard IHOP fare.  The dining area is consistently clean; servers are great, the pancakes are pretty good, and fairly inexpensive.  This is a place for breakfast, but not much else.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "LY2Cy810NYR8xui2Esf2MA"
  },
  "d8JagXIbpIeYPKDqYpo6Mw": {
    "date": "8/12/2015",
    "text": "We always go here when we are in the mood for breakfast! The food is great and great priced. I've worked in the service industry for years and trust me. These people work hard, they just deal with a lot of shit! A lot of people running them to death and not wanting to tip. And trust me we know right away when your gonna tip or not. You go out you tip! Period! Anyways our most recent visit we had An amazing server.. I believe her name was Kay. I'll correct it if that's wrong... But she's the older Asian lady and she is beautifully sweet! She did a great job and made us all very comfortable. The manager and the hostess also checked on us and we loved it! She got a 30$ tip for being a good server! People start tipping your servers! We heard that day someone tipped a young girl a dollar?! A dollar?!!!! Stay at home trash! Trust me it's better if we get stiffed! But don't go out and have these people work hard and then complain because you want something for free! Pay for what you eat!!!!!!! You don't deserve anything!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ifrU_hUht7YIkf5j6ASJ0Q"
  },
  "-c8vm_BfZUfGGJubX5jHWQ": {
    "date": "11/5/2012",
    "text": "The service was very friendly, but the food wasn't all that good. Most everything tasted like it had been sitting around for quite a while before being plated. Especially the potatoes. Not sure I would return.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MeJI77jgRpYkAdOH5kbNLg"
  },
  "tGKCepEMJolEH1A-WQ2mPw": {
    "date": "7/6/2012",
    "text": "Josh is awesome!! Great server. Get the ayce pancakes. Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lUrwskmq44ZBKtz3bBQo9w"
  },
  "c8IsKdpe5xmW7hCacpn7iw": {
    "date": "8/9/2010",
    "text": "The pancakes were good as one would expect.  Eggs were icky and the hashbrowns were cold and chewy. Service was quick and polite. Restrooms were kind of bad though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZA2nXlv4NTXdpLXJ-0H8BA"
  },
  "nyfdpoTVYN9e2WDObzr5wA": {
    "date": "12/26/2016",
    "text": "Very poor experience. They were out of soup, tomatos, provolone cheese and was told they didn't have egg whites. I told the waitress that if they had eggs they could make egg whites  she just said they were really busy. We had to ask several times for drinks , ketchup and jelly. When we tried to pay no one was up front to help us or check anyone in. I went to find someone to tell them several people were waiting to be checked out. We will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qg_Ls59ZmjG-C0WGTUnmUg"
  },
  "-JKEeCOMzlpy7arjOUC1Ng": {
    "date": "11/11/2017",
    "text": "Poor customer service !!! The waiters take 20 minutes to bring the food for one person",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZDG16OklLXmy3apgnfkMAg"
  },
  "dOKkn5aXaQdbdkrmgpMgKw": {
    "date": "11/13/2016",
    "text": "I love ihop it is a great place to eat but this was the worst ihop experience I have ever had the sever didn't know what was going on and my pancakes were over done not impressed",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "82gtM8iTayQ0lJ8Sr0YhSQ"
  },
  "nBVe9e46x7uIeqdpwxzrfQ": {
    "date": "11/10/2016",
    "text": "I believe the manager Angel is absolutely miserable with her job.,She was so rude when answering the phone, then nasty when watching her interact with fellow guests.She Never smiled one time, she then made me feel as if I was a bother to her, The staff appears that they all hate thier job as well??? I think its affecting the culture of the restaurant. This is not a good look from the public perspective...  1.Greet your customers, <a href=\"/redir?url=http%3A%2F%2F2.be&s=714bf116a538ea0ebf30932518d2767497b70aa08e5faa5bd179ec790fd47ae4\" target=\"_blank\" rel=\"nofollow\">2.be</a> genuine ,  3.don't shrug your shoulders,and huff and puff when someone asks you a question. She Never even made eye contact ,I would like to think she had a rough day but this is much deeper.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pfQgyUFFKpbI-wPPvxb7hg"
  },
  "3QNgq0kg3gIhjbLS85rDaQ": {
    "date": "10/31/2016",
    "text": "Never seen a lazier manager! The poor wait staff was running all over trying to keep up & the manager kept disappearing to the office. Our server was cashier, hostess, to-go order taker, AND server! This place needs a total rehaul of staff! Definitely won't be back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8vh1l2tTxytyhGcSz9QZA"
  },
  "5yINtvuJd3EAbP8GLN_RxQ": {
    "date": "5/25/2016",
    "text": "What can I say we were one of 4 families in there around 12 in the afternoon not busy at all and the service was slow it was unacceptable! Never did I wait at an I-hop for my food for almost 30 minutes I wanted to walk out I was so frustrated and when we got our food the portions well I don't know what's going on but they were small leaving u hungry after u just ate! I will stick with Waffle House!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kacPIgDNzLcOSs-ok3bSEA"
  },
  "V-Wynb-0o5npHMeL09PUTA": {
    "date": "6/2/2016",
    "text": "I've been going here for the last ten ish years and I've only had one decent experience here. I would not suggest this location but to drive a little extra to another location. The service is horrible, the severs are rude and the food is only mediocre. The place smells of old towels and the bathrooms are horrible. If I had a choice, I wouldn't go back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DdzwXiqK62MUMGSlHjCSBg"
  },
  "MQ6FMyqnHtOUbkyGn8VJiw": {
    "date": "1/24/2016",
    "text": "Just love it here and especially when Kay is our server! She has to be one of my favorite servers of all time! She is so attentive and friendly  Definitely worth taking a trip and ask for Kay! She will take care of you, and always do it with a smile!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cp-knvvckUKSML2qYKMmrw"
  },
  "QWGRga1ml9ndkavMhUWxqQ": {
    "date": "9/17/2016",
    "text": "That man that was working today, cooking, needs Manager Training. As a professional and a manager myself I would never yell or degrade my staff and fellow workers as he did the entire time we ate breakfast. All of the staff seemed to be beat down but still came to the tables with a smile. I was shocked at how his behavior was tolerated. It was completely unprofessional! The woman manager gave us a discount but we didn't want a free meal we gave it as a tip instead, a well deserved tip!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VbKkD9JVc3-praem_CAo9w"
  },
  "rIWwPbpkBRLgJyexNZbDuQ": {
    "date": "9/3/2017",
    "text": "I don't eat at IHOP often, I usually prefer to make breakfast at home. But once in a while it is fun to eat out. We had a horrible breakfast at this location. My husband ordered coffee and the cup was dirty with women's lipstick. They got him a new one, but very gross!  The service was not very good. They got my husband's order right. At first they brought me the wrong pancakes. Then once I got the correct meal, I never got the butter I asked for. I ordered the peach pancakes with sausage, hash browns and scrambled egg whites. There were hardly any egg whites, not worth 50 cent upgrade.  The hash browns were under cooked. All in all it was a very disappointing experience and certainly not worth the money! There are better breakfast options out there!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vUw1ULk1qgHuKf_j43E59Q"
  },
  "fgqVmFKeycPWipiLZ0mbOw": {
    "date": "2/20/2017",
    "text": "don't get the country omelette. or any omelette with hash browns in it for that matter.  they use it as filler so the omelette has hardly any actual egg or substance at all. i was so pissed bc i love cheese and ham and bacon but it had none it was all hash browns???? just don't get it unless you're not hungry and love potatoe",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vCB_CquK8QS_jfyTAa7S-w"
  },
  "5PRhcKQ5Fj8tbflQD-MneA": {
    "date": "8/7/2016",
    "text": "Bad and slow service, long wait while tables were empty, dirty dishes, dirty table, cold coffee. Never come back here",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m0EHFWpUZ8AWSf1SIgu7Yw"
  },
  "XM2GEyUtHmqCLC6fE3462g": {
    "date": "6/18/2017",
    "text": "I recently visited Ihop this Saturday and I received the worst service ever. My waiter which he never introduced himself wasn't presentable his nails were dirty underneath and long and not clean. He gave me my food with his fingernails touching my omelette which were extremely spongy by the way. It wasn't clean in the store and no one was friendly this is a reason as to why I don't tip certain people. I will never visit this location ever again I hope I can't get my cash back for horrible food and service but that's not gonna happen.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pcotDrPrCopAOw0jnQnYiA"
  },
  "pEeLOiG2sjBK0X5DBSlkmw": {
    "date": "12/30/2016",
    "text": "Several visits have been horrible. Don't ever come here unless I have to. Last time we walked out after 40 min waiting on breakfast food and a horrendous waitress that never checked on us. HOWEVER it's next door to my mechanic and sometimes we just come over when waiting on the car. The ONLY SAVING GRACE IN THIS PLACE IS SEAN. BEST WAITER. GREAT ATTITUDE AND VERY ATTENTIVE.  if I ever come here I will only ask for him. He deserves better than to work in this location. Great job Sean. Thanks for being a great server.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ud8D7Vfx5D4zS0H1SUq94w"
  },
  "wvBNcdiEqymah-SuEzek7w": {
    "date": "11/21/2010",
    "text": "IHOP is IHOP... it's great for it's consistency wherever you go.  Usually when I hit up IHOP it's on the weekends and you end up fighting the crowds, but if you time it just right... your IHOP experience can be a good one.  This experience recently on a Saturday happened to be after a 4 mile run so we were super super hungry.  I was pleasantly surprised since they offer some new healthy options.  I had the wheat french toast combo with turkey bacon and scrambled egg beater eggs.  Not too bad for 490 calories.  Good way to start the day.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "yCBCmIpQJFmQEP4M7A7WOA": {
    "date": "1/21/2013",
    "text": "Okay, I know this is just an IHOP, so I shouldn't expect culinary excellence.    But.  We've been to this location a couple times.  They do breakfast VERY well.  Their coffee is always fresh and hot.  Their pancakes are always fresh and hot.  Their orange juice is never too tart, never too sweet.  I've never found foreign items in my food.  Wait staff is always courteous and helpful.  But.  Beware - when you order NON-breakfast items, you may not end up with a satisfying meal.  This past weekend I took my daughter and my grandmother to the IHOP for a quick & cheap post-church lunch.  My grandmother ordered coffee and a belgian waffle - she said it was very delicious.  My daughter got the baby cakes kids meal, and she ate most of it.  I made the mistake of ordering the chicken fried steak with mashed potatoes and corn on the side.  The chicken fried steak was so tough as to be inedible (I took a couple bites and left the rest).  The mashed potatoes had clearly been in that serving bowl since the morning.  I took one bite and when I realized I was eating aged potatoes, I left the rest.  The corn was the best thing on the plate.  Needless to say when we got home I made myself a sandwich since I didn't really get lunch at the IHOP. *lol*  As I said, we've been to this location before, and they definitely do breakfast right (which makes sense given what an IHOP is).  My daughter and grandmother were very satisfied with their meals.  But stick with the breakfast menu.  Don't venture anywhere near the non-breakfast menu.  Then you should be fine.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3D-wBBkOEQGvIIvftICkQ"
  },
  "4l0M3leod6oig6yUBS-BXg": {
    "date": "3/30/2015",
    "text": "First ever I Hop i have ever been to. Love the breakfast, steak and eggs seems a bit heavy for the morning, but I'm game. I hop in Quebec please",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qZfMILmXeiTGiZQXJ15iBw"
  },
  "YgLFc12uyO37TBZFqRGghQ": {
    "date": "12/14/2015",
    "text": "Got coffee. Took 10 minutes to get cream. Got cream but had nothing to stir my coffee with. The people in the kitchen are dropping the F bomb every 30 seconds so don't bring your kids here. Waited an hour for cold food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XlG-PCaLNvTVfN5SNIJ5DA"
  },
  "r04LyvmXohJZ-f4BvbI2Aw": {
    "date": "7/26/2015",
    "text": "Terrible service and terrible food! I asked this girl twice for sausage gravy and the first time she came back with the wrong one, the second time she brought back chicken broth! Food was bland and tasteless and she never bothered to fill our drinks. Never coming back again, it was such a waste of money!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MzP4LEGfw3DKFVhB5l6JAA"
  },
  "UIvBOEYTfPWk3hInEEL_Yw": {
    "date": "9/12/2015",
    "text": "I would not go back here, unless I wanted to take up waiting as a occupation.   It took 20 minutes for a waiter to come by and take our drink order and then another 15 minutes for a second waiter to come by and ask to take our food order who then promised to expedite the order due to the wait but blamed the kitchen for being slow.  At this point I was very frustrated but want to hang on for the kids.    Once we finished ordering, my 5 year old needed to use the restroom and wanted an escort over.  I could not help but notice that several people who had been seated right before us and others who were waiting to be seated after us had already been served their food and were half done with their meals.  Slow kitchen right.  This did not improve my opinion of the restaurant nor did the drama at the table across from us. Apparently our waiter has messed up the order and served the wrong food to the table and was having to run additional food over.  Based on that squabble and another 15 minutes of waiting I decided to leave.  I could not face waiting longer and having the food order wrong and \"cold\" as the lady at the table across us was loudly declaring.  In summary the service is very questionable.  You either get lucky and get your food quickly or you get stuck in limbo with no recourse.  My seven year old did not like leaving but told me in the car that we should never go back to the Pineville IHOP again \"As they broke a promise to get our food.\"  I couldn't agree more.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZApljTwGoAviCH2KFLXIVA"
  },
  "u852lWgpyYy0_I8IGSONaQ": {
    "date": "11/25/2018",
    "text": "I went to this location last Thursday week and was very unpleased at the service and food. I ordered a basic BLT. When my food arrives my sandwich wasn't what i expected, the bread was soggy, it was bacon bits,the tomato was bad and the lettuce was wilted. Will not go here again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "onm2j0ySXfWuVGsAswm1RA"
  },
  "6k6UPVyGUB-sg-nTKw0ALw": {
    "date": "5/6/2017",
    "text": "Finally had a time to catch up with bestie after we picked out my bridesmaid dress. So we picked this IHOP on a Sunday to brunch.. Greeted and seated right away at about 1:30pm. It was fairly busy. But understandable because of a Sunday! After 20mins. We finally get to place our order. Then here come the problem. People started clearing out. 10mins pass. 20mins finally 45mins passed. We asked our waitress. She said they're backed up so it will be a bit. After an hour of waiting for our orders, the manager came by to check up on us. And apologize. We asked how much longer. That's when she cut us off got short. Said some cooks walk out and the ones working is in training. So she can't help us. Her tone and how she reply with the attitude jus lead to me either 1) just quietly leave or 2) disrespect her. Bestie picked option 1. I left our waitress some tips and walk out hangry!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jcURiDqCLY7AOqo8KClJnQ"
  },
  "wH4GN-O4QTV_VcGK1g6hSA": {
    "date": "5/24/2017",
    "text": "Just no!!! We've been here several time and more often than not, we've had complaints. The food is just ok.... Problem is they sometimes clean with nasty dark water while people are eating!! Food comes out cold, orders are messed up and they usually don't have enough people working so the wait is long even though the food sometimes comes out cold....",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Josf9U3wagozATXsz4lfQQ"
  },
  "UnhTXMitol1OJ6-J0x4osQ": {
    "date": "6/25/2017",
    "text": "This location is a mess they have full empty tables and outside are many people waiting to be seat. I talk to the person in charge and she say to need to catch up with the kitchen. To me look like no enough employees to take care of costumers. We finally got a set but still waiting for food already pass 20 minutes.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VLwFu9cI1NW7lr-wo1GnCw"
  },
  "CiksM20JZm-Wckprcjzk2g": {
    "date": "11/4/2014",
    "text": "Good clean restaurant - manager is hands on and aware of customers and kitchen staff. I sat near kitchen so it was loud - my order was steak and eggs with steak medium - came to me with well done steak - manager immediately fixed it -  For lower than expected expectation the experience didn't disappoint -  If your hungry for breakfast food it is a good place to go .  The waitress was not much help and really apparently non existent . The check was left on my table way too early and so was she ...  Don't go in with too high expectations and you'll do fine ...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A4JIcSwptVfznmDmrxMJKg",
        "caption": "Photo of IHOP - Pineville, NC, United States. Steak &amp;amp; eggs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A4JIcSwptVfznmDmrxMJKg/o.jpg"
      },
      {
        "img_id": "yKg6EaW4Y0JaSgwZM1opJg",
        "caption": "Photo of IHOP - Pineville, NC, United States. Ordered steak &amp;amp; eggs - steak was well done - I ordered medium - manager came by and re- cooked entire order !",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yKg6EaW4Y0JaSgwZM1opJg/o.jpg"
      }
    ],
    "user_id": "DYFXCoWpMAkTey_kCQZUYg"
  },
  "Oh0ZBQTetSck2QIncGGWIA": {
    "date": "1/27/2018",
    "text": "Food is always good, but the service and the cleanliness is always lacking. There is usually a 4'11\" Hispanic receptionist there who may have the worst attitude in the history of food services. My wife and I always wager that she will exceed her previous horrible performance. She's undefeated",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3y_Op5BgB7o3k6-ULqIuyQ"
  },
  "ee1kcnghMwOCkJ5C-02LLw": {
    "date": "1/27/2019",
    "text": "the wait is so long thanks guys for telling me and something else the person at the thing didn't put our name up until now now this is the worst reviewed ihop in this town",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PU5A4sROvoF3SXOz5XJgjw"
  },
  "V6Z-HJo01S-RurrZeM973g": {
    "date": "3/5/2018",
    "text": "Terrible customer service, the guy took forever to give us everything.. even our waters, which he didn't give us straws for. The food didn't come with what was included in the menu. The food looked and tasted microwaved. Also the workers were just casually talking about fighting people. Won't go back ever. Waste of $10. Guy was super unprofessional and  slow like if he was stoned.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C6XnKchuGywhZE63aZf-Cg"
  },
  "YsNcnNCefLO7PNUxrqSjQw": {
    "date": "7/4/2018",
    "text": "Don't go here!!!!! This place needs to be on \"Restaurant Impossible\"!!! Food , customer service, and cleanliness were all terrible!!! People were walking out left and right! A lady even walked back to the kitchen and told them to take that food and that it wasn't cooked all the way through! I repeat DO NOT GO HERE!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W1m1xOf3PdlWB9ONPp03nQ"
  },
  "pzbHZcQXMF9tC4NEM0zarQ": {
    "date": "11/11/2017",
    "text": "Would give a \"minus star\" if I could!!! Waited 15min to be seated in a half empty restaurant then waited another 10minutes for someone to take our drink order. Then after waiting 35min for our food, we decided we no longer wanted IHOP. So we talked to the mgr who said we didn't have to pay for our drinks and we left. Waste of time. My advice- Go eat somewhere else!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PJgioaLSqHFYADwVnWa1HQ"
  },
  "MBAJSWZWFS0VicI3_TYVRg": {
    "date": "6/24/2018",
    "text": "I first went on Christmas Day and it was decent. Just recently we gave it a second chance. Man, so i regret that decision. My family and I were the only ones in there and the staff acted like they were all alone. Between all of the staff eating, cursing, and ignoring us, it was enough to never come back! To top it all off my sister got sick after eating that food and that has never happened before! Beware and save yourself of an unpleasant meal.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MwWDQIf-q9z6Bcl6XDPjMw"
  },
  "8iow31gdMxO8uqZEW6xaqQ": {
    "date": "8/7/2016",
    "text": "The food was alright, but where I got ticked off was the service.  What I wanted wasn't on the menu. I wanted french toast, eggs and hash browns. So, I talked to my server Nicole J. and considered these two options Griddle combo (2 french toast, hash browns, 2 eggs, 2 meat) and the 2x2x2 (pancakes, eggs, meat). The server said he'd charge me for the 2x2x2 which is $6.79 and he'd substitute the french toast for the pancakes and replace the meat with the hash browns. I said that sounds great. He never mentioned an upcharge or a substitution fee. So, at this point I'm thinking my meal is going to be under $10 with meal included, which is a price I was okay with- mind you I ate it all in one sitting, so it wasn't that much food.  The bill comes and there's a substitution charge $2.29 for french toast instead of pancakes, but no substitution for the hash browns. The total is over $10. I was NEVER told about any different price, so i'm a little irked. I would have chose something else or left. Mind you my plates are clean, so I'm in a bit of a predicament. The manager comes over and I explain the situation, she says she'll take care of it.. so I'm assuming the $2.29 is coming off. NOPE, she comes back and says she's going to charge me for the Griddle combo and not subtract the meat BECAUSE it doesn't have a price- last time I checked, you can get a side of meat and there's clearly a charge. So, i'm like hold up- if you're going to charge me for something I didn't get, give it to me- i'll give it to someone else- a friend, a pet, a homeless person. Geez! Needless, to say when it was all said and done, I only left a 0.92 cent tip because I was frustrated, nothing was explained prior or during the ordering process and the attempt to Fix it was a FAIL and after all that crap, i'm surprised I even left a tip. $10 for that experience.  On a side note, August 10th they advertised 0.50 cents for pancake stacks from open until close- please let me know if they honor that. I'll be going to another IHOP. WORDS MEAN THINGS. ACTIONS ARE LOUDER THAN WORDS.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yzxv_ko1kcO68nJS0O8ZKw",
        "caption": "Photo of IHOP - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Yzxv_ko1kcO68nJS0O8ZKw/o.jpg"
      },
      {
        "img_id": "vf-vdrIJQ8X6NFJNowkKaw",
        "caption": "Photo of IHOP - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vf-vdrIJQ8X6NFJNowkKaw/o.jpg"
      }
    ],
    "user_id": "Gb9Y_f1xslY1mDvvHBXaLg"
  },
  "6-1xW0nJc0IGZFwZ4xU9wQ": {
    "date": "12/6/2017",
    "text": "I have been here recently at around 11pm with my friends and it did take a while for our food to come but it did taste excellent. The service was very good and overall was a very pleasent experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BijvJBvLAmaZDi4HOm6yPQ"
  },
  "h2SzaIHtSm_wnyB1OzEqiQ": {
    "date": "3/16/2018",
    "text": "Had the cheese burger omelette.  All I could taste was ketchup and mustard. I also had the tres le he pancakes nothing special. Next I'll have the omelette ad ask them to hold the ketchup and mustard",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m-2KR6qlnAwsPiK9l2C6kw"
  },
  "O4I3qQdmCazEa9QoDz3dkw": {
    "date": "11/12/2017",
    "text": "Poor service. Very slow for a to go order. Ordered food via phone and when I arrived the order never went back to the kitchen. Currently waiting in the lobby for past 30 min. Simple order, omelette.  Ashtyn continues to sign loudly when the phone rings or when she is asked to perform any type of task.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KWK6Bq2kJ9pfHD9VySPYuw"
  },
  "-5dXmnLjNawfXnYX-crGEg": {
    "date": "4/29/2018",
    "text": "Horrible! THE PLACE SMELLED HORRIBLE! Unsure if the filthy carpet needs to be changed, probably never been cleaned. Food DISGUSTING, given on DIRTY PLATES. The bacon was 60 % cooked.....The workers are nice but CLEARLY management needs to be removed and improved. Literally made my skin crawl sitting in there, but my car was next door at grease monkey for a good 2 hours and my child was starving. I will NEVER go back there because serious remodeling and cleaning needs to be done before serving food in there again. Also the \"cooks\" could use a cooking class or two....Disgraceful",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zE-dvANe6N_K-qzN-cmpJg"
  },
  "64RXDQfRt1dBotmXhNMbiw": {
    "date": "2/28/2017",
    "text": "Yuk! This Pineville location is gross!  Plus we waited an hour and 15 minutes for the wrong orders to come out. Spoke with the manager twice and he didn't seem to care about our situation as the place was busy and our server seemed ill equipped for the job and smelled like weed. So: avoid this place and cook breakfast at home, folks. Much love.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6QLZzaz28b3ezu_OtSDTqg"
  },
  "UezzU0Y4lD7ast9fr-LZZQ": {
    "date": "1/19/2014",
    "text": "It's IHOP. I'm still alive.   Food is good. Large selection of food from breakfast (Crazy huge omelets!) to dinner. Sometimes hard to make a quick decision.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "M3ncFIlEfaSdSpoiMINwBA"
  },
  "h52kcbzXKLMLWgslvxDmsA": {
    "date": "12/27/2016",
    "text": "Lousy service. They didn't have soup, provolone cheese, tomatoes or egg whites. When we said they had eggs they could make eggwhites the waitress said they were too busy to make them. They kept forgetting to bring drinks. Asked for jelly. Toast was cold by the time jelly arrived. Butter never came. Had to hunt the down waitress to pay. Many other. Customers around us very upset too.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b1wvPyckav_uMQBrorlMEQ"
  },
  "IrR3FBW_dfsECl29hlV4pQ": {
    "date": "1/6/2018",
    "text": "the food was alright. The silverware and dishes were unclean. The staff was very loud and obnoxious except for a very few, one or two at the most. The service was extremely slow. couldn't check up on us because the server was too busy talking to another employee.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vp7WfDmCN7msyOCtvt81aw"
  },
  "mclGkVyU-jPbsBI0Vdt3YQ": {
    "date": "4/19/2019",
    "text": "It is what it is. My husband wanted breakfast food late on a Friday and we ended up here. The building itself seems a little dated and could use an uplift.  There was no one at the front when we came in. It was pretty dead. The one server who seemed to be the only one working came to the front and seated us. Others seemed to be on break sitting at a table.  It's IHOP so the menu has plenty of pancake options along with other egg dishes and breakfast plates. There's also sandwich and dinner plates. Hubby got the special which was unlimited pancakes with purchase of an omelette. I got the 2x2. Two eggs and two pieces of sausage with hash browns. I asked for turkey sausage, got up charged and regular sausage was on the plate. It was okay. I like that when you get coffee, you get your own little pot. The omelette/pancake deal was a lot of food. I wouldn't have even been able to finish the omelette.   Our server was okay, but they seemed to be short staffed.   But hey, when you want pancakes, IHOP is happy to serve them up.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "b4EPKL01CiTisZT3V24kCg",
        "caption": "Photo of IHOP - Pineville, NC, United States. Omelette and pancakes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/b4EPKL01CiTisZT3V24kCg/o.jpg"
      },
      {
        "img_id": "WPIH5HwBTUlzEuXQnjxYsA",
        "caption": "Photo of IHOP - Pineville, NC, United States. Eggs, sausage, hashbrowns",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WPIH5HwBTUlzEuXQnjxYsA/o.jpg"
      },
      {
        "img_id": "Hk2TOHta8I16unwnqaqNHg",
        "caption": "Photo of IHOP - Pineville, NC, United States. Coffee",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Hk2TOHta8I16unwnqaqNHg/o.jpg"
      }
    ],
    "user_id": "0cG35-H4SbjjTTSlNoK3fw"
  },
  "aflrm0NqzLzamqNBn9mJXA": {
    "date": "7/9/2019",
    "text": "I have eaten at other IHOPs and none of them are as bad as this one. When I go I always get the same thing, the French toast and smoked sausage. I was highly disappointed as a bit into lack luster toast and there was a burnt flavor to then. The sausage was slimy and wasn't done all the way through.   On top of that the service was trash. We waited thirty minutes before we got any service at all, then when we did she acted like she didn't want to be there. If that wasn't bad enough, she took a long to to come back to our tablet with the food.  There is no chance in hell I will ever return to that IHOP at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uLwn7bkVcz4iEBHWNHsq-w"
  },
  "y2164SxUqRiLi4rf3hU_EA": {
    "date": "4/19/2019",
    "text": "We had a really nice waitress, friendly and constantly checking in to see if we needed anything, but the other staff need to work on professionalism. We were unfortunately seated near the noisy kitchen, where some of the staff kept shouting and laughing ridiculously loudly, and swearing. Our food was lackluster; my nephew enjoyed the bottomless pancakes, but my omelette had hash browns inside that were barely cooked. The cook also put a ridiculous amount of cheese on which meant lots of scraping and picking through to get to some edible bites. Had I not had a gift card to cover the meal I would have refused to pay. Lastly, it seems like the staff need to be reminded to clean up as people leave, as there were many dirty tables.   Definitely would not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "grv8l0dcsGFuJPa0_cXkRg"
  },
  "JAVz2OodF2wSaN0XhJDMYQ": {
    "date": "8/17/2019",
    "text": "I love iHop but this iHop needs an overhaul. Came on a Saturday night, 7 pm, and the had 1 waiter for at least 6 tables. Tables are dirty and other team members are just milling around not helping out their 1 server. Really need to get their customer service and SERVICE together",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YAAcpNYICkCIbo0g77EgNg"
  },
  "N7SYWuBW-Q107Nu94aVT7w": {
    "date": "6/19/2019",
    "text": "Bad service they have bad bad  bad costumer service For over 10 min no one came to my table to ask anything",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cmJdKqWiLjQ-65MaVfVZtA"
  },
  "2zqatq1cNC8-EQV6JjpewQ": {
    "date": "8/4/2019",
    "text": "Honestly this IHOP should be ashamed. Waited almost an hour for my food when there is clearly nobody else in the restaurant. The employees are very loud and talk about their life problems in front of the whole dining room. One employee was yelling at another one about a money situation. Stay away from Pineville IHOP!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uk9nUw1lIr2-oyda8X3LCg"
  },
  "6VJJmN70yj5qJvTvzHctlA": {
    "date": "3/9/2019",
    "text": "What began as a simple trip for late night pancakes quickly devolved into Lovecraftian madness as we entered the temporal anomaly that is this IHOP. This is our story, let it serve as a warning for others to follow.   We pushed open the doors to the establishment, naive smiles on our faces.   \"One moment please,\" the elderly woman behind the cashier desk said, facilitating a young family's payment for their meal. Whether it was obliviousness or pure hubris, we failed to see the grim, haggard look on all the members of the young family's faces. They had seen things no mortal should see, eldritch horrors as time slowed and distorted around them. Horrors we, too, would soon be subject too...  Was it days? Or months later? We had set up a small camp with meager amenities as we waited to be seated. Foraging for sustenance, we waited as our breakfasty overlords served as plodding arbiters deciding whether or not we were worthy of being seated.   \"Follow........me..........please......\" the server asked finally, each word seeming to take hours to leave her grotesque lamprey-like mouth.   We were seated, and after a few rousing celebratory songs commemorating the next step in our long journey to pancakes, the server stared at us expectantly. As this persisted for several minutes, we grew concerned. What esoteric code did she wait for? Would our journey end here, madness overtaking our party as we tore each other apart attempting to solve this arcane puzzle.   \"Sweet...tea?\" One of us asked, wincing as the words left his mouth. We averted our eyes, sure that this insolence would be met with a swift death.   The woman let out an inhuman sigh as she retrieved a slate with which to etch our desires in graphite. Shocked with this breakthrough, we eagerly gave our drink and food orders as well.   Looking as if we had just murdered her firstborn in front of her, the woman shuffled away from us, into the mists. Then, the waiting began anew. We thought what we had faced thus far was difficult, but we were sorely unprepared.   In the years we waited for our order to come out, we watched a coven of elves, their numbers growing yearly, traverse the dark woods around us. Their mirthless laughter taunted us as we waited, our stomachs tearing away at the fabric of our very being. Some sort of devilish coven, no doubt, coming to feast on those too weak to continue their long wait for fluffy breakfast pastries.   As I recount this tale, I have trouble remembering how it ended. Did we ever receive that syrupy ambrosia? Or was the journey made in vain? Whichever the outcome, the only thing that matters is that I survived the gnashing, writhing madness of this IHOP.   Caveat emptor, my friends. When you find yourself craving pancakes let your journey take you away from this damnable place. We left friends, good men in those demonic caverns! Do not let their legacy of death be in vain. Heed my warning, stay way, lest you turn to insanity.   tl;dr this place sucks, the service is appalling slow and the people who work here all OBVIOUSLY hate it. Avoid at all costs.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ft3xmQCXwvSHJjp13DDwiw"
  },
  "igzzQQLeiFqUTNjdzchBaA": {
    "date": "5/27/2019",
    "text": "This restaurant is always slow and the people are unfriendly. The food is mediocre, but that's only because it's a chain and they have to follow specific recipes. I keep coming here every few years, hoping that things will change, but this place never fails to disappoint.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I0omG1QAbXuyLjz3excxgw"
  },
  "dWjNKe6M6Ae7tyrFhJmqtA": {
    "date": "8/5/2019",
    "text": "Horrible horrible place. I found hair in my food I told the waitress she apologized but still charged me for the food. I didn't cause a scene and still paid but the manager didn't even come over as if it was a regular occurrence, please save yourself the disappointment and go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GetqPQy8bQFxDfWOEhLC-A"
  },
  "x0TCmj2XSQAW9kQUOYf8vA": {
    "date": "6/10/2019",
    "text": "My sister is in town visiting from NJ.  My Dad, Cousin, her older daughter and myself decided to go to IHOP for breakfast. So we arrived around 9:50am it is now 10:35am. Got our coffee and ordered around 10:04am it's now 10:36 no food. And also where we are sitting smells like mess and just dirty.  We have come to this restaurant many times. We will now think twice b4 coming here again & tell our friends and family about our visit today. Not enough staff. It's just crazy.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5dNeSdPXaFceZsfidKvxWw"
  },
  "8r-ONbcH79AMG90twAzyWQ": {
    "date": "9/29/2018",
    "text": "I took my son to sky zone and came here to eat afterwards. I was pleased to see the parking lot was relatively empty for a Saturday at 10am! I walk in and the place is literally half full. A woman walks up to me while trying to scratch her scalp through her soiled wig with inch long finger nails, looking like she just rolled out out of bed. It'll be a 15 minute wait she barked. No \"Hi welcome to IHOP\". Just a lethargic I don't want to be here look on her face.   I stood there stunned at the manner in which I was addressed, wondering why management would hire someone who had not washed their wig in 8 months to work in a place that served food,  and also wondering why there is a 15 minute wait if the dining room is empty and I am the only one in the waiting area. The hostess walks away without another words as another employee walks up. Ms. Soiled wig says \"She can't figure out if she wanna leave her name\". The other woman; this one with orange and green hair reiterated the 15 minute wait. I guess that was my cue that I probably should not eat at such an establishment and certainly not feed their slop to my 2 year old son. I left and went to the Metro Diner.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYeew1TH4h-Bs3A1JpXK0w"
  },
  "-2o-wH5gtICOgeHmUKGsAA": {
    "date": "12/27/2018",
    "text": "Following our previous experience, I returned to give IHOP a second chance. To be fair, I identified myself as such.  In short, service was quick and my server very friendly (not just to me, but I could hear it to all her customers). I ordered an omelette, eggs, hash and sausage, came out quick and all was good. The Spicy Poblano Omelette was huge and served hot and fresh. Oddly, the pancakes were a little disappointing. IHOP's pancakes seem to have gotten a little smaller and not much flavor. I do not fault this location for this, but IHOP in general.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xa8opAMr_Z65lfnqFLDD7w"
  },
  "fl9DhR87gqqxinQX8cJxLA": {
    "date": "9/26/2018",
    "text": "Awesome food and service. I usually go and hang out on days when my house is bring cleaned since I work from home. I'm lucky to get Angelica and Pac who are awesome servers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fACXwxHArXsuVz3JvHEyPQ"
  },
  "JEKp1_MAwAwGFrqdvbtyBQ": {
    "date": "4/28/2019",
    "text": "Stopped in last Saturday, for breakfast.  Our server, Joy, was pleasant & very attentive.  Checked several times to see if there was something we might need.  Requested crisp bacon & it came barely cooked & limp.  Sent it back & it came back close to the same so just gave up.  Had paid extra for it too.  Coffee was very bitter.  Could barely drink but a small amount.  When cashier asked how our breakfast was, I related the above & there was no response other than handing us our receipt.  Wasn't happy with all the loud talking & fooling around we heard in the kitchen.  Very noisy!  Glad we weren't any closer.  Won't recommend or go back there again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qb53sK_ZVQ2oXOWFpiBb8Q"
  },
  "XlpQXwfh-AYksE4a4O01Bw": {
    "date": "10/27/2018",
    "text": "Went to breakfast with my mother and toddler son. Parking lot was not crowded and there was no wait. Was put on a wait list when there were open tables. I understand if staffing was a peoblem but after 6 parties paid and left, and 45 mins later, still not sat. And was told a shorter wait than we waited. We left. Poor customer service. Not how you handle short staffing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HZ2FchR4LSDDNdVkSY85MQ"
  },
  "hWQWld8Wk1j_Oqv8ki_Z8Q": {
    "date": "8/12/2018",
    "text": "I'm going to stop eating at this IHOP. Over the last 3 years or so the all around service has decreased dramatically. The last 3 times I have been to this location there has always been a hold up on getting ALL of my food out to me in a timely fashion. I totally understand a party of 2, 3 or 4 is not going to get everything at once, I get that. But at least have everything out within 5 minutes of the first dishes being served.  I brought my son here on Aug 4, 2018 for his birthday breakfast.  First off, we spent 10 minutes waiting to be seated and the place was like 30% filled.  Then our order took in my opinion 15 minutes longer then it should have to get to us. In addition to our long wait, a side of French toast I ordered did not come out till I was done with my main course. Im not going to lie I was fucking pissed. At this IHOP for some reason it takes the staff forever & a day to seat you and to take your payment when you leave. I don't understand this because they always have more then enough open tables and more then enough servers on staff.  To be fair and transparent...I have never had a rude server at this IHOP and the food has always been up to par of the IHOP standards.   I honestly think management is the issue or lack of management in this case. I don't understand because this IHOP is in a real prime location being right at the corner of 2 major roads in South Charlotte and gets way too much foot traffic for these issues not to be noticed and rectified by management at this point. I'm going to say try this location but at the same time be prepared to wait for something there longer then you should.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fPclWjKcannKddJznX0vmw"
  },
  "SNuopWIOY80wp39q6zLcvQ": {
    "date": "7/17/2016",
    "text": "(7/16/16) So we're  here for brunch. I'm   having a country omelet with a side  of  grits, unsweetened iced tea to drink. My wife is angry  that they no longer have sausage  gravy and that you have to ask for biscuits  as they are no longer  on  the  menu.  So the current  manager  has metallic  gold hair, whoa am I back in  the  70s? My country omelet was hearty and the grits were fine after a bit of sugar was added. My wife, on the other hand was not happy that her eggs had been cook over hard rather than over medium. She had them re-cooked then had words with the server about the rest of the plate going cold. She took it back to the kitchen to be re-heated. The other issue that my wife had was that she ordered toast and no pancakes and wound up getting served both.  I think that we'll wind up trying another iHop. As other diners have remarked the service has gone downhill at this one. What a shame.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xq1zRJz5VHgEKiCaI51_Gw"
  },
  "sqLiQE3ntrsbY-ntqyS2oA": {
    "date": "2/15/2017",
    "text": "Usually I like IHOP and I've honestly never had such a bad experience at one. As many other reviewers have stated, the service wasn't stellar here. That said though, it wasn't the worst part of my experience. Actually my server tried her hardest to be friendly and polite even if she was a bit off and not the best at her \"bedside manner\".  What really killed it for me here was ambiance and the cleanliness. It felt dirty and disorganized from the moment I got in. The host had a messy pile of menus all tossed together on the stand. In fact they were so confusing that he gave me a doubles of one part. It seemed weird to me for it to be in such disarray at lunch time in the middle of the day; and they weren't busy at all either. When I got to my table it was quite gross. There was some sticky matter smeared on it here and there. I managed to find a decently clean spot to open my laptop as I had come here to work some because I know they can be relied on for having WiFi. The music is really random and entirely too loud making it a considerable distraction and not good for a relaxing lunch time.  They have a new quick lunch menu where you can pick a sandwich, wrap or salad and pair it with a soup or other side such as fries. I opted for the avocado bacon turkey wrap and loaded potato soup. The wrap itself had a strange flavor to it that I didn't like. The few avocado chunks in it were small enough that you never tasted them and the bacon crumbles were the saddest excuse of a supplement for bacon I've ever had. They screwed up the entire wrap with an almost painful crunch. For the soups they had run out of bowls in the proper size (again, in the middle of the day...) so I got a large bowl half full of soup and with no bacon or cheese sprinkled on top as I'm used to with this soup. Lastly, crackers were an afterthought from my server. Basically, I don't think I'll be coming back to this IHOP.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjYXOBnladFYhciGBSgAMw"
  },
  "sAcVQPpoDBxqtJbdITzkIw": {
    "date": "7/16/2018",
    "text": "We wanted pancakes for lunch today and they were great. THe worst part came when I noticed my soda glass had lipstick on it I wasn't wearing any.  How disgusting!!!! No more ihop for us we scratched this place off our list.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1vv9cJYrDY1YF07rNLGqfA"
  },
  "qRx2JnvIkyxgUTIeJ_y11g": {
    "date": "7/12/2018",
    "text": "Eggs: overdone. Potatoes: over salted. Bread not served until after the meal was consumed and server had to be reminded (server disappeared). Server attempted to serve our meal to another table. Floor/carpet was filthy--littered with food from prior diners in various locations throughout. Would not return to this IHOP. Other nearby locations are cleaner and have food that was prepared properly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DyImv2Zpn0Awa4YVTUc9Hg"
  }
}