{
  "KHvybOT_x-ldg0VabTTN5Q": {
    "date": "6/19/2015",
    "text": "We went there last night service incredibly slow , some food items never showed up or showed up after we had eaten most of the main entree. They weren't even busy. The food was mediocre. They have work to do if they hope to stay in business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aS9ViCOG__pIV_1tfszV4Q"
  },
  "T2pOTiiDE7n1IPJAttHo1g": {
    "date": "5/4/2014",
    "text": "Eaten here 4 times now. Get tuna on salad!  It's worth the $6!! Nice, classy place to enjoy a meal with a bar and pool table option. I think it's a local chain. Really good food too with vegetarian-friendly options",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KHqFIA1OjLHOFLdScp99eQ"
  },
  "44iHQRsxB69ZidQJuGQlyA": {
    "date": "8/13/2016",
    "text": "Do NOT ever go to the Hickory Tavern on Harris!! I'm so embarrassed for their managers. After having been pushed to order multiple beers (not that I minded this part that much) my server then told me to leave my card on the table and he would just get it (without being given my check). I decided to see what would happen so I did. He brought me back my receipt without my check. I then asks for my itemized check and he acted like he didn't know what I was talking about. I explained what it was to him then he brought it. Guess what!! It was lower than what he ran my card for?! Seriously!! Don't go there! They let their servers TRY to rip you off!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Xo6fxlVP3q_e7R66o88gQ"
  },
  "E9uSh3iCNloof82m24Es3g": {
    "date": "2/23/2017",
    "text": "The service was excellent! The food was great. I loved the atmosphere. Everybody spoke when you walked in. I would recommend this restaurant to anyone. Thanks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4C2OKyC426Z9qxbzkGRMkg"
  },
  "V5ZUUfVRIj_TEtzXIpehMg": {
    "date": "2/22/2017",
    "text": "It was my first time there and the atmosphere was really nice. The food was good and I was surprised at the selection because all I had heard about was their wings.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xtc-0LxJ-NASctU5Y7ArDA"
  },
  "TNMEEKmqDtaecM4x0QQ4mg": {
    "date": "2/18/2016",
    "text": "Hickory Tavern is a great place to relax and unwind. TVs everywhere. Food is great and service is very good. Great convenient location on Harris Blvd and Statesville Ave.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMJ1OmVCtCpxxw6Q1HQy3g"
  },
  "-lldbGjBzTIUqVcvC65LJQ": {
    "date": "8/8/2013",
    "text": "I see there are a lot of this in the Charlotte area, and I can't speak for those, but I loved this place.  It was just a little pricey, but I really enjoyed the food, and the beverages.  The service would have received the Gold Star, except the server forgot to bring the tea we ordered.    We went to this place because it was near our hotel, and the hotel actually gave us a coupon for 10% off.  I'm glad we took them up on their offer.  They had a Garden Burger that was as good as the one at Red Robin, and I believe that is the best I've ever eaten.  It did not, however, come with the bottomless fries offered at Red Robin.  The fries on this one looked bad, but actually were pretty good.  They were good enough for us to order more.  The meal was excellent, really hit the spot, and, except for that one noted glitch, the service was great.    I also enjoyed an alcoholic beverage since there were no liquor stores in the area.  I had a \"Tennessee Lemonade,\" or something like that, with whiskey in a lemonade type drink.  I loved it.  I had two, even though they were kind of pricey for my budget.    This place reminded me of the Yardhouse in Lakewood, CO, or any higher level sports bar.  Good food, and good service, but it costs a little bit more.  This place would be fine and perfect for entertaining family on the way through town, or for watching any sport on the big screen TV.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yRRtt7GW9KEp93Fepcwd6g"
  },
  "k6q9Wy1R9eZKkdds8_Awbg": {
    "date": "9/8/2015",
    "text": "They grill their wings after the fryer and season their baked potatoes....little things go a long way, my food was better then expected for being at the local watering hole while away for work. Oh, and the bartender w sexy glasses is a good thing too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3BeTx8m4AOc_nuuu-zrwqQ"
  },
  "U9wgzhaiHd3mTeAHTXm0HQ": {
    "date": "4/21/2013",
    "text": "I recently stopped by to celebrate a birthday with a group of 7 and our waitress was great.  We had several orders with various changes and all of our orders were correct.  When we arrived for our 6pm dinner and the dining room had a lot of availability; however, within the hour, the tables filled up due to the games that were on that evening.  Great location with meeting people, with easy find.  -Wally",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_n1xbntKBR-8d_YxqaDAAg"
  },
  "ceU5gRLk6m30-pcUnz7mAA": {
    "date": "11/20/2014",
    "text": "Normal sports bar. Nothing special about food. Experience a hair in my avocado on my salad",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t77iaBQb3pyj2rtwffiLEg"
  },
  "YebwmvA8cC_Hha-AHd2b0g": {
    "date": "2/25/2015",
    "text": "They had a pretty good selection of tap beers which is an automatic 4 stars.  The fact that they have pool and a plethora of TV's made it even better.  I'd visit again if ever in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6LmFssnFDBG-oPMsvyAx_g"
  },
  "LFlrGJdpJ5EUQb7fq6lPtQ": {
    "date": "2/18/2015",
    "text": "I was there on a Friday night a couple weeks ago and ordered the fresh tuna appetizer. ..my guest order the same with  a side of broccoli and his portion was smaller... my tuna was extremely and I asked if that was the norm ... the waitress immediately asked if I wanted to have them prepared again after we noticed my guest portion was not as salty... it was prepared again and came back okay!  I wasn't overly impressed and although I just recently moved to the area... I won't be in a hurry to return.  I remember frequenting the restaurant about 10 years ago at the same location ...but recall it being more inviting of an atmosphere and the food being superior... it feels like a different place now. ..What happened?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ibeb2OxOucjw8hYzTIQFIw"
  },
  "QStwFzIjiIyJRNqUq9LwsA": {
    "date": "6/9/2017",
    "text": "We go as a team to this place every Thursday night after softball usually have great service. Last night was totally a cluster. Waitress was very nice and apologetic, I watched the one bartender work as hard as possible to keep up. We had 2 drinks in 2 hours waited on food for an hour (24 Wings). I approached the manager asked if he could give the bartender some help he said \" the kitchen is behind and that is where he was needed\". I then watched him approach bar pull tickets and rudely slam them in front of bartender and say \"Do these\". We also observed him sit and talk to his parents sitting at corner of the bar for 45 minutes (which they had prompt service) and neglect the atmosphere within the place. We usually leave seeing a full restaurant but we all noticed it was slow upon our exit. Policy: care for your staff, your customers and visit your parents on your time off. Lost our teams visit every week.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xMsU0afZo8-yfZEv00kZw"
  },
  "SgaLr-bdHL5D0mirzMa_Ig": {
    "date": "11/28/2009",
    "text": "Big Screens and Bigger screens, great location and decent food. Located right off Harris Blvd @ I-77 near North Park Mall this place is a great stop for good Pub Grub. The Turkey Club is excellent and the Super Nachos are a meal for four or more. You want to go here on game day to watch the Panthers. You can enjoy the view from many Plasmas or the huge Big Screen.  They do serve Guinness but the day I went there was a problem with the tap so I had to settle for the Fat Tire....meh...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rv9d5TcnnxuOCX7ole_Clg"
  },
  "0dKfMmi3_OR-6nmgrljihw": {
    "date": "8/9/2012",
    "text": "Decent place for apps and standard  American bar fare.  Not a huge fan of this type of food, but if that's what you like, they do a good job.  Chicken fingers, fries and dipping sauces.  Tasty, but not great for cholesterol levels.    Mid-to-lower-mid price hangout joint / bar area.    Staff has always been friendly.  Don't see a lot of managers; but, that doesn't seem to have made a difference in a negative way.    Wait personnel, greeters, etc., all young. . .but nice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jKx0XOTrnT6gHiiRZ-UVKg"
  },
  "xXcW9wEt1tSYI5lvzkz7Xg": {
    "date": "9/14/2013",
    "text": "The female bartender is extremely rude.  The customer next to me waited 10 minutes to even be greeted, and them he said \"ma'am\", and she turned her back to him and put her hand up.  I haven't even tried the food, but there is no excuse for poor customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "HvvDE63JO_XboKlsWJA3rw"
  },
  "RBM834n2M0_4YA0hLjZxaw": {
    "date": "7/25/2016",
    "text": "Great Monday night casual dining and the staff is very friendly I had Rebecca! She was very nice",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5QU93DVWP7PpTnx0HXunYw"
  },
  "9UlPItpPo1XWYp73Pq7cdg": {
    "date": "7/16/2012",
    "text": "The location at WT Harris and Statesville Road is like the cafeteria for our office staff.  I'm in there at least twice a week. Had lunch there today in fact.  Good enough beer list, good enough food, good enough service so we keep coming back.  Mostly because it's accross the street from the office and therefore really handy for lunch or after work.    Oyster night (Thursdays) is a great deal.  Pint night on Tuesdays is great too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s6ArzWxkfV7uRURej7AoQA"
  },
  "ML5TNLeNBHYwgiiijyUzxw": {
    "date": "9/24/2013",
    "text": "The salad I got wasn't bad. Just super small. I think it was the fiesta salad. It came in a small bowl. Thought its be bigger. The chicken that came with it was about 3 fingers big. And well say it was Girly fingers. Haha very small pieces. Thought there would be more chicken. Panera Bread has the same salad for way cheaper and the portion is way bigger. When it comes to dinner time, they shouldn't serve lunch sized portions to hungry ppl.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wZ_44K1tBBMkERoSIpvgXA"
  },
  "W5io_qLou0D-apQ2Qs5omQ": {
    "date": "12/28/2011",
    "text": "Hickory Tavern is a small but growing chain in the North Carolina.  Serving dependable bar food with a great beer list, I can see why it's gaining popularity.  They brand themselves as a steaks and oysters place, but they are really a sports bar basically (a tastefully decorated one though with minimal tschotkes).    And a biggie for us, they were open Christmas Eve.  This location is relatively new and has a large, airy atmosphere with high ceilings and tons of TVs.  I've been to the Pinehurst location before, and ordered the same meal at both locations, the delicious Carolina burger.  As anyone that knows me knows, the best condiment for a burger is more meat.  The Carolina burger offers that meaty condiment in the form of chili paired with mustard.  The burger is above average (mostly due to only having two options for temperature, medium well or well done - they may as well ask if I want my burger bone dry or burned), but the fries steal the show - in between steak and shoestring in size, they were cooked perfectly.  They also have 1554 (in addition to Fat Tire), which helps soothe my New Belgium beer cravings.  I can imagine this place being great to watch NFL games on Sundays.  All in all, you can't really go wrong with Hickory Tavern - dependable food in a low key atmosphere with good beer.  Things could be much worse in life.  Now to get Red Oak onto the Hickory Tavern taps, and 1554 onto other restaurants taps.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VNA0Dfg2QeCB7jz-7hL6gw"
  },
  "-LpWAreS5Esp6_yrxXDjNg": {
    "date": "1/18/2016",
    "text": "This edition of Excited about Eating takes us to Hickory Tavern in the Northlake Mall area of Charlotte. This sports bar chain restaurant offers a wide variety of menu items from chicken wings to crab legs and steak, although they streamlined their menu since our last visit.  Dora here. Hickory Tavern is one of those go-to comfort restaurants for me. You know what I'm talking about, right? When you're tired, don't really know what you want to eat or you just don't want to cook, Hickory Tavern offers an eclectic variety of choices for the whole family. And with all the big screens located on every wall, you can almost kick your shoes off and just relax. Almost. lol.  As you can see, we're early eaters. Anybody else staring at the clock, ready to eat by eleven thirtyish? No? Okay, that's why we beat the rush. :)  The Shrimp Po' Boy features breaded fried shrimp, lettuce, tomato, pickle, cajun remoulade served on a toasted hoagie roll with a side of my favorite tater tots. I don't often order a Po' Boy sandwich but after enjoying this one, it might just be back on my items to order more frequently. The shrimp was cooked perfectly, but the Cajun remoulade is what pulled this entire sandwich together.   Dora here. Not sure why hubby's short on words today. Hmmm. Anyway, the Chicken California Sandwich minus the mushrooms and avocado was moist and juicy and tender, and the bun soft and fresh. Delicious!  Reminded me why I like this place so much, and I admonished hubby that we need to come back more often. It's just a bit of a drive to make it a regular place. The food seemed to take awhile, but so long as the iced tea kept flowing, not a problem. :)  We would rate this restaurant 4 forks out of 5 for a family friendly restaurant serving great food. ~Ernie & Dora Hiers, Fiction Faith & Foodies Blog",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZB5IDns20frfEJGUW1h6VQ"
  },
  "B6t4j1kB7UsvPlI08HbEBQ": {
    "date": "11/6/2016",
    "text": "horrible service! don't go!  my 8 year old daughter and I walked in for dinner at 6pm. we were promptly told by a less than engaged host that nothing was available and go look in the bar. no, would you like to wait, no nothing... not the first time the ambivalent nature of service at this location has reared its ugly head, but it will be the last! at least for me! be warned... this chain is going to die if it continues to be managed like this.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jqcti0AMBsV0cIb69mGg1g"
  },
  "ZbiyLXXr-4AQagXgrczGNg": {
    "date": "1/6/2018",
    "text": "I attended a birthday celebration with my girlfriends and the service was horrendous. The waiters were awesome but the kitchen was a different story. After waiting two hours for our food when it was delivered it was lukewarm. After requesting to speak to a manager several time I went to the kitchen door and asked to speak to the manager Now. The manager came out and started giving excuses for the poor service. I immediately told her no excuses Just Fix It. She said she and the General Manager were in the kitchen trying to get our food out. I cannot believe that they didn't come out and speak to our party until I demanded it. Needless to say my girlfriends dinner party was ruined. I will never frequent this establishment again. Poor Customer Service all the way around.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jbIUeb0lqMJpZbCy-2LBxw"
  },
  "L_RENQRRf_4ueaSQcmUnKA": {
    "date": "12/11/2017",
    "text": "Really wish I could give 0 or negative stars.  The food was a 2.  Nothing you couldn't get anywhere and nothing special.  Bland.  We had wings and tacos.  Maybe I expect more from tacos and wings.  The service was a 3 friendly for the first part and downright rude for the ending.  My party was treated very badly when we had a simple opinion.  I travel all over the country and have eaten in every state except Alaska and I will never set foot in this place again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QQa1TU3mdkMuyRglk5cSow"
  },
  "yxtt-5NC2TXnUX9LWpPe8w": {
    "date": "4/21/2017",
    "text": "We have had 3 poor meals here and will not go again. Last visit was around 2 pm and we first ordered drinks and the waitress put the order in and stood by the bar waiting for the bartender to make the drinks. We waited 10 minutes. There were 3 people at the bar but she still ignored the waitress. After we got our drinks we ordered a chicken quesadilla. It arrived over cooked so we returned it for a replacement. The second one was not burnt but, I kid you not, there were only 1-2 small pieces of chicken in each section. And nothing at all in the last inch and a half of each piece. We felt sorry for the waitress as all of this was out of her control.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yU5OiCB8E-DrcUu1VyqHwQ"
  },
  "Lg11afjDzGjeAq9AtY-oMQ": {
    "date": "8/2/2015",
    "text": "The wings were good, the beer selection was respectable, and the menu featured a nice build your own salad option which was nice to see. The service was friendly and sassy for a bunch on a work trip. I noticed a nice outside seating area and a party room that was in use for a work function. Is it special? Not particularly, but it is a solid option if you are in the mood for that type of fare, good for family, friends, work, the game, etc. I would come here for the game before i would bww.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Gp6ZWHBieHTRm0I-TU6FPg"
  },
  "7b0xNBHbBj0wqaJKw7N2Pg": {
    "date": "6/21/2016",
    "text": "Terrible service!  Last 2 times the waitress disappears and never returns, no drinks, food order was wrong and we had to get the manager to stop and fix it and then we have to chase them down to pay the bill.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "agoPQeNzCIAIffpPXg487A"
  },
  "AdhCcBUPzDXc8MbXIldD4g": {
    "date": "7/27/2013",
    "text": "Its a chain restaurant.  Consistent with their other restuarants, this place offers a sports bar ambience. Family friendly and typical burger, chicken wing and 200+ beer selection.  The food came out right, nothing to be surprised , its standard bar type food. The beer was cold, the TV's are all  working.    I am glad to say that , when the food is not the focus, they did a good job with service. Our servers, 2 of them, was quick, friendly and happy.  We also tried their oysters here and its the standard gulf oysters.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JysF40STBTmx7h-sU1FHgg"
  },
  "VIAf2dfYlw8xfVDzNJNh5Q": {
    "date": "10/20/2014",
    "text": "Decent bar food. Wines are pretty high in my opinion but Draft Beers aren't bad. Food is spot on BAR food. Don't go expecting anything fancy. Burger was tasty albeit SMALL (5oz?). Tuna app was decent but no mistaking it for sushi quality.   It is loud especially during game day.  Not a bad option when in this area...... just keep the expectations low.....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "QYobbHEmhLGuS6QDqVRTLw"
  },
  "0EyGnn5Z9_TxdAEtE5zy8A": {
    "date": "3/19/2016",
    "text": "This place is such a waste of money. Think Applebee's atmosphere, with food that has no flavor whatsoever. I mean none. It's like they went out of their way to make everything as bland as possible. I got the shrimp tacos.. with no flavor. My girlfriend got the chicken sandwich.. that tasted like it was made before seasoning was invented. You've been warned: over priced, under spiced, and the most forgettable meal of my life.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HxFwSzYiUUP7xfCqV8bMNw"
  },
  "o8oIifE0-_2tlab0QIBjAg": {
    "date": "9/17/2014",
    "text": "I've been to Hickory Tavern 3 times now.  All 3 times, during lunch.  1st time @ Mallard Creek - 2 people - build your own salad.  Impressive and thoughtful menu item.  Great options.  Kudos for this.  The cucumber wasabi dressing is amazing.  2nd time @ Harris - group of 8 - burger and fries.  Meh.  Pretty standard fare bar food.  At least the beer was cold.  3rd time (16SEP2014) @ Harris went something like this - 3 people.  11:15 - get seated by greeter, total of 5 customers in the restaurant.  11:20 - people around us are getting their drink and food orders taken, some of these people came in after us, we have not been greeted by a server.  11:30 - drinks and food start hitting tables around us.  11:35 - still not greeted by a server, so we stood up and left.  As we left, I made eye contact with the bartender, I'm sure anger and disappointment was over my face.  I don't have a shred of tolerance when it comes to being ignored in a restaurant.  I make it a rule to avoid places that disappoint me like the plague, poor service being the worst offense.  There are many options in Charlotte for places to have lunch, this one is off the table for me.  If you don't want to send a server to my table, you can't have my business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "KMy2wC8SnJ3Lm2gZljB1xA"
  },
  "8aoJJdKEO3ypoZNszpPu7Q": {
    "date": "11/9/2016",
    "text": "We had my Mother's Birthday Party here on 10/29/16. What a Great time we all had. The food, music and waiters were Great!!! Thanks Lyles!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bGgAL09pxLnV_FFgR4ZADg"
  },
  "iCaQGb57G5DyVrahyt-V0w": {
    "date": "7/19/2016",
    "text": "Oh my goodness! The wings and oysters are amazing!! You cannot go wrong with them. The staff was extremely friendly and gave great customer service. Definitely going back next week!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9XBwMq9rJSf8GFOSIOtTSw"
  },
  "DwnB5rSe8lfQEyV3R7LArA": {
    "date": "2/16/2017",
    "text": "This was my second time at this location. The first time I was not overly impressed, but we decided to give it another chance.   Last night myself and two others went in for dinner. We asked for a beer menu (last time there was a laminated list) we were handed a hand written list, much shorter than the list last time. This is a sports bar and should definitely have a better beer list than a hand written list. Then it came time to order our food; I ordered boneless WINGS, one other a burger and the other a salad. When the food came, the burger was wrong and it had shredded cheese instead of sliced cheese (starting to get a cutting costs unnecessarily feeling). My BONELESS WINGS were in fact chicken TENDERS. There is a difference here. The meat tastes different in these two cuts of chicken. The food runners were very rude about my dissatisfaction. Simply said, \"that's how they come\". Well, the menu shouldn't say BONELESS WINGS then. I tried the tenders, but it just wasn't good so I sent it back and got a burger. The server was rude about me sending it back and a manager never came to check on our table. A table sent food back and a manager just didn't care.   Also, the live music was horrible and entirely too loud. We had to yell at each other to talk. The hosts didn't want to actually sit us, pushed us to the bar seating which is first come first serve. When we came back and said it was full they also seemed annoyed they actually had to do some work. Overall, it's been a long time since I was this disappointed in an experience at a restaurant.   My friends and I will definitely not be returning to this location and will certainly drive another 3 minutes down the road to go to Buffalo Wild Wings for a sports bar and real boneless wings in the future.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ksKsh6cVXW6dyHVAo0U7A"
  },
  "-EcvYRo5ekF1kGHXUi3qEw": {
    "date": "6/7/2016",
    "text": "This was our first time at this location. We decided to get the unlimited crab. It was delicious. We also had semi- frozen crab but Chris, the manager, made sure things were made right and took great care of us. We will definitely go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MF_AF51owEIdhqGMFYH8bg"
  },
  "QxNlNBRlrqfnlGR8XRaX6w": {
    "date": "10/28/2015",
    "text": "Not much to say. Went for dinner here since Buffalo Wild Wings had a long wait and we didn't have enough time.   Since my boyfriend had work we didn't order adult beverages just a water with lemon and Pepsi/Coke. The drinks come out, surprise no lemon. (We stated lemon with the water, so it wasn't like an un-spoken request) whatever, we decided it wasn't worth a fight and went to ordering our dinner. I had a Tavern Burger, he had a Reuben. I also ordered a side salad to eat prior to my burger coming out. Once we placed our order, we did not see our waitress ONCE until after the food came out. I had been almost empty on my beverage for awhile at that point, and luckily with the food she ran and got me a refill. My salad didn't come out prior instead it came with, and was TERRIBLE. The croutons were stale, and the salad was soggy (like it had sat out in the dressing for way to long). My burger was fine, I feel as though it was small for $10, but whatever. My fries were cold. The Reuben made my boyfriend sick but he said the flavor was good, his fries also cold.   We never saw our server again, until she dropped off the bill. So instead of complaining we paid and left and I don't plan on returning to this location. I don't recommend this restaurant to anyone, and don't see how people are raving about it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "M9RZJ4TTfYB2iosiEV30mg"
  },
  "cra-aFKgjUxV16fJeGJo-w": {
    "date": "1/12/2016",
    "text": "I don't understand the bad reviews here?  They have a nice beer list, lots of food options, and a great bar area.  Our server was attentive and was actually enjoying working; the prices were good.  I'd come back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ELhGStZZP5C34m8FYEcZtw"
  },
  "3159-eOA1lIL2D7f6-f02A": {
    "date": "6/16/2017",
    "text": "Stopped for a late lunch here. It wasn't very busy yet we still waited quite some time for anyone to get to us. We ordered a burger & a chicken sandwich. Both were okay but nothing special.  The service was incredibly slow & our drinks went unfilled until someone other than our waiter refilled them. Asked for ranch & honey mustard & didn't get that until we were both about done with our meals. Pretty pricey for what you get. Doubt we'll be back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RdNBHKtwqRRtZ3X-PR85YQ"
  },
  "wOtit-7Tfhr_0qSn-PP3Jg": {
    "date": "9/27/2013",
    "text": "Ate this twice while in the city. I was told this is a go to spot to watch the game.   Food was good and the menu was very decent. I'm a picky eater and was able to find something here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dyRK53OzdGTz7SDvL9syqQ"
  },
  "2_K9A_K_0nw5U2Ehyu83NA": {
    "date": "3/12/2017",
    "text": "The service at this location is horrible. The waitress would walk by our table 2 or 3 times before actually stopping to see what we needed. After we ordered the food took forever to come out and it was not busy. When they did bring the food mine was missing and came out several minutes later. The decor definitely needs a little update and the building was freezing. I had to get a blanket out of my car to bring in to warm up. Very disappointing visit for my family lunch.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZSWGiQtYPNXahEsM7AlgCw"
  },
  "NpHZmoJFX7xSkggJvn_Yrg": {
    "date": "4/24/2018",
    "text": "Our experience tonight was well above expectation! Our server, Michael, was outstanding and even went the extra mile to shake our hands at the end of the meal, perfect touch! Our orders were made correctly, the atmosphere was perfect. I will definitely make this one of my more visited destinations in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-lNDfqtSd19wbdHEOToSUw"
  },
  "nVQWg1f4b6MFD3fyQyM6LQ": {
    "date": "2/11/2017",
    "text": "Terrible service. Walked in, sat at the bar for maybe 6 mins or more. The dirty glasses was left on the bar it has not been wiped or clean from food being left in the counter. Remind you it is a slow night and the bartender has not approached us or greeted us yet. He walked passed us at 3 times and served someone else that walked in after us. Never seen such a lazy ass bar tender who the hell wants to sit at a unclear bar. We just left. Nothing like he other Hickory Taverns.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nXw2hd50paRuNnaaYyhweQ",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. Fish tacos, not original tasted very bland.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nXw2hd50paRuNnaaYyhweQ/o.jpg"
      }
    ],
    "user_id": "C6p0kvnu2rvqyM1WN-EbrQ"
  },
  "JJmSG9Ke7yfLB16kh6q9wA": {
    "date": "3/25/2018",
    "text": "We say for 10 mins while our server was flirting with other servers. Never got to order food. They even just watched us walk out. No one even tried to stop us. Won't be back",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BXo-G5CElEBjHh04HiBppg"
  },
  "g_NrUHAWJDSExz8i6qek1g": {
    "date": "1/17/2018",
    "text": "Me and my roommate go here a lot. The BBQ nachos are so good  we had some younger guy server and he sucked so bad we didn't even want to go back again. We ended up going back last night and had Amanda as our server and she is so amazing! We will deff keep coming back and we will be asking to sit with her. We were going to tell the manager about how great she was but I didn't see her when we were leaving so I hope she reads this. Thanks for being a great server Amanda",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4lz_T6ho8Atz7aq6JLxrA"
  },
  "EiuVwnvs66gBXnzY3MGAmA": {
    "date": "12/7/2016",
    "text": "I have been here a few times and I have no clue why I keep going because service is absolutely horrible everytime i go. When I ate there the first time it seems like the waitresses always disappear and never come back. My husband ordered a beer and he never got it. I ordered cheese on fries once they forgot the cheese and when I told them they gave me cold shredded cheese.   Tonight my husband and I ordered takeout 30 minutes before getting there I called in the order when my husband got there it wasn't ready and he had to wait an additional 30 minutes....then they made the order for dine in instead of take out. The waitresses disappeared on him a few times. Then the food...gross...nothing had flavor not even my poor piece of salmon...it was juicy but no flavor. My husband ordered wings and he said it just tasted like chicken.   In all seriousness management needs to evaluate their company cause it's not just this location and whoever this lady is who comments \"sorry this happened\" on the other reviews needs to stop and reevaluate her life too.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uq8ChZ-8uxmkX2vUUMjGEQ"
  },
  "4GAMeTeSZlrtPZ683YsDaA": {
    "date": "8/26/2016",
    "text": "Regretfully one of the worst meals I've had to date. Our experience started off on a bad note, from which it never recovered, when the waitress brought us our first round of cocktails.... Two in our party ordered Moscow Mule's, but were served watered down ginger beer/vodka blends sans copper mug,  mint, and ice. The waitress seemed annoyed and let us know that, \"if we ordered another one after this, we can have it in a copper cup\".  My question is, if the drink sat long enough for all of the ice to melt; what would another 90 seconds to wash the mugs be? The waitress was unapologetic, but did note that we could order something else. I opted for a beer, which came out without issue (in a bottle).  My next major problem was with my entree. I ordered shrimp and grits, a southern classic, which I have ordered more than a half dozen times at this restaurant in the past. The shrimp came out without being deveined. This is 100% unacceptable at even the most mediocre of greasy-spoon type establishments, much less at a $16 price point at Hickory Tavern. Again, the waitress seemed barely bothered by the snafu, and we did not receive an apology or explanation by management. A gentleman came out after the meal was sent back, asking for an explanation. I showed him the picture and explained the shrimp was not deveined, which seemed to baffle him. I'm not sure if he was in disbelief or was not sure what I meant by \"the shrimp was not deveined\". Either way, he did not respond to my negative experience in any way other than making a face and walking away...   In short, please don't waste your time or hard earned money at this has-been chain that no longer emphasizes customer service or palatable food. This particular chain has gone downhill over the past year. I have never had an issue at another Hickory Tavern in the Charlotte metro area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TdTzgx751kZYPjPWVa9fVg",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TdTzgx751kZYPjPWVa9fVg/o.jpg"
      }
    ],
    "user_id": "GG-B4AHKocmE3WkMYYZ1Vg"
  },
  "EiilqomuY50lImiAMyXmFA": {
    "date": "7/1/2018",
    "text": "Placed an order through postmates and left a note letting them now I dont eat meat. Then called to let them know i dont eat meat and not to put meat in my salad and to instead. Add an extra roll. Instead of getting what i requested i get a salad with bacon and ham in it. Called them to have the salad refunded back on my card because i had to dispose of it and was told i would just get my whole meal replaced for free. So I call the next day to have the meal replaced so i could pick it up and a manager states \"we keep the names in a call log and details of the issue, your name isnt on there\" whos fault is that? YOURS. I had proof that i called, proof that i ordered, and proof that i even left a note in the postmates order. The idiot that answered the phone at the bar messed my order up in the first place and you promise me a meal to be replaced and now you tell me no? Offering to replace the salad was generous on the 2nd managers behalf that i spoke too, but lets get a little more organized.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JWNNP6zBPhBNILMk0VcSBg"
  },
  "Qr1fmTJPlU8o2wQVg56H7w": {
    "date": "5/17/2018",
    "text": "Great place to take a group. Extremely accommodating. Good food, reasonable prices, cold beer and outstanding service, especially Amanda. It's my go to place when I'm in CLT for business. Thanks all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wR50SE-59SDaLDlay-4TqQ"
  },
  "RDKmUXS5aNkVyt0qKNQajQ": {
    "date": "9/27/2015",
    "text": "It was very good. Service could've been better. The price was great. I was truly impressed with their bucket of boat trash. Super cool.  We ate wings and that. Had a pleasant time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uaoIdns4iv30dF08ixjH6A",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. Bucket of boat trash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uaoIdns4iv30dF08ixjH6A/o.jpg"
      },
      {
        "img_id": "gK2-Qeg-piOYn5SeLIvTxg",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. Wings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gK2-Qeg-piOYn5SeLIvTxg/o.jpg"
      },
      {
        "img_id": "urBg5eHc_C-_AT-OUgPqxg",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. Yium",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/urBg5eHc_C-_AT-OUgPqxg/o.jpg"
      }
    ],
    "user_id": "FltzoZj3LehJ4SkreUvLxw"
  },
  "o37c7789RtfLukKv_fGwfQ": {
    "date": "3/26/2016",
    "text": "The crab legs were delivered COLD and with no Krackers. No refills on drinks.  Waitress friendly but not accommodating in her profession. Spoke to mgt but doubt it made difference.  I hate leaving bad reviews because the person reading doesnt know the background or basis of my post. Check my other reviews",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bqZDPmqCxE0VUldDYvixKg"
  },
  "csQzEayEyF_eKNmnyNjJuw": {
    "date": "5/15/2017",
    "text": "Yesterday was mother's day and my family and I made a reservation earlier in the week to eat here. They had the table ready for us when we arrived and we sat down immediately. Our waiter was extremely nice and patient with everyone. We got our drinks and food in a very timely manner and everything was delicious. No one had any problems with their food, except one and the waiter fixed it before she could even tell him what was wrong. My drink from the bar was excellent. Great lunch for all 13 of us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xNbEEcymPtaEPtFwewsqQA"
  },
  "9U5bz6LXybMv0xxTQOM1xw": {
    "date": "7/15/2012",
    "text": "When I visit a restaurant, select a dish of my preference, and the dish arrives hot and tasty, I am a happy camper.  My selection was the Seafood Bayou with tilapia and shrimp both grilled to perfection.  The steaming hot entree was served over Tavern Rice with a side of fresh fruit that was absolutely delicious.  Being in a Tavern, I had to order something to drink.  I opted for the hard apple cider which tasted pretty much like an apple martini with a bit less punch.  It was quite tasty and I had to remind myself to sip rather than drink!  For dessert, the chocolate cake sounded delicious but I could not stuff any more into my mouth.  Although I drive by regularly, I had forgotten Hickory Tavern was at this location.  I enjoyed my meal and anxiously look forward to my next visit.  This lunchtime visit was superb.    I almost forgot to talk about the sweet potato fries!  They are fabulous with honey drizzled on top (or you can have it on the side)!  If you are not afraid of something that tastes good, give them a try.  NOTE:  Since the hubs and I had the kids with us, an evening meal in a Tavern would have been out of the question.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NUKbfBFsEHF731Zy5StUWg",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. Kids chicken fingers with fries and mandarin oranges.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NUKbfBFsEHF731Zy5StUWg/o.jpg"
      }
    ],
    "user_id": "7PiRdxYF-Uvzn2fHqdtU1Q"
  },
  "5QG3iHuU4LA-rLB3jfU32A": {
    "date": "8/18/2017",
    "text": "Very good service and the food was actually pretty tasty. Oysters on the half shell, crab dip and shrimp and grits. We would eat here again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IdgH9eo2yIZi24d_vJhbeQ"
  },
  "IgPmOc_UA60tO6VbURpePg": {
    "date": "5/29/2014",
    "text": "Great Sandwiches!  THE BEST Sweet Potato fries (with honey butter)!!!  Draft Beer specials on Thursday...we love to go get our 16oz Blue Moons and unwind.  The service is outstanding and always on time. Will definitely be back soon, especially since I live walking distance.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ng6PohLfg7Jh6z39aKyrxQ",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. Blackened Tilapia",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ng6PohLfg7Jh6z39aKyrxQ/o.jpg"
      },
      {
        "img_id": "IXptKgiXbz5yspNTTKtApg",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. California Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IXptKgiXbz5yspNTTKtApg/o.jpg"
      }
    ],
    "user_id": "vW1kHIcXk8ZWIlkXj9qKIg"
  },
  "lMaCBxbv8nNwqwiQBXNNwg": {
    "date": "7/28/2017",
    "text": "We are here right now and will never be back. We always come here and usually enjoy everything but not tonight. The bartender would not serve my moms friend who is 30 because she thinks he is messed up. He is actually really shy and always talks different. Before we came here he had one margarita at Azteca across the street. This was really  prejudice because he is not drunk and I ordered a drink and wasn't even ID'ed and I'm only 21. We will never be coming here again. The bartender is rude and there is a reason this place has shitty reviews.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HYq5VSyPuhrd77toB2m3Qg"
  },
  "QvnSwG5rLldGkZj9CbEaqQ": {
    "date": "6/8/2017",
    "text": "Arrived for lunch at 1:05 with about 30 patrons currently seated.  Our waitress was polite, but not prepared to answer my question as to what the soup option was.  And she did not offer to find out, just a reply of \"I do not know\".  After 20 mins I had to ask another waitress for help in finding our order because we could find our waitress.   One of meals arrived with an incorrect side, which was quickly replaced.  We asked waitress to remember to not charge us for it.  She returned to tell us she did, but that substitutions were not allowed for this meal, but they would allow it this time.  Really!  She could have told us ahead of time?  And her tone was of blaming us.    We have been here 2 times in past few weeks.  Each time during lunch  and each time order took a long time and came with errors.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p9vQv6dhU9NufSzsIAlrGg"
  },
  "ZmhG5ZL-_WJqami8LnQmHQ": {
    "date": "5/6/2016",
    "text": "Nice atmosphere, plenty of TV's. Priced affordably. They do serve food, but stop the dinner dinner menu at 10:30. We ordered the BBQ chicken nachos and they were so good!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VT1B2MNTSTUlCE7NOMbyRg",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VT1B2MNTSTUlCE7NOMbyRg/o.jpg"
      }
    ],
    "user_id": "2xLBFCtjaREAPUE2KBpA0g"
  },
  "i8dFs67_KD-LkIjbJ10Ivg": {
    "date": "12/31/2016",
    "text": "Can't comment on the food as we never got any. Came in and waited at the host stand for a few minutes...finally got seated. Sat and chatted and looked at menu, there for at least 10 min. No one ever even came to the table, so we left.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lZggXDz33DbYKNeEAJtSyQ"
  },
  "VHN4FrHQhY3ChXtrf9adkw": {
    "date": "7/3/2018",
    "text": "My husband  and I decided to try this place out because we were craving crab legs. We got there and walked to the bar nobody greeted us, the workers were all too busy in their own conversations. We sat down at the bar and the girl there started greeted us but wasn't friendly. She was honestly horrible I was upset they share tips at the bar because I honestly just wanted to tip the other guy that was working the bar. An African American fellow. He was great. She took our order after making us wait. The food was brought out in a timely manner. After that she never checked back in on us. The guy pretty much took over and we asked him for everything else. Meanwhile, the other employees were all just gathered all around us having their own conversations pretty loud. I just didn't think that was too appropriate it was just not the best place I've been to. I think they should have taken their convos to the back or just some place else not around the guests. The food was great but I probably will not return to eat there again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AsLpVFEvjh7XetzLgHQw8A"
  },
  "eAB47MYvF2N8R9nmkiRa_A": {
    "date": "6/9/2017",
    "text": "Nothing to write home about really. The place is clean well staffed and the food is average. Nothing to really make you want to come back. This is also a chain with several restaurants in the area. Seems like the are more concerned with a restarunt on every corner than a memorable dining experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qD5DaWZ4LNXMCF1iWt1S1Q"
  },
  "cjfD2AGMVFO1NHPg5AJl2w": {
    "date": "6/15/2019",
    "text": "Service was great. Food was terrible. I ordered a chicken sandwich with a baked potato. The potato skin was so HARD you couldn't cut it with a knife. Like it was under a heat lamp for hours. Chicken tasted like mcdonalds. Would have been much cheaper just to eat McDonald's. Family ordered a burger, very greasy, bun was soggy from grease. Macaroni was good. Tea was good. Again, service was great, i believe his name was Ken. Did not complain since we were satisfied with service and did not want to make him go out of his way. BUT it was the worst $60 spent on food. And we did not realize they ONLY had a 91 rating until we left. Explains the food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mlj0x382FAcsBzQQak_SDA"
  },
  "7ThYmv8QhCzY5WpQOlFFPQ": {
    "date": "11/30/2017",
    "text": "Just ok, very typical sports bar. The food is good and the service is decent. They have a large variety of beer and liquor which is always good. No much to say about this place. Its typical. I did love their tavern chips and cucumber wasabi.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "17TiV5o3EsIIbyFgSpBmXg"
  },
  "JOg6vljwhyw-uDyTxJP2QA": {
    "date": "3/10/2019",
    "text": "Great service and awesome food. I stopped in really late and wasn't expecting the all around quality experience I received. Emma was an amazing server, and the other staff stopped by and checked on me. Very friendly staff. I would highly recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TJ56lG4GwztqPYcPyCS4kA"
  },
  "X71e71wYO-7HeXM6BUF5yQ": {
    "date": "3/9/2019",
    "text": "Ordered this with door dash & everything came as we ordered. There should be an option for just a Cesar salad and add the protein. Instead it gives you an option to pick the items for your salad (lettuce, toppings (6), cheese, dressing, only gave 2 small containers). The crab dip appetizer was good but the onions needed to be diced fine as opposed to chopped, the bread crumb topping should have been sprinkled on & not topped so heavily. Overall the food was good just some minor adjustments that could help make the dishes better in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UMYKT_1RtpSZBe1WPyjWKA"
  },
  "l1g3Cs2Ya2AKhvLaaC8bnA": {
    "date": "3/1/2018",
    "text": "I ended up at Hickory Tavern for my cousin's birthday dinner. I expected bar food and big TVs, and that's essentially what we got. I was a little thrown off when my GPS led me past Northlake Mall to Harris Corner, because I initially thought the restaurant was in the shopping center adjacent to the mall, but that's Fox and Hound. Not Hickory Tavern. Anyway, my experience at HT was super underwhelming. Our waitress really tried her best, but it wasn't enough to overcome the rest of the experience. First, the drinks from the bar seemed watered down. I'm not one to expect a double pour when ordering a single, but I also don't expect to order a gin and tonic with hardly any gin. Nobody at the table was pleased with their drink, except for folks who ordered beer and wine. Next, the food. I ordered the wing entree, with tater tots. The tots were room temperature and bland. The wings were ok, but by this point I was a little over the whole thing. There are too many good restaurants in Charlotte to eat mediocre food. I wouldn't go back, but if you decide to go, stick to beer/wine and don't settle for cold tater tots lol.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ypyfzo6NpXMKl9tTujvJwA",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. Wings and tots",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ypyfzo6NpXMKl9tTujvJwA/o.jpg"
      }
    ],
    "user_id": "dpT-xCPugNXyZX6K49xNiA"
  },
  "lusMZYfcKGVk6L9ZSI_jzA": {
    "date": "10/1/2018",
    "text": "Pretty great place for a set down lunch. They have a great salad selection and the calamari is delicious! I have been here a few times and they seem pretty consistent. It is a typical sports bar. The staff can look a little overworked at times but they always get the job done.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BHvXPYsg1KR2jfdimEDH4A"
  },
  "U4AzmnmlSXoIB9v3Tjmgbg": {
    "date": "5/11/2019",
    "text": "Food was not good. Wings were DRY just like the service. We had to ask for things more than once and it was slow. Service was slow. Will not be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sVBFoozAjKtCh0oAKBN_ZA"
  },
  "xeW3bo7sf-yAawfPcO7bxQ": {
    "date": "11/12/2018",
    "text": "Brunch menu && $4 mimosas/bloody mary's on Sunday. Perfect for a quiet Sunday meal && some football.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vh6OA9r2-BU_YrSaqcQ4rA"
  },
  "-P2vocMVvkOTO9Bvev_VGg": {
    "date": "10/20/2018",
    "text": "Food is typical bar food. However, I did have a salad which was pretty good. The service was better than most for a bar and grill. They have plenty of tvs for watching sports. I would say give it a try for the atmosphere and drinks, not necessarily the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FypMc_8K0avmxY6GfURa_w"
  },
  "3njgTxc_fcBP-ijx3QIsBA": {
    "date": "1/10/2019",
    "text": "Terrible service. We were there over 10 minutes, sitting in front of about 4 servers, and the manager at one point, before anyone came up and offered to get our drink order. Then about another 10 for them to actually arrive. We never got silverware. I had to get up and ask another server for that.  Never got any napkins, until I specifically asked for them. All I had was one napkin, which came with the silverware I also asked for, and I was eating wings. A friend of ours ordered the bucket of trash and he had to ask for the empty bucket and the utensils to eat with. Ordered a second drink and they did not bring it until we were about halfway through the meal, no water had been offered, either, so he had nothing to drink while eating during that time. Wings were very skinny, almost no meat. Had I known that, I would have ordered more to account for that. Definitely not a good experience. Doubt I will go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "izf5tA6JYs-vcYG-C5c2Wg"
  },
  "i4nwrDMMREuKYSjUTKD3Ew": {
    "date": "8/19/2018",
    "text": "Decent spot. Was in town for a meeting and had some hot wings that were pretty good. The beer selection was great as well. They have quite a bit so a good beer menu would be nice. The waitress was really attentive and she had a ton of customers so she did really well. I would definitely head back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WmUrzQWrMe3gqQpbPsyPIg"
  },
  "Rm4Lbhl2791GDn3HJbfnBw": {
    "date": "1/19/2019",
    "text": "Horrible service Don't waste your time going here. We went on a Saturday night, not busy at all (just a few guests at tables & a handful at the bar). Waited several minutes at the hostess bar to be seated Was seated right beside an adult birthday party table of about 6-8 guests even though the entire restaurant was pretty bare/vacant, but didn't complain. Sat at our table looking over the menu for 18 minutes & NO ONE ever came over to greet us, take our drink order or anything. We never saw a waitress come out to the table beside us either. Asked the hostess if she could move us to a better wait staff area & she acted as if that was such an inconvenience so we left instead. Will not be back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TUgrQig1E5_OcEqFAV5S7g"
  },
  "ekNG8r-Msv376s7OO3Yjgw": {
    "date": "7/28/2018",
    "text": "This review is about the customer service I watched while waiting for our food. Which took almost 30 minutes for nachos, a po boy and a kids burger. Now our server Jade, seemed like she didn't really want to be here to work, which i completely understand. But we watched 2 tables walk out on her shift. There were no, sorry I'm running behind, etc etc. just completely ignored them and just shrugged her shoulders after they both went to the hostess to complain. Being in the customer service industry, I know we work for our tips. I guess she could care less.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GuWp17ayZJvxa2Ye4wG00w"
  },
  "Y35jBA8NB1ZyzENqXICMAA": {
    "date": "6/23/2018",
    "text": "Done with hickory tavern, had a long week at work so wanted a good supper. I used their online service ordering a po boy plain, wife runs in to get it and receipt says nothing on po boy but when she gets to the car there's everything on it. The manager krista was very rude and I get to go without supper. I have always had good service at all the hickory taverns but service here sucks",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "77rM1a8Di5XdFoeOFwr9vw"
  },
  "qqAib47sPlAEXZiZ26ba5w": {
    "date": "12/26/2018",
    "text": "They always mess up our burgers. We've gone three times every couple of months and every single time my husband and I have to switch burgers. They make his well done and mine medium well. Just once I would have like to get a mushroom and Swiss well done. Plus it takes longer than it should to get the food out. Not going anymore. I give up.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Suvpo_VkCWSy-BCSx0U4lw"
  },
  "GrFU7QduRHlvK7y9fi6nTA": {
    "date": "5/31/2018",
    "text": "Ordered food from here the first time through Postmates and the artichoke dip was amazinggggg and so was the other food i ended up going again the other day with a coworker and dined in and had the fried Calamari it was to die for first time trying it and loved it the blackened fish sandwich on the other hand was mediocre but overall good experience",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7xu6xWS4Mn0bP6KD4Dclgg"
  },
  "LbWeedxFTVhwtrOQ5N1nWQ": {
    "date": "4/30/2015",
    "text": "Haters gonna hate, but it was it is.  I called a little after lunch and talked to the manager.  I asked if they would have sound for the game 7 of the NHL.  He said, yes, no problem, as long as someone else hasn't asked for sound of another game first.  So, I tell my buddies to come along.  With that in mind, we get there early.  I ask about sound and the server said, sure, we've just got music playing, shouldn't be a problem.  She takes our first beer order and goes back to talk to the manager.  She comes back with our beers and being a polite person, and the game hadn't started yet, I didn't ask about the sound.  We wait and wait, still no sound in the game.  Our server comes by one more time and we order another round, she said she'd check on the sound.  We get our beers, and never see the server again.  Nor the manager.  I eventually just left cash on the table, no check ever came, no sound, absolutely ridiculous and just plain out rude.  The manager could have at least come by with a BS excuse and pretended we existed.  I could have just as easily watched the game at my house, but friends wanted to go out.  We won't ever be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uUp2y5VTJ6F9Bmlg1Om42g",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. A restaurant that serves food based on food trucks instead of vice versa? Interesting.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uUp2y5VTJ6F9Bmlg1Om42g/o.jpg"
      }
    ],
    "user_id": "wnFWoQ63F9-ohUQ-C0AeIw"
  },
  "GWzu6yZTnCXkfMwTHWStUg": {
    "date": "12/7/2018",
    "text": "Joined my family at Hickory Tavern on Thursday, December 6, 2018 for what we call \"Seafood Night\". On Thursday nights, you can get Oysters for $1/ea and Shrimp for $.50/ea. Typically you might not expect quality seafood at such a great price. But this location of Hickory Tavern never fails. It was awesome food and service per usual. Our incredible server, \"Brenda\" was poised, professional and FUN. She made menu suggestions that we were happen to order. Great food, clean environment and SUPERIOR service! What more could you ask for? When visiting Hickory Tavern, I hope you are lucky enough to be seated in Brenda's section.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "44QaaqEpIbuX7g294ieP1A"
  },
  "B73WzDYMFI38QEQM5H_Hbg": {
    "date": "6/10/2016",
    "text": "This place has its positives and its areas that could use improvement.   As far a positives: they have live music, billiard tables, $3 draft pints and tater tots. Who doesn't love a good tater? We also had great service.   Negatives: the burger didn't have much flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oJC1Sb4wEZKlLwtLu_VcXA",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. Tavern burger with tater tots",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oJC1Sb4wEZKlLwtLu_VcXA/o.jpg"
      },
      {
        "img_id": "h_ax8oZXVqTbyN7k_dDPyA",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. Wing entree with a side of asparagus.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h_ax8oZXVqTbyN7k_dDPyA/o.jpg"
      }
    ],
    "user_id": "hO7NoN7bBAc7E0tr4Ge0-g"
  },
  "x4z6P-fWylV_MnyP7rFsAg": {
    "date": "7/29/2017",
    "text": "Great food and atmosphere!  Try the shrimp and grits and grape salad. Great place to watch the game and play pool.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IrujQsGtOQOwH1G-eJyyQQ",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IrujQsGtOQOwH1G-eJyyQQ/o.jpg"
      }
    ],
    "user_id": "K9Q786jxFgRbtlJbSsWicg"
  },
  "GCWOwcN3OafIY098qu-5NA": {
    "date": "8/19/2019",
    "text": "I usually get the blackened shrimp tacos at other hickory tavern and this location was disappointing. The service was excellent. But the tacos where just sad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x5Z0VwxDDiQ0louthXjysA"
  },
  "8RqVQkLC9GA2X0_832GCtw": {
    "date": "5/5/2019",
    "text": "Pitcher of beer $20!!!! Holy cow!!!!! Food had little to no taste. Service was fair at best.   Won't return,",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xGVed085c5Wpm4SJVPYGoQ"
  },
  "-xrSdyBlTfKfvMnr3f4pfQ": {
    "date": "4/24/2019",
    "text": "I was with a group and had to pre order so I did my research and I settled on the skirt steak, medium rare. When we arrived, the service was good. When the food came out, all of the food looked much better the pictures online. When the server came with mine, he stated, \" I know that you ordered it medium rare, but we cook the steak in the morning and all we have is well done\". I looked at it and it was well done and already sliced into pieces. WTF, did I order a kids meal?  So, since I was with a group of 25 and being one of the last to get my food, I did not make a big deal as it will not be my last meal, but it will be my last visit to the Hickory Tavern.   FYI, my best guess is that the steak is cooked in the morning and microwaved when time to serve. What a poor way to for a restaurant to serve steak.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "coesOMruvs9P-j70L3QZpQ",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. This is the skirt steak. Not edible.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/coesOMruvs9P-j70L3QZpQ/o.jpg"
      }
    ],
    "user_id": "5ZFGnaIS4wq-j08pu5khEA"
  },
  "fdnWGzH-PS04_VPPJetWAA": {
    "date": "11/15/2018",
    "text": "Late date night eating  It was cold outside but we managed go find a place to sit not under fans. Server was nice and gave good recommendations. They have a lot of TVs and also a private room. Food was tasty and did see other things I will like to try.   The food and drink menus need a good cleaning and spirit drink straws need to be even. Thus the star deduction.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9TeXccsv5iQqSzTueV3BBw",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9TeXccsv5iQqSzTueV3BBw/o.jpg"
      },
      {
        "img_id": "_Ql8FstTqBoWRBWuNBNjkg",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_Ql8FstTqBoWRBWuNBNjkg/o.jpg"
      },
      {
        "img_id": "WnWq6uLK56iY5uXsf0zoag",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WnWq6uLK56iY5uXsf0zoag/o.jpg"
      }
    ],
    "user_id": "YZZaaZGdZ08L1h3XWPrwJw"
  },
  "cSJIlmdMWvh3vwtOE32Yng": {
    "date": "4/22/2019",
    "text": "Came here on a Sunday afternoon, sports on the TV and place most empty. WOW this place use to be the IT spot guess it's not anymore.  It was very dull boring and lackluster.  I ordered a togo.order at the bar. Chicken wings should not take 30 minutes.  Sat there and bartender never off7me water or asked of o wanted to order any alcohol.  Anyways this will ne my last time here. Wings were just ok, nothing special.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "JXdhEf_hg3-SMjs1Qwbtyg"
  },
  "31imRqBM21yAfRvmb_04ww": {
    "date": "4/24/2018",
    "text": "Overall the food was average. Definitely nothing to write home to your mom about.   We arrived shortly before the dinner rush apparently. We were seated quickly but the hostess set us right next to an older gentleman who was reading. And out of all the empty tables - I didn't understand why she did that. I had a kid with a tablet. I think understanding your customer is important but whatever.   We ordered a couple of appetizers to start - the tuna poke and onion rings. Okay - for $12 I was mad about the tuna poke serving. It was legit small. Taste wise it was okay. Not a lot of seasoning.   The onion rings were okay too. (I think you'll here that about most of my food). It came with a little tiny cup of dipping sauce. We asked for another and never received it.   My son's kid meal sweet potato fries had some kind of simple syrup glaze on it. Yeah, he wouldn't eat it. I tried it and it just didn't need it. Sweet potato fries are naturally sweet - why ruin it and make them soggy and add unnecessary sugar?   I went with the honey bee sting chargrilled chicken wings with a side of broccoli. I think the plain steamed broccoli was the highlight of my meal. I had two friends tell me how amazing these wings were - yeah no. They were pretty bland.   My man ordered lemon pepper chargrilled wings and they were completely inedible. Super salty and gross. We attempted to complain to the server about it - but he brushed us off.   We waited a good 15 minutes just to get our check after we asked for it. And then our server wouldn't even get the payment. Some lady came to our table and snatched it from our table.   I could have complained to management but I was tired and annoyed and just ready to go. Definitely will not go back.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "SG2RUUNOK5aLlUoObvJSFg",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SG2RUUNOK5aLlUoObvJSFg/o.jpg"
      },
      {
        "img_id": "ccW6d9BViNIoiRtuIWv71A",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ccW6d9BViNIoiRtuIWv71A/o.jpg"
      },
      {
        "img_id": "d5hWiiFGaA4yBqawnQJF2Q",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d5hWiiFGaA4yBqawnQJF2Q/o.jpg"
      }
    ],
    "user_id": "U0WU9d6gpMNkO_tPXK58Sg"
  },
  "gXgAmDMRBrGOAnv3u_63qQ": {
    "date": "5/8/2019",
    "text": "Staying in the hotel next building & didn't want to drive .... yelp gave 3*, I knew it would be risky ....  Brave I was, I ordered raw oyster & char wings !!  Beer selections was good 3 IPA on tap  The oyster were gulf oyster, I always have reservation on gulf oysters since the oil leak, these weren't bad but they weren't good either.  Texture was fine, but it was so clean and shinny I suspect they were rinsed, I am not against it but not good practice for North eastern oysters.  The real problem was they were tasteless, somehow no oyster taste/flavor for the ocean breeze.  The char wing was like what it said char, if you like char, get it.  It was a bit novelty for me, so I tried, probably won't get it again.   Overall experience was fine, I set my expectation according to the yelp overall rating and I manage to enjoy the time there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6QmKBoRfb5QCD3K1Mj3Vjg",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6QmKBoRfb5QCD3K1Mj3Vjg/o.jpg"
      },
      {
        "img_id": "10-6ZblGTwFYHY7vz6k8xQ",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/10-6ZblGTwFYHY7vz6k8xQ/o.jpg"
      },
      {
        "img_id": "FLJCLIH_toLgs489VhYPVw",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FLJCLIH_toLgs489VhYPVw/o.jpg"
      }
    ],
    "user_id": "5SLlPzF9WxaKe0aHQuxhtA"
  },
  "wrOtJ_excVZsMtU1-rS54w": {
    "date": "7/18/2019",
    "text": "I have eaten here a dozen or so times in the past 2 years when I visit our Huntersville office. I have always sat at the bar, so I can not comment on the table service. The bartenders are always attentive, the beer selection is very good and there appear to be a decent amount of regulars. Beers are cold, and depending on the bartender working the service is pretty good. The food is average or slightly above average. The grilled wings are my staple. Tossed in honey bee sting is my favorite flavor. The will get are good, the other entrees I have ordered are on par with a Friday's or Applebees. Nothing special. Atmosphere is good and the service is better than what you typically get at a chain. Several TV'S and pool tables.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mBZReGogv93Hxw0gJXhK_A"
  },
  "LEIqCDHvY0V_gY4zfabZ6g": {
    "date": "8/11/2019",
    "text": "Wait staff fair. The food was great, good cooks. My husband had wings. Never offered any additional napkins. No additional plates offered for sharing appetizers. We had to flag them down to get additional beers. A lot of wait staff running around in circles. Need guidance and direction. Maybe observe how the one in Birkdale operates.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZMQycjswdDZ24_1KwaHHCQ"
  },
  "GXn_VyJMbIzd-WROLxm_8w": {
    "date": "2/15/2019",
    "text": "Calvin from Denver, CO   Shout out to HICKORY TAVERN HARRIS,  Manager -Donna, Hostess Ms. Sandy and the ENTIRE HTH staff. You all are SUPER AWESOME. Thank you for helping make my Surprise Valentines Day Marriage Proposal to the Love of my Life an Epic and Memorable Night. My Fiance, her family, my family and myself will never forget February 14, 2019.   If your traveling to Charlotte and you need somewhere to eat or even plan an event, I highly recommend HICKORY TAVERN HARRIS as your 1st choice.  #THEBEESTINGWINGS are the absolute greatest. #ShestolemyFRY!!!! #Shestolemyheart #SheSaidYes",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IToQbsCzSqsxAkGbP2fFTg",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. Hickory Tavern Harris Fry in the Box. Have to go there to hear the story.. 02/14/2019 Marriage Proposal",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IToQbsCzSqsxAkGbP2fFTg/o.jpg"
      }
    ],
    "user_id": "Obp8hSBNGl6ycYSZmgfQdw"
  },
  "HZ4Q_Ihobi4zYTe3yuGYNA": {
    "date": "8/16/2019",
    "text": "The food and service was outstanding tonight! Our server Rebecca was awesome and provided immaculate service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ep3UaBB6ipPY1oHFrMW8kQ"
  },
  "T9AWhFVmInOLjHw3luG9uA": {
    "date": "2/23/2019",
    "text": "long drive up from the beach and feeling drawn out and snacky. got in and seated promptly, asked for hot tea and a minute to decide... we started with taters and since it was Monday we did the BOGO-Burger special: one tavern, one veggie. Shredds were an interesting dish somewhere between hash brown-hush puppies and tater tots topped with scallions and sour cream and dipping sauce beside. good crispy outsides and steamy moist potatoey insides. put these in a dish with cheeze whiz and and brown gravy and you've got great Stanley Cup treats, eh!? Basic tavern burger was basically good and the fries were too; hot and flaky. The cutest of chicks was not impressed by the veggie burger (not 'meaty' enough, go figure) but a great fan of the tavern chips.  Not a meal for the ages but satisfactory by all reasonable standards so no complaints. Service was prompt and courteous, attentive but not hovery. A good solid performance by everyone involved. much more taverny than the birkdale property: several pool tables and other games of skill to amuse patrons while they consume moderate amounts of alcohol during a reasonable time frame.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Z7pFsGpIyLzMTZsXjTFF1A"
  },
  "Auutn33u2gNe5h7okckeFg": {
    "date": "9/24/2018",
    "text": "This place is one of the few options you have in the neighborhood, but luckily it would be great even on the busy restaurant street. The staff is always friendly, the food is very good and the bar has so many drink optionss you can get anything you need. They have a place for private events, tvs and game area and the sapece is open and airy. On top of all, they have an outside seating area which is cute and so many specials during the week, you'll never get bored :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q2pFg6N1Ur-8IgQ9MExIcA",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. Flatbread with steak :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/q2pFg6N1Ur-8IgQ9MExIcA/o.jpg"
      },
      {
        "img_id": "dFaAGpxz_pLNY9gvx2WtOQ",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States. Bloody Merry for 4$ - yeah! :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dFaAGpxz_pLNY9gvx2WtOQ/o.jpg"
      }
    ],
    "user_id": "CzR7QW1LsqkSErPNAHPELQ"
  },
  "CWwaPhG9Omj69nw0ptvg-A": {
    "date": "5/18/2018",
    "text": "Hickory Tavern is a local chain with several locations in the area. All the locations have many TVs and a full bar. The food is very good. Their wings are top-notch and they have a grilled version where they are finished on the grill. Two complaints I have though is that they don't have an habenero or extra hot sauce. They also don't give you very many celery sticks with the wings. With that said they have a diverse menu and their food is really good for a sports bar. If you're in the mood for seafood they have \"bucket of boat trash\" and steamed oysters. They also have fish and fish tacos. On Thursdays the oysters are on special for one dollar each and it's also three dollar draft beer night. That's why Thursday is my go to Hickory Tavern day!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "_CQetImJGo97dAIM0fjsSA"
  },
  "Yp_aVTBbZPR-pEg4IrIWhg": {
    "date": "6/7/2018",
    "text": "Late Tuesday night dinner.  Blackened fish sandwich was surprisingly huge!  Good flavor, same True for the charred, extra crispy wings w honey hot sauce. Fries were chunky and yet crisp. Friend got the Ruben, and really liked it. I believe this locations food is hit or miss. We went last week for a late Saturday night dinner. The mini filet steak and shrimp for 19.00 was a serious disappointment. Steak flavorless, over cooked (med rare) and the shrimp had no seasoning & a freezer flavor! Nasty  But always like their burgers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8R7YQrcWqc72_IBbWgaJlg"
  },
  "sm9PTWHq6sjOz9HWDBxfBg": {
    "date": "5/14/2018",
    "text": "Monday night is buy one get one burger night! Can't go wrong with that. Burgers are great.. tots meh. Typical bar food with an okay draft list.   If your looking to watch the game it's a decent place, fried food & burgers/sandwiches is the go to here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FhqgZHUjzV6x9uYNs05Q5A"
  },
  "Hw71GlTlVD_pE-CcNLCTLQ": {
    "date": "4/23/2019",
    "text": "6 adults are for $101 before tip and including an appetizer. Good food. Nice low light ambiance inside. Tons of TV's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zQ4yz8MWFZf5MMr3bNdOuw"
  },
  "v-C-KuC3Ff4NOulCEyHUqQ": {
    "date": "3/24/2018",
    "text": "This is your average casual food establishment. We were greeted by some nice hostesses and quickly taken to our table. The table was a bit dirty with trash around the floor but we still sat down. We started with the spinach dip, which was pretty good. However, my kids order the chicken tenders and they were greasy and the chicken was tough....ugh! My husband and I ordered the Philly cheesesteak and the smokehouse burger. Those meals were delicious! We will go back on a drunken night but we won't be regulars!!!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mXFLyAVAr6YI17zf_AcDVA",
        "caption": "Photo of Hickory Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mXFLyAVAr6YI17zf_AcDVA/o.jpg"
      }
    ],
    "user_id": "j6c0PKCAHiR6tI2EqZByow"
  },
  "98gBGGlApIUazC_XbnWA4w": {
    "date": "1/5/2019",
    "text": "I had fish tacos and it was good if you want a light meal. The tater tots were nice a crispy, but the spicy ranch was just ok. I also had some of the house made chips, and they were more soft than crispy. Veggie burger was ok - it looked like a frozen patty. Beer was cold and the brownie sundae was probably our favorite part of the dinner.  Place was full but service was fine. Game was on and it was nice to hear the game instead of music.  Overall ok place to eat if you're just looking for something simple and quick.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aAqoYPlM00RnmJsQ3egpmA"
  },
  "GJtsqZtyAk6i75wDIGHC4A": {
    "date": "2/16/2019",
    "text": "The server had no personality and couldn't make eye contact with myself or my date.  Ordered a long island for $10 (which was all sour mix) and the filet medallions.  The steak (their most expensive cut) had gone bad; it was literally rancid... and my brussels were black and burnt.  I called the manager over, who was courteous and helpful, to exchange the rotten meat I'd put in my mouth for the salmon.  Although the salmon was cooked well and this time the brussels were not burnt, the manager confirmed that he tried the second, untouched medallion, and it was indeed rancid.  I paid FULL PRICE to an establishment that served me rancid meat.  NOTE TO MANAGEMENT: if you allow a guest to chew and swallow rotten meat on your watch, you comp ALL food items (I'll still pay for the overpriced sour mix)  This place was a favorite of mine many years ago, but it's obviously gone down hill and is now too concerned with food/liquor costs to provide an acceptable meal/drink.  There are way too many quality restaurants in Asheville to waste your money here.  I've had better steak at Chili's.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pVXf3NXMBlZ_m3Fg9AHK9w"
  },
  "jbYhT3DVxsr9RWdIuCMilw": {
    "date": "5/11/2013",
    "text": "I planned a get-together event at the Hickory Tavern Northlake for our wedding weekend on April 27, 2013. I initially wanted to have the event at the nearby Fox and the Hound, which I was very comfortable with, but the Hickory Tavern was more conveniently located next to the Hilton Garden Inn Northlake where our guests were staying.   To ease things on the restaurant, I called the Hickory Tavern Northlake about a week before and let them know I would have a big group of at least 25 people arriving shortly after 9:30PM on Friday, April 26.  About eight people from the group arrived at 9:30PM, but the majority of the group and I were a little late because our rehearsal dinner ran longer than expected. I got there around 11:00PM and the majority of the guests got there at 11:15PM.  When I arrived, I was happy to see a big space near the bar with tables that our large group of 35+ people could enjoy. As I was greeting everyone and saying hello, I thought things were great. However, I quickly became frustrated as soon as I wanted a beer and could not get any service. I waited for our server for several minutes.  I tried to go the bar to order a drink, but because I had said hello to my group of friends already at the tables, the bartender said I was not allowed to open a tab unless I was going to sit at the bar. I never got a reason on why this was the case, but it was very frustrating. I finally got my beer from the server after several more minutes. My fiancee arrived a few minutes later and we had to go through the same ordeal.    As the rest of the group arrived on the bus, the problem became extremely obvious since no one was able to get a drink. Everyone tried the same thing I did in going to the bar and each was turned away as soon as they said they were with my group. Seeing their frustration, I went to the bar to figure out a solution. They were not willing to work with me. I ended up having to express to the bar tenders that our group of 35+ people was going to have to leave and get service somewhere else if the situation did not improve. We kept talking with no progress, but eventually a manager came over. The manager assigned us several more waiters, which eased the frustration in our group. The waiters did a great job and provided adequate service, but it would have been a lot easier if the bar would have allowed service there.   As a result of my experience, I would not recommend Hickory Tavern for large happy hour or drinking type events unless everyone is planning to be seated at the bar or at one table. Unfortunately the bar only seats about 15-20 people. In general, you should not expect their bar environment to behave like a typical bar, even in the 11PM - 2AM time period (the hours that we were there). We had a perfect wedding weekend and this was really the only stress or disappointment I can recall.   I cannot comment on the quality of their food or dining.   Sincerely,  Jack Michel Jr. Charlotte, NC",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WIZm3lOslbYVL70hBzbWvA"
  },
  "v8dYMrl50FFjAiOuVNEK6A": {
    "date": "1/4/2012",
    "text": "I went to this location to eat one evening.  The waitress was great the food was okay.  I prefer the Arbors or Gastonia locations.  However, each is consistent in the staff is very friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "deVz7CbX6fUp12x690FQNw"
  },
  "jUy_CWAjqaYOvsWlnh56sg": {
    "date": "2/10/2014",
    "text": "How come the rating is so low??? How can you not love this bar???!!! They always have a great beer selection and awesome monthly drink specials.  The new food truck menu is amazing (reminds me of home) and the shrimp and grits are to die for. Seriously! If I was on death row hickory tavern shrimp and grits would be my last meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kWYzYDvVGJ68X238LpgQmQ"
  },
  "9JSBsZE_kYBW5v2TSiqDVQ": {
    "date": "11/8/2014",
    "text": "Great food, fun atmosphere on a Saturday night. Hostess and wait staff a little off, but overall everything was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "awxgEIA_5fcTLi-cQHzHbg"
  },
  "Zf77zcMghwvdSy7ywg2DcQ": {
    "date": "1/31/2015",
    "text": "Me and couple of friends went to this restaurant  to watch the Panthers vs Seahawks football game.  The restaurant was packed with 85% to 90% African Americans.  The restaurant had a waiting list and we was waiting for a table to come available.  As we was waiting to be seated,  an unknown white couple came to me and my colleague and advised that they vacated a table in the bar area and we can have it.  Our stay at that table was short live, we were advised by a RUDE BLONDE waitress, advised that the table reserved a white couple  and we needed to get up now. We got up and we started talking to some of our friends at a nearby table. The general manager approach me and my friends and advised us stop \"hovering over the white customer's table and we needed to go back up front now or he was going to call the police.  The general manager didn't want hear that we was talking to our friends at a nearby table and not \"hovering over\" the the white couple's table.  The general manager called the police after requested his name and a business card to file a complaint.   We spoke with the police on the outside of the restaurant and advised them what happened and the officers could not believe that they were called out to Hickory Tavern Harris Corners Pkwy for that bogus call.   The general manager over reacted to a couple law a biding customers that was trying to watch the Panthers vs Seahawks football game.  I will never patronized with Hickory Tavern again until they make this right with me and my friends. 5 thumbs down!   I reluctantly use the race card, however, I truly believe that myself and my friends race, African American,  was determining and deciding factor as why the general manager elected to call the police.   I am not sure what management training the general manager went through to prepare him for that role, however,  he failed in a major way. Question: If me and my friends was white, would the general manager would have called the police?????",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "X3s7aALWM-7NzwqfZxim7w"
  },
  "01ggIN-0TR7LUp9AI0jtcA": {
    "date": "5/18/2012",
    "text": "I'm surprised to see all the reviews mentioning slow/bad service. I've always had great service here, even when the place was fairly busy. I don't often go on NFL Sundays or for real big sporting events, so maybe that's the tough time.   Food is mostly good in my opinion. Nothing incredibly special, but I have always gotten what I expected! I will continue to visit fairly regularly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZOuJ4rk5uiysEqCIstDDIg"
  },
  "dAnjaHMTD2i-uZimcHsjag": {
    "date": "12/29/2015",
    "text": "I ate here twice with a group and loved the salad as you choose what you want on it and it it's cut the way you want so you don't end up with lettuce hanging out of your mouth and I added salmon of course. The atmosphere was casual too me like a noisy dorm group room with all the tv's going. Little pricy for every day but worth the money. It is one place for me to consider for Super Bowl Sunday.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N6xlaJIGa6WoJ0yJG4ROGw"
  },
  "v6qV-uZ-PEekeaZ1UDmsUQ": {
    "date": "9/11/2010",
    "text": "Big screens? Check. Novelty sports memorabilia on the walls? Check. Giant booths suitable for big crowds? Check. Ability to make a decent burger? .............   Hickory Tavern is one of those places that is all for show, with a no-go on good food. Ordered a Honey BBQ burger, and the waitress and the courtesy to ask me how I wanted it cooked. Apparently the chef didn't feel like obliging her, and sent me out a well-done burger instead.   Apparently a Honey BBQ burger is a regular burger, with a side of honey mustard and a side of bbq sauce. Looking at them, I was skeptical to mix them on my burger, so after experimenting on my plate I did discover that no, sweet and spicy honey mustard and smoky bbq sauce do not create a favorable taste once mixed together. En short, I could have just gotten a regular burger.  I was delighted that instead of just fries or chips, I could get a side of steamed vegetables. Unfortunately, they were soggy and completely tasteless except for a twist of pepper and a sad attempt at a garlic chunk at the bottom for flavoring.   The person I was with got the teriyaki chicken burger, and while the chicken was very moist and well cooked, this thing must have been marinating for a hell of a long time. The teriyaki flavor was almost overwhelming, and extremely salty.   Maybe their more expensive meals are made with more care. But if you advertise yourself as a sports tavern and you can't make a good burger, that is a complete out for me. There are plenty of local places where you can watch the game that are cozier, more personable, and know how to actually make a burger to a customer's specifications. For two people, I wouldn't waste your time on this place.  Er, the Woodchuck was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "7bwh6A4cl8DqZV44kAjWjA"
  },
  "L5SVGYxUSUwxdRBVsIX58A": {
    "date": "1/28/2015",
    "text": "5 thumbs down for this Hictory Tavern location!!!! First of all the waitress was rude to  the customers. She was loud and argumentative with some guys standing next to me. Secondly, my food was not cooked properly and I \"thought\" the waitress was bringing  back a whole new entree.  Nope..she returned my same \"picked over\" burger back to me fully cooked. ( Major food violation) Finally you would think the store manager  ( Tom Blake)  would be trained to handle any/all store issues right? Sad to say.. Tom's way of dealing with a overcrowded restaurant is to call the police and LIE by saying... folks are  causing trouble  and refusing to leave the restaurant. ( Not True!) I sat at my table and watched the whole incident. Those guys was not causing trouble nor refusing to leave! Anyways, I can go on and on about how awful this location treats customers! Honestly, I almost thought the staff was drunk that night! Because I have NEVER seen this type of behavior/crazyness from a restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XnI0xwEm0bagZPI06bpc9w"
  },
  "CZ7Rip5hUe768tzfJmzIZA": {
    "date": "2/18/2015",
    "text": "I was led to believe I had a reservation for a corporate seminar event booked in their private room.  I called and they told me they had me down.  Then I went in the first time and they assured me it was reserved, we would do a contract as we got closer.  I found this odd, but we had booked the same event the year before and there had been no problem.  Yesterday, I called with some planning questions.  They told me they weren't holding the room and if I wanted it, I had better get in and do a contract ASAP.  So today, in went in to do a contract.  The GM, Tom Blake informed me that they had a weekly group that used the room every week on that day and I needed to find another place.  I am very frustrated as I had already sent invitations with their location on it.  But, I understand people make mistakes sometimes.  The reason it is one star, is because Tom was an unbelievable jerk.  He could not care less or deliver any sort of an apology on the matter.  This man has a nasty attitude problem and lacks the basic people skills that should be required of his job.   I have already rebooked my event at another similar restaurant close by.  But I will not soon forget my horrible experience with this GM and I will never dine at Hickory Tavern again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vi0lg2JVV_yNDF-vmweuow"
  },
  "7cCta4CEuQ6EK_zhoIH5lg": {
    "date": "4/5/2011",
    "text": "This place is right around the corner from work so a lot of my coworkers have deemed it the Friday Happy Hour location.  The service was alright, they always have 3 ESPN channels on, and their beer selection is mediocre.  Super uncool: my beer glass was incredibly not clean. How does a bartender not look at the glass before pouring a drink? It makes me cringe thinking about it.  I would set this place to a 3 stars, but the glass thing (a week later!) still makes me cringe.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "52BSd0kY8AndWPrybOMMsg"
  },
  "xemidp7HUN-G4ftqfs_mjw": {
    "date": "10/2/2012",
    "text": "We went there in a game night, so there was some brutal noise, but we didn't mind =)   \"An Asian girl\" was our waitress. She was very helpful, very kind and when she noticed we were out of States, she begun to articulate more, thanks for that! Well, food was very good, service was excellent, wine was cheap, game night was actually also kind of fun.  Next night we went back and I asked our new waitress what is \"grits\". She didn't know how to explain so she got me sample from kitchen!  If you go there, ask what is days vegetable :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DAEWT5xMr-s8jkZi7-MvTA"
  },
  "K2YyX0RwvKBF7JkreZnN0A": {
    "date": "9/30/2012",
    "text": "Always an awesome place to meet and hang out w/ friends for a good time.  The food is fantastic for what is really primarily a bar....go for the fish tacos!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6FafMEVexkpqku_cMcZaQ"
  },
  "7dsvVXvZAeyMmYrL4O7DvA": {
    "date": "3/16/2012",
    "text": "Having never been to a Hickory Tavern before but having been to Hickory, NC let's just say I didn't have big expectations. Yes I know they're not related but that's what happens when you name yourself after what I would refer to as an oasis of parking space. Seriously have you been to Hickory before? Tiny stores with gigantic parking lots for such a small town! If they ever have a population boom and everyone moves there, they'll be ready! Anyways back on topic to the actual tavern.  It's a sporty place, TVs everywhere, sports stuff and other things. The food was average bar food. I went on a Wednesday night which turned out to be music trivia night and 50 cent wings night. Alright lets go for the wings then! The hard part is actually getting the waitress's attention to get the wings. Seriously I thought I'd have to tackle her down to put in an order, but I'd probably tackle the wrong one. They all looked similar to me and I asked around the table and no one could remember what our waitress looked like either. After a good while we finally got our orders placed in and wings in front of us. I was just disappointed with my wings. So sad I had ordered a medium spice level on my wings which apparently translates to nonexistent and the sweet Asian glaze that I had selected really needed some heat to balance it out. A quick dunk into the blue cheese dip was a handy solution.  We won trivia night and got a $25 gift card yay! But I don't know about how I feel about coming back here for horribly slow service even if the food is ridiculously cheap.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zZYHZwmBl9Af4pI-aLXBFA"
  },
  "VJ-Pl6Kn6Ipqe1eq4yrOZA": {
    "date": "3/18/2012",
    "text": "I agree with David. Tons of TV with all the games on. Good bar food. Nice open atmosphere. A beer list that rivals that of any bar I have been to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZWxOtnCFZDqcPKbc326xEQ"
  },
  "mQFD3RqyasocFqvESHLYgw": {
    "date": "1/1/2008",
    "text": "Nice sports bar and great wait staff.  Food is very good.  The steak sandwich is a great cut of meat.  The grilled wings are also fantastic.  I especially like the fact they have free Wi-Fi.    What is disheartening is the smoke.  Like most of NC eating establishments the bar area is filled with smokers.  The air handles do a decent job, but your clothes still smell in the suitcase when you get home.  Also, the liquor is a bit pricey so if you can bribe the bartender you get a better deal.    The wait staff is friendly and attentive.  But don't expect to eat on the cheap.  Choose carefully and you will do fine.  I will give it 4 stars when they make it smoke free.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LOwo4HTg7yV2DKfyGPdkGQ"
  },
  "agV8sDk1vKoT_ZFA9FQWHg": {
    "date": "4/2/2011",
    "text": "Stay away from the oysters.  The steaks are not bad (you can do better).  The staff are somewhat friendly, but they mean well.  All in all, if you're ever in Charlotte and you don't get a chance to go here, no worries.  My only suggestion is to go here when you need to meet up with large groups...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KRUSLH6DNOueGAiIDCr37w"
  },
  "-Z8blWsTvrsPvCX_9nFt3w": {
    "date": "8/1/2011",
    "text": "This place was alright, my buddy and I went looking for a good meal and a couple beers and found an ok meal w/ nothing special behind the bar. I don't think i'll be going back to any of the chains. Pricing was about in line w/ what we got quality wise.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HjfRBtGjXNwWWKnD6C-2TA"
  },
  "9ux6n3uWqNpPmFBYeI68rQ": {
    "date": "4/1/2012",
    "text": "The ribeye was great! Waitress haley was nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m1x2cVMCR9YT7QNcXg-pTg"
  },
  "B0vi_7CBz3N34pFB6Bwu_Q": {
    "date": "9/9/2010",
    "text": "The hubby and I went here to meet a large group.  They were easily able to accomodate our group at a super long pub table.  The inside of the restaurant seemed huge and the atmosphere was nice for a sports bar.  They have a pretty decent menu.  I ended up getting the smothered chicken with sweet potato fries.  My food was really good.  The sweet potato fries are pretty amazing because they drizzle some kind of sweet honey butter sauce on top.  The service was just ok, nothing outstanding.  Sadly the one thing that stands out to me for this restaurant was the sea salt hand moisturizer in the bathroom.  This stuff was amazing and left my hands nice and smooth after visiting the restroom.  They actually sell jars of the moisturizer at the hostess station but I couldn't justify spending $25 dollars for it.  I'll definitely be back to this restaurant to give it another try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AwrTMmmK0xu-bFK4Bkd9Xw"
  },
  "0gISxqnVSNb4EpGgVCPIIw": {
    "date": "7/7/2013",
    "text": "Fun place to bring a group of soccer players. Lots of TVs and good atmosphere. It took a while to get our food, but it was 8pm on a Saturday night and the place was packed. The tavern chips are excellent. The California chicken sandwich was good but the bun was so soggy I couldn't pick it up - had to use a knife and fork.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-xF2uQA-fc8Jm-QT3v5vjA"
  },
  "wlq2pAGZmjtMHBe-9kQHPA": {
    "date": "7/20/2012",
    "text": "I have gone to two different Hickory Taverns within the last 3 weeks.  Not much different.  Big screens, TVs...a bar, and a decent menu.  The atmosphere was quiet during the day visit for lunch.  The night trip was also quiet...not too busy.  Service was typical for a bar restaurant.  The servers have to wait multiple tables....so not much interaction.   The food, especially the sweet potato fries, that were drizzled with honey and butter was good.  I ordered a salad with chicken.  I was surprised that the grilled chicken came out on the salad very cold....as if it was removed from freezer.  However the server was very quick to get a fresh salad topped with a very nicely grilled, chicken breast.  very good.  The other thing that provided the \"bar\" feel at one of the restaurants....was ordering bottled drinks (beers and coolers) and not being offerred a frosted mug or glass.  I thought that was fairly standard.  Should not have to ask...should have been offered.  I will return....with family and friends to see how larger crowds are handled.  good locations and good parking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "obxrjNKD6Y1ic7iyXQU7ug"
  }
}