{
  "Bwqh9-sea8dyxPAIs-TnyQ": {
    "date": "7/21/2017",
    "text": "We came into the Waldhorn at about 2:15 pm on July 2 and had a really weird, unpleasant experience. We were starving and I talked my bf into trying this place, I had eaten there once years ago. When we walked in, a very young waitress was at the hostess stand. We said, '2 for lunch'. She looked bewildered or shocked and then showed us to a booth. Soon after an older waitress, then another came out, almost as if they were all circling us to inform that we could not eat because lunch was over and dinner service didn't start until 3 pm. We were like, um, what? Why did she seat us? Then another chimed in that the buffet was still open did we want to eat that... it was all very bizarre, unprofessional and untoward. Needless to say we won't be back and definitely do not recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XivuRnPq3D-K5cPiBTztIA"
  },
  "s0kmUCHBiZzVco00xvbsSA": {
    "date": "4/29/2016",
    "text": "I was really excited about trying Waldhorn. I always forget about it because it's tucked away in Pineville. From the outside it looks really cool. You'd think that the inside would match the outside's appeal, Well it doesn't. I walked in & was surprised to find a very plain setting. BRIGHT lighting, stark white walls, and light brown wood... It's not romantic at all. It looks like a retirement home at night, but uncomfortable.  We started with the beef carpaccio & the potato pancakes with applesauce. Beef carpaccio is one of my all time favorite appetizers, so I was excited. They ruined it. It would've been delicious, but they soaked it in dressing, ruining the texture & flavor. However, the potato pancakes were bomb! It's kinda hard to screw up potato sand applesauce... But hey it was good.  My boyfriend & I spit the jagerschnitzel. IT COMES WITH MUSHROOMS. They do not list this on the menu so if you don't like mushrooms, you've been warned. We picked off the mushrooms ordered a side of the brown sauce (Much better than the Hunter's sauce) and it was very good. Haha it took work but it was good. The red cabbage was delicious.  Now for the only reason this place didn't receive 2 stars instead of 3, their bread pudding is sooooo good, and a great portion.   This is a once a year place for me. I'm really not impressed at all. There are too many excellent places in Charlotte with better atmospheres to do anything halfway.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "MJ4_-xstv9CJFgzd8YFhrg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Amazing bread pudding",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MJ4_-xstv9CJFgzd8YFhrg/o.jpg"
      },
      {
        "img_id": "JWRyn7jXpz8l_q9NJ5ABNQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Potato Pancakes &amp;amp; apple sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JWRyn7jXpz8l_q9NJ5ABNQ/o.jpg"
      },
      {
        "img_id": "aC3QPKf0Mo3MuySwxI6qKw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. The Carpaccio had wayyyyy too much dressing!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aC3QPKf0Mo3MuySwxI6qKw/o.jpg"
      }
    ],
    "user_id": "SWFP-3VMVFkQswmTHwHODw"
  },
  "C3LiwLpNyU0_RAOaXB0S9Q": {
    "date": "11/19/2018",
    "text": "I've given them 2 chances 2 years apart. They suck go to the one in Black Mountain. Food is overpriced, slow loitering staff.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_k78G2SeqWp0R61zERPi6A"
  },
  "bsURqDGOTBFfhg6vDWQ3XA": {
    "date": "11/17/2018",
    "text": "I love this place... legit. I've been going to the Waldhorn since the day it opened its doors, and yes, I'm just now getting around to write about it (don't judge me). The owners are from Germany, hard working, and put there hearts and soul in this place. So what specifically do I like about this place? Everything, from the authentic Schwaben (not Bavarian, don't say this to Frau Muller, the owner!) cuisine (the Rinds roladian is my absolute favorite) to the pretzel rolls they serve at dinner (ask for a side of mustard, which is German, to dip your pretzel bread into, it just may change your life). The wait staff is friendly and knowledgeable. Some other highlights about this place? The Sunday brunch is amazing (think German meets American Fare and had a baby, it's delish) the annual Octoberfest is fun, you can spend your time either inside the restaurant or outside in the tents. Oh, and did I mention the beer?? Yeah, a full assortment of actual beer from Germany, try the Spaten Octoberfest on tap, AMAZING! Oh, and little known fact... if you go during Christmas season (December 1st till Christmas) ask your bartender and or wait staff for the Christmas Stollen. It's an authentic German fruitcake that is made fresh by the owners themselves. Also, on certain days of the week, they have live music (an old guy playing an accordion) who's actually entertaining. We've bought him shots many times, he'll play just about anything for you. The Waldhorn is one of my go to places in the Charlotte area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZUeRfLhblrzKIScSZjeC0w"
  },
  "5BbuTK24jJGTRZBh5E9igA": {
    "date": "4/6/2018",
    "text": "This did NOT compare to Germany (in MY opinion). But in all fairness, I can't say the food was BAD. It was pretty good. My husband had the sausage sampler. I had the Jager schnitzel and my kids had the chicken nuggets (damn kids) Out server, Kristen was supper attentive and sweet. A little pricey for what you get  I would probably not spend the money to go back but I'm really happy I went. I love trying different places to eat. It was a really nice experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t4i3DtUBkEbnqyX3RiGC0Q"
  },
  "i035rFQnZBZYyTJALkowXA": {
    "date": "6/7/2017",
    "text": "Well if you like German food and are in the Charlotte area....come here! My family is from Germany. We vacation there, and I have to say this food is pretty good for being in the states. I would recommend their Sunday brunch buffet because you get to try so many amazing things. My favorite dish they offer is the weiner schnitzel.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ovFBhEt28yMjW6hBBHp_gA"
  },
  "EepWm6XFs2awEmn1Sf4mzA": {
    "date": "4/24/2017",
    "text": "Wonderful atmosphere, service, and food. I have dined here, once for dinner, and once for the Sunday brunch buffet. Dinner will provide you with the more authentic culinary experience, as well as slightly more attentive service--and, possibly, some live German music. The brunch buffet is no less enjoyable but the focus is on the breadth of offerings. All I can say is, \"Pace yourself.\"  Pro tip: If you are seated for brunch before noon, order coffee and start with the dessert trays. (You're going to eat them anyway. No point in delaying the inevitable for mere social conventions.) Take your time savoring them; there's a lot. Next, have a few breakfast items (french toast, bacon, omelettes) but not too much. Then, by time you make it to the lunch dishes (spaetzle, German potato salad, rotkohl, jagerschnitzel, sauerbraten, roast beef) it will hopefully be a few minutes after 12:00 and the town elders will allow you to order a German draft beer to finish off your delicious meal.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "44t9pDdy_Zrqm1o4NE12XA"
  },
  "3oGCyDjVNgRcjpWodvsS9Q": {
    "date": "10/17/2014",
    "text": "Olde German Schnitzel Haus, our local award winning Germany restaurant, closed at the end of August.   I found no less than three German restaurants, while searching on Yelp, and oddly enough they were all exactly one hour from Hickory:  (1) \"Berliner Kindl German Restaurant\" in Black Mountain. (Bookmarked) (2) \"The German Restaurant\" in Yadkinville. (Fantastic, but sadly, now closed as well!) (3) \"Waldhorn Restaurant\" in Pineville.   I have had Waldhorn on my \"to try list\" seemingly forever, so I headed toward Pineville for lunch.  The exterior of the restaurant was beautiful to me. It gave me the impression that I was in for something special. I didn't bother to take any photos because there are already so many on Yelp. The interior is virtually the same as every other German restaurant that I've ever visited, and that's okay with me.  I had every intention of ordering German sausages, sauerkraut, fried potatoes, and German beer, but they had a dish on the lunch menu that sounded appetizing. It was a veal dish with sauteed mushrooms in a brown gravy atop Spatzle, accompanied by sauteed vegetables. This dish sounded good to me so I changed my mind at the last minute. It was delicious, but it was very plain Jane looking, so I didn't take any photos.   I was seated immediately, but it took a good ten minutes for the young male bartender to stop talking golf and NASCAR before he pulled my Spaten lager. When he did get around to his duties, he did a very good job. In a word: perfect pour.  Note: Spaten brewery was started in the year 1397, and it is delicious beer!  This was by far the best German beer that I've ever had, and of course it paired perfectly with German cuisine. I found it to also be deceptively potent.   The Spaten Oktoberfest beer was fantastic as well!  I enjoyed Waldhorn, and it was well worth the hour's drive. This is a great German restaurant, which I highly recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r7Ukq4DPvBiI_UpZVHoZwQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Prost!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/r7Ukq4DPvBiI_UpZVHoZwQ/o.jpg"
      }
    ],
    "user_id": "4FE8md9fMr_jZFNbcOmHsQ"
  },
  "uyHMbN4xzf85YQ0niHGNSQ": {
    "date": "8/12/2018",
    "text": "what kind of restaurant doesn't serve dinner on sunday...what a joke this place is...drove all the way down from concord too... working people have two damn days per week for things like eating out and this place doesn't even serve dinner on one of those two days...i hope this place goes out of business.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ZB3Pcmfb2Jknw2C_oOF6A"
  },
  "o5SJLXSs8h1VG_YMnL9niA": {
    "date": "3/7/2016",
    "text": "Solid German food.  Great sauerkraut.  A guy roams around playing the accordion and when we asked for the Pennsylvania Polka he said...\"you mean the Steelers Fight Song?\"  Yes!!!  That's exactly what we mean!  haha.  Outside of the restaurant is really nice, but inside is a little bit of a let down.  Decor could be updated, and with the accordion player a little kitschy, but plenty of room for groups and a fun, interesting evening.  A small bar with TV's.  Service was good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "Sjtc8THSLDPVQB_7ozxT-g": {
    "date": "10/30/2018",
    "text": "Excellent German food and amazing drinks. Waiter was very informative and they had a large menu of options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfou2W_D-T1py9YZ3j3eCA"
  },
  "Ir6zbjVpYgRtyYTQsd7-bQ": {
    "date": "3/13/2018",
    "text": "What a gem to find.  All the customers are repeat locals, which says something. If you want a schnitzel this is the place to go. Convenient to the highway, and worth a detour.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bqUG_WSHbJlQ4IW0xnNP2g"
  },
  "QnfsHPpcWdCuxA0Uz2LUuQ": {
    "date": "3/3/2017",
    "text": "Today we took advantage of another beautiful mid-winter day, sunny and 72 degrees, to drive down to Pineville, NC, and visit our favorite German Restaurant on February 19th.  Every  Sunday they have a buffet until 2:30 pm so it gave us plenty of time to get here after attending Early Church and Sunday School.  Of course that meant battling either the construction on I-85 or I-77, you get a choice.  We have been to the Waldhorn many times, and have brought business groups here when meeting in the area as well, and normally have nothing but rave reviews for this restaurant.  Unfortunately today was an exception, at least I hope it was.  When we arrived at about 1:00 pm there was plenty of parking, but you could tell from where the cars were parked that a much bigger crowd had been here earlier.  When we arrived we were seated about as far from the buffet line as you can be and still be inside.  I commented to Mary, that will help me eat more as I can walk it off on the trips back and forth.  I noticed a number of tables along the way to where we were seated that were not bussed yet and several that had been cleared.  We waited at the table for several minutes to give a server our drink order before heading to the buffet, and as soon as he left another server appeared and wanted to take our drink order.  She appeared a bit surprised that someone else had already taken it.  From that point on it appeared that neither of them was sure who was to service our table, and unfortunately for most of our time there, neither did.  My iced tea glass remained empty for most of the meal, even though I placed it at the edge of the table where they could easily see it, and both of them were servicing other tables around us.  Even looking our way a number of times.  I tried to get their attention without shouting several times unsuccessfully.  Finally, as we were eating our desserts, one of them asked if I wanted more iced tea!    I truly believe in tipping well for good service, even as high as 35%.  But I will also reduce the tip from 20% when the service is not what it should be.  And that occurred this time.  While we go to this restaurant 6-8 times a year (it is about a 200 mile round trip) it is not enough to be called regulars.  And obviously there were regulars in our seating area and you could tell by the level of service they received and the familiarity between the customers and wait staff.  One time the waiter went to get the iced tea at for the table right next to us and yet didn't come to our table to re-fill our drinks.  As I stated before, this is not the type of service I am accustomed to getting at the Waldhorn in the many years we have been coming.  And, I did make the mistake of not saying anything to the management team before we left.  And while the service was less than acceptable, the buffet it self was not well maintained.  Twice dishes were not available at a station, and refilling the buffet items was very slow.  What food there was available was enjoyable, thus the 3 stars instead of lower.  If this had been my first visit the score would have been lower and I am not sure I would return.  I truly hope this visit was an anomaly!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LHgroEtJ4AAyQsK69TyUSA"
  },
  "uidvPivxToWRJhIoSa0kvQ": {
    "date": "10/26/2016",
    "text": "We went the last Saturday of their 2016 Octoberfest. it was our first time going. I read prior reviews about getting there early or you don't get a seat and that is True. We arrived at @ 6:30pm and though the lines for tickets and food/beverages were short(ish) there was no place to sit. A short while after arriving we got food and drinks for the 10 of us. Suddenly 4 seats together opened up. We let the ladies in our party sit to eat. Us guys went out the back of the tent and sat on the hill on the ground and the kids in our group ran around in the woods and surrounding grounds. I would estimate that there were at least 500 people under the tent, however they only had 3 portable toilets. By 8:00pm you could not move under the tent and the lines were very long for everything. We left @ 9:15 pm.  TIP 1: If you like to drink beer, buy it by the pitcher which is $18 for @ 4.5 glasses vs. $6 per glass individually.  TIP 2: Eat before arriving. While the food was good, it is expensive.   TIP 3: If you arrive early you'll find the closest parking  TIP 4: By 9:00 PM most of the early crowd leaves and the seats open up.  TIP 5: The band plays in the tent and it is very LOUD!!!!  TIP 6: If you want to eat in the restaurant first, make reservations WAY IN ADVANCE! We tried a week in advance and they were booked.  NOTE to Waldhorn's ... provide some 'stand up' tables outside of the tent, maybe  @20 so folks can place their drinks and food down!!!! Provide more port-a-johns too ....  Other than that, we had a good time and we'll  definitely be back !!!!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1M6XO5SfKuKdQxAzZVCjKA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. band",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1M6XO5SfKuKdQxAzZVCjKA/o.jpg"
      },
      {
        "img_id": "OH3UoQ6LQritLIW78LBD5g",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. under tent 1",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OH3UoQ6LQritLIW78LBD5g/o.jpg"
      },
      {
        "img_id": "gCJD_JQ4fe-T4n7QM7zrhQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. under tent 2",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gCJD_JQ4fe-T4n7QM7zrhQ/o.jpg"
      }
    ],
    "user_id": "qtIvXnttSc_IxI871pqIZw"
  },
  "ZqJDqr7m7LQCoXvmuHJrmQ": {
    "date": "1/29/2015",
    "text": "I ate here last night and ordered an \"off the menu dish.\"  It was absolutely awesome.  Unfortunately I do not remember the name of the meal except it was a variation of a pizza.  I know it's a German restaurant.  The liter steins of beer are also the greatest.  I would recommend this little gem to anyone in the area.  Oh yeah be sure to get the pretzel rolls.  They are a great starter.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AFOuVH_OrvU2ZnKClNGn1Q",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Something extremely tasty",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AFOuVH_OrvU2ZnKClNGn1Q/o.jpg"
      }
    ],
    "user_id": "r0LbIAkBwci6IOa46Z368g"
  },
  "9wYiSGklVGIzmTxSX7NX_Q": {
    "date": "9/8/2018",
    "text": "This is a fantastic place to eat authentic German food. The wait staff is very professional and the food is stellar. It's also a lot of fun when Octoberfest comes around in late September. That have beer tents and music out back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jk-Rw0vwKA3RcN2K3-HE9g"
  },
  "zEtnaRk29Uvqwoj2GO3LhA": {
    "date": "2/7/2017",
    "text": "Up here in Pineville for work and had to come visit this place. Very authentic German cuisine. They are closed on Mondays. The atmosphere is nice. The beer is even better. If you're ever up this way, this is a must visit for Authentic German did.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LjyAHEOD9uFswe7j04zOGQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Black Forest cake... damn good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LjyAHEOD9uFswe7j04zOGQ/o.jpg"
      },
      {
        "img_id": "FjnAIcyyPs52r4P-N3KI4Q",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Jaeger schnitzel reminded me of being back in Germany. Very authentic.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FjnAIcyyPs52r4P-N3KI4Q/o.jpg"
      },
      {
        "img_id": "wumbEIV7OOrqz1e7mu29jQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Sausage sampler was amazing!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wumbEIV7OOrqz1e7mu29jQ/o.jpg"
      }
    ],
    "user_id": "RRMSPuqf0NffOcjmHIQM4A"
  },
  "dMZ6mK7n8aNyiF9aaWxhMw": {
    "date": "11/27/2016",
    "text": "Came here for lunch and ordered the \"Wienerschnitzel\" vow Schwein ($10.95) and it was wonderful. It was served with warm red cabbage and spatzle. I was apparently very hungry and didn't have a single bite to take home. The breaded pork was amazing and had some sauce underneath. It was a great choice and it would be hard to get anything else with how good that was. Also, the pretzel rolls only come with dinner, but are available if you ask and are only 50 cents each. Totally worth it! Good beer selection, of course. If you are in the area, this is a great lunch and/or dinner spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "zJMYjYMaj7wERK-uH2gfPw"
  },
  "rIK5FzruyLNtUyizx5nweg": {
    "date": "2/23/2018",
    "text": "My first time here.  My son recommended that my wife and I give this place a try.  So we did and my son and daughter came along for the trip.  My son had the Veal Weinerschnitzel, wife and daughter had the pork tips with spaitzel and I the two different bratwurst with kraut and home fries.  We all enjoyed the food, very flavorful!  We also had the potato cakes as an appetizer, with applesauce and was also very good.  We will definitely come again!  Went at lunch time, so not very busy.  They close at 3 to prep for dinner, we were in around 1:30 and out around 2:30.  Their beer selection is very German oriented.  The Hefeweizen was awesome!  Highly recommend it if you like German cuisine!  By the way, the red cabbage was out of this world!  Did not expect the flavor, it is a must when you go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WKKn5uuecyw8JRGcPmX7yQ"
  },
  "63ErowFUiAk_BNmgUV3-TQ": {
    "date": "7/24/2018",
    "text": "This restaurant had amazing and authentic German food.  Gita and her staff provided great service, and it was clear by the crowd that it's a local favorite.  Many thanks to Gita, co-owner, for mailing me back the credit card I left there!  Something you can only get from a great family owned restaurant like Waldhorn.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E6b3qhgVHqWNFMW9Qm9Wzg"
  },
  "YwASWweFCRiBAgF-uGPNYQ": {
    "date": "4/25/2010",
    "text": "Excellent for Sunday brunch!  They have a good selection of breakfast and lunch items for just $15.95.  Some of our favorites were:  fresh-made omelets, crispy bacon, cheese grits, spaetzle, a variety of sausages, seafood Alfredo, sliced beef, and the desserts.  The coffee was also delicious and strong.  Service was great, and we did not feel rushed to leave.  The only warning is that they are extremely crowded between 11am and noon.  If you can hold off until after noon, the lines will be much better.  This one's a keeper!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yL4whR1Qb63FptG9IVRdVQ"
  },
  "xxBUni_68k1KUjWHWEtCAg": {
    "date": "5/6/2012",
    "text": "Have been looking for a great German restaurant for years and found on while on a work assignment in Charlotte. With my wife visiting we went here for dinner. Having german food while growing up, standards were high to meet expectations set by my mother's cooking. We both had the sauerbraten with red cabbage and spetzel.  The meat was obviously marinated in wine, vinegar and spices for several days (waitress told me 6 days) because it was both tender and very tasty. I have had sauerbraten in other restaurants and all they did was flavor the gravy and not take the time to marinate the meat.  Had the strudel for dessert which also great warm with a side of ice cream.  Do not forget to try one of the beers. Great assortment of german beers. Looking forward to returning and trying other dinners!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gQ5eKIL5D2Ko0iJbEy-J6w"
  },
  "ldJOAheO84lN1-iB0nC-Tw": {
    "date": "10/4/2014",
    "text": "The young lady at the front desk was very professional to all customers even though some customers were not.  Incident taken on this date at 18:32 hours.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pnyzyk0Yyq18UN_EsCa_9Q"
  },
  "4aHae9ktjCmRAnjoDacCRw": {
    "date": "3/26/2014",
    "text": "Everytime I'm in the area I stop here.  Great selection of German Beers.  Staff could not be more welcoming and friendly.  Schnitzel, red cabbage, potato pancakes are excellent.  If you are not filled by the end of the meal the black forest cake is a can't miss.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fHOd9qeMul1M3lWp87id9A"
  },
  "a7bHbpo_x9RjRvvg8dqmVw": {
    "date": "3/4/2011",
    "text": "Went to this place when I had some family in town for the Sunday brunch buffet.  The food was pretty decent.  My grandpa is from Germany and my mom often made German food for us growing up.  It wasn't exactly like my mom's but I thought it was pretty good compared to other German places I have tried.  I was not impressed with the lay out of the buffet.  Kind of had to stand in an awkward line where people weren't really sure where they were going or who was in line and who wasn't.    I would have loved to see Rouladen on the buffet as that is one of my favorites...I know they have it on the regular menu though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CzYbC62UgKtyGZPPQOo_LQ"
  },
  "OmMazPXda3AFMnuytMQvMw": {
    "date": "10/19/2012",
    "text": "Wish Charlotte had more German eateries. Waldhorns is good, especially the brunch on Sundays,, but I have had better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yxsceeFUr7XBqUnJ3WgC5Q"
  },
  "tddgg-9ujkzJN6xtP2N5QQ": {
    "date": "3/2/2015",
    "text": "When ever I travel for business I always seek out non-chain restaurants. I had eaten at Waldhorn a few years ago. Finding myself back in the Charlotte area and having a few hours to kill before a flight back to New Jersey, I ventured over to the Waldhorn Restaurant for some lunch. The staff was very welcoming and attentive. Since I was dining solo I decided to sit at the bar. They have a great selection of German beer.  The menu has a wonderful selection of southern German dishes. I began with the home made Maultaschen soup. The German ravioli was flavorful with meat and spinach filling. Served in a nice beef broth it was the perfect starter. For my entree I had the prime rib sandwich with German potato salad. Followed by a wonderful strudel for dessert. If you find yourself in the Charlotte area and are looking for some wonderful German cooking pay a visit to Waldhorn Restaurant and you won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "75Q19JWrQ1mWTcwGQ35DMA"
  },
  "GkTPxKiErj4J3NQgHpfsZQ": {
    "date": "6/1/2013",
    "text": "Excellent service and the most delicious food! The waitstaff is very attentive and friendly and the manager Brian is awesome. My husband compares the kartoffelpuffer to the potato pancakes that his mom or grandmother would make - very authentic. They have a great selection of German beers and wines. The sauerbraten and gegrillter lachs are two of my favorite entrees. I also highly recommend the rindsrouladen and the schnitzel. The portion sizes are very generous; I always had leftovers to take home. The apfelstrudel is a must for dessert. While living in the Charlotte area, we ate here at least once every week or two. Hands down best and most authentic German restaurant I have ever eaten at.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pSEAmMflcAAfF4KGstXcSg"
  },
  "iUN4CgFon1n7pxnwle054Q": {
    "date": "2/17/2012",
    "text": "When I exit my car last night, I felt almost like in Munich. Building both outside and inside looks as European as it gets around here. 12 kinds of German beer on tap caused my frist explosion of joy and then it got even better. We ordered four different dishes, each and every one prepared exactly as it would be back home. My orange duck was particularly impressive, especially with extra sauerkraut on the side. Very nice service convinced me to come back soon, maybe for Sunday brunch 'all you can eat', even if only to try all the remaining menu positions at once. I have to consider moving closer to this place and get my Beer Club membership.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yX63BqbcYOYfvZ1pJpo-pg"
  },
  "5ha4tvtRdIgoUZ33EzIlOQ": {
    "date": "11/15/2010",
    "text": "Used to be so good...but the food and service has deteriorated in the last few years.  Carpaccio....one of my favorite items on their menu is now served without toast points. You must request them...then they only bring a few. Last time it was served on a very hot plate...by the time we got the toast, some if the carpaccio was cooked. Horrible.  I have enjoyed the venison dish in the past...it was always tender and succlent. Last visit, it was so rare and chewey I could not enjoy it. I asked the waitress about it, and she replied, \"They've always cooked it rare\".   The crab cakes: I know that most German menus probably don't include crab cakes! But, most nice restaurants do, so it is pretty standard fare. Their crab cakes are very crabby, but also include either tuemeric or curry, which is entirely unexpected, and does not add to the dish.  Their famous salad: The Waldhorn salad, baby greens towering over delicious cucumber salad, orzo salad, carrot salad and delicious german potato salad. This dish is just amazing! For us, it is the only reason to return to Waldhorn's!  Bring your own water, service is spotty most times....and I've observed that we aren't always the only ones with empty glasses!  We've liked Waldhorn for over 10 years....but this weekend was probably our last visit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-2uhgBrHoFvUjfLaf3OFQ"
  },
  "enIZ8Q91RCVQrIpsSbsYHA": {
    "date": "1/14/2015",
    "text": "I have never had a bad meal here and the beer selection here is best for German style beers.   I'm not a big fan of most ales and girly-man beers so this place is a win-win.  Servers and bartenders are always on top of their game.  I will return whenever I'm in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qx2381Wfyjv4gZw6ZHa5sw"
  },
  "elH7lmrIpBNG_N0ewihmvg": {
    "date": "6/29/2012",
    "text": "Maybe I just don't like German food but was very unhappy with all the food I tasted. It could have been what I ordered? I was disappointed with the selection of food as well. I ordered a Chicken Salad Sandwich and it had way too much sauce on it. My husband let me try a bite of his Rueben which was really good. My kid's loved the authenticity of the restaurant which made it worth it to see them so happy. I wouldn't choose to go back but I am guessing it's probably b/c German food isn't my thing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tfs_BWBZVgJuk8gc4FIETQ"
  },
  "K8TxXqnBtNLaAoMkWm9-IQ": {
    "date": "8/17/2012",
    "text": "Outstanding, first time eating there and cannot wait to go back already. Food was outstanding, our waiter was very knowledgable and the environment perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ANu-6Y0CPoWojlTkv_2KZg"
  },
  "cy8Nib08Ku9SRBhTRXS3EA": {
    "date": "10/21/2014",
    "text": "Absolutely amazing meal every time. The best beer, food, and ambiance. A must do in Charlotte!!! Yummy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S2ZWBJYRYBGrdeG1rwU78g"
  },
  "UNMKIWZmfq8psNCRG5Wssw": {
    "date": "1/11/2015",
    "text": "The Waldhorn is a great places to go for Octoberfest. The wait can be long but the large outside tent with a live Braverian band and hundred of other people having a ball makes you in no rush for dinner. After two leaders of Beer I don't remember much about the food:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GZ1xLd6k7e-fqVY4rVeWmA"
  },
  "Ak8FuIxHlVEyAMDPR5AlWw": {
    "date": "10/22/2012",
    "text": "Great food a staff that knows the food and menu. The Beer club is the best thign going in the area after a tueday at work. Close your eyes and open them quick and your in Germany. Beer selections for the real beer drinkers, go in and get a liter of some good germany brews.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wGO4Jm0TpmQRFV9kSwFPhA"
  },
  "Z9EbcP3L5Mt7KR5O1Zc3ug": {
    "date": "8/7/2013",
    "text": "Out of all the things to have at a great German restaurant, I had the trout and it was great! Cute place! A local friend recommended it and I was not disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rb4jSCY8KAz6ujFefTF_yw"
  },
  "1L1GxEriT5otwhJYq_Tt0Q": {
    "date": "1/22/2012",
    "text": "This place is delicious. Its not cheap. I can't seem to recall where the owners are from.   Lunch time is about the best time to go to this place. The lunch specials are still on the high end, but they don't suffer in quality. Unfortunately, I cannot attest to anything but how delicious the weinerschntizel is. I can't seem to bring my self to try anything else. However, the portions could be a little larger.   In the evening, they serve soft and warm pretzel rolls with the meal. They are also delicious. This is one of the best German places that I've been to in the US.   The Oktoberfest is not something to be messed with. They pull off the more traditional approaches. Its a tent, and its well managed. There are complaints about the whole ticket system. But given NC/US's weird alcohol rules, they make it work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ezW02HA5b_tIBZxN76wXOA"
  },
  "BUKSLr-tU5NyuhKQondUyQ": {
    "date": "8/29/2014",
    "text": "Dined here June 2014.  I had a saugage/brautwurst combination plate, which was excellent.  The decor is nothing to write home about.  The service was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eVQlC1RiB1tYOQGmtUmjPg"
  },
  "2wpQKZZD77Ujl6m3s-rUjA": {
    "date": "12/13/2012",
    "text": "OMG Love their beer, beer glasses, beer steins!  The food is a little wierd to me but they let me hang out for hours!  The waiter was awesome and very informative and knowledgable about the food selection and describing it to me. Well educated staff. Just kinda weird food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "_iJASrSnmiPzb0B_M4zLVQ"
  },
  "hTBs2q0Mwb3AOEYi2zvnSg": {
    "date": "11/13/2010",
    "text": "My credentials:  I was born in Germany, lived for years in Germany, my mom (the best cook ever) was German, and I currently run a US business selling German Food.  I love this restaurant and visit every time I travel through Charlotte.  Their Roasted Duck is a thing of beauty (succulent with crispy skin..and a sauce that is sweet but not overwhelming).  I have a wheat allergy and the wait staff and chef went out of their way to steer me away from anything bad-for-me.  All 9 in our party this last time (July 10, 2010) were delighted with the food.  Not a single complaint.  They came in 10th in the nation in a competition for the Best German Restaurant in America (see  BestGermanRestaurant. com) and I'm already looking forward to dining there again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2QsuegGWTlV6MANVVHiEhg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Fun place for good food and Geuetlichkeit.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2QsuegGWTlV6MANVVHiEhg/o.jpg"
      }
    ],
    "user_id": "Wf_3qmQqEp8c4cgeo3zOYg"
  },
  "-RMurcdfWnCVUKfwGRGFRQ": {
    "date": "1/27/2016",
    "text": "We went last night for Queen's Feast (Restaurant week).  Had a fabulous meal with a fabulous waiter.  He was super knowledgable.  All food is homemade which is rare these days.  For $30 you got a wine or beer, appetizer (we had the salad and it was different and yet so good).   Then an entree; I had the chicken with mushroom sauce and rice pilaf.  It was delicious and enough for two meals.  The pretzel rolls..... they are phenomenal and made fresh daily.  Dessert also included, one which we shared and the 2nd we took home.  All the food was just fantastic.  I've been wanting to go here for years and it did not disappoint.  Red cabbage was fabulous; and all the entrees my dining partners had were very, very good.  We love this place and will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RfK4ueWRIEImaLxh-UBt0w"
  },
  "_KZOBb6baCyJ-U4eh6jlOQ": {
    "date": "8/4/2013",
    "text": "One of our favorite restaurants!  Been there many times for Sunday brunch, beer club Tuesdays and special occasions.  Most recently we stopped by for the Charlotte restaurant week special.  This is a really good deal as they have many more selections than any other restaurant and offer 4 courses instead of 3.  Everything is great but I highly recommend trying the Ungarische Gulaschsuppe, like the best beef stew ever.  The brunch is also something everyone should experience.  The omelets are amazing and the beef tenderloin carving station just takes it over the top.  There is a huge selection of items with lots of German items to choose from.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cWA5MpyopKuvN6p2hLCakQ"
  },
  "WsUsV68VJxrLBRr7QnS1oQ": {
    "date": "5/15/2014",
    "text": "Although I use Yelp constantly, I've never been compelled to contribute my own review. After such a great experience at Waldhorn, I'm ready. I'm no expert on German food, but my husband and I have been to Germany and Austria and absolutely loved the food. I surprised him with a birthday meal at Waldhorn and it not only lived up to, but exceeded our hopes. The food was excellent and we had great service- we'll definitely be returning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8m4_jqfd7IDnNM4hKceiIw"
  },
  "V8sbNuKuKyqcPg3lfiND7w": {
    "date": "8/30/2010",
    "text": "Having been in Charlotte only a year, I'd despaired of finding good German cuisine in the QC.  Turns out you have to go to Pineville.  Also turns out it's well worth the drive.  The Waldhorn is a little kitschy, but appropriately so.  Their tap selection is well-chosen and good.  The rolls are pretzel-y and fantastic.  The sauerkraut is sauer enough, though they do the sweet caraway-seed version.  The wurst is the best in Charlotte.  (Please don't kill me.)  We started with the wurst plate, served with mustard, sauerkraut and rolls.  There was plenty, and I should've stopped there, but I hadn't had good German food in a while, and was in a celebratory mood.  I had the jagerschnitzel.  It was made entirely of food.  Pork was thin, crispy and delicious.  Red cabbage was firm and sweet.  Spatzle needed salt, but it usually does.  Heated up well the next day, also--there was a lot of it.  She had the venison.  Sweet lord.  That is all.  An older gentleman in liederhosen and wielding an accordion played throughout the place, but never so loud as to be distracting.  I like the accordion though, so your mileage may vary.  It is a little pricier than I would've liked, but I don't think that is going to stop me from going back.  Regularly.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "suVYxo-uPNTlpkJ7w7J-wg"
  },
  "-optuXNoaaLHqo_BCg83LA": {
    "date": "9/12/2013",
    "text": "I am a beer club member and every time I come to Charlotte for work I make sure to show up at least once during the week.  I never had German food in Germany, but I have gone with some co-workers that have and they say that this place is as authentic as it gets.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KzduLI9tVbCXVyRm7oZ9cA"
  },
  "LBIHbILNRohOD8DE3cFe5g": {
    "date": "7/21/2010",
    "text": "Great restaurant. Has a mug club that is worthwhile if you go here a lot. Their food is great, especially the pretzel rolls you get.  The beer selection is vast.  Oktoberfest is a great time as well. A polka band plays while you eat and enjoy authentic German food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ThZyytdc_kj2uBYFiSao-A"
  },
  "phSQAxmqvvyaWsYTe0Nirw": {
    "date": "9/7/2013",
    "text": "The service was great and the food was even better! I had Jagerschnitzel with s tell cold German lager. Great place and I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lAoEVhebumupUry_ZzueLQ"
  },
  "nNTdzRb_17AaP8WqpbwhWw": {
    "date": "10/8/2015",
    "text": "Stopped in here yesterday because traffic was overwhelming!!! Glad I did.. I highly recommend this place. Amazing management, bartender, food and Beer. Let just say this is my new little pit stop afterwork!!! Came back the next day after work!!! Hmm must be good if you come back the next day!!! Just saying!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mQG6Tzw_89JLmJVg3CqxTg"
  },
  "VybOIvqOi-marFU4dG4h3w": {
    "date": "5/8/2010",
    "text": "Tonight was my first time here, and I think I'm in love. The beer selection is fantastic (you had me at Weihenstepher), the service was great, and the food was really, really good. I ordered the Wurst Platte, which, as it's name suggests, is a plate of sausages--three different kinds, to be exact, with a side of kraut and home fries. There was also a perfect dribbling of jaeger sauza to go with it. I've always like kraut, but not loved it. This stuff, I loved. It actually had a slightly sweet flavor to counteract the normal tang of kraut. My wife had a pork schnitzel that was flayed and stuffed with black forest ham and cheese. Nothing better than stuffing pork with pork, my friends. That was served with a side of spaetzle and broccoli that was actually fresh.   The old timer walking around playing the accordian was a nice touch and got everyone going. There were a lot of large parties, but we were seated quickly and also served quickly. The location is a little out of the way for a Charlottean, but well worth the trip if you find yourself south of town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "1tbQMjxS6JQunA0WxZ-SXw"
  },
  "0XIPp3GE3h0vkptTqQpVEQ": {
    "date": "4/4/2013",
    "text": "Best dinner of our trip.  Great german food.  The pretzel rolls were amazing, as was the service.  One of the few places I have seen venison on the menu.  We had to try it and weren't disappointed.  Our group also had the stuffed pork (breaded pork tenderloin, stuffed with ham and cheese) and a sampler platter.  The stuffed pork and the (sweet) red cabbage were the highlights of the meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YBrKUKiZLXpAhkDrecCEAA"
  },
  "_H11MDmKgzam8SbnDnisCw": {
    "date": "8/20/2012",
    "text": "For 9 years, i have lived only 3 miles away from the best brunch in town. I just realized this a day ago.  Made to order omelets, roast beef carving station,  salad/soup, potato salad, brats, sausages, pork, pretzel rolls, bacon, more pork, veggies, french toast, grits and other normal breakfast fare, rice, pasta, chicken, apple/cherry cobbler, tons of deserts....oh my the deserts. Everything was very very good. It was very hard to force myself to stop eating and when we left i could barely move. Some may think its a little pricey but at $17/ per person it is way worth it for the selection and quality of food. Another great thing is that its not predominantly just breakfast foods. There is something for everyone. I thought the service was awesome. Our server and the guys at the roast beef/omelet station all told me about their Oktoberfest and encouraged me to attend. Guess i look like i really dig beer (well, it's True).  I'm not sure what additionally i can say that previous reviews haven't already said...ill just echo that if you haven't been to this brunch yet-your definitely missing out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "_h9rOf--MUWleyXAqPVo2g"
  },
  "zLWHRodXJCNjZ3rfzb3y2w": {
    "date": "1/29/2013",
    "text": "Best German food and beer this side of Germany! Pilsners, pretzel rolls and schnitzel, oh my! Plan to have a couple beers at the bar before dinner. They have several German beers on tap. The food is delicious, we usually end up getting the schnitzel (breaded pork cutlet, stuffed with black forest ham and swiss cheese),  and the duck, of course with spaetzle or bread dumplings. Prepare to embarrass yourself when your party of two inevitably asks for another basket of pretzel rolls, they're that good. This is the epitome of comfort food and will absolutely wreck your diet, but I can at least promise you it will be worth it. The staff are great, you feel like you're dining in someone's very large German home. It's a special night out kind of place, with entrees $15-20. I have no complaints about this place except its not closer to my house.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ECMkVSA_KeIbPU9GFqu4CA"
  },
  "HowjkF5qkHDkpulH4vVCzg": {
    "date": "2/23/2013",
    "text": "They serve spaten Oktoberfest year round! Great brots, potato pancakes, and pretzel bread!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jfy2usYXLrH8LAPyWgMXyA"
  },
  "9tQvmZB02QGjEl3Zm6Z7Vw": {
    "date": "5/24/2015",
    "text": "Great food buffet for lunch. Their pretzel rolls are to die for.  Great snitle and sausage sampler",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "01pe3zHgfoIV7CTnerpYOA"
  },
  "j420mMhIcSGfeOQtPwPJYQ": {
    "date": "3/14/2015",
    "text": "Delicious and authentic German food.  The pretzel rolls are awesome, and the four entrees at our table were all wonderful. It was nice to be able to exchange some of the side dishes which came with the entrees.  The service was attentive but not overbearing.  We drove from the Hickory area to try the Waldhorn, and it was well worth the trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7VW5Wy-c6laUSrLaROew3A"
  },
  "pQb73UlLs03UNQjXDupXZw": {
    "date": "6/21/2012",
    "text": "If you enjoy German food, then this is the absolute BEST place in the area.  They have pretzel dough rolls that are just the bomb!  Lets also not forget to mention the copious amounts of awesome imported German beer!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "P6FafMEVexkpqku_cMcZaQ"
  },
  "0PvSEmTtQkV3Fw3lfupj7A": {
    "date": "9/28/2013",
    "text": "One of the best German restaurants in the country.  Great beer selection. Everything I've tried is excellent. Service is excellent. This is my favorite restaurant of all time. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fwb9q0QNN9Hq9bGNIPNBRw"
  },
  "dKz6PDPTXpb-WrcprjH8iA": {
    "date": "8/18/2012",
    "text": "OMG! Why or why have I never been here before now. This place is awesome, in so many ways. First the atmosphere was perfect. A very casual feel. There's a bar that you can walk up to sit down order a great pint of beer. Second the waitstaff is extremely knowledgeable. Third the food all my God is so good.  The portion sizes are great. We will be going back definitely.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jm7hynuhcEt2TkQIcCY_Nw"
  },
  "S7LGTVsGnqFU7TmpODcaOw": {
    "date": "3/17/2010",
    "text": "This is where the birthday girl wanted to go last night so this is where we went.  Best surprise - a free slice of Black Forest cake with the purchase of any two dinner entrees.  This is the Tuesday special and it's large enough for two to share.  Table ordered the wienerschnitzel, sauerbrauten and chicken nadia.  Three entrees, two glasses of wine, one large draft beer, a cup of coffee and the free Black Forest cake ran $80 including tip.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mpeE03Ul_rvLQ4Io-o6Sjg"
  },
  "tDKrig-ixlWGsTUvoVgMfQ": {
    "date": "3/31/2019",
    "text": "Delicious German food...great service. Excellent Sunday brunch and the atmosphere is very cheerful and authentic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0UoxoUEm9Jy7PcRPLulYQ"
  },
  "SNMr7kvyDPmy56RIOGWknQ": {
    "date": "1/18/2018",
    "text": "Went to the buffet and it was okay. They had a variety of foods but it was all mediocre. Not worth the cost.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FyikYazQbNoOumDooOQyyA"
  },
  "s6aDmfP5VyXgYoY5qQ4mHw": {
    "date": "7/10/2016",
    "text": "First time for me and my dining mates at this German restaurant. I have a strong German heritage and exposed to many German foods.  The staff was very friendly and attentive. Dinner time and  it was a very noisy atmosphere overall. We sat in a comfortable booth.  We ordered sauerbraten that came with red cabbage and spatzle, the Waldhorn house salad ( greens with some German potato salad, orzo  and carrot salad), soup of the day, a mushroom soup and rib eye steak with mushroom and onions in a brown sauce with vegetable and potato.  Food was plated nicely. Sauerbraten was a very dry pot roast consistency so we asked for more of the extra sauce which I personally have had better. The meat  did not seem  to well marinated to us. We were disappointed with this and would not reorder again. Spatzle was bland and we thought could have been  seasoned a bit.  Red cabbage was very delicious.   The rib eye steaks were tender and cooked to our liking.   The mushroom soup was tasty.   The pretzel rolls that came with our meal  were good and served with butter and mustard  We would definitely come back another time and try other menu choices.   We are not beer drinkers.  However,  this restaurant features a variety of German as well as other beers. This restaurant also  offers a Sunday Brunch and a beer club for lunch and dinner on Tuesdays",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nrvjynO4F0IwLoSP9zt4Ig",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Rib eye steak",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nrvjynO4F0IwLoSP9zt4Ig/o.jpg"
      },
      {
        "img_id": "MMvUWM1GFyl7JOrUKfpqvw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Sauerbraten",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MMvUWM1GFyl7JOrUKfpqvw/o.jpg"
      },
      {
        "img_id": "CLz7FMkv1xy1X47y6Pl1Gg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Pretzel rolls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CLz7FMkv1xy1X47y6Pl1Gg/o.jpg"
      }
    ],
    "user_id": "dzC95g6MT4ErmcKbiu6oTg"
  },
  "BDqQsVek91dm9wgXa5Jd7g": {
    "date": "3/25/2017",
    "text": "First, allow me to say that I can definitely see the appeal of this place if you are enamored with German cuisine.  The ambiance has it's charms.  The service was on point, our waiter was very helpful and attentive.  Having an accordion player on staff was a very nice touch.  The food was prepared well, and as German food goes, I won't complain.  However, there was a roach on the windowsill. Also our kartoffelpuffer was served somehow with a gnat or a flea.  For me, this ruined the whole experience.  I won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sAw6Jsua-_OR7ssbPkzIpQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Gnat or flea on side plate. It wasn&amp;#39;t there before the kartoffelpuffer was placed from it&amp;#39;s serving dish into the side plate.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sAw6Jsua-_OR7ssbPkzIpQ/o.jpg"
      },
      {
        "img_id": "sseBPQCqLxVsjm1iyL0X8Q",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Roach on windowsill.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sseBPQCqLxVsjm1iyL0X8Q/o.jpg"
      }
    ],
    "user_id": "BoZeP_A6WTMtpswkKhevsg"
  },
  "8W83uQY7CWIP9F7Nin4HKg": {
    "date": "7/2/2017",
    "text": "Oh. My.  Goodness.  Loved this place! The hubs and I got goulash to share as an appetizer and I could not recommend it more!  It went very well with the complimentary pretzels rolls which were also to die for.  We went on a Saturday evening so there was a very friendly accordion player walking around, really enjoyed it.  I had the schnitzel with gravy and extra spaetzle.  The spaetzle was perfect, I was disappointed with the schnitzel though.  I normally have mine plain with lemon but there was no flavoring on the breading and it was very plain.  Once I had it with the gravy it was very good though!  My husband got the sampler and loved every bit of it!  Very happy customers",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-k5kUkeSoy81041Jk4elDw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-k5kUkeSoy81041Jk4elDw/o.jpg"
      },
      {
        "img_id": "roDOvX8YKo0G3ShcMQ4hRw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Pretzel roll",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/roDOvX8YKo0G3ShcMQ4hRw/o.jpg"
      },
      {
        "img_id": "3JuYzb-Bd-Hwaimmknyh6g",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Waldhorn Sampler",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3JuYzb-Bd-Hwaimmknyh6g/o.jpg"
      }
    ],
    "user_id": "yhEQ1Z0laahIWYzw6X5a6w"
  },
  "lyTubKCdbBV5s4WJOE6riA": {
    "date": "12/15/2017",
    "text": "Came here for my wife's company bash. Great selection of German Cuisine and Beers. Since I've never had this before I had the lemon chicken and it was delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XmzBtmAGVycbe4NYif7CCA"
  },
  "eHVcKV3b4mxeaFWqBB0J6A": {
    "date": "2/3/2019",
    "text": "Nice family owned restaurant. They have a great Sunday brunch buffet with German Classics as well as American favorites and an omelette bar. Great atmosphere! In the fall, they do Oktoberfest from late September through the end of October.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tydr_aiJwG9U0T3D11fzfw"
  },
  "U34_XaZ28voXToHKf6wVow": {
    "date": "5/2/2018",
    "text": "I was very excited to finally try Waldhorn and enjoyed walking up to the place as much as walking in the door to a German chateau. I did try the jagerschnitzel with spatzles and loved the schnitzel and sauce. With red cabbage as a side. I loved the red cabbage- so delicious. I have to say the spatzles were disappointing to me, since I love them so much I make them. These didn't have the right density, they were a little too fluffy for my taste. Overall though great experience, ambiance and the food was authentic, unique for here and I'd love to try some other menu items in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "r5lBLq4TC9lx2XpR-Ahkcg"
  },
  "gxe4kP65Oorh54d41L1Adg": {
    "date": "2/22/2019",
    "text": "Beer, Schnitzel and a little old man in lederhosen playing the accordion is enough for the 5 stars but there's more!  Service was great and they have a decent selection of authentic German fare.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JdyGPDc4kcZ53DXLAK1GHg"
  },
  "6CCLTPKl5hmm2KR3za-13A": {
    "date": "8/17/2018",
    "text": "This was easily the best since living in Germany; took me back to the Kaisertisch Marnheim, where the staff naturally interacted with guests, laughed loudly, and played music. There was no sense of anyone just going through the motions. I'm curious about the fries. While driving to Sembach Airbase, we used to stop on the side of the road to buy the BEST pommes frites from a street vendor. Ah, memories... Can't wait to dive deeper into the menu. Excellent experience all around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NEUcDDt_aJw0IFjL7lVhSA"
  },
  "kO_JQzpotcSOnhv19HTbNQ": {
    "date": "4/2/2018",
    "text": "If you are like me, you dont know much about German food. My aunt who was born n raised in Germany loves this place. So they must be making the food right. But personally, the three times I have eaten here, I havent been impressed. And the service, even my aunt will agree, is very lacking. Sometimes you get an experienced, on her game server. And then you are treated right. But twice we have gotten an inexperienced, confused and unskilled server. And That was no fun. The brunch buffet has plenty to offer and the american dishes and sides are good food. Find yourself a good server and you will enjoy your brunch.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "OFh0f5zmSZCVs38OW6w3cw"
  },
  "oqogKvIgr8Tl319Hh-MYxQ": {
    "date": "11/16/2018",
    "text": "I went here for oktoberfest, so I didnt expect anything to necessarily be top notch, as its got to be their busiest time of the year. But this was like a live action train wreck.  Got an appetizer before beers, which then flew off the plate onto the table, and then taken away hastily. We waved down the food runner to alert her it was ours, and she graced us with a fun anecdote concerning her co workers ability to count. We asked about beers again. They arrived and it was clear that the head of the beer was gone and so was its ideal temperature. Once again, it was packed, i get it, there is a lot going on and the guys only human. So we order food. Everyone has beers in hand now, so all is calm. Food comes out at a reasonable time. Our dish stated it had mushrooms and came with a vegetable of the day. It had neither, except for one single mushroom that was like a needle in the haystack. Whatever the opposite of visually stunning is, is how I would describe our dish. But whatever, life goes on. We all have another beer and basically just chalk it up as a loss given all the circumstances. Then the unthinkable occurred. We had stacked all our dishes to be helpful for the server. With his foot propping open the door he asked me to hand them to him. Feeling as though I was on candid camera, i picked up the stack, got out of my chair and handed them to him. As things wrapped up, and to our astonishment- the checks were separated accurately. So that was nice. I realize its unfair to judge solely during this event, but it sure was unforgettable.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qv_1PT9xVia7cqi7ZZc25g"
  },
  "_KUivWG6vE6AgIJYx9yDVQ": {
    "date": "12/9/2017",
    "text": "Good German food. We wanted to try some new place to eat and gave this place a try it was definitely different and great tasting would come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I0IIazQiRqFWx1UD_gb6JA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/I0IIazQiRqFWx1UD_gb6JA/o.jpg"
      }
    ],
    "user_id": "QYNBB211vRGLl3aHQxcGJg"
  },
  "pesY_Poo1JPMMQh4tl1erw": {
    "date": "4/19/2018",
    "text": "German food is something I'm not familiar with, but nonetheless, I was excited to try a local restaurant while here on business. The staff was exceedingly kind. Our waiter answered all of our questions and explained variations in menu items well. Once we ordered, our food came relatively quickly and was presented beautifully. While the food was great, the service went downhill at this point. Our waiter was not seen for the rest of the evening. I waved down a staff member when I needed more water. We waved down another waiter when we wanted to order dessert. We waved down yet another person when we were ready for our check. Had the standards of service remained as they had began, this review would certainly be better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2AIttl2Myym-gh379q6nNw"
  },
  "-61wC8BmcEN9DFgvr5rFhg": {
    "date": "6/1/2018",
    "text": "Came for a quick dinner and ended up staying for 2 hours! Loved the food, delicious beer, great atmosphere, even better staff!! Would recommend 110% Definitely a new favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kXbWqoCmNchoU_U3axDDjw"
  },
  "doSOHqZcYWKtrjdN4GwQgg": {
    "date": "10/21/2016",
    "text": "This place is great!  It is the only German restaurant in the area that I know of.  The food is delicious and they have buffets on different night, and a weekend brunch.  I would recommend trying the buffet, but also going at a time they don't have it, so you can sample from the menu.  They serve your meal with pretzel rolls and they are to die for!!!  They always come out fresh and warm.  The restaurant is huge!  They have different events there from time to time.  I have been to the beer fest in the fall, and it was really fun.  They have a large selection of beers to choose from.  The staff is friendly and welcoming.  This is a great place to try for dinner with friends and family.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "3C1SCwAZSYdbLtGh5XovUA": {
    "date": "7/11/2018",
    "text": "I absolutely love this restaurant. The atmosphere is nice and the food is great. Everything I have tried from the menu has been delicious. They even have Oktoberfest every year which is a blast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0J3PeJ0Fufie8XbwOoRR5A"
  },
  "lsrbpH7q45OdFNqEdBiARA": {
    "date": "12/14/2018",
    "text": "Really good authentic German food and beer. The hostess had a weird vibe and stood at the station just staring at us for the 10 min we had to wait for a noon lunch booth. Whatever. The food came and it was delicious, although the waiter never came back by to check on us before the check, it wasn't necessarily needed because the food was on point. Would definitely go back for lunch if in the area. Note: it's not the fastest lunch if you're on a time crunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t7Mo8-Co7Rde3ZQITqOJjg"
  },
  "9EERaurL9ZyqgznbqLDV9g": {
    "date": "5/15/2018",
    "text": "Very good authentic german food. A welcome ethnic treat for any occasion. Very large beer and spirits menu too. The service is always great when we have went and food always wonderful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HmKcFSVNVWSV4pKgF_7XpQ"
  },
  "tawbAZ5r0a-NyO0smsGAgQ": {
    "date": "10/13/2018",
    "text": "We made the (long) drive to Waldhorn's for Oktoberfest as advertised on facebook. Unfortunately we misunderstood the post or it wasn't clear that the festivities don't begin until 5pm. So we had lunch; Weinerschnitzel with spaetzel and red cabbage (with cinnamon & brown sugar?) was great!  Also the specialty combo-salad plate which was just ok. They offer a great beer flight of four 4 oz glasses. We had to have dessert; the apple strudel and chocolate mousse- both excellent (not too sweet) and beautifully presented.  Wesley Z. is an excellent server, German and somewhat old school, very informative and polite; a bonus to have him!  We'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s1_tIOr3n7QXssKstMGfiA"
  },
  "79vT0jPtovqkBc0fO5ffIA": {
    "date": "4/3/2019",
    "text": "I have been to the Oktoberfest parties here in the past, which are fun also but always neglected actually coming for a sit down meal. I was pleasantly surprised by how delicious the food is here. I was skeptical about it to be honest, but I was happily proven wrong. The Jagerschnitzel and apple strudel were both presented well and equally delicious. I'm sorry I didn't try this place out sooner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqN02-M7XbSK9T1UhVjQag"
  },
  "G7_gmTBAbx9lI5hSBe1aIg": {
    "date": "6/3/2019",
    "text": "Food is below mediocre. Ambiance of an old diner. Beer selection is probably the only thing that is good there. Trust us, we are German, this is not good or authentic German food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HEZZhok9rzn8Ck0koTZ2IQ"
  },
  "sC00aXkZJzlB7-NToRAHpw": {
    "date": "3/17/2019",
    "text": "Always knew of this place, but never had a desire to go......but yesterday, our neighbors who love it, got us to go.......and very glad we did!.....we had a 5:30 reservation, and were sat immediately, and it was already packed.....for appetizer we had the potato pancakes and they were great!....i had the filet wrapped in bacon and puff pastry...kind of a high end Wellington...it was \" market price\"...which ended up being $27.95, but....absolutely the best piece of steak i ever had....everything on my plate was amazing....wife had the veggie mix in puff pastry...also great flavors, ton of food......others had versions of schnitzel...and all loved them....finished off with a \" on the house\" piece of black forest cake, which was super moist and full of flavor....very enjoyable meal, fair prices and great service.....we will return for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X5i5YBiPK4gK47LHOQD1eQ"
  },
  "G-txF8xMqubPbYkNb4zvsQ": {
    "date": "11/13/2018",
    "text": "The beer is amazing.  If you come, get one of their drafts and you won't be disappointed. I got the sampler plate.  I really liked the bratwurst and the pork schnitzel but the rouladin was very dry... so dry we asked for more gravy... which we also used on the schnitzels because they didn't have much either. My boyfriend got the veal schnitzel and it was my favorite.  It was a bit weird getting it with fries though.  I wish they had an option with the red cabbage and spaetzle instead.  We were celebrating his birthday and they gave us a free piece of black forest cake.  It tasted like they went a grocery store to get it, but it was free so no complaint",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jlq5ucJaPkOsCs4uOVv35w",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jlq5ucJaPkOsCs4uOVv35w/o.jpg"
      },
      {
        "img_id": "ULnTk34U9aZSM2woRahnkg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ULnTk34U9aZSM2woRahnkg/o.jpg"
      },
      {
        "img_id": "EsIcDt5_8PfjUI_F36O5Ow",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EsIcDt5_8PfjUI_F36O5Ow/o.jpg"
      }
    ],
    "user_id": "BSjAPHqiMtCl_MHeUpb3Kw"
  },
  "VhRmQETzkWFtOzyWY4yvww": {
    "date": "1/13/2018",
    "text": "The waitress was very pleasant and prompt, if not for her I'd rate it minus one star.  In chronological order  1- The restaurant was overdue for refreshing ten years ago - see photo 2- Noisy, scratchy sounding music the loud acoustics are real unpleasant 3 -Lager and Pilsner beers only: not one single imported Ale available, not even an amber beer 4- The kitchen was very very slow  5- The food wasn't any good: the sausages were burned, the schnitzel was like rubber etc etc, really nothing good to say about any of it.   Not that any of this matters, all the other tables seemed happy and having a good time, apparently Waldhorn has found its clientele, it just doesn't include us.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2VxzcGsVAEoJ1zNUVEQplA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Dining room vents.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2VxzcGsVAEoJ1zNUVEQplA/o.jpg"
      }
    ],
    "user_id": "ZvmC522FAwxt8qT1jxqliw"
  },
  "wbohlV37z2pBVrkJDsEfWw": {
    "date": "6/2/2019",
    "text": "I love this place.   If you fancy German food- sausages, Snitzel, red cabbage, spaetzle, and good beer, then check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tgtr8DAHwzw1gZGFBOsv-g"
  },
  "WDgGuAbaS3HEkB8Lc0w_Yg": {
    "date": "8/28/2018",
    "text": "All around experience was good! We went on a Friday and they had a musician going around asking for suggestions. The food was good! I got the duck with dumplings. It was good, not great. I really like a good juicy and tender duck. But it was a little too done. The German draft beer is always good, but I feel like they had pretty basic beers to choose from. Our waiter was great as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YuJpMEpOuAMvZ7eTjo2beA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YuJpMEpOuAMvZ7eTjo2beA/o.jpg"
      }
    ],
    "user_id": "JE5wFAyTiFMby7B3ILIgWA"
  },
  "cs6I7_dDVnd6p_PASWkrMg": {
    "date": "2/6/2019",
    "text": "Good food not exactly what I'd call a sandwich with one slice of bread.  Yet tasty. I will return again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xmbTvqWXBb6euaK4tBUdBA"
  },
  "DTzf5qLV4SFXk4fs0eH6iw": {
    "date": "3/14/2019",
    "text": "Always a great meal coupled with good service.   The outside look of a castle on the Rhine sets the atmosphere for the entire meal.  Excellent beef roulade,  and the spaetzle is light as a cloud.  You can never fo wrong with Waldhorn's.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IUMwNx5_x1E_DVWqjAeMzw"
  },
  "36-BBMGNoKqtAKsNhFgbug": {
    "date": "1/16/2017",
    "text": "The other night, we wanted to try something different for dinner. I've had this place bookmarked for awhile and my fiance was excited to try it. Here is what you need to know about me: my family is Czech and I've been all over Europe, including Germany so I had high expectations.   We got there and were told the wait would be 35 minutes. It ended up being an hour. Not the end of the world but I wish we had been given a more accurate estimate. We each got a beer and liked them. We started with the potato pancakes and they were aaaaaaaamazing! So flavorful and delicious. For our meals, my fiance got the Schweizer Schnitzel with Spatzle and mashed potatoes. He loved his meal and had no complaints. I got the sampler with Spatzle and bread dumplings. I loved the schnitzel and the brat but the steak was soooooooooooooo (insert a million \"o\"s here) dry. I pretty much left the entire thing on my plate and my fiance didn't even eat it (which says a lot because he loves meat). For dessert we shared the apfelstrudel and it was divine.   Our server was great and seemed to know the menu really well. Overall, I thought this was a solid experience and we will be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oX3Dalh1wSXMPuC91PdJiQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Waldhorn Sampler",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oX3Dalh1wSXMPuC91PdJiQ/o.jpg"
      },
      {
        "img_id": "i1oM7RHmcAeWSK5jjf_eYA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Schweizer Schnitzel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i1oM7RHmcAeWSK5jjf_eYA/o.jpg"
      }
    ],
    "user_id": "QGKOTCbS-gpAMWPADGmf0w"
  },
  "YIU8Vy6IV6Er1EoXF8b8iA": {
    "date": "9/5/2018",
    "text": "Authentic German food! I had a legit hamburger:) my husband had a bratwurst sandwich. We loved both and the beer on tap is great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8WOAshErq4I9FRrKzaIX2g",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8WOAshErq4I9FRrKzaIX2g/o.jpg"
      },
      {
        "img_id": "li_pKQY9fJGGAhpENKQ-dw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/li_pKQY9fJGGAhpENKQ-dw/o.jpg"
      },
      {
        "img_id": "_rN-84zpf8fLsXCJ1swJzA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_rN-84zpf8fLsXCJ1swJzA/o.jpg"
      }
    ],
    "user_id": "Wx0E7ykL3vL3gL1FOkl-0g"
  },
  "BvSv2bg4zEE8yGGyLDHL7w": {
    "date": "11/9/2016",
    "text": "Having not really experienced German food, I was looking forward to checking out Waldhorn with my dinner group.  We had reservations at 7:00pm for 6 people.  We were able to get seated without the whole group which was nice.  The restaurant outside looks like a German castle, and inside is huge, but could definitely use some upgrading. Tables and chairs are older and minimal decor.  After ordering some \"beers\" we received some pretzel rolls and placed an order for the Sausage Appetizer. The pretzel rolls were so good, and don't forget to use the mustard!! The appetizer was a sample of three sausages over a brown gravy sauce.   We all ordered different menu options, but the majority of the table ordered pork, as they have several pork options. Everyone seemed to enjoy their meals very much.  The sauerkraut seemed to be a hit over the spaetzel.  I ordered the Prime Rib, the Thursday night special.  I was a little underwhelmed, should have stuck with a German dish. Most of ordered dessert to go, I chose the cheesecake. I will say the cheesecake was some of the best I have ever had. Overall, I am glad I was able to check out Waldhorn.  Not sure I would run back, but know if I am ever craving German food or beer this is the spot to come.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NDCguakFCpMHyqHeclAedA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Pork with Sauerkraut and Cabbage",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NDCguakFCpMHyqHeclAedA/o.jpg"
      },
      {
        "img_id": "o-JMSJ26JKqWyKsuGwPUzA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Pork Schnitzel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o-JMSJ26JKqWyKsuGwPUzA/o.jpg"
      },
      {
        "img_id": "7WR-ZeM-ps_raQBsvnDj0g",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Prime Rib, Thursday night Special!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7WR-ZeM-ps_raQBsvnDj0g/o.jpg"
      }
    ],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "ShMVpKN8s9V_kIHHs3QGFQ": {
    "date": "1/14/2019",
    "text": "Sunday buffet is always delicious. They only do reservation for 6 or more. You may have to wait but worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-zkSUti_cv_D8sjb_tFGJg"
  },
  "jvF_s4wQuvpC6ooGn2EAJg": {
    "date": "7/11/2018",
    "text": "As German restaurants go, this place was above average. I chose to go with the Jaegerschnitzel with sides of red cabbage, spaetzle and potato salad. I really liked the Hunter gravy that was served over the schnitzel. It had a hint of wine and had some chunks of tasty mushrooms within. My only complaint was with the potato salad. I was expecting it to be like typical German potato salad made with vinegar and bacon- there was none of either in it and had an overall lack of flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zt8PpuJ3X9ctchPrPvfyHw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. View of the bar area!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Zt8PpuJ3X9ctchPrPvfyHw/o.jpg"
      }
    ],
    "user_id": "u9YFfl_j_cqfnhq89pySYg"
  },
  "YwFgYmD5cBtgFH0_ux7HAg": {
    "date": "10/21/2018",
    "text": "I want to love this place. My partner is German. I really like the beer options but the food just isn't that great",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nXKW5c__d1k5_u6h2MxXxg"
  },
  "75NKmPrzCPas71jHBOn1tA": {
    "date": "3/16/2019",
    "text": "The food might be awesome- I don't know we didn't get a chance to try. Because they messed up our reservations and refused to sit us down... we called ahead and you advised us within 15 min we could get a table. In order to make it happen, me and my husband have to drive two cars since I was out with my baby. We made it within 10 min and they didn't put us in a call ahead list nor reservation. And told us oops- there is 30 min more to wait. It's ok to wait if you inform us ahead so we could better plan on our end but not rush and wasted two trips with a 10month old baby. no matter how good the food is if you don't RESPECT your customer and rejected them to come in because of your fault. It's the worst. I really hope the owner cares since the front desk on average take 10 min to sit one table and couldn't keep up. Well- I'm the end if you make your customer feel rejected and no REPECT You won't last long.... bye forever. The worst experience we had in Charlotte since we moved here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QV74UAkmLaaZbnOMf934jQ"
  },
  "j9H-5sTr34O55ozzYaGrSA": {
    "date": "10/3/2016",
    "text": "Came here for Oktoberfest for the second time Saturday night and it is now something I plan to do every year. What to expect? Well, first of all as you pull up you can tell by the building you are in for some great authentic German cuisine. This place is definitely worth the drive from Charlotte.   Typically we will dine in the restaurant before going out to the tent and enjoy a 1L beer along with our entrees.  Expect a crowd during Oktoberfest of course but we didn't have to wait all that long.  They also have a food menu for outside if you want to go straight to the festivities.  Upon setting down my first recommendation is to enjoy the pretzel roll!!! I repeat- a yummy pretzel roll is a must.  Don't forget the mustard. The beer selection is great and they always have a good selection from Lagers to Dark Hofbrau. I certainly have to get a Marzen Oktoberfest  beer for the occasion.   I typically order the \"Weinershnitzel\"  with the spatzle.  This version is with pork and not veal but still amazing.  They even brought me a side of the jager gravy.  Delicious!  The spatzle is also really good.  So good that I could eat a plate of it myself.  If you want to try several things go for the sampler.  A little pricey but a good way to try the schnitzel and a brat.    The server will give you a wristband so you can get in the tent outside for free if you dine inside.  By the way the service is always good here.  Outside is always fun and this year really enjoyed the band. The bands name is Prost in case you are wondering.  Worth checking out for sure.  Until next time.....  Prost!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zkDKWnZWqWabv0bOdbYCYg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zkDKWnZWqWabv0bOdbYCYg/o.jpg"
      }
    ],
    "user_id": "u_wrAXTf-7036O8k6c-2zA"
  },
  "4i5sjTikO-f_u6ju7eQg5g": {
    "date": "10/19/2018",
    "text": "Called ahead as told and was told upon arrival they could sit us at a table that we would have to vacate for an 8 pm reservation. That would give us 1.5 hours. With a large portion of your menu cooked to order, that's not feasible especially since I shouldn't be rushed as a paying customer. I waited tables for ten years and never once presented that to patrons as a waitress or a hostess. Doubt I'll be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qAbT2H3R2G4-D9QisezZAw"
  },
  "zS17-mbri61UAgDR4lQQAw": {
    "date": "6/17/2017",
    "text": "We don't come here enough! Oktoberfest for sure but also fun for a change of pace dinner and to remind us of our Germany trip.   Love the schnitzel. Can't beat the German beer selections. The accordion player is always fun.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hVidDZUvOiy3xl0v3WKJlg"
  },
  "aIOUNlOMlSY1zN77LViGMg": {
    "date": "8/14/2017",
    "text": "It's always a great time at Waldhorn. We always start out with the delicious pretzel bread with spicy mustard. It's my fave place to drink beer in town as they have a wonderfully delicious selection. My first choice is the Spaten Optimator but I may choose the Schofferhofer depending on my meal. I'd say my favorite meal would be the sampler as it has some of the best on the menu on one plate but you can't go wrong whatever you decide to go with. I would also recommend ordering extra sauce if your choice comes with it as the sauces are amazing. You've got to try Waldhorn for your next special occasion. You won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JiRZzPhGTbcnzTpu-BsyEw"
  },
  "sLpstZjWKNHLuE2PCYc5KQ": {
    "date": "10/25/2014",
    "text": "I really enjoyed this different take on food! The only reason I did not give it 5 stars is the buffet is only available on Sundays and it was awesome! It can't ever be as good only having one item from the menu! GREAT food!!!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BoFluR8klYg01euXk9MO7A"
  },
  "kgrI69Z6TzqZDGts2t2upw": {
    "date": "2/23/2014",
    "text": "Now I really try to like this place , especially since my fiance lived in Germany for a few years and when I took him here with friends for his birthday he proposed to me . So of course it is special to me for other reasons. However this site is to help review the food and to be honest I just think it's bland and incredibly boring.. The only items I care for are the red cabbage and the dumplings other than that I have tried several different things because my fiance gets in the mood for German food and this is the only place in Charlotte we know of .. Other than for sentimental reasons though I personally would not chose to eat here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rckjLcYiZNr0agDMXPZrcA"
  },
  "RTdvVeLNevhBMpIDmaPs8g": {
    "date": "6/21/2016",
    "text": "We went to Waldhorns for the first time recently. The place is gorgeous from the outside but once you step in its a huge disappointment. It's dated, worn and looks a little dirty (the Vents on the wall near the bathroom are DISGUSTING) what really ruined the trip for me was their seating \"policy\" we had a reservation for 5pm When we entered (at 4:48) there were a few people standing in the very small entry way. We checked in with the hostess  And she said we would be seated at 5pm But wanted us to be \"aware that our table has a 6:30 reservation\" I asked if she could go ahead and seat us (there were LOTS of empty tables) since we'd never been there and may take some time reviewing the menu before we order. She said that they don't seat until the exact time of the reservation to avoid \"overwhelming the kitchen\"!! So several of us stood there..including a woman with a walker..while the tables sat empty so the kitchen wouldn't be overwhelmed!!! That is the most ridiculous thing I've ever heard. When you seat 10 tables at once chances are those 10 orders are going in at the same time!! How does leaving tables empty and customers standing in the cramped foyer make any sense to anyone?! After a couple more minutes I asked her again...its 5 o'clock can we be seated now? She replied \"it's 4:58 but I guess we could go ahead and seat you\" Seriously??!!!   With the exception of the Pretzel rolls which were fabulous and terrific service from our waitress Renee Everything else was a huge disappointment. Will definitely not go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J5G-6gisAM9mi9h9wOhbBA"
  },
  "adxYrWAII_Th5IVC_Mpn9w": {
    "date": "12/19/2013",
    "text": "I took an out-of-town guest here for dinner.  Our hopes were up as we walked up to the building and then entered.  The restaurant was busy with two private parties; however, we were seated upon arrival, and there was still plenty of seating available.  First off, the beer menu.  They have a fairly decent selection of drafts and bottles--think an extended list of your usual German suspects (Spaten, Franziskaner, Warsteiner, etc.).  Ultimately, I wasn't very impressed.  The bill of fare had a decent amount of variety, and the descriptions made narrowing a selection difficult.  Fortunately, the sampler special of the evening provided a convenient choice!  I started with the bowl of Hungarian Goulash.  The portion was quite large.  However, I found the broth somewhat too salty, and the meat chunks were dry and tough.  Like the soup, I found my entree to be a little too salty, which was disappointing, because the spaetzle and red cabbage were otherwise quite nice.  I found the meats to be somewhat dry and tough, similar to that of the goulash.  All of this was too bad, because the portions were easily large enough for two meals.  Finally, I'm guessing \"dry\" must be a theme at this place, because even the black forest cake was also a little dry.  For the record:  I didn't complain nor send any of the food back out of respect for my guest.  I just didn't want to create a scene in front of my guest.  Waitstaff were prompt enough, but our server kept forgetting drink orders and generally just seemed nonchalant about providing good service.  So, minus one star for the ditzy waitress.  Minus 1.5 stars for the food.  I rounded down, because I disagree with the more positive reviews.  I was expecting something stellar, and I feel rather let down.  I will come back and give them one more chance, but only one more chance.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0-M2ovkMFcAlBjg8nxBXvA"
  },
  "NceSGMS4jYaqkOEFgNZduA": {
    "date": "2/1/2014",
    "text": "An all around great restaurant!  The service is friendly and fast and the food does not disappoint.  The sausage plate and goat cheese appetizers are both fantastic as well as the complimentary pretzel rolls.  They have plenty of traditional German fare such as Weinerschnitzel, sauerkraut, spaetzle, etc. and it is all delicious!  Beware: the portions are HUGE.  Luckily, they offer a \"Lite Appetite\" menu as well. If you save room for dessert, the apple strudel is a must. It's great to have this restaurant in Charlotte, it's very unique and stands out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bPPu5OvP_3RcmPoyONrnUw"
  },
  "FwvlgmZREYOTigODbjEiOg": {
    "date": "3/13/2010",
    "text": "I'm giving this 3 stars ONLY because I really liked the beer selection.   I laughed at the review about the CIA lighting until I was there being interrogated myself. Why is it so bright? I would venture to say that actually ruined our experience. I was expecting a really inviting and warm atmosphere, not a huge, lit-up cafeteria-like dining hall. The outside looks so intriguing, but that all goes away when you go inside!   The food we had was pretty good. I had the Schweizer Schnitzel which I will equate to Chicken Cordon Bleu with Pork. It was tasty, but didn't knock my socks off. My husband had Rindsrouladen (beef roll with onions, pickles in a gravy) - this was intriguing more than anything. We found the food to be pretty good, but maybe we're just not that into German food?   The best things about this place were: 1. the pretzel rolls, these are worth going back in themselves, so delicious! 2. the beer! You can't beat 4.25 for the selection they have. I really liked the dark wheat beer on draft and it's not something you see anywhere else.   Not sure if we'll be back...unless it's for the pretzel rolls!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RS5JztShXARj8kDJoDs0-g"
  },
  "NdzYieH_oEr3M5jfOt5WVA": {
    "date": "4/6/2016",
    "text": "Food was average. German beer was good. Friendly staff, an overall good experience. Nothing special but nothing bad. Definitely a good place to get some German food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MAdc5mMjoVoJ2F-ipkVBbA"
  },
  "iRt2Hjcw1eoPgln-blZKQw": {
    "date": "1/25/2014",
    "text": "Absolutely fantastic authentic German cuisine. Went for the first time for restaurant week and the portions were beyond huge. Great entertainment as well on Saturday nights by buffalo bill the  accordion player. Can't wait to go back for Sunday brunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UofCiuvwlRp9TijybqjhFg"
  },
  "wLbJW88n5dEKjYVTeJd89A": {
    "date": "1/18/2014",
    "text": "Went with a large group. Fast service, great service! The pretzel rolls are delish! I ordered the house side salad and the lighter appetite marinated beef slices. It was a delicious, German meal. Would highly recommend if UR a German or if you love German dishes",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "a-LoRh552poRuWviwGfuKw"
  },
  "aleiHE7pTsJVbCyWf_31YA": {
    "date": "1/4/2014",
    "text": "First time here this past Friday for lunch. Hadn't had a Wiener schnitzel since Vienna. I really enjoyed Waldhorn 's version. I will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "97ZyDHiJosH_9P66JEprhQ"
  },
  "CDrqMyFmDIb4GIBQmgaABA": {
    "date": "12/30/2013",
    "text": "I had Munich Spaten Oktoberfest beer with carpaccio beef and salad vinaigrette for an appetizer. Venison rouladen with hunter sauce, red cabbage, spatzle, poached pear and lingon berry sauce for dinner.   I had no room for dessert, although I'm sure it would have been great if I did.   The accordian player was great, and came over to play us \"Que Sera Sera\" and we all sang along!  A great time was had by all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QipNNYh5PiHVXl7ILhEibQ"
  },
  "k-7Bu2KW4fPnLWowEOxkrA": {
    "date": "7/16/2014",
    "text": "Awesome!! If you love Germany you have to try it. We enjoyed the sausage platter, and two entrees and we loved it. The beer is ice cold and awesome. Don't pass this place up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EnttXKyhOn4fW3Vwrx5RDg"
  },
  "iJ1kY7w55I979N2AyO2zkQ": {
    "date": "8/31/2011",
    "text": "This is one of those places I really want to LOVE for some reason!  So I was glad to go back for lunch today and get the items I liked last time and taste something new.  The service was very good last time, today it was even better.  My choice today was the \"International Hoagie\" This was very Good an easy 4 yelp stars of: Roast Beef, Westphalian Ham, Salami, Turkey, Fleischkaese, Swiss Cheese, Lettuce and Tomato on a fantastic Pretzel Hoagie Roll.  This usually is served with Tarragon-Balsamic Mayonnaise, which I asked them to leave off.  The only other change I asked was to add onions.  This sandwich was very good!  French Fries were offered with this sandwich though I substituted the delicious \"Home Fries\" cooked with bits of Bacon...5 yelp stars Yum!  For Dessert I had \"Schokoladenmus\" Chocolate Mousse served with Bourbon Sauce and Fresh Fruit, it was A-OK 3 yelp stars.  The next course was five Pretzel Rolls looking great on a plate (see photos of all this if you like).  The next course, was a course of action to pay and get out before i ordered more food!  Oktoberfest here starts Friday September 23 and is for the weekends only (four weekends Fridays and Saturdays).  Next time I'll be there for dinner and eat outside.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2YeXKKXTNDoq4hsJpEqHYA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Pretzel rolls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2YeXKKXTNDoq4hsJpEqHYA/o.jpg"
      },
      {
        "img_id": "bI_6KrnyipkfGWvNUjO2Aw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bI_6KrnyipkfGWvNUjO2Aw/o.jpg"
      },
      {
        "img_id": "Nzgn-9qoidvrvEkwB4doEQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. &amp;#34;Schokoladenmus&amp;#34;  Chocolate Mousse with Bourbon Sauce and fresh Fruit",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Nzgn-9qoidvrvEkwB4doEQ/o.jpg"
      }
    ],
    "user_id": "Ug0ujy9-jd0Oc2nk3KIotA"
  },
  "Kb_mcc63p_Uex8cG3lInnQ": {
    "date": "9/3/2013",
    "text": "Wunderbar! Authentic! Eleven German draft beers. The server( Stefanie) was from Dresden and did a great job. Sauerbraten, spatzle, and rot kohl were great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "agiBkdJovnQd4YdUjunuEA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Buffet",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/agiBkdJovnQd4YdUjunuEA/o.jpg"
      }
    ],
    "user_id": "cO2gEtdCUgSmJR-XY_rUUg"
  },
  "n47ylW9GtmuOzy7u9_NBLQ": {
    "date": "1/21/2014",
    "text": "Because every town needs a good German restaurant, just wish it wasn't so out of the way. Beer club member here and there is also a meetup group that holds an awesome board game night here on a regular basis.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HJIaRw_DVI8iPuj4F_rSJg"
  },
  "Bcd72D7spda1Lq5uQbhtpQ": {
    "date": "3/14/2013",
    "text": "Good German food done at home is hard to do and time consuming IF you are not a native accustomed to the techniques required for more complex recipes like sauerbraten and rindsrouladen. How fortunate we are to have Waldhorn in Pineville (Charlotte)!  I love sauerbraten and Waldhorn's chef does it right. However... MORE SPECIAL is Waldhorn's rindsrouladen... it is NOT a taste that is EASY to prepare with a well-balanced blending of flavors. It is difficult enough that most restaurants fall far short of serving outstandingly delicious rouladen! Most of the time I would never order this at a German restaurant as my ONLY entree selection without a personal endorsement I trusted. The first time at Waldhorn was NO different... except it was included in the Waldhorn sampler selection the first time I tried it. WOW!!!  I was enjoying a draft Spaten Dark, red cabbage, spatzle, and sampler servings of 3 entrees... a sausage that was very tasty, a piece of jagerschnitzel, and the rouladen which I will order again as my entree next time I go to Waldhorn. Everyone does not have a taste for this entree and some would not even want to \"acquire\" a taste for it. I understand... but I also spent my college days in a town that had 3 excellent German restaurants and a huge German ethnic populace. I spent a lot of time dining in these establishments.  For those who appreciate German beers, Waldhorn is sure to have several selections that will please... a dozen on draft and over two dozen bottled choices. ALL of them are served VERY COLD in FROSTY MUGS. Goes so well with the complimentary pretzel rolls served... and you can get SECONDS, but they'll charge for the beer!  An interesting highlight to the meal at Waldhorn was OUR SERVER for the evening... she had been very pleasant and attentive to our requests & questions. Later during our meal I mentioned HOW SPECIAL I thought the rouladen was & she was very candid. She had been born in Germany & was in Charlotte going to college. She volunteered that she was not especially fond of rouladen made by anyone other than her mom, BUT she added that Waldhorn did rouladen as good or maybe better than her mom! She loves the rouladen at Waldhorn! Now THAT is what I would classify as a \"credible personal endorsement.\"  As for decor and ambiance... authentic architecture, many in authentic dress, authentic live music, festive German geniality. A nice slice of Germany in Pineville. Well worth a visit. The Sunday brunch buffet is great value for what is offered at the brunch buffet price. BE SURE to check out the many desserts... EACH a temptation making it hard ONLY TO CHOOSE the wife-limited number!  The crowded parking lot CONFIRMS that most patrons like Waldhorn and are repeat guests! You MAY park on the grass... or get creative if the grass is already claimed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "eBzsYI6S7sRTITfFtt0mNQ"
  },
  "VSO1sqHwL9pXJHjrzuetjQ": {
    "date": "1/17/2014",
    "text": "Best German food in town. A good traditional beer selection along with traditional favorites such as wurst and schnitzel. Their Oktoberfest tent is a blast and worth a visit. If you can't make it across the pond then the Waldhorn  is a trip worth making.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EwS582Yv61__b1EragRxRg"
  },
  "G7H7kZuoepeO_lbcLCZEVQ": {
    "date": "1/24/2011",
    "text": "While I do revel in trendy, upscale, \"nouvelle cuisine\" type places, (and no, I did not just make that up...) I have to give credit where credit is due.  \"We're going to Waldhorn for dinner.\"  \"A Wal what??\"--my reply.  Waldhorn is a German restaurant in the Matthews area.  It's not easy to drag me away from my comfort zip codes, but this turned out to be a treat.    No frills here.  As other reviewers have noted, the \"investigation lighting\" was off putting.  If I have peppercorns in my teeth, I would rather find out about it after my meal.  Our waitress was super friendly and gladly dimmed the lights for us.  Nice, friendly staff!   We started with the bratwurst sausage appetizer plate and the \"Gebackenber Ziegenkase,\" which is goat cheese, spinach and sundried tomatoes stuffed in a phyllo dough pastry.  The sausage came with sauerkraut (I am a fan) and a spicy mustard.  I favored the smoked wurst and ate the spicy mustard until my sinuses were clear.  No Day Quil required!  For my entree, I wanted something straight up German.  I opted for the Sauerbraten.  This is a braised marinated beef dish served with spatzle and red cabbage.  I had never had spatzle, but it is a fettucini-esque noodle with more texture.  I loved the texture of these noodles.  The beef and gravy that it came with were delicious.  Tender and bursting with flavor.    Ooh, and the beer I ordered (a wheat beer whose name I can't remember) came in a tall cylindrical glass that made me feel like something special!  The meal was hearty and delicious. Lots of male customers.  I wouldn't typically crave or think about this type of food, but for what it was, it was an enjoyable experience!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "Oz1Tz4LUlLw_UAgEkUiCvw"
  },
  "LL8Bsco3jhC4P-rX_Okzdw": {
    "date": "6/11/2012",
    "text": "Went there for lunch not overly crowded but there was no hostess,  after about 5 minutes a waitress came and seated us.    Had the bratwurst sandwich on a pretzel hoagie with fries.  It was ok nothing special.  Our waitress was slow and never came to give is refills.   I'd  give it another try   But it was just ok.  I could get the same sandwich at Jason's deli",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GBU2l6N3akxF_5vjsTTn-A"
  },
  "9PgPyAGn5KQpaIaproUD9g": {
    "date": "3/9/2011",
    "text": "You don't have to wear lederhosen to come to Waldhorn, but my theory has always been that it never hurts to wear lederhosen.  Wearing a fun outfit is just good times right off the bat.    I've eaten at Walhorn 8 or 10 times over the last couple years and love everything about Gitta's restaurant.  All of the food is excellent and I especially like the $5.50 \"buffet\" that is available to Waldhorn Beer Club members on Tuesday nights.  I won't outline any particular meal for you because I've tried quite a few of them and have been disappointed by none. And the pretzel rolls are fantastic!  It's the best pretzel bread you've ever wrapped your lips around. They have a wonderful German beer selection and you are given the ability to choose your drink size up to a full liter.  I wish half pints would catch on at more bars Stateside.    Brian, the restaurant manager, is quite gregarious and will leave you with a smile on your face should you happen to meet him.  After a couple visits to Waldhorn you kinda feel like you're family.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "05A1WpXkjCbVHCodTSc6sg"
  },
  "c2dogT13v8P9-NwxWZlRWw": {
    "date": "11/14/2015",
    "text": "The food was of fine dining quality, delicious, and the perfect quantity.  Our waitress was very knowledgeable about the food preparation and beverages.  We cannot wait to return with our family.  The atmosphere is relaxing and on Saturday night there is a roaming musician playing and chatting with the guest.  Really enjoyed it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZKor07ztBagU0IXgyA9Gag"
  },
  "M8pXGlbr2KGPYI98O1niPg": {
    "date": "7/22/2015",
    "text": "After many trips to Germany I can honestly say this is the best German food I've had on the east coast of the states. A lot of German standards, good beer and spaetzle. I do wish they had pig knuckles though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rKKmuh8q53Fl9sHxz2T2Lg"
  },
  "uCawBdbRg64iMZ66G9I4hA": {
    "date": "3/1/2015",
    "text": "Wow what a great surprise, I have drive past this place hundreds of times. So finally I tried it and it's great! Everything we had was good from the appetite to the entrees. Large portions and great tasting food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fc6JvJcRW_2QDwEWViRHfw"
  },
  "U0bb-0CNTqvV9LxYdEkAqg": {
    "date": "6/27/2015",
    "text": "Ate here last night. I had the pork tenderloin with caper cognac sauce and potato croquettes !!! Very very good !!! We will be back :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0-fEbEfIBTLbDHvCFNfApg"
  },
  "Vv-qLdpaMNrpG8l6fX3-tg": {
    "date": "10/2/2014",
    "text": "Came here the other day and had THE. BEST. SERVICE. EVER. Everything was spot on- drinks, apps, entrees, you name it. Even swamped with the Oktoberfest, I was blown away. Tipped 30%. Food was fantastic as usual. Try this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vCYPAeCFE7W5tdn7fVtsBw"
  },
  "2QehtIUfbl3ZRmiTemb2Mg": {
    "date": "8/24/2016",
    "text": "We've enjoyed the waldhorn for years. It is consistently fantastic. Everything is homemade and it shows. Some people have talked about the decor. It is outdated by a consumerist American standard but it is supposed to look German. This is what restraints in Germany look like. No need to update, it's authentic. Everything on the menu is awesome. The chef makes fantastic soups. Always ask for a sample of the soup of the day. Great beer selection. This is one of our main stays.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aE_UJKMUc0CoJY6ltYau2w"
  },
  "bf14IZcxLzwWLFNuTuYA_w": {
    "date": "4/26/2014",
    "text": "We have lived in Charlotte for almost 4 years and always wanted to go to this place, but were put off because they only take reservations for parties of 6 or more. Last night, the two of us decided to walk in early (about 6:00 P.M. on a Friday night, our date night) and were immediately seated. We were put in a back room containing two large, long tables and a few tables for four. One of the large tables was already filled with about 20 people, and the noise was deafening. That entire room apparently has nothing on the walls or ceiling to absorb noise. We noticed that, at one of the tables for four, people were getting up and leaving without ordering. Even worse, the place has a lot of young children who were constantly running around and getting in the way of the waitstaff which, by the way, was excellent.  We started with two Ketel One on the rocks. When ordering a second round, we were told they had run out of Ketel One--at 6:15 on a Friday night. We then split a Waldhorn salad, which was good. We both had the sauerbraten with spaeztle and red cabbage. The meat was dry and the spaetzle didn't even look or taste like spaetzle. From our experience, spaetzle are dumplings pressed through a sieve.. This stuff looked and tasted more like doughy noodles. Since I love Black Forest cake, I took a piece home. It was tasteless, and the fruit center was nothing more than filler. This was represented to us as \"home made.\"  The owners of this place are represented as having been culinary-institute trained. We can't believe it. We have eaten at restaurants owned and operated by culinary-institute graduates and the food tasted nothing like this. We cannot, therefore, understand the rave reviews. We also cannot understand how culinary-institute graduates (if this is actually so) could serve this stuff. To each his own, I guess.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "TT8xmelKonKbxoIG5L2Q2Q"
  },
  "JCuTpCgK9FdNej5Mxj8Avg": {
    "date": "1/21/2012",
    "text": "THIS REVIEW IS FOR THEIR BRUNCH. IF IT IS SUNDAY BEFORE 230PM AND YOU ARE READING THIS - STOP. GO TO THE WALHORN. THEN RETURN TO SAID YELP REVIEW AND THANK ME. THIS IS NOT A JOKE. THIS IS VERY REAL.  Sometimes there are things in life that you just can't express in words full how much such and such means to you. Or how much you hate it. Or love it. This is ALMOST one of those cases, but for you fine people I will spit some lyrical truth about this epic brunch.  Best roast beef in the land Sliced by hand, On your Command, Delish.  Breakfast foods ye seek, Might as well get 2 plates, French toast and hashbrowns peak, Under all that bacon.  Sausages are varied, Mustard with them - heaven. Sauerbraten, sauerkraut, spaitzel Oh look, schnitzel - I'll have 7  I love you Waldhorn Brunch. I want to spend my life with you. This isn't a poem. BRB going for another trip (and don't skip dessert!)",
    "rating": 5,
    "rated": {
      "funny": 23,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "AWLMwFVdUCPtmo1IbQL3eA"
  },
  "2xkAiiVbmyP_MM81pZAqSA": {
    "date": "1/2/2015",
    "text": "Not our first visit and not our last. Great quality German food and beers. Spatzle red cabbage and schnitzels galore. I like the wurst platte and the wife loves Jagerschnitzel. Portions are not quite big enough to split unless you load up on soups and the fabulous pretzel bread.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2BhpwsmTRHySlDZC-gaj0A"
  },
  "ZeSNXO-xWJHv60jQoaZ0aA": {
    "date": "11/12/2014",
    "text": "I would go back again.  Went with my roommate, we were seated for lunch time on a Saturday afternoon quickly.  Nearby the Red Hat Women's Society were gathering for lunch and we had the chance to see some really nice hats!  The menu is in both German & English and if you have any questions, your server will explain the ingredients or how it's made.  Our server was Val, who was very informative and friendly.  I'm glad I asked what made German potato salad different than American potato salad because it's served cold and made with beef broth.. I'm a vegetarian, so if i'd have ordered it, I would have either not been able to enjoy it or send it back to the kitchen.  Always best making informed decisions.  My roommate also had question about what was in the pasta pillows, which is a mixture of pork, beef, turkey and spinach.. and since she doesn't eat pork, it's very good she asked and didn't order blindly.  For appetizers she ordered the potato pancakes with applesauce, and I ordered the pumpkin soup... both were delicious!  I've had the potato pancakes before and they were exactly as I remembered, crispy on the outside and tenderly cooked potato pieces on the inside and with the combination of the cool applesauce.. very good.  The pumpkin soup was delicious!  I mean absolutely heavenly.. it was like I was eating a thick warm soupy pumpkin pie complete with a dabble of cream.  Nice pieces of pumpkin throughout.  Pumpkin soup is a fall treat and favorite!  On to the entrees: I ordered the Portobello Mushroom Sandwich which was also very tasty and filling.  The sandwich is served on rye and is filled with of course portobello mushroom, munster cheese, spinach, and a very delightful tomato aioli pesto spread, and a pickle on the side.  The sandwich comes with a side.  The choices are German potato salad, mixed greens, mixed vegetables or french fries.  I opted for the decent sized salad of mixed greens, carrots, cabbage and balsamic vinaigrette.  My roommate got the fried flounder with a large salad (German potato salad, mixed greens, carrot salad, etc. all mixed together).  She seemed to enjoy it.  Didn't have time for dessert as I had to dash to work, but overall it was a good experience.  The restaurant is very beautiful on the outside, clean and organized on the inside, family-oriented, staff is helpful and attentive, prices are reasonable.  They even offer classes to learn German which I thought was pretty neat, and there is live music on both Friday and Saturday evenings.  The restaurant is fairly active in the community by participating in and holding community events, such as Oktoberfest and holiday gatherings throughout the year.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gb9Y_f1xslY1mDvvHBXaLg"
  },
  "jPN9JFzaYVvKxvuyNNP5pg": {
    "date": "5/6/2015",
    "text": "Wow!  Talk about comfort food!  Potato pancakes and Chicken Nadia with a large Optimater were my choices. Had to take home a slice of the Black Forest, too. Probably sleep like a rock tonight. Atmosphere is nice and the service is perfect. I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9zD3m_3088tCv5wn1JvQCg"
  },
  "1H2X1hBCZ_dVXVnNulA4Mg": {
    "date": "9/7/2012",
    "text": "OUTSTANDING experience at Waldhorn this evening.  We started out with the sausage and sauerkraut appetizer with 3 kinds of sausage - very good.  The pretzel rolls were very tasty too.  I had the roasted duck with bread dumplings and red cabbage - great.  We ended our terrific food experiences with an apple strudel and a piece of black forest cake - wow    Service was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "drTMOo4p8nL0pnMNEyat2A"
  },
  "GavljKr-0JzIOBEk4ANrjg": {
    "date": "4/21/2014",
    "text": "My family went here for Easter lunch- party of 15 & we had the whole upstairs basically to ourselves. The waiter was fantastic!! Officiant, courteous, professional & friendly. It was a buffet & everything was hot, fresh & delicious. They worked hard at keeping all the choices full. The only thing that didn't sit well was their rating of a 91. That's pretty low. We had a great time though & this will always be a family favorite restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9euBoJoMJcOc609IH1nOAg"
  },
  "y82-9_Oae7hWUhfoLi7zCg": {
    "date": "9/22/2012",
    "text": "Waite staff was outstanding.   My wife and I had two entrees that are difficult to prepare; sauerbraten and roulade. Both were wonderful except for being somewhat dry. Sauerbraten was probably not marinated long enough (needs 5 days).  Roulade should have been browned and then extremely slow roasted.  Black Forest cake was very good and different, just not the best.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ALF3JIuwRUHR5EzMOlj-5A"
  },
  "i66Me7n81EaYYIhTlqMpJw": {
    "date": "3/22/2012",
    "text": "Oktoberfest.  Live it.  Love it.  We've gone for my husband's birthday the past 2 years, and it has never failed to disappoint.  SO BUSY though, so book your reservations well in advance or you'll be waiting hours at the door.  The atmosphere is so fun and lively, and you wouldn't look a bit out of place in your lederhosen!  So drag it out of the closet!  I know you have a pair (a set?).    The food is, as the other reviews say, wunderbar.  Unbelievable saurkraut.  Pretzel bites are the bomb.  Sausage sampler, exquisite.  They have a special menu for the fest, and I haven't been back to try the non-fest-fare, but it seems to me like anything you pick would be a winner.  But hands down the best part of Oktoberfest?  The accordion guy.  He is the jam.  He played the Pennsylvania Polka for us Steeler fans, and it was magical (sorry QC peeps, you won't get that, and it's okay).  Just give this guy some love because he's awesome.  I'll post an update if I can ever make it back for Sunday Brunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8Sx-NgLzyCBBWT-IKBt9Fw"
  },
  "J1vx5y_jYE8xyYSPHMi2VQ": {
    "date": "11/18/2014",
    "text": "Best authentic German restaurant around! I go there for lunch and dinner. They always have good specials that normally aren't on the menu. Be sure to join their Beer Club, and definitely check out the annual Oktoberfest.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ZIpIf0U6XVQRcf4AePN3g"
  },
  "okWogH8km9954eVOq02BKA": {
    "date": "10/5/2014",
    "text": "First visit.  I love this place.  The atmosphere is great, feels authentic, and is fun.  I had a sausage sampler that was very good.  My wife had crab cakes, the best she ever had, according to her.  My daughter had grilled salmon that was good, cooked just right, and tasty.  The menu is great with authentic German fair as well as standard American dishes.  The beer of course flows like water over Niagara Falls, and just as cold.  You really should visit this restaurant at least once, preferably in the month of October.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gNxCQFMGCiVIpLgHE9wlTw"
  },
  "t7PNJtwiX9NaRwGO5LqhSQ": {
    "date": "10/21/2011",
    "text": "My suggestion to all restaurants:    Pick something to do, then be excellent at doing it.  Waldhorn does authentic German cuisine, and they are excellent at it! I joined their beer club during my first visit this week, which gained me a 0.5 liter stein, $0.50 off future beers in my stein, a cheap buffet full of yummy choices every Tuesday night, and other discounts that I can't remember.  All that for a one-time $28 membership fee.  Sold! The beer:  oh, man.  My favorites are the Spaten Dunkel and Oktoberfest.  They have Warsteiner, Paulaner, Tucher, and many other German staples.  This place is the real deal - the decor is very nice, the atmosphere is a European family-dining feel, and it just feels friendly.  The manager is super-nice, greeting everyone as they enter, telling us about future events, current specials, and other choice info.  All the servers are delightful, and I will be back here many times. I'll have to space out my visits, though; German food is HEAVY! I had the jagerschnitzel (my absolute favorite German dish); they did me right!  Like I said, they are excellent at what they do.  My compliments, Waldhorn.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "ghYSbxQuYxL1Dn68iMJf6g"
  },
  "2PGNDuRylQRAg-pHa-OuXA": {
    "date": "5/13/2009",
    "text": "I dislike when people give low reviews because of uncontrollable factors like other loud guests and too many people.  If it's a good place, you are gonna get both.  And it's a German restaurant for goodness sake.  Ever hear of Octoberfest?  It's not a quiet outing from what I've heard.  The food here is excellent.  From the sausages, to the breads, to the red cabbage, etc.  I have yet to really have a meal I didn't like.  I usually take a good look at the special, since it's usually pretty reasonably priced, and a good mix as well.  I admit the no more free pretzel rolls sucks.  But you know what else sucks?  The economy.    The selection of beer and wine is pretty good as well.  Usually we go with a big group, and the next time I go, I will make an effort to keep my voice down.  LOL.  If you're looking for good German food in Charlotte, hit it up!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "pznDHVHsO1ZbsG7f4TaNRA"
  },
  "HgBSnAhkv0nPfv51nlCXqA": {
    "date": "3/27/2012",
    "text": "So I've yet to go to the Waldhorn for lunch or dinner?  Why, then, am I reviewing it, you ask?  The answer: OMG brunch buffet.  Ok, so at $16 and change, the weekend brunch buffet isn't cheap. But it is plentiful and delicious. Omelettes are made to order (and made well, at that), and there smorgasbord of other selections: everything from pasta to rice to sausage to cake.  Of special note are the sausages and the red cabbage. Especially the red cabbage. If you think cabbage can't be so good as to give you daydreams, well, you haven't had the cabbage here. Even a brunch attendee native to Germany agreed with me on that.  The staff is friendly and attentive (even though we were difficult and changed tables!) and the decor is entertaining.  The only reason they don't get 5 stars is because I haven't experienced a full-service meal here yet.  I suspect that is just a matter of time, however.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "2m2MNnlOdofofmUs-hYTJQ"
  },
  "iAMXgzqBqPBa0vUtpnaF7A": {
    "date": "7/7/2019",
    "text": "I thought this would be a great spot for Father's Day since Dad hadn't yet found a German restaurant in Chatlotte. He loved it, but apparently Father's Day is popular! Everything on the menu is good and they have a nice German beer selection. I highly recommend for anyone craving some wurst! Worth the drive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zHqc9aD3UVzMR5GwpOtenA"
  },
  "iTrQRI0lusHydbV2iSHSDQ": {
    "date": "6/24/2019",
    "text": "We haven't been here is years. Just recently moved back to Charlotte and to my surprise the food is still amazing and the beer is still cold .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "96JYwOjGdCRqMZYFbZPFPw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. More Spaten Premium Lager",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/96JYwOjGdCRqMZYFbZPFPw/o.jpg"
      },
      {
        "img_id": "Exlf5aPR6QW8Vtxs_eOaVw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Exlf5aPR6QW8Vtxs_eOaVw/o.jpg"
      },
      {
        "img_id": "AyuzbNRMoB-IiLvtbfaL-A",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AyuzbNRMoB-IiLvtbfaL-A/o.jpg"
      }
    ],
    "user_id": "fJmQeLfup4g1aXjK1ObAxA"
  },
  "fXstBrH386k8LssTDSqHJA": {
    "date": "8/13/2018",
    "text": "I haven't had their full menu but the if their Sunday brunch buffet is any indication- I'm in for a treat!   They serve the brunch buffet on Sundays only up till 2:30 pm. It was a marvelous spread. There's something for everyone.   The breakfast items include an omelet station made fresh to order, bacon, cheese grits and my favorite- French toast. There's a hint of cinnamon in the French toast and it's dusted with powdered sugar. They're cut into strips for easy dunking into the warm syrup - just perfect. I could eat an order of just the French toast alone.   Entrees included wild rice, meatloaf, baked pasta, tortellini in cheese sauce, veggies like broccoli, green beans and sauteed zucchini and squash and a seafood dish of salmon, shrimp and scallops and fresh carv d toast beef with horseradish sauce. Since they're a German restaurant, they also have typical German fare that I personally love. Variety of sausages, sauerkraut, sauerbraten, spaetzle, red cabbage and pork with jager sauce. The sausages were perfect with the sauerkraut and the spaetzle was so light and fluffy - top It off with the sauerbraten and gravy - so yum yum.   There are also cold salads and German bread rolls, desserts, fresh fruit salad in a light syrup - oh my goodness. Just writing about all the food is making me wanna go back now!   I took off one star because a few of the dishes sat out too long and was cold. We went towards the end of the buffet time which may be why. Prime example is the sauerbraten. The first round was cold and the meat was dry and tough but they put out a new batch and It was amazing. With the sheer volume of diners during the brunch rush, they should keep fresh food out at all times. Other than that, I loved It. We're already planning to go back next week.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "-Anyb0vB5LrW273whytNRw"
  },
  "Cz0xzDdnus2DUEoM-qjeaw": {
    "date": "6/15/2019",
    "text": "This place is my favorite place to eat in Charlotte. The food is delicious and always nails the presentation. Their desserts are incredible and the whole atmosphere simply adds to the experience. I cannot recommend Waldhorn enough.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HQLupTG5lVs2bZI_ljBryA"
  },
  "JpF4mxbbCah1A3tUuNH6RA": {
    "date": "6/19/2019",
    "text": "My favorite place to eat in Charlotte! The food is always perfect and the service is great! Thomas is the best bartender and Emily is a wonderful server!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t4stkYc2hS8NlUEEIK6D1A",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t4stkYc2hS8NlUEEIK6D1A/o.jpg"
      }
    ],
    "user_id": "SDlZAy7EAp0cUmuihwKSHA"
  },
  "POIreN9SSC63wIF0wyiEBw": {
    "date": "5/31/2019",
    "text": "Well, that was an unexpected surprise: delicious German food in NC. Everyone in my party was extremely satisfied with their meals. I had the sauerbraten and it was delicious, as was the spaetzle and red cabbage that came with it. The red cabbage was my favorite part of the meal - it was very flavorful, but not overpowering. Naturally, they had a great beer selection and they were very attentive to my coworker's gluten free needs. We walked here from a nearby hotel, which was a mistake, since NC doesn't seem to believe in sidewalks. Don't make our mistake. But do visit Waldhorn if you want delicious German food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tOu8D1Z0C0IiRMJvlG0H7w"
  },
  "zFjqP2GHiMqsdrOrN8k8Mg": {
    "date": "5/30/2019",
    "text": "Who knew a German Restaurant would have the best salmon. Good food! Good beer! Fun family place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SSUXYVpJIQQJ5T4OTygwLg"
  },
  "xSvceq4t7KsYVWSBOdd-0Q": {
    "date": "12/14/2018",
    "text": "Wonderful German food. I grew up with a German mother. Some German restaurants don't live up to my mothers standard. This one excels. Service is wonderful as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "L2cgQL9BZm-DaP3BaE225w"
  },
  "Vj9wv7vOb4FVmTSSx9Yruw": {
    "date": "5/9/2018",
    "text": "Waldhorns is one of the best restaurant s in the Charlotte area. Authentic German foods combined with a knowledgeable professional and friendly staff make for a very good experience every time.  They have a great Sunday brunch with an omelette stand and all you can eat buffet of German selections that are hard to choose from. And then there is the Desert choices! During the week they have a beer club with many advantages and daily specials.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-tODKg488INsUIY_PQARhQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-tODKg488INsUIY_PQARhQ/o.jpg"
      },
      {
        "img_id": "cPAAn2BwjtWKDPBCIcR01w",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cPAAn2BwjtWKDPBCIcR01w/o.jpg"
      },
      {
        "img_id": "xd2Jf01ZodEKyjltfrVIJg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xd2Jf01ZodEKyjltfrVIJg/o.jpg"
      }
    ],
    "user_id": "VQFG40gBfnlSd6qhdK9_Iw"
  },
  "3nWxumbvqHh_gDsf2ue_rw": {
    "date": "12/9/2017",
    "text": "Amateur night level service during Saturday night primetime.  I want to like it more but it's arduous getting in and out with a group for such a simple dinner and it's not the kitchen's fault.    Front of house is a disaster.  They were really lost, knew nothing about beer list recommendations and had no system for making sure they were on top of things.  A different server came to our table every course and nobody knew what state our table was in.    The food is good but you practically have to beg for bread and drink refills while waiting for entrees.  It was an hour before we got bread and were still waiting for food orders.  Eventually had to have items they never brought taken off the check.    But they're good about splitting checks if you're in a group.  That was the silver lining.  I would go again for lunch during the week when it's not busy so I don't have to cringe at the mayhem I can't help do anything about.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_EuZG3X9iOGdaehZ77_paA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Wurstplatte with home fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_EuZG3X9iOGdaehZ77_paA/o.jpg"
      },
      {
        "img_id": "1thhUNjRMiCGRLESWnsiLg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Schnitzel with fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1thhUNjRMiCGRLESWnsiLg/o.jpg"
      }
    ],
    "user_id": "c3_AdjAlMy4EJYQhuXADgA"
  },
  "65yy8gdHUQ1ZYtO71a3oJg": {
    "date": "10/2/2018",
    "text": "I love the Waldhorn and it is such a treat when I get to go here. I recently went for lunch with some friends from work. First off, this is the only place I know with German food in the CLT area and it is authentic! The service is super friendly and attentive. They have a great selection of German beers to choose from. We shared the sausage appetizer which was surprisingly awesome. They were all a little different tasting and I enjoyed them all. I got the Wienerschnitzel lunch with spaetzle and red cabbage. The schnitzel is perfectly fried and comes out fresh from the fryer. I can't describe it any other way than absolutely delicious. Spaetzle is light and fluffy with a great taste. The cabbage was even awesome and I don't like cabbage. I will be back again. I hope to make it to their Sunday brunch one of these days, which I hear is AWESOME.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "dGUOe2TBchiGvU1BNkmTog"
  },
  "J_01EwTal-BCvRemy748FQ": {
    "date": "11/24/2018",
    "text": "I'm a sucker for German food and the waldhorn does it well. Being the only German restaurant around I find myself there quite often for someone who lives as far away as I do from there. Very good German fare albeit a bit pricey. Very cool ambiance and an extensive beer list. I definitely recommend their Sunday brunch where you can taste test many of their menu items off the buffet. If you're into German food I highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x-Uzdd8Ti9OvKl0_XvT3Yg"
  },
  "VJktPcYuRQSudo12NyGc9w": {
    "date": "10/9/2018",
    "text": "Hands Down best German restaurant I've been to. Sauerbraten is delicious but I can not get over this spaetzle it is the best! Thier Oktoberfest is fun and food is great during that event. If your in the mood for great German cuisine this place is really worth the trip.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "slgCbxNtnU02GMbV_lonIA"
  },
  "3SSxEYrwZ-dzi3XdRUhX_Q": {
    "date": "2/19/2019",
    "text": "Our family had a terrible experience at the Waldhorn Restaurant in Pineville, NC this past Sunday and thought you should know about it.  It was a special occasion for my dad, Murray White, and he selected the Waldhorn because it was his favorite place.  We had seven in our party and arrived about 11:15 knowingly without reservations. The hostess told us that it would be about an hour wait. We said we didn't mind the wait and would just hang out at the bar until our table was ready.  Within the first ten minutes we realized that an adult birthday party was occupying the majority of the large tables in most of the restaurant; about 60 people. We also noticed that they were through eating, and only two children were seated at a ten-top table closest to the bar. Other than their tables, only three other tables in the entire place would seat a party of seven or more. We continued to wait, and all three of the \"non-party\" tables turned once during the next hour. The party stayed on. At about an hour we checked with the hostess and she advised that they would get us a table soon. I remarked that the party group had been there for at least two hours and could they not ask them to free up one of the tables that they weren't using. The hostess was rather young and chose not to interfere with this group. After we had been there almost 90 minutes the hostess informed us our table was ready and our waitress led us to the table. We were seated and put in our drink orders and were told to head to the brunch buffet.  When we returned they had relocated our jackets, pocketbooks, etc to a booth that barely fit six people and put a small chair at the end. Needless to say it was cramped for us and my father had to sit on the end and was basically out in the aisle. He had to move every time someone walked buy or one of us had to exit the booth.  We protested this treatment to the manager on duty, and she was barely apologetic. She told us the other table was for a group that had reservations. Basically said the next time we come we should have a reservation. Almost insinuated that it was our fault for somehow inconveniencing them on that day. I explained that we realized we didn't have a reservation; however, when you are told it will be an hour wait and after an hour and half you are relocated into a cramped booth, that this was an unacceptable outcome for any restaurant. She just walked off like we were the problem. I asked her for a piece of paper and gave her my number and asked that the owner give me a call. Since Thomas and Gitta Maier are Fort Mill residents, I thought that they may like to hear first hand about how we were treated in their restaurant. Mrs. Maier called me today and said she was told she needed to call me. I explained all of the above and she was barely apologetic. At no point did anyone with this place understand that the situation could have been handled better. At no time did anyone at this restaurant offer any accommodation or extend an invite to my dad to make this terrible experience better.  I reviewed their ratings on several online sites and it appears that this practice by the owners is commonplace. Also seems the attitude of the owners filters down to their staff.  I can assure you that neither I, nor anyone else in our group, will pass through the doors of the Waldhorn anytime in the future.  If you want good German beer, adequate service, average German food, and total disrespect from the management of a restaurant, then this is your place. Trust me...you can do a lot better!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "8EqovXgjF203p871P4JKTg"
  },
  "CFNp798LrdzheHBuceeXEQ": {
    "date": "11/26/2018",
    "text": "Sunday brunch is delish! Not an exorbitant amount of items but everything is cooked to perfection. My dad and daughter loved the assorted sausages. I LOVED the purple cabbage. Very attentive waiter and the chef making omelettes is very nice. My favorite dessert was the berry cobbler. We will definitely go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MPGidsOkSuPkx4OjKRKAdw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MPGidsOkSuPkx4OjKRKAdw/o.jpg"
      },
      {
        "img_id": "jBMb3x_bCLHGaVWnbU7VzQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jBMb3x_bCLHGaVWnbU7VzQ/o.jpg"
      }
    ],
    "user_id": "ACcX_SVWn-s5ZE1AJZDU4Q"
  },
  "uO8YTHMrZec9jO0EFCSPrA": {
    "date": "3/19/2019",
    "text": "This is the closest you will get to authentic Bavarian food in North Carolina. I have been very satisfied each time I visit the Waldhorn!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-mLOLtm15hl5IowV__OY3g"
  },
  "s3kPBgU2QBcvDjNr4TagVw": {
    "date": "7/22/2018",
    "text": "My hubby has been wanting to try this place for awhile. I was skeptical but since he got thr recommendation from someone at work, I gave in. We came for Sunday brunch. We had the buffet.  The food was well seasoned and plentiful. The coffee was SUPER STRONG and amazing! Our server told us it was a European blend! The buffet itself has lots of food. Where it falls short is the overall presentation and decor. The decor is dated and the food presentation reminds you of a cafeteria style place.   Service was EXCELLENT! I was very pleased. My husband and father are still raving about the place and plan to go back.  I wasnt as impressed but I'm glad I tried something different.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "_mVg8S8XwpcP3oB3keL1Fg"
  },
  "e8re4u3EJVsVQ6f5dpu7Pw": {
    "date": "2/20/2018",
    "text": "My family met for dinner here last night (2/18)...  Making a reservation over the phone for a party of 12 couldn't have been easier...   We've been coming to Waldhorn over the years for special occasions, and yesterday was no different... I really enjoyed the meal I had... it's lent so they're doing a special menu called Maultaschenfest... it's like a German version of ravioli... little pasta pillows stuffed with beef and herbs... the long menu is all of the different ways you can have them served (sauces, etc...)... I had the hunter's sauce which is basically a mushroom cream sauce... it was DELICIOUS!!  The beer was fresh, the service was excellent, and our table was STUFFED by the end!  Lots of pretzel bread, yummy food and beer, and all topped off with apfelstrudel... It was a birthday meal to remember!  Thanks, Waldhorn!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sl2R5RFdX1QBQX66T_IGwg"
  },
  "oZCponvHoSM1i7uk_Jsehg": {
    "date": "3/16/2019",
    "text": "Absolutely terrible service. We called and they promised us a table before 6:00pm. When we arrived they told my family that it will be a half hour wait and we had a baby with us. The customers before us also made a reservation and they forgot as well. Can't trust these staff.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pyabgAVfu4b4pPhyatqpXw"
  },
  "Wm69wyEsX7Mf8QH36LqxbQ": {
    "date": "8/1/2018",
    "text": "Me and my husband have been coming here for years. We always have good service and great food. The beer is pretty tasty as well. This trip I had the duck, highly recommend it. It was fall of the bone good. For our appetizer we had the puff pastry with goat cheese, I was not a fan but my husband ate it up. The atmosphere is very charming and the live music on Saturday is prefect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "N3jiA6BS4ukn09-z_5xfrA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N3jiA6BS4ukn09-z_5xfrA/o.jpg"
      }
    ],
    "user_id": "gMuF08mPZsvkjeNHYCDYEA"
  },
  "pqflCTpMRvIKGVG3se8Ohg": {
    "date": "7/15/2019",
    "text": "I always love the Waldhorn. The service is wonderful, and the food is excellent. The Wurst plate is my favorite; the sausages are always perfect and juicy.    I'd like to say the Sunday buffet is horrible to keep the place from being packed, but I can't. It's worth the 30-45 minute wait. I eat here whenever I can.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WUiCaX6MMO5W5KQEEom3dA"
  },
  "v5FtjuXpvo70ipc4Zd8fiQ": {
    "date": "8/14/2019",
    "text": "This is really the only German place in town. Been here several times. I grew up in Cincinnati which had a lot of German food so occasionally if I get a craving for a real bratwurst, I come here.   The outside is like a castle. Inside, there's a nice balance of wood accents that make you think you are in Germany for a second. The menu includes yes, beer, but also German classics like wursts, sauerbraten, spatzel and sTruedel along with sides of cabbage and German potato salad.  My latest visit, I was with a large group. I ordered sauerbraten which came with spatzele and cabbage. It's basically marinated beef with a dark sauce. The meat had a nice flavor. I absolutely adore the cabbage here. They use red cabbage and it has a hint of sweetness. The spatzele is light and fluffy and goes well with the sauce. And the pretzel rolls brought to the table are amazing.   Service is good. The only hiccup we had was separating the checks at the end, but overall a good experience. I've heard the Sunday buffet is great and want to check that out soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5pITwww8oUGmGiTvr67fmQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Sauerbraten",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5pITwww8oUGmGiTvr67fmQ/o.jpg"
      }
    ],
    "user_id": "0cG35-H4SbjjTTSlNoK3fw"
  },
  "n88XE93aV2dpa1GySC8vlQ": {
    "date": "7/23/2019",
    "text": "Alles hat ein Ende, nur die Wurst hat zwei (Everything has an end, only the sausage has two)  Nope I don't speak German but I ate at Waldhorn last week...   From the outside it is like your going to a mountain chalet straight out of the German country side. Then you walk into an interior that reminds you of a run down Denny's. What in the world?!? Lack luster, cheap, no True decor... just blah blah and more blah. Just like so many people I know... good looking on the outside but dull and unimpressive on the inside!  You know that saying though... don't judge a book by its cover... well as far as this goes I'd say marvel at the cover, skip the intro, and dive straight into the \"meat\" of the story!  I started off with a bottle of German beer (See pics) that was touted as a dark smokey beer. It was astounding! Like opening a bottle of camp fire once the top was popped! It was smooth rich and loaded with Smokey goodness! I've never had a beer even close to this but it was fantastic!  There was a group of 9 of us and one that was German... and knew what he was doing.. he ordered aps for the table that consisted of potato pancakes with apple sauce and plates of 3 different sausages. The pancakes were ok... much better with the apple sauce but kind of unremarkable. The sausages were 3 different types of meat heaven! They were each very good in their own right. I literally could have stopped right there but in True gluttony fashion I moved on to the main course.  For me this course consisted of a stuffed Schnitzel. A hammered piece of pork, stuffed with Black Forest ham and Swiss cheese, and then fried. Each bite was tender, juicy and scrumptious!   At some point in the night we learned it was one of our parties 60th bday so a big piece of Black Forest cake was ordered for all to try: chocolate cake with cream icing and decadent cherry filling. Brought me back to my childhood as this was something my stepfather would buy us as a treat every now and then. Yummmmm.  The food was good... the service was kind of like that at a diner... nice but more like I was ordering a short stack with two eggs cracked and racked... at the local truck stop.   The Schnitzel makes it all worth it though... I have not had any this good since I was in Germany 15 years ago. Now I just need to find where I can get that beer!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 9,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "pxN1v6GqZeF4laUPHUY7eQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pxN1v6GqZeF4laUPHUY7eQ/o.jpg"
      },
      {
        "img_id": "ne96c73cku4_KOfUw1KvCg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ne96c73cku4_KOfUw1KvCg/o.jpg"
      },
      {
        "img_id": "rShz9wOAoyqISVkadT5Uyg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Pancake ap",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rShz9wOAoyqISVkadT5Uyg/o.jpg"
      }
    ],
    "user_id": "w8xU5z_-yCXspCfB5bWTJw"
  },
  "yQWj-JjwoPr_psES5g8b6A": {
    "date": "8/20/2019",
    "text": "Eeek... being from Europe myself I really wanted to like this place. We tried it twice and won't go back. We traveled to Germany countless times and I don't find this place very authentic or their food any good. It's not the cleanest inside either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VK7NOOx0PDt-aAUAob2ZDw"
  },
  "pv1m26SgRQ6m8fbyt3S_mA": {
    "date": "2/13/2019",
    "text": "Don't know what took so long, but I finally decided to check out this German restaurant for lunch today.    First of all, the outside of this restaurant looked fantastic (almost like a little German castle)! But once inside, a bit disappointing. Guess I expected the inside to match the outside, but it just wasn't that cute. Not sure how old this restaurant is, but it looked quite worn down...definitely in need of some upgrades and renovations. It could also use some overhead music...as the restaurant was way too quiet and unlively.  Despite the let-down in ambiance, the menu was quite enticing. A Schnitzel fan, I decided to try their signature \"Wienerschnitzel\". Surprisingly, most of my lunch mates went with American entrees, which had me worried for a moment. Fortunately, the Schnitzel (Breaded Pork Cutlet) was quite good...very thin and nicely breaded. Loved that it was on the dry side, and not so greasy. The brown gravy sauce was a bit bland for my taste, but I was quite happy with the breaded meat (and the healthy portion as well). Also, I really liked the \"Spatzel\" (German version of Noodles/Pasta). Think it might have been my first time trying this common German staple. Obviously, I haven't tried too many German foods. As for the red cabbage, I wasn't a big fan...but it definitely added more flavor to the Schnitzel.    The service was good (not great), but absent at times...especially near the end. Don't think I even got any Iced Tea refill.  Overall, I'm glad I finally decided to check out this place. In some ways, it was underwhelming, given how I heard so many good things about it, especially their brunch. Still, I did get my Schnitzel fix. Will probably return at least once more to check out their highly raved brunch, or maybe try them for dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "tXYW3Q6mhZ16q29IZAyQlA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. &amp;#34;Wienerschnitzel&amp;#34; vom Schwein",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tXYW3Q6mhZ16q29IZAyQlA/o.jpg"
      }
    ],
    "user_id": "mCrhj_CG3_pOmDFcfKotRQ"
  },
  "kg2KreXxSPQU8PJjBRbbww": {
    "date": "12/23/2018",
    "text": "Surprisingly better than I thought, and I don't even like German food!? Very good service. You can sit at the bar and eat, it is first come first serve.  I ordered the vegetable strudle, it was very good. The pillow pasta soup was kind of blend, while the two small dumplings were good, the filling inside was rich. The soup was overpriced for the portion and what it had to offer. Came on a Friday night and the accordian man was out playing. Super pack during dinner time, be prepared to pack farther out in the back. You may have better luck with making a reservation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yZ6an8H2eeJmWwIMWm-Zeg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yZ6an8H2eeJmWwIMWm-Zeg/o.jpg"
      },
      {
        "img_id": "zwIzZ62yzvTcjfdOYogNEA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zwIzZ62yzvTcjfdOYogNEA/o.jpg"
      },
      {
        "img_id": "EAR1s0gkYu2v4JsVLM-vcQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EAR1s0gkYu2v4JsVLM-vcQ/o.jpg"
      }
    ],
    "user_id": "8zpZLEWweD0Tp6wLTzlZsQ"
  },
  "fwnmXd64-SP0ftscwyDKGg": {
    "date": "1/12/2019",
    "text": "My coworkers have been urging me to try the Waldhorn forever as we all work in uptown Charlotte and I finally got around to it today and WOW.  I mean, oh my God.    When you first pull up, you're immediately confronted with the authenticity of the restaurant -- the architecture is unmistakably German.    We were seated immediately, and greeted by a very friendly server.  I wanted to go for a draft beer or a special, but my coworker highly recommended the Aventinus doppelbock wheat ale and wow.  Though bottled, it was poured perfectly in a half liter glass and absolutely delicious.    As this was a lunch visit, we opted for the bratwurst sandwich with fries, along with an order of the weinerschnitzel with homemade spaetzle and red cabbage.  As a person of German heritage, I was completely blown away by the food.  The pretzel roll the bratwurst sandwich comes on, along with the sauerkraut and brown mustard are absolutely immaculate, to say nothing of the perfectly cooked bratwurst.  The fries are also perfectly done.    The schnitzel is fried beautifully, perfectly tender, and complimented perfectly by the gravy.  The spaetzel texture is very nice, and the red cabbage has a very sweet flavor that provides a great finish.    We ended the mean with the Apple Strudel and man am I glad we did.  It's amazingly crispy, with fresh apples and a delicious scoop of vanilla ice cream.  Make this your go to on the dessert menu.    I was expecting The Waldhorn to be good.  It was absolutely amazing and exceeded my expectations, which were high to begin with.  Please go.  Like, today.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TPlVUaEG-1cexx30NVrn7w",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TPlVUaEG-1cexx30NVrn7w/o.jpg"
      },
      {
        "img_id": "bhjw9IwBIjNvzSpX3tugag",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bhjw9IwBIjNvzSpX3tugag/o.jpg"
      },
      {
        "img_id": "9b3DwY3KfGN-FADKcY-9ig",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9b3DwY3KfGN-FADKcY-9ig/o.jpg"
      }
    ],
    "user_id": "uJftKIM8Cpo9lJhxMQB2_A"
  },
  "RZsKrRH7cwoM23cShnfUrw": {
    "date": "12/11/2018",
    "text": "I've been here a few times before. My most recent visit was for a friend's birthday. I can't say I'm a huge fan of German food, but I do think they do it pretty well here.   We were seated right away and the restaurant was not very crowded. They took our drink orders right away, but it did take a pretty long time for them to take our food orders.   We started with the Gebackener Ziegenkase appetizer which was pretty small, but tasted delicious. My favorite thing to get is the Schweizer Schnitzel which I got again this time. I love that it's stuffed with ham and cheese. My husband got the Waldhorn Sampler. The Schnitzel and Bratwurst were both pretty good, but I was not a fan of the Beef Roulade (it was dry and didn't really have flavor). The red cabbage that came with it was outstanding. It was sweet with a hint of cinnamon.   Overall it was a good experience and if you're looking for good German food in Charlotte, I recommend giving this place a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "axPGgwKIMFpIGy49TPL8og",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Gebackener Ziegenkäse appetizer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/axPGgwKIMFpIGy49TPL8og/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "yxKlF-q5aWwH5DyyBi6pbA": {
    "date": "10/25/2018",
    "text": "Review of the Sunday Brunch Only  I'm normally a big fan of Waldhorn but have always been here for dinner  or for lunch but never for the Sunday Brunch.  Decided to give the Brunch a try one Sunday after Church.  We drove down from Cornelius and got there around 11:30 or so. Pleanty of parking and were promptly seated.  Granted for a Brunch, service except for the beverages is pretty much self serve.  The do not do table ordering during brunch so you're pretty much confined to the Brunch which is a shame because some of our favorite Schnitzels are not available for Brunch.  The offering are good and varied with normally something for everyone. Some polish mixed in as well.  Several of the pork offerings were excellent although the braised red cabbage left something to be desired.  One problem with a brunch with all the steam tables is that things tend to get dried out unless constantly replenished which was the case here.  All in all it was pretty good but being able to order from the much greater menu is so much better.  Would recommend but suggest for the maximum impact, try dinner or lunch when you can order off the regular menu.  Interior is beautiful with traditional German Motif.  Not a lot of German offering the the Charlotte area but this one is probably the best.",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 22,
      "cool": 21
    },
    "photos": [
      {
        "img_id": "svm8UTf8FNY1OuGjyukWhw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/svm8UTf8FNY1OuGjyukWhw/o.jpg"
      },
      {
        "img_id": "Db9uKs08SbVRqYV2C76VFg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Exterior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Db9uKs08SbVRqYV2C76VFg/o.jpg"
      },
      {
        "img_id": "GmlUxbbkB23Wkz5lX9OW2g",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Entrance",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GmlUxbbkB23Wkz5lX9OW2g/o.jpg"
      }
    ],
    "user_id": "GGTF7hnQi6D5W77_qiKlqg"
  },
  "x-YTnOhbkhVOBRkjkqPaPw": {
    "date": "6/16/2019",
    "text": "Good, but don't go on buffet days (Sundays). We have dined at Waldhorn twice. The first time was phenomenal. The service and food was awesome.   The second time was on Father's Day. We had reservations for 2:00 (they only had a 12, 2, and 4:00 seating). We waited 20 minutes (not terrible, I know) for our reserved table, and people who walked in without a reservation were seated right away.   They put us upstairs, which meant we had to walk down the stairs and across the restaurant to get to the buffet, a feat in itself if you have small children like we do.   The buffet itself was fine, though it didn't have Weinerschnitzel, which is one of the reasons my husband wanted to come here. The roast beef and brisket on the buffet was too tough and inedible. Everything else we got  was fine. I love their spatzle, pretzel rolls, and red cabbage. Their desserts were fine, but mainly frozen squares of different kinds of cakes and pastries that you can tell are not homemade.  Service was meh. We never got drink refills. The restaurant is a little run down. The AC vent kept leaking fluid on my kids' food and now that I think about it, this happened the last time we were there as well. We ended up moving to another table the first time, but the second time there were no other tables available. I just told my son to move his plate and try to eat leaning over to his left side.   I give 3 stars because our first visit was exceptional, but our second was definitely not.  If you want to go, don't go on buffet day. Make a reservation for a night you can order off the menu so the food will be fresher.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "44gU2HudClALyVyQQgV-9g"
  },
  "4sgZcsChl9O9tvOrBSgXOg": {
    "date": "6/29/2019",
    "text": "Three of us showed up on a Saturday night after making reservations 30 minutes earlier. Nice table near a gentleman wearing lederhosen, playing the accordion. We ordered German beers. They brought out fresh and hot pretzel rolls, delicious! I had the sampler platter which was Pork \"Wienerschnitzel\", Beef Roulade, and Bratwurst, served with homemade spatzle, red cabbage, and brown sauce. All three meats were very good, could not choose a favorite. The prices are reasonable, the service excellent and the atmosphere as if in Germany. Quite enjoyable dinner. The place was busy, many folks waiting to dine when we left around 7:pm.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0amJ0p8b9pCfPcEACYwLg"
  },
  "s8CkRBlW486LmYd4wEhQow": {
    "date": "1/26/2019",
    "text": "We entered the front door to be greeted by a friendly hostess. She informed us of our wait, which was reasonable for a busy restaurant. We sat down to wait. As we waited there was a party that partial arrived thinking reservations at 6p and others had not arrived thinking 630p. They were told there was a party booked at 730p which only gave them an hour to eat/socialize. The restaurant looked at the books and was able to move reservations to 630p without a party booked behind them to allow them to eat/socialize. I thought that was going above and beyond to accommodate the parties misunderstanding. We were escorted to our seat (which was all the way next to a fire door and I froze my a.. off, I get making space count but come on insulate the door). Before we could sit down our server was at the table informing us of the specials and getting our drink order. She returned with our drinks and delicious pretzel bread rolls. We ordered the Waldhorn Sampler: Pork \"Wienerschnitzel\", Beef Roulade, and Bratwurst, served with homemade spatzle, red cabbage, and brown sauce. Everything on the sampler tasted good, except the slaw as i don't like beets. I got a side of sauerkraut and it was tasty. One thing I did not like was the food was dropped off by a runner and our waitress did not come back until we were done eating asking if we needed \"to go boxes\" before asking about dessert. Our drink glasses never got refilled.  Over all food was good so I will be back (kudos to the kitchen staff making the food), and I know to ask not to be put in the corner of death near the drafty emergency exit.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 9,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "U3HxQ9KQMzVPPM3v66V4hQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Waldorn Sampler",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U3HxQ9KQMzVPPM3v66V4hQ/o.jpg"
      }
    ],
    "user_id": "e7ewJztwTDzNJcoz5aZnIA"
  },
  "zryExjXK7csrPKAgAUYMXQ": {
    "date": "8/17/2019",
    "text": "I would say usually I enjoy this restaurant but tonight was really surprised by the fact that whoever prepared my ribeye steak decided that they should butterfly it. This should never be done without telling the customer. It is really not necessary to butterfly a steak when order done especially a ribeye. Would have said something in the restaurant but sometimes just not worth disturbing others in party.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uYQyxWutShyVsCDwoXM_iQ"
  },
  "I58WVe7JwRiyP2z5PXgB8w": {
    "date": "1/18/2019",
    "text": "We decided to try a new brunch spot and this place was super close to home. We didn't have a reservation so we had about a 25 minute wait. First off the waiting area is small and the cold air coming in every time the door swung open was brutal.   Our table was a big booth which is nice for my family of all boys and one girl, to spread out. The establishment is quaint and showing its age but it feels like a family owned biz. Servers were very busy flipping tables but prompt enough with drinks and refills.   The buffet offered variety including a bread table, hot double sided bar, cold station, omelette made to order and roast beef sliced to order.   For the price I'm not sure we will come back ($17.95 adults and $7.95 kids). They didn't ask if our kids were of age for the kids pricing (they look big but are 12 and 10) so we were charged for 4 adults.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "lN400ckm9JAMqq5_nsmBEA"
  },
  "6sue3u68_LDfmkAINZoUbA": {
    "date": "1/3/2019",
    "text": "Someone recommended the Sunday brunch to my folks and we decided to check it out the Sunday prior to Christmas. We did call ahead to see if reservations are needed, but they only take them if your party is 6 or more people. For smaller parties, they suggest you arrive early if you wish to be seated right away.   The exterior reminded me of something out of a storybook - very German architecture. Definitely recommend getting there early before opening as a lot of people had the same thought. (We got there about 10 minutes prior to opening and there were at least 4 or 5 groups hanging around the entrance waiting for the restaurant to open.)  The gals at the hostess stand let you know there is a limit for how long your party may dine with them for the Sunday brunch. (She told us an hour and a half, which was more than enough time for a small party of three adults.) I could see the limit being a bit tricky if you had a huge party dining with people of all ages that wanted to eat at their own pace.   We were seated right away and the waiter was pleasant and attentive. For brunch he worked with another waiter who maintained the bar area for drinks - both were great at making sure we had enough drinks and checking on us.   The brunch is a buffet with a mixture of German dishes, pasta, carving stations, and omelettes. They have desserts on a separate tray and a basket of fresh rolls. (The pretzel ones were incredible and reminded me of the pretzels I bought in Rothenburg many years ago.)  The sausages, potatoes, rolls, and pastas were great. I enjoyed almost everything I tried and the price was very reasonable.   I'd come back here again if I had a craving for a German breakfast.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "EF3A4xHcgavT1MWUURuxaA"
  },
  "aWh5lPZI2tXXb3LJKVBQ9g": {
    "date": "5/3/2019",
    "text": "Me and my family absolutely love this restaurant. The 12 of us came here for my dads 52nd birthday and everything was perfect! Food is always so consistent and delicious. Servers are responsive and fast. Deserts; we got chocolate mouse cake, apple strudel and vanilla ice cream. Amazing. I even went up to the owner and he was super kind to me and receptive. Definitely the best family oriented and comfortable restaurant! Pay them a visit for sure.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4bxcUu1FD6p2jymPoYQgPQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4bxcUu1FD6p2jymPoYQgPQ/o.jpg"
      }
    ],
    "user_id": "vCB_CquK8QS_jfyTAa7S-w"
  },
  "7PHD3jNw-f9XA9DjK2Gjsw": {
    "date": "4/24/2019",
    "text": "Always great food at Waldhorn. I love the various sausage plates, and the last time I was there had a great oven roasted duck. Wife loves the wienerschnitzel von kalb. The red cabbage is always flavorful and tender.  And I love the pretzel rolls.  The service is occasionally less than stellar, especially when the restaurant gets full, as people like to come here in large parties.  Also it is very easy for my wife, young son and I to drop 100$ for a meal here, especially if you're having more than one beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Zbe27yti4L5PsNrPg7iUg"
  },
  "h8-wlj0vJ7bsH3Il44hIGw": {
    "date": "12/27/2018",
    "text": "We were in Pineville last weekend for a shopping trip at Zygma's Polish Store. We looked around in Yelp for a good place for lunch and decided on Waldhorn.   The atmosphere is great. It's like you've been transported to Germany. They've got a decent - though basic - selection of German beers. I especially like the Beer Club. Too bad I live so far away.   Our girls had the kid's sausage plate. They both ate all of their food. My wife had the mushroom sauteed pork over spatzle. I have the schnitzel with hunter's sauce and spatzle. Both were good.   Overall, Waldhorn was enjoyable. We may go back for Oktoberfest. Otherwise, I wouldn't go to Pineville just for this.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_z4G-C_Yrh4QyH8P0BHJeQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Beer Club!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_z4G-C_Yrh4QyH8P0BHJeQ/o.jpg"
      },
      {
        "img_id": "1BE8GWZGVHz9Y3LOSBF3_w",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Mushroom Sautéed Pork",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1BE8GWZGVHz9Y3LOSBF3_w/o.jpg"
      },
      {
        "img_id": "NTlNpIYNg9NKEtonvxeulQ",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Outside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NTlNpIYNg9NKEtonvxeulQ/o.jpg"
      }
    ],
    "user_id": "kGG07uTKhP_4SxjsCPoZEQ"
  },
  "tuJt1cOM-uzO5gMUTsKpRg": {
    "date": "7/21/2019",
    "text": "Great and authentic.  To start with the last first, their desserts are off the chart awesome.  Traditional German food, properly prepared, served correctly with average service.   A bit more expensive than it should be, thus the 4 stars. Also, they have to direct traffic during Oktoberfest.   Worth the time, the drive and the money",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "INoTE6UBBc9fGYIrVpUEWw"
  },
  "Im1OTZk50Z8A0ndczN275Q": {
    "date": "8/10/2019",
    "text": "One of the best restaurants in Charlotte. Authentic German food and atmosphere. The Rinderfilet Stephanie is delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lEdKomeKepTcqRvxmO7LBw"
  },
  "ZRo32Fcx5dUZjqXViVqFgw": {
    "date": "3/20/2011",
    "text": "Love this place for German Food.   Have to try the Sunday Brunch next time. Heard it was very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZW-XoteNlRuuK-19q1spmw"
  },
  "tTjel10o68jam_pbcaK5yg": {
    "date": "7/19/2011",
    "text": "solid place.  excellent beer selection.  food is very good. prices are decent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iN5kL0PrH0lb_69fZ6difQ"
  },
  "Ja9mWx3BqBhaaFXH54LQyg": {
    "date": "4/29/2018",
    "text": "Very frustrating when a business is not open when yelp says it is.  Came on Sunday at 5.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pSfRGarG0E9SaxIZxW0PCA"
  },
  "XjWcY6Miz9H8VWV9x-hTqQ": {
    "date": "10/26/2017",
    "text": "Went for our 47th Anniversary. Food was great and the service was excellent. This was the second time we have been here but won't be the last.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NEKcU9j8Q_I-rbEJrMPRXQ"
  },
  "l8vdm5FIfAmSFywran4Vqg": {
    "date": "1/21/2018",
    "text": "I'd been wanting to come here a long time and made it finally. But, oh, it is so, so bad. I didn't realize we could only do the buffet for lunch. It was 16.95 and I feel like I ate $4.00 worth of really horrible, cheap food. I'm not real picky but, my gosh! Some people will eat anything if it's on a buffet.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LFmwydidcsV6MDhBA8TLZQ"
  },
  "ZFiprMlV0ZeTvHTKQvdOTA": {
    "date": "7/28/2014",
    "text": "This place was fantastic for my 35th birthday, I started off my meal with a large mug of Bitburger which is a pilsner brought out out by are friendly German waitress. I very excitedly ordered my entree the famous Rinderfillet \"Stephanie\" which is a fillet mignon wrapped in bacon and puff pastry covered with a bearnaise sauce. Served medium rare and perfectly cooked for my liking. I sampled several knock wurst and bratwurst off my friends plates and again perfectly cooked. The sides we had were spatzel and home fries which really filled us up. For desert I was given a Black Forest cake with cherry filling and whip cream delicious I tell ya. I can see why this place is currently ranked #4 in German restaurants in the United States. Spectacular meal with great service in a quiet setting and no loud polka music to disturb me while I'm feasting like a King of old !!!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "vgkyO_K8m-2I39U_KJ5v0Q",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Awesome bread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vgkyO_K8m-2I39U_KJ5v0Q/o.jpg"
      },
      {
        "img_id": "PwwrHjBtPEICkMhzWbh44A",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Black Forest cake w cherry filling",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PwwrHjBtPEICkMhzWbh44A/o.jpg"
      },
      {
        "img_id": "VTYW67vpRp2e4l69dLa0Jw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VTYW67vpRp2e4l69dLa0Jw/o.jpg"
      }
    ],
    "user_id": "zU9_B8fdyFIRJvXfoFaUgw"
  },
  "mw-7PbcUnaZ9Wq2xR5rYWw": {
    "date": "12/19/2016",
    "text": "Waldhorn.... man, one of my top 5 favorites so far in Charlotte, if you're looking for German food, Don't look anywhere else, this is your place.   Upon Arriving I found out this place is pretty big, we (guy group) came on a Friday night at 7, the Best POSSIBLE time to eat dinner, Right? surprisingly as packed as this Restaurant was, we only waited 15-20 minutes which REALLY surprised me. the mood Here is awesome with a gentleman walking around playing the accordion and entertaining the children, and a lot of the rest of us.  We ordered and a little bit later were served some dinner roles, which I'm always a fan of, but these weren't any dinner roles, these were PRETZEL dinner roles. Dangerous!, don't eat too many! Warm Butter also comes with it.   Onto the entree, I ordered the Schweitzer Schnitzel, In English, its a Breaded Pork Chop, STUFFED with Black Forest Ham and Swiss Cheese. served with Spatzle (Egg Noodles) and Brown Sauce/Gravy. so Think Cordon Blue except better, melts in your mouth and you can clearly taste all the flavors but they fit together really well.   Cons,  The only thing I can think of was maybe have a couple more waiters, but over all, Very Pleased.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h7bLxKIOozbtjpeMcRrSHw"
  },
  "Byfe3iwlVNU9TLCGKn98Lg": {
    "date": "8/20/2017",
    "text": "I must say that this restaurant provides a simply superb dining experience. Their sausage sampler provided an exquisitly wonderful world of sausages and sauerbraten. To end this fabulous feast i partook of one of their amazing desserts, most of which i carried back to the hotel to eat later as i was seriously stuffed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eJW5ItEXXga3Zk7h7DtQ-w"
  },
  "lfYrLM6WrN8MyZas9aVWSw": {
    "date": "10/14/2017",
    "text": "Not only is everything I have ever had here been very tasty, but I also appreciate how seriously they take my food allergies. This is one of my go to places to take out of town guests or anyone wanting to try German food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GF61zyuxUobJOI-HD6vA-w"
  },
  "hRSixYIABmFBWii-aEBvKg": {
    "date": "7/9/2016",
    "text": "We think this is one of the best restaurants outside of Germany! Had to come one last time before we leave Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CLBwgGuKHNZpJ2-8QeMESw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Grapefruit Hefeweizen, yum yum",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CLBwgGuKHNZpJ2-8QeMESw/o.jpg"
      }
    ],
    "user_id": "y2TRu6a3EykDCGPIX6IO6w"
  },
  "lxJpFMIDVyJESuZZstvxUg": {
    "date": "6/15/2017",
    "text": "The service is really great. Our waiter was on top of it all night.  On Tuesdays, they have this buffet and drink special for club members. It's a $30-$50 fee to get reduced pricing on drinks and food.  I gave it a 3 star because they violated a few rules of plating.  Rule number one, never plate anything that can't be eaten.  They throw large sprigs of rosemary on all their dishes like an ornament.  It can't be eaten, it has no value there.  They also garnished the plate with green herbs.  The herbs were all on the rim of the plate and seemed just a bit sloppy.  The food isn't spectacular, it was very bland and could have tasted better. Last and not least I thought Germans were known for their desserts.  I've been to German restaurants where I've been blown away by the countless desserts they had and how rich they were.  Waldhorn has limited dessert and the chocolate cake we had felt like something I could have bought at Harris Teeter.  Service is great but food, presentation, and dessert portfolio have to improve.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eH8IShF2IQ7hIRk1r48EBg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eH8IShF2IQ7hIRk1r48EBg/o.jpg"
      },
      {
        "img_id": "7JnCB1HzXIUgJaeC3Xp8dA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7JnCB1HzXIUgJaeC3Xp8dA/o.jpg"
      }
    ],
    "user_id": "sVn_rNopTpPik0iL_Xm7ag"
  },
  "BtkRClWlPDdHH5oQjrRFzA": {
    "date": "3/24/2018",
    "text": "We live far away from this place, but whenever we visit Charlotte I always have to come here. It is by far my favorite restaurant and they have a very comfortable atmosphere. I haven't found another place with better real German food outside of Germany. I would recommend this to everyone; kids to adults. The accordion player here is always amazing and fully decked out in a lederhosen!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HkNxdnY2wPMURWCL9K9rBQ"
  },
  "wJgskSGKkzvgEry2eIxFxw": {
    "date": "5/8/2016",
    "text": "Five hours at Quail Hollow, at the WFC, left us thirsty, hungry and thirsty! With world class beer choices and the finest German Cuisine you'll find in the 704 this is a great choice any night! My bride ordered the \"Weinerschneitzel Vom Kalb\" with a minor twist to the sides. She wanted the Spatzle and red cabbage which was not a problem!!  Ate every mouthful. My Sauerbraten was delicious, as usual and the beer was FANTASTIC! The WALDHORN has great ambiance, attentive Service Team and a great place to decompress after a busy day! Nice people serving great food and world class beer what else might you want? Guten Appetit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEZNR83u5qi3-boq-MkdaQ"
  },
  "sUeUH8lVQ_1yHNuFQMdFaA": {
    "date": "3/26/2015",
    "text": "German or not, this food is amazing!  Service was killer too!  I have been here twice. Once for my birthday (random) and once for a Magellan Society meetup. Both times we had a large group, 10-17 people, and we had caring, competent service plus unbelievably wonderful, authentic German food.  The owners are great to work with especially if you have a large group. They were a dream. And the wait staff went above and beyond to work with our unique requests.   I would recommend making the trip no matter where you live!  Thank you, Waldhorn!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DwWwdLEty3JcsIz6MSeGQ"
  },
  "CpKRDMgx-KQ_UzzgwSFWxA": {
    "date": "1/23/2018",
    "text": "This is a terrific German restaurant. The real deal!  The beer flight (pick your own) was great. The food better and Sharif the waiter awesome! We ordered  apple strudel even though we knew we were stuffed. Unbelievable .  Also must mention the traveling according player was a treat. Best spaitzel anywhere",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "--Bx_S2zf5wOoy8XW_mFTg"
  },
  "F3FgZy5s_Oxolr4VpNbJ9w": {
    "date": "2/11/2015",
    "text": "Good selection of German beers. Had the sausage platter. They were good and potatoes cooked right. Desert was chocolate mouse and it was presented well and tasty.  Server was very attentive and professional. Sometimes that is hard to find. Second time here and would come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cvSN5FajibaSEIGM8a8RSA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cvSN5FajibaSEIGM8a8RSA/o.jpg"
      }
    ],
    "user_id": "lzLJnn6yu0W7kiXA3bs_PA"
  },
  "4XWKWaQrTTI7B8rFMq-mdg": {
    "date": "10/20/2015",
    "text": "Yes, this place is huge but you still need to call ahead because they are busy. ( even at 5:00!) They don't take reservations for parties under 6. Parking lot is large so, no problem there.   Best German food I this area, for sure. We had to wait for our table so we had the sausage appetizer at the bar; bratwurst,  veal sausage, and knot wurst I had the potato pancakes, light and fluffy-red cabbage slaw and potato salad. My husband had the wiener schnitzel and the whole basket of the pretzel rolls.    My husband joined the beer club-$30 and a stein. They have a club that meets on Tuesdays with a $6.95 buffet. And .50 off beers in the stein. We plan on trying that and the Sunday buffet the other Yelpers mentioned.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "3sY-Wj7CKDb9YjQm7LG5Ew"
  },
  "hdvQeduuHYt2vw36AHXvJA": {
    "date": "12/6/2015",
    "text": "As someone who has lived in Germany and had authentic German food and constantly looks for American German restaurants this was a big let down. I have several complaints. The buffet contained non- German food like pastas and penne and American food (this is always a bad sign) because real German restaurants have only German food.  I have had my fair share of rotkohl and sauerbraten and other German foods, I tried their sauerbraten, rotkohl and sausage and was incredibly disappointed, it was lacking that signature German flavor and tasted like it came from a can. It was all flavorless and I couldn't even get through a 1/3 of my plate. The rotkohl was mushy and the sauerbraten was mushy, just no wrong wrong wrong. I have to say also, it was $16 for the buffet (these are lunch prices) and $5 for a 1/2 liter beer, very overpriced for a poor attempt at German food.  The waitstaff are very unprofessional all standing around and talking loud near your table. I dined alone and so I sat alone, they sat at a vacant table across from me talking loud and being rude. It was approaching 2:30 which is when they close so they starting closing up shop and guests were still in the dining room: vacuuming, cleaning, laughing amongst themselves all while guests were trying to enjoy their meals. I have been to mediocre, average and incredible German restaurants and this gets 1 star from me. I drove 45 minutes for overpriced \"German\" food. I will not be coming back at all. The dessert didn't taste German at all, carrot cake and stuff like from a grocery store bakery. If your cooks aren't German or aren't experienced in making German food then you shouldn't be a German restaurant. Also, I did not see curry wurst anywhere. What German restaurant doesn't have currywurrst? Auf Weidersehen, adieu and goodbye. No thanks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ld-qapOc_X8MR3qz40mw3w"
  },
  "_6HYVwBcDyZsbg2JL55XbA": {
    "date": "5/7/2016",
    "text": "I was impressed with the timeliness of our server. The food was good except the brocolli, it wasn't seasoned. Bread is the best and the entrees were good too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-kM6cGgaFJgv-ma052Rzdw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Serving size is pediatric bordering neonatal.lol",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-kM6cGgaFJgv-ma052Rzdw/o.jpg"
      },
      {
        "img_id": "udA2z1fEKqB9SVZceLBAXg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. The meal serving sizes were generous.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/udA2z1fEKqB9SVZceLBAXg/o.jpg"
      },
      {
        "img_id": "A9J9Fi1RjAHBgauarD45sg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A9J9Fi1RjAHBgauarD45sg/o.jpg"
      }
    ],
    "user_id": "uKLPg9l1CJO_Mr0iVUSq3g"
  },
  "2aEeXqiz7LGyyCUgUNujug": {
    "date": "8/22/2017",
    "text": "This is a great place for authentic German food and ambiance. The owners put a lot of effort into making this feel German, even down to the architecture and landscaping.   The service is good, but the commitment is great. If there's an issue, they want to make it right. The food is delicious. Definitely try the desserts and dessert adult beverages. And the beer, obviously.  This is also a great place to go for the World Cup games when Germany is playing. The place gets packed and loud.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQHREFnzaNR0PogzFcXLsA"
  },
  "cNTKd53yXRgcjeMbZwc4gA": {
    "date": "6/29/2014",
    "text": "If you're looking for EVERYTHING German this is the spot. From decor and food to drinks and the staff's language skills and knowledge. It's a pretty awesome transition in atmosphere as soon as you walk in the door. The food is delicious as well - couldn't pronounce much of it, but tasted great!  Best tip about this place: The staff's knowledge and understanding of all German heritage. I asked about a million questions about the menu and traditions and this server was spot on!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3OVgSzJWCOhrzU-5UdEXOg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. menu front",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3OVgSzJWCOhrzU-5UdEXOg/o.jpg"
      },
      {
        "img_id": "6WhBcC4gZw6kddM9ppCchA",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. side salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6WhBcC4gZw6kddM9ppCchA/o.jpg"
      },
      {
        "img_id": "AJunTj3fVfxiq8l8TUPfvg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. something with chicken - yumm!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AJunTj3fVfxiq8l8TUPfvg/o.jpg"
      }
    ],
    "user_id": "F-TYd6eIvMIyInQrhW6oEA"
  },
  "NPncCejhwSQYCemkQ_S9AQ": {
    "date": "4/23/2017",
    "text": "Have you ever been to Germany? I lived there for 4 years and the food here competes with the food I had there. Everything from the salads, bread, and beer all the way to the main dish were amazing. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7wgObgG_DbdZTPuvgKxDyQ"
  },
  "xCDVBxwmB4iHr4A1QvgMUg": {
    "date": "8/17/2018",
    "text": "Love, love this restaurant!!' Awesome German food and service was wonderful!  Ask for Nick!!!  Several first timers with us and they can't wait to come back!   The accordion player made our night!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jn4ficNMIDcs8M3ssG70EA"
  },
  "Ob6_Dx2-AMyu7VINVIOYlw": {
    "date": "4/23/2017",
    "text": "My favourite German restaurant. A piece of Bavaria! Great staff and food quality. You should try the Sausages",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AlVb0bCuKc7zte3GwVhe6Q",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Schwäbische Wurstplatte",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AlVb0bCuKc7zte3GwVhe6Q/o.jpg"
      }
    ],
    "user_id": "R0Oa0R0oCDahaW6U3RZ8fA"
  },
  "U71f5NkIJi5lUIagahhxkA": {
    "date": "11/22/2017",
    "text": "We have moved away from Charlotte. We will miss Waldhorn very much. We have enjoyed the Sunday brunch and they have my favorite German beer. Hofbrau dunkel. The rouladen is almost as good as my mothers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9pca2cS-s3JnidTg11SDeA"
  },
  "w-H81eIliBOkv6phwea5FQ": {
    "date": "6/15/2018",
    "text": "This Restaurant is absolutely amazing!!  The bratwurst sandwich is absolutely heavenly with its delicious sauerkraut and great sausage.  My favorite desert is the apple strudel. I would highly recommend this restaurant because they have bunnies for sale",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vAHm8tjqzxEW6W92ggpguA"
  },
  "DoUel_FeJ1QDC4GrcIgxeA": {
    "date": "10/26/2016",
    "text": "The pretzel rolls and potato pancakes are amazing! Service was spectacular A+! First timers with no German background or experience and was highly impressed. The scenery, music, and ambiance was great. Definitely a hidden gem and worth a try :) we'll be back for sure. Great bar and drinks too, nothing disappointed.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CeqMAEO8bFfAd2oCRbA_Fw"
  },
  "62i3kill3VX7gmtcLtzLYw": {
    "date": "1/15/2018",
    "text": "First time last weekend at the Waldhorn an was not disappointed.  The menu selection was good and the food was excellent.  The wurst appetizer with the kraut was enjoyed by our whole table and all the different plates and dessert was very good.    Nice to have a little accordion music in the weekends, too.  Staff is very friendly and helpful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hX4f6rBlI8UVrtz6rAbGGA"
  },
  "T2S8tDprVs-L76zU2JqVlw": {
    "date": "8/6/2015",
    "text": "At the end of a lovely visit with our German friends, we went to the Sunday brunch at Waldhorn to try all the traditional dishes and see if  Our friends found them to be authentic. The answer was a resounding yes! From the cucumber salad to the red cabbage, the sausages, Sauerkrauts and pork dishes were perfect. We stayed until 12 so we could have a Spaten as well.  The added bonus was several breakfast and 'american' items were also served, so our kids could try new things, but also have some familiar dishes as well.  We will definitely return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_v8NgQgIJoKj7Fzep_enDw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_v8NgQgIJoKj7Fzep_enDw/o.jpg"
      }
    ],
    "user_id": "_NI2yzWsCLaVfSdIwHRliA"
  },
  "kb3D8cemjgW_gqnaivkZbg": {
    "date": "7/9/2013",
    "text": "After looking at the website and then going to Waldhorn for the first time, we were pleasantly surprised. The website doesn't do the restaurant justice. The decor is very German and has a nice family atmosphere.   The staff was very friendly and knowledgeable of the menu. We ate the wienerschnitzel and veal with mushrooms over pasta. Both dishes were exactly what we expected. My husband being german, we had high expectations.  The fries were great especially dipped in mayonnaise.  He had the Paulaner Hefeweizen  1/2 liter and felt like he was in Germany.    I would highly recommend this restaurant to anyone looking for a good german meal at a reasonable price. We did not have any complaints.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "s7Qcs3WfT68G3zAsID-VLg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Rahmgeschnetzeltes mit spaetzle",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/s7Qcs3WfT68G3zAsID-VLg/o.jpg"
      },
      {
        "img_id": "itBif_rPxOUcwxx3hd9IRg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Wienerschnitzel mit pommes frites und rotkihl",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/itBif_rPxOUcwxx3hd9IRg/o.jpg"
      },
      {
        "img_id": "miH0uNWWmNV08ulliogoMg",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States. Impressive!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/miH0uNWWmNV08ulliogoMg/o.jpg"
      }
    ],
    "user_id": "1T4L-307j6UuGLHObfJ5xg"
  },
  "YFau-yESDenvGDKDPQRaFA": {
    "date": "1/14/2017",
    "text": "First time in, lunch on a Saturday around noon.  No wait for seating, server was friendly.  The potato pancakes and applesauce were a great starter.  I had the bratwurst, that pretzel roll is terrific, very soft and fresh, not too think and not chewy at all.  It's a really great brat.  I also had the German potato salad for a side but was too full to eat it, it was much better than other versions I have tried.  I read about their Sunday brunch while I was there, seems like a great way to check out more of their menu.    The one negative thing is, it was pretty cold and drafty so I had to leave my light jacket on while I ate, and found myself wishing I had worn a heavier one.  Perhaps it was just the area where we were seated.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vjcjI3s90PgW2_vHhhOlMw",
        "caption": "Photo of Waldhorn Restaurant - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vjcjI3s90PgW2_vHhhOlMw/o.jpg"
      }
    ],
    "user_id": "uaKkElyWMAQC5m3KjuM7mw"
  },
  "HnSLBOuTqC0uc0ovC8ctIw": {
    "date": "10/4/2016",
    "text": "The Waldhorn is just a fun place with awesome, authentic German fare. I've visited for lunch and dinner and enjoyed every dish I've tried. Don't skip on the heavenly pretzel rolls.    Make sure to visit their Oktoberfest celebration. Bring your own Liter steins and dance to the music of a live band.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PVyZXgOkVtnU6966FDFhuw"
  },
  "MJtcmxdw0KRyE4jP1FHdxQ": {
    "date": "8/11/2016",
    "text": "We visited for brunch this past Sunday, it was reasonable at $16 and included a ton of different (tasty) options. It's not one of those buffets that are gross and unattended, all of the food was very fresh. My husband was a very happy man, and overall we left pleasantly stuffed Augustus Gloop-style.   My favorites; the pretzel rolls with mustard, sauerkraut, and surprisingly the desserts...all of them!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "Hxlmu_6f2br0VAb0oE4tyQ": {
    "date": "11/22/2017",
    "text": "This is about as authentic of a German restaurant as you can find around here. They have a great selection of beer, many of which are difficult to find elsewhere. The food is always great, though beware the after effects of overindulgence in red cabbage. If you're looking to try German cuisine or already love it, this is the place to sate your desires.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1RSK00GeHDub1zc0-T73QA"
  },
  "fPXDNhza8QWWVBXn6XJI2g": {
    "date": "3/28/2017",
    "text": "Absolutely delicious German food...Bavarian vibe.  My favorite is the Schweinschnitzel (breaded pork loin)...I get extra brown sauce.  If you are not a purist, you can get something besides the red cabbage...but why???  Their spaetzle is very good as well.    The management is very attentive.  Sometimes they have a wandering accordion player to serenade you (after 7...perhaps only on weekends...not sure).  Don't go in hoping for high brow...you will be disappointed, but if you want something that takes you to Germany...this is the ticket.  I am always happy with my meal and love to bring friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k_hR5J41N25QHTluoVB-uA"
  },
  "vPyd0O_G2yVziKEbHdKBpg": {
    "date": "12/22/2017",
    "text": "Amazing food, service and music! 10/10 definitely will be coming back soon. The best schnitzel in Charlotte but I don't have anything to compare it to!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-PzgVdmd-8mhGM7noSvlRQ"
  },
  "HZhIfJCHq4bWdTTzs3nM5g": {
    "date": "1/10/2015",
    "text": "Took my 96 year old dad here for lunch.  He wanted potato pancakes without looking at the menu.  We ordered them and he LOVED them.  Said they were the best he has had and wants to go back for more.  I had a very nice veal and mushroom \"stew\" on top of Spatzle, the German home made egg noodles.  They were excellent and when I gave some to my dad he said that next time he wants a large bowl of Spatzle with butter and salt.  No, he is not really easy to please, but the Waldhorn pleases him and that pleased us.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 7
    },
    "photos": [],
    "user_id": "cyuDrrG5eEK-TZI867MUPA"
  },
  "1CBsoTJeheJq3qrzHEPWXg": {
    "date": "10/1/2017",
    "text": "Authentic food. Great staff, very friendly. Many people are locals and are regulars. Even their desserts are yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7YoRbJXcMaA0FgpPpvV3Ig"
  },
  "dqkjzTPh1oCmsPmvdsm6pQ": {
    "date": "12/23/2014",
    "text": "Unreal German food in a decent environment with excellent service! I also love the plethora of German beer. It is sooooo good! I had the Rindsrouladen... Braised Beef Rouladen stuffed with bacon, onions and pickle. It was delicous in every way.The side items were Spatzle and red cabbage... also excellent. A pleasant surprise was the house salad. Ridiculously good. Fresh mixed greens. Perfect amount of dressing. and underneath in four little piles were surprises of carrot, pasta, cabbage, and another Item I have forgotten. All delicious little piles. Like gifts! Oh, and I almost forgot the BREAD! Good God! The pretzel rolls with a little butter are otherworldly. I want to come back here so bad ... but living in KC it is going to be a while.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "k0m5nvgAIIA24t_iPZOAsw"
  },
  "5IitLNsIEgUjLWfvY5mEcA": {
    "date": "7/4/2017",
    "text": "Waldhorn never fails to provide the best food! I've been at least once per month in the last year and a half, and I have ordered the same meal every single time. The wiener schnitzel is amazing!! On the menu it's called Schweineschnitzel \"Wiener Art\" and it comes in two different sizes depending on your hunger level, and always comes with a side of spatzle and red cabbage. If you're not familiar with schnitzel, it is a flattened, breaded, and fried piece of pork (with a veal option available if you're interested) and it will come with a brown sauce over the top. Save room for dessert because the Black Forest cake & apple strudel are so fresh and delicious. Waldhorn also offers beer specials throughout the week which pair nicely with the schnitzel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K5w2NKXOTEbYrPq2gHvKTA"
  },
  "nsxPzm3h0vjoHbOaO7US7g": {
    "date": "11/4/2017",
    "text": "Used to come here a lot, but haven't been back as much because it's a little out of the way for us now.  My work had an event for Oktoberfest, and I have never had better service, especially when being part of a big group. They have great, interesting beers, and the food is interestingly tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OWcjZUvOFMT7HPOYDSGfqg"
  },
  "Ni071S1q5vH6UjqoORBs5g": {
    "date": "10/20/2016",
    "text": "Always enjoy their Sunday buffet.  Just wish I could get a table, but it does bode well when the restaurant is full of customers.  The best German food I've had since I was in Germany.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vF1UjblVnLV66IF4mhtS8g"
  },
  "pFDD81gbtsD7tbvUpKUetg": {
    "date": "6/24/2013",
    "text": "Jenna took great care of us! Food and service was top notch! 10/10 Jenna, congrats on the new job!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2VHDB-VvAWWTa6M06vaMKg"
  },
  "pqUMzUn77maQFofhw_VnEA": {
    "date": "3/26/2012",
    "text": "The 1st time I have ever ate at this location. You really have to enjoy german food in order to appreciate some of the dishes that is server on the brunch buffet during Sundays. The food that I ate was very tasteful and I really enjoyed being there. During their sunday brunch they will also make omlets on demand with all sorts of different fillings and toppings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XtGO8YyPbo_LjaZinrRRoQ"
  },
  "yR07otNY7-lH1PrHt73oMg": {
    "date": "7/3/2011",
    "text": "Fairly authentic german food. Great atmosphere. Liked it more before I actually went to Europe and had actual german food. Never going to be quite the same but I still love it! Good place to go for something different and tasty!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TJiiV-OS_w4U7zV_t7aQww"
  },
  "AjNCTgg5y1TII8C4wVV3Bg": {
    "date": "1/19/2014",
    "text": "Fabulous place!!!   Went during Queens Feast Restaurant week and it was very organized and accommodating . Food and staff could not be better! Definitely will come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q7OY88IOF6Hu_pcvl_jrow"
  },
  "mTDYHx4bXwImGKoLAtHS_w": {
    "date": "8/2/2013",
    "text": "Yay!  Good German food in Charlotte!  Traveling accordion player.  Attentive service.  Jagerschnitzel.  Pretzel rolls.  Need I say more?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F3sAEUJtQ9envLH-rpbflA"
  },
  "nai_l1osGRsJBsW_Evve3w": {
    "date": "10/6/2013",
    "text": "We had a dinner reservation for 19 people on one of the busiest weekends of the year. The food, service and staff were excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jxzShDnGb83RbW3hDsHA5g"
  },
  "NYjI-BYmE_72rwnxUaMcYw": {
    "date": "6/18/2013",
    "text": "It was the best meal I have had in weeks. Friendly staff, incredible desserts and very quiet witch I liked.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bky1dm2wLGQFbSt-Cl_0Lg"
  },
  "7kCxoiDtW9yse5XJSElf0A": {
    "date": "9/19/2010",
    "text": "Just came back from their Sunday Brunch. It was about $15 per person unless you have kids under 4 which are free. The brunch is a great way to try a lot of items in one sitting. They have an omelet station which was decent but I came for the German food. Also at the omelet station was roast beef which was just OK. They have about 30 other lunch items on the buffet. The best part by far is the dessert section which included about 10 additional items. It was not the best German I have had but I would not expect that from a buffet. I will be back to try a menu item another day.   The staff was very friendly and the building had a great German feel.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "92vjbNNapZLe84WLE2QIBw"
  },
  "fRsmNwjOoIpzBtEt7EtEPw": {
    "date": "10/7/2013",
    "text": "My wife and I had our wedding reception here last month and we can't sing their praises enough!  They made it so easy for us so we could focus our attention on everything from actually getting married to coordinating out of town guests joining us.  The staff was helpful, good-natured, seem to be enjoying themselves as much as our guests (our reception was a little unconventional).  Oh, and did I mention the food?  The sausage combination was juicy and delicious, the veggies were crisp and delicious, the pork loin was so tender and the sauce was creamy and tangy, the salad options were all that you could expect from a fine German restaurant (make some extra room for the red cabbage especially), and of course the delicious spatzle made the meal just all we could've hoped for.  If you haven't been here yet, might I suggest checking out the Sunday brunch buffet first to get a good feel for what they have to offer.  This place will hold a special place in our hearts for taking so much stress out of our big day.  :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KC85LeqWvfEhUpasA41Iaw"
  },
  "wXIi3BmbtMvDB9YZDAF7CQ": {
    "date": "8/21/2013",
    "text": "You know a place is good when the servers are enthusiastic about the food themselves. Great dinner with dessert of Apfelstrudel - fantastic. Service solid and efficient, smiles all round. Should have been busier though, they deserve to be",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YGJ8U8w2H_1MOOzPjWkPmA"
  },
  "yO6Yl77RKnmCbclz-Fpjqg": {
    "date": "8/9/2010",
    "text": "Stopped here on way from Charlotte airport.  Good food and very tasty; there are really big servings here too.  Great beer selection though I am not much of a drinker.  The Chocolate chip cheesecake is extremely tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZA2nXlv4NTXdpLXJ-0H8BA"
  },
  "oYnHxqWHeM1_Ol6gSHZREA": {
    "date": "12/7/2009",
    "text": "Been to Germany? If not, then go. If yes, then no. When I think of German food, I think of the smells of Frankfurt Am Main or the hip little Back Factory spots around Berlin. This place lacks something, it may be Germans. I dunno. Spend 30 bucks on 8 euros worth of food. Do the math it doesn't add up.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "abZtGdO5wgXUBjolcZgb7Q"
  },
  "p_susMtNkaWW3WYJ4tA1WQ": {
    "date": "3/6/2011",
    "text": "Went for the buffet on Sunday.  As another reviewer said it was set up weird.  Grew up on German food and this didn't compare. Probably good for a restaurant though. Should try ordering from the menu it might be better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sHHjAcCshW2K1v48g1FEVA"
  },
  "8IzR95EGM1qd_WydsXyVEQ": {
    "date": "6/23/2009",
    "text": "I am a fan of the beer selection, and beer selection only- they have a great mix of really good German beer and seem to rotate it seasonally. As for the food, it's not fair for me to comment- I just don't care for German cuisine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sz84_SyrNYi4wsX__6haLQ"
  },
  "ija-qbFtKurP01rKnBwO8g": {
    "date": "9/22/2012",
    "text": "Went there as I was visiting my parents, they took me here for dinner and first weekend of Oktoberfest.  I recall having a great German meal about 14 years ago and its always been in my \"top 5 meals ever\" memory, and this place met and surpassed it. We ordered the smoked trout appetizer to get going and nibbled on that with the pretzel rolls dropped off on our table.  Both were great. We had a great server who recommended the beer (a dark wheat, can't recall the exact name) and the sampler plate. I shrugged off the sampler plate as too easy a selection, but went with it anyway.  It was phenomenal - noodles, the sauce, the brat, the rouladan (sp?) meat thing, and pork slice was so tasty. Servings were huge, none of us finished it. After dinner we got free passes to the beer tent outside, headed there for more beer and great band for few hours. Overall, great happy employees, great food, and just a wonderful evening, worthy of the 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TbhZNKYtkOIJ5C_k0cN2xQ"
  },
  "eoomQaQPbPRiiq2vUxvtXg": {
    "date": "1/4/2010",
    "text": "Went for dinner. Sat down in a nice booth with a \"CIA interrogation room\" light bulb for lighting. Please take the wattage below 100 watts   Ordered a sausage variety appetiser, sure would have been nice to know which ones were which (for future reference).  Dinner rolls were free.  I enjoyed my Ribeye steak. I can't speak for the others around the table. If you know you're going to eat German food and you know it's going to be \"heavy\" food, then you should enjoy this restaurant. Beer selection is great.  I will return to drink more beer and try more food specials. Overall its good food but the cost might keep me going back frequently.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Phokf0d5zreEKdpA2HIjg"
  },
  "tWy9gWDk0_rEjYs8aChmRg": {
    "date": "10/9/2011",
    "text": "Full disclosure here, I'm part German, I'm married to a German, I've traveled to Germany once and I really love beer. Ok, so we hit up Waldhorn last night for my dad's 75th birthday and Oktoberfest. We had dinner inside before moving out to the tent. We got some apps to start, potato pancakes & a brats tray. The pancakes w/ apple sauce were fantastic, nice & crispy edges too. Brats were Brats, excellent. I also enjoyed the sauerkraut. For the entree, I ordered the Sauerbraten. It was ok. I didn't care for the spatzle, it was just a little soft for my liking but the red cabbage was tasty & the beef had good flavor but a little over cooked. Next time, I'll go with the brats! For dessert I had the apple strudel. Now this is a dessert!! I'll go back just for the apple strudel anytime, it was that good!  Full of flavor w/ a nice sprinkle of cinnamon on top of everything, including the ice cream. Great presentation too! After dinner we moved to the tent. As some of the others have said, there were lines everywhere. Since we had dinner there, we got into the tent for free but still had to stand in line to buy beer tickets and then another line to buy beer. They moved pretty quickly. Oh, the beer was awesome. I was drinking the Oktoberfest. Lots of people under the tent and all around and everyone was having a good time. All in all, we had great time and it's as close to Germany as you'll find in the Charlotte area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "na1ZD7bFvAUHXiV61CrCDw"
  },
  "GlHjDAfunlmjeuIwGMQ1fQ": {
    "date": "6/12/2010",
    "text": "Due to my job I travel weekly and eat out a ton so I'm pretty hard to impress.  With that being said I LOVE this place!  Every time I go the food is great and the beer is awesome.  If you have never tried the Waldhorn you should check it out, I think you will be impressed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T60kz3fMj1NRjLwlYRviGQ"
  },
  "Z6kQW4C9gUpc9ujP_kUirA": {
    "date": "8/24/2012",
    "text": "My daughter and I love this restaurant and we're not even close to being German. LOL.  Our waitperson, Annette, was wonderful. I tried a different dish today and didn't like it (not used to some German foods I guess) although I did like the sides. Long story short, the manager did not charge me for my entree.  I did not ask him to do that. We had the apple streusel with ice cream for dessert. It is to die for. We love the sausage appetizer.  We will definitely return. Great atmosphere too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OB5I_oHz_EOaMBeP05tETw"
  },
  "_4FAOvXhPoRYVcMZyc-q-A": {
    "date": "3/29/2011",
    "text": "This place is yummy!  We had great food and wonderful service.  Admittedly I am not completely familiar with GERMAN food, but I am familiar with GOOD food, and this food was GREAT!  The flounder was spot on!  And the bread pudding?  Mmmmm, salivating just thinking about it!  The kids really enjoyed their ice cream clowns and now I just need to come up with another excuse to go back to Waldhorn.  We live too far out to be regulars!  Bummer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rs806DPFUCfAH0mmVF0Afg"
  }
}