{
  "Xyos0hCwoyVX4hZ7wcYvmg": {
    "date": "8/26/2013",
    "text": "A friend introduced me to this restaurant and I loved it. At first glance it does look a bit uninviting but trust me the service is friendly and the food is AMAZING! Wear your fat pants because the servings are huge and you will want to eat it all. Great options for vegetarians!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hk0tvM8mU7b3bvHpMq0WDg"
  },
  "bkkLQ_7HDagiCeD6fJiv2g": {
    "date": "1/13/2011",
    "text": "I haven't had the food here, but I plan to visit it soon.  My friend was in town visiting and we were just driving around the city late at night chatting and when we drove by and saw the bright neon open sign we both looked at each other and just knew we should stop.  We thought they might have some sort of coffee.    We got a little nervous because it is in a really random spot, it was past midnight, and the door hours said that they should be closed.  The windows were tinted dark and when you looked through the door all you could see was a beaded curtain.  We assumed that it would be full of guys at the bar or something.  I peeked in the tinted windows as best I could and saw that I was partially right... only all the eyes in the place were looking back at me!  Haha, well at that point, we had to at least step foot inside and see what was going on.    They had an Ethiopian movie playing on the big screen above the windows which explained why everyone was looking my way when I peeked in!  The espresso with milk was really good and it was a memorable experience sitting there watching the (thankfully subtitled) movie with a couple of dozen other Ethiopian guys lol.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bwgMLL8Lq021V0n7lAkADA"
  },
  "8VMEVappJmv6a3mtfeIk8Q": {
    "date": "1/12/2011",
    "text": "If you can ignore the interior (which smells like tobacco pipe smoke and is a little run down), the restaurant owner's crazy friends, crazy Ethiopian tv shows, and the location, you'll be in for a treat. Very authentic and balanced Eritrean/Ethiopian food.  Mostly meat dishes on the menu with a three vegetarian options. The proportions are HUGE and they give you more than enough injera to finish your dish (and someone else's!).  Friendly, hole in the wall place. I'll definitely return (for take out only).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "52BSd0kY8AndWPrybOMMsg"
  },
  "NFemwC1y9uW7hzB9icmcLA": {
    "date": "12/12/2012",
    "text": "Update -- went back here and got the lamb (#2 I think) and it was just okay...stick to the vegetarian sampler platter.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SB7Dd-10J_t6fgA8BMa_-Q"
  },
  "NCBrZeaShHUZNEfvpct7YA": {
    "date": "10/23/2011",
    "text": "This is good Ethiopean/Eritrean food. Lots of flavor. I went with one of the combos and was overall satisfied with the taste and serving size. The cubed meat was undercooked in my opinion . . . too tough and chewy. I especially enjoyed the spicy lentils. I am tempted to take a star away for service. It was pretty much a one man operation. When we arrived it took a long time for him to even take our order because he was on a personal call. The tables had not been cleared or cleaned. For that reason alone, I probably will not return.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fvj9dV4e6Fu5T5tM98dCVQ"
  },
  "uygWbONv1bBwydSoG_0W9A": {
    "date": "1/23/2012",
    "text": "My wife and I went to Red Sea based on excellent Yelp reviews.  It was the most interesting eating experience of our life.  You get no eating utensils.  You eat with your hands and Ethiopian bread.  We had the vegetarian dish and the lamb dish.  Both were incredibly tasty.  The owner came to our table several times to make sure we were doing okay.  He explained some Ethiopian stuff regarding the food.  He even brought out some spices for us to sample.  Try this restaurant if you are looking for a food adventure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "1m-CNRi_Dem5zgBJ3kMFbg"
  },
  "7wYchICr5eN2N6BnCxnizQ": {
    "date": "11/1/2014",
    "text": "I tried the samplier here and thought it was pretty good.  I liked the authentic vibe of this place, but I was sensitive to the insence.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBgHgNdmouKAJ0pDpTwT_A"
  },
  "j3-K2OfntI4ThUp658-w7Q": {
    "date": "8/1/2011",
    "text": "big Ethiopian sized portions .. Your best bet is take a fellow heat seeker and get a combo plate , we had fish , chicken and veggies combo.. The veg was mostly lentils with a handful of lettuce salad but hit the spot. They also have a few bottle beers and that Honey Wine that they are famous for. Moderately priced I'll be back whenever I visit Charlotte. I live in Atlanta but to me this type of food is missing in Charlotte bcz I didnt see many foreigners around town. Don't go if you don't eat hot food but if you haven't had this type of cuisine the waitress seemed more than willing to explain what the dishes are .. And oh, don't expect fork and knife , the food is eaten with Injeera, ethiopian bread that resembles a sponge. It has a sour tastes from being fermented.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "C7nyhFw9US8mqvPEsU244A"
  },
  "B68YxzhSimDb2hT5RC8ibg": {
    "date": "8/5/2012",
    "text": "Definitely worth a try.  The food is served on and with a special bread (injerra??) that you basically use as a fork. It's similar to a pancake or crepe so it's absorbs a the juices and favors of the different meats that you choose. It is served family-style on a big dish in the center of the table for everyone to pick at.  Definitely different, flavorful, and a cool cultural experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "32bCGyuOX8-1Lu5pnL8Lkw"
  },
  "Swlbc5Qnw2j1J9mnv60pjQ": {
    "date": "6/17/2010",
    "text": "Though this place is small and very unassuming- their kitchen produces some of the finest tastes! Great for vegetarians :) my husband and I loved eating there! Their honey wine and vegetarian option was filling as well as tasty.  Looking for a quiet evening with a homely feel- this would be great:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ga6FdxCkyfMeGTYiCC5zCQ"
  },
  "W-STzCCAJb_aYwk_vNsLvQ": {
    "date": "3/12/2012",
    "text": "Great food!  Pleasant staff.  The food offered a flavorful break from the ordinary meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iGGP0gxdJ42bDQuiVxXonQ"
  },
  "yC3j1_xPvFnPxXfoROYdUw": {
    "date": "2/18/2016",
    "text": "Hard on small parties-The food was very good, but the service was pretty rough. It started when I walked in and asked for a larger table. Because I was eating alone, I planned to do some work on my laptop during the meal. The available two-top tables were not big enough to fit my computer and the food. I was initially denied a table for four, on the grounds that they were all reserved. Though ultimately moved, I felt like it was more because I was alone. The four-tops never filled up completely while I was at the restaurant. Things continued when I ordered a combo platter, and was not initially served the side of Injera and extra dinner plate that the table next to me got with theirs (all parties got an extra plate). The entree plate and underlying piece of Injera were covered with food, so it would have been very difficult to eat without. Again, though, I felt like they didn't want to give me \"extra\" because I was alone. I had to ask. All in all, I would still recommend because of the food itself, but I would be sure to ask the questions and stick up for yourself if you are in a smaller party to make sure you get the service you deserve.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2TTCBTJrtegpxGFNOcSz6Q"
  },
  "Gh5rYiEqim6VKnD4lubN7w": {
    "date": "3/27/2011",
    "text": "Large portions and delicious food, Red Sea hit the spot! I needed an Ethiopian fix after gorging myself on it in the Silver Spring, MD area with its wall to wall Ethiopian restaurants.  This one would fit right in!  I agree with another commenter who said there's a strange vibe.  It's probably the people who openly stare at you as you eat.  That wasn't enough to take my enjoyment, though!  Can't wait to go back again!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DS5Lt_JD1apx9Taur82URg"
  },
  "xUOqnsEGrmolQt0czrSm-g": {
    "date": "4/26/2011",
    "text": "Tried to have dimmer here. 5:12 and still closed. No note or sign for explanation.  Unfortunate because I would have enjoyed trying it!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1fxqEXSf3vCiV-Tr3HGd5g"
  },
  "1Hug2JZ8cGpq0cL8sW6R1w": {
    "date": "3/9/2011",
    "text": "I think that the food at Red Sea is fantastic.  The portions are large, seasoned perfectly and fresh.  The ambience here is a little weird, though.  I can't really can't place my finger on what it is, but it's just a little strange.  It's not the decor or the dive-y nature of the restaurant; it's something completely unassociated to those things.  You'll have to give it a try to see what I mean.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "05A1WpXkjCbVHCodTSc6sg"
  },
  "mNkHUJyQe4jpvL6JHW-K5A": {
    "date": "11/9/2010",
    "text": "Great stuff. Small place but fantastic food",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MhulcOVGHzK0SOHG13ln8Q"
  },
  "fgSy_S54m_AO2LPNwB74rg": {
    "date": "3/19/2010",
    "text": "Low-key, affordable, relaxing place with delicious food! Had the Tibsi combo and it was plenty for two to split. Watch out for the spicy lentils and vegetables though! When they say they're spicy, they're talking LAVA hot! Service when we went was perfuctory, but fast.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "V6J7mvlNdLue_8nx0cdpMA"
  },
  "-BufAAPjaRV7MHKWxP3pOg": {
    "date": "8/27/2008",
    "text": "The place is a dump.  The service is frequently spotty.  The food is STELLAR!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "FAxwG5UGRi0fIIIWJq7eEg"
  },
  "aMY7zh1rYFmwfBR2Yp5RRA": {
    "date": "2/3/2008",
    "text": "Incredibly authentic Ethiopian restaurant, an exciting adventure from eastern Africa. Delicious food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "YiEE1T3IU7TFYiOxGJp9Zw"
  },
  "61gp_6FaW-HB-Sv2rUScWQ": {
    "date": "2/22/2010",
    "text": "Red Sea was recommended by an Eritrean friend. (Eritrea used to be part of Ethiopia). I love Ethiopian vegetarian food and this was as good as any. Telka, the owner, waited on us and provided good service and conversation. Red Sea is a fun authentic little place - looking forward to going back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "DNuyuvJMCREP7qSF-vDy4A"
  },
  "VGPOsz_B8wa48EUQ4a2uwQ": {
    "date": "9/23/2011",
    "text": "Food was definitely flavorful and lived up to what I was expecting, the atmosphere itself was a bit lacking.  It was a group of five of us who ventured in here - we were the only ones in the restaurant the entire time and they had an obscure Don Cheadle movie playing in the background.  Made for an interesting experience.  Our server was great, [AND VERY PATIENT] since we (mostly me) were asking questions and asking for recommendations.  I was feeling very adventurous that night so I ordered the Honey Wine (looked interesting on the drink menu).  Later I pulled up some yelp reviews while waiting for the food to come out and the Honey Wine was one of the \"must tries\".  SAMBUSA appetizers were delicious.  A bit hard to share, but we got over our shyness and started ripping them up with hands.  Definitely a different experience using hands instead of the normal fork and knife.  The food came out on huge plates..... our table wasn't quite big enough for all the plates, but our server got creative and brought over a tv dinner table to place things on the side.  I had the #4 which was beef (spicy) and a couple of sides that I just ate up.  By the end of the meal, I was thoroughly stuffed to capacity.  Everything was great and the warm burning in my mouth from the spice was a nice change from normal food.  I plan on trying their chicken and vegetarian dishes next!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "2oCMsZ0hyMP2D7DFnsAQ4A": {
    "date": "3/8/2017",
    "text": "Excellent meal here! So many great flavors and textures, our Red Sea plate was enough to feed 2 of us and the dosa served with it is phenomanal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5jrNhiP3g6IPeIA0eTj0tA"
  },
  "s7BiEw3Mx--nwffG74LTOw": {
    "date": "9/23/2015",
    "text": "This is a place you can drive by 1,000 times and not think twice but, take our advice and pull in! It is completely worth it! The staff was super nice and the food is totally different than what most of Charlotte offers! Using your hands for utensils and having homemade honey wine! Great experience that will keep us going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tLQjrTvidY_0HGtzHemhSA"
  },
  "HjKdr9sIDyAmjl2_Zg4RNA": {
    "date": "5/29/2015",
    "text": "I've lived in Charlotte for 26 years and I can't believe I've never been until now!  The food is fresh and plentiful,  the waitress was kind and courteous! The flavors are intricate and incredible!  Do not expect your food to arrive quickly.  It does take time but the wait is so worth it!  I'm so lucky I work close by;  this is going to be a lunch favorite for sure!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZmoseR7HVablEeN7RFcEzQ"
  },
  "j_hodoXYSCNJNuX7iINUHw": {
    "date": "1/20/2017",
    "text": "$9.99 Lunch specials, and the food is delicious. My kids eat all their vegetables!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJV2NaEUNPMffsQFNFAi3A"
  },
  "msqGSeax1ODtSt4iU3B2Dg": {
    "date": "5/26/2015",
    "text": "How is my review only the fourth? I came by happenstance, and am pleased I did. I told the hostess to bring whatever the cook wanted to put together, and the meal I had (spicy lamb) was great. A previous review hit it on the head: authentic. The food was flavorful and they use good cuts of meat. I had a huge dinner for under $12, and the lunch specials are even cheaper. If I was going to school in Charlotte I'd be eating here regularly. Very friendly and helpful staff, will return on my next trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "73gNymAW1cqO6FtR9O65RA"
  },
  "gc4UIrqMyeJcpcv2DhqKhQ": {
    "date": "12/17/2016",
    "text": "Lots of seating and parking at the new location compared to the previous site. Same great food and nice staff. We love to get the combos because you get a little of everything (beef, chicken, lamb and vegetables).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cinu04Hv3x7OHxHqYCGE6Q"
  },
  "BMECmv1ah9S8NT1rQWdcgw": {
    "date": "11/24/2014",
    "text": "I ate at this little hole in the wall for the first time last night, and I loved it!  The food was really tasty, the injera was springy and not too sour, and the staff was friendly and willing to explain unfamiliar items on the menu.  It was a cold, wet night, so the hot tea with cardamom and the thick, black coffee were welcome additions.  We will definitely visit this place again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NCIC_YYQxjc6ai2XWEYL6g"
  },
  "BnUzaPh6G5QtJYj5nJUV6g": {
    "date": "10/7/2015",
    "text": "My boyfriend took me here for my birthday because I've always wanted to try Ethiopian food. Very small quaint location that you could miss if you weren't looking for it. The gentleman who took care of us was very kind and explained everything to me. The food was amazing! Loved everything er tried!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zxjdko2tNOxCpvKQq4oRJg"
  },
  "xNdZ6fEtUvO5bX9iL9na9w": {
    "date": "7/2/2010",
    "text": "Located on a corner with several other ethnic cuisine restaurants, Red Sea's front doesn't stand out and if you aren't paying attention, you'll pass right by without noticing (like we did). Plenty of parking in front and back on a Weds night. Decor was worn but comfortable, and you have the choice of sitting at the little round tables (for sharing food) or at a larger table. We were the only ones in the place for a while so service was fantastic. Our waitress was really nice and answered any questions we had.   I had the Vegetarian option and my friend got the first chicken choice (I don't recall the name) and both were served on one large piece of injera. The waitress asked if we wanted separate plates so the meat doesn't mesh with the veggie entree, but I'm not picky about my self imposed vegetarianism. I was told the chicken was very well flavored and the sauce it was in was dang good. My veggie entree consisted of 5-6 portions of vegetable matter. I really couldn't tell you what was what, but it was all good. The spicy, onion-y dish was pretty spicy, so hurray for spicy lovers. They also provide a side of the injera to use while the plate injera is still serving as a plate. That was useful. I just like eating with my fingers.   Also had the honey wine that's not on the menu, but I did not like it, too alcohol-y. Then again, I'm not a huge wine drinker, so try it yourself for a different kind of wine.   Four stars for character and good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "53QaFbmZojYK0vv3RQagcw"
  },
  "nndjGRxA-BG70qwrBUecHA": {
    "date": "5/20/2015",
    "text": "It was ok. I guess I am not a big fan of Ethiopian food. Didn't really like the taste. However, they do give you a lot of food. Lunch special is 7.99",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U8QZO6s0F5d6xYd0RgQHUQ"
  },
  "7AWmKE2crhDeKPzK_zSLPg": {
    "date": "5/17/2012",
    "text": "Apparently they don't do Ethiopian mood music on Tuesday night. Instead they play infomercials for 20 minutes and then flip through the channels for the remainder of the meal, stopping briefly only to learn they were not subscribed to the station playing Brazilian Butts. Aside from the lack of auditory ambience, we enjoyed our 1st Ethiopian experience. Ordered the vegetarian option and while I'm not sure what all was on my spongy silverware replacement, I ate up and enjoyed it all.  Entertainment coupon saved us $11, thank you very much. We'll for sure come back with a coupon, but no guarantees otherwise.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jm67TDhh8t1VHPACeORuOg"
  },
  "JzZypSS6C0kPzvDZmbhvcg": {
    "date": "12/18/2013",
    "text": "The doho is amazing if you enjoy well seasoned chicken. Overall I haven't had anything I didn't love!! This restaurant is authentic in all aspects!! I would suggest eating at this restaurant if you want to know how it feels to eat in the home of Habesha.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "UrSAfMHtoiasENaQYwfBPA"
  },
  "8xWl4tAwHOlMKGNjIP9sSA": {
    "date": "10/12/2011",
    "text": "Really quite a great food journey when dining at Red Sea.  The service was very good and the waitress does her best to inform you of the dishes if you aren't sure what you're looking at (likely for most!).    The building isn't that new,  but that's just one of the reasons I like the place, it has some of it's own character.  It's small inside, but there was plenty of seating.    We got a lamb dish and a vegetarian dish because I heard good reviews on Yelp about the lentils (patting myself on the back for good advance reconnoitering!).   The waitress was thoughtful enough to check if there was a problem with mixing the meat and veggies, which to me is no problem but good thinking in the event a vegan and a normal person were eating together ;).  Food was all very good tasting and the injera (spongy leavened soda-ish flatbread) was more than enough, now if only Indian restaurants could be this generous with their Naan!  The honey wine is always a must, although I saw a bottle in the window that was of Armenian provenance which would be slightly disappointing if that is the only one available.  Other reviews claimed the dishes were spicy, but even our pepper based sauce wasn't all that spicy --- non-spicy options are also available if needed.  With all the injera I ate, I left feeling quite full, but the entrees were a little bit smaller than I had expected considering the $10-13 cost.  I would hope that the honey wine is of East African origin, however it still tasted good and is a worthy substitute if that is the only one readily available.  Highly Recommended  oh and cool music too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Cc9FbfwlwBvp__G6_SLvw"
  },
  "1g_qW3oixi9_kUDeZLxidw": {
    "date": "5/25/2016",
    "text": "Excellent food, good service, cool vibe. Definitely a keeper. They will soon be moving to Monroe Rd.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9wJr_EWf6c6Qgpj_WW6Jw"
  },
  "hnj-d15NzEE6YGw-TE8aiw": {
    "date": "4/2/2013",
    "text": "I really like kitfo. All of the Ethiopian restaurants in Charlotte have kitfo and gored gored on their menus, yet none of them will serve them to me. I ask if the kitfo is good, and they are like \"no no, white lady, order this delicious lamb tibs instead\". I'm never sure if it's because they don't believe I know I like kitfo, or if it's because they're warning me that it is not safe to eat raw meat in their particular restaurant on that particular day. Fortunately the lamb tibs was fairly tasty here at the Red Sea. The atmosphere's not much, the Asian-style serving platters are incongruous, and salad with italian dressing is definitely a waste of injera real estate, but on a scale of yuck to yum, it still came down on the yum side and sometimes that's all you need.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "fo3aQuxapB_QJ5lcCHOVIA"
  },
  "vzwaEIJXK0vHrH42cc8lQQ": {
    "date": "9/16/2011",
    "text": "Ahhh. That is the sigh of satisfaction I felt as I walked out of Red Sea.   It made me happy to find decent Ethiopian food in Charlotte, and duly impressed my formerly New York based foodie sister-in-law. How so? Well, the injera had just the right amount of sourness, the lamb tibes were tender and spicy, and in general, the lentils, collards, chicken and egg were all tasty. My only critique would be that we had to each order a dish, and I found portions to be small for the price...that said, it was plenty for us.   The staff was very friendly, and while the restaurant is small and simple, these are often the best places to eat at. Photos of Ethiopia adorn the walls and local art is displayed on the tables. The woman working there gladly talked about her hometown and accommodated my brother's special drink request.   This is a no frills place but the food is good. It's authentic. It's reasonably priced. It's satisfying. Go give it a whirl, and if you're not accustomed to spice, pair your dish with traditional Ethiopian honey wine or beer.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1LQpbQFOp0xEaWKO-0CIbQ"
  },
  "6vt-_Ej9IW0RhtwxS06LBQ": {
    "date": "12/3/2010",
    "text": "This place is a classic \"don't be fooled by the outside\" place. Located across from CPCC in an unassuming strip mall with a tiny parking lot, this little gem is just waiting to make your date more interesting, your mouth do a little dance and your wallet skip a beat!  I always go for lunch here because it's $5.99-$6.99 for the same size portions as dinner (dinner is around $10-$12). I always get the spicy chicken dish and await the fun.   To those who don't know (I didn't before I went here!), Ethiopian food doesn't come with utensils, instead it's plated on this spongy bread which you break off and use to pick up the food. It's amazing and like I mentioned above, a great place to take a date. Most people have probably never been to a place like this and it's an experience AND a meal which I like.  The meal comes on a large plate with the spongy bread and on top of it is a garden salad with a light Italian dressing, a pureed dish of some sort that's amazing, and the protein you've chosen with onions, spices and a sauce. Sometimes you'll get veggies and potatoes too, depending on what you order. I like it spicy and I always think they give a perfect amount of heat. Simple food that really speaks for itself is what you'll get here, but the portions are great so you'll never walk out hungry!  I've never tried dessert here, but I'd be willing to it if I ever had enough room left over! They do have soda in cans and beers in bottles. I believe this is a family owned place (husband/wife), as I have been going since I was 17 (I'm 24 now) and the wife has always been the waitress and is sometimes pregnant and sometimes not! :)  Do yourself a favor and check out this place. Bring a friend, a date, and enjoy the experience AND the food!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "AWLMwFVdUCPtmo1IbQL3eA"
  },
  "z5NCsXfaVGZh6o_Pee2LEw": {
    "date": "1/12/2011",
    "text": "Like some of the other reviewers have said, don't let the location or decor deter from enjoying some of the best Eritrean food you're ever going to find.    My kids, for some odd reason, love Ethiopian/Eritrean food, and we've tracked it down in New York, Chicago, DC, and our hometown, Philadelphia.  I think we were unanimous that this was the best that we had ever eaten.  The spices were fresh, intriguing, and well-balanced, and the quality of all the ingredients seemed very high.  Good injera, too.  We loved everything on our platter, and were treated well by the hostess.   It's not going to look like much when you walk in, but stick around and order everything--you won't regret it!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "A_MyOTx_o1DNd_UDp0vX0g"
  },
  "Xun7fsjBXIH4p3v8zs-MgQ": {
    "date": "7/16/2010",
    "text": "Meskerem is to Red Sea as Harris Teeter is to Food Lion.   As in, less atmosphere, spottier service, but good deals and (in some cases) surprisingly good food.   A complaint I often hear about Ethiopian is that it all tastes the same - whether that's actually True (I don't think so) or it's a result of our western minds being so used to each separate dish having, well, it's own, separate dish, that when it's all piled onto a delicious piece of Injera, the way we experience flavor shifts is a mystery to me. At Red Sea, there is no mistaking Wat for Alicha - the flavors in each dish (even just stewed lentils) are distinct. Some things are sweet - others salty. And there's none of this \"spice level\" stuff - you get the full range, when ordering a combo (at 10.99, veggie combo is a steal).  Dings - nuked Sambusas. Service was both good (presence, smiles) and cranky (unhappiness about splitting a bill 3 ways, each portion on a card). Warm, as in tired A/C. But really good, thoughtfully prepared food. Lovely.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 12,
      "cool": 6
    },
    "photos": [],
    "user_id": "whqfWVBj4x5EDboIVDOymQ"
  },
  "VjZbss5Zx8SpNGpFUx21nw": {
    "date": "4/8/2017",
    "text": "This place throws down the dopest edm events once a month. Plus open kitchen. Killer combo!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDBQBeIZayebk7HxD57gNw"
  },
  "W7re7kg1S5klIZIOC-cOjQ": {
    "date": "11/28/2016",
    "text": "Red Sea is finally open again at 4301 Monroe Rd. Food is still the BEST Ethiopian in Charlotte. We will be there often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_a1-OmTZ8u5AxGuSIvSkUw"
  },
  "fqjaEL137BlxgTurS0JcMg": {
    "date": "4/25/2016",
    "text": "I have never eaten Ethiopian food but the introduction of this type of food was authentic at this homestyle restaurant.   We ordered chicken and lamb dishes to eat all on one plate.  The owner taught us the manner in which to eat their food.    Nothing short of hmmm hmmm good!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YYJ_vFvQE-hKJ6CVh9lbGg"
  },
  "pz5kJMv35t0vc6lDRgdmNA": {
    "date": "3/13/2016",
    "text": "Oh my goodness!  My husband and I are vegetarians who try lots of different cuisines that are vegan/vegetarian-friendly.   I thoroughly enjoyed the vegetarian platter and honey wine.  I once read an article about honey wine and could not find it immediately.  So, I forgot it was in my \"to try once\" list until I saw it on Red Seas menu.  The food and wine are delish!   I love the indigenous ambience, the servers were attentive and the food was 5-stars!  I wanted to order a to-go plate but would rather visit Red Sea again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pH9tL9zrb9b71ZNx9jS2Fg"
  },
  "B-_mbwM7LQhdjTMkR5dIDg": {
    "date": "4/9/2017",
    "text": "This was our first time trying Ethiopian food. The owner brought us a sampler platter so we could try a lot of different things. He was very gracious and taught us about the cuisine and culture. The food was excellent and the owner was very friendly. We'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kg7zSton0vQc_y1oSBnF4g"
  },
  "hUDuG3BiVfj_CG7G-V-H0g": {
    "date": "2/27/2016",
    "text": "We are in town from Tampa, Florida. My husband mentioned last week that he wanted to try Ethiopian food so I researched Yelp and found this place. Before we left Florida I mapped it from our hotel and this place is in a great uptown location. The waitress was a sweetheart who explained everything to us first timers. The food was GREAT and the honey wine was Ah-mazing. We both ate and drank for less than $30",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "esWzoSbhcmpyGhiRlFijVw",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/esWzoSbhcmpyGhiRlFijVw/o.jpg"
      }
    ],
    "user_id": "KnAUJWNIhem8CzdNoJjZFg"
  },
  "OKtKBv4NOGARJb-IJ7uk_g": {
    "date": "9/8/2016",
    "text": "I love this place!  Does anyone know if they opened back up on Monroe Rd.?  What is the full address?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TAENRLWX5xR1hEvsj7ypJw"
  },
  "DOTnwkx2es-D-d_RjKwP0g": {
    "date": "12/28/2015",
    "text": "This is a must try. There were some picky and non-adventurous eaters in my group, and even they liked it.  Food: It's best to go with a group or at least one other person. You can order your food \"American style\", where everyone gets a dish, or you can order it the way Ethiopians would it eat- on a large platter where everyone can share. You get a large piece of injera (Ethiopian bread) that you use to scoop the food up. Yes, you essentially eat with your hands. The injera is slightly sour and very airy. The food itself is extremely tasty.  Service: I am not sure what to say here. The server was very friendly and kindly explained and suggested dishes to us, but the service is very slow. I would not hold that against Red Sea, though, as I am sure in Ethiopian culture dinner is viewed more so as a way for the family to gather and talk, as opposed to just for eating, so I imagine Ethiopians take their time, as opposed to how we Americans eat. So, just make sure to plan some extra time.  Price: The prices were more than fair. All but maybe one or two entrees can be had for $13-$15. Lentils and injera are served with the entrees. For what you get, the prices are excellent.  I will definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "99G0FvRcbxlQc8mWmnRLqA"
  },
  "yHtXxNNTHjGixGOWAXzMVA": {
    "date": "2/23/2017",
    "text": "The restaurant was pretty large. There were only about 3 tables seated and the service was so slow.  The waitress seemed uninterested.  I could not believe that they charged extra for mor Enjera! The Doro Wot is my fav dish and it was not the right color, did not have the right flavors. Needless to say I was disappointed.  The lamb tibs didn't have all of the flavor that it should have either. Overall i was very disappointed bc the of the lack of flavors.  I'm used to eating at Ethiopian Restaurants that cook more traditionally not watered down.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XGA4BVPVLYzpzQi-z8iUXw"
  },
  "cw_9rVcjiu2FOvIoE3Zx-Q": {
    "date": "6/10/2016",
    "text": "Just quick note : the location has changed! Red Sea  will be opening back in July 2016 at their new Monroe Rd location. Came back from Baltimore just find them closed aggggghhhh! Have no fear though i still think they have some of the best food on the east coast, from Baltimore to Atlanta!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "NDlHYKhawfq7-pa7xms_Ww"
  },
  "7kVdv0kfWgfVYDCEV9c8bQ": {
    "date": "2/7/2017",
    "text": "Have been wanting to try Red Sea since they were on Charlottetown Avenue. Now they are closer to me on Monroe! Split a Combo 15, with goat, chicken and egg, beats and collared greens. So much food with so much favor! Love all the different spices. Will definitely be coming back to try more, probably with a larger group ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b_OUlUV-sjdtAS5ECg1vAg",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States. Combo 15. Sooooo good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/b_OUlUV-sjdtAS5ECg1vAg/o.jpg"
      }
    ],
    "user_id": "U472T5oieckjZzVXNBzQEA"
  },
  "cbDcb5nvIaMIW2m4bYXj5w": {
    "date": "10/19/2015",
    "text": "I tried this spot because I had a coupon and hadn't had Ethiopian food in about 4 years.  I wasn't disappointed. The food was really good. We got a combination of chicken, beef, lamb and veggies. I do wish the beef was a little more tender but overall it had a lot for flavor and spice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0gZg8GKCS11qqzrKaMFexg",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0gZg8GKCS11qqzrKaMFexg/o.jpg"
      },
      {
        "img_id": "TiWglJQB3pLu09ylQHmZCw",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States. Beef, lamb, chicken, veggies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TiWglJQB3pLu09ylQHmZCw/o.jpg"
      }
    ],
    "user_id": "VX7mr93MlWe_N5gPkVJD-g"
  },
  "79_eZT2ThkaA5YAXFod7aw": {
    "date": "3/19/2013",
    "text": "Yesterday was my second dine at Red Sea (my first was about four years ago) since I have eaten at three other Ethiopian Restaurants and one of them several times...  Chicken!!!  Best Ethiopian Meat Dish I have eaten so far!  Spicy and FULL of Flavor!  Perfectly Prepared!!!!  Biggest difference must be the blend and volume of seasonings used!!!   Most Unique Timatim and Spiciest though my least favorite of all the ones I have eaten... I do not think it is on the menu...Also they prepared it with no Injera \"in\" the Timatim by our request!  Injera was very good for Injera... Funny every time I eat this bread I like it more!  Lentils, Mmmmm and Excellent version of this popular Ethiopian Dish! Maybe my favorite of all the Ethiopian Style Lentils  Collards very GREAT flavor, Perfect!  Cabbage A-OK, nice flavor,very similar to what you would expect.  Sambusa very flavorful though it was missing the usual accompanying Spicy Green Sauce, still Excellent flavor!  Chicken Taquitos (from the freezer section of a Grocery store) Awful!  Is this Tex-Mex on Ethiopian?  This was the only part of the meal that was a Total Disappointment..  Dishes are \"Made to order\" so it will take a little longer than you may expect if you are not used to eating at Very Good Ethiopian restaurants!  Service is OK, do not expect the man to be overly friendly until he knows you, do not expect your order to be 100% !  Still it is some very good food except the Taquitos!  With about 27 seats counting the Bar, Tables are far enough apart that it does not feel crowded!  This place becomes a \"Night Club\" later and you may notice the Huge Speakers...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1KYI912ToCnIDoXUCSs_eg",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1KYI912ToCnIDoXUCSs_eg/o.jpg"
      }
    ],
    "user_id": "Ug0ujy9-jd0Oc2nk3KIotA"
  },
  "ngq947KbUEC7zu0UjPcGtA": {
    "date": "12/13/2015",
    "text": "This place is a must try. We stumbled on it when the restaurant we were planning to visit that night was gone and I'm so happy we did. You must get the kitfo! We had chicken and lamb as well, and they were also delicious, but the kitfo was the hands down winner. Already looking forward to going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "orN8EDVb_uoZKLnMstTcyA"
  },
  "Ffwc_Yh1qxbJAtGEpY3XDg": {
    "date": "9/2/2011",
    "text": "My first experience with Ethiopian food was at this restaurant.  I wasn't really sure what to expect, and what came out was definitely not what I was thinking, lol.  Literally it was a giant round plate with a strange looking bubbly/holey bread with what looked pretty much like already-been-chewed meats, vegetables, and lentils.  That's the only way I can describe it.  And on top of that, I got another plate of bread (which turned out to be the injera) with what I can only describe as looking like rags.  To my surprise, this strange looking food was actually quite delicious.  I enjoyed the experience of having to use the injera (bread) to pick up the different meats and such.  The meat and the lentils were very very flavorful and different from anything I'd ever had before.   It's probably not something I could handle eating more than once every couple of months, but it's a great type of food to socialize over and actually kinda fun at the same time :P",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "APoAugdz6nscL4HjF4Oryg"
  },
  "dW9i3Yg4Sr5FRwLKZdUIhQ": {
    "date": "4/7/2016",
    "text": "I've been here 3 times and introduced people to it twice so far. Everything has been great each time from service to flavor of food, to time of wait, and price. I've tried every meat they serve and they're all good. The bathrooms can use some TLC though.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DGaiqKzuZxc9HY2WOcyLoQ"
  },
  "ZbyAvlIhmCBhgX1bSYYlQQ": {
    "date": "3/26/2016",
    "text": "Delicious !! we are from DC and was worried that this restaurant might not be up to par- boy was I wrong. Everything was delicious - the one star less is kinda unfair because the food took forever - but EVERYTHING was made to order so of course it took longer - we would definitely come again. And for those sorta leery about the spaghetti - it comes from the fact that Ethiopia was briefly  occupied by the Italians ... We always have the spaghetti when we go Ethiopian and our kids looove the spaghetti... Again delicious. We wiped the dishes clean - everything was eaten...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5MdSOQ0ayJWDVowsNPHRQA"
  },
  "LP8x9YcfW-imPTSr5ILRsg": {
    "date": "2/5/2017",
    "text": "This is my favorite Ethiopian restaurant in Charlotte - I'm so glad they opened again in a new location! The food is easily comparable to what I've had in DC or even Ethiopia. The friendly owners and staff make it a great experience. Make sure to try the Tej (honey wine) as a treat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iXjxUt3CdnpdVPYgjibA9g"
  },
  "bEahV940ZHgGy0NnmnpKVg": {
    "date": "4/3/2017",
    "text": "I've only been to a few Ethiopian restaurants, but this is my favorite by far. I like the new location. The service was good and the food delicious. They did a particularly good job with the lamb.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ljRezCHH4Xiz3ve493P1yA"
  },
  "5mf6VVVREJx2w-US07Xbag": {
    "date": "12/15/2010",
    "text": "Red Sea was our foray into Ethiopian food, and we liked it very much!  We've since been back a few times.   This is a tiny place.  At first glance, it does not seem like much, with TVs blaring and very few tables for seating.  Once they turn down the TVs and turn on the music, the atmosphere becomes more inviting.  Service is usually pretty good, but there are often tables that need to be cleaned.  We usually start with the sambusas - mini fried pies, one filled with lentil and the other beef.  Both are good, but the lentil one is a tad more flavorful.  They also seem to be reheated and not freshly made.  For our entrees, we usually share the meat/veggie combo.  I'm not a vegetarian, but I tend to like veggie items better, and that is the case here.  The lentils are my favorite.  I'm not really fond of their adding salad to the veggie plate, however - it's hard to eat with injera and the dressing gets the bread soggy fast.  The lamb is my fav of the meats.  We order our food spicy, but the only item really packing any heat is the lentil/tomato dish.    All of this is served on a huge (15\" in diameter?) piece of injera, a spongy thin bread that has a slightly tangy flavor and is delicious.  You also get injera on the side to use as your \"utensils.\"  The shared dish is usually more than the two of us can eat!   We love ethnic food and Red Sea is pretty good.  I prefer the brighter and more inviting atmosphere of Meskerem, however, so we tend to eat there more often.  But Red Sea is still a close second, and we do return, if not as frequently since we've discovered Meskerem.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "yL4whR1Qb63FptG9IVRdVQ"
  },
  "8hs7XeMOhX0DtaINDd8nwQ": {
    "date": "3/19/2019",
    "text": "The wait was long but the food was fresh and delicious! I had chicken, lentils, cabbage specially made for me because I have a tomato allergy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TIufvwjGSQLvTF3mKjFVsA",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States. #4 beef cubes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TIufvwjGSQLvTF3mKjFVsA/o.jpg"
      },
      {
        "img_id": "hU9WELeleo2tDT69hNQkHA",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States. #2 lamb cubes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hU9WELeleo2tDT69hNQkHA/o.jpg"
      },
      {
        "img_id": "2EjYiAb4diDz1CN5_95Btg",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States. #11 and Beef Sambusa (check the spell)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2EjYiAb4diDz1CN5_95Btg/o.jpg"
      }
    ],
    "user_id": "CFcLaJruy2kUgOOee6pvqg"
  },
  "BBYhjlBHGPA9BkbjImTIyg": {
    "date": "6/13/2019",
    "text": "I've been coming to Red Sea for years, both at the old location and the present one. They are a Charlotte staple for Ethiopian food for a reason. There are very few places I will say this about but you literally can't go wrong with ANYTHING on the menu! Trust me, I've tried most of it. Their sambusas are a must. Their injera is perfection. Even their mitmita tastes better than other places (and I'm not sure how haha). My favorite item on the menu is the kitfo. I've ordered it so often the owner remembers my order, which brings me to the service.  While I agree with other reviewers that a visit can err on the slow side, I've always found the service to be excellent. They don't linger and allow you to enjoy your meal in peace but also pay attention to details and are very attentive. I've never had anything wrong with an order in all the years I've been coming. The service and food quality is consistent.  For drinks, try tej if you haven't. They have a full bar, a few craft beers, a few light beers, and coffee. They usually have traditional Ethiopian music playing on a tv in the background.   The only reason for four stars instead of five is that sometimes they will say they do not have kitfo. I'm not really sure the reason for this since it is just beef. I've always assumed they may not want to take the time to prepare it that day. That being said it is rare that they say they don't have it but it has happened more then once.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ms1GpovknlwMZwLNSxb5Ag"
  },
  "HOcQ8jo2o8uHTn79I7hApw": {
    "date": "5/23/2019",
    "text": "Wow!! Really good food and large portion. We got seated pretty soon but the service was a little slow. Took a while to get the appetizers and the main course arrive immediately. Love the sambusa and first time tried chicken taquitos and I enjoyed them. We ordered the combo and it was a huge portion. Very big enjera. Will definitely keep visiting. A must try here if you want to try Ethiopian food for the first time!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U-CZCG1CWKHvh4GKbFNPxw",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States. Chicken combo placed on the injera",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U-CZCG1CWKHvh4GKbFNPxw/o.jpg"
      },
      {
        "img_id": "cS7f96EKx17Z44tCSRLdfQ",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States. Very tasty side of tomato and onion mix",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cS7f96EKx17Z44tCSRLdfQ/o.jpg"
      },
      {
        "img_id": "TKzFxo4pMjpXRZf_HtDqRg",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States. Chicken taquitos and lentil sambusa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TKzFxo4pMjpXRZf_HtDqRg/o.jpg"
      }
    ],
    "user_id": "qwsZWhs3BCzlOW3dder5aw"
  },
  "9VLBpsj3OFq0POCjOb0x1Q": {
    "date": "1/5/2019",
    "text": "Have been here multiple times and never disappointed. It's simple and unpretentious inside. Service is usually pretty quick, but sometimes you do have to grab someone's attention. I like that they leave you alone. Others may find it off putting. The food comes out hot and the flavors always delicious. I've always done the combos and shared with 1-2 people. They're quite large and even with 3 can be tough to finish, if you start out with some great apps like the samosas. It's pretty quiet on weeknights and only slightly busier on weekends, so you never need to worry about if a table will be available or a reservation.   If you've never had Ethiopian food before, this is a great place to enjoy the experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ir8HD2v8YoL-bZfP8y7B0A"
  },
  "7R9MfAxEUeimMBde_ZV0dw": {
    "date": "2/14/2018",
    "text": "I ha e been coming to this restaurant for about 20 years. They were located across from CPCC originally. The same husband and wife are the owners and chefs. They are kind, professional and excellent at what they do. I have moved away but I come back for work and visit them from time to time. They always remember me. On each of my visits I take a new person and so far everyone has loved the food and atmosphere. I have lived in several states and I seek out Ethiopian food; so far none of them have been as good as The Red Sea.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wpZ-aszsMc61-cGKLv-wUA"
  },
  "7Ie1fKu561KZ5VhAEEJOpg": {
    "date": "1/6/2018",
    "text": "Absolutely delicious!! Friendly staff, comfortable decor, and a menu that doesn't disappoint. This was the first time that I had Eritrean food, but will NOT be the last. We had a gluten-free diner, a vegetarian, a diabetic, and someone with a milk allergy, and we ALL came away with full stomachs and good memories.  I would love to come back some time when they have their live music kicking. We will certainly be coming back to Red Sea to experience more of their hospitality and wonderful food!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VnCaIzgBobWdCVVrZ5ubzA"
  },
  "feC9a5cwte-LkUM6Fywxuw": {
    "date": "7/29/2018",
    "text": "Food was very good as it was fun to try something new and unique, but the service was average at best, as I never understand places where they give off the vibe which makes you feel like you are being an inconvenience by asking for simple things like more water or your bill.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yoF8kxQTH4qCDijyKMm1KA"
  },
  "amvJX4kwS1v1jAQrnXG2YA": {
    "date": "3/27/2018",
    "text": "Our food (the lamb, and the salmon dishes were absolutely mouth watering. I was craving Ethiopian cuisine the next day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "trUj4eFYh3V0_Hso7hMNQQ"
  },
  "29u-a2BbPcEPQ7dgQOmJjg": {
    "date": "8/30/2018",
    "text": "Never had Ethiopian food before, took a chance because we eat primarily vegetarian and it said they had vegetarian options on the sign outside. First of all, the food was great! Varying spice levels within the lentils and yummy other veggie sides. Secondly, the manager took the time to show us how to properly eat the dish. Definitely have the coffee, it was super legit! Give it a shot! We will be back and we will also be ordering take out. Thanks!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tYSudLfJwU205gIOc5eKOg"
  },
  "O_rlKxnZJApTz-T914UWuw": {
    "date": "3/26/2016",
    "text": "The food was decent, though not on par with the best Ethiopian food I've had, and the service was very slow.  There were three of us, two of whom wanted meat, so we ordered a combo (which came with two meat entrees and a vegetarian platter), plus an extra vegetarian platter.  Our waitress wasn't very helpful with explaining the options on the menu.  We drank water, though it tasted odd.  When our food finally came out, my companions received extra injera; I only received what my meal was served on.  That's unlike any other Ethiopian restaurant I've experienced, where usually they are generous with the injera.  Here, they charge extra for more.    The others at my table received items on their vegetarian platter that I didn't, even though they were supposedly the same dish.  The food was relatively bland compared to other Ethiopian meals I've had, though it wasn't bad.   The restaurant itself is a hole in the wall that seems run down.  My friend wondered whether the painted fur underneath our glass tabletop had ever been cleaned.    Overall, it was an okay meal, but I wouldn't come back here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lcvzFfl-fw3gDyBQlNT9hQ"
  },
  "8o4NeXzYspkeHqhUTw3GrQ": {
    "date": "2/26/2018",
    "text": "Delicious food. The vegetarian platter is flavourful and the injeria is always fresh. The owners are friendly and welcoming. If you have not been, try it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7t7nd_LqlV0d7UE4L5MjMg"
  },
  "Q6s8uEQfp2Xvj6Kvak84Qg": {
    "date": "3/18/2017",
    "text": "Had dinner here. Location is easy to find, with ample parking. The restaurant is spacious and clean.  Our server was pleasant and the food arrived to our table quickly. I enjoyed the vegetarian platter: beets, potatoes, collards, (mild) lentils, and salad served on a large portion of sour, spongy injera. My husband had the chicken tibs. We both agreed the food was delicious. We will definitely return again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cVbqRDnSvA7hdrmJ05TGUQ",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States. Veggie platter (after)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cVbqRDnSvA7hdrmJ05TGUQ/o.jpg"
      },
      {
        "img_id": "JAFnNsDiv76vlekY4NDMvQ",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States. Veggie platter (before)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JAFnNsDiv76vlekY4NDMvQ/o.jpg"
      }
    ],
    "user_id": "1SNYv982YjrX5pJvYEyDAQ"
  },
  "-6KDTh4F711tm9doYYXcvg": {
    "date": "12/15/2016",
    "text": "After many months, Red Sea has finally opened in its new location. Sadly, for some reason, they do not have a liquor license (as of 12/13/16) so the only drink options are: water, soft drinks, coffee or tea. I was so excited to try the Tej (honey wine, or mead), so I was very disappointed. Given how long it took for Red Sea to open in this location, it is possible that it will be many more months before they have a liquor license.  As other reviewers have noted, the injera is springy and tasty and our entrees were good. I ordered the chicken tibs and my partner ordered lamb tibs. While I'm happy that Red Sea now has more space, the new restaurant is low on charm or character. The lighting is bright-bordering-on-harsh, and the decor consists of some baskets strewn about that are meant to suggest \"Ethiopian.\" The music that was played soundd like Muzak - how about playing Ethiopian music, instead?   It would be nice if the decor inside was more colorful, and the lighting more subdued. The building was clearly a seafood restaurant in a former life (there is a tacky anchor painted on the building's exterior), and the interior still feels like it may have been a Red Lobster (or something less 'prestigious'). It felt like a cafeteria - not especially relaxing for evening dining.  So...I highly recommend the food, but urge Red Sea to make cosmetic improvments that make it feel less like Red Lobster and more like an authentic Ethiopian restaurant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "66BZIDIjHP7xUrxbU94e7A"
  },
  "8oXjqSeWZF8P7Ql_Um0pXQ": {
    "date": "12/30/2016",
    "text": "So good! We ordered a bottle of honey wine, beef sambusa, and the Red Sea combo (veggies, chicken cube dish, beef stew). This was enough for 3 people...maybe a 4th light eater. The potatoes, lentils, and beef were standouts and left us fighting over the injera beneath each! Again, so good!!!! We were split on the sambusa. I thought it was too greasy and just not as good as others we've had, but the hubby liked it. The great sambusa controversy of 2016 mixed with the super bright fluorescent lighting in the dining area is keeping me from giving Red Sea five stars (I'm thinking 4.5 is a better representation). Super friendly staff and nice bar area up front. When back in Charlotte, we'll return ready to fight over injera again! Yum.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KNUkvBCYrnknrzx_jpfUtg",
        "caption": "Photo of Red Sea Restaurant &amp; Bar - Charlotte, NC, United States. Red Sea Combo (chicken cubes, beef stew, veggies). The food of my dreams!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KNUkvBCYrnknrzx_jpfUtg/o.jpg"
      }
    ],
    "user_id": "vdYCP-1nZ2PnVJr8iB2-eg"
  },
  "KZeW9fYgUXqyIfJWU6h-ow": {
    "date": "11/4/2017",
    "text": "Ordered the veggie combo, and it took forever to come out of the kitchen. Well over 30 minutes, with no explanation. No one even checked on us.  And then the food itself was completely underwhelming.  It was heavy and oily, and not particularly flavorful.  Bottom line: It comes no where close to Abugida Cafe, so next time we will go there instead.  Plus Abugida has the friendliest staff and the flavorful, fresh food comes out promptly.  It's a no brainer.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K2yXB3ohz6Kp4a0Ot1WxyA"
  },
  "f8-38AYpJU1KX5t_geHQ3A": {
    "date": "5/15/2018",
    "text": "This was my first visit to Red Sea Restaurant. I heard of this place when it was near CPCC but did not have a chance to try it before it moved to Monroe road. My dining companions and I were new to the experience of eating with our hands and it was amazing. The food is well prepared and generous portions. I had the beef stew it was the best. My sister had the spaghetti, she let me have a little bite my mind was blown away. It was so flavorful and delicious. I will definitely order the spaghetti next time and not share with her or anyone. They offer a wide selection of draft beers but the honey wine is delicious. If you love flavor and a different ethnic food experience please go to Red Sea restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d7VVQqPFnD88JhtcaalkVA"
  },
  "iCbWpBkodSV8H7PzqlDtkQ": {
    "date": "5/3/2017",
    "text": "Such amazing food.  So many different flavors.  Took a while for the food but once it came it was worth the wait.  One of those meals where you still are amazed 30 mins after you're done eating.  Don't make assumptions about the building or decor. Just wait for the food and you will be amazed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c6fjWBujqWAZgPzU64_Xlw"
  },
  "PCtMAD1XAnTyTShdjXGpkg": {
    "date": "11/1/2016",
    "text": "Red Sea is one of my favorite places to eat!  The new location at 4301 Monroe Rd CLT 28205 should be open (according to the owner as of today) in 10 days on 11/10/16.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "n0WYraHwDTKooo5arUoRbA"
  },
  "HhSbnhs-mXJAZc8hAUACQA": {
    "date": "2/21/2017",
    "text": "Great service and even better food. The vegetarian meal was outstanding. A hidden gem. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ip_SJLMJxgyHuzYEeJMvw"
  },
  "vwpjuFxZrxh6V0p7L8_ZmQ": {
    "date": "9/30/2015",
    "text": "I try to stop by Red Sea whenever I'm in the Charlotte area. I don't have a ton of exposure to Ethiopian food but I know I like what Red Sea has to offer, and the staff are really friendly. The location seems pretty convenient to me, although I usually have to drive around the block from missing the entrance to the tiny parking lot.   I always order at least one of the combo dishes, and then usually add on another meat or vegetable. It's a little hard for me to distinguish what's what once the food comes out, but I love how they come out on top of injera so the sauces have a chance to soak in. The vegetable dishes are often my favorites, so I'd suggest this place as a good option for vegetarian friends. The food is also pretty inexpensive and very easy to share with friends.   The restaurant is tucked away into a tiny strip fairly close to downtown Charlotte and the atmosphere is hole-in-the-wall but very comfortable. I haven't had trouble finding parking yet either, so that's always a plus.   I'd recommend Red Sea for anyone interested in trying Ethiopian food, and definitely for people who prefer to eat vegetarian. I probably wouldn't bring a date here for a night on the town or anything, but it's a great place for casual food with friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "ys4fRPPzZCWVBkVh3IslQg"
  }
}