{
  "LgHmewbWl8nH8nhxa-5ibQ": {
    "date": "3/4/2015",
    "text": "Awesome vibe and decor, even better food. When you sit down, you're served water with lemon, watermelon, mint and raspberries in it. Yum! The food is super fresh tasting! I got the beef pho & you can tell it doesn't have any MSG- it's not salty at all so a bit surprising at first but it's way better!! The owner is super friendly and walks around table to table chatting with customers. She was hugging the regulars and taking time to get to know people. Best part- it's BYOB! I highly recommend this restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jJco5CufAoWKdUrBydDHdg"
  },
  "MGkynd-GLbstjLWgpbhv0A": {
    "date": "5/20/2015",
    "text": "Can't recommend this place enough. Justina is a total crack-up, and treats you like family. Going here tonight with some awesome friends. Can't wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WmX_LTBjSN675KmDDXsPqQ"
  },
  "g5q7L8C40ou7QGGjlIEA0w": {
    "date": "9/24/2014",
    "text": "The pho is Awesome! The owner is Hilarious and very friendly! She does LOVE the F-bomb, which doesn't bother me but might some.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TFbS7IeLk6KnU1ku-B8iWQ"
  },
  "OUDFH93sSx8SjUMIpdJ3PQ": {
    "date": "11/11/2013",
    "text": "If I could give zero stars I would.  Stopped in for lunch. No one in the place (not a single soul), that was probably my first warning. I sat down anyway, on their hard, uncomfortable plastic chairs (seriously, the decor is very cafeteria like), and started to look over the menu. Pho for $10?? It better be some amazingly good pho! So I sat and I sat, waited and waited. The server/owner/manager/whoever that greeted me when I walked in had gone in the back and after waiting 10 minutes I decided to just leave. Give me a break. There is NO ONE in the place. I'm your ONLY customer and you're going to just let me sit there forever? No thanks. Went to my usual go-to for pho at Pho Van and had an awesome lunch.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "juLlBJ6SQMyMLxPLczZxNA"
  },
  "LwWAzJ_LDwreMJAky5SeAA": {
    "date": "5/12/2015",
    "text": "Wow! What a surprise find... The service is fantastic. The food is fantastic and the place is clean and modern. I loved it. I will definitely be back. They made me feel very welcomed being a lone diner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cJoMaVVCD2Mnkiu_rfuwNw"
  },
  "qswgA2oxggNPZ8CR2O_DFg": {
    "date": "7/1/2012",
    "text": "wonderful food - hilarious owner - and great decor and ambiance! Well worth the long trek to get there ~ delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zwpX1vx57EStGSiZ4X3dRQ"
  },
  "M0id1JWT6cHlFFouPkHfcg": {
    "date": "3/31/2014",
    "text": "For those of you who don't Pho-know any better; this is pretentious Pho.  You're paying for the modern orange walls and acrylic chairs.  Stick to Pho Chandler.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ta8_KztGI1QtChWVecosJQ"
  },
  "47AhpYin7ec6FbEuILdWEg": {
    "date": "6/15/2014",
    "text": "I'm conflicted in writing this review.  There are large varieties of unique menu items to choose from and the few that I've tried are fairly good.  The only complain I have is the owner and hostess who seems to use foul language from time to time.  The last time I was there for lunch, she drop by our table unexpectedly to chat and badmouth one of the customer who was asking too many questions about the menu then not ordered it.  My friend and I didn't know what to said then later left telling each other to scratch this place from our lunch list.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sz02Zu8aXGZQqD-im04big"
  },
  "mTFXdD8GomSiNWa3o0WZZw": {
    "date": "5/30/2013",
    "text": "My family went here for dinner and I am 100% sure the staff, especially Justine, was prejudiced against us because we were Vietnamese.  The Pho was mediocre and all the food we ordered were overpriced.  While Justine made her rounds to chat, flirt, and engage all her Caucasian guests, we were ignored and forgotten.  And by \"forgotten,\" I mean, they didn't bring out our food until we reminded them we existed.  Yes, the greens and food were fresh. However, calling this place a Vietnamese restaurant would be comparable to calling Taco Bell a Mexican restaurant.  We didn't care so much about the price as long as the food was good. However, since both the food was sub-par and the service was terrible, this is one place we will not be returning to.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 0
    },
    "photos": [],
    "user_id": "f2oUXH2rjC5hRbhUbhUGHg"
  },
  "cux5UL51E67nR_XO6azIUQ": {
    "date": "11/21/2013",
    "text": "This is a secret place that some people drive far to go to.  Great environment with colorful lights.  You can bring wine in.  Owner is a server and is great..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fDIKq2NrkaU8vQV5f8cFig"
  },
  "N2vlEoGP4OpqQM_bw6-Htg": {
    "date": "11/21/2014",
    "text": "Best phone in town! Always piping hot  made with love and a great menu. Check it out. You will not be disappointed",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wZxkLcd-JeZ3hv9V9Y9A2Q"
  },
  "PNvTbpfs_kt3wiDI9N7JDg": {
    "date": "12/16/2013",
    "text": "A friend turned me on to this place.   The food is top notch.   Justine is a hoot.  If I go too long between visits, I get withdrawls.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sbvPVEsRYQzTt92ezhw4TA"
  },
  "gRompG8lkCbo8Yfi8X_bLA": {
    "date": "10/23/2011",
    "text": "I gotta say that if you have never tried Pho, you may think this place is the end all be all. It gets 3 stars from me because of the exposure it has given Viet food in the valley.  there are much better restaurants than Cyclo, with much better value and menus.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LyC_hghXHZI_cNTs1HWCQg"
  },
  "ctuECvgajNtaHKd223DYLg": {
    "date": "8/18/2011",
    "text": "This is one of my favorite restaurants in the Phoenix area, and I've taken several friends here to share it with, both locally and from out of town. In fact, I would like to go there today! I love the Lemongrass chicken, spicy beef salad, Seafood Pho, and the garlic green beans.    I absolutely love the food, and the only reason it doesn't have five stars is the service. It's not terrible and they've never screwed up my order or anything, but it's not the greatest I've ever had. I recall waiting a few minutes with an empty water glass before I could resume eating because I was thirsty. I'd rather wait for a refill than not eat at this restaurant though.  One thing to keep in mind, this place is small, and it gets busy, so if you don't want to wait for a table, go at an off time like during the week or for lunch. Dinner time on Friday or Saturday night fills up pretty quick!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "0vEGJWxCKWAimwJbHBnbIg"
  },
  "w8kTAsqGt7LcMVSm_LeAcQ": {
    "date": "4/5/2013",
    "text": "First, they don't answer their phone. Next, they are closed between lunch and dinner. Finally, it is ridiculously OVER PRICED for the area and quality. $43?! I literally pay $24 for the exact same order at another pho spot very close. I'm not opposed to paying out the nose for great food, but it better be just that. And it isn't.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "iTxPwAK3uqAIg1YtB2nFKw"
  },
  "Li-Fow7Tyo3IlKEl-hXaCA": {
    "date": "11/11/2008",
    "text": "I was told tonight that every person from Vietnam has a story.  Justina's is all about personalized service, oh, and a rough journey from North Vietnam to Los Angeles, by way of Hong Kong.  Some people may not like her or her style.  I thought she was funny and worked hard to live up to her claim that her food has a secret ingredient, love.  I tasted another ingredient, fun.  I'm not Vietnamese, but I have a story about tonight.  I met a good friend of mine while here on business who had worked with a lady in Tucson who recommended her cousin Justina's restaurant in Phoenix.  When we told our server of this recommendation, the menu was snatched away and we were given \"owner's choice\".  Not bad.  The Green Papaya salad was excellent, the heat tempered nicely with the Thai Iced Tea.   The shrimp on the side of the salad was also very tasty.  The Pork Short Ribs were next.  They were very tender with a subtle BBQ sauce, slightly sweet and all good.  A beef or pork (not sure) and rice dish came next and it was also very good.  The meat was tender and again, subtly spiced.  Not hot though.  The main dish, a mix of vegetables, scallop, shrimp and beef was less impressive.    Finally, the dessert (not something I usually do) was excellent.  As another reviewer pointed out, they are a little known sensation.  I had the creme brulee (jasmine? not sure, but very, very good) and the mango with sticky rice (covered with coconut milk).  The Vietnamese coffee was also very good.  It is allowed to drip at the table, mixed with the sweetened cream in the bottom of the glass, then poured over ice.  It's strong and full of flavor.  I may be up all night.  Oh, and as for price, this all came in at $58 for both of us.  I don't know if this is reasonable, high or cheap.  It ain't bad in general.  Those of you who do Vietnamese often will have make the call.  I'm not in Phoenix often, but I will return to try some of the other menu items (Pho and other noodles for sure).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "uL-ECTF9PumWkzxHScw-QA"
  },
  "VThdbaTIkgqEJDDNS1ghsw": {
    "date": "2/14/2010",
    "text": "There are not many Vietnamese places around so I go here on rare occasion when I feel like eating something different... and spending a lot of money... yes really - it is overpriced IMO  It would get another star or even two if the prices were more reasonable. They do well so I'm sure they are not going to change the prices.  Food: quality and flavor is good.  Service: I've never has good service here. It is average, at best.  Overall: unless I'm going out on business (and the company is picking up the tab) and the person says take me somewhere close by that is \"different\" I usually skip this place and spend the same $ on better places.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8SSaCgmvsztEOg2CqeXxnw"
  },
  "aIx4oGPsMoCgLMJ9S-YWRg": {
    "date": "10/21/2011",
    "text": "Your gonna love it or hate it.  This place is somewhat unique spurred on my owner Justine.  She is Sassy for sure and she reminds me somewhat of the soup Nazi.  She will pick on you, insult you, hit on you, and more in the same evening.  You will either enjoy this or feel uncomfortable.    The food is good and some of my favorites are the green papaya salad, Pad Thai, and Suon Non.    Bring a six pack of a nice Asian beer if you are going because it is BYOB.  You may or may not get your left overs back  :)  The service needs work for sure but I have not found it as bad as many reference in their reviews.  I guess when you have a beer in your hand it is easier to wait or tolerate.   Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "BEzBsvPwq8ixf_JLdvqLBg"
  },
  "bQkiC5b_15NaLfOPa9T2CQ": {
    "date": "3/7/2016",
    "text": "This place is great! Excellent pho with a very trendy vibe. Also good to note that this place is byob",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wUSXzMHRoEmbiTLP8ZRuug"
  },
  "W1vQG1m1YXvY2dYp2u8Y2A": {
    "date": "6/24/2014",
    "text": "I love love love this place!!  The pho broth is made with OX tail and you can tell. The garlic green beans ROCK!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IA2waty1744dVgmcCg138Q"
  },
  "48i_xiiv2dU6_jup8NW3_w": {
    "date": "6/2/2017",
    "text": "Not normally the one to chose Vietnamese food if I have options but wow blown away by this restaurant. Owner is a character, lots of personality and will keep you entertained without being over-bearing. Food is scrumptious! Have tried several dishes all delicious, my favorite being the vermicelli cake loaded with fresh veggies! Yum! Also owner makes her own kombucha and she will bring little samples in the cutest glasses inside of a book, hard to describe but cutest presentation. Must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pec0lrjhe1hDBhwchtbWuA"
  },
  "64ifx_HN3kCcNW2FiV_XYw": {
    "date": "2/3/2018",
    "text": "The restaurant has a modern flair and is pretty neat inside. Different atmosphere than most Vietnamese restaurants. I LOVE Pho, so I ordered that during my visit. It was good. Broth was flavorful. However, I'm used to tripe and the meatballs being an option at every Vietnamese restaurant I have been to. Sadly, I did not see that option on the menu. Maybe I missed it, but I scanned that menu like a detective looking for clues and didn't see it. That aside, the owner is a whole different story. This woman was one of the FUNNIEST people I've ever met. If she set up a microphone in her restaurant and did stand up, I would be in the front row. She was very attentive and made sure we were happy. We will be back and maybe I'll stray from my usual to try other options on that menu. I do think people should go to at least have a conversation with the owner over their beautiful pomegranate and lemongrass water.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fmsXWG-B5YmSO4dT1rFRAA"
  },
  "XOTvSsXtjvPqY4N2ByopMQ": {
    "date": "2/1/2018",
    "text": "Modern little place, very clean, fresh flowers on every table...the food was super fresh with good flavor! Beautiful presentation of the food- even the water was beautiful with fresh fruit in it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-QrH4lfTH0X74wHg76V0oQ"
  },
  "JNd01_GX6Prp2xVYKJxUTQ": {
    "date": "6/9/2016",
    "text": "This place is absolutely wonderful! The people are so lovely too! The meal was so delicious and they are willing to alter some of the menu too. We wanted the meat and chicken soups but with veggies and they were happy to make that adjustment for us. There is no doubt we will be back! Such a great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HEt60aaf6j4j5BsxIe1iog",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Beef soup with added veggies",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HEt60aaf6j4j5BsxIe1iog/o.jpg"
      }
    ],
    "user_id": "CDFUI7fsVpNnn4OaJQmg9A"
  },
  "hBvvv1HzRdRTT1ep6G31xg": {
    "date": "5/24/2016",
    "text": "When you walk in you are greeted with a happy smile and a welcome. The woman who seats you will serve you with a smile or a smart comment to make you laugh. The whole experience was great.   Oh I guess I should share the food. The Pho was on point and so was the spring rolls.  Cool decor and atmosphere. But make sure you get there before 2:30 because they close at 2:29!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r6kMt26xSDvhIkP_YGjNYA"
  },
  "7SZ2rotX58M3KpPcfnFhhw": {
    "date": "8/13/2017",
    "text": "Pho is the best, byob, small place gets you personal service, Justine gives great recommendations, don't bring a large group",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TiRmHnul0G0m4Mz47yy8lA"
  },
  "YCCdPsfBNKe_9k1LdI-P3g": {
    "date": "6/28/2017",
    "text": "Delicious! A wonderful meal. Awesome service. Clean -and comfortable dining experience. Best Thai chicken wings I have ever had !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dju0MGdtJcM8PMcTdqR6FQ"
  },
  "b0O2JxN_Pxv4N0DpMeA03g": {
    "date": "4/15/2016",
    "text": "This was my first time coming to Cyclo, and I have to say, it's a Chandler gem!   It's locally owned, and the owner is what makes the place worth going to. She puts her passion for healthy living into her restaurant, and she is quick to start a genuine conversation with you. The food makes a place good, but the atmosphere and people make a place great-- and this place is great.  The water is served with seasonal fruit inside of it, which leads you to drink more than you usually would-- which is a plus! The food was delicious, we got Pho Ga and the egg rolls. I definitely recommend checking Cyclo out if you're in the neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BgIrPw65dtD1Xg7Kbtp_YQ"
  },
  "DZWlbGADvbjjduzqvYbXVg": {
    "date": "2/1/2017",
    "text": "I went to this place when I went to Arizona, and I'm from California. This was a very nice restaurant and had nice decorations inside, additionally it was clean! The broth was really good and didn't taste full of MSG like other Vietnamese restaurants. I just got the beef combo pho and enjoyed it, especially after a long day of traveling on the road. Definitely a place to try if you're craving Vietnamese food and you're around the area!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "dYKOocBNqH5wAu-MwWGOKg"
  },
  "2MHtGA87U-_BouXsdNuA5A": {
    "date": "7/22/2017",
    "text": "Absolutely delicious!  Great friendly service. They adjusted the Pho for us and it was perfect. Super cute atmosphere too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E_N05bTxZoL2wFWGcIxSXQ"
  },
  "2QXebfAdjw6YM6dxVvbx6A": {
    "date": "2/3/2017",
    "text": "Well, I just had the best bowl of chicken pho I've ever had. My husband had the fried rice, which was also bomb. This place is clean and adorned with fresh flowers. The bathroom was pristine, too. As soon as we sat down, we were served ice water with fruit slices. The food arrived quickly, and it was GOOD. The staff is hilarious! Our server was very loose with the f- bombs, which we were a fan of, but if you aren't, you've been warned. She was quick, and quick witted. Can't wait to return.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ufuOeij0Px1Jl_IsVF-pbQ"
  },
  "tMo1TvevCnI95fkt3COsaw": {
    "date": "6/14/2017",
    "text": "The BEST pho around! Great food, wonderful owner, you won't find a better combination. You can see, feel, and taste the care and love in everything here. Definitely my favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0wpcMPQeUnc8RooK41kxfg"
  },
  "dnETR7G1zDFdA1m4YfuHHQ": {
    "date": "1/26/2018",
    "text": "The Pho was awful....not as good as I've had elsewhere and the service was not good at all. Our waitress was rude and never checked on us except to silently pour some water in our glasses. The noodles were cold and not as good as I've had elsewhere. Big group here traveling to Sedona and they were awesome to them....guess they just want a good tip. Will not return for subpar food for a price it was not worth.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tECBXGa_qNwOjdr_XLaY0g"
  },
  "rTUMgnqCc827iwMtP-5gjQ": {
    "date": "3/16/2016",
    "text": "First time trying Cyclo. Great food the food is fresh and yummy. The owner is a riot. Good for lunch and dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7mmUOhox9tQKST5fxieAMQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Flavored water.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7mmUOhox9tQKST5fxieAMQ/o.jpg"
      }
    ],
    "user_id": "Nhu3FDXbJ-xMtJWGxJBBMg"
  },
  "NWofBBStdYvA3YAanctbDw": {
    "date": "10/12/2013",
    "text": "Yes Justina is a foul mouth smart Alec and I wouldn't bring any kids in here but she is also warm and welcoming. She remembers patrons and what they like. Yes the food is expensive - especially for lunch, but the food is great, full of flavor and portions are large - I always take 1/2 my vermicelli home. Plan on $20 per person.  Yes the service can be a little slow but the BYOB policy and casual atmosphere make up for that (although, the chairs are a little uncomfortable).  I love this place and we keep going back for all it is and all it isn't. One time we didn't realize they close for a couple hours in the afternoon and walked in for a special celebration just a couple minutes before they closed, they put our beer and wine in the fridge served us and told us to take our time...they are good to their customers.  Check it out but be prepared for what it is.  Also, it's small and gets packed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "owB-nYDh19KAboSK0Sh5yQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Hanoi Vermicelli",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/owB-nYDh19KAboSK0Sh5yQ/o.jpg"
      }
    ],
    "user_id": "f53SDhSYWNaNFYDt0rJliQ"
  },
  "bg3j2G_0GcX1QjeZYpH4Yw": {
    "date": "2/4/2017",
    "text": "I went came to Arizona for the New Years with my boyfriend and we tried to find food that related more to the Bay Area it was quite a struggle. As the options in Arizona aren't as diverse BUT we found this place and the pho here definitely reminded me of California. The service here is also incredible, the owner has a energetic and welcoming personality !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sD4MT18AMK73HsTNur8eww"
  },
  "3E_DGFzJXp0QwIxx7Cm9-g": {
    "date": "10/9/2015",
    "text": "The ambiance is trendy and the food is very flavorful!  One of the highlights was talking with the owner though. She is a unique character and fun to talk to! Go visit and you will know what I mean ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "L1pIx-lLuPUaqAZU0dyrJg",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Trendy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L1pIx-lLuPUaqAZU0dyrJg/o.jpg"
      },
      {
        "img_id": "DGbAY5CDrhQc_jAlS4RE-g",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Watermelon!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DGbAY5CDrhQc_jAlS4RE-g/o.jpg"
      }
    ],
    "user_id": "YmfwxHZPQrIPeO_3Ng4KJg"
  },
  "iNhHOS0lko0REqoGy-z8rQ": {
    "date": "10/20/2015",
    "text": "We went to eat at Cyclo on the recommendation of a close friend.  The atmosphere is fun and festive.  I'm always game for a place that serves tasty Asian food and does not feel like a cafeteria.  On the contrary, the restaurant is chic.  The food is reasonably authentic, and I mean that in a good way.  Authentic enough that I got my VN fix.  The nuoc mam is flavorful without being overpowering.  The seasoning of the food is well done.  The feel of the dishes is authentic with a little bit of fusion.  Little Dining Partner had the pho tai and really enjoyed it.  Dining partner and I had maybe six of the small plate items (salad/goi, pepper shrimps on toasts, spring rolls/chai gio, etc etc); everything was tasty.  We enjoyed the watermelon slices in the water.  We also loved that it was BYOB.  We're coming back to Phoenix for the holidays.  I'm certain we will be coming to Cyclo again.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4NAIytp-JSdQT7-aNMeqTQ"
  },
  "iF5hA-ZCDMwGoNShzMqpPA": {
    "date": "1/24/2017",
    "text": "Always a great meal and an awesome time when we go here, and you cannot beat BYOB!  So many fun memories coming to this place with friends",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VDsO7_0AOpC9y6P_X6f2ew"
  },
  "H7dikizXZxl8BYYATXSyDg": {
    "date": "1/29/2016",
    "text": "I have seen this place for Quiet sometime , so mad at myself For waiting this long. The staff has great personalities and the time wait for my lunch was very fast . High in flavor and a killer value . Defiantly a must try !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zyt4U7BFvbIbwO1TXBaiwg"
  },
  "q7thcLZ1y7wuV2PWnbQ5gg": {
    "date": "2/10/2007",
    "text": "The food is superb... Hands down, the best Vietnamese food I've ever had in the west. Justina is great too.. Such a character... Don't piss her off though or she'll make you feel about 2 inches tall... Not that I know from personal experience ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0EZ2Gh2ZHijQH9v7iHzxYw"
  },
  "hVGt_DJIF3_JQtK3fYGDOg": {
    "date": "10/19/2013",
    "text": "We love the restaurant for its food and atmosphere. Justina, the owner, has a unique style and she might come across a bit too eccentric and offensive for some people. That's her personality and it is part of what you get at cyclo. We go there once a month and find the food to be consistently good. One thing we'd like to see some new dishes once in a while. Our kids love the rolls and lemongrass chicken - sure bet. They have internet access, good for me if I have to do emails. Decor is great however I am not fond of the patio chairs. We can bring our own wine at no extra charge, which is a plus. The music is Ok, ambience and at least it doesn't hit you on the head like brick - like sushi room or postino. Cleanliness Ok. I know they once had issues with inspectors finding dead roaches - but we're giving them a chance. Service - when Justina isn't there is lacking. The waiter walks around with his iPod and not really paying attention. I've never seen this in my entire life. This is a big negative. Overall, we find this to be a superior Vietnamese restaurant compared to others in the Phoenix area. Most are downright awful so the bar isn't that high. In the end, they do score some points.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1WFtZA-AQcyVuPcdSRApbQ"
  },
  "I_08VaywBEtbrewTovuQdw": {
    "date": "6/16/2010",
    "text": "First of all it's $14.50 for a bowl of pho' . that's way over price.  The soup was disgustingly bland and the one of the owners was walking around like a vietnamese hitler runway model, pacing back and for in the restaurant.  The interior decor was dark and reminded me second hand IKEA store.  I would never come back here and if you're smart take your business elsewhere.  You been warned.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "3hD4fAFCPCd-z4N1wNTFIg"
  },
  "ekA2VK91aYxsPMvrLULxmQ": {
    "date": "1/17/2014",
    "text": "Wow, what a mixed bag of reviews.  Seems to me that some folks happen to go to Cyclo when their low mental cycles coincide with low points for the restaurant and others manage to coincide their highs.  Either that or too many cranky people are going to a great place.  That said, we just got back from meeting out of town relatives at Cyclo, which has become a tradition.  Don't understand the complaints about the decor or the service.  I do understand the differences in reactions to the food since in our party of five, there were definite differences.  The pork chop and the crispy noodle cake were thumbs down, with the verdict rendered on the noodles because it was impossible to tell apart the different types of protein that were supposed to be served with it.  Two had the mint chicken which was given an OK, although the broken rice was a bit plain for both eaters' tastes.  I had the Hanoi vermicelli and it was to die for.  Incredible broth, perfectly grilled meat, great herb accompaniment.  So folks, it all boils down (pardon the pun) to what you order.  By the way, heard no f-bombs from the owner who was her delightfully sassy self as well as being an efficient server and a really snazzy dresser.  Friday night and the place was at capacity.  Still on my list of places to go back to, even if all too infrequently.  BTW, all those complaints about the pricing were just silly.  It's not 1952 any more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VvHbvQwfqQhxxkAXBL2RPg"
  },
  "bPHdj2Ot1DBQ_3JQajsMwQ": {
    "date": "11/22/2008",
    "text": "I had the chance to have dinner at Cyclo Chandler this week.  I absolutely loved it!  I am in the service business and appreciated the personal service.  The owner who I am told is there all of the time was so warm and friendly and funny!  I know for most it is only important if the food is good but the way I am treated in a restaurant and the ambience is also important.  I am american and vietnamese is new to me.  I am still learning how to figure out what everything is on the menu.  I had a dish of beef, shrimp and scallops with veggies over a fried noodle patty.  I forgot what it is called!  It sounded strange to me but was amazing!  I did not care for the black pepper shrimp appetizer too much but cannot wait to dine her again!  It was a great experience:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EuBShzDwZuqCE90KIAhBqg"
  },
  "qG36Ad23DenT9lS81h11yA": {
    "date": "5/17/2009",
    "text": "I'm sold on Cyclo. I'm a fan of the owner, Justina, who kept us entertained throughout the evening with her zany extroverted personality. At one point she spotted my date struggling with the pho (combined with my unmanly failure to assist her, since I'm pretty incompetent with pho myself), and jumped in to give her a little hands-on tutorial on how to combine the spoon with the chopsticks to scoop out the crab meat from the legs, swirl up the noodles and slurp it all up. By the way, we did request forks on no less than 3 separate occasions. They were promised but never came. All is forgiven because of the tutorial, though. Not to mention the food was tasty (we shared two dishes: the seafood pho and the Bun Bo Xao) and the ambiance was as cozy and charming as one would hope for a nice little date night. We brought our own wine, which the server chilled for us in their fridge. A pleasant experience throughout.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "mIysRk_cJ5K_BMZ-r06TFw"
  },
  "5Gp_APfLBMn71oB7HW6aCw": {
    "date": "6/14/2011",
    "text": "Best banh xeo in town!! The spicy beef salad fantastic, first time I had a dish deemed spicy that actually was. Perfect if you spicy food!! As for the pho here, it's not all that, they use too much anise. The banh xeo and beef salad are the only dishes I liked and will return to have again. If you want great pho, spring rolls, rice/noodle dishes go to pho nhat on southern in mesa you won't be disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZoCxiSAfK9iAFNaCCzkT9A"
  },
  "TYtTS7M29lDzl0r5qp5Hgg": {
    "date": "11/9/2008",
    "text": "Let me preface by sharing that I am a Vietnamese who have eaten Vietnamese food on five continents the past 15 months and I have to crown Cyclo as a gem!  Who would have guess it would be in Chandler, AZ?  For the quality and the price, you cannot beat it. I noticed a reviewer noted the price was higher than expected, but I sense the reviewer is not familiar with the finer details of the dishes which foodies won't mind paying for at a restaurant.  For example, you can order a bowl of pho at any VN restaurant, but they often only give you basil instead of the other fragrant herbs that should accompany a bowl of pho.   At Cyclo, they don't cut corners so the dishes come out complete with the love and attention as if you are family. I have to admit, my favorite dish there is the crepe. It's perfectly prepared so that the edges are crispy and the crepe itself is not doughy. But what separate it from other crepes is that Cyclo correctly includes all the fresh herbs that should accompany this dish. Most restaurants just give you some cilantro and lettuce to go with the crepe, but Cyclo gives you the complete experience!  It's analogous to eating mushroom risotto at an Italian restaurant with a shaving of aromatic truffle vs just a shake of pepper on top.  It's all in the details!  I enjoy the food so much I have been stopping by there for dinner when ever I am in town on business. My friends can't believe it because I generally tend to prefer restaurants with a 10 course tasting menu where I can linger for 2-3 hours each night enjoying my dinner.  The quality of the food at Cyclo must be good or I wouldn't be wasting my time there.  Besides, if you are trying to get the best bang for your dollar, this is definitely the place to eat.  The quality exceeds the price here.  I am trying to make my way down the menu and so far I have not been disappointed.  But my favorites are the crepes, the short rib appetizer, goi cuon (summer rolls), lemongrass chicken, and stir-fried string beans. The latter is full of flavor and your taste buds will appreciate it.   Generally, I don't order desserts at Vietnamese restaurants, but I always finish my dinner here with one of the house made desserts.  Creme Brulee was the correct texture which is important to me.  I typically won't order tapioca dessert because I think they are boring, but I was making my way down the menu so I took their suggestion and ordered it last time.  I am happy to report the tapioca dessert here was a few notches above the usual tapioca dessert so I will order it again next time. When in season, you can also order mango and sticky rice for dessert.  Yes, I have tried them all and can vouch for them.  Oh, one warning though: the at-your-table drip-coffee is very addictive and very strong.  It really rounds out the meal nicely but you will be up for a while with that boost of caffeine!  Incidentally, the best part of Cyclo is not just the food, but the warm service with a smile.  All must come together to create the perfect meal!  Cyclo is now a gem in my back-pocket.  I look forward to my next business trip to AZ so I can stop by again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "M4k73ojLz0Rmf4Zhts9Vxg"
  },
  "QEvRdvca5UBd_4YewL7Dwg": {
    "date": "8/12/2008",
    "text": "Tried Cyclo about four times.  I really liked it the first couple times.  But this last time I went, I brought a friend along who had never tried it.  I was kind of embarrassed by the service.  The food is consistently good as is the lemonade.  Their new decor is nice also.  But they really fell flat on their face with their service.  It seems like the waitress only takes the food orders, one of the cooks brought out the food so of course he don't know who gets what, they brought mine first, then a few minutes later my boyfriend got his and then our friend got her food.  When we finished eating we had half of our food left over that we were going to take home.  We asked her for boxes and she proceeded to stack all our plates on top of each other.  She brought our check and my boyfriend told her that we wanted to take our food home and she says \"sorry, I didn't hear you\" and left it at that.  We were disappointed and won't be back which is a shame.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZzbeJ1dBZs1PF2is_FVixw"
  },
  "dtn5M7NuJhMW6NHqyOOdWA": {
    "date": "7/5/2008",
    "text": "don't like, i ask for spicy not a jar of red chili pepper.  one person wating on 20 tables. you think about how quick you get serve.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kXvo5xK2Kztz3gdIYixTJQ"
  },
  "EahSFan3Nw4HTP0cn5DI-A": {
    "date": "9/16/2009",
    "text": "Decided to try this place after reading all the rave reviews and hoopla. It is completely \"overrated\". Had the Chicken Noodle pho and although tasty, never really figured out what the fuss is all about. I believe you can get that same style pho (that tastes as good) in other Vietnamese restaurants across the valley. Prices aren't cheap either. Maybe I'm biased due to the fact that I had to wait for about 90 minutes (yes, you read correct - an hour and half) before I was seated. This place probably seats about 30 people max so that doesn't help either. Also noticed that this is a BYOB(eer)/W(ine) establishment. One positive thing that I noted was that the owner (figured her name is Justina after reading a few reviews here) was extremely friendly and interacted with all the customers making them feel very welcome. Rare to find such service these days. Would definitely not go back for the food, but might consider going back for the friendly service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MgZmJL8pHoJk2zNkc6LBEw"
  },
  "bAhW5fdnsRqpjFJ2Oop5fw": {
    "date": "1/27/2011",
    "text": "My wife and I just had lunch today at Cyclo on a recommendation from one of the best restaurants in Chandler.  It is a small restaurant right next to the wall greens.  A perfect example of don't judge a book by its cover.  We got there about 1:30 and place was surprisingly busy for a late lunch.  We were immediately greeted by Justina, which is either the owner or manager, either way very friendly.  I ordered the pad thai and my wife ordered the mint chicken.  The food was incredible.  Best of all Justina came by to check on us and informed us that they allow you to BYOB!  As soon as we got in our car she was on the phone with some friends of ours planning our next trip back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I5EVdjukyMmoL2CdcdSF2A"
  },
  "SbQa2CXPv5xnzLLsEWrY6Q": {
    "date": "10/12/2009",
    "text": "I've been to Cyclo twice. The first time was great. The food and service was really good. Pretty reasonably priced. Really loved the fact that you could bring your own wine. Went back about a year later. Again, food was great. The garlic green beans as good as I remember. Pretty good service. The owner was there again in another cute little dress (sorry, but I notice that kind of shit). Liked the check holders had customer graffiti all over them (more dumb shit I notice). Finished the wine and meal, hit up the bathroom before leaving. Only one and it was occupied. Fine, it's a small place I understand. Wait a bit, then our spiky haired waiter comes out. He gives me a shifty look, which I didn't understand. I Immediately get it once I make my way in and look at the toilet. Didn't even put the seat up. Piss everywhere. I was so mad. Unfortunately, the bill was paid and he was tipped by the time I came out. F'n disgusting. I hate to judge the place by one waiter, but feel like if they are gonna let this ahole work here, can't help but think what else they might be letting slide.   Sorry, won't be back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0jKlK9n8u09jJoHL4RRsIg"
  },
  "t4IBp_Za_jHqrY6qXjbFtg": {
    "date": "4/9/2009",
    "text": "Very good. Cheap.  Too bad it is located in the seventh dimension of hell (aka Chandler).  I would eat here every week if it wasn't.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ExI15M-oXjHcF42-G1xv9w"
  },
  "at12Oau_qy8xrJAhqBUJaw": {
    "date": "3/11/2011",
    "text": "I love Cyclo.  We've been many times and its usually VERY busy.  Excellent Vietnamese food! Every dish we've had here has been great!!  Despite the poor reviews of the Pho, every one we've had has been good, especially the seafood Pho. The owner is so nice and friendly!  Its BYOB too!  If you like Vietnamese food, check it out!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dq8bghWtEDWsT1K9wLYX4A"
  },
  "QsDt6pvuGaEOJvASOJ593A": {
    "date": "9/18/2010",
    "text": "I love Justina, the owner.  She is super sweet, funny and sassy.  It's True that she has a wicked sense of style!  My husband and I had our second date here and religiously go about once a month.  We go for the AWESOME food - the Mint Chicken is my favorite although the Crispy Noodle Cake is pretty good too.  My husband also likes the Pad Thai here.  You can't beat the BYOB or BYOW with no corking fee.  I love the atmosphere, the music and how intimate the restaurant is.  This really is one of my favorite places to eat and I always bring out of town guests here.  :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4zxphgbpQg87y7JXhuO9pg"
  },
  "NYaPkuDcaBPNf5qJqvKxGQ": {
    "date": "9/4/2008",
    "text": "I was having a frustrating day at work and couldn't care less about getting back to work late from lunch.  Pho had been on my mind heavily at that time, and I decided to indulge.  I read up on some places in Chandler, and this was the closest one to the job. This was a while back, but from what I can remember, the pho was good-not the best-but good.  They gave me all the fixins, the broth was just right, meat was tender, and the noodles were cooked just so.   The service was...interesting.  I won't say its bad, its just very non-chalant.  Kinda breezy.  I'll leave it at that.  And since service is so important to me, I had to give the place 3 stars.   The decor and actual building don't garner a comment from me.  I couldn't see anything anyway after the steam from my pho clouded my glasses up.   What can I say?  I went there for pho and got satisfied.  Not the best I had, but it hit the spot.  The menu looked like it had some awesome stuff on it though, however the prices aren't the greatest.  Honestly, I should try this place again and review it afterwards.  One visit won't give you the full flavor of any place, and this one seems like it has more to offer than what I required from it. Give it a try.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aMN80DrgGyk--Nf2Du9M9Q"
  },
  "jTupN37y8Gv5zVvYSDNnnQ": {
    "date": "5/7/2008",
    "text": "I had the pho and my friend had the vermicelli with grilled meat and egg rolls.  Both dishes were tasty.  The decor was cute but very dark for dinner.  The owner is very flamboyant.  One coworker loves this place.  He also says he was kicked in the head by the owner with her 5 inch heels and she threw trash at him.  Another coworker believes she is so rude that he will never go back.  I think the consensus between most of them is that the food is good and the owner gives a good performance. My friend and I did not receive a special performance but she does dress to impress in small tropical outfits.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jBz-hEEWEW8Fj8cNhasfDA"
  },
  "GNErXnCF-jvryxl6S_HNcA": {
    "date": "3/30/2009",
    "text": "Didn't care for it.  Expensive, small portions, and mediocre cooking.  Go a few blocks west to Saigon Pho if you want the real thing.  But this place is prettier, whatever that's worth to you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HKIFN7bin1aKtQZ9k9tRlQ"
  },
  "atK75-QbNwH51xTR1E0_Kg": {
    "date": "5/10/2009",
    "text": "Its BYOB. The owner is hilarious. The food is really good. The service is interesting but not bad. It is what it is. Its not fine dining and your not paying fine dining prices so relax. It kinda ads to the charm for me. Good times...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V6BjjQICDO4q7TT3ZhaPWw"
  },
  "TYx2Ftc_2uhqwqfifMBe4w": {
    "date": "10/10/2008",
    "text": "My wife and I eat out 3-4 times a week.  We have a hard time finding restaurants that consistently serve great food and have even better service.  Cyclo has both, and Justina makes dining an absolute pleasure.  We have been dining at Cyclo for 3 years and it is definitely one of my top five restaurants in the Phoenix metro area. Cyclo does not serve alcohol but has a BYOB policy that makes going out to dinner a whole lot less expensive.  I highly suggest eating here as it is one of the better restaurants that I have experienced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OaD9Lhdz9YAeRuiUAUuDoA"
  },
  "kbaalkOVI6fSDDGG5Qemsw": {
    "date": "9/15/2009",
    "text": "Eh, it was okay but overpriced.  The food was passable.  The service was bad.  I saw her smiling and being friendly with others, just not us.  Maybe she is relying on being cute to make up for her lack of manners.  She would not give my fellow diner a fork, the bus boy heard the request denied and gave him one.  He was a tad miffed, and I was outright pissed.  But hey, it's her restaurant, if she wants to be a jerk about it, then I'll go elsewhere.  And I will.  To seal the deal, I read their Maricopa County Health Services report, GROSS.  Cyclo, you're dead to me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qg70YmosCoEeBZ0QOC6qRA"
  },
  "Yz3emcEuV9bKFXMg0iGPCA": {
    "date": "6/3/2012",
    "text": "Went last night, awesome environment, great art, amazing food if you like Vietnamese, would recommend the seafood soup and the egg rolls. BYOB which I love!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a67i7VUHYa9jUQ5s8SdsHA"
  },
  "rXz4405D7jRuwT1sp61OIA": {
    "date": "9/11/2010",
    "text": "This is not your regular DIVEY Vietnamese joint.  If I want that I'll go to Da VANG, where truth be told I'm afraid to go to their bathroom, but enough about that.  Cyclo has the best seafood crab soup! The spicy green beans are amazing and yes Justina is half the reason to go.  The prices are higher but the quality is BETTER.  There are so many things on this menu that I love.... the cake noodles are the BEST!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Cmmt_34PxuC84P1AgmetQ"
  },
  "pIE-2I1771My-O6i9yv3gA": {
    "date": "7/30/2008",
    "text": "I took some of my Intel boyfriends (LOL, I see you on Yelp!) here twice at the recommendation of a friend.  The first time they were closed for renovations, and finally got back there last week.  The \"Thai Iced Tea\" wasn't very good - it wasn't thick enough, even a little better.  I had the Pho Hai San.  It was good but not very much seafood - but not bad for $10.  My co-worker got the Com Tam - which was good.  A couple others got various Phos, they're Vietnamese pros and I'd say on average we probably would give this place a 6 (1-10).  The owner had a tongue in cheek way about her, was funny at times but went a little too far at others.  Anyway - been meaning to write this review for a while now, but the buzz around the office this morning is about a recent health inspection.  We figured it was BEFORE the renovation, but it was AFTER!  Its really disgusting, and none of us will ever eat there again.  We're talking some serious stuff.  Food being stored in a broken fridge, and unsightly critters running over the FOOOD!!!!    I gave it a 2 because w/o the bugs I probably would give it a 3-4, maybe a 4 because of the low prices.  Maybe I'm naive and critters are in all restaurants but now that I've seen the report - no thanks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c9t-sA2jfmAm0wiyOKtWUQ"
  },
  "sIWDjDddQxnKDhJcPE9teA": {
    "date": "1/2/2010",
    "text": "it's good, very good, but for a Vietnamese place, has a very short menu with limited choices.    And for the biggest knock on the place, no fish sauce on the table.  Huh?  Well, judging from the lunch crowd, none of the people that eat there would know what it is anyway.  Not a Nguyen in the place other than the people running it.  (joke for those of you with Smith for last name!)  No big deal.  Pho Tai was very good, I love having green onions in the soup, but I doubt it is traditional.  The accessory bowl was short a few green items but all very fresh.  The broth very nice, though I think salty, but mmm, good.  Service was excellent.  Ambience different than I expected.  Small, quaint, clean, lots of awards on the wall, which I'm sure are well deserved.    The spring rolls were very tasty, though not traditional with dried pork, but the crispy and very yummy grilled pork and shrimp were delicious with the right hint of mint.  mmmm.  Very good peanut sauce to go with it, though I'm a fish sauce fan, which I didn't get to try THIS time.  Next time I will.  I also tried the preserved lemon soda.  Delicious!  I think if this place was close by, I'd eat here a lot.  A nice Pho can't be beat and I would love to give their other menu items a chance.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "URziMTGW_qU7tX6kTWTQvw"
  },
  "4k5ZUcXq2ROpNk7HJC11dA": {
    "date": "3/20/2008",
    "text": "I saw the reviews and wanted to try this place. I found it to be rather average for beef Pho. The only negative was the side of bean sprouts that came with it were a little old and wilted on the ends. I did like the place but I don't think it is above average. I don't drink wine with my Pho so maybe that is a plus if you do. The people are friendly and the service was good. The Thai Iced tea was good too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2c1HOZ2Wnq4fZclpS2hpSA"
  },
  "XA1f93rdDEgmYYcy7VzBbQ": {
    "date": "12/18/2009",
    "text": "I was at a wine tasting recently with a group of friends and we began to talk about Vietnamese food. Someone swore that this was absolutely the best in the valley so I had to try it. Suffice to say I was disappointed. I ordered the seafood pho and while it was okay it definitely lacked flavor. I will admit that the black pepper shrimp was delicious but everything else we had was subpar and much more expensive than any other Vietnamese spot I have been to...I'm going back to Pho Van.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z7A2nWg8TFQ9kSgWdsDOTw"
  },
  "cBEblFdPZiCteHkkHKgxCw": {
    "date": "1/5/2009",
    "text": "I left my previous review after my first time at Cyclo, which was an awesome experience.  Since then, I've been back a couple of times, and each time both the food and the service seem to get a little bit worse.  At this point Cyclo is nothing special, and Anise and Pho Van up the street are probably both better.  Additionally, I read that Cyclo nearly got shut down during their last health inspection for some major violations, so that makes me a bit hesitant to ever return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "waQyArTYXLuJrY8Jo3guNQ"
  },
  "sKZ4_hF1X8tYqkbOulssrA": {
    "date": "8/16/2007",
    "text": "Very cute place, in a strip mall, oh well, it is Phoenix.  They papaya salad, awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZY2HuOTauUiYgOE_Ee5o3Q"
  },
  "DbqLmYn3-zKb4BwE72m1Cw": {
    "date": "1/5/2010",
    "text": "Use to really brag about Cyclo.... don't know if the economy got the better of the business, or the owner is just gotten complacent, but I no longer go, or recommend it.  The portions have gotten smaller, and the quality has gone down hill.  One bright note... the owner is still funny, and sarcastic, which I love.  Get your act together, and put the shine back on your gem!!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BOoCgJ8mkFV5k6O35yIAww"
  },
  "wovZbw2i1fYRwf6rNvZt0g": {
    "date": "2/18/2017",
    "text": "Food was very fresh, service was quick and the owner is super personable and lively! Ordered freshy rolls, chicken pho and pad tai, all were great! Water has blood orange, lime and lemongrass, very refreshing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Lc_SOqxjSZxWA1ZIGc2MPQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Pad Thai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Lc_SOqxjSZxWA1ZIGc2MPQ/o.jpg"
      },
      {
        "img_id": "mQNw1Pc7661hQ9yuUwTq2A",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Freshy rolls were super fresh and yummy, served with peanut sauce.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mQNw1Pc7661hQ9yuUwTq2A/o.jpg"
      },
      {
        "img_id": "-_vI6FP-Q9K2x58-Jp3fjw",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Water is colorful and tasty!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-_vI6FP-Q9K2x58-Jp3fjw/o.jpg"
      }
    ],
    "user_id": "Xlt3qsO_pcgR-D38om9RHQ"
  },
  "TQH6NKTDnJi-m7hFrfO17g": {
    "date": "6/28/2018",
    "text": "Love the atmosphere in this place.  The owner is very friendly and loves to talk to you.  Food is great, and the bring your own liquor is even better!  Well definetly be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qmQiUGugpYZtlWiONuO0Wg"
  },
  "uNxL3dV15O9e8aJrGGA7tA": {
    "date": "12/13/2017",
    "text": "Seafood Pho and egg rolls were delicious. Loved the fruit infused water even. Owner was super friendly and helpful. I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1noqrO_LklC14MGha2ByhA"
  },
  "wG7YF9S5y7rWCgxbChG-Ig": {
    "date": "10/6/2014",
    "text": "I was a Cyclo fan when it first opened and I have been coming back ever since. I have watched Justina turn this place into a quaint shop with just a few plastic tables to the chic modern look that it is today. The quality of the food has not dropped a single notch over the years, and I cannot get enough of the Lat Na! Her pho and lemongrass chicken are also delightful.  One of my favorite parts about Cyclo is that it's BYOB. Bring your own wine, she'll cork it and serve it up to you. Want to keep a second white cold while you wait for entrees? No problem, she'll put it in the fridge for you.  Yes, Justina is a bit of a firecracker with the mouth of a sailor. But you have to appreciate that she doesn't hide who she is, she'll remember your name (especially if you had the audacity to ask for a fork), and she will greet you with a smile when you come back again! Cheers to many more years Justina!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "zb9GH11J7PQDFst7yajSog"
  },
  "ofWBsjH5mf6QxJM_Wv-axw": {
    "date": "11/15/2017",
    "text": "The best PHO you can get!  This is truly a GEM! Everything on the menu is fantastic...the service is great! The owner is the coolest person you will ever meet!  Probably not the first thing you would discuss on yelp but the water they serve is something you will remember...something different and fresh every time you are there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fa6ezsBoY-cW42FxxeuoOA"
  },
  "UQB_4o3HdFhwKqkLURItsw": {
    "date": "5/27/2018",
    "text": "I love the pho here! I got mine Togo and it was nice to see I wasn't shorted! Will def go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i7pO5Zq0_uoB9-D1uiGe2A"
  },
  "y2xZ1pJUKMVlwXl_HOJaqA": {
    "date": "9/16/2017",
    "text": "My friend took me here for the first time last night and I couldn't be more upset that he hasn't showed me this place before. Young man helping us was incredibly attentive, owner was so sweet and has a certain ora to her that can energize your entire body. The pho tai had a nice homemade broth and the you can immediately notice the beef is high quality. I can't wait to come back and I wish you guys would open a location in north Phoenix! We need a good viet spot up there!! Hint hint!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rATOBMt4cvaHb1m81fmvbg"
  },
  "CJ8GbcRBeW-YAXAYXosrCQ": {
    "date": "10/12/2017",
    "text": "Love this little place with modern clean decor.  Pho was excellent!  The mango rice dessert is my favorite finish to my meals.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SdgzyCHJjyJEgndQC_my1w"
  },
  "bnfFzPf_C1BM4L_d77Q_jA": {
    "date": "8/5/2016",
    "text": "This place is super cute!   It is def different from other pho places, I am used to like the hole-in the wall sketchy looking places but this place was very polished. The water came with cute cut out fruit pieces and I ordered bun and it all came separate in a style that I never had before. The presentation and the quality was amazing but honestly it was a little pricey. Again because I am used to the hole-in-the-wall and so its typically cheaper (~ $6) but here it was around double (~$11).   I would def still go back because it was delicious and the quality of food was excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lX1Pvn_AgD9fUffPsioeVw"
  },
  "598vIbvRKjnKdY7V2SPkCw": {
    "date": "6/14/2017",
    "text": "Awesome setting, great owner, broth is best in AZ!!!!!!!!!!!!!!!!!!!!!! XL pho. BYOW sounds good to me",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qj88f3OwSgrqBqgmz7bluQ"
  },
  "U0hNonr1QosvEHsF2UYyqA": {
    "date": "5/12/2015",
    "text": "I am not Vietnamese, but this food rocks, this place rocks, and the staff rocks.  First off the food is awesome. I don't know what authentic Vietnamese food tastes like, but as far as I'm concerned, if this isn't authentic, then I don't want authentic. Fresh ingredients, good spices, and fun options.  Secondly, the atmosphere in here is modern and really fun.  Apparently a Cyclo is a type of Vietnamese bike-cart type thing piloted by skeletons, and they're all over the place, along with cool modern art.  Lastly and most importantly, the staff is really fun. When we came in, the lady who seated us and took our order (I think she's the owner) harassed us for taking too long to order, and then started hitting on one of my associates because he was from Utah and thus probably a polygamist to her. It was super fun.  I've been back only once since, but I can't wait to go again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "91n5BRSJyDvGWkioGnCoqw",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. The garnish in the water is insane!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/91n5BRSJyDvGWkioGnCoqw/o.jpg"
      }
    ],
    "user_id": "jn6vn65m8uwXLmaTXtQkRw"
  },
  "rMGAj9sGu0l2cgnoRzjEXA": {
    "date": "4/26/2018",
    "text": "I don't have much to say for the interior of restaurant nor the ambiance since this was my first visit. I made an order for carryout, which was ready even earlier than they said it would be, which they quoted at 10 minutes to me over the phone. I ordered the chicken and pineapple curry, as it sounded good. The curry was hardly flavorful at best and was overloaded with spices, like it wasn't made fresh that same day. I should have put the curry down right away but as I was hungry, I finished it. I proceeded to spend the next 2 days with the full symptoms of food posioning, missing 2 days of work because of it. Most expensive, foul bowl of curry I've ever had. Never going back here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q29aVrdzzdIIJNhEot69yQ"
  },
  "k_xgnF7ssSQMuMX12X1Yfg": {
    "date": "8/12/2017",
    "text": "This place was recommended by a friend. Thought the pricing was a little high for what we got but the flavor was good. The lady who took care of us was very friendly and helpful. Loved their fruit water!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dyu7m8P4CBE4cjCXCLylwQ"
  },
  "rH6vUYJ_GAeUk8771Ys9VQ": {
    "date": "5/6/2016",
    "text": "CYCLO is life changing! I have recently been introduced to it I'm hooked. I love it here... Good for the soul and the appetite. BYOB is one of many great things here. Please experience it with an open mind and you'll find a new favorite place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N5B8kyEBeIi2X5gguCa_qw",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N5B8kyEBeIi2X5gguCa_qw/o.jpg"
      }
    ],
    "user_id": "IqG-2QXqC0crWgMBdoBrGg"
  },
  "ULjs8MNoHznMPIybJVTyUw": {
    "date": "1/19/2016",
    "text": "I think the best part of this place is the service. The food came out really fast, and for a lunch time place I really enjoy that when I'm on the run. Just the conversation was fantastic, the manager is simply the funniest (and sweetest) woman who calls everyone \"love\" or \"dear\" and lets you sit wherever you would like. I will say its a bit pricier than being in Mesa, but the convenience of being closer to my house is such a plus that I can't knock them down anymore than one star!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "ICw4trkmmulxI-SwmY0yiQ"
  },
  "OBkwI49bS9mJ1xNBHNKzPA": {
    "date": "5/4/2016",
    "text": "I love this place!  The funky/modern decor is perfect. The fruit infused water is delicious. The fresh ingredients are delicious. Staff is efficient, helpful and polite. This is my favorite lunchtime Vietnamese restaurant in town. I highly recommend the the beef soup.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e4WRPoYQ2e7XAiDkY0M97A"
  },
  "CrTdiL9YqGPrLQNb5ksCdg": {
    "date": "5/15/2017",
    "text": "Justina's hilarious and the water is amazing. They generally infuse it with fresh watermelon, cucumber, and other fruit/veggies. I've had Pho and Bun Bo Xao (she calls it Bun Sai Gon) and both were excellent. Just walk in and say \"Hey, how the f**k are ya\" and I promise she will respond well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dztDplZ_f718XH0T0ihnsw"
  },
  "1wq4hxDNpEzFZeNGmASwGQ": {
    "date": "5/19/2016",
    "text": "Always consistent and great food. I brought my Asian friend you any thought it was awesome. In the hostesses the most us, of course. I'm coming back soon",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9lCl3G2TbRBR82TAT5IDWQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Hostess at Cyclo !!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9lCl3G2TbRBR82TAT5IDWQ/o.jpg"
      }
    ],
    "user_id": "1zkRozedrepwlAHK9KS6PQ"
  },
  "xsKSKjeUcf2Pf2GQ1A-2Tg": {
    "date": "7/7/2017",
    "text": "This has quickly become one of our favorite restaurants! Our kids love the Pho soup (which they are happy to customize-ex:they take one order of the pho soup and split it between the 2 kids because the portions are too big for them). I love the pad Thai (can't order anything else, it's too good) and my husband has yet to find something he doesn't like (he is more experimental than me)! The service is great, and the water infused with fruit is a nice touch. It's a small place, but we've never had trouble getting a table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e_wgnUSB8DuR7KJ9qcMc8g"
  },
  "2UdqhgWjKdm7NeP3l0ZWnQ": {
    "date": "8/21/2014",
    "text": "Justina is such a good friend. She always makes me laugh and makes good conversation. The place can get really crowded for lunch but the service is quick. I have never been for dinner.  The chicken wings, spicy ribs, and pho are super good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "floc5K7XuiGomt_Jgw6DIw",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Empty plates!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/floc5K7XuiGomt_Jgw6DIw/o.jpg"
      }
    ],
    "user_id": "6urS-vMeMNMw1ogB577H7w"
  },
  "myJOAcq0QkXf9viDyedwlg": {
    "date": "9/21/2013",
    "text": "My boyfriend and I love trying new restaurants and especially something that is far from classic American cuisine.  The first time coming into Cyclo, we were hooked.  Justina is there every time that we come to eat and she makes sure to go to each table to either take the order personally or just chat with the table and make sure every one is happy.  I recommend going and letting her \"surprise you\".  We have yet to actually order, everytime we go she picks our meal and I have yet to have the same thing twice.  Everything is AMAZING.  Absolutely Mouth watering.  Cyclo is BYOB so be sure to bring your favorite wine or beer and enjoy the best vietnamese cusine you have ever tasted! All the staff is attentive and friendly , the artwork is local and beautiful and the feel of the space is inviting, friendly and just happy.  I give it 10 stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tMQWBJmetBZyuW62H1mCVA"
  },
  "R-NogjLAVWrvhgPKbhLRKQ": {
    "date": "8/2/2012",
    "text": "If I could separate my review into two categories -- \"Food\" & \"Service\" -- the Food would probably rack up a couple more stars. It was good, no complaints at all. Not the best I've ever had, but very nice. Pricey? Yeah, a little ... but probably in the vein of \"you get what you pay for\"...   For me, the (unfortunate) star of my visit was the service. I can't complain about the promptness or the attentiveness - both were excellent (though I was only 1 of 2 in the restaurant for a rather late lunch that day). What I will complain about -- and what came THAT close to me simply walking out of the restaurant mid-meal -- was the over-the-top, offensive, completely-inappropriate, 4-letter-word-laced commentary by the owner that permeated my entire meal.   I see from other postings that the owner (Justine) seems to be a hugely-positive attraction for many other reviewers. Perhaps I got her on a bad day, or in the middle of an afternoon booze session, or perhaps my experience was especially noticeable due to being one of the only people in the restaurant? Regardless, I was certainly not impressed. It wasn't cute, sexy, or engaging. It certainly wasn't professional. I am not a prude by any means ... but I heard enough F-bombs, bigoted statements, hateful talk, and borderline racist comments during my 45 minutes there to negate any warm fuzzy feelings I had about what I was eating. Again, I read many reviews that shower praise and adoration for Justine, and I know this was just my experience and my personal opinion ... but I just must be in a different crowd.   Simply put, there isn't a bowl of Pho good enough to warrant sitting through this barrage ever again.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 19,
      "cool": 2
    },
    "photos": [],
    "user_id": "fjAppEHMhWpynKOyZdN77A"
  },
  "G6Hrm81CAeFAXMZmS7x_bw": {
    "date": "2/23/2013",
    "text": "We stood by the door for 9 min. waiting for them to clean off a dirty table for us to sit down. I was surprised and annoyed they didn't do this sooner. I had the Hanoi Rice Vermicelli and I liked it very much. My partner had Mint Chicken and we both thought it was bland and boring but Justine was kind enough to replace it with what I had. I think a better price would be $10 instead of $13.50. I think it's cool that you can BYOB.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "B9anjwZErHasKgcdVtoJoQ"
  },
  "S36tNYZL0kX4CLmGODqxow": {
    "date": "10/5/2011",
    "text": "Beautiful Justine, the owner, seems to always there in a slinky dress and 4'' high heals (Ole).  She makes you feel like you have known before you've ever met.  She is a friendly host and smiling all the time.    My two favorite things are:   - the long beans and   - the beef salad.    Although the food is vietnamese, it seems more exotic.  I never get Pho here, which is my standard at all other Vietnamese places.  I guess I am too focused on the items above to even ask about Pho.    You can also bring your own bottle wine and open it at the restaurant for a small cork fee.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yAdnKwB8ReKDY-0po46Thw"
  },
  "tQMX6_Qo5krd5TbkmRi9iw": {
    "date": "6/27/2014",
    "text": "I'm glad I read these reviews *after* I went there because there are some really (a) uptight  and (b) cheapa$$ people writing reviews and I wouldn't have wanted to have been dissuaded by them. Two friends/colleagues and I went there for lunch today; it was the first time for all of us.   The decor was bright, fun, and modern...from the clear plastic chairs, to the orange circles and abstract art on the walls. From the moment we walked in, the owner, Justina, catered to us, exchanged playful, witty, banter, and peppered her sentences with a healthy dose of f*ck, sh*t, and other \"fiery\" language. I loved it; it's exactly how I talk and interact with people I know.   She visited our table often. I didn't interpret this as an intrusion or her wanting to be \"besties\"; IMO opinion it was genuine attempt to provide attentive service and show us we were valued customers. I asked her how long she'd been operating the restaurant (12 years), where she moved from (CA), and what else she'd like to do in addition to or after the restaurant (I'll let you ask her and tell you herself).   The food was great (though, admittedly, I haven't had a lot of Vietnamese food. We had the spring rolls (the wrap was a bit chewy, so not the best I've ever had) and the Hanoi and Saigon Vermicelli (both of which were amazing: flavorful and fresh). Overall it was a very fun lunch experience and I will be returning to try other offerings. My friends concurred.  My recommendations: (1) Don't go there if you can't afford a $10-13 entree. That is *not* expensive and if you think it is maybe you stick to fast food and/or generic, cheap, run-of-the-mill places/chains; (2) Don't come with a stick up your butt. If you want to be \"alone\" with whoever you came with, maybe this isn't the place for you. Fine. Go find somewhere else where you can be antisocial. But, for those who'd like to expand their horizons and meet and talk to new, interesting people, have a convo with Justina; (c) If you're offended by swear words or don't appreciate acerbic wit, humor, and friendly banter, don't talk to the owner. In fact, don't come here at all. God forbid you get all butt hurt b/c someone said f*ck in public. We wouldn't want your meal to be ruined. Or next time BYOB and get drunk so you don't care as much about what others around you are doing or saying. For everyone else who likes a fun dining experience with good Vietnamese food, check out this place.",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "g946y1tSpOh0UgH0s_vWSg"
  },
  "k4ymcsM1_Zzo5TGIGFyDqA": {
    "date": "12/22/2012",
    "text": "This place is more about ambiance than anything else. It's a Vietnamese restaurant for trendy hipsters-- complete with extremely liberal and free-spirited proprietor, Justine.  Although I like Justine, I can see how some might be turned off by her. But for me, she would be the main reason for frequenting this place. I like friendly and engaging staff, and I believe in supporting local business.   But the food is not particularly special. I've been here twice, and the meals have had little impact.  I like the atmosphere so much that I went again, hoping to fall in love with the food, but it just isn't happening. The flavor is too mild. And it makes me sad.   Arizona severely lacks culture and general character, so I want to support these types of restaurants so more will pop up. I might keep trying. Maybe I need to find *THAT ONE* dish that knocks my socks off. Here's hoping.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fqaLJNYYl9pq5dElMDjiDw"
  },
  "9D7xedKlWphFhmk9YNCxew": {
    "date": "10/1/2015",
    "text": "Always the best for hot soup on a cold night. Justina is a riot and always makes me laugh. Its great too because its BYOB! Highly recommend this place. Small and quaint inside. Homemade recipes",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UX34R48PkLhjHmI35Vf7hQ"
  },
  "y5vF8nZbzRGN1QhRkO9qQg": {
    "date": "5/19/2012",
    "text": "The Pho Was WAYYYYYY OVER PRICED! $12 for a bowl! Yea at 1st I was like maybe it might be a big bowl, but nope I was freakin' wrong! Felt like I just got robbed!!  This place is over rated! Overall its your money, but I like gettin' my monies worth when I eat.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "naaXWkFO7SdA1peVSfEHxA"
  },
  "_S018HgS-aCwK7WQBj82nQ": {
    "date": "11/17/2015",
    "text": "Delicious food, and Justine is a an absolute creative beauty! Love everything about this place, including the atmosphere and food. YUM!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7r88BCuLx52WQ7xS2XWnqg"
  },
  "7UEtKUZ8n4qxO0BLmSoZDg": {
    "date": "5/19/2015",
    "text": "My favorite Vietnamese restaurant.  I crave the crispy noodle cakes and fresh spring rolls regularly.  I love the owner who remembers me and my food preference each time I return.  I wish I could find more local restaurants like this.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s1dDGrDojjGK57eizQQ1gw"
  },
  "LAHZa6GO1HNuOVQfgcDbnw": {
    "date": "11/12/2016",
    "text": "Very very very warm and welcoming environment. You are greeted add soon as you walk in and seated with a nice glass of refreshing citrus water.  The food was delicious and authentic. I recommend this place if you are in the area and looking for authentic Vietnamese cuisine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b0-vUtrOydCwSu7dFL0pgQ"
  },
  "n5B4_15jvI8fUBb38JPNog": {
    "date": "4/4/2013",
    "text": "Best spring rolls I've ever had. Justina and her staff make then fresh when you order and they are always perfect. Never been disappointed by anything on the menu. Try the pho hai san if you like seafood!  Bring your own alcohol!  Seriously, I love this place.  Wish Justina had Cyclo restaurants all over the country. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7E0OPdUpSCewOcHVm87xjw",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Pho hai san (seafood soup)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7E0OPdUpSCewOcHVm87xjw/o.jpg"
      }
    ],
    "user_id": "eLdwfNAeDzAK1h8MrTaojQ"
  },
  "yvKPYpn9PCqT4bwk-TvgIw": {
    "date": "10/16/2014",
    "text": "OMG what is wrong with you Yelper's bragging about this place!  If this is the first place you ever had Vietnamese food you have been duped!  I have been there 3 times and I am done. Today was for lunch.  Cheap plastic furniture starts it off. We sit down at a table that was soaking wet and a older guy comes over with menus. Ten minutes later he brings us water. Five woman come in and sit down.  He brings them water. As he walks by I ask him if we can order. Nope he goes and takes the orders for the 5 women who of course get there food ahead of us and we now are there over 30 minutes.  Simple food ratings- Lemongrass chicken Dry as can be and it comes with no sauce. Pineapple Curry Chicken was terrible. Lastly the short ribs matched the other two dishes.  Other than the food runner the staff was not friendly.  Never again",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CHUMBPZdstb0OMc26jlldg"
  },
  "wlzrQLPWdOs2bTjEkI2P-A": {
    "date": "7/27/2015",
    "text": "Upon the suggestion of a friend we stopped in for lunch. What a pleasant suprise. We were greeted by an owner and had 2 delicious meals! The Pad Tai noodles were very tasty and I even enjoyed the tofu. The house Lime-aid was fantastic and the location was nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jwaRyyFimrTNz6NnjaUZUg"
  },
  "Gjy7qcZs1d3i9KS_VuYYrw": {
    "date": "3/12/2015",
    "text": "I am always satisfied with Cyclo. I usually get their Saigon Vermicelli and their spring roll appetizer. Staff is friendly. It's BYOB. Friends have gotten pad Thai, curry and soup. All would recommend. I would probably suggest they review menu pricing but their portion sizes are really generous. I can usually wrap the rest of my dishes to go but not the soup. Dishes run about $13. I think they could offer a \"regular portion\" for $9.95. I would have got an extra appetizer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t6cvXZrt7M9kRWpOHgL5VA"
  },
  "yc9OI-m9tzpRi4iWgPiMXA": {
    "date": "4/6/2015",
    "text": "I found this restaurant through the Phoenix magazine 9years ago when I moved from Hawaii.  The food was okay, but I thought it tasted too commercialized and it was pricey.  I gave it another try after so many years.  My rating has not changed, food taste okay, but nothing spectacular.   Ambiance and cleanliness is excellent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ktvVJtXdkpAVwfMogpMBjA"
  },
  "8c_lUa3sK-VkACtGHXT83w": {
    "date": "6/21/2014",
    "text": "So far, so good, I had the veggie spring rolls. The wrapping was nice and moist, the filling of rice vermicelli, fried tofu, and lettuce was moist and delicious. The dipping sauce was also excellent. If I could change one thing, I would add some cilantro inside the spring roll. I wouldn't mind trying a main dish here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8-tL6MQbXPawMlaf8kbqHg"
  },
  "8IIkOwDyqbWCtfagYyHzpQ": {
    "date": "5/3/2013",
    "text": "Addicted to the spicy green beans :) and pan fried egg noodles are my go to main dish. I have tried several things that are good here but love the fried noodle with beef, shrimp and scallops. Husband loves the Pho, fried rice is great, lemon grass chicken, black pepper shrimp all good. If you chose wisely, it's not difficult to eat healthy here too which is a +.    We love to bring people here for the adventure...if they haven't had vietnamese before and then there's the Justina experience. She's a little spit fire and adds a ton of fun to the already great atmosphere. BYOB makes even more affordable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nYongb6dqKRPc9sEjxc3gQ"
  },
  "AA7f8hfnm7JEAwYRFFsG8w": {
    "date": "10/8/2014",
    "text": "Horrible service. Asked 3 times to order, asked twice for a knife and what kind of Vietnamese restaurant doesn't have meatballs for your pho?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u6ymP6PmY7ADrpJJMNiQbA"
  },
  "d1Uyl-EO59u41f3b20yAmQ": {
    "date": "12/15/2013",
    "text": "I really don't understand what the fuss is about with this place.  I had it years ago and thought it was horrible, but decided to give it a try again today with some co-workers. What a mistake!  First off, the food is horribly overpriced.  You can get a better bowl of pho at many other Vietnamese restaurants for half the price.  Taste wise, the pho was horrible.  It's all about the broth for a good bowl of pho, and it tasted like they just used beef broth from a can.  Additionally, the brisket smelled like it was spoiled.  Even my American co-worker thought the food tasted horribly.  This is the first time I have not left a tip at a restaurant.  It was that bad.  If you go to a Vietnamese restaurant and you don't see any Vietnamese people there, it should tell you something.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Ajc8fMw3wV0b3FpdjV3Og"
  },
  "kwiDutogZvfIMHcL3DiaVA": {
    "date": "12/29/2018",
    "text": "Still the best Vietnamese in Arizona. A much more delicate touch on everything than typical Vietnamese food. Love it, and go here whenever I'm back in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gQhqlr2wMWPlgiEBxpTDhw"
  },
  "mhnCdaJhadezLrb26DJzsA": {
    "date": "12/28/2018",
    "text": "well to start i will give this place 5 stars again and again. from the moment we walked in the door it was such a positive environment! we ordered a shrimp dish with some spring rolls and pho.  let me just tell you, it was the best we have ever had! the owner was the cutest little bohemian women who has the sweetest heart. her restaurant has exquisite decor and i love how eco friendly they are! i just loved everything about my dinner experience spent here! the food was hands down amazing but the service was even more impressive. we will definitely be returning customers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zJfJC--nT-xKLTzdyvroyw"
  },
  "FJHeFC62jcm-iyeOby8nnA": {
    "date": "2/3/2017",
    "text": "We've eaten here a few times now and they're never disappointed us! The staff is so so funny, always enjoy the conversation that's not just small talk but they take an interest in their customers and pride themselves on being a relaxes and fun environment.   I personally love Pho Tai, I usually get this at every Pho restaurant we go to, and I love theirs! The beef is very tender and melts in your mouth. The spring rolls are also very yummy. Very fresh ingredients that are not made way in advance like others out there.  Even if we couldn't walk here from our home I'd still drive past many other restaurants to come here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "deoasOMv_HGvhAE093NzNA",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Infused water",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/deoasOMv_HGvhAE093NzNA/o.jpg"
      },
      {
        "img_id": "L-T1oaS9J-V2f5AGHOepQQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Spring rolls",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L-T1oaS9J-V2f5AGHOepQQ/o.jpg"
      }
    ],
    "user_id": "pOzDoPjsxgors0vQ7uzGHA"
  },
  "F1Fpwyh5DQ_Q0QuyY0ULGQ": {
    "date": "10/2/2016",
    "text": "Super cute and trendy place w/ interesting decor and adorable cut fruit pieces in their water, definitely makes you take a step back and enjoy the surroundings while you wait!  Tried the pho, as I'm new to the area and on a pho hunt, and it was pretty good, but the portions are smaller than I'm used to and more expensive sadly. Pho broth was still 4 stars, good ratio of meat and noodles, fresh ingredients, can't complain. But if this is the best I can get in the area I'll take it! Wait staff is super friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZFrIecL2C2rB1s-IVxYBtw"
  },
  "m48bkKCNt0qb78uS4Q3r5w": {
    "date": "9/16/2016",
    "text": "I have a cold, so I have been living off of soup for about a week now. Decided to try this place out since it was the closest pho option for me.  I balked at the $10 price point for the base beef pho on the lunch menu ( I am very spoiled by my regular spot, Saigon Pho's $5.95 pho lol) but they did have some interesting choices for seafood phos for $13. There was a snow crab one I was eyeing...but decided to just go for the standard one.   It was a perfectly good pho, although I really missed having tripe and tendon. All in all, a fine meal in a very colorful, chic environment. Oh, it was nice to have some variety of fruit in my water--that was a nice touch!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yQfN0tmEmZiYiu03nwcTTQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Pho $10 lunch price",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yQfN0tmEmZiYiu03nwcTTQ/o.jpg"
      },
      {
        "img_id": "f09hCUeRIe4RPZw_27wwLg",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Water with pear, strawberry, nectarine and lime, cute decor",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/f09hCUeRIe4RPZw_27wwLg/o.jpg"
      }
    ],
    "user_id": "pe3AX1Mw9HCcngmjl02Nxw"
  },
  "97muFzlhIFo6CHE_0Tqeog": {
    "date": "11/10/2018",
    "text": "The food was delicious. The water is amazing . it was infused with pieces of pineapple, lime, pomegranate and cantaloupe.  The wait staff was so courteous and friendly. Very modern atmosphere. Can't wait to try the other dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6BkuAUIlRjG9o-4oLdfhmQ"
  },
  "44NbRF9vopQgDeQ87h4bJA": {
    "date": "8/27/2017",
    "text": "Not that great taste. The pho was lacking its flavor and the fried rice was just an average. The service was little bit unprofessional though it did not bother me too much. The restaurant was small but ok. If u live close here, try it out. Otherwise, look for the better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ILCVi2berb_N4z1XSSnySw"
  },
  "m-gbKMWbS6ED3JpfXbioJg": {
    "date": "6/24/2017",
    "text": "The food here is fresh and excellent, we've been here and few times and I'm a huge fan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YPz068DR0fkU9uX1jJsfaw",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YPz068DR0fkU9uX1jJsfaw/o.jpg"
      }
    ],
    "user_id": "FP8cWCUmcv995FPwlFNDTw"
  },
  "SaHJAqSoLDEHXba_bwUcRA": {
    "date": "4/14/2018",
    "text": "Came here because they're open later than my go tos! The ambience is nice and the staff is friendly.  The food was better than ok/good, but it definitely wasn't authentic, and the typical strong flavors were super muted- Americanized Vietnamese at its finest.  Along with that the prices are a little high, but I guess you're paying for the decor and the fruit water (which was good).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1JknEhtwq25958LAO6R3xQ"
  },
  "TQnuQYSkqMoi6IiP_LMhhQ": {
    "date": "12/26/2016",
    "text": "Lately, I've been eating a ton of Vietnamese food. The owner of this restaurant is super awesome! She talks to every one of her customers and is just hilarious.   I ordered the Pho Thai which was okay. It definitely wasn't bad, I just felt like it lacked flavor compared to other places I've been. I also felt it was a little pricey for Pho. Others in our party ordered the egg rolls and were very satisfied with those. And, someone ordered the lemongrass chicken which he raved about. I will definitely be back due to so many people I know loving this place and the owner being absolutely great, I will just be trying other menu items.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "XOk0Wx1X2qzK5GQq05Aaww"
  },
  "f8hi1aPw-slBOS-sqcAiiw": {
    "date": "9/26/2018",
    "text": "Wanting/craving Pho, for a solid dinner, yet I had only a short, short time frame, the owner took great care of my request. The restaurant had gorgeous flowers and decor. Even the water was presented artistically and was 'tastefully' refreshing!  Yum!  The Pho was fantastic... going back next week with time to sit and enjoy the dinner even more and the whole dining experience. I saw customers cared for like they were friends and family!! Can't wait!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VcYe-hn3YIPqVIrJqPwwsQ"
  },
  "784txYCnPRVnbZnobjgaeQ": {
    "date": "4/26/2017",
    "text": "Funky little Vietnamese spot with interesting decor but overall an upbeat place. Owner was friendly and definitely had no filter which was hilarious. The infused water they offer is awesome with oranges, limes, mint and strawberries but the food was pretty mediocre I had the vermicelli and the pork and beef had not real flavor to it. Pad Thai was also pretty bland and not technically something you would find at a Vietnamese restaurant. Overall wasn't to impressed and was surprised to see such great reviews.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MBI9PGpox71jbi7wW9S40A"
  },
  "FANUD8d0vCrFddlFxD5Mqg": {
    "date": "3/12/2016",
    "text": "This is by far the best Vietnamese restaurant in Phoenix. The food is fresh and doesn't have added ingredients like msg. Gluten free options are available, diary free too, like the Thai iced tea. If you are vegan just let her know. There's even a vegan pho available. Unlike other restaurants justina can tell you exactly what's in the dish.  Justina, the owner is a True host. She gets to know all her customers but also give you space if you need it.   The service is impeccable. The water is always filled to the top in your glass. And the plates  cleared off the table when you're done. Speaking of water Justina puts fruit in her water and makes it naturally flavored with an essence of watermelon, mint, citrus or pomegranate seeds.  it's a True treat just to drink H2O. If you need it plain just ask!  People who eat at Cyclo are very friendly and I've sat there having a general conversation with complete strangers. Fun times.  And if you like beer or wine, bring it! It's Byob!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1PXlV_7C88jSh9ytsbZYrQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Chicken pho with veggies. Oh so yummy and good for you too!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1PXlV_7C88jSh9ytsbZYrQ/o.jpg"
      },
      {
        "img_id": "-ckQofJynlezOfetn09rmQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Yummy water with fresh fruit.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-ckQofJynlezOfetn09rmQ/o.jpg"
      }
    ],
    "user_id": "E_XRc9VGdbVL7zywjPqjsw"
  },
  "QgkYQ6xWCTxBnp0XVmSpIQ": {
    "date": "8/1/2017",
    "text": "Great flavor. Excellent service.  The decor is beautiful.  I look forward to eating at Cyclo again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nzlxmq6PN1jEUqwjjMm2Tg"
  },
  "ANV1pvA_YbvyVrBgEqDmOA": {
    "date": "2/8/2017",
    "text": "Loved this place.  Cool atmosphere, great food!  Was greeted by the owner (charming lady) made us feel welcome rite away.   Definitely a place to try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QewA1wFbwNUqt_Mf0gQ13A"
  },
  "5ybVk-0qDcsIpHnCWXJwQA": {
    "date": "1/2/2018",
    "text": "Wow, just plain wow.  Everything about this place was like art work.  Even their water was a great experience.  I very much enjoyed my Pho and Vietnamese egg rolls, although I don't think egg is even an ingredient.  We t was all great and my waiter was even kind enough to offer to show me how to properly eat the rolls with the greens they are served with.  Fortunately, I am an experienced eater and handled it but I have never had anyone offer to explain it.  Great job, keep it up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Raxyghpfm6929KRdPgOYmA"
  },
  "wExWdF6ZxmQXa0Q-0kBaaw": {
    "date": "12/20/2017",
    "text": "Ordered the pad Thai and spring rolls.. pad Thai was amazing! Everyone here is welcoming, and the food was quick and inexpensive. Definitely recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ma7ZbxGJkGKlyteOnXdytQ"
  },
  "96ka2dS38GfUzYmgFIl7Ow": {
    "date": "1/12/2018",
    "text": "I feel like I would come here just to talk to the owner . I love her. She's so funny and warm and welcoming. The food is bomb. I always order take out on my way home from work and it never disappoints. I've had a bunch of different things on the menu but the Scallion Vermicelli bowl w beef or the PHO is my favorite. Good spring rolls too. A+ from me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4eVE8Cs8R0D6BtqRiEmjTg"
  },
  "hWPJDLjA9bNGshigLmUoyg": {
    "date": "1/18/2018",
    "text": "Cute place, knowledgeable staff, great customer service and yummy food. Everyone I was with thought the same thing. The server(who I assumed was the owner) went above and beyond. I asked her if she had any herbal tea, she said they only had jasmine but then she said \"oh I have a private stash and made me herbal tea anyway. Yay! Another great restaurant I can go to without getting sick. I have a gluten, egg, yeast and dairy allergy and I had no reaction after eating what the server suggested.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hvq-LYRF7uNaRbcIyb2Hxw"
  },
  "FCpetjTM0hX8-UztVasQig": {
    "date": "10/9/2015",
    "text": "Chic and trendy while still retaining a welcoming feel.   Looking for a quiet place to enjoy an Asian meal, I stumbled into Cyclo. Walking in I was immediately greeted by the animated owner, who made me feel instantly happy with my choice in venue. She recommended to go with the beef pho which was delicious and hit spot.   Oh, and they offer BYOB (bring your own booze). What more can you offer?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bxM64zzywW4ALr7OoYlS2w",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Beef pho",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bxM64zzywW4ALr7OoYlS2w/o.jpg"
      },
      {
        "img_id": "lIe3Gs5FyGJUklmzXseukw",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Restaurant floor",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lIe3Gs5FyGJUklmzXseukw/o.jpg"
      }
    ],
    "user_id": "xbxmmu1HIjnbfpoePTel2g"
  },
  "WvuGIFa5rTi_t7_qEXDFfg": {
    "date": "9/9/2008",
    "text": "We go there often, including just last week. Justine has updated the decor, with bold colors and chairs that are much better than what they used to have. My experience is she has toned down her \"sassiness\" recently - along with dressing very fashionably she may be updating her image also. It was a Thursday, we got the last open table at 6:15pm. I'm not an expert on VN food, but we love the food here. The portions seemed a bit smaller, but I suppose it's that or raise prices. We usually get several small dishes - beef salad, spicy green beans always have lots of flavor. It's casual enough my kids - ages 5 and 7 can walk around checking it out with no problems. I can see it being the type of place where service may vary depending on who is working and the customers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wlNvqjwyfdI_KP9LqFHMAQ"
  },
  "HGTNqG583AbqsQBfol2AyA": {
    "date": "1/7/2012",
    "text": "Love this place! The food is excellent. The atmosphere is intimate. And Justine, the owner is a riot! She interacts with all her customers, and she has some serious personality! Don't forget to bring your own bottle of wine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v_dg4--X6Wk8cqcXnOvJpw"
  },
  "M3HABB64qcG-jDd2jwY8eQ": {
    "date": "3/17/2013",
    "text": "Great prices, just sized right portions with incredible flavors and the owner Justine makes it a lively festive experience. BYOB with no corking charge.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Kgmvv8Y7WJLNOvbIiKHCoA"
  },
  "HNYfnZHmIPcP7lPCT_SfVQ": {
    "date": "11/17/2011",
    "text": "Fabulous food and sassy service - the perfect combination!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cyJZzE2diovGNeg24z9dhQ"
  },
  "X8r98jfXXwFCwAV3mu6tOg": {
    "date": "5/24/2012",
    "text": "I agreed with reviewer, ' Ima yelp'.  What a rip off.  $12.00 for a small bowl of noodles. I find nothing special about their food that can justify double price.  Taste, texture, ingredient, serving size - everything is the same as other Vietnamese restaurants that normally charge between $5 -$ 7.00.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "RFvFd7IjPjsqOVSL0g_OHA"
  },
  "QqRIo9P2ETac6SiSLBzHQw": {
    "date": "1/13/2009",
    "text": "I ate here 5 nights in a row after I found this place in the summer of 2008. It was a very different kind of restaurant. The food and service was good and the owner's over abundance of personality provided the atmosphere / entertainment.   It reminded me of Pesto's before success ruined them. A small place where the owner had their thumb on the pulse to ensure a really good experience.   Cyclo's was also B.Y.O.B. which added to the uniqueness of the joint. The only reason I stopped going is, we had tried all the appetizers, desserts and most of the entrees on the menu. And it is too expensive to be a place to go for a daily fix of noodles and water. But definitely worth a visit if you haven't been there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dc51eINRfoB6AXBDVCg-1g"
  },
  "mYDMtFtaOEbzhQu1olxxQg": {
    "date": "7/9/2010",
    "text": "While I'm reviewing pho's, I'll give my review on Cyclo. This is where I'd take that cute Vietnamese babe I met last week. It has great atmosphere and the food is awesome. I ate here about a week ago and had their pho bowl and it was one of the best I have tried in the valley, I really loved it. The girl who seated us was really nice and gave an enjoyable contribution to the dining experience. Yes this place cost almost twice what I pay across town but worth it with the right company. My brother and I ate here and we both agreed we would probably not eat here together much but we will both be eating here again. AKA we thought this was alot better place to take a girl or a business associate than our fav pho in the area to have lunch together.  Cyclo has a more upscale atmosphere than the average pho and we both thought the food is above average. I don't agree with another reviewers post that the portions here are small. I had one appetizer with a pho bowl and left full.  I'm 6'3\" 230 and like to eat ALOT and my brother who is shorter but heavier than me was complaining he ate too much after we left. One of the best phos in the east valley!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tkj5cwIPLlJstisrVzpAZw"
  },
  "dvJiY0x_JTPIE4r2OsQIZA": {
    "date": "6/28/2010",
    "text": "Food was below average for Vietnamese food.  The beef in the pho was shredded and not thinly sliced like it's suppose to.  The waitress is also a big flirt.  Not impressed.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TVp6TO4EIk1P-IxbCg5bFw"
  },
  "jL9CPcKeTvZWrIFMXY6vgw": {
    "date": "4/2/2010",
    "text": "Simply put, the many times I have eaten there have all been great experiences..from the food to the Owners attention..Justina is a floor show at every meal. It is consistently good and the byob policy gives it a for sure 5 stars for me..and no corking fee!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "K9udXuFZdPA1UluEuhRu6w"
  },
  "Vw-I5t6jqUWqYCCatq-YwA": {
    "date": "2/10/2010",
    "text": "Great. The owner just made us dinner. We didn't even look at a menu. No corkage fee on the wine. All good.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jAes_OPpvQy-cnmctqRqwg"
  },
  "npB0JxSJTzbSh8tdMej4yw": {
    "date": "6/12/2010",
    "text": "I believe this place is over-hyped.  the menu is overpriced.  the portions are small.  the meat is low quality.  slow service.  sterile decor.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YdS7NVnEhK0gTypX2kMc9A"
  },
  "qNiZbBb2_RQO44Xxni0KrQ": {
    "date": "8/4/2011",
    "text": "One star is too much for this restaurant. My friends and I went there on a Thursday night and was treated with no attention or smiles.  The lady owner only pays attention to 2 things: swagging around in her short skirt and cloking 4inch heels. The food was way too over priced for such a casual,average tasting restaurant (a bowl of beef pho for 13 bucks...Come on!) and the variety of dishes they offer was very Very limited.   The most annoying fact about this restaurant is that you cannot share certain food with others unless you pay 2 dollars extra! (written on their menu)   Save yourself from wasting time and money and head over to Da Vang for authentic, large, cheap Vietnamese cuisine.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SA_fRUH3_mG0HtSyreO1fA"
  },
  "moU7NKI1E40JWj9y94IBkw": {
    "date": "3/11/2008",
    "text": "I live in the NE valley and a drive to Chandler is not an easy one...But knowing that on the other of that drive is a worthwhile is priceless.  Cyclo is just that place...It's a small hole-in-the-wall next to a Subway in a strip mall.  you'd probably pass it and not know it's there.  It's a hidden gem that a lot of people know about, but hasn't lost its integrity.  I have been there a number of times and each time loved it more... It's BYOB...Great!  Bring exactly what you want to drink...How many times have you seen a menu without a drink you want?  You show up and wait...but, it's well worth it.  The owner is worth it alone.  She is fun, young and has a sharp tongue...Come ready! I asked her last time what she recommends or eats daily:  rare sirloin soup ( sorry, veggies! ).  I then asked how she eats it:  a bunch of Sriracha and garlic...WOW!  She was even cool enough to stay after closing and just talk to us about life, running and the restaurant she is so proud of...Well done indeed! I have two reasons to go to Chandler:  Cyclo and IKEA :) Worth every cent in gas....",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "PjXc1Zxl38vINgMOUzFNGA"
  },
  "nRZLxB9VZStMDLZpa8nHDg": {
    "date": "1/31/2011",
    "text": "Very good food.  The restaurant had a cool vibe and great artwork.  Was very clean and the service was great.  I had the Beef Pho and it was excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "evGC3hN8ef4Oxh9TCCEuPg"
  },
  "hFELP1m9P5yVPnMIgBtsmQ": {
    "date": "1/23/2007",
    "text": "I had high hopes for Cyclo ( pronunced see-klo). Alas, it was not to be. Although the place is clean and classy and the prices reasonable, the service leaves A. LOT. to be desired. Both times we visited, the staff were unpleasant and downright rude. Too bad, since the pho bo vien (a delightfuul blend of slender rice noodles, beef meatballs, bean sprouts and herbs) could have been magical...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "Xj9-p-_zm37ALyR1Qq34fQ"
  },
  "G8c-8fi9kyN98hxY-BuOag": {
    "date": "5/24/2008",
    "text": "I couldn't agree with David more.  The owner is definitley an interesting  person.  The more money she thinks you make, the more she will talk to and love you!  So tell her you are RICH!! (Sorry Didi C.) As for the food -  Ho hum VN food at high for what you get prices.  The Pho is very avg and double the usual price. They don't charge a corkage fee for  BYOB which is nice.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y7NaaCb4AkNjpdHVLuPCaQ"
  },
  "LVSu02nSzxDlFtcIPm5BAw": {
    "date": "9/12/2009",
    "text": "I went here for lunch this week with my 65-year-old mom.  We were impressed by the atmosphere, but the prices are the same at lunch as at dinner, which seems like a bit much.  The hostess/waitress/owner?? was very friendly and personable, at first; then a little *too* friendly and didn't seem to take the hint that we weren't into that much small talk.  Here's the best part:  when my mom ordered, she asked if she could please have a fork.  The h/w/o said, \"No.\"  Not even apologetically!  She said: \"Nope, you're going to learn to use chopsticks.\"  We laughed awkwardly -- ha, ha! -- and when the entrees came out, mom said, \"Seriously, can I please have a fork?\"  And again: \"No!\"  She didn't explain, and she didn't apologize.  We thought it was weird, but you know what, maybe they didn't have any forks, and mom did fine, and whatever.  BUT as we were paying our bill, we looked across the room, and there was a guy in his mid-twenties or so USING A FORK!!!!   Cyclo, why give some dude a fork and not a nice older lady who asks you politely TWICE??  If I had been there with my inlaws, you better believe they would have stormed the hell out in a hurry.  Don't know if I'll go again -- food was nice, but expensive, and I don't want to embarrass any future guests I might bring there.   So, BYOFork!",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "w-TEL1MT-oxWCE1yreoknQ"
  },
  "Vm-jMzkLl8BaTPu2RqzeLw": {
    "date": "8/22/2008",
    "text": "4 times I was there, the food was satisfactory. As a Vietnamese from Saigon, just came here for school, I have to say Cyclo is the one that is clean, in good neighborhood and still has the most authentic Pho. In AZ, most \"authentic\" places, for some reasons, are either dirty or in sketchy neighborhood. The clean and nicely decorated ones tend to \"americanize\" Pho to please majority of patrons.  Other dishes are delicious, maybe a bit varied from being authentic, but still amazing: Pork Short Ribs, Crispy Rice Crepe, Green Papaya Salad (my fav, and pretty close to what you would find in Vietnam), Spicy Garlic Green Beans. At first I was surprised, and rather amused to find guests bringing wine here. I guess certain reviews molded this restaurant into a fine dining. While the place is quite chic, pairing wine with Vietnamese cuisine like the ones here is .... very very odd. Heineken beer perhaps, but wine? Better save that bottle for a French-Vietnamese fusion bistro. One thing about Cyclo that bothers me is they need to turn the AC lower. 3 out of 4 times I was there, our group ended up sweating.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "pUx11DEcips6PLW157WdDw"
  },
  "imivnF0CzhXf0Eco1mQbTw": {
    "date": "2/23/2011",
    "text": "Justina is fabulous! The food is amazing. This is a great date night for my wife & I. Love love love it!  We bring guest in with us and everyone always loves it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1H1AUhIiEEdWvAO01dK2bw"
  },
  "rPURAE62ev1WKA8H57A0dQ": {
    "date": "2/24/2008",
    "text": "Cyclo is pretty cool.  Here you will find the most stylish, eclectic and entertaining hostess Justina, the most expensive pho EVER (a huge bowl never costs more than $6 in CA), and the entire Intel staff.  Sometimes I'm the only there w/o a badge.   My favorite here is the BYOB option.  The Pho is excellent, not $11 excellent but if I can drink my cabernet with my pho...hey no complaints here.  Spring rolls are the best I've had anywhere because the beef strips are actually grilled and it makes all the difference. The chili green beans and lemongrass chicken are signature dishes and are consistently well made.  They also made the food LIGHTENING fast which can make you feel rushed... because a nice bottle of red should never be rushed.  The place is small so go on downtime if you can to avoid standing outside and staring at the irresistible view of Basha's Grocery across the street.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "-KzxlotDy9GQ40dRRCGHkQ"
  },
  "7NQ7sYutFh5oVoGAaGYrsA": {
    "date": "7/15/2009",
    "text": "Best Vietnamese place I've eaten at outside of New York City.  Maybe even the best Asian food I've eaten in the Phoenix area.  And it's inexpensive!  I would be a regular if I lived out there.  It's really one of the better eateries in the Phoenix area.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "p4ToC7PvFkLW0N9kDcB99Q"
  },
  "VefY4ru2VTsUNDgwNnWlHA": {
    "date": "3/11/2015",
    "text": "Food is amazing!  True definition of a local joint! Justina is a riot and why I go back every time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ZRrIPMTMjbs4Hdl3xTwTw"
  },
  "66PfF9zNF6TfGxLgcGjQjA": {
    "date": "1/5/2013",
    "text": "The pho is fab... and the seafood with rice cakes awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vm2vV3nOS29xFrRpkD1sGQ"
  },
  "_yfVhszJnvoALmXHVZ2yfw": {
    "date": "11/12/2007",
    "text": "After reading the reviews here, we decided to check out Cyclo since it's right down the road.  I can't believe we never went there before, it was REALLY good.  The food was spectacular, and the service was great.  It was affordable, and the owner wasn't quite as wild as we read.  She was energetic, but not overbearing.  We got there a little early, which was good because it got really busy later.    SPECIAL NOTE:  It's one of those rare places where you can bring a bottle of wine, or some beers if you want to.  There is probably some fee for it, but it would have made our date perfect.  We had the garlic green beans (I would have NEVER thought of eating a full plate of green beans could be so scrumptious) , the curry/pineapple chicken (yummy and not too sweet, and finely tuned), and the Bun Sai Gon (Saigon Rice Vermicelli)...  all were A+ dishes and had very intricate flavor combinations.  We had three dishes and the bill was about $25 after a healthy  tip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "RpGMBHy0330xT_VeO027gA"
  },
  "FMraW7SwhTKDDkP_sDWqEg": {
    "date": "8/14/2013",
    "text": "I normally don't take the time to write reviews on anything but my experience at this place motivated me to create a yelp account.  First, the owner was irritating and sarcastic. I almost wanted to tell her to leave us alone so we can eat. She must think she is something. Second, the food was average, I have had far better vietnamese food. Third, servings were small for the price we paid for. Fourth, this place is RIDICULOUSLY expensive for a vietnamese place. Last and certainly not the least... I don't recommend this place. Went there once and will never ever go back again. Bad place guys, not worth your time and money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ASI4P16oh6PGHFNG9FB-ig"
  },
  "TRMDJc1FxnbGEvKoWr1QkA": {
    "date": "6/2/2012",
    "text": "So my buddy brought me here as a get way from  he corporate world.Hmmm very orangy type of place and the owner well......very enthusiastic. The place is small but nice. Now the food was good....spring rolls were interestingly yummy and the noodle bowl i had was actually not bad at all (bun sai gon?) it was a big bowl as real Vietnamese restaurants do. They even had a chili at the table and not sirachi sauce...so thumbs up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hFDFHO70fyENIQ1bbtYufQ"
  },
  "Ba8JN_Y3eG3bUJaV8VK56A": {
    "date": "1/18/2007",
    "text": "I'm surprise there aren't more reviews for Cyclo.  Bonus points if you pronounce it correctly (See-Klo).  I love this place.  The owner, Justina, is a hoot and really keeps the place running smoothly.  And if you're there more than once, chances are she'll remember you.  Cyclo is a haul for me from Central Phoenix, so it's not a super regular stop for me, maybe once every 6-8 weeks.  But, Justina remembers me and chats with me.  That's great service.  Cyclo is another BYOB and, Lord knows, I love that.  No corking fee.  Now, this isn't fancy.  Paper napkins and plastic cups, but dang, it's good.    Faves include: Green beans.  These aren't your ordinary green beans, they're chili and garlic green beans and they make me want to be a vegetarian. Tamarind ribs.  On the app menu, they are so tasty and tender and tangy.  I wanna lick the plate, but that's not lady like. Lemongrass Chicken.  Lil' nuggets of lemongrassy love.  Chicken deep fried and infused with lemongrass.  So simple and delicious.  Everything we've had here is wonderful and calling it reasonable is a laugh, it's downright cheap.  We were four for dinner with apps and entrees and tea for $50.  That's a deal!  They are now open for lunch, but no lunch menu.  It's the same menu all day long.    No reservations and the wait can be long.  I suggest going at lunch time or for an early dinner or be prepared for wait for a bit.  On the same note, this isn't a place that you sit and linger after you've eaten.  Be considerate of those is line, pay your check and get outta there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "QDf5uQRgy-kZScN4EVUKZA"
  },
  "zNSgmOlveoEgPUdVgiif0A": {
    "date": "1/3/2009",
    "text": "The foods are very similar to authentic Vietnamese foods.  You can't really tell the differences if you are not a Vietnamese.  The owner is extremely friendly.  She will stop-by and ask \"how is your day going?  What is going on your life?\"  She really listen to you.  Not a fake person.  I like her.    The place itself is clean and modern.  Very nice decor. :)  It is good to take your date to come here.    I think it is a good place for group.  I had my graduation dinner here.  The foods came up pretty fast.  You need to alert the owner though, so she can have extra server/cook.  For kids?...Uhm....Lifetime Fitness have a \"parent-night-out\" night?",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qdh9sm7iHn3gF40_ZJrYuQ"
  },
  "Dw4n0K8pk5aeW2Rfh5cIQg": {
    "date": "1/27/2009",
    "text": "So it has been a looooooong time since I have eaten at Cyclo and had an opportunity to have a little Vietnamese lunch so there I sat.... waiting for my friend.  The place looks great!  lively fun new interior.  I was sat promptly and offered water with a bit of mint (nice touch).    I ordered the short rib appetizer and crispy chicken.  My friend ordered the mixed grill.  The short ribs as I remember did not disappoint.  Succulently flavorful making me dream of taking a full order of them home just to smell in the car!  The crispy chicken had great flavor, but was a little over cooked.  (of course that didn't stop me from eating it.)  My friend really liked the mixed grill and loved the atmosphere.    Before I would have given 5 stars, but today a 4.  Don't let that stop you from trying though... It is definitely worth trying and I'd say a little more lively at dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iOhD8xrXFO18VsttgvnXUA"
  },
  "vjwC-eKdHS3FjdlVoEYObw": {
    "date": "7/20/2009",
    "text": "I've been eating at Cyclo for many years now and I have never had a bad meal.   I always start with the black pepper shrimp and since I've switched to a mostly vegetarian diet the past two years my choices have narrowed a bit, but Justina always modifies the food so it fits.   Over the years I've had pretty much everything on the menu and whenever a friend asks me what to get I say, \"Close your eyes and point, you won't be disappointed\".   The Vietnamese coffee at the end of dinner is a perfect ending to any meal.   The desserts are great and when I do get it I like the Mango Sticky Rice or the Creme Brulee. Both will not disappoint.   Justina is a great and I think it is funny when people take her too seriously. She has fun with her customers and they should have fun with her. She can take it as much as she can dish it out so just relax.   There have been some comments that when Justina is not there the experience is not the same. How could it be? There is only one Justina and once you get to know her you'll realize she is really much more than a crazy hostess. She is a really nice person.   I hope you enjoy Cyclo as much as I have.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xB6hzmt8aZ06xqdFpLSRoA"
  },
  "dP9LKcmZ2lfiiI5iu-Y9wg": {
    "date": "10/2/2014",
    "text": "Forgot to mention owners rude behavior while there last.  Just classless.  Swearing and extremely inappropriate subject matter for a business with guests. It almost seems like she didn't give a darn about anyone or anything. Too bad. This place had potential.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "waUK9rJ6tFxVPh3iZSmDmg"
  },
  "P9CnD5wsIVq8LG3IYBh-NQ": {
    "date": "7/29/2009",
    "text": "Wow~that really is too bad that this place was put on the Dirty Dining list!  But then maybe all those roach legs are the \"secret ingredient\"?  hahaha i'm just kidding.  If I were to take the Dirty Dining aspect out of the review, I would recommend this place to people who are venturing out into Vietnamese cuisine.    The owner is very friendly and knows my sister and her friends pretty well.  Whenever we go in, she takes our bottle(s) of wine (gotta love the BYOB!) and immediately opens them up.  She chats with us for 10-15 min., and always takes our order.  When it comes to cozy atmosphere, this place is definitely at the top!  The reason I stated that this place is a good introduction to Vietnamese fare is that I personally felt that the flavors were more suited to a Westernized palate.  Their spicy chicken dish (the name escapes me!) is quite good, but reminds me of Orange Chicken: it's not Chinese-Chinese, but Chinese-style American!  Of course, the dish I always get is pho.  The broth is not as pungent as the broth you might get at the pho shop next to LeiLei's, but is savory and allows you to taste the basil and bean sprouts and lime you put in!  I give it 4 stars because of atmosphere, the very accommodating nature of the restaurant owner, and the general cuisine.  I don't give it 5 because of the essential nature of the pho itself.  To me, pho is the perfect hangover food.  The pho at Cyclo is light and perfect for dinner, but not for the morning after a rough night!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eZHPHgULkVusEO1KS3eMDw"
  },
  "2_T_2UH1nh6Oh7p3aRlagg": {
    "date": "3/7/2007",
    "text": "Great place.  Worth the drive if you live far away, plus the owner is sweet and funny- she'll remember you after just a couple of visits. But be prepared, because she likes to give you a hard time!  You can bring your own wine here, which is great.  The food is reasonably priced and excellent.  I love, love, love the garlic green beans.  They're so good, spicy and flavorful- get them for sure!  I also like the tofu and veggies, pad thai and the seafood noodle soup.   It's not your everyday restaurant, and that's what I like about it.  The flavors are unexpected, making the food a treat for anyone unaccustomed to it.  And it's a charming place to go on a date or spend some time with friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HM2jdgRmxXxg7oL619ufzQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HM2jdgRmxXxg7oL619ufzQ/o.jpg"
      }
    ],
    "user_id": "sYQyXDjGaJj7wfaqz5u8KQ"
  },
  "tF4nIS31obhEQSiSzikt-g": {
    "date": "2/24/2006",
    "text": "Have been to Cyclo twice. Both times the food was very good.  Ate both times in the late afternoon. Good service...an unanimated, but effiicient staff.   Start with the pork and shrimp spring rolls, move on to the crisp lemongrass chicken or pad thai, end it with one of their unique desserts...and you have a meal that is sure to satisfy!   Beware the plum soda! LOL That's all I have to say about that...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Arih-n8Ta5QFH8kcR4dqg"
  },
  "UCObTXnIND4l1noIQJG3XQ": {
    "date": "11/19/2009",
    "text": "The food is great, but it's a little more expensive than all the other Pho places around Chandler (and there are a lot!).    However, the green beans are absolutely amazing, a must have.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tgyMunSEYZLDM216Ga9zlg"
  },
  "fN_3G8wShpAF2h9Bzmg-_A": {
    "date": "10/20/2007",
    "text": "I was there on opening night. Simply the classiest Vietnamese restaurant I've been in outside of the Bay Area. Definitely worth checking out! A little pricier than the hole-in-the-wall places around town, but you get what you pay for. If ambiance is important to you, it'll be worth the few dollars more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P3usQcIegPCl-cdH4IDirg"
  },
  "A-mcpZ4xp4WaQq5j3NcsKw": {
    "date": "8/3/2011",
    "text": "The best food served up by the BEST owner.  This place is family owned and run.  Half the fun is meeting Justina and enjoying her style and sense of humor.  Order ANYTHING and you will enjoy it.  If you love Pho, then this is the ONLY place in AZ where you can get a bowl that lives up to the name.  In a state that has very few truly GREAT food options, this is one of the FEW that is truly great.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nlm1s_FQPVTrY06vcsfuXw"
  },
  "9MJqGxVOp3pd5CqjGWI3Wg": {
    "date": "9/7/2006",
    "text": "Absolutely beautiful decor.  Tasteful, interesting, makes you feel as though you've escaped the desert.  Spring rolls were tasty, salad was intense but delicious in its way.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gbgO-yfMpOtqJu2U1mFMsA"
  },
  "nzy_iGlzvqY8Lpzq0f0HeQ": {
    "date": "9/10/2007",
    "text": "Love Justina...!  She's got a great attitude to accommodate any type of customer.    Small joint but some of the freshest and tastiest Vietnamese around.  The lemongrass chicken, green beans, and any of the pho (Vietnamese soups) are Awesome!    Try the Vietnamese coffee for a treat.  UPDATE:  Cyclo is closed on Sundays and Mondays  Watch out for the busy lunch crowd... To get a seat I try to get there as close to 11am as possible.  This is one of my favorite valley restaurants.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f991rPfTOVBDzGnhifsNwA"
  },
  "QJtTJfolF_stLCiKcy2ByQ": {
    "date": "4/15/2007",
    "text": "I went here because of a lot of reviews said it was good.  Well, it's okay.  Nice for a fun date night or if that's all that was available to you.  I had the spring rolls... those were okay.  I had their pho.  It was okay.  The thai tea was nice.  The wait staff was friendly... not the fastest, but having been around many many many Asian restaurants and their workers, I'm not going to care about the service as much as I do the food.  I felt the prices were a little high for what you get, too.  Do yourself a favor... have the pho or the barbecue at Yen Mi... and if you want really really really good pho and spring rolls... help yourself to a little hole in the wall on 19th Ave. called Da Vang.  HANDS DOWN the best pho on the planet.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ziqFJ5NsPW3EqINiS2IpBg"
  },
  "X5Hk300tyHBBE3TOLfHb_A": {
    "date": "2/8/2018",
    "text": "Finally tried this Cafe. Clean and fresh appearance. Very attentive service from young man. Started with the short ribs app, they were delicious, in a perfect tamarind glaze. Spring rolls were perhaps the best I've ever had. My Saigon bowl was very tasty, fresh and clean. Marinated pork tender and flavorful. Had the mango and sticky rice dessert, hate to say I have had better. Mango was perfect, but rather small portion. Sticky rice good, but made with a purple rice, different texture than the usual white. Overall very good meal. A bit pricey for smaller portions than used to. Owner came over to chat. Verrry interesting!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RO4Pfma9IUPG9SEPoW3VxA"
  },
  "YamNTORaUL9S0McphlFbnQ": {
    "date": "1/5/2019",
    "text": "This a wonderful place to enjoy quality pho! The owner is wonderful and friendly and treats every customer as family. I can't wait to come back the best pho in the valley pho sho!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Q0eNxp2lDoIyroBncUkJNw"
  },
  "ImUOQ1c5hi9olav6W41X2A": {
    "date": "12/14/2018",
    "text": "This is a great little spot. The atmosphere is beautiful and bright with fresh flowers on the tables. The water has cool fruit in it which is nice touch. We had the the black pepper shrimp, egg rolls, beef short ribs, lemongrass chicken and sea food pho. The shrimp is so delicate and full of flavor. I wanted to kill the plate right there but I was sharing and had to be considerate of my mom and grandma and make sure they got some too. The egg rolls were delicious and my mom and grandma devoured them. The lemongrass chicken had this amazing crunchy texture and was full of so much fresh flavors. And the pho came in a huge bowl and we all shared it. The only thing I wasn't crazy about was the beef short ribs. Not because it lacked flavor cause that was definitely not the case, but because there were too many bones and I had to work too hard to eat it. Now, one thing made our trip extra nice, our server and host is absolutely hilarious and she likes to stop and chat. We fell in love with her and all her sassafras from her personality to her bejeweled denim jacket.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rvp9Ma02CZzRLIF7ZSWWag"
  },
  "xKta7NvdJObZ7PbXchaCbg": {
    "date": "10/25/2017",
    "text": "My friend introduced me to the owner, Justina. What a funny women! She welcomed us into her restaurant with open arms and delicious food. My close friend is Asian and a lover of fancy things, she had been bragging about this place for months. Cyclo completely lived up to its hype. The environment is modern with accent lighting and fresh flowers in water on every table. The water is diffused with exotic fruit. We ate spring rolls, green papaya salad, pho, a crepe dish called Bang XEO and mango sticky rice. We drank the home brewed passion fruit Kambucha. Exquisite. Everything was delicious, crisp, fresh, and hit the spot! You can tell that every detail is carefully planned and well executed. The integrity and careful preparation of the food is what sticks out the most. Thank you Justina such an extraordinary culinary experience! This was the best Vietnamese food I have ever had",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "SfBw5NaG9CvfckDGCATlDg",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SfBw5NaG9CvfckDGCATlDg/o.jpg"
      },
      {
        "img_id": "aUPHk7T8oPkdzDeVNEU7uA",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aUPHk7T8oPkdzDeVNEU7uA/o.jpg"
      },
      {
        "img_id": "-ZiQnbSwkKBsVI9IHpsrOg",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-ZiQnbSwkKBsVI9IHpsrOg/o.jpg"
      }
    ],
    "user_id": "rk3BQzx_xv6mr538ez03aQ"
  },
  "2ShutHB_ND14UBjEs_hwHQ": {
    "date": "11/10/2018",
    "text": "Still love coming here. We have been loyal customers since they opened and now bring our kids. No matter how long it has been, she greets us and our kids by name. They put fresh fruit and herbs in the water so you don't think you're in Chandler ;) Cyclo is the best! You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UK1Wgb1Pu3hxlqohVRA4mQ"
  },
  "qYXu8hOwd9fvBBjYOgeOBg": {
    "date": "4/12/2018",
    "text": "Most bizarre dinner I've ever had! Im ok with people using the F word, but it's so awkward and ridiculous to hear it 175 times by the owner when you're just trying to have a nice, quiet, uneventful dinner. Food was good but that lady is crazyyyyyy! Would go back for take out only.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AAbUJQ6TIhRnlJOfpy_emA"
  },
  "T996OX50BDF_o5YxD7TV4Q": {
    "date": "5/4/2018",
    "text": "I have been going to Cyclo for years as a neighborhood standard. My family has celebrated many birthdays and graduations at Cyclo over the years.  The owner, Justina, is a clever, funny and foul-mouthed treasure.  Customer service is excellent and feels quite personal.  The pho options are fantastic, but I have a soft spot for beef chow fun and spring rolls.The fruited water is spectacular and is so refreshing in the AZ heat!  I also love that we can bring our own bottle of wine (a huge money saver).  Be prepared for irreverence, hilarious observations, and a few  f-bombs thrown into your dining experience.  No other place like it!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8rumpemNopaF8Zs7my1wyw"
  },
  "4LhW6TlEtR2viVeWRHA-Xw": {
    "date": "7/16/2018",
    "text": "First time visitor and was pleasantly pleased. Nice decor, very good service and exceptionally clean. The food was served quickly. Black peppered shrimp appetizer was good, wish the shrimp were a little larger but very tastey. Seafood noodle soup was very good. Great flavor and quite filling. Prices were very good. The owner Justina is a real fire cracker. Great personality and most certainly makes you feel welcome  I'll definitely go back and look forward to my next visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ib2GzqvErbXM2mEkV828cA"
  },
  "NTr_t8uc-ItE-HZjGQtYLQ": {
    "date": "3/31/2018",
    "text": "So I do want to start out by saying the food is amazing I would recommend anything on the menu.   BYOB- what more can you ask for besides being able to bring in your own booze! I eat out a lot so it can get very pricey when you order drinks with dinner.   The owner Justine- she is Awesome but PLEASE be prepared for cussing and playful hazing, do not come if you don't have a sense of humor!!! But honestly she is very sweet woman, for example she hugs everyone on the way out.   Overall this place rocks and it's a foodie paradise!   TIP-I would recommend tipping a few extra bucks if you bring your own booze because they store it for you and bring it out for you and will open it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CierB8EF7IWTSfyCUiJHiA"
  },
  "UBX7-U6zAnvm_WQuUH4PgQ": {
    "date": "4/13/2018",
    "text": "Nice option for Vietnamese food and a quick lunch.   Service is prompt and the dishes come quick. I like the fact that there are plenty of small plates to choose from if you're looking for something on the lighter side.   I've been stopping in off and on for years and it has always been worth my time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S0gfs96eYD664Ov5aFW3Ng"
  },
  "Q8E372YqDFIwn-CIcOFNjA": {
    "date": "3/9/2018",
    "text": "Mean Justina cooked us the most delicious vegan pho you could ask for. They kick up the spice in the broth which is tastefully noticeable and hit you with some purple and orange cauliflower amidst the veggies. Love the owner, love the food, love the setting. Looking forward to being a regular again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2k7p9F-07ldNFsz2f_FJkw",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2k7p9F-07ldNFsz2f_FJkw/o.jpg"
      }
    ],
    "user_id": "O1kegXpC2nRTQ8efvGhkIA"
  },
  "hYAzBLKE_J2GqzDTG6jOzQ": {
    "date": "12/7/2018",
    "text": "Tonight was our first visit to Cyclo, and we were wowed to say the least. I have never felt more welcome at a restaurant. The woman who sat and served us was so sweet. She interacted with our kids. She made jokes. The gentleman who served us as well was equally as funny and accommodating. On top of the outstanding service, the food was delicious! Great service...check! Excellent food...check! Cute atmosphere...check! It was a great experience. Reasonable prices...check! We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8G-reCBt59DXRRbJ3Ov5LA"
  },
  "bbGF2nQdVPT7NHs3fd04mA": {
    "date": "3/9/2019",
    "text": "Best pho in Arizona by a mile! Friendly staff. Decor is stylish and interesting. Refreshing and original fruit water. Fast service. Very reasonable prices. Felt so happy after-- this is definitely \"well being\" food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RjMWFN_Eg44khnRyKgJj3w"
  },
  "2w1eYTEwfc5_x7db8omk4g": {
    "date": "3/22/2017",
    "text": "Very interesting Vietnamese restaurant name.   Anyways, I ordered a papaya salad and a rare steak pho. Both were  mediocre at best. I feel like they lack the authentic flavors in both dishes.   Service was good though!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "kK-NklR8rOBsdBXL4oJLZg"
  },
  "_jaEURtujotlE7CsSRN2aA": {
    "date": "3/3/2018",
    "text": "Love this place!! The owner is hilarious and will come around and talk to everyone. The service is quick and food is good. You can even bring your own wine and they will cork it for you for free. Whatever you don't drink they will re-cork for you. The pad Thai delicious",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G7ppJ0NKJyW_jjy1nU9ZHg"
  },
  "4rz35aOtb7oWgIeYeY-mDw": {
    "date": "9/18/2018",
    "text": "One of our favorite restaurants ever. Definitely best Vietnamese in Phoenix! We love the fresh ingredients and the friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NpBjm4xbNMBlbA0V3XhZdA"
  },
  "fz_BvqBsnG6defP1_m_dxw": {
    "date": "9/5/2018",
    "text": "This has to be one of my favorite places to go while my husband is in Chandler Regional Hospital! Went with my mother-in-law a few weeks ago and really enjoyed our time here. The pho was so, so good and the owner was hilarious! I definitely recommend this place if you're looking for some good food and even better company!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "po7EbmIUIiB7-Mg3T_meGg"
  },
  "v5vlTRjsIZIPD48abRfCCQ": {
    "date": "4/5/2016",
    "text": "Ordered the Pho Thai soup. Mint leaves,  bean sprouts,  lemons and chili pepper   Water with lime, orange, Mint Leaves, red pomegranate was actually pretty good. I generally don't like lemon in my water, but this really worked and was good.  The Pho Thai has good tasting soup base along with the option of adding an assortment of items to enhance the Pho.  This a long way from our house but if we are in the area will be glad to go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Nb1kLRhyAswQl2TsBB5-Ww",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Smart soup spoon that is curved at the end so it does not slide into bowl",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Nb1kLRhyAswQl2TsBB5-Ww/o.jpg"
      },
      {
        "img_id": "-xst-VHcffJ5AWIARIjJkg",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Pho Thai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-xst-VHcffJ5AWIARIjJkg/o.jpg"
      },
      {
        "img_id": "FEMZOAe0JI46EcTkYGv6Mg",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Mint leaves, bean sprouts, lemons and chili pepper",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FEMZOAe0JI46EcTkYGv6Mg/o.jpg"
      }
    ],
    "user_id": "SRK_sUnvRmMwfexoL_DLQA"
  },
  "92p2P9PCBAmy4nDlIsey4w": {
    "date": "12/30/2017",
    "text": "Looking for  chicken Pho, first placed that popped up when I searched. Pho was missing fresh jalapeno for my liking.  Spring rolls were delicious. The only thing I did not enjoy was the short ribs as they were bone in and fatty.  The customer service was great",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TJ0N80vnXS5SaI5lbvQpcA"
  },
  "0wEsUZCq1JL5aysorKwOsw": {
    "date": "9/25/2017",
    "text": "Delicious. I go about 3 times a week for lunch. The Xl rare beef Pho is my go to. The spring rolls are fresh and delicious every time. The owner is very entertaining and polite. I just love her potty mouth lol.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mbjnCXsx11qRE2lcoMfZSQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. XL Rare Beef Phò. Nom Nom Nom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mbjnCXsx11qRE2lcoMfZSQ/o.jpg"
      }
    ],
    "user_id": "jYfwoGKHf_zYLR68KdCPOw"
  },
  "Bekad5AMt7k9eMRM_X4PSA": {
    "date": "4/19/2013",
    "text": "Great ambiance, simple yet elegant menu, and consistent service and food. I visit Cyclo every other week and it's always a pleasant experience. Plus, to converse with the owner, Justina, is a delight. Witty, fashion and fabuchic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ryuVKD8JbtpULMcTu-yjlg"
  },
  "l2819ZmXzaoBcGCbC0P9pQ": {
    "date": "8/17/2013",
    "text": "I've been a customer here for a few years now and love the food!  We usually get the pho noodle soup, banh xiao, and sometimes the spicy beef salad....all to die for!  I wanted to mention how sweet the owner is.  A friend of mine met me for lunch there with my very picky son. I was ordering a plain bowl of rice for him...and she intervened, lol...she told him she would make him something special that he would like.  He told her he liked chicken, so she went into the back and made or had someone make him a version of the lemongrass chicken cut into small bites without too much spice or seasoning...on top of rice.  My jaw dropped to the floor when he enthusiastically ate almost every bite.  She didn't want him to be hungry at her restaurant.  I just thought that was above and beyond....loyal customer for life!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mgVjPGgnFAurYgp5gdQkDQ"
  },
  "KYTIOTQSaSnOE8ZYW3X2vQ": {
    "date": "5/28/2008",
    "text": "The food at Cyclo is entirely over-shadowed by its outrageous owner, Justina Duong.  If Justina was a gay man, she would make a great drag queen.  I think she's a hoot, but her outlandish behavior and brash comments do not work for everyone.    I have a very dear friend who lives in Chandler and she and I would go into Cyclo quite often.  My friend is married with three kids, but just she and I would go in.  She would always tell Justina about her family and show her pictures of the kids.  Justina really gets into teasing the customers and after a couple of years, she told my friend, \"You crazy fag-hag.  You never bring your family in here.  You just come in with your gay friend.  You don't even have a family.  Crazy Lady, you just carry around those pictures to make your lonely self feel better.\"  Justina also plays up the Vietnamese accent.  She can be off-putting at first if you don't know what's up, but the floor show never disappoints if you're willing to play along.  The food is good enough now, but it was better when the restaurant first opened.  The star dishes include Tom Rang Hat Tieu, an appetizer of shrimp on toasted baguette slices with a savory black pepper sauce that is plate lickin' good.  Another delicious starter is Banh Xeo.  It's a crispy rice crepe with shrimp, pork, sprouts, and lettuce leaves for wrapping the crepe slices before you eat them.  For entrees, Ca Ri Ga is a tasty chicken and pineapple curry and Com Tam is a mixed grill of a marinated pork chop, beef, shrimp, and egg over broken rice.  As a side dish, the Dau Xanh Xao Toi is a sublime preparation of spicy garlic green beans with chili and sweet soy.    However, the quality now varies.  The last time I went the pineapple curry was totally bland.  Even though I have eaten at this place many times, I didn't say anything because I didn't want to be bothered with Justina's reaction.  Instead, I haven't been back.    I have been into Cyclo when Justina was not there and the quality of the food was nowhere near the same in her absence.  My concern is that Justina has announced plans (yet again) to open a second Cyclo in the Valley.  This time it's supposed to be on Central Avenue south of Camelback and across from Brophy with a fall 2008 opening.  Once that place opens, I assume Justina will move her floor show to central Phoenix and I am left to wonder if the quality of the food will continue to slip in Chandler.  Cyclo has a BYOB policy and some people are really into it.  For me, it's not a huge selling point.  I prefer not to schlep my own booze to a restaurant, but it's cool if you're into it.  If you go to Cyclo, hope that Justina is there.  You're really going to Cyclo for Justina's antics rather than the food.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 9,
      "cool": 4
    },
    "photos": [],
    "user_id": "TSxpgqzG0u38CGyyLfSAAg"
  },
  "CeNsSR8q1_w3RHXuzT3ZOQ": {
    "date": "3/23/2008",
    "text": "Cyclo is over-hyped in my opinion. Two major set-backs for me is the rude and curt owner-hostess, Justina Duong. She is just plain obnoxious and fails in her attempt to be humorous and charming. She actually believes that she is a culinary standard bearer in the Valley.  The other is based on several breeches of hygienic standards. I have seen stuff that made me cringe. I love pho and Vietnamese food beaucoup, but I won't return on foot, taxi, car or pedal car.  Call me a Dinky Dau Long Nose, but I just don't get the appeal.",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "18xG4GrYdoC9phCK-oIJKg"
  },
  "jCuqZ-K96UFBvIxPHcva5Q": {
    "date": "8/6/2010",
    "text": "Yes, I'm giving them 5 stars. I know their prices are a little higher and people complain that it's more fusion than anything. I want to tell you why I love this place.   Before Cyclo opened I used to go to the pho restaurant on Apache. I would get my customized fried rice-- chicken, shrimp, beef, eggs, and vegetables. They put a charred grilled pork right on top and I was in heaven.   Justine worked at the Apache restaurant. What a character. I love her attitude mixed with charm. She has a good humor and fresh outlook on life. I always looked forward to her crazy stories. More importantly she gave great advice on how to deal with boys. Cyclo became my comfort food therapy sessions. And that is why Cyclo gets five stars.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZT_A5e-ydZhcPB0nnDHKwA"
  },
  "g_b0H8M5BqYrfVXQz_OWyg": {
    "date": "10/22/2012",
    "text": "The pho was good and a generous portion, but compared to most Vietnamese places... way over priced. The owner is very nice and entertaining :) The spring rolls were decent, but smaller than most places for the price. It still beats anything in the west valley.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ANQiGT0d0RWMJG1LCvNWA"
  },
  "D0DewdIaeEkJCZsJUdu7Sw": {
    "date": "1/20/2013",
    "text": "I only truly crave a couple of dishes and the Saigon Noodles at Cyclo is one them.  Every now and then I need to go in and get my \"fix\", LOVE IT!  The restaurant is clean, the owner oversees the place daily and the service is fast & attentive.  Give it a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Axv3bj3xDphmu-2sc9mEqA"
  },
  "xrRwBMIVZhPdLJSV9Ug3AQ": {
    "date": "3/27/2010",
    "text": "Not sure why it's taken me so long to review Cyclo. I've been going for a very long time guess I was too busy eating to yelp.   Cyclo has some serious personality. Oh wait that's Justina! :) Cyclo does have a lot of personality to it with it's stylish decor and Justina just adds more to it. I really like the fact she comes and visits all the tables. Heck she's even sat down with us before. Love it when the owner likes to make nice with their patrons.  P.S - don't forget to bring your vino!  Onto the food...it's always fresh and flavorful. I've never had a bad experience here. The Pho is great, lemon grass chicken vermicelli is awesome and the green beans and pancake...Mmmmm!   This is the type of place I like bringing out of town guest to. You always know service is going to be good and there's no gambling with the food. I'm a fan Cyclo!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yoT5mQ0EeB40AAMi4ZIyTw"
  },
  "STlSIApRDY_o51Hh1jG8SQ": {
    "date": "10/28/2012",
    "text": "We really like this place.  I love the owner.  She is fun, smart, sassy and cute.  Always attentive to your needs.  I have been for lunch and dinner.  There are things I LOVE here- the green beans are SOOO good.  I could drink the sauce!  The Pho is amazing and I always love the vermicelli at any Vietnamese place.   I will continue to come and eat here.  It is probably the best Vietnamese food in the east valley with a good ambiance.  Bring your own wine if you want a glass with dinner.  Bring your Visa they don't except American Express.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FGkq_yMe53te4_o2f6JVpg"
  },
  "TzJc6EPULlInOPdbrleiOg": {
    "date": "6/20/2015",
    "text": "Once again, a wonderful dining experience. We've enjoyed many incredible meals and tonight's was no exception. The owner, Justina, adds so much to me experience- like dining with a good friend. The garlic green beans are exceptional. Beef Chow Fun, egg rolls, papaya salad, all were great. Never disappointed. Plus bringing our own adult beverages make this a great value. Loved it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VpCBPAksNYE81vWZsaWSng"
  },
  "nozJwkl9ptKAcAYlLYm5Xg": {
    "date": "1/17/2008",
    "text": "I have been wanting to try Cyclo for quite some time, and was definitely satisfied. However, the extreme hype surrounding this restaurant along with the numerous Valley awards it has received, probably led me to give it less than 5 stars since I didn't feel my dinner was worth endless raving.  The atmosphere is super cute and intimate, and service was very personable. If wanting to take a date to a Vietnamese spot, this would definitely be better than your rundown hole-in-the-wall, although much more pricier.  We started off with the spring rolls, egg rolls, and Thai Iced Tea. I hear their \"Made to Order Lemonade\" is also superb. My friend and I went with traditional Pho, while another got the Mi Xao Don (Pan Fried Egg Noodle) which was good, but would suggest the Pho because of its tasty broth.  My only negative remark is that it didn't have boba drinks or Vietnamese sandwiches like many smaller finds (Pho Avina in Glendale continues to be one of the best I've found in the Valley!), yet I would still recommend a visit.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "Qq3W0mxAGDccomdiMRqJIA"
  },
  "jpHTwAfW0BP8nMeSggh76w": {
    "date": "6/8/2008",
    "text": "I was NOT impressed.  The only two positives were the no corkage fee for BYOB and the made to order lemonade.  The food was bland and boring at best.  My friend had to send back her pan fried noodles that tastes like sawdust.  I would not go back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "bhJ6ivAuSpgXP4JiKWjSZQ"
  },
  "1O1JgvScQzCLG90c470Cuw": {
    "date": "12/30/2014",
    "text": "Great food, terrific service.  The owner is super funny and very thoughtful.  Go here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qudHscj6jICj3gJ5wrb3ww"
  },
  "bMw3vNhsEY75s0XBXBJn4g": {
    "date": "1/22/2007",
    "text": "You gotta love Justina, the owner...I just don't know why she keeps chopping her hair off. But she is like a walking fashion show.   Anyway, we have been going to Cyclo since its early days. Coming from the Bay Area, we were a bit disappointed that there were no decent Asian restaurants in the area, until we stumbled upon this restaurant. The flavors of the foods are amazing, really rich and sometimes a bit complex. Try the Hanoi and the shrimp appetizer...yum! And I truly enjoy the refreshing lemonade...a bit on the sweet side, but strangely refreshing! You have to go! Oh, and you can bring your own wine...just make sure it's a good bottle. Justina's going to make a note of it if you bring a cheap one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "PUfrbn2Ij-iyyOnM_EzQtg"
  },
  "RIy5KZhetkNTJXwOyQ1l6w": {
    "date": "12/23/2008",
    "text": "I went to Cyclo due to a review I found in a guide book.  It seems whenever I'm on the road, I'm in search for pho.  The decor on the inside is cute and modern,  not what you'd expect looking from the outside.  Reading from previous reviews, I guess I met Justina.  I love her originality and eccentric-ness.  But I didn't love the menu prices.  Sorry, but here in OC I can't imagine paying $9 for pho!  It was good, but the soup wasn't hot enough for me.  The beef was pretty darn tasty though.  And the Vietnamese coffee was just right.  It was nice that they served it in. . .actually, I don't know what it's called.  The coffee drips into a cup of condensed milk.  Then you mix it and pour it into a glass of ice.  Now I wish I had ordered a dessert.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7i4CKKRXCGkYIndz1UdeqA",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7i4CKKRXCGkYIndz1UdeqA/o.jpg"
      }
    ],
    "user_id": "WAMY2ApLprh-cE2aRgYMKA"
  },
  "FochP7jkPNVCwtHdABRS1g": {
    "date": "9/12/2012",
    "text": "I can't get enough of this place. The food is great, the hostess, Justina is a riot, and because it is BYOB I can have a nice dinner with the SO for a pretty effective price. My wife loves the crepe, and the beef carpaccio is super good. When I'm not feeling 100% - the Pho lights my phire.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UjPKcHvnYYN4WeIK9T1qxA"
  },
  "mXWGsCHGVyrai0Y53rKcrg": {
    "date": "2/8/2010",
    "text": "Visited Cyclo on Friday night with a party of 7 and mmmmmmmm......mmmmmmmmm....it was delish!! Justine was the perfect host and of course, love the fact that it is BYOB without a corkage fee!  We turned our evening over to sweet Justine and she did not disappoint! Everything was wonderful....spare ribs, spring rolls (love the grilled pork), green beans and the yummy egg crepe! Really good!  For our entrees, we shared a number of outstanding dishes! Plus the food just coming and coming! It was a great way to try so many different options! To top off our feast, we ended with amazing Vietnamese coffee (seriously wish she would open a coffee shop - it's that good!) and a Thai Ice Tea! Refreshing, fabulous and I seriously could have had 4 more!!  Because it is not the largest location, be prepared to wait, but it is definitely worth it! Can't wait to make the hike down to C-town again to get my pho on!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bze8ZkwBTNFGiTOv6ExaeA"
  },
  "DFpu6agM78ef13bEHkMLBw": {
    "date": "2/29/2008",
    "text": "I only got here once and meant to get back before I left town but just never made it.  I had the pho at the recommendation of my waitress and she was right--it was delicious!  I will definitely try to go again next time I am in town!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ibZIMJ55dvoqag4_JrQ4sw"
  },
  "0DAFR9mNb-otywk3CbbdOA": {
    "date": "1/11/2006",
    "text": "Great when lovely owner Justina is there, but when she's not -- beware.  Normally, food is explosively flavorful and service is warm and attentive. Went recently on an owner-free Saturday. Employees tried to close early, poured us the last of our BYO (about 25 minutes after we'd arrived and wolfed our food), then screamed at us to leave.   I don't know if this is biz-as-usual, but it's not worth another trip to find out.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mM2lXZF7srcZ1FaPx8L7uw"
  },
  "w0nesbODiWJd8AieQMrmWQ": {
    "date": "7/17/2007",
    "text": "I have to agree with everyone who commented on Justina.  She is hysterical.  The first time we where there she forced me to eat my meal with chopsticks.  She has a very dry sense of humor.  Our favorite item is actually an appetizer -- the pork spare ribs.  They fall off the bone.  The chow fun is also great.    The only drawbacks are the limited menu and lack of alcohol.  They do let you bring your own alcohol with no corkage.  The place has been full every time I've been there.  There are probably about 15 tables in total so get there early!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "kpSaMjMbMumIm0tKoMhkvg"
  },
  "vXULJHjZdHmefR1Qa4SFHQ": {
    "date": "8/6/2019",
    "text": "This place is so incredibly good. Hubby and I went the other day for lunch and even though this was not our first time, I realized that I hadn't reviewed them yet so here goes.  Ambiance - It is a small place that is clean and open and comfortable. Even though it is on the small side it does not feel cramped. It is tastefully decorated and not kitschy like some Vietnamese restaurants can be.  Service - Our server was very sweet. She was available to answer questions, but didn't hover. She recommended the baby coconuts to drink with our meal since it is hella hot AZ summertime. We heard her helping the table next to us that had all kinds of special requests (ugh).  Food - SO YUMMY! I cannot go here and not order the spring rolls with shrimp so we split an order of those and they were as good as I remembered them being. The peanut sauce that comes with them is not too sweet and they were just right.  He ordered the lemon chicken because he can't not order their lemon chicken and it is so so so good. If you haven't had it yet then try it. We love it. I ordered Pad Thai - I know, Thai food at a Vietnamese place, but I couldn't help it, I was feeling noodle-y. It was definitely their own personal take on it, but I really loved it.  And those baby coconuts that the server recommended? HOLY COW. They were absolutely mind blowingly amazing. So delicious!  We will definitely be back again and again and again and again......",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "qFUU86xrpl_4QzS_uf9W3A"
  },
  "teRF98bpxGzvxYpcHs46nQ": {
    "date": "9/20/2019",
    "text": "Out of most of menu items  Probable not going back very limited options  Food was decent The service was fast",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YwLzocegaULqyySMZxha_Q"
  },
  "MG9ykgcjiE6j55D0pglDlA": {
    "date": "5/15/2019",
    "text": "I am in Chandler for business travel and was craving Pho.  I found this place and wow!  The service was absolutely amazing.  They even customized my pho for me.  The shrimp pho was the best I've had.  The spicy green beans were also very good.   They were really friendly and fast.  This place is wonderful and I will be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "umFD9dZprQ2AFLVw-tPJrQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Love the vibe and service here!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/umFD9dZprQ2AFLVw-tPJrQ/o.jpg"
      }
    ],
    "user_id": "G_s93B-rofJwZjcObNLumA"
  },
  "VjZ-0Rd8mAXDMJRQRD-R_g": {
    "date": "12/5/2018",
    "text": "I read the good reviews on yelp and thought I'd stop by for lunch. We had the black pepper shrimp which came on crostini style bread (but not toasted) - flavor was good but I'm not sure the purpose of the bread. I had the green papaya salad which was pretty decent; not the best but not bad. My colleague ordered the pineapple curry and if I had to explain it, it seemed like they threw a packet of curry flavoring in with way too much rice and added way to much water - very bland. To make up for this we decided to order the lemongrass chicken and I can't say that really helped. It had better flavor but honestly tasted like it was made yesterday.   Did we order the wrong things? Maybe. But being from the Bay Area I've had some pretty awesome Vietnamese food and this just isn't up to standard. Sad day:(",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ICk-ViRS1Kz-m35_ipdU9Q",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. papaya salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ICk-ViRS1Kz-m35_ipdU9Q/o.jpg"
      },
      {
        "img_id": "VMjwVb85Q4mz6T14vuVk3g",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Black pepper shrimp",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VMjwVb85Q4mz6T14vuVk3g/o.jpg"
      }
    ],
    "user_id": "5JRsBTopf1lr4gbeLV0o9g"
  },
  "UnF17mxf-MD_IDzVLnDObg": {
    "date": "8/19/2018",
    "text": "This is a quaint yet quality place to get pho. There wasn't A vegetarian option on the menu for pho but we ended up asking and they made a beautiful soup with a vegetarian broth. I think there was more variety of vegetables in this soup then I've ever gotten in any restaurant in Arizona. The fresh spring rolls could've been filled with more herbs, but I will say upon request we got another plate of herbs for our soup. It was one of the best I've found. (Especially good for Vegans.)  The owner was very friendly. She came around and visited with everybody. She let us know that her boyfriend made all the decor which was quite modern. I'll most definitely return when I swing by here again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pPQ6CEkQHj8pi9vILg9OSA",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Inside decor.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pPQ6CEkQHj8pi9vILg9OSA/o.jpg"
      },
      {
        "img_id": "Jp06MMdm3-Ounublun9OaA",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Loaded veggie vegan pho.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Jp06MMdm3-Ounublun9OaA/o.jpg"
      },
      {
        "img_id": "XzNAe5fr4xVkDZkb0MWWag",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Beautiful fruit infused water.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XzNAe5fr4xVkDZkb0MWWag/o.jpg"
      }
    ],
    "user_id": "1viszljzsa8W7VnYPuWosw"
  },
  "rEUE6B02x3cdle9JghLnpg": {
    "date": "11/14/2018",
    "text": "Had to stop by chandler mall today to grab some stuff and my husband found this place. Since the weather has been chilly lately we decided to stop by and try some of their food.. we ordered egg rolls, mint chicken along with lemon grass chicken and small bowl beef pho which the waitress (owner?) said we were able to order bc she knew I was torn between pho and the chicken.. the pho was decent and both of chicken dishes were pretty good.. the only thing we are taking couple pts off is that it was little pricey then ur usual pho but other then that we will probably be back to try other things on their menu.. also the menu here is very limited to your other Vietnamese restaurants..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IhIZ7l0KzZsURgA8nTH9NA",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IhIZ7l0KzZsURgA8nTH9NA/o.jpg"
      },
      {
        "img_id": "al2PnskyYXVEhLUOuEbbfg",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/al2PnskyYXVEhLUOuEbbfg/o.jpg"
      },
      {
        "img_id": "qFOz2DoJqjFw-2Sy3uQ7Ow",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qFOz2DoJqjFw-2Sy3uQ7Ow/o.jpg"
      }
    ],
    "user_id": "c40DTzCb-fHY6vI03PNRLw"
  },
  "z5hOYLmKbAwvXvzWyC_rVQ": {
    "date": "3/8/2019",
    "text": "Been coming here for a couple years, and this place never lets me down.  The owner is super friendly and the place is always clean.  The spicy garlic green beans are amazing, a must.  I always get the pho and it's really good but I am excited to try some of the other dishes.    Also I sampled some of the Kombucha. I'm normally not much of a fan of Kombucha but I really enjoyed the Belgian waffle and the Hazelnut flavors.   I'll be back soon.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "OnrTeu_tDimP2dwqOktOxA"
  },
  "qChh4AHudKIGXzbYbVy97w": {
    "date": "9/25/2018",
    "text": "Cyclo has a really nice clean atmosphere with really good food.  It starts off at the front door with the nice lady (owner?) who is warm and welcoming.  If you ever talk to her, you will see that her personality is quite funny!   The menu is simple and straight forward with mostly traditional Vietnamese dishes including Pho.  I went for the beef pho and was not disappointed.  The portions are very large as well.  Also, no need to order drinks here as their regular water is infused with fruit.  You have to try it for yourself but that is probably the most memorable thing about this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qtY25ph4du0xQglIw_O5BA",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. The beef pho",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qtY25ph4du0xQglIw_O5BA/o.jpg"
      },
      {
        "img_id": "EA7fasJlMkDxGjTBcphSvA",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Fruity water, a nice touch",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EA7fasJlMkDxGjTBcphSvA/o.jpg"
      }
    ],
    "user_id": "my_L-IvkYQnEjBLioibdgg"
  },
  "8LuxOqZQCXp8xv2dBlGHCQ": {
    "date": "2/22/2019",
    "text": "Nothing better then a classic pho on a cold, snowy day. Yes it snowing right now in Phoenix! Very nice service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8amsovWscyE8LptIMEMFRA",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Pho",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8amsovWscyE8LptIMEMFRA/o.jpg"
      }
    ],
    "user_id": "3lXaRHqIAzxJp4BbQKqzQQ"
  },
  "m1ln2qIUSCJyXDI72N28mg": {
    "date": "4/27/2019",
    "text": "This is my favorite place to get Vietnamese food in town. We got the Pho Ap Chao and Com Tam, with sticky rice and mango for dessert. Food tastes fresh and super authentic, and the presentation is beautiful. The service is fast and friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gs47NJ4A0HgTLBpPI02gHg"
  },
  "kWHsUtLwIyqwC0CicwfXpQ": {
    "date": "1/2/2019",
    "text": "So I'm waiting for my tire to get fixed, an hour and a half and it's dinner time. I walk over to Cyclo to check it out. It's cold and a nice bowl of Pho is in order. The lady at the front makes me feel like a regular, she is friendly and welcoming. The water they bring me has apple orange and pomegranate. I order the pho ga--the bowl is bigger than my head. It it delicious! Tucked away, but a delightful experience!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S1Wf3ojS0KlRKedoVewlXw",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S1Wf3ojS0KlRKedoVewlXw/o.jpg"
      }
    ],
    "user_id": "Ea2d6kAiZtYLyI2_p04kzg"
  },
  "wocJLVa8SmE4sl4AHP0Qkg": {
    "date": "11/22/2018",
    "text": "This is a place I will be returning to again and again. The casual atmosphere and BYOB system makes it a great place to sit and chat for dinner.  I ordered pho and banh xeo, and everything tasted exactly like I thought it would; memories of dinners at home in California came flooding back to me.  The water comes with cutely sliced fruit inside, service is attentive and friendly, and the furniture is modern and great to look at. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRStYzaxq7De2v-XI8RheA"
  },
  "1Izq_Gr6BKwJwsGAq5Gm_Q": {
    "date": "3/16/2019",
    "text": "Awesome food, great decor and the proprietor is wonderful! Had the crab and shrimp soup, delicious! Don't forget to try the crafted kombucha!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "8E3nz5KKV0dcHQx9mUGVvQ"
  },
  "J_gd1_go7A0UW5eHXijY9g": {
    "date": "10/14/2018",
    "text": "Delicious food, fresh in-house kombuchas... SO good they are a MUST TRY!   AND the BEST water experience EVER.  Clean your palette and your chakras with this enlightened menu and experience!  You must meet the owner!! Out of this world cool and genuinely amazing woman!  An awesome experience for a romantic, modern evening!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ed_OLjHCURVDM84VMAGfuQ"
  },
  "KbCFdUoKOpcdq-zSajw9Ow": {
    "date": "2/26/2019",
    "text": "This place came highly recommended to us by friends so we had to cheack it out now we go here every week. The owner now knows our order by heart. Pho and egg rolls are to die for I once got a take out of 12 eggs rolls for dinner  The owner is really nice she thought me how to use chopsticks now I'm a pro. Even the water is great infused with cute little fruit pieces. Highly reccomend the pho in the event of a hangover or a cold/flu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ygTZvxzi9_kDx1lRQetn7g"
  },
  "NdNSMO9E5k5P5exdQoFOZw": {
    "date": "11/2/2018",
    "text": "Decor: great Staff: owner/hostess Vibe: exceptional  BYOB: a plus if you are on a wine budget Pho: THE WORST.  I had packaged  pho ( similar to ramen) that tasted better.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uWTebPGmOfgHCVHPM16lRg"
  },
  "bC4ZPrWUmxHxLqCNZAUglQ": {
    "date": "2/14/2019",
    "text": "Awesome.. food was great, service was great, prices very fare and teasing from owner Justine was free if she likes you..you can bring your own drinks too!! We'll be going back often",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pTloENRZXqOcSshDbr8WaQ"
  },
  "P2xc7WIbNGZlBmZafrogYw": {
    "date": "5/4/2019",
    "text": "This has been our favorite Chandler/Tempe restaurant for decades. The food is terrific (even the water is special, with fruit mixing with the ice in the pitcher), and the prices are low; you can have a feast for so little. I also like their BYOB policy, because we can bring a bottle of wine with no corkage fee, so we end up having paid (for a bottle of wine) about the same as a glass of wine would cost at other restaurants. Some of our favorite dishes (for 2 people):  we start by sharing an order of spicy green beans and fresh summer spring rolls, then each of us order one of the great main dishes, and then we end by sharing a mango rice dessert.  News flash: the outgoing former owner recently sold Cyclo. We know the new owners (they are so nice) from their shop in Tempe, Lee's Tailoring. They have astutely kept the same great kitchen staff, menu, and recipes. They even had the amazing home-made kombucha on hand (we had the blood orange flavor). This place rocks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "JEPZDDaMtPBSIY_fgC66jQ"
  },
  "n6iIqTY-tpuMCVQFFC5ivA": {
    "date": "12/6/2017",
    "text": "Amazing service, atmosphere and food! They focus on all your senses. It's a complete dining experience with great music, lighting, and artwork. The vegan pho is incredible, with a rich broth and vegetables that you don't often see, like mushrooms. The water comes infused with a mix of fresh fruit. It's BYOB, which only adds ti the atmosphere and the personalized nature of their service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9K0IWTBUVO3-SY3i8KbOfg",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9K0IWTBUVO3-SY3i8KbOfg/o.jpg"
      }
    ],
    "user_id": "eDqH7Gr6Pqo7adfZwfQetg"
  },
  "M6DRZIV86HqrL0pk1IwCzg": {
    "date": "5/15/2019",
    "text": "Me and my wifey love this place!! There are so many thoughtful touches to the meal and experience from the artwork, the charming hostess, the fruit water, fresh flowers, bring your own bottle policy, and oh by the way, the food!! You can't find better crispy rice noodles in the valley!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "LsAAMyDABU7eNg94GPsgeQ"
  },
  "eTbCuyxNM6X_E_XMfVDnWw": {
    "date": "11/17/2010",
    "text": "Very Americanized restaurant! Service was fine, but I didn't feel comfortable enjoying food. The spring rolls came out as a big disappointment to me, it was even smaller than my 2 fingers! I didn't order the Pho, but I came up with Papaya salad which was also a waste: too sour (too much lime juice) and not even tasty!  I'd prefer more authentic Vietnamese restaurant with decent prices! This probably is a suitable place for Americans, but I'm sorry, not for me! I'd prefer Pho All Seasons or Pho Ao Sen - much better!  Well, gotta try it at least once anyway!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 12,
      "cool": 2
    },
    "photos": [],
    "user_id": "2MLTkPNp9ldB4YBOi5k4qA"
  },
  "OFcqsnvB2zls7gRTOiLimw": {
    "date": "9/12/2013",
    "text": "I would give this place two out of five stars. The service was so so and the prices were a little high for Pho. It was ok but don't plan on going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0HqQ9tytyZM6SO47wzrNqw"
  },
  "h8mMgscn2Ee29Kxuy4Fb7Q": {
    "date": "3/14/2014",
    "text": "Always a great time! Food is good and everyone is fun. If you don't want to have fun, you can try Panda Express and be boring.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q_DbxKr23LPXxsqmnYSGXQ"
  },
  "5nkMhwfQTKaTUE1FyOwg9w": {
    "date": "9/23/2010",
    "text": "Read al lthe hype, so decided to give Cyclo a try.  What a disappointment!  Portions were small and overpriced, owner thinks she's the next best thing to sliced bread.  She needs to go back to Vietnam to remember how real Vietnamese food is prepared.  Give this place a miss.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 9,
      "cool": 2
    },
    "photos": [],
    "user_id": "WD5LQPqOTuDrPKJ-apSKIA"
  },
  "Cb-1wxQ1ETkXNr0o20alpw": {
    "date": "8/27/2010",
    "text": "What the pho, man?!  The food is bland.  It tastes like they cater to the elderly.  The prices are high for the type of food you are getting.  Nobody should have to bay over $5.75 for ANY type of pho.    I've gone there 2x and I don't know if it's just me, but the hostess there just rubbed me the wrong way both times.  She was cracking jokes and making comments that were borderline inappropriate.    They focus more on decor and trying to \"entertain\" their patrons rather than focusing on what's really important... the food.  You want a really good, AUTHENTIC bowl of Pho?  Go to Saigon Pho on Alma School/Knox.  It's not as ritzy and refined, but the pho and other menu items there are less expensive, tastes better, and they serve you much larger portions.    Eat at Cyclo if you want to have a SEEMINGLY over-attentive hostess bothering you while you try to eat.  (I say \"seemingly\" because while you may think she's over-attentive, in reality, she hasn't even done as much as refill your water glass.)",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 14,
      "cool": 4
    },
    "photos": [],
    "user_id": "KK7e-aAKWbzDsMD9UGu1HQ"
  },
  "NzSvfi6qO_ZRoQSk5NZNYA": {
    "date": "12/8/2010",
    "text": "Why is this listed far away from its actual location. I can't seem to be able to check in here  Pros: Ambiance, Small Establishment (mom and popish... something I support)  Cons: Probably everything else.  This is my 5th time visiting this place and the only reason for it has been its proximity. The service has always been shoddy (subjective). I guess you have to be a regular or catch the owners eye to be given any sort of good service. As for me I got the \"don't care for you\" service ( even though only 4 tables were occupied during the lunch hour). I guess I must be becoming invisible.  Food: Saw the prices and was a bit surprised (asian upper class restaurant?? somewhat of an anomaly, easily double of what you get in other Vietnamese restaurants. Thought to myself the food better rock for these prices). Ordered the mint chicken, what I got was a well decorated but bland and not seasoned dish. I had to put in heaps of fish sauce and oyster sauce just to make it palatable.   What a waste of good earned cash and a bad aftertaste to boot. Hopefully in future this review will remind me never to visit this place again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "uRcZURC3ituvPT0en9l3xA"
  },
  "9NW-G-3F6gLFLB5_FTJnAQ": {
    "date": "1/16/2016",
    "text": "I like the atmosphere. And the server lady is great. But, I had the pho which was good, however loaded with msg - to the point I had a wicked msg hangover for hours afterward. Massive headache, sick stomach- like the worst hangover for a few hours post. I won't be eating here again because of this, unfortunately. If the food wasn't loaded with msg I'd eat here again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9w8UMMHuOmRPQcuUHSidA"
  },
  "5ADAkJT9M2Z8mMPZ1nG0cQ": {
    "date": "2/27/2011",
    "text": "I cannot believe it has taken me this long to write a review for Justina Duong's wonderful Cyclo Vietnames Cuisine.  We visited Cyclo for the first time on the first Friday after a very positive review by the Arizona Republic food critic Howard Seftel.  The small place was slammed.  Being a woman of action, I stepped in and helped by being the \"hostess\" and taking down names for a waiting list.  Guess that helped me become friends with the acerbic but deep down sweet woman that is Justina Duong.  You really can't go wrong with anything on the menu.  Spring rolls are compact but full of all sorts of meat and veggies.  Bun Hanoi and Bun Saigon are tasty treats full of fresh herbs and vegetables.  My husband loves this lemon chicken curry dish that to me smells like Lemon Pledge, but he gets it each time.   the beef pho is full of flavor and comes with a mound of salad, unlike some of the other \"cheaper\" pho shops nearby.    i can't imagine anyone has complaints with the food at Cyclo.  If they do, it is probably that their judgment is clouded as they came on a Friday and Saturday night at 7 p.m. to a 14 table establishment and expected to be served immediately and be fawned after.  If you are this needy, don't come here and take up a table...we're waiting patiently to be served. :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xh22UvQTvQOyuzL6Z7tXDg"
  },
  "UhU2EDUFylOrhE7hWRstng": {
    "date": "8/13/2012",
    "text": "Ate here twice and was just became more disappointed. The first time I ate here was probably 3 months ago, an old guy served us, he was okay, there were no people inside even it's lunch time. The food was ordinary, but pricey. Like 12 bucks a pho. I would've gone to Saigon Pho if I wanted cheaper, or to Unphogettable or Chandler Pho if I wanna pay extra but have decently flavored food. The atmosphere is modern. Clean. The second time I had To Go and this lady server (I'm assuming owner, hear me out why), was extremely loud and annoying, touching customers in unnecessary ways like patting the back while eating. She was dancing and really was all over the place (I'm thinking a bit drunk). Anyway, no, I will not come back anymore. I have no idea why people visit this place. It's either they don't know a much better Viet cuisine or they have no choice.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "h4Gv9ySB07PpKd_68IZ5Bg"
  },
  "QJAdiic2jD_IQFVmluz3-w": {
    "date": "7/13/2010",
    "text": "I don't know why it has taken me forever and a day to write a review about this place... but it was the first vietnamese resteraunt we went to in Arizona. Since we came from the bay area, this place had a big shoes to fill.  Pretty small place, the simple decorations are nice (or it was about 2 years ago). Selection of food isn't as big as some other Vietnamese places around here, but definitely higher-priced pho than most places. It's $9-$12 for a bowl of pho, a bit pricey much? I guess I'm more used to $7-8 for a bowl.   This was the first time I've ever been to a pho place and seen the owner dressed up like she's ready to walk down New York Fashion Week. I mean, she's nice and everything, but a little flashy for me. Not sure if I'd like my food to be prepared by someone wearing a mini skirt? I mean, assuming she's helping out in the kitchen and everything. But she does run the food back and forth. Almost makes me think that the high prices of the food are to support her fashion/makeup fetish. Eh.  I really can't complain about the food, but I do have a gripe with the pricing. Authentic Vietnamese food should be priced accordingly.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "gAmmEZLSdj5KXvOlPUQRfQ"
  },
  "47HNlClGAIRqv4IVy5qiNQ": {
    "date": "10/26/2013",
    "text": "Love this place. Food and service is top notch. Priced right and food that makes me come back over and over. Try the short ribs and green beans and you won't go wrong. Don't forget to bring your own wine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ccxWLOuIvW6QpOP2rLNGkQ"
  },
  "cJhpZ5tU99P3gznyxem00Q": {
    "date": "11/28/2016",
    "text": "The 3 rating is purely based on the food itself, which was okay. I don't think there was much of service available. We went on a slow night, so can't say the restaurant was brimming with people. They kept the door open, and that let insects inside. I even saw some flying insects disturbing us while eating. The lady at the counter was doing everything, taking order, taking payments, serving which was causing unnecessary delays. Coming to the food, lemongrass chicken was served dry to be eaten with rice without any fish sauce, haven't seen this in any other Vietnamese restaurant. The other guy who was serving did not understand English well, as when we asked for fish sauce from this guy, nothing came out. After dinner, we were made to wait for 10+ minutes for desert, and was asked if were in any hurry when we checked with the lady about when we are going to get the dessert. The communication of the restaurant staff with customers leaves a lot to be expected, so is the service. I think there are better Vietnamese and Asian fusion places in town.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wIGzHfuumrloylAJBjptXA"
  },
  "9KRks-OQo-P3oQBKIKkPPA": {
    "date": "3/19/2013",
    "text": "Love the Pho and Justine. I want her to be my stylist but apparently she's a bit busy. Fine I'll just have the Pho.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iylyMoq92gzB8RYMfO2NmQ"
  },
  "o6BBQozBjNuY-WOu-7M4PQ": {
    "date": "8/13/2010",
    "text": "This is my second favorite Restaurant in Phoenix (behind only Tarbell's) and receives consistently Phabulous reviews. I have had much on their menu and have loved almost ALL.   I have become a \"Pho Aficionado\" and I love the strong flavors in the best Phos. Cyclo's Pho leaves a lot to be desired! Broth is generally too thin, although the service is beautifully done. Plus their Pho is expensive when compared to other \"Pho Joints\" that I believe have better Pho.  Everything else I have eaten on their menu (and I have eaten most everything!) is indeed PHABULOUS, so I will just go elsewhere for my Pho Phix! Besides, I would miss NOT seeing Justina (Cyclo Owner) who is a delightful experience, not to mention the delightful experiences available on their menu, other than the Pho!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "oGQnKOBNrwERM-MLLfpyGA"
  },
  "pqADmTsKb5D6zFl219GZqA": {
    "date": "2/23/2010",
    "text": "The Pho Tai was terrible...the broth was oily & the meat was fatty.  Not just a little bit of fat, but globs of floppy nasty fat.  I have never had to pull the meat out of my pho.  This excess amount of fat was gross (and I'm not even usually picky about fat).  We've had a lot of pho, but never something this bad.  I really wanted to like this place.  The decor is cute...all Ikea furniture and cool art on the walls.  They played pop music.  Service was friendly and the place appears to be family owned.  Our egg rolls were good, but we only got 3 and most places usually serve 6.   The price was ridiculous!  We ordered our usual...2 bowls of pho thai (1 large & 1 small), 2 drinks, and an order of egg rolls.  Most places we've ever ate at charge between $20-$25.  For this nasty meal...we paid $34!    We won't be returning.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "6U7rvw5thhbrW-bdDslDZQ"
  },
  "-AlSvMxU66qDJOkLzN63PA": {
    "date": "6/24/2013",
    "text": "Awesome service. Try the beef chow fun and spicy garlic green beans, they are amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VCPZHr4QXK45WkBwo17wDQ"
  },
  "n1lof_XwBX5nbfoMzdehQA": {
    "date": "6/11/2013",
    "text": "Super yummy, cool ambiance. I had the Bun Sai Gon and it was SO GOOD. Can't wait to go back!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TW22PRPMNmDch-9h5qzobQ"
  },
  "oueIe27N9Z71DcXeTxO8Hg": {
    "date": "2/24/2013",
    "text": "Still of fan of both Justina and the food at Cyclo.  Crisp rice noodle cake is great, the the green beans and pho are excellent too.  Justina could not be nicer to my kids, and she is always ready to laugh.  For those with kids, the chicken noodle soup and green beans are both big hits.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dSM6ru_vxFj3FID2KxBxjA"
  },
  "04gARTDZQaipK4G2I50Zzg": {
    "date": "1/2/2010",
    "text": "Let's play chicken.  Lots of chicken on the Cyclo menu, which based upon my experience at other Vietnamese places apparently isn't very typical Vietnamese...and dang it I'm allergic to chicken so I notice and dislike heavily chicken-biased menus.  Of all the meat and rice dishes only one is not chicken.  We ordered the spring rolls with pork and shrimp - very nice, though I would have preferred fish sauce over peanut sauce.  Next was beef pho.  Also decent but nothing to make me drive all the way to Chandler (I was passing through today).  it was a good meal, and it looks like there are some other interesting items on the very small-ish menu, but I really don't understand all the fuss about this place.  What did Seftel see in it that I don't ?  Of course Seftel thinks Yelp is one of the worst ideas of the last decade so my faith in him is slowly being shaken....  Cyclo doesn't shake a stick at Da Vang or the long lost Pho Loc....",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "yMI4vNI5CWoJWmqjxJRD1A"
  },
  "yrzmL7DwXqR_ODtDnKqdQA": {
    "date": "8/28/2008",
    "text": "Damn all of you who rave about this place.  I live like 2 mintues from Cyclo and have been wanting to try it for a couple years now.  So my son and I went last night for a little date :o)  We came in and had to use the resetroom first... then were told that we could sit anywhere... so we did, well then we just sat there for like 5 minutes with no menu, no drink order, NOTHING... our waiter was sitting at the table next to us EATING... that's fucking awesome, you take your time, we're not here to dine or anything!  Finally he gives us a menu... takes another snack break with his gramma or whoever?  and some lady with a sour face, maybe his aunt?  finally takes our drink order.  I had the Thai Iced Tea, which wasn't that great... first of all it was ORANGE... never had it this color before and I've had a fair share (cept the one at Saigon Pho was orange too, vietnamese thing???).  I could've ignored the color if the taste was better... we didnt get straws, but then our waiter disappeared for a while and brought back straws from walgreens... without a wrapper on it... DO I REALLY WANT TO USE THE STRAW YOU JUST HAD YOUR DIRTY ASS HANDS ON??  So by this time, I'm thinking we should have just gone to Chino Bandido on the other side of the parking lot.  He finally comes back to take our order, we had the Chicken Wings for an appetizer and decided to share the Pad Thai.  Our wings arrived fairly quickly... they were actually tasty and pretty spicy.  The only thing I didn't really enjoy were the ton of seeds... just not a great mouth feel.  Now something happened that really bugs the crap outta me.  We JUST GOT our wings and had barely taken a couple bites when our entree arrived.  Dont they know about timing?  I dont want my entree yet, I know it might sound picky, but I would really like to enjoy my appetizer and not feel rushed because I dont want my entree to get cold.  Sorry... I know I'm ranting...  So we finished a wing and decided to start on the Pad Thai, which, even though we tried to hurry to it, was kinda cold now, and the noodles were all congealed together in a big lump-o-noodle. The flavor was good, I liked the shrimp in it too, but Dom and I agreed that the chunks of egg were \"weird\".  I prefer little shreds of egg and I also prefer it to be served on a plate rather than a bowl so that the \"gravy\" keeps the noodles mosty separated instead of in a noodle ball.  Oh, and this version was made with very thin noodles, I prefer the wide noodle for this dish.  Maybe I'm being picky, but that's my right as a patron I guess.  So we kinda picked some more at our food and then Dom had to use the restroom... so he did his thing, and I waited for the bill which took another little while to come even though there were only two other tables occupied.   Overall, I thought the food was ok, nothing spectacular at all though.  I guess I really had high expectations for Cyclo  - and that mixed with the poor service (just lacked any personality , friendliness, or attentiveness), I just felt let down.  I'll give it another chance in the hopes that the service is better, and perhaps the owner will be there to liven things up?",
    "rating": 2,
    "rated": {
      "funny": 12,
      "useful": 10,
      "cool": 6
    },
    "photos": [],
    "user_id": "IZRUOQSuJVSr2ZOiJjbfgA"
  },
  "CRIA1YLguotEMqZrLg3GZQ": {
    "date": "3/29/2015",
    "text": "Service, food, decor and again....food, all top notch.  My only complaint is I didnt know of it sooner.  I'll be back weekly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hDb2DtuAsAx0THuOAr8LlQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Yummm, sticky rice with mango",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hDb2DtuAsAx0THuOAr8LlQ/o.jpg"
      },
      {
        "img_id": "6bxaSnu-aA5kNgBnZAvz-Q",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6bxaSnu-aA5kNgBnZAvz-Q/o.jpg"
      },
      {
        "img_id": "_vuuEFxnTj4JNjyPOxGaXw",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Decor is cool and modern",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_vuuEFxnTj4JNjyPOxGaXw/o.jpg"
      }
    ],
    "user_id": "XOV0pGmWSrIxftLukY9FKA"
  },
  "THFNbaLN0qfI6PioEX27cg": {
    "date": "6/3/2016",
    "text": "This is the best restaurant, not just Vietnamese restaurant, but restaurant of any kind I've been to in a long time! I'm a bit of a restaurant snob from living in an area that is full of Valley treasures - Postino, the Vig, La Grande Orange, Chelsea's Kitchen, etc. we thoroughly enjoyed the pho, sticky rice with mango, and jasmine tea. The pho broth was delicious, the meat was very thinly sliced, too! The service was fast and the owner worked the room beautifully! People were at the tables leaning over and being friendly, telling us how much they love the place. The decor is so fun and artistic! Cute little cyclo riding skellies sit atop a mango red-orange wall and oil paintings adorn another. The owner was adorable with my boyfriend's three year old son - he was most welcome at Cyclo. We'll be back again and again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rlo6HjeaPgwJvEDvNG_PuQ"
  },
  "DlO4hjlv_Dt09wecQqgEWw": {
    "date": "10/30/2014",
    "text": "Absolutely amazing food! I recommend the papaya salad, garlic green beans, black pepper shrimp, beef chow fun and the lemongrass chicken. Your experience is bound to be unique if Justine, the owner is working. She is fabulous and memorable to say the least. The best part is it is byob so your check is reasonable. Why haven't you tried his place yet?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gOYgSEbE-Z7cqGsgGW3LBg"
  },
  "2N0MMhLlgbAyHtBK_hA_Qw": {
    "date": "3/1/2014",
    "text": "Food was good! Lemonade was excellent! And the owner is spunky and interactive! Can't go wrong with whatever you order!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cPbavRXnxNRDjO_rqaz4sg",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Mango and sticky rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cPbavRXnxNRDjO_rqaz4sg/o.jpg"
      },
      {
        "img_id": "SI7KHEgY2Hf672HWC0yodA",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Pho with sirloin and pineapple chicken curry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SI7KHEgY2Hf672HWC0yodA/o.jpg"
      },
      {
        "img_id": "YyipRpxwP5W4-ydUIn6t8w",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Crispy Crepe",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YyipRpxwP5W4-ydUIn6t8w/o.jpg"
      }
    ],
    "user_id": "ALEXM_KvFYWc-xhFFPsAvg"
  },
  "HukNwyx1ckz299c_xmJFBA": {
    "date": "6/22/2016",
    "text": "Everything about this place is right on when you walk through the door. The food is incredible. The variety and selection is great. Every dish makes you want to order another one just to experience the incredible flavors of the spices and herbs. The owner is awesome and so attentive and makes you want to keep coming back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ck3-SikwEb0U9G7RKh-O_w"
  },
  "QG2i0PlMNw_A5YB2aegpuw": {
    "date": "8/15/2017",
    "text": "Cyclo has been around a LONG time, we went today for the first time in a while, and I am kicking myself for waiting too long.  EXCELLENT food, GREAT, FUN service, we will be back later this week!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LrmjJW_I2nH1pGufKU8yIA"
  },
  "dUy90Qj2eufEE_VAuqC-Fg": {
    "date": "3/16/2016",
    "text": "The food is just ok.  I do like the fruit water.  There are better places in the area.  I will not return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VkUfz-QuNF9qeGXUhaNpTA"
  },
  "U4sWHCtOeZMyEQJH4_xqxw": {
    "date": "12/19/2014",
    "text": "Vegan, vegetarian and pescan friendly! By the gods it has amazing pho! The decor and music are hip and stylish. At night the low lighting with the festive lights is almost creepy. The people are friendly and most speak enough English to understand complex orders. My only complaint was that bean sprouts were not offered. The cilantro served was for one person not two. The limes and jalapeno were sufficient however. I always want more basil/mint but I'm just picky. Been to three pho places tonight. I'm glad one was friendly enough to serve all. A great restaurant. Although pricier than the rest. Worth every cent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "msEF8n5n0RvANKeGfxAtRA",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Cute decor",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/msEF8n5n0RvANKeGfxAtRA/o.jpg"
      }
    ],
    "user_id": "SJ2Vwjnn772f0bBJrLtTJA"
  },
  "09d59_cVsfEYziZg0fsiYA": {
    "date": "8/14/2013",
    "text": "I've been wanting to try this place for a while now because of all the Yelp reviews but when we went there for dinner last night I wasn't that impressed. Maybe because my expectations were too high. We started with the pork spare ribs which had a really yummy sauce on them. But the sauce was a little too thin and didn't really adhere to the meat and the ribs themselves were chopped up into bite sized pieces which made them somewhat difficult to eat. I ordered beef pho for my entree and of course it was delicious (Is it possible to have bad pho?) but I found that the broth had less flavor to it than other places I've tried. Like some spices were missing or something. My hubby ordered the mixed grill with rice and he was pretty happy since it came with a lot of meat. We also split the flan for dessert and it wasn't anything special. The fun and funky decor was cool but I found the plastic chairs to be pretty uncomfortable.  I thought that the prices were pretty reasonable. We spent $35 for a fairly large amount of food. I am surprised by some of the other reviews that said Cyclo is too expensive. Who says authentic Asian food has to be dirt cheap? The owner has created a cute little trendy restaurant with a loyal following (we saw lots of regulars greeted warmly) and so she can charge a little more than your average strip mall dive.  In summary, I enjoyed my experience here but was not overly impressed with the food. I might come back if I was in the neighborhood but I wouldn't go out of my way to eat here.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "Tsm8VraTp5OGyVALtUiCeQ"
  },
  "F7kncP3AqLI_LCqtCrbXUQ": {
    "date": "3/1/2014",
    "text": "we had vegetable rolls, pho, green papaya salad, chicken curry, and fried rice.  I have had vietnamese food all over the country and this is some of the best. The only is extremely helpful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7OhVgsMM66zSqAKk6LZ1Xw"
  },
  "hi42eYunxjZpKmXONM11fw": {
    "date": "7/15/2013",
    "text": "Some friends of ours had been trying to convince us to come to Cyclo (pronounced SICK-lo) for a couple of months, and I'm so glad we did. All the food was fresh, and very authentic, according to our friend who has been to Vietnam. The spicy green beans were amazing, I could eat them like french fries. I had the pad thai with tofu for my entree and it was SO GOOD! The noodles tasted freshly made, the tofu was crispy on the outside and soft on the inside, and the sauce was not overly peanutty or overpowering. My hubby had a giant bowl of pho soup, which he thoroughly enjoyed. I liked that they had so many vegetarian options.   As for the ambiance, I really enjoyed it. The lighting, decor and music was happy and modern. We met the owner, Justine, and I was actually scared to meet her based on the previous reviews I had read on Yelp. Well, turns out the reviews couldn't have been more wrong. She is sweet and personable and she lightheartedly joked with our table. She gracefully floated throughout the tables the whole night, making people laugh and making sure they were taken care of. In my opinion, more owners should be this way, because it shows that they really care about their customers and their experience. BOTTOMLINE: I will definitely come back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "kPaqBMv4mU-N80Fzd8vU3A"
  },
  "nK6_czlzsC0gdh4OVS7QnQ": {
    "date": "5/29/2013",
    "text": "Hmmmmmmmmmm  First, lets get the food out of the way - it was ok. I ordered the pad thai and have had better. There were -only five baby shrimp in the whole bowl! It wasn't bad, but for the price, it should have been fantastic.  Ambiance: hopefully, what we experienced was not the norm for this place. With all the f-bombs and unimaginative cussing from the painfully drunk table next to us AND the owner (she had to be the owner. I cant imagine an employee getting away with that.) it felt as if we had walked into a Quentin Tarrentino movie. I expected to see Christoph Waltz sitting across the room.   My sister had a headache when we arrived and it was only intensified by the forty year old frat boys. After awhile she wanted to ram her fist down their beer holes. Of course, that should have very little to do with the rating but, the fact that they were being encouraged by the establishment, does. Bad first impression.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "F7vUthXHtnVJzlS-dtmQcw"
  },
  "eW72nvp2nUW7N0sZnoI3vg": {
    "date": "3/16/2017",
    "text": "Best Pho Ga I've had in Arizona .  Very accommodating to leave off items that I can't have. My favorite broth by far. I seriously have There Oho Ga at least once a week for the past year.  Justina is a hoot!  I appreciate her sassy but non offensive attitude. She cracks me up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Y_irXocZdZxLs_qgzpjBw"
  },
  "_ct9XqUUvwQ7Oi3ne_8GCQ": {
    "date": "1/1/2012",
    "text": "Delicious yet again! Pho, garlic green beans, papaya salad...they can do no dish wrong. The owner, Justina, is hip, cool, gorgeous and awesome! It's BYOB so bring a nice wine or beer...no corking fee so don't forget to tip well!  If you're eating and there's a big line of others waiting, please do what we do and go across the street to gelato so that other people don't have to wait an hour.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Aau0pm8pIS-b1I4IF6Rfw"
  },
  "CtwOuJSIV1VmIA1IhcmrAw": {
    "date": "8/26/2013",
    "text": "I'm not a big fan of vietnamese food but I have found several tasty options in my travels. This restaurant had some of the best entrees I have had in a long time. It was plentiful and extremley good.   This did not help the location and decor. When you go somewhere that is trying too hard to be trendy there are some expectations. The plastic seats made it feel like I was at a Burger King. That made me feel like I was over paying even though the food was real good. I would go back for the food but the sad truth is as good as the food is, I would want a better environment.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4vlfuzQf3JyzyQcFGNMvVA"
  },
  "ZjPgvPeZbTMNk1UKsZYZ7w": {
    "date": "4/23/2016",
    "text": "PHOreal the best Pho in town. I can always tell when good is made with love. The energy of the place and food is absolutely incredible. The infused water is above and beyond. If you are in the area or from the other side of town (like myself) I would highly suggest getting your butt here. the menu is also very simple, which I like. There isn't 453 items on the menu. Where else can you go where the owner of the place is constantly there insuring quality and service. Overall Cyclo is PHOnominal!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H2HlsPrasDM754B6U_gfGA"
  },
  "U8WFrdP56jrjcqpFowNPCw": {
    "date": "8/28/2013",
    "text": "The staff, service and food are AMAZING! The atmosphere is modern and no- frills nice. The seating is limited, be prepared to wait for a seat or take it to go if you hit during M-F lunch rush, but whatever you do, don't bail...this is a great dining experience. The spicy garlic beans are delectable!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "JOvW4uod7cxJie0O3Cq1tQ"
  },
  "3VAFhfLzKbnfpuzKCc3AMw": {
    "date": "2/17/2016",
    "text": "Stopped by here to have lunch since it was really close to work. I love the upbeat personality of the owner. The service was great and everything was \"good looking\" and apetizing. Even the free fruit water that I was given was fancy with lemon and watermelons. The service was fast and I did not wait long for my food considering I only had an hour for lunch. I also noticed that a lot of the guests were regulars and that the owner had established good relationships with them. Looking forward to eating here again when I am back in the area since I have changed jobs.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "anccLdyyaeka8zGcj2GLng"
  },
  "YMIrOKKdx2o-8SDT31fRvw": {
    "date": "3/31/2017",
    "text": "What a fun place! I had the spicy beef salad that was delicious and spicy. My husband had  a rice dish with shrimp and beef that he really enjoyed. I added some of his rice to mine to make a perfect dish for me. We will definitely be back. Thank you!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sEvhgdRJduiX64FVIBNtZw"
  },
  "cQWvd_Eq-ZLsJ7OrCcJsRQ": {
    "date": "4/9/2013",
    "text": "The first thing you will notice here is Justina. She is warm, friendly, and, if you show up alone, she will sit at your table and get to know you. I had never had Vietnamese food before, so couldn't tell what to order. Her recommendations were the Vietnamese egg roll, Spring roll, and the Black Pepper Shrimp with garlic toast. The first two were good. Although, my pallet did need to get used to the Spring roll, because I did not expect it to be a cool dish, I thought it was delicious.  My favorite? The black pepper shrimp. It had the perfect spicing between the garlic on the bread and a little bit of cilantro, I definitely wanted more.  Highly Recommended!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZwGypw5CNhnqL7UgqkSjwQ"
  },
  "5QihjLyASX_gbvw0c64xUA": {
    "date": "3/5/2017",
    "text": "This place was EXCELLENT! Beautiful ambiance from the cool decorations to the fresh flowers.  Pho totally exceeded my expectations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AI1jhSo65g-sPEqFEyvtCQ"
  },
  "-nKQjzK-ISmY-qcaLOQ-kw": {
    "date": "3/25/2017",
    "text": "Absolutely our Favorite Vietnamese food in the Valley! Justina is such a fantastic owner and hostess.  Love our fun conversations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l77NPkO79jIvZmIIsaxHGw"
  },
  "hiLVJmOI_9dRz1zVH1CJrA": {
    "date": "1/5/2015",
    "text": "Great pho! The service is excellent and you are well taken care of. However the owner swears more than most sailors I know, so don't bring anyone here with any hope of a formal or decent atmosphere.  This place definitely does not meet the standard Vietnamese restaurant stereotype: VERY trendy (looks like an Ikea truck threw up in there). Can't take dates or family here due to the atmosphere. Pho is worth the trip, however and Justina -- whom I like to call Sailor Mouth -- is the price of admission!",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "M8O6P-4O9l3x7l6IvXsp5g"
  },
  "xIzfUaI6mkpd5vRQLbFezg": {
    "date": "10/3/2015",
    "text": "I was worried when we initially came in that the restaurant would be big on ambience and small on flavor or authenticity. It's a very cool looking restaurant, but I've noticed that often a cool atmosphere results in mediocre food. Not so here. Their veggie spring rolls are amazing, and the peanut sauce that comes with them is phenomenal. On our second trip, we got a double order. :) The Pho Hai San is some of the best pho I've ever had, with whole, peeled shrimp, scallops, and crab legs IN THE SHELL so you know you're getting the real deal and not imitation crab. My husband has gotten the Pho Ga and Pho Tai and raved about both. Even the complimentary water, with huge slices of fresh fruit in it, is great. We can't wait to go again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PL-3isIcJPIrUUy81CFQlw",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Even the water is pretty!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PL-3isIcJPIrUUy81CFQlw/o.jpg"
      },
      {
        "img_id": "LfLlTunlvqy-wM00TNmRxQ",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Pho Hai San",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LfLlTunlvqy-wM00TNmRxQ/o.jpg"
      }
    ],
    "user_id": "NU-ZyIuuKzgry6T9FdlQYg"
  },
  "uRXqKbaVxJZZDVv7nLUmMA": {
    "date": "12/17/2014",
    "text": "We should have been tipped off by the overall Caucasian-invasion that made up the patrons.  When you are in a new city, you want to know where the \"locals\" go.  Same applies to cuisine.  If I've offended my fellow Caucasoids, I do apologize.  Many of you do know good food regardless of ethnicity.  The folks dining at Cyclo on the regular, clearly do not.  While the decor was funky and trendy, it felt more like a hair salon than a restaurant and the clear plastic chairs were not particularly comfortable.    We ordered two appetizers:  egg rolls and pork short ribs.  The egg rolls were good, I will say, but the pork was incredibly fatty and hard to eat off the bone.  Our entrees were two types of Rice Vermicelli:  Hanoi and Saigon.  Wholly underwhelming and WAY overpriced.  We didn't even bother with the pho at $9-$12 per bowl!  They likely mark up the soup to pay for the real hydrangeas on the tables.  Nice touch, but I'd rather have good, inexpensive soup which I can get literally anywhere in those parts.  Lastly, what is the deal with the infused water?  Lemon or lime I can tolerate--Phoenix Metro isn't known for it's delicious drinking water.  But cucumber and strawberry and something else I could not place is forcing flavors on everyone who just wants hydration.  It's water.  Try not to over think it.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "QODQ1XKTbhJiishhkVFzuA"
  },
  "oVRoAjDV2w1BpxVCkVI4mQ": {
    "date": "8/16/2017",
    "text": "First time at Cyclo. Came highly recommended from multiple friends. Everything we ordered was amazing from the short ribs, spicy chicken wings, green papaya salad and the Pho. Justina is hilarious and I will be back at least once a week so she can give me a hard time!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1SyS49NisQeOsrh7j8bv9A"
  },
  "ylsIud5Xql6adS4F4zdOTQ": {
    "date": "7/14/2015",
    "text": "Super amazing food!  We had the green papaya salad, rice crepe, wokked beef, fried rice, crispy rice cake.  The crepe was out of this world!  The rice cake was also delicious.  The staff was so friendly.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ysqfg2Ah_i3mBCxWHCFBhA"
  },
  "Rjm_p_9RtZ6ljkyL7a6p5g": {
    "date": "7/13/2012",
    "text": "Cyclo is like the cooler, hip younger sister restaurant of Khai Hoan in Tempe (They are literally sister restaurants, as stated on their menu).  It exudes the exuberance of youth, but doesn't quite capture the authenticity and depth of menu that Khai Hoan does.  The interior is similar to a funky little boba shop, with lots of bright, pop-star colors and design, and those that are unfamiliar with Vietnamese cuisine may find this as a good stepping stone.  The menu is very limited, and portions are smaller than Khai Hoan, albeit more fancifully decorated with flair.  Prices are also higher.  The papaya salad I had was good, and had a good balance of tangy, spicy, and sweet.  My husband's mixed grill entree was decent, but the strips of meat were slightly overcooked so they tasted tough.  Justine, the owner, was here and she is charming, vibrant, and always has a funny story to tell.  I do give her props for creating a more welcoming atmosphere for those that are usually afraid to try different foods, but for me, I'll probably head to Khai Hoan for my Vietnamese fix.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "DK57YibC5ShBmqQl97CKog"
  },
  "2KdV78u_eKRb5DvETJLsYQ": {
    "date": "7/31/2014",
    "text": "Everything about this restaurant is amazing! The decor and food is fantastic and the owner is fabulous - love her!   We sampled quite a few things and while I loved it all, my favorite was the beef salad. Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "tR61gp6Kan5HCVmqtYsFzg"
  },
  "JURZs4UBctVjqkSjyNPrrg": {
    "date": "11/19/2015",
    "text": "This place ROCKS! Justina love ya girl! Outstanding food, outstanding service, great atmosphere. Trust me... you gotta try this place! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SEeNDxHi1YEC6okNGQEk6g",
        "caption": "Photo of Cyclo Vietnamese Cuisine - Chandler, AZ, United States. Date night with the kiddos :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SEeNDxHi1YEC6okNGQEk6g/o.jpg"
      }
    ],
    "user_id": "qCPHKefQKXx_N-UTprHpeg"
  },
  "xT7M5dtfcXjP8xTm_Q20iA": {
    "date": "12/17/2016",
    "text": "I love pho. This place was pretty good. I like the vibe and decorations in this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6XXGMglpcv-L1l0N2Tv4xA"
  },
  "VoEFx1BZwjl6yri2jzy8Ng": {
    "date": "7/16/2015",
    "text": "Lunch out today with a group of former coworkers, and we decided on Cyclo. Two of us had been before and loved it. Justina is always so funny and entertaining. Decor is modern. Today, I decided to try the lemongrass chicken, and was it ever good. =) I do wish that I had ordered a side of the green beans, as another table had them and they looked delish. We will certainly be back.   I also really loved the addition of fruit to the water. It made it taste fresh like the food.   Great job Justina! Keep it up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pNn_DcM3TyBxSqSv5S7P_g"
  },
  "oKhVA85MGpjYie7ZowwJ1A": {
    "date": "9/13/2016",
    "text": "Wasn't a fan of the food and was even less of a fan of the service. She was nice, but inattentive. I had the Mi Ga and my girlfriend had the Seafood Pho. For what it's worth, she would give 3 stars.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XHR3tdMuK_UINUYh41XKeA"
  },
  "vcszRuqWr6e0NIsFUWZOlQ": {
    "date": "11/7/2016",
    "text": "Excellent Pho here, I've been to many different Vietnamese restaurants in the area and Cyclo Pho is one of the best. The atmosphere is cozy and nice and the staff there are all friendly and amazing. One of my go-to places for awesome soup. Gotta have the XL Chicken Pho!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FJG3dGbxSVKZNDzMn50fOQ"
  },
  "6cfBl0krUAzxladnuobbdA": {
    "date": "9/7/2017",
    "text": "A bit disappointing. I eat Thai, Chinese, Vietnamese cuisine 4 days a week. This placed look good and received 4 stars. Tempting. Unfortunately, no lunch special. Ordered crispy lemongrass chicken. It was good not great. What made me truly disappointed and surprised, was how it was served. Not one veggie in the dish just dry, lightly fried chicken with no sauce. Oh, I forgot to mention they gave me a bowl of white rice. All this for $10!! Sorry. There are plenty of good Asian restaurants out there. This one won't be on my list",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oQtb2Zmc8GjRuJiKiZv4wA"
  },
  "MG3P3CItqDKz2sJQjud7Jg": {
    "date": "2/9/2014",
    "text": "This by far is the best Vietnamese Restaurant! We live in North Scottsdale and are always down to make the drive for Cyclo. We haven't had anything we didn't like!   The owner is amazing and the rest if the team is super friendly as well.  Need suggestions?... The Pho is Amazing! Want to try something different?.. Go for the Fried Rice Cakes with seafood, veggies, and beef! To start be sure to order the Vietnamese Egg Rolls, Green Beans, and Black Bean Shrimp! We always end our meal with an iced Vietnamese coffee. Better than any others. And don't forget-- it's byob!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "rDq2ErSEX621wWbfNy6ENQ"
  },
  "306OgQyglNEcHmKLxFkURQ": {
    "date": "8/4/2016",
    "text": "Some of the best Pho I've ever had. This place is an absolute must for both locals and tourists! The owners awesome too. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qlyxnQiL3pJ6VMq5dFbejg"
  },
  "KiPq9_iCnjIedtECzkORIg": {
    "date": "8/1/2014",
    "text": "This is a great place to go with friends. The decor of the place is great and the owner Justina is worth stopping in for alone. She kept it fun and energetic and did a great job explaining the made to order menu and helping us decide what to get.   As for the food I really enjoyed the Crispy Lemongrass Chicken, Spicy Green Beans, and Beef Carpaccio. The Plum Soda was interesting and a bit strange [in a good way].  I will be back for sure. This is what more restaurants should strive for. Fresh, lively, and with a high attention to detail. Having an owner running the front of house with that kind of enthusiasm for their restaurant is refreshing. I saw some other reviewers post that she may have used some salty language...f*ck yeah she did and I loved it. She read the table and was very playful and charming.   This is one of Chandler's best restaurants. It is BYOB so be alert to that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7xToJ9ei3VI2xZfH5cWKzg"
  },
  "Pv4dG1L6YhpJtk9wLfOuzA": {
    "date": "12/27/2013",
    "text": "Let me start by saying that I'm biased because I'm originally from the Bay Area and I know Vietnamese food...  This is not it, they're way over price and the quality of food does not make up for the poor service or the portion size.  You're looking at a $13 entree avg price, which is already high - but they don't make up for it in flavor/taste.  It took a while to get our food when two other parties got theirs before ours.  One of the pork chops on our table was really dry. Described it as eating jerky!  When looking around for the hostess to get our bill, she was sitting down eating with a friend.  Like others I've heard great things by word of mouth... But I won't be coming back here at all.  The good: It has a \"wanna be trendy\" little vibe to the restaurant decor. There was a diverse crowd when I was there. It's a small establishment, but clean.  I'll keep it 100... When someone chooses to not talk to you in the native language of the cuisine they're serving... That's when you need to get up out of your chair and leave. That should have been the warning sign for me.  Bottom line: Never hurts to try a new spot. But don't let me say...\"I told you so\"",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "eBM4JlmRSLT-lDPMbG-Qnw"
  },
  "mzUBWuyAR36LrGJ8gCXbJA": {
    "date": "3/18/2014",
    "text": "After reading some of the reviews about Cylco I had to come back to write my own. Cyclo was highly recommended by several colleagues and I had to try it for myself to see what the buzz is about.   First off, for all you who come from somewhere else...Like \"The Bay\" or \"New York\" or wherever you come from...? Just as a reminder you currently live in Arizona! I'm from Louisiana where there are also a lot of great Vietnamese restaurants, but who cares...I live here.   My most cherished dish here is the X.L. Beef Noodle Pho Soup. It includes braised brisket, rare sirloin, rice noodles and all the fixings so be prepared with a huge bowl if you get this to-go. If you think 12 bucks is too much for this bowl, go to some fast food franchise. The location is relatively small and intimate with ambient lighting in the evening. Additionally this is a BYOB establishment so feel free to bring your own wine or spirits...Try that at other Vietnamese restaurants!  Justine is mind-blowing and awesome in her own way! She's the owner and also works at the establishment. She's straight forward and not afraid to speak her mind so she's not for the weak hearted. When dining in, she makes her way to every table to ensure your dish suits your desire.   I hope this was informative and most importantly...Enjoy your meal.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "h6n6dOMbrc1Cr9QIOz_PxA"
  }
}