{
  "BsopYdCCk1ddJV3dmpTc0g": {
    "date": "10/4/2017",
    "text": "This WAS our favorite Thai restaurant. Went there Tonite and had Pad Thai and Thai basil chicken. The food came out cold and when reheated, the chicken was tough in both dishes. We asked for medium spice and the dishes were very mild. We used to think that this was a 5 star place. Not anymore !!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lBQAlv3jp1HwAt6bPIjKyA"
  },
  "BplWYp8GFkTQJWWEYgfPvw": {
    "date": "1/20/2016",
    "text": "We originally discovered Suh Noi through GrubHub, and were thrilled with the quality of their take-out food! It turned out to be right around the corner from us, so we decided (after ordering it a half a dozen times) to finally go in and check it out.  The building is small and has a drive through window, but don't let that fool you! The place is actually really nice!! They include nice glassware and place-settings on each of the tables, and in prettier weather, their trendy outdoor area looked like it would be a cozy, fun place to hang out.  As far as food goes, I have my favorites for sure. The Dragon Egg (steamed) appetizer is wonderful! If you're not much for spicy food, just take the jalapenos off and they're fine. I believe that there are six to an order, and my boyfriend and I usually polish them off together. (It's sort of like a delicious, moist meatball in a dumpling! So good!!!) My usual main-course is the Pad Thai, which I like to get extra spicy! The flavor is great, and I love that they serve it with some raw veggies that give it a great texture. My only complaint would be the size of the hunks of chicken. If they cut those down a bit, it would be easier to eat with chopsticks and you'd get some chicken in more of your bites. (Right quantity, wrong size.) That said, it's still great!!! My boyfriend usually goes for a chicken and veggies dish, and he's never had any complaints. Of course, the chicken egg rolls are awesome, and a favorite we often order too... As you can imagine, with all of this food, we almost always have a meal for the next day!!   Overall, we were really impressed by this unexpectedly trendy spot! If you're looking for something quick and delicious, check it out one evening. If you have a little more time, they offer some decent wines too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "O9a2Dm0-xBK2vyeqhjgxVw"
  },
  "cDZ70E5lnYtqR6L1kR1kGg": {
    "date": "5/17/2015",
    "text": "Great mom and pop shop.   Colorful hair and colorful food...top shelf!  Patio LED trees and bamboo fences give a \"Disney's Mulan meets Rave\" ambiance that perfectly complements the shrimp pad Thai.   Their food paints a masterpiece that can't be described through words. Flavors as magical as hearing a symphony in the dark.   If you don't get the half off appetizers when you buy a specialty drink, you are doing it wrong.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXhhz9W0TUdrwh2n4r_1PQ"
  },
  "amgiOfNqi10dowi2e0jnTQ": {
    "date": "1/25/2016",
    "text": "This is a great little place with good food, many vegetarian options and attentive staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ra7HvJ421CV_uYJFfgVPbQ"
  },
  "uXGPELTBICmipElsLrnd3A": {
    "date": "2/17/2016",
    "text": "Whoa the food is Really Good. When you have good food nothing else matters. this will be my new Sunday night ritual. it used to be another thai place in old town that started with an M. presentation is very nice too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fdK6g-0ynhxPmUNFn8fKFQ"
  },
  "dBNae3MIG_T3qVsp16dnrA": {
    "date": "7/18/2016",
    "text": "Amazing food and service! I was on the verge of hangry so I was happy when the Fresh Rolls(best I've had) came quickly. We ordered the Green Curry and Ginger Fish, both amazing AND we ate way too much and still had food to take home. Can't wait to try the Phoenix location too!   This location is low on parking but, not a deal breaker and most of the time not a problem. Plus, if you do end up walking a little you'll have room for the chocolate cake ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvsztBnJfwIfHBQs_an9gw"
  },
  "0DTn7-DHE4WZMmXymUdKeQ": {
    "date": "1/24/2015",
    "text": "What an adorable place! And after the place has been void of a business for sometime, it's about time.  THE PLACE: Adorable decor. Quite appropriate for a little Asian diner with a  modern feel to it. Some one really loves Anime, as you will see murals and Anime posters and photos of cosplayers.  Parking, not an issue, there's plenty of parking. Can't dine in? Order your food to go through the pick-up window. You can even call ahead and just pick up your food at the drive through. You can see the ladies working the kitchen, and I observe the place to be quite clean. Not sure about the restroom though, as I was only there to pick-up our take-away food.  THE SERVICE: We phoned in our order. We were told our order would be ready for pick-up in 15 minutes, and that we can pick it up at the drive thru window. I thought that was really neat.  As we have never been here before, we decided to come down and pick-up the food. The young lady who took my  order via phone rang us up, and I added a Thai Tea to go. As she was the only one manning the front of the store, we waited a few minutes before we could get the Thai Tea as she had to assist other customers. Overall, it was alright with us, but I caution that she may need additional help, during busy times.  THE FOOD: We ordered for 2 Candy Chicken Combos with Tom Ka Gai, 2 Yellow Curry Combos with Tom Ka Gai and 1 Pad Thai. Truthfully, it was just okay. The Candy Chicken which was given much praise by other reviewers due to the plum sauce, was not what I expected. The plum sauce was more like an overly sweet chili sauce. The curry, was a bit watered down from what we were accustomed to. The Pad Thai was alright. It tasted quite fine, but I do have to say, I've had better at other establishments with a comparable price range.  Will I come back? Sure! I would like to try other items at the place. Hey, I'm hopeful I would be better impressed at the next visit and would have to update this review. Go small businesses!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uaPnZ_6zFGgzhFnIf2fzkg"
  },
  "6pJWYRCzd65eVlER9zlQ4A": {
    "date": "2/12/2015",
    "text": "I love this place! The food is awesome. Pad thai, panang and the yellow curry are all yummy. My all time favorite is the tom ka soup, delicious. They also do a combo meal so you can get the soup on the side with once of the curries. If you are looking for a caffeine kick the thai tea and coffee hit the spot. They also have a drive through, i would call ahead for big orders although it probably only tool them 20 minutes to get my order ready.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FdEeMIRg629dT2xThepj9Q"
  },
  "E7JU25FPoT1JLBKqGxRcFQ": {
    "date": "10/17/2016",
    "text": "My husband and I went for dinner a couple of days ago.   He had the vegetarian fried rice and I had the Tom Ki Gai soup.   Both were pretty good, but don't expect anything extra.   My husband wanted an extra fried egg and was told they couldn't to that.   He asked if they had eggs,  and was told yes but they couldn't fry one up for him even if he paid extra.   So it was they wouldn't, not that they couldn't.   He then asked if he could get a small side of the yellow curry sauce and again he was told that they couldn't do that either.   If he wanted the yellow curry sauce, he had to order the complete dish.  So while the food was fine,  the service was not.   It is another case where service lags and where the restaurant only gives what they want and is not interested in serving their customers in excellence.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZJ9OM8zdSJXICi5aGrOaVw"
  },
  "QWR7I3XroRb1IWX8HilabQ": {
    "date": "7/21/2016",
    "text": "Okay, I have been going to this place for awhile, and I have introduced a couple people to this little spot and they always love it.  It is really good, but I am a picky vegetarian.  I decided to ask if they could tailor their no no pad thai for me, and they did.  It was amazing.  I wish I had more healthy options in this area, but now I have an awesome healthy option right down the street.  This place is great for take out, but if you do sit down, try their strawberry boba cocktail!  It is not traditional tapioca, it has bursts of strawberry in bubbles, it is so good!  Parking is limited, but I have never not found a space.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U4RUySrI2l-b2ps8jZYcMg"
  },
  "J1IbAOI7bItz7k4PGPzquw": {
    "date": "12/28/2017",
    "text": "So much enjoyment packed into this tiny establishment. Each time we have visited with two or six guests, we are served promptly and service continued to be great.  Every dish ordered was fresh, tasty and just what we hoped.  Dragon eggs are wonderful with large portions of shrimp, pork and crab.  The crab island appetizer is served cold and stuffed into a crisp wonton.  The crab ingredients were wonderful.  Both items are highly recommended and we will order them again in the future.  Main entrees were happily customized in terms of spiciness and the best ingredients were used for each entree.  Chicken pad Thai, Holy Basil, Candy chicken and the peanut dish with peanut sauce were outstanding.  Holy Basil was spicey yet our guest enjoyed all she could eat.  Our server offered to prepare something else in lieu of the spicey dish but our guest was happy to enjoy what she was served.  Great atmosphere, pleasant staff, fresh food enjoyed by all!  Thank you, Suh Noi. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JWoBMTEImlPhxUmkits9Zw"
  },
  "FHqc6yjkvfcmayHMQiiQ2A": {
    "date": "5/18/2017",
    "text": "Very good chicken curry lunch special. Just spicy enough, not overpowering. Himself had the beef and broccoli, which he said was very good. Ordered the dragon eggs since that was what guy fieri had on ddd, and that was just okay. Cute and clean place, food worthy of second visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j-i6_zboeko9mkR9UIFKMw"
  },
  "QLnz5faGOr-dvNoBTM4JdQ": {
    "date": "1/13/2016",
    "text": "The Thai Inferno was not terrible, but they were out of cheese.  The pad thai chicken medium spice was bland and spiceless yet had a very peculiar off-taste like a chemical. The prig king ordered with pork came with chicken mistakenly. Asked for the ** hot spice and certainly was beyond that... *** Thai hot. Included mushy eggplant, too, which was not in the description. Ordered for take out, we ate the burger and threw out most of the rest. Certainly disappointing considering the prices are above average for Thai and other Asian dishes. The staff was friendly and upon leaving stated \"hope you like it!\" Unfortunately, we did not.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_srSHBxGU9y0EkTFgd3JBA"
  },
  "wJqGzNVn08Oz9DO7q772GQ": {
    "date": "6/25/2016",
    "text": "Very fast service and they spice everything perfectly. 2 pepper hot rating is perfect and not over the top racing for water constantly. The seafood panang dish is amazing. We normally get Tom Yum seafood soup and panang curry and this dish was an amazing marriage of the two!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ezsfAaMcz7ACvuCamGlANA"
  },
  "mMTuqw-7B8Lf3qaWljMvbA": {
    "date": "3/28/2017",
    "text": "Food was outstanding.   Reasonably priced and good portions.  The only thing that gave it less than 5 stars was staffing. Our server was great, but was all alone in a busy restaurant struggling to keep up. Hoping for her sake it was a \"someone called on sick\" - but it would be great to get some help.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ya0hlaJa-oRydqHNRduNrQ"
  },
  "IIFqxaecVOv6juEpuryecg": {
    "date": "8/11/2017",
    "text": "i am sorry to say it only takes one bad experience to put a bad taste in your mouth. i had ordered a favorite, but it came wrong and was poorly made..dont order on a monday. i called and let them know. a lovely gal apologized and said to come in next time and it will be comped.  very cool.. until i called and they refused to honor the graciousness of their staff member.. they were like, too bad.  my feeling is this no way to treat a reg customer.. there are other thai restaurants.. im in the service industry... shame on little thaiger.not good service at all. they have lost not only my business.. but others will follow.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2B9GViM1mFF2b2PPXN87sQ"
  },
  "hM2V5qBq6Zhfq5WavPKBoQ": {
    "date": "3/1/2016",
    "text": "The customer service was good. They sat us quickly during lunch hours and brought out our drinks pretty quickly. As for the food, it did take a while for it to come out even though we were the second group to arrive. The wait was well worth it because it was very flavorful but, the noodles were a little under cooked",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ujr0MVxtWMki44XIqrWdcg"
  },
  "d9kyOxhehxdArqiE1zWG7w": {
    "date": "10/27/2014",
    "text": "OMG!  We just found  our new Thai spot! Food was more than spectacular, the service amazing and right around the corner from our house. If you like to explore new places ,this should be on your to - do list.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SShT6PzNDRcHYUTvIUnKdw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. One happy customer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SShT6PzNDRcHYUTvIUnKdw/o.jpg"
      }
    ],
    "user_id": "Wzv0Nwo4YWpAASk3dEBvsw"
  },
  "F5wd4wI6mNol3UdKk82sfw": {
    "date": "5/1/2017",
    "text": "Fantastic food!  I've been searching for my go-to Thai in the East valley, and I am happy to say the search is over. Same great menu as the central ave location, but more convenient for me as an east sider.  First went to this location last week, had the beef panang (hot)...perfect spice for my taste, and one of the best panangs anywhere, let alone Phoenix.  Quirky, mod decor at the Scottsdale location, but cool.  Get there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IR3VngZ2BRL8YKzIuoO5WQ"
  },
  "FQbseXquKWc3x7DARfkQJQ": {
    "date": "2/1/2017",
    "text": "Ordered the Tom Ka Gai soup and Spicy Chicken Basil dish for takeout. The soup was excellent and had lots of veggies in it. The chicken dish was ok, but a little over cooked. The portion of the chicken dish was pretty small. The staff there when I went to pick up was very friendly and inviting, but my expected 15 minute wait turned into over 30 minutes. I'll go back and try some more things for sure as it's close, but they haven't become my new go to Thai place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "134iMbsqoAkquoxEH16MYA"
  },
  "7jD41iWZJZyh6j8hlBjCPg": {
    "date": "1/27/2017",
    "text": "The tom Ka was AMAzing.  Get the forbidden fried rice. Thai martini.  I'm really happy about how wonderful it is in person. First time to dine in and wayyyy better than take out. Yea. Great solo experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qob38th2TJwOOFX3bbfUxQ"
  },
  "o9jgvpNU6OkMlbEY8i2piw": {
    "date": "12/11/2017",
    "text": "When I don't have time to sit down at the Wild Thaiger this is where I go to get my fill. They have my favorites, dragon eggs, Penang curry, and papaya salad. Never a wait and the service is quick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DHzOUk1HlRIJeQjhAJGrgw"
  },
  "85OryIw4dVRxQo-wRnnBFA": {
    "date": "11/16/2016",
    "text": "This is my favorite new places to get a fabulous bite to eat!  I'll start by saying that the service was spot on.  They were prompt, kind and knowledgeable about the menu.  Now the food.  I had the Peanut Passion, the veggies were cooked from fresh and were cooked perfectly.  The pork was so tender that we were cutting it with our forks!  My lover had the Tom Ka Gai, which is a typical Thai soup, but this recipe was hand down some of the best I have had.  The best part of this place is that it is only a mile and a half from my home!  I cannot wait to go back and try the rest of the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8jKLOKcx_0c-HkxeH5sTfw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Peanut Passion veggie surprise underneath",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8jKLOKcx_0c-HkxeH5sTfw/o.jpg"
      },
      {
        "img_id": "agO-uVgeapLk_kn67KmFIw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Cute dinning room",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/agO-uVgeapLk_kn67KmFIw/o.jpg"
      },
      {
        "img_id": "PCFNDJaQnI-may2U3V-rPQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Tom Ka Gai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PCFNDJaQnI-may2U3V-rPQ/o.jpg"
      }
    ],
    "user_id": "9cg7YdWtema_3ay5oaqTsA"
  },
  "DVCulXVK3MjiyN5KKA7aGg": {
    "date": "3/1/2017",
    "text": "We're from out of town and stopped in for a bite. I had no idea that they were on Guy Fieri's  show. Place was clean and service was nice. Food tasted fresh and the spice level is on point. It's not a place to eat quickly, but I don't mind the wait for good food. I just wish I had the stomach to try more dishes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-ddUNiLbYaU4_N_mi4wLQw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Perfectly portioned and had 2 chili level of spiciness.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-ddUNiLbYaU4_N_mi4wLQw/o.jpg"
      }
    ],
    "user_id": "OeYCRbhOVB3YRnUnVvdGOg"
  },
  "odTZS50sW68bGV-iGsEwPw": {
    "date": "1/20/2017",
    "text": "Pretty good. I had Pad Thai - as usual - and my hubs had the Beef Panang. He said he was pretty good. I'm no expert in Pad Thai but the bean sprouts, green onions and other fodder were not cooked in with the noodles and the chicken was laid on top in huge slivers. Taste was great presentation was just a bit off for me. We would come back if we're in the area!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CJhA9J5lLl5xocabEhPl5w",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CJhA9J5lLl5xocabEhPl5w/o.jpg"
      }
    ],
    "user_id": "J3LogGPQ1-94sF8H5gX42A"
  },
  "91kSiCCirueqFdTcNieThg": {
    "date": "9/24/2015",
    "text": "Let me just start by saying everyone is SOOOO nice! And the place is pretty cute, sets the mood for a fun date or just to meet up with friends.   Parking is a little rough since its so small and you have to park in the back or side of building.   Food... well it was my first time there and I seemed to be the first to order their new menu item 'the glazed shrimp in veggies with a side of clear noodles' and MY TASTE BUDS WENT WILD! So yummy, I was soo full but I just couldn't stop eating it! And might I mention it was a huge dish now I understand why it was $15. Still very pricey though but the taste made up for it.   I will be going back very soon, don't be afraid to try something new, I did and I loved it!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Acccl5yjGkvy-UIRYA-Axg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Acccl5yjGkvy-UIRYA-Axg/o.jpg"
      },
      {
        "img_id": "uDy3jvLrYl3cyN5exzLyFQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uDy3jvLrYl3cyN5exzLyFQ/o.jpg"
      },
      {
        "img_id": "qPNi87Ql4pjUZoBHnTH-Kg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. I added clear noodles as a side which is what is in the middle cup, large shrimp came with the glazed sweet veggie sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qPNi87Ql4pjUZoBHnTH-Kg/o.jpg"
      }
    ],
    "user_id": "jpRFWQLrPnCQN5FThm7T4w"
  },
  "YJtrFF9DkYuHzjdodsF-eg": {
    "date": "12/18/2016",
    "text": "One of my go to places for take out.  I found them on Yelp and yet again Yelp didn't give me the wrong advice. It's pretty convenient to get to from my apartment and the drive through window to pick up the to go orders is super nice to not have to run in.    I always get the glass noodles with chicken and they always have such good flavor. I'm a huge spice person and the spicier the better for me.  Whenever I call to order they are pretty right on for the time estimate and there isn't usually a line of cars or anything. Definitely recommend for Thai in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jkckGEa9jroz1aNp6MaStg"
  },
  "MDuA9OEg6xCSF2YYFlj6Xw": {
    "date": "8/30/2016",
    "text": "My first time ordering Thai take out and I was very impressed! The inside is super cute and the staff was friendly. We were quoted 25 minutes for our food to be ready. Parking spots are in the rear. When I went in to pay, their iPad started doing an update and they couldn't process the transaction. It took the girls several minutes trying to figure it out before I just decided to give them my cash and not get any change in return. They need a second computer!  Aside from that slight inconvenience, the food was phenomenal! I had the curry and the flavor was outstanding. And all at a reasonably price tag.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "WWzW-F4eU8bgTiwnQOMY-A"
  },
  "I23eFPngwWguuncrb_mVPw": {
    "date": "6/11/2018",
    "text": "Small place, but always great customer service. I also like that there is a drive thru window for pick up. Love the pad Thai and the Thai iced coffee!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pYeuhmmZdl8cxKPHSjhA6Q"
  },
  "lZHm-eZocJyXOb_hicmJng": {
    "date": "11/5/2016",
    "text": "The two stars are for comfy seats, mediocre service, and soda. We ordered the fire rice or whatever its called and shrimp pad Thai. Rice was cold, end of story. Had to send it back. The pad Thai was sweet, I could barely get through it. Very disappointed in the quality of food, I'll not be returning",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_4nl1_JNiWj8PU2auSOrqA"
  },
  "7M-9ZOUP1kSIHqcEFXksCw": {
    "date": "8/29/2016",
    "text": "My new go to Thai restaurant! I like the different veggies they add to their curry dishes like eggplant and pumpkin. The curry sauce is a little different than the other Thai places I've ordered from. It's a little thicker, but still very tasty! Make sure to add their coconut sticky rice...such a delicious add on.  They are fairly affordable and I love that they have a pick up window for ordering ahead of time. Definitely worth checking out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "boYRJ1VOX3iNmsGmJ0Mswg"
  },
  "HCiHr3wBia6IQAXFsEJ3NA": {
    "date": "4/20/2015",
    "text": "Suh Noi (Wild Thaiger's sister restaurant) is a cute, modern and casual spot to get Thai food. My husband and I ordered the Mee Krob, Fresh Spring Rolls and Beef Panang. The Mee Krob was good at first, but it was also very sweet and made for a wearing dish. I could only eat a small amount as the sugar was a little overwhelming for me, I wouldn't order this again. The fresh rolls were indeed fresh as well as delicious and healthy. I've had these at Wild Thaiger and they tasted the same, just as good as I remember. The panang was a bit spicy and very authentic. You could taste every flavor and could tell they didn't skimp with the proper ingredients as a lot of other Thai places do. Service was great too, our server really knew the menu and was great at explaining the dishes to everyone. I will definitely return to try more of the menu, but it will be really hard to stray from that panang.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DnOWVWjbU2IdnDpaKKlpsA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Wild boar grapao",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DnOWVWjbU2IdnDpaKKlpsA/o.jpg"
      }
    ],
    "user_id": "QG9ZJatKSWj5p5VrW3cfMA"
  },
  "sH0Fa42KKtWZfmZky-Idyg": {
    "date": "9/30/2017",
    "text": "The food isn't bad, it isn't unbelievable, but it's above decent. The real problem is the shitty service. The waitresses are just rude, I wish they would be somewhat friendly. If it were just food it would get 3/12 or 4 stars, but I went lower because of the service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i4zlrngUfDASv0bwrB8pjQ"
  },
  "Z68UafqPRYQp8Wb5OhStFA": {
    "date": "8/9/2015",
    "text": "I love this place. I was so happy when I saw this place pop up in this location. This area of south Scottsdale needs more cool local spots.   When I lived in downtown phx, my favorite Thai restaurant was wild thaiger. Now I am able to get awesome food at just a stones throw.   This spot is tiny. There are about 5 tables and a quaint outdoor patio. The decor is interesting and modern. Bright white, cool lighting, pink details.   The food is wonderful. I would highly recommend the pad sea ewe. It is some of the best I've ever had. We also got the dragon eggs appetizer and it was OKAY. I was a little underwhelmed with the flavor.  Note: the lunch specials are only valid mon-fri   I am interested in going back in the evening maybe getting a few beers and sitting on the patio.   I will be back many times.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0Rf4-ie0WJ2V6rxnHqQZ6w"
  },
  "jOX_8aa1H3sdJdrzUuTbBQ": {
    "date": "3/31/2016",
    "text": "I heard about it from Diners Drive is and dives.  I needed to be the judge though. I ordered the panang beef.  I rarely give 5 stars, and if I'm being honest the 5 stars was for the panang beef, as this was my first time here. I could taste the kafir lime leaves, lemon grass, Thai basil, and coconut milk all singing, because it was so fresh.  The service was unassuming and the restaurant clean and pleasant. The presentation was perfect.  I could have gone to Hooters or Applebee's and spent the same amount, this is so much more.  I'll pull in here anytime I'm nearby.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j6TTvjdvdVgN0o6CJ6-geA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Panang beef",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/j6TTvjdvdVgN0o6CJ6-geA/o.jpg"
      }
    ],
    "user_id": "VGRjekRjUvxrY-OQcr5Rbw"
  },
  "rsbXgx-xLBOLvhZWA2kkLA": {
    "date": "10/30/2017",
    "text": "As always this place is amazing! Fresh food and great prices. Just tryed the Crab wontons for the first time tonight and they are the best I have ever had. You cant go wrong with this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VBOKRU7N__zIufrJwuS6iw"
  },
  "ozSfPG-ZP7JJQLc9mKwRmg": {
    "date": "9/1/2015",
    "text": "I love Suh Noi! The staff is always friendly and they have a unique offering for Thai fusion cuisine. They are quick to serve you and the ambience is great for a little fast-food joint. I love the decor!   This joint is a great little gem in South Scottsdale. If you like heat don't forget to ask for chef hot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WQjkLcR5mnJCF54cHsUncQ"
  },
  "3Ok0VwRvpjp8MHgcDBPflA": {
    "date": "12/27/2014",
    "text": "I believe the correct name for this restaurant is Suh Noi - The Little Thaiger. This is a small super casual Thai restaurant with a drive-thur window. The menu is small compared to other Thai places but they also serve some unique foods too. You order at the register and seat yourself.   Based on what we had they are deserving of at least 4 stars as the food really was very good.  In both dishes we tried the meats were cooked nicely and the dishes actually had enough basil.   I had the Holy Basil Chicken. The chicken was tender and this dish had enough basil to make it taste good. This dish ran much hotter than I was expecting and I almost couldn't eat it. I ordered it very hot. About 1/2 of other Thai places don't make very hot that hot and I'm usually left wanting more heat but NOT THIS TIME. I'm not the biggest fan of jalapenos in Thai Food but it's such a big deal to find a place that uses Holy Basil I got it anyway.   My husband had a similar dish the Wild Boar Grapao. This dish is made more the way I like. The meat was hand chopped in a similar but slightly different sauce with Thai Basil and Thai Chili's. The very hot in this dish was mild compared to the Holy Basil Chicken but was spicy. For $1.50 extra you have the option to have your dish Thai Style with a fried egg.  Very good and above average for sure.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7rYITS_BWrWrgIANEX9dGw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Wild Boar Grapao with added fried egg",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7rYITS_BWrWrgIANEX9dGw/o.jpg"
      },
      {
        "img_id": "SgupiY8qas4HgJ9MiFlLmA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Holy Basil Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SgupiY8qas4HgJ9MiFlLmA/o.jpg"
      },
      {
        "img_id": "MresEdPB5s1TC6tP6ROQ9A",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Dining Room",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MresEdPB5s1TC6tP6ROQ9A/o.jpg"
      }
    ],
    "user_id": "V-BbqKqO8anwplGRx9Q5aQ"
  },
  "sgXVrV0paiUf6hT85oqv3A": {
    "date": "11/21/2016",
    "text": "This is my first time checking into this place. It literally is a hole in the wall type restaurant but very, very nicely appointed inside. It doesn't feel greasy or dirty and the interior is clean. The food item menu appears to be standard Thai fare. I went with the chicken curry which appears to be a staple that very few restaurants can mix up. This was extremely delicious with a nice blend of  heat and sweet, the proportions were excellent. This is a great place for lunch and dinner. I'm looking for to exploring this menu further. And I will recommend highly to my friends and family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M0skhuBitOEQyov03JdajA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Yep it&amp;#39;s all gone.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M0skhuBitOEQyov03JdajA/o.jpg"
      }
    ],
    "user_id": "m99w6Uyv3LAEdarYqI2l_A"
  },
  "5JiPLf6h5tKg84YYvGlsUg": {
    "date": "1/31/2015",
    "text": "Looks like Dairy Queen after a makeover, but a good makeover. Lots to look at, great peanut chicken and the soup was really tasty. We want to go back and explore this menu more but we just needed a light lunch. I will add to this after we hit it again. Make sure you stay while you eat or you will miss all the neat little items that decorate this place. They were polite and friendly, helpful with the menu items.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "nZyG6wQqaem80NIOEJwTHQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Pad Thai",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nZyG6wQqaem80NIOEJwTHQ/o.jpg"
      },
      {
        "img_id": "eWnrkqM0NOc8DE2_HPYQpQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Peanut chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eWnrkqM0NOc8DE2_HPYQpQ/o.jpg"
      },
      {
        "img_id": "iL1vSGIW86JTA4TJrakQoQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Yellow curry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iL1vSGIW86JTA4TJrakQoQ/o.jpg"
      }
    ],
    "user_id": "djP46l4v0TQTqhLa-ZB1xw"
  },
  "n801SrmhX69ynBw_e0Mngg": {
    "date": "10/18/2018",
    "text": "Clean flavors, fresh food. Service needs some adjustments.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8-B0LhcxWBupR2ddzrxbxg"
  },
  "lAd4M2xfU9kopTzsFDMNQw": {
    "date": "10/18/2018",
    "text": "Enjoyed Thai-hot catfish dish most, but also liked chicken pad thai and shrimp tum yum soup. Will return for dumplings, catfish, dessert.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mwP9lsUeI3wnItfLmVGwTQ"
  },
  "vRlPD2_iNjkG62tZsU2DJQ": {
    "date": "6/11/2018",
    "text": "A nice little place with some different options. I just finished this delicious food! It was my first time eating Thai food and I was not disappointed. I got the Fat One and even though I'm sitting here with my mouth on fire from the spice, it was sooooo good! I'm thinking of shrimp next time, this time I got plain. I'm smiling from ear to ear and I'll be going back for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6rYNxgWJXRsVSZB03ky7Bg"
  },
  "da7QFcO_1YRQ5Hyxes9k0w": {
    "date": "5/8/2016",
    "text": "I saw their Phoenix location in the episode of diner, drive ins and dives so I wanted to check them out! There were probably only about maybe 6 parking spots and I was lucky enough to find an empty one, not sure if they had other spots available.   When we came in, there were 2 servers and no one said anything for a couple minutes so we decided to just grab a seat. It took them a while to come up to us too and mind you there were only 4 other customers in the restaurant.   We ordered the Tom ka gai, Mu Yang and pad Thai. Wow...  their tom ka gai, (coconut soup) was so good! I always order that in Thai restaurants and theirs is definitely one of the best I've had. My mouth is watering just thinking about it. The flavors are one point. You need it order it no matter what! The pad Thai was good too. Guy Fieri tried the Mu yang (pork skewers) so of course we had to try it! It came with 3 skewers -- They were good, but honestly I've had better bbq pork before.   I would give 4.5 stars for their food, the flavor was amazing! I felt like I had a home cooked meal! But the service really turned me off. She barely refilled my water, barely checked on us. I felt like I waited around for my food to come, and I can see it in the kitchen, waiting for her to serve it to us. Definitely won't be coming back to dine in, but will just order take out for next time.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "VmEy3F4E9EipGAjXsHFzkA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Tom Ka Gai",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VmEy3F4E9EipGAjXsHFzkA/o.jpg"
      },
      {
        "img_id": "hPc2fDowNj9-hivm5IYm5A",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Pad Thai",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hPc2fDowNj9-hivm5IYm5A/o.jpg"
      },
      {
        "img_id": "uNRQ99im7nuk88QeowTyMw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Mu Yang",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uNRQ99im7nuk88QeowTyMw/o.jpg"
      }
    ],
    "user_id": "SxvvrztdHI54Eywr-wo2aw"
  },
  "cm9B5PCoPtttlWWKRMmcQg": {
    "date": "9/3/2016",
    "text": "I give Suh Noi's food taste 4 stars, service 1 star, so 2.5 stars is my rating. I did not like Thai food enough to go to a Thai restaurant.  When I was in Thailand for 6 weeks, I could not eat the Thai food, cos it was too hot and gave me serious diarrhea enough to cause me to lose 12 lbs when I came back to USA.  I had to eat Australian and Italian food in Thailand.    But I went with a Greater Phoenix Ethnic Lunch MeetUp to Suh Noi because people said it was so good, and it was so close to my house (about 3 miles).  I ordered the fried catfish ($13).   It was SOOOOOOO GOOD, I am rather obsessing over it.  People said the lunch special soup was so good.  I wanna go to Suh Noi again to have lunch special which includes the soup.  We had 12 in our MeetUp for lunch party for 1 pm on Thurs.  There were only 2 other occupied tables, one with 2 people, other with 3.  I felt the service was bad, like the reviews said.  They could not serve all of us about the same time.  Some of us got our food 40 min after others got their entrees, and we kept telling the server that we were so hungry, when is our food coming.  Soon Soon.    It's coming!   Of course people in our party were done eating, when others were still waiting for their entrees (me!  I was last person to get my order).    I looked at my watch.  By the time I got my order, I had been sitting in that restaurant for an hour.   Furthermore, I observed that the other tables had already turned over twice, and they came later than we did, and got their food sooner, and then ate and left, before some of us in our party (ME !) even got our food.  Made me \"jealous\", cos I was so hungry.    Also I asked for a dish of lemon wedges (for me to make lemonade) and I think it took 20 min and reminding, to get my lemon wedges, which meant I did not drink my water, cos I was waiting for my lemon wedges.    I think if Suh Noi could have great service, they would be one of those rare 5 star restaurants that I give.    But the fried catfish was SOOOO GOOD and I felt they gave me a lot of fish, too, the portion was generous!    I later went back on another day and ordered the lunch special.  I felt the portion was very small for the price, compared to another new Thai restaurant Thai Long-An.  3 stars for Suh Noi's lunch special.    Parking is very limited, but you can park in horseshoe around the sides and back of the building, even though it says No Parking.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iIlapFJx_ut5_jMtnRBYoQ"
  },
  "Ax69EjqudK8d3zNoi39PBg": {
    "date": "8/27/2016",
    "text": "It is a little strange feeling given the obvious past history of this place as a fast food restaurant however they've done a nice job of making it as intimate as possible given the layout. They darkened up the room with window covers and set tables with tea lights. If they got rid of the TV on the wall and somehow closed off the bar and open kitchen a bit more it would be even more intimate. The drink cooler to the left of the bar brings down the casualness to an incongruous level with the dining room.  We tried the Mu Yuang and the De-Cha Boar and both were delicious although wildly different.  The wild boar was a little chewy and reminded us of a slow stewed very intensely flavored dish with lots of chilis, Asian string beans, onions and sweet peppers. It had a very strong garlic and chili flavor that complemented the boar.  The grilled pork skewers (three) served with the sticky rice and papaya salad was the better of the two dishes. The pork was very tender with strong grill flavor and a delicious green chili spicy dipping sauce that was also slightly sweet and we actually we poured it onto the wild boar dish and it lightened it up quite a bit.  We didn't try to dumplings or noodle dishes but will in the future.   The service was a little scattered from our vantage point at the bar and we probably would not have noticed if we had sat at a table. They do a strong carryout business.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PMhBMIpAH_wf0aAe2OOIFg"
  },
  "NX6fs0b46muTkshsBbBUlg": {
    "date": "7/27/2017",
    "text": "Food is dialed. Their attention to detail and flavor is spectacular. I love visiting this place and always go off of the server's recommendation and it has always been fantastic. My only \"complaint\" is the service, although friendly, can be a bit slow. I guess I need to listen to my mom here, \"Good things take a while\" and this is PLENTY good so it's worth the wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xlSnjFjbh_zxqZi7aKc34w"
  },
  "b4E4LU5M_qKoN_SwmBqx_A": {
    "date": "3/8/2018",
    "text": "The best Thai food I've had in a long time. We ordered the dragon eggz, super soup, gai katchu, and mu yang. The Gai Katchu was my favorite, but everything was great! I don't think you can go wrong.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pEq0v_BRDfQhApcoF2nfMA"
  },
  "rQPv8eXegTbZtAc5oz0XbA": {
    "date": "2/24/2017",
    "text": "The restaurant is hidden on the busy Thomas road. From the outside, it looks more like a fast food joint rather than a sit-down restaurant. In fact, you can order ahead of time and pick up via drive-through. Better though, it also has a few nice seats and tables inside.   The food is authentic and flavorful. We ordered papaya salad, Tom Yum soup (spicy/sour soup with mushrooms and shrimps), Pad See Ew (stir fried noodles), and sticky rice. The shrimps in tom yum soup were big and fresh. The Pad See Ew was on the sweet side, which we are not used to. In some Thai restaurants, we have experienced \"old\" oil in the stir fried noodles. Thaiger doesn't have such a problem and the wide noodles were yummy and well-cooked. The sticky rice was served with coconut sauce on the top, a nice, sweet surprise.   Overall, great food but a bit on the pricey side (given the location and atmosphere).",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "gzZt4lO56JpBl9YoxWRpTw"
  },
  "TqQ28W9HAqAxnwdVolYEIw": {
    "date": "1/14/2018",
    "text": "We ordered the spring rolls and a tofu curry dish. The rolls were good, but the peanut sauce was a runnier and tangier consistency than I'm used to and like. The curry was also more sour than expected. Service was spotty.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m7ulbgBB7Z-0STPpBMiOuw"
  },
  "klLWLNDMHpKKHWYnGs7X1Q": {
    "date": "1/30/2018",
    "text": "After reading all the reviews on Little Tiger, I thought I'd give this Thai Restaurant a shot. Although I was quite disappointed. I ordered the Pad See Ew with beef and it had zero flavor, the Thai Tea tasted nothing like Thai Tea & only had 4 boba balls in my drink.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8xvh8p7WsBM5ZdDKTTOE8w"
  },
  "9SlCYZAkv0qEduG2O1fVfQ": {
    "date": "4/5/2018",
    "text": "I arrived at 1:00 in the afternoon for lunch. 1st thing I notice is their neon \"Open\" sign was not on, I almost didn't stop in.  I informed the server (Tiger tattoo on arm) of such and she giggled and said \"oh I forgot the do that\" but still didn't go turn the sign on.  I Was the only person in the place and ordered the Curry Chicken and requested hot chili sauce on the side. I  Arrived home to find, of course that she had forgotten the hot chili sauce. When I called to complain the server advised I could come back and get it but I hadn't been charged for it so...  Well that wasn't the point, the fact that you can't remember to turn on your own open for business sign or a simple request of chili sauce on the side, speaks volumes of the incompetence of this server.  The food was mediocre at best and I will not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGMrNgIwurOML2mXWmwawQ"
  },
  "kWoh8OtThTM4DqW3MkDASg": {
    "date": "7/18/2017",
    "text": "Checked out all these web sites and decided to try the LIttle Thaiger and oh my God were we surprised and thrilled.  This place is a jewel of a find for Foodies searching out new and exciting venues.  Everything in this place is new and different.  The artwork on the wall is not the same old touristy Thai artifacts but hand painted animes and paintings.  The furniture is white modern with white couches surrounding a smallish TV.  The waitress was a walking anime, half Thai (perfect English) and family.      Wine selection is small but nice, like the restaurant itself.  It is a small place as the name implies, catering to local takeout but with a nice, local crowd.  The food is the best Thai I have ever eaten.  The fresh spring rolls were a meal unto themselves and the Pad Thai has been voted Best in The Valley. Pad Thai was about the only traditional thing on the menu, everything else is new and exciting or twists on the old favorites.  Cannot say enough good things about this place   <a href=\"/redir?url=https%3A%2F%2Fwww.littlethaiger.com&s=f92838aef32e83adfabac14fa64071878120ba5d3005967e40c817bd0f226c9d\" target=\"_blank\" rel=\"nofollow\">littlethaiger.com</a>",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qgqJOQp6wPy3ON1H_cl3Vw"
  },
  "yyJvD0_F_glDi284ARq9Gg": {
    "date": "3/14/2018",
    "text": "Called in a takeout order and was told it would be 15 minutes, showed up 20 minutes later to find out that the lady had forgot about our order. After waiting another 15 minutes for our food, there were literally 2 pieces of shrimp in my shrimp fried rice. Food was good, everything else sucked.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EFkjDadTiaYddpU_GpXCZQ"
  },
  "fUsTTeJXpCbmguBUSgHOTQ": {
    "date": "6/21/2016",
    "text": "Guys, can we please talk about this place? If you've ever had the pleasure of eating at Wild Thaiger in Downtown Phoenix, you'll be familiar with the deliciousness being served at Suh Noi The Little Thaiger; same chef/owner, same menu. This place is proof that great things come in small packages. Everything is delicious. I want to write this review in all caps because I feel like screaming it from the rooftops! This chef/owner knows Thai cuisine like the back of her hand, and she uses all the glorious flavors of Thailand and whips them into something incredibly tasty and beautiful! She truly is an artist.   I always (always) order a Freshie Roll and Dragon eggs (served steamed or crispy). These appetizers are my absolute favorites and I refuse to go without them!   My favorite entrees are the Mu Yang (marinated pork skewers served with sticky rice & papaya salad), the Peanut Passion (chicken breast smothered in Thai peanut sauce, served with a flavorful veggie medley and jasmine rice) and the Pad Sie Ew (fat egg noodle, pork or chicken, stir fried veggies in a sweet soy).   I'll stop rambling, but do yourself a major favor and go. The service is always friendly and accommodating and the food has never once disappointed me. I bring all my favorite people here for a reason.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pBREvLKyDkPhVK_W4hd6bg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Beef Waterfall Salad. So fresh, so tasty!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pBREvLKyDkPhVK_W4hd6bg/o.jpg"
      }
    ],
    "user_id": "G1gzie5ZWT22V1-McTW2Tw"
  },
  "FViSYh2dBkYbd2iMRrm3Fw": {
    "date": "8/3/2018",
    "text": "Their food is literally so bomb, have you tried their pad Thai, dragon eggs, or mango sticky rice? Well you should - they're amazing and my personal faves. On top of their food being balls to the walls, all their waitresses are super cute and friendly. The owners are really nice and it's a quality Phoenix based family business. This location is conveniently located in Scottsdale(nice when you don't want to go downtown) and has a cute anime theme.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9mjRd9lORxBPzT0r747uOQ"
  },
  "xeSpGguxRlBbsYVMh9VI6A": {
    "date": "11/15/2015",
    "text": "This place is tiny and a tiny patio too!  It was too cold to sit outside, so inside it was!  I ordered a Thai ice tea.  YUM, and it was a big cup compared to other Thai places.  I got the peanut butter chicken.  Really good!  Love the vibe and service here!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "JH2XJ39Fch2YIsMqymH97g",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Pad see wei",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JH2XJ39Fch2YIsMqymH97g/o.jpg"
      },
      {
        "img_id": "1yr3WKTct1yoXoRVx7sRxg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Pad thai",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1yr3WKTct1yoXoRVx7sRxg/o.jpg"
      },
      {
        "img_id": "bM61lLChoc5_5x2gyWXu4Q",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Peanut butter sauce with chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bM61lLChoc5_5x2gyWXu4Q/o.jpg"
      }
    ],
    "user_id": "iDlkZO2iILS8Jwfdy7DP9A"
  },
  "x9tPg2i6ZThXEJ7PrnKUOg": {
    "date": "12/29/2016",
    "text": "UPDATE: Came here tonight and got the corn fritters and Mu Yang! Both are total gems! The corn fritters are TO DIE FOR!  Such an interesting little spot! The ambiance is pretty casual, with a few TVs running and anime decor everywhere. However, you are served by a waitress, and the food is so good you'd think you're somewhere much fancier!   I got the peanut passion, which is chicken with veggies and peanut sauce. It was so yummy, perfect with a Thai iced tea. A few of my friends got the pad Thai and said it was awesome. I want to come back to try a hot pot, too. Everything is really reasonably priced.   They have a little drive up window, which you can use by calling ahead and then driving-thru to pick it up.   Definitely want to come back here, and soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMr9mqpjgpiORbGLT70kRA"
  },
  "HhbP__x_QVEZr-iiFLjsPA": {
    "date": "11/24/2017",
    "text": "Love this place! I've been there twice in the past month and thoroughly enjoyed it! Gotta love the Dragon Eggs. I'm so glad there's a decent Thai place in my neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7uTtHa2V9Ds9yyAy3-PIhQ"
  },
  "X9HxhdM5_0rOG0elDn6FuA": {
    "date": "1/19/2018",
    "text": "Love their food!! But on a Friday night, to sit at the pickup window for a full 20 minutes being ignored because only one server is working (she was clearly stressed) and then find out they didn't even make the food at all is annoying. I saw three patio tables get up and leave. They need to staff better. But the food is very tasty and I'll keep coming back - just at non-peak dinner hours!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3KMoEP0nle-JIO6Efqx3Tg"
  },
  "7kJFAtmgwYDgxkmOq8yKHQ": {
    "date": "4/18/2017",
    "text": "This is such a great Thai place! I get Thai food once a week, and this is one of my favorites. I love this little place. It is affordable compared to other Thai restaurants in Scottsdale & they have lunch specials. You can order for pick up and go through  a drive through window which is great for a rushed lunch hour. I love the Yellow Curry with Tofu and Veggies. I am a vegetarian and finding well made tofu is hard and this place does it perfect! If you want something a little sweeter try the Coconut sticky rice with a meal- it is amazing. The staff is so kind and they really want to make sure you enjoy your meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "egzA9JSQH3lQSS_k3l8bUQ"
  },
  "EEIXfu1x7a-awXr2QScrKQ": {
    "date": "4/11/2016",
    "text": "Went here last night for the first time as I was given gift certificates over Christmas. Had the  Tom Ka Gai, a chicken coconut soup, it was fantastic, the best I've had, probably tried it at over 50 places. Had the chicken pad Thai, was in the top few that I've had. The Catfish Prigking was ok, nothing special. My friend had the Seafood Panang and as a chef he thought it was excellent. The ambience is nice and relaxing, love the led flower  blossom trees. It's not to large inside, they have a patio as well. Staff was friendly and welcoming. This is now tied with SumoMaya as my two favorite restaurants in Arizona, if you have been to SumoMaya for me to compare this place you know you have to come try it now, you'll be happy you did!  *the next day* Just had the left over Catfish by it self and it was great! So Much better then it being OK like I thought it was yesterday. I think I first found it to be just OK yesterday is cause I was eating it at the same time as the epically fantastic dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LVdTChdUB5lPHUFAhhNDWw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Love the atmosphere inside and outside the restaurant.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LVdTChdUB5lPHUFAhhNDWw/o.jpg"
      }
    ],
    "user_id": "_HyYOvfol-pvYCqIihQDVg"
  },
  "tN_vfuS4LOYDnfxOmBF9cw": {
    "date": "4/16/2015",
    "text": "Nice little Thai place in South Scottsdale. Food was excellent, we ordered our food pretty quickly, but it took a little longer than expected for the food to come out even though we were the only table there.  I ordered a tall glass of their Thai Iced Tea. It was good just as expected. For the meal I ordered Mu Yang, which comes with 3 pork skewers , sticky rice and  a nice helping of papaya salad to help balance out the richness of the meal. The dish was great. A perfect combination of sweet, sour and savory all in one dish. The sticky rice was like a dessert in itself.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wy_huypZZxeFVN6otwodIg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wy_huypZZxeFVN6otwodIg/o.jpg"
      }
    ],
    "user_id": "Npim4I7cjLhnbgX8qt46jg"
  },
  "P4wBVhisjXlMVCIeQKQmMw": {
    "date": "3/30/2017",
    "text": "This place is amazing!!!  Try the Chicken Pad See Ew.  Everyone is very friendly and they have a great bar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4NRkoQ-IFbAuN1PpuUlc6g"
  },
  "Vp1Nrp5CXSr1lnGGWAkYtg": {
    "date": "3/23/2016",
    "text": "First time there, got the chicken pad Thai plus broccoli. My plate was half cabbage and carrot garnish, the rest included a ball of dry noodles 4 bits of chicken and 4 pcs of broccoli. Thought maybe it would at least taste good, but nope, next to no flavor. Go to Sa Bei or Thai Lahna. Oh, and this was $14. Maybe just a one time thing, bad luck.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UN_jkAqCyMJ9t08Kxgu2Eg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Chicken Pad Thai, terrible",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UN_jkAqCyMJ9t08Kxgu2Eg/o.jpg"
      }
    ],
    "user_id": "MYqLgt90f5LQ5tftQZ6AnQ"
  },
  "J_3wgeVViRbYBdNiq8QCwQ": {
    "date": "2/19/2015",
    "text": "Drove right past it. It is worth finding. Meat was good quality and the flavors were great. Only thing I would change is give me a choice of how spicy. It was good for my wife but i like it a little lower on the heat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bzsEvxSjp-fuA8dK3DsoOA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bzsEvxSjp-fuA8dK3DsoOA/o.jpg"
      }
    ],
    "user_id": "p9t2svOHpERBWh2asy3lWg"
  },
  "em4ABKM_-wQWYcRFdadnaA": {
    "date": "7/13/2015",
    "text": "Found this place driving from a cafe in Scottsdale. The inside is decorated with anime art. Food took a bit but was worth the wait. Delicious pad thai garnished with beets, bean sprouts and peanuts. One of the better pad thais I've had.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lEyIvNrW9Hgxh0qTtSaI1Q",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Chicken pad thai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lEyIvNrW9Hgxh0qTtSaI1Q/o.jpg"
      }
    ],
    "user_id": "iBjrKHlo25WqV1ygArH2vQ"
  },
  "f5I3949CriPu4AJUxdwumg": {
    "date": "4/10/2015",
    "text": "I usually get the chicken pad Thai. I am a big fan! However the quality can fluctuate. I've had it a few times and it's been awesome and other times it's been not so great. I keep coming back so that says something! When it's good , it's SO good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7Jn_5ly2uijtJYzWnTkSCg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Oh hello panda",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7Jn_5ly2uijtJYzWnTkSCg/o.jpg"
      },
      {
        "img_id": "Il1luawJDMTI_O5vt5vnJA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Fun cupcakes!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Il1luawJDMTI_O5vt5vnJA/o.jpg"
      },
      {
        "img_id": "yh37ircrEMksY7dhNgzyVA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. They heart you!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yh37ircrEMksY7dhNgzyVA/o.jpg"
      }
    ],
    "user_id": "1cs9_Fdja_i9GFj8Q7Z9vw"
  },
  "1V0KC5fDbckLDQsH5xMezg": {
    "date": "1/3/2017",
    "text": "Loved the steam dragon eggs as was as the peanut chicken. Everyone of us enjoyed our meals. Definitely going to be a repeat customer",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SL43wa3yejcN0kupOjmoJA"
  },
  "PeHwJ5is5VfjOYQ__RiRtg": {
    "date": "12/17/2014",
    "text": "Great local Asian food in old town that doesn't cost a ton and has great portions for price!   Staff was very friendly and accommodating! Try the candy chicken bowl w jasmine rice! It has a lot of chicken and just the right amount of sauce!   I will definitely be returning and trying the coconut water...in a coconut!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "DjsYSGsbnT_6R_8oc89WqA"
  },
  "L1lFBZfbYy8A0oXOIr_FjA": {
    "date": "2/12/2017",
    "text": "After seeing several good reviews on this establishment we decided to try The Little Thaiger. The parking lot was extremely small, and it was difficult to determine whether we could park along the sides of the business that have red painted curbs indicative of a fire lane. The inside of the facility was nice. The waitstaff was very attentive to us, and provided good service.  We had Dragon Eggz for an appetizer, and they were OK at best. I had two of these dumplings. One was good, but the other was terrible because of several crunchy pieces in there (gristle, shells, or something else?).   The papaya salad was also ordered for the table. The response on this item was that it was lacking flavor. I did not have any of this item.  For the entrees our table ordered fresh rolls, 24k, and the tropical fried rice. The fresh rolls were bland, with dry chicken and shrimp in there. I received no feedback regarding the 24k. I had the tropical fried rice, which was bland. I expected more flavor from this dish, but there was not much pineapple in the dish. I paired the rice dish with pork, which was extremely dry. I found the dish to be rather forgettable, and could only eat half of it.  One very odd item of note at this establishment was what was playing on the televisions. On the TV above the bar the movie Finding Dory was playing. On another wall was a series of videos from YouTube that were supposed to, I guess, highlight videos from Thailand. If you are familiar with YouTube you know that once a video ends a suggested video starts playing afterwards based on the previous video. When we where there the videos that were playing were showing \"working girls\" (prostitutes) on the bangkok 112 channel. For about 30 minutes straight there were these videos playing before it stopped playing. I would suggest that this establishment be more vigilant in what is playing on these monitors.  I do not recommend this restaurant, and I will not go back to this restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8HKFE0Uet_AB_nMtf9oW6w"
  },
  "fYgoTAIKUExwNGg3Oz_htA": {
    "date": "7/6/2016",
    "text": "Food is delicious, but we've been here almost two hours and I'm still waiting on my entree. They close in 30 minutes... Hope I have time to eat it before they close and kick me out. DDD... They're right... Food is great! If you're a dine-in as opposed to take-out, don't plan on a time effective meal. Everyone got their food before me. Mine showed up after everyone else finished. Now I'm awkwardly waiting for my food to cool down while everyone stairs at me with begging eyes to eat faster so we can go home to bed. So awkward. So disappointing.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7W0ck0z7iwUydHrQmKFsxQ"
  },
  "Xjm4sIdEMdDAw7N9L1Qyaw": {
    "date": "12/8/2016",
    "text": "After reading the reviews on yelp I was really excited to try this place out. I have to say it was a let down. They use extra spice to make up for what they lack in flavor. The only reason I may go back is because it's the only decent Thai game in town.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MTAcFY_iyBrP4-rBx4T1kg"
  },
  "jeHXJLYPbj3hqFK7asKbkQ": {
    "date": "10/5/2017",
    "text": "This place is my go to for Thai food in the area. Best pad Thai I've had anywhere near here. Phone orders are quick and they have always had my order correct when I pick it up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T7PTcS27_H4v-XI9Icvh2g"
  },
  "bWXSY1aNjefdli9tM2Sg3Q": {
    "date": "1/10/2017",
    "text": "First time eating in. Pad Thai ordered \"hot.\" It was fantastic. Loved it. I'll try \"Thai\" hot next time. Service was great. Staff is super friendly. Dining room is quaint and eclectic. We love that they're in the neighborhood. This could become a habit. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rpfUywwhFKM8D5IznrBfXA"
  },
  "IyDF5jYYr9CkDIbqs3gCBw": {
    "date": "8/15/2016",
    "text": "Found it on Yelp... Usually get Thai from a different Old Town Scottsdale restaurant. Glad I tried this. I read reviews and since I was ordering takeout, the drive through window for pick up got me to choose here.  Everything was excellent. The soup,  pad Thai, pork sticks, GF items, the chicken tender... And nothing was very spicy despite how it sounded on the menu. Some who wanted more spice added it. It worked out perfectly. Will def eat here again.  While sitting at the drive through, couldn't help but notice how cute the place is, and the patio looked great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVFNhMV6jf_DAtG-rcm0wg"
  },
  "TDcbLzmsqrA283zCRha2aw": {
    "date": "4/3/2016",
    "text": "I saw the original The Wild Thaiger on Diners Drive Ins and Dive......the little Thaiger was closer to our house so we gave it a try.  OMG the food is amazing!!!!!!  We split Dragon Eggz, Chicken Pad Thai and egg rolls.  This location is small and sooooo cute.  Service was excellent.  In reading the other reviews about slow services yes I could see it getting a little slow to get your food, but keep in mind they make everything to order.  Nothing was sitting around getting cold and old like a lot of restaurants.  My husband even commented this will be his new place to take customers for lunch.  We went for lunch and were very tempted to go back for dinner.  There is also a drive in window that you can call ahead and pick your food up.  Wish I could give more than 5 stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IrLzDNWS02zdw8Bys6BWlg"
  },
  "EzPB613Ir55l-y2DyZlELA": {
    "date": "3/5/2016",
    "text": "This place is a gem. I'm always looking for good Thai food and this is some of the best in the area for the price you pay. Cute and clean decor, presentation of the food was traditional and on point, friendly service and most importantly quality food. Overall you'll be hard pressed to find something of similar quality at this price point when it comes to any Asian cuisine in the Scottsdale area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "YR7ldnNJCzEG9DQVGvXLYA"
  },
  "QQjWP4JcYb_mHyoFKSFFbg": {
    "date": "2/7/2015",
    "text": "The location of this restaurant was a bit tricky as I almost went past it. I thought the interior decor was quite interesting and was not expecting Anime posters here. As for the Thai food it was decent and the service is fairly casual and easy going.  I asked the person at the front for recommendations and decided to try the Yellow Curry rice bowl. The food was about what I expected and although I knew that it was going to be mild spicy it was actually more spicy than expected. The mild spicy seemed more like a borderline medium, which is probably what I preferred anyway.  I also noticed that this restaurant features a drive thru, something that most Thai restaurants do not offer. Based on this I would most likely come back here to try some of their other dishes especially as the Basil Chicken looks pretty good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4suJsf9Q2uruOwKlnBixow"
  },
  "hfM3DUOk5JeI2cPjCbpIpQ": {
    "date": "5/26/2016",
    "text": "This little hidden gem is so cute, found out about it on Yelp and the name and the interior is what drew me to Suh Noi! I guess this place was featured on the food network show Diners and drive- Thrus? Or something like that I am not sure. But it's interior is way different inside its like a nice hip lounge nice lighting and view of the patio and drive thru! You can sit at a table of 4 or or 2 or even at the bar for a nice drink special. You sit yourself, when I went only one waiter at the time but I came after a lunch special rush so I didn't get any special lunch meals since I missed out! I always order pad Thai and a appetizer so I got papaya salad and the pad Thai with chicken l, didn't usually get asked how hot I wanted it but I asked for it to be Thai hot to see how authentic it really was! To my surprise papaya salad was good very sweet but a bit of spice which I like very delicious. Next was the pad Thai with chicken.. Now everything looked so delicious I love the cooks aesthetic for her plates so good to eat and look at I like that! I can definitely tell it was gonna be hot they used thai chili peppers on my dish and it was spicy every bite I did enjoy it! But let's just say Thai hot is really, really hot! Now watch out! But luckily I washed it down with my green tea which was delicious as well! Definitely love the fun anime background murals and cute deco the bar area has! Service was delightful and the chefs/cooks are awesome definitely found a new Thai space here in south Scottsdale!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n6tW-_XjF42xU-sLiJRvUg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. 6.95 Papaya Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n6tW-_XjF42xU-sLiJRvUg/o.jpg"
      },
      {
        "img_id": "wV4PsyM1Bg7HiAoaWxdDQA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. (11.95) Delicious Pad Thai Chicken.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wV4PsyM1Bg7HiAoaWxdDQA/o.jpg"
      }
    ],
    "user_id": "PL3DlMTkqrC_TwDsUhNzwg"
  },
  "tp6FojG1-igTn6A_h7dfRw": {
    "date": "8/25/2018",
    "text": "Not a fan of Phoenix, but this place made it worth awhile! Those dragon eggs are probably the most memorable thing I will remember in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Sye0tvHPANH2UITsvp5Tgw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. 24K",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Sye0tvHPANH2UITsvp5Tgw/o.jpg"
      },
      {
        "img_id": "QnYtKsvu9CjWf64y29BrLw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Grapao",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QnYtKsvu9CjWf64y29BrLw/o.jpg"
      }
    ],
    "user_id": "w1qAfW5HrWT1BJEJPkO4IA"
  },
  "bzh6Et4B4JHMly3NMc8Nzw": {
    "date": "10/24/2018",
    "text": "Took my wife here for her birthday dinner. We previously went to a cooking class here a few years ago and loved it. It wasn't busy on midweek day, lots of takeout orders  Pros: Food was great, beautiful presentation.   Cons: Service was terrible. They offered a high chair for our baby then did nothing. After a few minutes my wife found the high chairs in the back and brought it to our table. My wife asked for a straw, server again failed this simple task. 10 minutes later, I went up and grabbed one from the takeout counter.The server barely checked on us, there was one other couple in there, no reason they couldn't stop by to refill water.   If we do go here again it will strictly take out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tsj5tk3Gg5C55DzicIXFpg"
  },
  "rcGgsw8t2dbvd9Zr3t2qdQ": {
    "date": "4/20/2017",
    "text": "This is a cute little restaurant on Thomas! It's right near old town but kind of hard to see due to the trees. I've been here twice and I have missed the turn the first time and almost again.   The food has been great here! Just service has been iffy for me which makes me give one less star.  I came here for dinner time the first time and I had the peanut passion with brown rice. When they asked me between the type of rice I wanted, I chose brown which they did not state it was an extra cost.  Also there was a large party there and as I was eating by myself, they only came up to me once. My water wasn't filled either.. I felt ignored and that if I were to ever go again, I would just order for pick up. But I guess the service is a hit or miss. This was a few months back.  I came here about 2 weeks ago with a friend because she's seen it and wanted to try it so we came for dinner. We got the dragon eggs which is like shumai. Tasty!  I also had the beef panang and man it was spicy for a 2 chili pepper. I can't imagine if it was a 3 chili pepper rating meal.. It was delicious though :)  The service was better and we actually got checked up on a couple of times.  Not ignored like the last time..   So overall, great food that even Guy Fieri gave them props.  Just service can be a hit or miss depending on your server I'm guessing.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3ibj_Y4yy7OgVbfEjKTVTQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Beef panang. Very spicy for two chili peppers!  Pad Thai chicken was in the back.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3ibj_Y4yy7OgVbfEjKTVTQ/o.jpg"
      },
      {
        "img_id": "3cfqvISt_zP7sTHOXyu0sw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Dragon Eggs crispy and steamed. Gave us 3 of each :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3cfqvISt_zP7sTHOXyu0sw/o.jpg"
      }
    ],
    "user_id": "DRCfEuwaf0k3p_IG7ApKpA"
  },
  "2xFvaedMw6sjlYIkYxeYqA": {
    "date": "3/2/2019",
    "text": "I have eaten here plenty of times in the past without issues, but today my order included a mango cheesecake and the cheesecake had two thick black hairs in the bottom crust. Absolutely disgusting and I will no longer be eating here again. Threw away the cheesecake and didn't even want to finish the other food I ordered.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eaTZ3ZRMyVn-wdE6R6rvUw"
  },
  "SwZ5KGodLaVlnqeYA7vibA": {
    "date": "9/24/2018",
    "text": "Fantastic Thai takeout spot. I especially enjoy the spring rolls & curry, but I haven't had a bad dish here.  Definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvHDk29CBNBm3f1Aueo4Tw"
  },
  "a_GPJXyPAy4iJCpYLfizbg": {
    "date": "12/18/2016",
    "text": "Pretty good for Arizona Thai food. Had a few dishes to go. Food was fresh and tasty but just not as good as it is in other cities. This is a sister restaurant of there one in Central Phoenix. Friendly fast helpful service. I would give them 3.5 Stars I wonder when Yelp will wake up and realize there is more than complete Stars. Even when they put their reviews together you get half Stars so why not let us at least have that or even down to the quarter of a star. #wakeupyelp",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gh2NDyUK8m9OdL7bPgaOug",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Chicken shrimp and clear glass noodle soup with vegetables",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gh2NDyUK8m9OdL7bPgaOug/o.jpg"
      },
      {
        "img_id": "_sgDdtbc8XfRsES_36sC5g",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Pork skewers with papaya salad and sticky rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_sgDdtbc8XfRsES_36sC5g/o.jpg"
      },
      {
        "img_id": "-yTlCgCbO46r511jSseLPg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Beef Pad See Yu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-yTlCgCbO46r511jSseLPg/o.jpg"
      }
    ],
    "user_id": "KxGeqg5ccByhaZfQRI4Nnw"
  },
  "Z8CEDInyn1dJgqWVw_6zRQ": {
    "date": "8/12/2018",
    "text": "We used online ordering and I wanted it for Friday night. When I got the confirmation email it said for Saturday. I called the restaurant and they acknowledged issues with their ordering provider. Then when we finally got our food, it was not to expectation. What was called spicy was barely spicy. The Pad Thai was dry. We had hopes of amazing food due to this being a DDD restaurant but there was nothing memorable. They even charged 50 cents for a few scoops of chili paste that wasn't spicy. Back to La's we go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4YtBCyPeejwtQ2h6hvgC9w"
  },
  "zUu77KpVLl4yF40lFnQOGw": {
    "date": "2/21/2019",
    "text": "Excellent service, ordered The Fat One noodles with beef and was very pleased along with very nice Thai coffee, would come back anytime to try other options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PHqDcxJAWxB4P-SPhQNa8g"
  },
  "O2_nUUCaRl5UNb2C8D_fMA": {
    "date": "9/24/2017",
    "text": "I love this place! I have came on lunch a ton of times. I oringally found this place on yelp. I always get the dragon eggs for an app half and half . I do highly recommend beef and broccoli. The Thai ice tea is also good.   Whenever I have came on lunch I can usually get in and out within 45 minutes expect on Fridays. Friday's tends to take a bit longer then usually with how busy they are. The food is always good. I have been there at least 15 times this year. Strongly recommend.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "DRlUwi4ENwjklKpX3TwokA"
  },
  "gKJ766TZDBkX-kstFmSVxQ": {
    "date": "5/31/2018",
    "text": "Very delicious Chicken rolls and Chicken pad Thai very nice place great food and service. It's a great place despite the fact that guy ferriiere likes it. The poster of that moron on the door is the only thing bad about this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vveNP5ij6MewvqeCoGt0Cw"
  },
  "6xuQd32sWwCp6UrXLOhbyQ": {
    "date": "1/25/2018",
    "text": "Cumin at you HOT! I am in the area for work and stopped in for some spice. The leeetle Thaiger did not disappoint! Service was great, atmosphere was calm and welcoming. I liked the artwork and anime, fun! Food came out as works of art, flavorful and balanced. I didn't need to clean out my sinuses today with heat so I stayed in the medium, medium hot range today. (I know, risk taker!) has the dragon eggs and chicken pad Thai and the iced green tea. Affordable lunch place. I'd cumin again if work was in the area. (See what I did there?)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sdde6Zqho4Qnv_cnW3gohw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Diversity of Spices IS LIFE",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sdde6Zqho4Qnv_cnW3gohw/o.jpg"
      },
      {
        "img_id": "J6shDKiH-QG34E4OxcZQ1g",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Diversity of spices IS Life!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J6shDKiH-QG34E4OxcZQ1g/o.jpg"
      }
    ],
    "user_id": "gCJUEgGzU3lmp07L4Ww4fA"
  },
  "eLKYVRn6M_3BSI1VfcfHzQ": {
    "date": "6/11/2018",
    "text": "I have brought so many people to this sweet spot who also become addicted to their fresh and delicious food! I love their curry dish. But also savor their half rack of Asian ribs that comes with steamed vegetables and rice. Their ambiance is relaxing. I love the music that they play -- not too loud and over powering.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QnW2x8E8AgwK3EQq8Q_6yA"
  },
  "R_22K5BFtwRkeMtxt2AyUg": {
    "date": "7/13/2018",
    "text": "Stopped by for lunch..chicken pad Thai and dragon eggs for appetizer were excellent. Great little place and fast service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DbE1kUZreQAtsdNccV34ag"
  },
  "cVHTCQ8f8uPUqaZ0a5qKNg": {
    "date": "2/10/2018",
    "text": "Stopped in with my hubby. The small outdoor patio caught our eye and we're always looking for a new Thai spot. OMG this was good!!   We both got a combo. Hubby got the peanut chicken which was out of this world good. I got the Panang curry, swapping out the beef for chicken. I love hot spicy Thai food and this did not disappoint. I usually need to add a good helping of red chili pepper sauce to get the heat to my liking, this came out perfect! Love the soup that comes with the combo-very good!!  Service was perfect, food came out very quickly.   We will definitely be back, and are already making plans to visit the parent restaurant, The Wild Thaiger, in the very near future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eM2tV8OOaxZHQ-KCIPufDw"
  },
  "6q6UnrcNVLkokNxcDOF41g": {
    "date": "2/17/2018",
    "text": "The Service is awful..do not go there expecting the service of a caring restaurant. It's only a take out restaurant with no concern for the folks actually eating in the restaurant. I can't comment on the food because it's been close to forty five minutes and still haven't been served.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OA1SUIsz_zNOyhixqwbYmg"
  },
  "KtTM4rvtl65RZkU-4MMfFw": {
    "date": "4/10/2018",
    "text": "Amazing Penang Beef and a cool little atmosphere! Very small place the food is right on par with the larger version. Friendly servers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QURuwUr6U4nzpBnebUJGGA"
  },
  "k-E8kaRub6xH52cvBAQwuA": {
    "date": "9/22/2017",
    "text": "I stopped in for lunch today and was, once again, amazed at the flavor and presentation of my meal. The salmon salad was perfect and the crab appetizer was delicious. I've been coming here for a couple of years and it looks like the the secret has spread; the Little Thaiger is a treasure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y8Kp0PxzzaHIvhP_rLsFLg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. This place is awesome!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y8Kp0PxzzaHIvhP_rLsFLg/o.jpg"
      },
      {
        "img_id": "FHjGtKfp_LB35VdqGkweug",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FHjGtKfp_LB35VdqGkweug/o.jpg"
      }
    ],
    "user_id": "HMDNN6ALVVUZgbyU0N1oqQ"
  },
  "St4aDwfDovHfpvBV-29Swg": {
    "date": "9/13/2017",
    "text": "I really like the food and decor here.  I thought the anime theme was pretty neat too, but they're trying to move away from it-- which I guess I can understand.  It seemed to irk pretentious half wits like Ken G below.  Ease up and enjoy the food next time, Kenny.  I'd definitely recommend giving this place a try if you haven't already!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B9eX0M5lRgf-z0qVcmfPtw"
  },
  "gaW2aDkMbvUI5BDqwMMuXw": {
    "date": "6/16/2018",
    "text": "OH EM GEE!  This is the best Thai food EVER!  Had the Peanut Passion and the Mu Yang--totally amazing!  Paired the peanut passion with a cucumber martini...PERFECTION!  The staff is super kind and the restaurant is very clean!  It is a small little hidden gem that EVERYONE should come to!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c5xZNg877f9DH4ZkouA8IA"
  },
  "mNe3T3zxhTC083hcfXE-nQ": {
    "date": "9/30/2018",
    "text": "This was the worst dining experience ever! We were seated and then we waited for about 10 minutes for menus. There were 5 other couples seated in the restaurant at this time. The waiter was focused on bringing out checks one by one to 3 other tables. After we got the menus we waited another 15 minutes to order our food. Again, the waiter was moving around taking care of non-essential things like inefficiently cleaning a table or two with multiple trips to the kitchen to clear it off. He also would stick his fingers in the glasses to bring them to the kitchen, was seen running his fingers through his hair multiple times and then bringing food to the tables without washing his hands. We waited 50 minutes from the time we walked in until the food made it to our table. The number of tables in the restaurant and the takeout biz did not warrant this wait. When we were finished we had to ask for the check...... and wait and wait again. We had two checks for the table and he got that wrong too. The food was delicious but definitely not worth going through that experience again. Plenty of other great Thai restaurants in Phoenix.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lZq4yJbBv2DXCL0vsDFveQ"
  },
  "yATjiWf3oT83XNDIaXOEoQ": {
    "date": "2/18/2016",
    "text": "The Thai tea was great.  The two dishes we ordered had a strong taste of fish.  Unfortunately, we ordered beef.  We returned our uneaten food and would have loved to have it replaced, but instead we received a bill.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MnDZQPVUwe9K9pD4IhRoxQ"
  },
  "RefFkcKiHzdbMowyyUus3w": {
    "date": "2/16/2016",
    "text": "Very good food.  Really like the soups and the innovative pad thai using papaya instead of noodles.  Dragon eggs appetizer is also awesome.  Nice portions.  Cute decor.  Very nice staff, but the service is quite slow, and unapologetic about it.  It can take 30-45  minutes for the order to arrive, and no one checks in with you or talks to you during the wait.  You just wait.  Perhaps we can order in advance and eat-in instead of taking out because it is quite a pleasant place to sit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RGURDN7B0hPzzSzLY4Xkyg"
  },
  "pUQEQsmXIktRsf5V71P0aA": {
    "date": "2/15/2016",
    "text": "Lovely - everyone in our party of 6 was impressed. Our food was tasty, attractively presented, hot, and of good quantity.  Small and informal but very nicely decorated in a modern, classy way. I hesitated to write a review because I'm afraid business will get so good that we won't be able to drop in!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5uXQ_K3NMaFHzVJ_4FWF2g"
  },
  "oPBE0s16bFFIcs2WJeUXQQ": {
    "date": "1/13/2015",
    "text": "We went here for lunch with a Groupon.  EXCELLENT FOOD!! We had Candy Chicken with jasmine rice and Chicken Curry with brown rice as well as the Ton Ka Gai soup.  They were all so delicious!!  The portion sizes are substantial.  The only difficult thing about the location is that you have to enter from Thomas going westbound (a median prohibits from entering going eastbound).  I can't wait to go back and try some of the other items on the menu!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZAwsN-jV2DO0REqsAfAibg"
  },
  "lC3M371er6cT282d9y2TpA": {
    "date": "11/28/2015",
    "text": "The food is amazing . The staff is crazy on point . However -- tonight tried calling 5 times all within an hour and they won't take orders to go . \" we are to busy\" regardless still made the trip here for some favorite dishes. Just very odd . Wonder how many they turned away not answering ?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sqlrnnduQTaI2aLQs3EmWA"
  },
  "QmOk_sgJh__x030-WD9AHQ": {
    "date": "1/28/2015",
    "text": "I was so excited to see this restaurant pop up in this spot, so I could not wait to give it a try. Today was that day! We ordered the Yellow Curry Rice bowl with chicken, the Kama Ramen, an boba Thai Iced tea. My dish was the ramen and I was very underwhelmed. The noodles were not traditional ramen noodles and the broth was ok ,  but improved when I added salt. If you are a Ramen fanatic, don't waste your taste buds on this. My sister had the Curry. It had really good flavor and some spice to it. There was plenty of chicken and  a nice amount of chunky veggies. Our boba teas were disappointing. They did not have the flavors we initially wanted. When they came, the bobas were not cooked enough and some were crunchy. Besides that, the flavor of the teas were good. Another bonus is that they have a drive-thru,  which is a great option if you have a baby in the car like me.   I may give this place another shot, but I'm not hurrying back anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Q6IMr3hkYuKV02VrhXWLA"
  },
  "jvNYPeTCOdfkSbdW_JBMkQ": {
    "date": "6/30/2015",
    "text": "Lovely place. We had a wonderful lunch. We tried wild tiger a few days ago and liked enough to try the other location a few days later. Dragon eggs are the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PJtEKlCVm2OT5w8aNiQbzw"
  },
  "Ug9s3gL_RZOuz8kxkN0-FA": {
    "date": "2/19/2015",
    "text": "This is such a cute place with great prices! Everything is very clean and well decorated, and the employees are always extremely gracious. Their Thai burger is a must try-- be warned though, the hot sauce on it IS spicy, so maybe get it on the side your first time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EEAdHXsDcN4hRtMysXUddg"
  },
  "7l3OZZk3gXSUzvJ4JUuzqg": {
    "date": "12/3/2014",
    "text": "They have drive thru and are fairly quick for cooking pad Thai! Definitely recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pdg1RlXZ2gHtNArDJcO9Pg"
  },
  "VFZM-uMtrbA5yyoERIdJQw": {
    "date": "5/27/2015",
    "text": "Came in for a late lunch, the server was super friendly and suggested great items, the menu is small but has a lot of selection. We had Thai Tea which was so good along with papaya salad, pad Thai w/ chicken, and chicken curry. Everything was really flavorful and better than other locations down the way. Definitely would recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G7UV3tnsxHIfsL2SL4x_IQ"
  },
  "dYcG3OwnisktsoKWHfnKeQ": {
    "date": "2/6/2015",
    "text": "I will start by saying that tonight was my 3rd time here in the last 2 weeks. I have tried several different items and so far they have all been great! My first visit I wasn't really in the mood for curry, so I went with the Candied chicken which is lightly coated in a plum sauce that is really good. On my next visit I had the yellow curry with chicken which spicy, but not too spicy, and a creamy coconut sauce which is really tasty. However my favorite part of the curry dish was the potatoes! I also ordered the Thaiferno burger as I was curious what it was like. The burger was very juicy and had some sort of herbs and seasoning cooked into it which made it very flavorful. It was too with cheese, veggies and some sort of spicy sauce that was a little different for a burger, but still good. Tonight, on my 3rd visit, I went for the Peanut Chicken combo with vegetables and the tropical chicken fried rice. The peanut chicken was awesome and is so far my favorite dish I've tried here. The peanut sauce is really tasty with the jasmine rice and it also came with a mix of cauliflower, broccoli, potatoes carrots and more. Definitely my favorite. I had originally ordered the tropical fried rice with beef, but when I got home I noticed they made it with chicken. I wasn't upset about this as the chicken was really good and now I just have another reason to go back for the beef! I also ordered a slice of mango cheesecake that i have yet to try, but it looks amazing! The green tea is great too as it has a plum taste, I think it might be Arizona brand? Oh and if you plan to order anything more than a rice bowl or curry, call your order in if you want to use the drive through as it can get busy here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "e8kk5POJLeKrTXO8sUU4SA"
  },
  "eIdeimV8h-p8QxrMoVfmHQ": {
    "date": "11/13/2018",
    "text": "Good vegan options!  I loved what I had!  They can make a vegan thai iced tea and that's amazing!  I shall return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3m-OTH7GTH-joVx4ZO5gbA"
  },
  "HiBuakIwz6FO3PhQSTzKnA": {
    "date": "10/3/2018",
    "text": "Wowzer! This place is awesome! I've been driving past here for over a year. I never went in because it looks like an old fast food restaurant. Having said that, it is cute outside. I finally went after a recommendation by a neighbor. I've now eaten there twice in three days. The corn fritters are out of this world, as is the mango cheesecake! The dragon eggz were also delicious. Adorable inside, great service and even greater food!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "vksyiT7vAmk0z7NJ1ZqBuQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Spring rolls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vksyiT7vAmk0z7NJ1ZqBuQ/o.jpg"
      },
      {
        "img_id": "iARg1SLPjie7lAbVky-BiQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Corn fritters",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iARg1SLPjie7lAbVky-BiQ/o.jpg"
      },
      {
        "img_id": "TnohYEtXpujiZNa4-HGflg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Mango cheesecake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TnohYEtXpujiZNa4-HGflg/o.jpg"
      }
    ],
    "user_id": "WvRacGS17sIF1YDTrhGKng"
  },
  "5lI1lbXnBSa2ZVpVXkKXeQ": {
    "date": "10/29/2018",
    "text": "I wanted to Love this place since it is close to work and because I love Thai food.  Unfortunately, I cannot recommend this place.  Today was my second attempt to try to find something that I liked at this restaurant. I ordered the pad Thai with chicken.  The chicken was horrific. The chicken was tough and chewy. It was probably cooked and prepared ahead of time since it was so dry and tough.  This is my last attempt to ever eat here.  The noodles are dry but moist and lacked seasoning and flavor.   The waitress was very friendly and accommodating but I'm sad to say it was horrible meal.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kNzzteRJy5jBOX8rM_uJOA"
  },
  "wQwV4prpveMowxj1OJ66VA": {
    "date": "3/28/2018",
    "text": "Have to go 5 stars. Small place in Scottsdale but highly rated on yelp and was a stop on Diners Drive Inns and Dives. Full bar and beers I'd never heard of- ordered a beer from Laos which came in  a nice frosty mug. Ordered the Dragon Eggz-which were dumplings with Pork, Shrimp and Crab with a fresh jalapeno slice- amazing. But the coup de grace came when I ordered the Thai Hot Wild Boar. And it was hot but with a nice flavor- not just stupid hot for the sake of it. Veggies were nicely done and the portion was perfect. I may regret my choice on my flight tomorrow but that was some of the best Thai I've had. I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "P7iuHke0ybK3HDzLJ0LaZw"
  },
  "z2WbRtMG8IDe89D13CftyA": {
    "date": "4/5/2019",
    "text": "Great ceviche, little unexpected. Looks like a small and unpretentious restaurant but has great food and chilled thai environment. Not like all other usa restaurants where every is too quick, with no ambiance or authentic food. It was real thai level spice, not the watered down curries elsewhere. We had the mahi mahi green curry. Delicious. Service much slower and no rushing..very thai!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dpKA8BBJBBQ84yqZbnNbJw"
  },
  "GySo5dwtUiGyvFhsYzN-FQ": {
    "date": "8/7/2018",
    "text": "Great place, bigger inside than it looks like from the outside.  Great food, quick service. Parking can be tough is the only possible downfall.  Drive thru is a nice touch also, I haven't used it but works well given the limited parking, keeps people moving who aren't there to stay.    Big menu, all the usual you would expect at a Thai restaurant.  Good selection of lunch specials also.   2 enthusiastic thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7kWw59UZpgRXFsgYDjh3eQ"
  },
  "FOAt60rfICyVabcqsHu6BQ": {
    "date": "4/9/2019",
    "text": "Great spot for traditional Thai cuisine.  Friendly staff great location.  We had lunch here after visiting the Desert Botanical Garden.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O-c9XNZZ26fU--IoVXK9Ug",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O-c9XNZZ26fU--IoVXK9Ug/o.jpg"
      }
    ],
    "user_id": "YY0k_DVe-pJZNpLonA3pFg"
  },
  "2EwT9WIlaJxdiQQVczTkbQ": {
    "date": "10/11/2018",
    "text": "Bright, clean and very friendly. Generous portions of incredible and unique Thai food prepared by Genius Chef Olashawn Weaver using authentic recipes with fresh herbs from her garden. The service and food delivery were quick, efficient and friendly.  You must have the Dragon Eggz with the most delicious dipping sauce. And don't miss the pork skewers served with green papaya salad that has just enough kick to make it even more interesting. Don't forget dessert! Chef Olashawn's husband makes a delicious coconut ice cream.  The Little Thaiger serves the best Thai food I have ever had. Don't miss it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6QJy7S82T8NWHkJK1vh5Dw"
  },
  "_VwlCaFreetRvliG2iXuxg": {
    "date": "7/11/2018",
    "text": "Horrible food, place is dirty.. Floor and walls are dirty, cluttered inside. Small portions and overpriced for what you get! Definitely the worst Thai food in Arizona that I've had.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C4jGny4y3wdCMdS8hhqTIA"
  },
  "NIV9JK2i-_pme2MieIwi7Q": {
    "date": "6/27/2018",
    "text": "I love this place. One of the best Thai places I have been to, are there are many across the country. This place is the smaller one in Scottsdale saw it on Diners Drive-Ins and Dives thought I'd try it been there three or four times since then probably once a week everything is prepared to order Super Fresh pretty spicy it's not the easiest place to find you can drive by it but if you're on Tomas Road it's right past Scottsdale Road but you got to look for it it's worth stopping at if you like Thai food you'll love this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3X-LLUaHxO1gfYr5jx8Cmw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Green curry, called 24k",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3X-LLUaHxO1gfYr5jx8Cmw/o.jpg"
      },
      {
        "img_id": "k9hc_T9ehmkupbRmKW9gDA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Beef penang",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k9hc_T9ehmkupbRmKW9gDA/o.jpg"
      }
    ],
    "user_id": "peAkOoGqd2MoztIFL9vM9g"
  },
  "t4cYfBoHKWgKh3WrJEqTrg": {
    "date": "9/13/2018",
    "text": "Amazing food and so happy that The Wild Thaiger from central Phoenix brought some of their amazing recipes closer to us east side folks! Keep up the amazing work!   Try the peanut passion chick or their yellow curry, it's to die for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpo_x9BhQjdw8jcEz-xVkA"
  },
  "yHvy04JvEiUS-MOMqq3pPg": {
    "date": "5/9/2019",
    "text": "I ordered take out. Food was hot and ready at time promised. I loved the convenience of the pick up window! Food was beautifully presented and tasted wonderful. Staff friendly and prompt. Wish I would've found this gem sooner as they will be closed in 2 weeks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BJ22Cl--51fc33qnBkedZA"
  },
  "5OLZQyq8_zyY9IegE4eLfA": {
    "date": "2/2/2019",
    "text": "Stellar little spot with some of the best Thai food in town. Great customer service and friendly staff. Hidden little gem of South Scottsdale!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i_guCSGzHMP8d4Do-nWgTQ"
  },
  "7PulbL2qPhKpplDOZftnLg": {
    "date": "1/20/2019",
    "text": "Love this place. Best Thai food I've eaten since I lived in So Cal, maybe even better. I like spicy food and they use actual peppers for heat instead of red chili pepper flakes or whatever it is most other places use. Everything I've eaten here has been fresh and amazing. You won't regret eating here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eYB3WVudAEuueuTTwHFMtA"
  },
  "AJX_MN63nqOfimuQ8D8SXQ": {
    "date": "4/6/2018",
    "text": "This place deserved the visit from Guy Fieri - the menu is simple and authentic. They have over 5 types of pad Thai (but the pad see eu noodles are just as good!). I love that the shrimp in their dishes is grilled well, and easy to enjoy if you're not a huge seafood fan. Great for takeout",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "krWkC-U2U_YAtYdAvuRwAQ"
  },
  "geL9dnKO_vr7mTbi_zYKqw": {
    "date": "1/16/2019",
    "text": "Consistent in quality and nice and simple choice for a quick lunch. Tried maisaman curry and red curry many times.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w3nXKm63aMGlQOmpDeSUew"
  },
  "UVlAjOLmuxdESV9bb-7xIg": {
    "date": "12/9/2018",
    "text": "Very good tasting meal with some classic dishes and some innovative appetizers. I had the dragon eggs and the Veg in a spicy sauce with a note of garlic. Chicken and a yummy sweet and spicy tang over rice. No leftovers after this meal. Parking is a little limited  so prepare to walk a bit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gpMg4LgZiOw1z0cg8K8cHQ"
  },
  "mI1t9kjrwhHDp0L1bADNiw": {
    "date": "8/24/2018",
    "text": "I was going through Phoenix on a road trip, and stopped here for an early dinner.  I had the dragon eggs and 24K. Dragon eggs were like siu mai, but better. 24K is spicy!  It's a small place, and anime themed. I don't like Phoenix, but I like The Little Thaiger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tu4DMPM_cFe3WzV6tI_EbQ"
  },
  "cX5ddPp9xUiMRCCe3YAC-w": {
    "date": "3/26/2019",
    "text": "Don't waste your time. I am visiting my daughter and after she picked me up from the airport we decided to pick dinner on the way home from Sky Harbor. We chose the restaurant because it had great reviews and also a drive thru pick up window. We called in our order at 7:35pm and were told our order would be ready in 30 minutes. We arrived at the restaurant about 15 minutes later and were prepared to wait the extra 15 minutes remaining for our order. The drive thru has a buzzer and after ringing the waitress came to the window and told us it was almost ready. After 20 minutes passed she came to the window to ask if we needed plastic dinnerware and we declined. Another 10 minutes passed and we buzzed again to check on the ETA, and once again told it was almost ready. Shortly after our last inquiry a man came to the window and rudely informed us that the waitress had checked on us 3 times and food would arrive soon. All total we sat at the window for over 1 hour before receiving our takeout. Their were only 2-3 tables occupied in the restaurant so the delay wasn't because they were busy. The food we received was mediocre at best, the vegetarian curry consisted of mushy vegetables. and the portions were minuscule. I usually take home bigger leftover portions from Thai restaurants when I dine in. The overall experience was very disappointing and I definitely do not recommend this restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0UrC-q5-0Wph4_Xx-GNh3w"
  },
  "kClGy3QZuhOe55BH731yHQ": {
    "date": "9/14/2018",
    "text": "This place is seriously my favorite thai food of all time! Everything they have is fantastic. I stick to the steamed dragon eggs, Tom yum (SO GOOD!), papaya salad and pad Thai with shrimp. I go every time I'm in Arizona and it never disappoints. Highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fR-ilwINuv_m89jm6OouQQ"
  },
  "X3Exem6stZgRFJzL7Ndzpw": {
    "date": "9/22/2016",
    "text": "The De-Cha Boar is really good. I am Thai, grew up eating Thai food and have been searching for authentic Thai food in Phoenix. This dish hit the spot and is something that could have come out of my mom or aunty's kitchen. Satisfyingly spicy and great flavors.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvTDdbzWaajxxkaXIrN9pA"
  },
  "HxxcHrEjE13t2GbwutGC2w": {
    "date": "9/11/2016",
    "text": "I called to place an order for pickup. The lady on the phone was very nice and told me it would be 20 minutes. When I got the food I was curious because it smelled very different from any other Thai food I've ever gotten. But both the Pad Se Ew and pad Thai (Medium spice) were amazing! I would definitely order again :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e8HH9VwHOALhpObXDmuhHQ"
  },
  "BJOwhaU8tOaA4f1HyAftnw": {
    "date": "12/26/2015",
    "text": "Great Little Secret Hideaway on Thomas Rd just off Scottsdale Rd. Looks from outside are totally deceiving looks like an ice cream / coffee shop from the road, Authentic Cuisine, Great Food, , Great Value, Full Bar, Great Presentation, Friendly Staff, Moderately Priced. $25 per person with appetizer and Drinks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EphPnL6-7-DR8-oIHg8CFA"
  },
  "DMozjoNanOCrIHIH3ZlYyA": {
    "date": "2/25/2015",
    "text": "Stopped in for lunch.  Very good and very fast - and this area needed a good, fast place for lunch (they even have a drive thru). Panang curry was properly spicy.  I will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3c5lY44yNoJ40vIrQdh5_Q"
  },
  "4D1SNKeakjcQGmXMbrAX_w": {
    "date": "7/30/2016",
    "text": "This is the best Kept secret for Thai cusine in the valley. Best fresh spring rolls,Pad Thai, and desserts!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RcRVS8_VKMxBfKMvQi6NfQ"
  },
  "t_WypPiTqUuQi-CbVOMWDg": {
    "date": "8/23/2015",
    "text": "Best Thai take out in Old Town. Always fresh, always delicious. So glad this place is right around the corner, we've dined in and taken out, they are always good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A3akUQZKtQgDADStFYmrgw"
  },
  "ChfUoy5HkJgsxEPANkK67Q": {
    "date": "10/5/2015",
    "text": "So so so good! My boyfriend and I stopped in for lunch on a Monday afternoon. Fantastic service by Gabby who was so lovely and so sweet. The chef even made an appearance at the table to say hello-then proceeded to say hello to the other guest in the restaurant. Didn't seem too busy however, which is unfortunate since everything was excellent. We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NCuUG-T8COCX-_G7e4AjBQ"
  },
  "EgxNHdorgNtuVHlNLLWU5w": {
    "date": "3/27/2015",
    "text": "Came here on a Sunday near closing in desperate need of drunk food. This place is near my apt and I am stoked to have it. We got chicken satay and fried rice along with the spring rolls. It was good, quick, reasonably priced and they were really nice about how late it was. I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YUI7p0Lc0ZkNoDGi0cgslg"
  },
  "hBjSZQW7XO0eJdK7sFp_2Q": {
    "date": "11/11/2016",
    "text": "This place is a hidden gem! Love it so much. Spicy, delicious Asian-style food. They have a drive-thru, too! Lots of gluten-free options, which I appreciate.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pMQX-Chdz9kxXyB4FnYtDg"
  },
  "vQNmu5ViS7mQx4Vy82oisQ": {
    "date": "7/9/2016",
    "text": "Probably the best Panang I've ever had outside Thailand.  The staff are super hard working, and the kitchen is off the hook talented.  The place is weird as far as look and function but the quality of food supersedes any hang ups you may have of a converted Wendy's made into a neon, white leather, plastic plates interior.  In a way it reminds me of what being in Thailand really feels like, especially in this AZ heat!  You'd be crazy not to give this place a try, the food really is next level authentic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hZIoExFT_b5suiv5TgTW3A"
  },
  "NbJTgcOmrrleHMdgQKDd3g": {
    "date": "9/19/2016",
    "text": "Best restaurant to have thai food in az. Especially have to try the pork ribs and fried rice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GjMkGSoxJ06oimIBENIH9A"
  },
  "BlvTKcqZAqWB1XiG2hPBFg": {
    "date": "2/28/2015",
    "text": "I still give 5 stars because the food continues to be awesome;  however, on our most recent order to go over $54 by the way the service was lacking.  I call in the order and I'm told 20 minutes.   20 minutes later I send my boyfriend to pick up the food and 50 minutes later my boyfriend is still waiting for the food which he paid for when he got there.  After the waiter/hostess helped 3 other customers and completely ignored our food sitting on the counter my boyfriend finally got her attention and was able to get our food that had been sitting for 20 minutes.   Cold Surf and Turf is not good.   Please consider your customer service skills Shu Noi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WMuPlHj5UNq9mYmrH_j7VQ"
  },
  "Syekj7mNzCM01THxx5J79w": {
    "date": "2/27/2015",
    "text": "This is my new go to Thai restaurant. The 24 K is one of the most amazing dishes I have ever had! It is a spicy green chili curry with Kabocha pumpkin, Japanese eggplant, string beans, and bamboo shoots. And when I say spicy, I mean spicy, which is perfect for people like me who love spicy food. The Suh Noi Salad was refreshing, filled with fresh greens, tomatoes, cucumber, and even snow peas. I love the drive thru option and service is on point.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v4Vy6hqYro8u3nsbQU9Tjw"
  },
  "KMRHlrCzg8aaF34ZhInGzA": {
    "date": "10/31/2014",
    "text": "This is a new restaurant that is located very close to work so we had to try it out for lunch. It's a little difficult to get to and when we walked in the decor was a bit odd but the food is really good!! I ordered the candy chicken and my friend the curry chicken. They both had the right amount of spice and very flavorful. The employees were also very friendly. I am definitely going back because I want to try the Pho. Oh and they are very reasonably priced.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nBHk_s1VvdrOK2ve4gKGkQ"
  },
  "kKNjEhmbz5G_PHIAMGcWPg": {
    "date": "7/2/2016",
    "text": "The food is very good. However with saying that we waited 50 minutes for our food as their teenage wait staff ran around like chickens with their heads cut off. The service is terrible. I wouldn't come back unless I had 2 hours to spare for dinner. As we waited for our food we watched 3 different sets of people walk in and wait and then walk out because nobody ever greeted them or anything and they even had 2 open tables. Too confusing of a set up with no hostess to seat people. I can't imagine they will be in business for too much longer. Their location downtown is far better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZCjYWF8gBZZLwrrMAcEmkw"
  },
  "1c_ZRb7V4NIOg9vYZRdqtQ": {
    "date": "4/11/2015",
    "text": "Great food,delicious pad Thai, great staff They were friendly and very helpful. Cannot wait to go back and try other dishes. Don't miss the fresh rolls and dragon eggz Glad to have seen the article in the paper cause we now have a new place to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aEGKTAd8jNkdQqDrAtKTQQ"
  },
  "ZoQF-dXsvl9I0xHiivdA1g": {
    "date": "1/26/2015",
    "text": "The food was terrific and very reasonably priced. I got the peanut chicken and my sister got the candy chicken. We couldn't decide which we liked better because they were both so good! I'll be back on a regular basis!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QE9xrAZUvvmpBDuQ8qQrTA"
  },
  "iWs2iZHh4kMnP-hl2jwdJg": {
    "date": "11/21/2014",
    "text": "Good food very mediocre service. I LOVE the candy chicken. The soup is great too. That's about all I've tried but my friends have ordered other things and had very positive things to say. The staff is very friendly but not the most competent. It took a very long time for someone to take my order at the drive thru and an oddly long time to get my food. Another time when I walked in for take out, it seemed like a bunch of the staff's friends were just hanging out and it made ordering a little awkward bc they weren't paying attention to the customers. And they got my order wrong that time. I ordered mochi, but they gave me a slushi thing. I wasn't that angry though, because it turned out to be delicious. So go for awesome, inexpensive, easy food, but don't expect the same level of amazingness from the service. Just be patient and all will be well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W1LkU4p51acN2tf7HaJUBQ"
  },
  "51xIim7MHFbsIkO5wkmHTQ": {
    "date": "11/6/2014",
    "text": "This place has potential, and I hope they will do good in their business. I ordered a coconut soup, temple of fire (fried rice), Kimow (clear noodle), and a Thai tea. The coconut soup didn't taste too bad overall, however, it was over sweetened. It tasted like sweet coconut milk mixed with other staff.The temple of fire is way too spicy ( I love spicy food and I'm from Szechuan), but I couldn't handle the fried rice here. It gave me stomachache. The Kimow was average, a lot of noodles but minimum meat. The Thai tea was so sweet, I felt I was drinking syrups. The restaurant only has small round tables for two, Not convenient for group of three or more. It would be great if they allowed their customers to select spicy level (mild, median, hot, Thai hot etc.), otherwise it's too risky to order spicy dishes. I would get to go dishes from here, the actually dine/in portion is smaller other Thai restaurants' dishes anyway.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "apsqeOLlYIZATqBftiAqHg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/apsqeOLlYIZATqBftiAqHg/o.jpg"
      }
    ],
    "user_id": "mXbfwOP9PRLcQfSHWWwRNA"
  },
  "tnbbTKjecs5yjxYTmBGYgg": {
    "date": "3/19/2016",
    "text": "The food is amazing. Love the curry and tropical fried rice dishes. But the service is cringingly slow. I felt like I was the DMV. Tried calling multiple times to place a take-out order and no one answered. Decided to place it once I got there, and I watched the servers continue to hang up every call they received. Then waited for 45 minutes to get my food. It has potential but they need help.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lBXnNViXfYpAzWaZFxv4dQ"
  },
  "F0SEZEzrEa9F5rkzOruz3A": {
    "date": "5/2/2019",
    "text": "Amazing food. I always come here when I visit scottsdale for work or vacation. The food are amazing . Love the wild boar pork but it's very very very spicy . This is not for anyone .  Chicken basil is ok but taste is good as well . Dragon egg is yummy too . Very busy on Friday dinner time .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K9IKCA6_UAeAQvvwS4lvYA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Wild boar and my dragon egg .",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K9IKCA6_UAeAQvvwS4lvYA/o.jpg"
      }
    ],
    "user_id": "LFSIJ3auEGvO97mBGXA9Xw"
  },
  "eAr1r1vRxBigFY2W2L-96g": {
    "date": "4/29/2019",
    "text": "We live down the street, and finally came to give it a try. We tried the chicken pad thai and veggie spring rolls. The veggie spring rolls were great, crispy and tasted super fresh. The pad thai was good. Average, but not the best I've ever had. There's a lot of filler items on the plate in the form of cabbage, I'd have preferred more noodles. We will probably come back out of convenience to our home, but not out of craving.   I wouldn't recommend coming here for a quick dinner. Service was very slow. Everyone was very friendly and nice, but the pace of the meal was suuuuuper slow. We were sitting almost 25 min before anyone took our order. And then almost 10-15 minutes after we had finished our meal. For dinner for two, it took about an hour and 40 min.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "To6n-n4z6H1SMz7o5zYEsw"
  },
  "1eaowkalBFQlFQgog048AA": {
    "date": "3/12/2019",
    "text": "This place is awesome! Its a little gem and the food and service are great! Its a small family owned and operated place so patience is a must. They do a lot of to go orders but the service in house is very welcoming.   Food is on point with flavors, portions, prices and quality. I had the satay tasting and it is a very good 2 person share app option. I had the beef skewer specia and I must say it is very well executed. All the food was done perfectly with moist and tender cuts. Close to closing might get busy even during the week, so come early.  For sure I will be returning not only for the great food but also for the welcoming sensation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "68vpLTQqr81ddmu-bhPrCg"
  },
  "ii7KP3Pun5IFFM0WlX3EVw": {
    "date": "3/10/2019",
    "text": "I just realized I haven't written an updated review in a couple years now! I still LOVE this place - amazing Thai food in the Valley.  I haven't ventured too far away from my staple, chicken Pad Thai, but I wanted to add some pictures of the papaya salad and mango sticky rice (one of my favorite new desserts!).  Highly recommend checking this place out if you've never been. Thank you Little Thaiger!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Cuezq-qvlS_lrabQIhGcvQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Chicken Pad Thai, Papaya Salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cuezq-qvlS_lrabQIhGcvQ/o.jpg"
      },
      {
        "img_id": "ONotLrDtRz22YZCCuxyvyg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Papaya Salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ONotLrDtRz22YZCCuxyvyg/o.jpg"
      },
      {
        "img_id": "g6JCpPiMYjgTTiemtTPlhA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Chicken Pad Thai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g6JCpPiMYjgTTiemtTPlhA/o.jpg"
      }
    ],
    "user_id": "M8DD9IIyq_NpI-A9K_Vfaw"
  },
  "W2_EbMNFglmSBrKpQaqi5Q": {
    "date": "2/18/2019",
    "text": "I've been to Wild Thaiger, and yesterday I went to its sister, The Little Thaiger! It has minimal parking in the back and a pick up window, which is pretty neat. I joined my dear friend Kelsey W. for dinner and there were already a few groups dining in, 30 min after they opened. We got waters and figured out our orders pretty quickly, since we were hungry. I got their pad sie ew with tofu and papaya salad, and my friend got pad thai with chicken, no spice. I realized later I wasn't asked my spice level so I asked the hostess if I could get it hot, and she said they could add Thai chilies onto my dish. Perfect.  The salad was all right, I had a tasty version in another state and it didn't meet my expectations. My noodle dish was great; the chilies really helped by adding the right amount of heat. I love how many veggies this dish has, otherwise I'm a fan of pad thai.   We ordered mango sticky rice for dessert and it was such a nice way to end our meal; it was light, refreshing, and not too sweet.  I'd definitely come back here and try some other menu items. There's even a small patio out front for when the weather is warm.",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 13,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "38rQIiMlta_FBMpIdLr_-g",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Pad Sie Ew",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/38rQIiMlta_FBMpIdLr_-g/o.jpg"
      },
      {
        "img_id": "aAzcFqVZ9yC2XbVloXkhPg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Papaya Salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aAzcFqVZ9yC2XbVloXkhPg/o.jpg"
      }
    ],
    "user_id": "4cZ3f3i0Slv2W9mLN_VZBw"
  },
  "5lfS7u-qATsLYcEaoxPKFw": {
    "date": "12/25/2018",
    "text": "Open on Christmas day and packed...we were actually seated outside with the heaters turned but luckily some seats opened up and we were moved indoors. The food was fresh and tasty...we ordered the famous ribs, Chilcken, tofu green curry and basil chicken.  The owner brought out freshly baked chocolate cake and I had to have a slice  I liked it, wasn't overly sweet but $7 a slice was a bit on the higher side although the portion size was big. I will certainly come back if in the area",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "rZ3NJ3zXBdgGjy55Y63IWA"
  },
  "Pu9LBB3R8QMwTjkOPxeBqw": {
    "date": "12/1/2018",
    "text": "Prolly a 3.5 - 4 start place. Good for a one time try.  Ordered -  Spring rolls: tasted good with the spicy dip. Must try for starters. Tom Ka Jay: spice levels are damn right to perfection, cooked to satisfy your taste buds.  Pad Thai Veggie: not a super delicious pad thai, but a good one. Quantity was meal perfect and kinda missed that wow factor though.  Ambience is great. Tiny place and have drive thru option.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qYwLkGBQ_dicuQ4DwxZkOA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qYwLkGBQ_dicuQ4DwxZkOA/o.jpg"
      },
      {
        "img_id": "NcWxZWyocvv0jrW4i-1n6A",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NcWxZWyocvv0jrW4i-1n6A/o.jpg"
      }
    ],
    "user_id": "YpVvSMuQWQiRCHbbUjFzag"
  },
  "11G4OOs38RfWSIAo05QTMw": {
    "date": "2/25/2019",
    "text": "When it comes to Thai food, I'm big on takeout and I was excited to finally try this place after reading the reviews. I'm bummed to give this review 2 stars, but it is what it is.   I was craving Tom Ka Gai yesterday and after reading reviews on the soup (everyone said how great it is), I decided to Door Dash the soup along with the dragon eggs. I'm a huge fan of this soup because it is SO flavorful, but man I was so disappointed when I finally got the order.  The soup literally tasted like someone poured multiple cups of water into it - there was no flavor whatsoever, like I'm talking ZERO. I'm convinced this was a complete fluke because there's no way people actually review how great it is if it were to taste so watered down. Hopefully someone just forgot to add some necessary ingredients, so if and when I decide to give it another shot, I'll be praying for better flavors.  So that was a bummer, but the dragon eggs were the complete opposite - they were SO YUMMY. I got half steamed and half fried which I think it the way to go every time. Both are equally as delicious. DO IT!  Anyways, I'm sure I'll give it another shot in the future, but please just don't forget to add all the amazing flavors in my soup!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5JRsBTopf1lr4gbeLV0o9g"
  },
  "jk_QwSah0BFjtm7VZWK22Q": {
    "date": "12/12/2018",
    "text": "I really wanted to like Suh Noi like many other reviewers here, but it was not good.   The ambiance is strange for a Thai restaurant. They have lights that remind me of a club (think: lots of different colors) and random music mixed with club music. We entered through the back door and the bartender/waitress asked if we were ordering to go or dining in, and when we said we were dining in, she instructed us to sit wherever we wanted. Every table was open except one... maybe that should have been a sign.   The only thing saving this place from a one star review is the crispy vegetarian egg rolls. Those were pretty good, but then again, I've had better.  I came here with my friend and we ordered the crispy egg rolls, 24K curry, and pad see ew.  The egg rolls were fine, they came with a sweet and spicy sauce and cilantro, and I added extra sambal (hot sauce).   The pad see ew was kind of sad and flavorless, and the broccoli had a funky flavor. I doused it in sambal to make it edible.   The 24K curry is what really got me. I'm sad to say that the flavor reminded me of the smell of cat pee. I tried to find a more eloquent way to say that... but it is what it is.   My friend thought the food tasted like it came out of a pouch, and that the sauce was gritty/powdery.   We didn't complain to the server because my friend didn't want to, but I'm being honest on Yelp. I did not enjoy the food, didn't take leftovers with me (a first), and won't be back. I wish we had gone elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EFMWPHOoiFk_l_FhCMxZ4Q"
  },
  "lhTqh-CQRQOPpp-HB0cT6g": {
    "date": "12/7/2018",
    "text": "I am not sure why I kept trying other Thai foods in Scottsdale when I can just go to Suh Noi. We were regular at the Wild Thaiger in Phoenix. Since we moved to Scottsdale, we continue to go to this sister restaurant, Suh Noi.  The catfish pricking is so delicious. The fish is lightly batter and fried to perfection. The curry-ish sauce with crunchy green bean and perfectly cooked eggplant is complementing the lightly fried fish. I cannot stop eating and finish the whole big plate (including the rice).   The veggie curry is also good but a bit sweet. I just added a splash of nam pla (fish sauce) and then it is just perfect. The noodle dish, pad see-aw, is also good. I ordered hot so I got some chili flake on top (love it!).",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "USG1wkzku03asNV8TQZetw"
  },
  "y5wmEO69Qzm2ihGm1XaSwA": {
    "date": "10/21/2018",
    "text": "This is still our go-to for Thai. Although the menu remains small, it doesn't matter because this place focuses on few great dishes rather than do 100 items mediocre.  Our top three fav's are of course the Pad Thai tofu, the Pad See Yew, and the Catfish Praking. All dishes are different flavors but full of texture. The Catfish Praking has become my latest favorite. A generous fried catfish filet with a scoop of rice. The side sauce is something that should go on every meal you ever eat. It packs a little heat but the flavor profile is just ridiculous. And the catfish is so tender and flaky.  The pad thai is always a winner, with fresh bean sprouts to add that crunch, and the sauce is winner. So many places add a ketchupy type sauce and it's awful.  Stick with a great thai like Suh Noi and you'll think you're in Phuket for as long as the meal lasts!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "G-_KF_Ul4d3WGEa-G0Iq4g"
  },
  "KluU_e2jLYoLA_JT-h5BpA": {
    "date": "9/26/2018",
    "text": "Great! Fantastic! Phenomenal! Are there more adjectives available? Probably. We started with the steamed Dragon Eggs and Tom Yum Goong hot pot, both delicious. Finished with a single entree that was the special of the day and sadly, don't recall the name, but equally delicious. Our server was super sweet, helpful, and attentive. On a side note, we had no idea this was a Triple-D restaurant which was a fun bonus. The inside is pretty small, but we had no problem getting a table. On yet another random side note, loved the Pokemon art work across the bar. Totally dig this place. Want to come back and try the Tom Ka Gai too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iaoRkk40w2Z-XyZLMtA3FQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iaoRkk40w2Z-XyZLMtA3FQ/o.jpg"
      },
      {
        "img_id": "VRCZkaPQOWdWJ6BY0cUpjA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VRCZkaPQOWdWJ6BY0cUpjA/o.jpg"
      },
      {
        "img_id": "fUfdVM5XKFn9yvdI9b6khg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fUfdVM5XKFn9yvdI9b6khg/o.jpg"
      }
    ],
    "user_id": "5ss4_ISe69M8kRMlgvmo4A"
  },
  "SCkjwnSnPZd22Uc7knLR4g": {
    "date": "5/28/2019",
    "text": "I need to eat there again. I got Panang curry and Pad Thai. I'd say it was ok...not outstanding. Panang had a thick almost gravy sauce and seemed to lack coconut milk. Basil in it but entire leaves. Pad Thai was lacking much of any sauce. I'd call it too dry. I'd like to try it again but this time it wasn't the greatest.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6m6AxBDfQHWXP_RuOxdTog"
  },
  "DnopkT53E5wrNitxv4lfSQ": {
    "date": "2/17/2019",
    "text": "So I always search out authentic Thai food wherever I travel.  Found one.  Suh Noi is excellent.  If you have been to Thailand and know a special dish you cannot find anywhere in the states, ask them here.  You may be surprised.  I was and will always return when in Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z6LCSVK5hf4786XeDxMvuQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Secret dish.  If you recognize, ask for it by name.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/z6LCSVK5hf4786XeDxMvuQ/o.jpg"
      }
    ],
    "user_id": "AjfHvlPXS47YJD47xD3oEA"
  },
  "txN5BNmead498ysu2w6MRA": {
    "date": "1/16/2019",
    "text": "If I could give this place 100 stars, I'd give them 101. Without a doubt, this has to be the best food I've ever eaten, and some of the nicest staff I've ever spoken with. Chef Ola, her two kids, and the rest of the staff are always super friendly, and they treat you like family. (We even exchanged Christmas cookies last year!)  I order the beef and broccoli (Thai hot) whenever I come here, and everything is perfection. They don't skimp of the beef, and there are plenty of vegetables, including broccoli, carrots, onions, and bell peppers. The broth, if you call it that, is extremely flavorful, and the portions are wonderful. (I eat a lot, so I usually order an extra side of rice, and I'm absolutely stuffed at the end of my meal.)  My meal usually runs me about $21-22 after a modest tip, so it's definitely a fair deal for a chance to eat the best food Phoenix has to offer.  On a side note, Chef Ola also does a lot of community outreach, so how can you NOT support a business like this?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jiG3ia2M6hbHCuTgskRgeg"
  },
  "ZD-islDtvIykjCAyd5XZ4Q": {
    "date": "6/21/2018",
    "text": "This place has a cute atmosphere, especially if you love anime and Thai food! The portions they give are a lot! Food-wise everything was delicious! Hand down the best Thai food in the Scottsdale area. I got the pad sie-ew and thaiger ribs. So delicious!! If you're from out of town and are looking for a bite for the night, I suggest heading here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yg2CWxGiAI9F4twHTPi9mQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Thaiger ribs!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Yg2CWxGiAI9F4twHTPi9mQ/o.jpg"
      }
    ],
    "user_id": "4xJCola3w3O655tBDGXrIA"
  },
  "0Rq0pqioJtUQWs9NYTxywA": {
    "date": "11/16/2018",
    "text": "We were craving Thai tonight, and decided to drive around and see what pops up.  We passed up on three other places and pulled into this quaint lil spot.  When pulling in, parking was definitely TIGHT on a Friday night.  But luckily, we found a spot out back.  As we walked up, we admired how small the place was.  And the fact it wasn't too busy on a Friday night, we had mixed feelings of \"Are we just lucky?? Or is it not busy for a reason???\"  We were welcomed right away, which was nice, and told to sit anywhere we wanted.  We got drinks right away and placed our order.  For a not-so-packed place, it seemed like it took a long time for the food.  But, we were tended to often, with our drinks.  When the food arrived, it looked great!  But both meals lacked substantial flavors.  So we were let down... :(  But, 3 stars for being a cool lil spot and pleasant service.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YkmLDARXgobV2znJysIblQ"
  },
  "nlKYchyWRJVbC4VSkSqEOA": {
    "date": "1/8/2019",
    "text": "I came here with some co-workers for lunch and was pleasantly surprised. It's small and plain, but very clean and welcoming on the inside. The crispy eggplant salad caught my eye on the menu, but I wasn't sure if it was vegan (or could be made vegan). I asked the server and she assured me they could make it vegan. The peanut dressing that came with it was wonderful and the eggplant was just the right amount of crispy. Our server was friendly and prompt. I would definitely come back for lunch again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i9TIP0pY891vnbMSSWlgIg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Crispy eggplant salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i9TIP0pY891vnbMSSWlgIg/o.jpg"
      }
    ],
    "user_id": "ZdRkCXwdGdaOAeLa06lJgA"
  },
  "dtDjXfiRkQ7nSMyeoGBI2A": {
    "date": "4/10/2019",
    "text": "New in town and need GOOD Thai??? That's as important as needing to know where the hospital is bro. Don't settle for something closer cause this place is kinda an emergency. Come hang out with Nitrah, sit down and enjoy personable service with deliciously fresh spiced curry, holy hell, or get anything, it's made to taste extraordinary. Maybe you're on a Keto kick and going through carb withdrawal, you're like \"can you just make me beef and vegetables\" boom, they got you. This place is like a relationship, but better, cause you do no work and still get all the rewards. I know you're thinking, what a lazy person, who is that honest, I am, now go eat their food and stop being a lil bech.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AGxNbcrzaWz5dA0LedHCtQ"
  },
  "U6tPCZrXYTbLasoIC4Vq-Q": {
    "date": "4/4/2018",
    "text": "Decided to step out of comfort zone today and try something new on menu today. I have been here once before and got a seafood dish but the lunch menu has large selection of popular dishes. I picked  Yellow Curry Chicken with Thai tea. The lunch specials come your choice of soup or crispy spring roll. I chose the spring roll along with my chicken curry. Can I say love at first bite! Disclaimer I have never had curry and I am in love with complex depth of flavor. The dish has nice portion of chicken in rich yellow curry sauce w/ veggies along with jasmine rice. I could not stop eating and finished the entire dish. I am very pleased with my selection and will come back to check out more dishes on this menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4HvX4SeqJ1SibWeIfiXKrQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Yellow Curry - Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4HvX4SeqJ1SibWeIfiXKrQ/o.jpg"
      },
      {
        "img_id": "HtJb7uMVh87RYJmEVxf7hw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HtJb7uMVh87RYJmEVxf7hw/o.jpg"
      },
      {
        "img_id": "pad2Qi_TbzB6EXnqkDqnUQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pad2Qi_TbzB6EXnqkDqnUQ/o.jpg"
      }
    ],
    "user_id": "tcw41NjSGJ0Wgl_EdbcXBQ"
  },
  "BwzfJb3i-3gFSspjRg-_jw": {
    "date": "12/12/2015",
    "text": "Amazing coconut rice!! An amazing light desert I almost eat everyday now!! Addicted! It's like $2. Also their spring rolls are incredible!!! A hidden gem in Scottsdale. Don't miss out. Fun atmosphere as well!!! There hours are not right tho! They are open till 10pm on Friday and Saturday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oVxibaw-Goq_Um0r0ubV7g"
  },
  "-qq4QHHLWKtmsPJypAN2LA": {
    "date": "3/19/2016",
    "text": "All the food was good and the service was good as well.  I would recommend the Dragon Eggs for an appetizer.  The Peanut Passion dish was just the right amount of food and was tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_ifEUp8gpj9VEu4DO50rIA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Tasty Fried Banana!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_ifEUp8gpj9VEu4DO50rIA/o.jpg"
      }
    ],
    "user_id": "6NNOVNxaHr4WUEZBJqTsqQ"
  },
  "L6icVG2K6LyLRlTaYka_PQ": {
    "date": "5/10/2016",
    "text": "Amazing food. Seriously, portion sizes are just right and it's right off of the cooktop. Will be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1wSOH5eAodvB9btV1RMduQ"
  },
  "QIZ-kyteOH3c9YYRaq9uFA": {
    "date": "11/3/2015",
    "text": "Authentic THAI FOOD this is really flavorful and fresh... I will definitely come back. I got me the egg plant pumpkin curry with green beans... delishhhhhh 10 star",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7qfT7mFKz2B9X5MfRvhQA"
  },
  "kYGvY-Qho4U7E_TtS3onJw": {
    "date": "12/14/2015",
    "text": "Really flavorful and eye-opening Thai food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7o3LjEc2ygzyDSOQH7K0AA"
  },
  "f5MyojEKsRwxCqQqeZ7WQw": {
    "date": "12/8/2016",
    "text": "My husband and I typically eat here a few times a month, so I think it's time we give them some praise. My husband loves the dragon rolls, you can get them half crispy/half steamed! (The way to go). We typically avoid wheat in our house, so we love the gluten free pad thai. All of the curries are great, even the 24k which I wasn't expecting. We order take out almost exclusively, so I can't comment on their waiting service or atmosphere. However they are always quick, friendly and yummy! We highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5r4-ZoT9PzYbJyigHxM9EA"
  },
  "BPUvCOiRArVfL4XMGoTdjw": {
    "date": "3/23/2016",
    "text": "Terrible service. We walked in and sat there for 10 minutes. Nobody came to say one word to us.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U0WpQER-hGFO61w-Cbk7_w"
  },
  "hUEKfqDQt4zbI2ChhIqohQ": {
    "date": "6/22/2015",
    "text": "Great Thai spot in old town! Highly recommend the Panang and the Tom Ka Gai. The owner is super sweet too...she came out of the kitchen to introduce herself to me and family. The location is easy to miss so business seems to be a little slow there. I highly encourage you to check it out. It would be a shame to see this little gem go away!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMrJ3wxSBfETaEATXh792g"
  },
  "oCB0LCzFswGaSzF_7IbLwg": {
    "date": "3/4/2015",
    "text": "The food here is pretty good! I love Thai food and they nailed the flavors. We noticed a drive thru so I will be coming here more often. We had a gift certificate so we thought to try it and I'm glad we did. We ordered at the cashier and the girl there was very helpful in deciding what we wanted. We got the Pad thai, Beef Panang, and the Prig King. They were all really tasty! The only thing about it was that the portion is pretty small. I mean we each got a plate and had to go across the street to Taco Bell to order a couple Tacos each. When we told the girl bringing us our food (which came out pretty fast) that the portion is on the small side she said that the portions will be getting bigger the following day. We couldn't believe it! We missed it by a day. But overall, the food was great and the cashier was helpful so I will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "To2QqCd3p8-dUioFidW5Tg"
  },
  "9EmvCdt4dBR0wmtA1LC9GA": {
    "date": "6/8/2015",
    "text": "Came in a few Sundays ago and a second time two Fridays ago. Suh Noi is a perfect place to get an inexpensive, casual, DELICIOUS Thai meal. The employees are always extremely friendly and easygoing, and the atmosphere is very casual. I have had the yellow and red curries which were both delicious, but a bit too spicy for me. I'll try something else next time! This place is one of my new favorites.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tsR8JuN_aVpNAnpat0wPjw"
  },
  "56KWVeIbctQJmLrg78EGdA": {
    "date": "11/15/2016",
    "text": "By far, the best Thai around the Scottsdale area; a somewhat hidden gem. We just moved to Boston and we've been trying to find something that compares!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8FAgmVrKlozpDpBR4nS2xg"
  },
  "rsHxdi9k1zvkXC7L6lVa7A": {
    "date": "2/22/2017",
    "text": "Omg. Still sitting at the pick up window 35 minutes later. They said it'd be 10-15 minute when we called in our order. Boo. I hope the food is good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IIyiURPVOiGz59HC-wWaIg"
  },
  "K5YbrsnpE8ETS1JMDsnVIw": {
    "date": "12/27/2016",
    "text": "Ordered takeout for four people. Was told it would be 20 minutes, but it ended up being almost 40. I can already tell some of the food got cold by the time they finished making the last dish. Jury's still out on the food, but the wait time alone has me angry enough.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aTTlmzuj_OqutR84pl8amQ"
  },
  "WfoYP-bfRUSmPLBYJCVsUw": {
    "date": "11/4/2016",
    "text": "The service is terrible. Waited so long for everything -- while the restaurant was nearly empty. The food was okay, not terrific. Go to the other location. I've heard better things from that one.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YNwpkVofbET-sCNABrgA7Q"
  },
  "MnXogKRG9LiOO-maaBUi8w": {
    "date": "10/25/2015",
    "text": "The dragons here are great they like giant egg rolls.  Over the food is pretty good the atmosphere is nice but it's a very small",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JA16miIbUK6_dZ5XdSNkQA"
  },
  "SSN_9rDeNcgzwzVybOSieg": {
    "date": "12/29/2014",
    "text": "I am a return Peace Corps volunteer from Thailand, which, for better or worse, has made me a Thai food snob. I had the Thai basil stir fry (pat gra-pap) and the drunken noodles (pat kee-Mao). Both were very delicious and when I asked the owner for Thai style she made sure to spice it up with Thai chillies (prik kee nuu). They both had the perfect balance of spiciness, saltiness and sweetness that you should expect from Thai food. The food was very reasonably priced and the owner/cook was out taking to the patrons which made it an overall great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rRcQrkL6cv9g-hDOEQQoHw"
  },
  "b5QnuYx0VlQctZva3VCQpg": {
    "date": "12/3/2016",
    "text": "My favorite Thai restaurant!  Ingredients are always super fresh and the flavors are amazing.   I highly recommend the Dragon eggs as an appetizer.  The peanut sauce on the Peanut Passion is unbelievably good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ITQ1_c6qHnSMxwCRKTH7kQ"
  },
  "08-Pw-kTfjvSJDn8Z6x7cQ": {
    "date": "2/24/2015",
    "text": "Pretty cheap, my peanut chicken rice bowl was pretty average and bland.  For the price, I'll probably come back to try the curry.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0Bw1q4XNjxyqyl4Ncfj9A"
  },
  "vE3FXWqiREHiAIuBN9nvTw": {
    "date": "6/24/2015",
    "text": "Omg!!! I love this place! The owner is so inviting and nice. The food is delicious. I had the spring roll and pad Thai and it was out so quickly. Probably the fastest I've been seated and served in a restaurant. Just the right amount of crunch and flakiness in the spring roll. The flavor in the pad Thai was perfect, not too spicy, and the presentation was very eye catching. Young and hip decor, and they serve alcohol. Two thumbs up and five stars. I'll be coming back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzArgPA976WMt8F-uPZg0A"
  },
  "EKYnra0gEbVWu7__IFhlQA": {
    "date": "8/10/2017",
    "text": "The food was amazingly tasty - maybe some of the best Thai food I've had.  The service was great too.  Why three stars and not five?  The portion sizes are ridiculously small.  Really, so small that I kept looking in the bag to see where the rest of it was.  The entree prices are typical to slightly-high for similar quality Thai food ($12.90 with tax for my order).  I always split an entree of Thai food with my daughter, and we are good to go.  I have done this at over 5 different Thai restaurants in the valley, and portion sizes are never an issue.  I am not talking about a total of five meals; I'm talking about dozens of visits to each of our top 5 favorite Thai restaurants.  It felt light when I picked up the to-go bag, but when I saw the portion size when I got home, it became evident why it seemed as if the bag was filled with lightly packed feathers.  I didn't even try to share this; I gave the whole meal to my daughter, and I made a deli sandwich with some turkey from my last trip to Costco.  I did taste it though, and man it was good.  My daughter loved it too.  If I win the lottery and prices and value don't much matter anymore, I'll be back.  Until that day, I'll stick with my regular Thai food favorites where I don't have to break the bank to get a meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AqCCI-lvzr810FRgKepVNg"
  },
  "x_BVm1mC39iTJS507lQ_Wg": {
    "date": "5/10/2017",
    "text": "To say I'm an avid Thai foodie would be like saying bears kind of enjoy honey. I am VERY impressed with the service, cleanliness, presentation of the food and the taste was spectacular as well. I recommend this place as one of the best. Whatever you do, don't judge the book by its cover. It's pure artistry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0SrL97xFh-mVMOxUFDFgEg"
  },
  "Br05g39olY1Z3DCDpicYOQ": {
    "date": "1/21/2016",
    "text": "Grrrr-eat!  I enjoyed the Curry Soup and Chix Pad Thai! Perfect spice level!  Delightful young lady served our meals.  This is a breath of fresh air in South Scottsdale.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LRki_2GO-IGTh-3IBOBOMg"
  },
  "K3sgirlpcNRsLhS2-GXF4w": {
    "date": "12/31/2016",
    "text": "Really terrible experience. I knew it was a bad idea to eat here when I saw the Pokemon mural and anime posters but I decided to give it a try anyway. I ordered and my food came out tasting like they covered it in maple syrup and served it to me. The waiter came by and asked how everything was and I told him honestly- he walked away and did not take my feedback at all, and did not take the item off my bill. I will not be back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jfRgZBn1pO8IOepUggtZ3w"
  },
  "Vn9pEpIwehMI5JpWmxoS6Q": {
    "date": "1/11/2016",
    "text": "I got this place for lunch while on my lunch break and thought it was pretty good! Ive never had thai before but I feel like this is a great place for first timers... I got the noodles and chicken and thought it was a very basic thai food plate. This place was packed during lunch and I suspect it to be packed during dinner time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cTkwhMLSavNOO_swPKf-ZA"
  },
  "DpqBpEyGDIZRde7VlWj3zA": {
    "date": "7/28/2017",
    "text": "Our hotel clerk said his girlfriend likes this place, and Yelp looked good, so we gave it a try.  OMG. SO. GOOD.  We noticed Guy Fieri has been here for DDnD.  Some of the items on the menu are marked to let you know what he tried.  We got some of those, plus some others. I would call this \"modern-traditional Thai.\"  I would also call it fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VhmcHWlwhSzxkoUxP4EiNg"
  },
  "VnVqZPNdI2yMEIBdaCKIyg": {
    "date": "10/5/2015",
    "text": "This was the first time I ate here and I must say it was a great first impression. There are not many Thai places like this. We had the Temple of Fire, which is fried rice. I would recommend trying it with brown rice as a substitute. Never tried brown fried rice like this before, but it was shockingly good. They call it Temple of Fire because its spicy fried rice. I also ordered the Dragon Eggs, crispy. This puts a spin on the normal crab/fish cakes most Thai restaurants offer. Just read the ingredients and you can get a pretty good idea.  We also ordered Beef Prig King. My wife is half Thai and stated that this dish was very authentic tasting and reminded her of her mother's cooking. Great compliment for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EyB1jevfRNDPTYPkPw224w"
  },
  "9u-kiztKIdx3JLptG1LTbg": {
    "date": "7/15/2017",
    "text": "What an amazing surprise you'll find in this little spot. Weekend it was affiliated by the Wild Thaiger on Central, so we expected a delicious and creative mean. We were not disappointed. We started with cocktails, which we're perfectly prepared. The organic cucumber martini was a cool distraction to the spicier foods. We started with corn fritters - whole kernels of corn blended in a sweet/spicy light batter - and fresh roles with shrimp and chicken. Both were delicious, the corn fritters well worth driving across town for! We then had the Phuket Sea food Fantasea and the Mi Dang. The seafood was delicious and fresh and served over rice noodles with vegetables. The red beef, vegetables and noodles in the Mi Dang were fantastic and both sweet and spicy. The service was impeccable, our waitress was simply lovely. We'll definitely go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VwXePB6BMAFiiWHjAYJwQ"
  },
  "Dge-ZytnUOIYBw2DhxAIUQ": {
    "date": "10/9/2015",
    "text": "I'll be relocating to the area real soon from California and I wanted to check this place out after seeing it on triple D. I wasn't disappointed and this place is going to be my \"go to\" Thai restaurant. The presentation of each plate was beautiful and the flavors were yummy. We ordered Pad Thai, Dragon Eggs (half and half), and Satay Sampler for dinner and we had the sticky rice with mango for dessert. Enjoyed every bite of it all. The Chef/Owner was gracious enough to come to our table to serve us one of our dishes and talk to us. Overall...great service...great food...awesome people!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "viYUa--bwjC7dbpVfxCKvQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Sticky rice with mango...so good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/viYUa--bwjC7dbpVfxCKvQ/o.jpg"
      },
      {
        "img_id": "38B18yhds9dq_jfcBhnczA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Pad Thai with shrimp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/38B18yhds9dq_jfcBhnczA/o.jpg"
      },
      {
        "img_id": "zLr6Yl3lxrPH-FxWU1Uxjg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Satay Sampler",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zLr6Yl3lxrPH-FxWU1Uxjg/o.jpg"
      }
    ],
    "user_id": "qOC01QrH4IaU62En4-mvXg"
  },
  "xFse0F9WB17zcVfFNAofLA": {
    "date": "11/14/2015",
    "text": "My Thai wife and I just finished dinner and am writing to say this place is a gem.  My wife started with the Papaya Salad and I had Larb Gai, which is surprisingly not on the menu but pretty much a Thai staple.  It was great they made this dish for me with no problem.  We each added sticky rice.  Both dishes were excellent.  For our main course my wife ordered Holy Chicken Basil but substituted pork and I had the Peanut Chicken.  We each added brown rice.  Again, neither dish disappointed.  I think we over-ordered because the potions were significant, thus we had take-home.  No complaints there.  We only drank water so the total meal was $44.00, which for as much food as we ordered was an exceptional value.  As noted by other reviewers the restaurant is immaculate.  The two young ladies named Gabby and Esperanza were constantly cleaning when not taking care of their food serving responsibilities.  I mean they really cleaned.  Not the cursory swipe of a nasty wet rag over a portion of a table.  I wish all restaurants were half this clean!  The cooks (Pa and Mawn) are the sweetest ladies and not surprisingly took time to talk to my wife and I to make sure we were pleased with our meal.  If you have a desire for Thai food and are in the Scottsdale area I strongly urge you give this place a try as you will not be disappointed.  It is after all aroi mak mak.  As a side note to another reviewer (Bryan K., Alexandria, VA), I realize we all have a right to our opinions (there's an old saying about such) but this struck me as write-anything-that's-on-your-mind(!) lacking much thought.  I can't image what would have given you the impression it was a sushi establishment.  Were you thrown by the name \"Suh Noi\" and didn't finish reading after the \"su\"?  Here's a clue.  If you ever walk into a sushi restaurant and there is no sushi bar, well, it's not a sushi restaurant.  \"Big tasting.\"  \"We got steamed.\"  Who writes like that?  We're all dumber for having had to endure your review.  Be more responsible and literate when writing your reviews.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RgebXzMgmnCgF0uaDCYDjQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Peanut Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RgebXzMgmnCgF0uaDCYDjQ/o.jpg"
      },
      {
        "img_id": "TjiWEm0iS7R1JSjcxwdVKA",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Holy Chicken Basil but substituted pork",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TjiWEm0iS7R1JSjcxwdVKA/o.jpg"
      }
    ],
    "user_id": "D9hCjSbfLjpmq3oVJ2S9GQ"
  },
  "GKO6Jan4XRE9nGd8ybIapw": {
    "date": "3/10/2017",
    "text": "Sweet people but not the Thai experience I was hoping for...   the lunch specials were not exactly all that \"special\".  The Thom Kha soup was barely spicy enough though it was creamy and I liked the vegetables in it but the soup I am accustomed to usually allows the mushrooms to absorb the flavors, and that was not apparent with my order.  The noodles in the accompanying meal were OK but again not spicy enough despite requesting so, the chicken was tough and tasteless.  The meal looked appetizing enough but was a sad disappointment when it came to taste.   Not likely to return",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9fYLVFW9vDKUxyXlquNImw"
  },
  "tTrKzdmsRjJcdYq2PrmcqQ": {
    "date": "12/23/2016",
    "text": "Wow! Beautiful presentation, excellent flavor. Spotless restaurant. I can see why Guy Fieri made this a stop on his TV show. I will be craving this food forever. Very small parking lot. They do have a kids menu too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "79dJcLUHkE05Z5V6syNgxA"
  },
  "2ABTQFerXEJugBvV2EqPyw": {
    "date": "4/16/2017",
    "text": "Yum! Our go to Thai restaurant - great portions and great prices. I love the beef panang and dragon eggs. Definitely come here for delicious authentic Thai!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1lMYEitjIZUIhp17bEwZCw"
  },
  "3OGuUt_4gOunrKTrK4HgUA": {
    "date": "4/16/2017",
    "text": "Nice little hidden gem! Was driving by looking for a nice place and found it for sure. Good food and cool decor, hope they can keep up with the volume as more people find this place. Pineapple shrimp was great!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "52_BGAznKkK3jR893w_LPg"
  },
  "pcD5MbU8ouijgK_VLlgohw": {
    "date": "12/28/2016",
    "text": "We tried this place because we saw their marketing on a truck in our neighborhood. We looked it up and realized it was not even a mile from our house. It is the BEST place for Thai take-out!! Fresh, spicy, affordable, fast, and yummy. Love having this place in South Scottsdale. Try the green curry with Thai pumpkin... AMAZING!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gFqSXjxKTN85iwELuLX1fg"
  },
  "-Z62EuHI4O0A3hZSwoQ7fA": {
    "date": "6/28/2015",
    "text": "I thought Thai joints on the corner were reserved for places like San Fran or NYC?  So about a month ago, the parent restaurant, Thaiger, on Central Ave. was featured on Guy's Diners, Drive-ins, and Dives. You'll figure that out about as fast as I did because of all the signed posters and TVs showing the episode throughout the restaurant.   TIP: they don't have a drive-thru but they do offer pick up at their converted drive-thru window.  Disclaimer: I know there are a lot of Thai food snobs out there and I'll be straight forward and tell you I'm not one of them. I just like food that tastes good regardless if it's \"authentic\".  That being said, the food did taste good and I'll be back. I asked the girls at the register what we their most popular dish and ended up with the two menu items featured on Guy's show, dragon eggs and mu yang.   The green papaya salad was good with the right amount of heat. I had half the dragon eggs steamed and the other half fried. Both were good and in the future I'll get all steamed -- personal preference. The chicken skewers were tender and the sticky rice was also tasty and lived up to its name.   I'm looking forward to trying more items. Another TIP: I grabbed the menu pamphlet and will to carry out from the window.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "vjR0SA3yofaowZEXJwyVCQ"
  },
  "Ngnw9Zw7G8t-KjfPiTJgAg": {
    "date": "12/1/2016",
    "text": "Loved the chicken curry!! Service and atmosphere was great. This is an awesome spot for lunch or dinner, so glad we tried it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UY0mf6jlSimoQdN2KedjVw"
  },
  "GL3gfVsqz8PTy8qLzw2FFg": {
    "date": "11/16/2016",
    "text": "This place is very conveniently located at Scottsdale and Thomas.  Unfortunately, it'll only have to do in a pinch, I'm not a huge fan of the pad thai and pad see-ew there.  It's not spicy at all and just doesn't taste right.  There are a lot of vegetables in both dishes which I appreciate.  They should definitely vent the boxes, when you get things to go the noodles are one big stuck together wad and the cilantro is all wilted.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "niKu4se6xtf-ctlm0udr1w"
  },
  "xprwJsORNh8bKSRuP22KZw": {
    "date": "12/24/2016",
    "text": "This place is a hidden gem . The food is OUTSTANDING. My fav is the beef panag. And for a appetizer I love the dragon eggs .... delicious ! You can't beat there lunch specials",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zyt4U7BFvbIbwO1TXBaiwg"
  },
  "QmAJgfQRkrzPUKZtd7yzAA": {
    "date": "5/10/2017",
    "text": "Can't say enough about the food or the head chef who personally came out to greet us. My dad has eaten Thai food all over the world including Thailand and says it's the best soup he ever had. Check this place out if ever in Scottsdale. You won't be disappointed. Featured in Guy Fieri's diners, drive-ins and dives",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7tetByCbPTayTqcZhDc3rw"
  },
  "2-EVFiiIt1rc-gEhc9v8Xg": {
    "date": "3/7/2017",
    "text": "This is my second time eating here, it doesn't disappoint! I tried the fried banana today and omg, it's amazing!! Take out is a breeze from here, and they are both creative and intelligent in the kitchen. They vented the to go containers that contained crispy items...first time I've seen anyone this genius! Homemade coconut ice cream, mu yang, pad siew, corn fritters, all amazing! Definitely don't skip out on the dessert here, it's worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UcGDWvj7b78buCmBB8qSIQ"
  },
  "9Ru0rinLMUsKcIna9L3Ouw": {
    "date": "4/22/2018",
    "text": "Best panang ever! Love the dragon eggs too. Get them half and half - half steamed and half fried. I usually pick up and sometimes it takes a little long but worth the wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HB-UaI9gRFSmOpJrd2Q8gw"
  },
  "etRPy3pVF8_zDZ00aIVv0w": {
    "date": "4/21/2018",
    "text": "Over-priced and no flavor. This is the 4th time we have tried this restaurant and, again, disappointed. We won't be back. We ordered pad Thai spicy 3-it arrived-no heat, no flavor. The Tom Ga Gai (coconut soup) same thing, ordered spicy 3--no heat, no flavor...other than salt. The chicken in both dishes was totally over cooked and pure rubber. This is NOT Thai food, but a very mild, McDonald's version of expensive \"trendy\" food. The service can be rude and arrogant or dismissive. They definitely don't like to hear that the food isn't spaced as ordered...the server placed a spice rack at our table with no comment. Don't go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KrenIGdJvHyx-vm4BAXIPg"
  },
  "NuBOy92m1fecDryc3CNULA": {
    "date": "2/11/2017",
    "text": "We enjoy this restaurant and even order volcano wraps to go!  Consider this two 5 star ratings and one 2 star rating in one review.   The chicken in the pad thai tasted awful tonight.  Please review.  Service sometimes is slow also.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l4Aw83QOSjPlEzM9mtc3IQ"
  },
  "1Pp0BqhRAO8SzJtoXuDYCg": {
    "date": "5/10/2016",
    "text": "I had the chicken pad thai and I enjoyed it - on the menu it said it was \"spicy\" and it wasn't spicy to me.. ( it's like taco bells \"fire\" sauce but it's not hot at all ) The service was okay - It's located right by a smoke stop in a small building.. It can easily be missed. I would come back and try something different since they have many other options but it's not on top of my list when I am wanting spicy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ULvDii8IEJi7pp1xguHI6A",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Chicken Pad Thai with a vegetable egg roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ULvDii8IEJi7pp1xguHI6A/o.jpg"
      }
    ],
    "user_id": "oGhzBlevymRFuBOS1cxJyA"
  },
  "BZHJGvl5YXXqtfnQynPVeQ": {
    "date": "10/18/2014",
    "text": "This place is super cute, the staff is super friendly, but the food and drinks are super ok. I really want to like this place, I do, but the food is mediocre. I will admit though, everything is cheap and reasonably priced so if I wanted cheap and quick asian food I would go here again. The rice bowls are decently good, and the thai-styled burger was actually fairly delicious; however their thai tea was disappointing. The boba also tasted weird and mushy, not how other boba normally tastes.   Don't knock this place until you try it though, this is just my opinion and the restaurant is still in its infancy :) I will definitely try this place again in the future to see if it improves!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ASSfvbV7lPeqbQlWQgMVA"
  },
  "mhReA02mNGvex-bX3R0J-g": {
    "date": "2/18/2018",
    "text": "Great food but extremely bad customer service that just ruined the whole dining experience. And the place wasn't even packed! The five of us sat on the patio and had to go inside several times to remind the waiters to clean our table, then to have them take our drink orders, then to order food, then, an hour later, to see if they forgot about orders ... It took close to an hour and a half for our food to arrive during which time we saw multiple customers pick up their to-go orders. There were two servers there, and the male server was nice but the waitress was very rude and had attitude. When we asked her to wipe our table, she replied that it would be difficult because they are very busy (only 3 or 4 tables were occupied at that time). And as I mentioned in the beginning, the food, when it finally arrived, was delicious. However, it was Not worth while waiting for it for nearly two hours. We will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SHLgssHUeGlWNygrL8QFkg"
  },
  "GI4A9mH-z9FWTlvQctzLIg": {
    "date": "7/19/2017",
    "text": "I loved this place, even though it replaced one of my favorite street taco joints. I had the tofu pad thai (vegetarian), and it was perfect. Very spicy (as requested), the tofu was perfectly fried. I had the Thai tea, which was weird, but it was my first one. I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7dOIogP-B0wmL7s_9sIn1Q"
  },
  "EVfK2N7k_qsMWGvRvgiT3Q": {
    "date": "2/27/2015",
    "text": "Came in with my friends for lunch. I thought it was a sushi place but no. \"It's Thai \" says the guy behind the counter   This is an Asian fusion fast food type set up. It's relaxing and modern with curry noodles rice and specialty dishes on the menu board  I got Thai ferno burger. Not good and should be removed from menu. Their are simply too many burger places popping up that make a better patty RB got peanut chicken and he gives it a three. Lack of sauce made the dish dry with all the sticky rice D got green curry. She gave a four We shared pork dumpling. Big tasting. We got steamed. The server said they are better fried. Two or three make a meal and you get six for $8  They are fast and bring the food to your table. We sat outside.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dGIXjVeTezzeqBfP7vq7SQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Sticky rice dishes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dGIXjVeTezzeqBfP7vq7SQ/o.jpg"
      },
      {
        "img_id": "HQebXVuyNgdinwU4EmaDDQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Ferno burger chili sauce added",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HQebXVuyNgdinwU4EmaDDQ/o.jpg"
      }
    ],
    "user_id": "5XnTaWyjgwVVohu7WubwNw"
  },
  "ZDdc71tZho6PigGVK1YFnA": {
    "date": "1/13/2015",
    "text": "A small little Asian fusion restaurant with big flavor!  My fiance and brother in law came here on a whim for lunch. The decor is perfect for otakus and charming for new comers. My fiance had the candy chicken and it was absolutely delicious. The breading on the chicken was light but flavorful! I had the noodle pad Thai and it was yummy! The pad Thai was not traditional but they gave huge pieces of shrimp. My brother in law had the chicken satay and said it was good.  The location is a little awkward and the restaurant is small but it was completely worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "57IcLEGpgo9N0xlILY2wyQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Pad thai noodles.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/57IcLEGpgo9N0xlILY2wyQ/o.jpg"
      }
    ],
    "user_id": "mUqQ2kisuK6brgUXXv3FYg"
  },
  "Qr3GN2sdJ6vE8EI3i_aaJA": {
    "date": "8/20/2016",
    "text": "Awesome ginger chicken made with fresh ingredients. Friend had chicken pad thai and said it was really good. Will definitely be back with work crew!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_vQ7o2pRXI7xbjwqnvGoWg",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Ginger chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_vQ7o2pRXI7xbjwqnvGoWg/o.jpg"
      },
      {
        "img_id": "SVm49-k3UTeLuQ9GO9IcYw",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Chicken pad thai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SVm49-k3UTeLuQ9GO9IcYw/o.jpg"
      }
    ],
    "user_id": "xQ4VDwPneT-IxlhLI2el2g"
  },
  "Toxv1PS-RahWV-c7HPitPg": {
    "date": "5/16/2017",
    "text": "I love me some Thai food! They take traditional Thai and add their own special touch to it. The portion sizes are good, and they offer a wide variety of entrees and apps. The dragon balls are amaze balls! So tasty. The sweet coconut rice that comes with some of their entrees is ridiculously tasty. Never had a bad experience. They're not my most favorite Thai place, but they are up there!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lVcAzMmT2CUevJIKQwHL3g"
  },
  "15yfB3nqK2986sQfS3jjaQ": {
    "date": "11/29/2014",
    "text": "The prices are right for the food they serve. I love the decor. And their drink menu is good. Lives up to be a good little Asian diner, overall. It's new business so hopefully they improve.  I would get everything besides the ramen. Doesn't really taste like ramen because the noodles aren't ramen noodles and the soup is just full of seasoning instead of actual broth.  Thoughts on improvement: 1. A sign by the sidewalk. You can miss the entrance to the parking lot very easily at night 2. Probably could use a waitress to see if the customers need anything. There was one person doing everything from orders, bringing out food to basically... everything.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3uPAF2-YwiTUN5NvVH6pIQ"
  },
  "3LdpM9tv1eeSM9vcUow4nw": {
    "date": "2/14/2017",
    "text": "Wowza! Stopped here with a friend I hadn't seen since we were in Bangkok together 5 years ago. I can't resist a freshly made Papaya salad and the one here is fantastic! We also shared fresh spring rolls (at the suggestion of our server) and an order of green curry with chicken. Service was outstanding!  Food fresh and delicious! We had planned to stop at their location on Central but traffic was crazy so we opted for the Scottsdale location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "TD3yRgk6xFY829yQ9eFLaw"
  },
  "KjB83tgantDMJ_MmE2ZFvQ": {
    "date": "2/27/2018",
    "text": "Tonight was my first time ordering from The Little Thaiger.  While I ordered through Grub Hub and found THAT service abysmal, when the food finally arrived one hour later than originally quoted time, it was hot, and fabulous.  The Tom Ka Gai soup was one of the best I've had (perfectly seasoned) and the Pad Thai was equally fantastic- great spice, heat, and no skimping on the cilantro.  I will certainly either dine in or take out again, however I will pass on the Grub Hub service.  This may now have replaced my go-to Thai restaurant Thai Lahna.  We'll have to see...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WyPRDTnFEnpp-IDaq7_NXQ"
  },
  "quXDgZUIsjfxae69YePFFg": {
    "date": "10/27/2015",
    "text": "YUM!! This place is very close to my house, which could be good or bad. We came in during an early afternoon and were the only ones there. The place is nice and clean, decorated sparsely but, it looks nice.  We ordered the corn fritters for an app and they did not disappoint. I am actually thinking about going back just for those as I type this. I had the Pad Thai, it was made with the perfect amount of heat I requested. I can't recall what my friend had, but he loved it. I woul recommend this place to anyone, its nice to have some Thai food in this area. There aren't many options here in South Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "D2olw_tyQWAsBb9XTQhv8w"
  },
  "m5W92G7nFHnr8lsWKOaqFQ": {
    "date": "9/9/2017",
    "text": "Excellent flavor and freshness, beautiful presentation with perfectly crafted thai sauces. A definite must try! . .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZpeBGkpNcSeOcMoUECbFxw"
  },
  "LgYz3tA5JkjrtFMk4ljWWQ": {
    "date": "1/7/2015",
    "text": "Peanut Chicken was delicious! My wife's Yellow Curry Beef was too hot but it was tasty....next time we'll know to request mild.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YnE3rHmDn2CIayrPOAnw5Q",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Yellow Curry Beef",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YnE3rHmDn2CIayrPOAnw5Q/o.jpg"
      },
      {
        "img_id": "Ncnkt491nOcG_oEgt3g7aQ",
        "caption": "Photo of Suh Noi - The Little Thaiger - Scottsdale, AZ, United States. Peanut Chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ncnkt491nOcG_oEgt3g7aQ/o.jpg"
      }
    ],
    "user_id": "u6yZXvVwpOtBES7wCNlEBA"
  },
  "soDjR_6nH8guMEL7gPKTdA": {
    "date": "12/18/2015",
    "text": "Went there on a Friday at 11am for Lunch. Party of 3, all ordered Chicken Pad Thai. It took about 40 minutes to receive our food. They might have been short on cooks or something but regardless, the wait was pretty long despite we were the only other customers along.  When the food came, the presentation was decent. Lots of curly string carrots, bean sprouts and shredded cabbage. Mixed it all together and went to town. Taste was decent 8/10.   The environment is nice and modern. There are some interesting desserts and they serve alcohol which most other Thai places typically do not.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ifobaHSMEX2ylus_XU4Kbg"
  },
  "HbekcFiYc_LfW2yzQrinlQ": {
    "date": "1/2/2016",
    "text": "Awesome little place, love the atmosphere and artwork.  Food was excellent - fresh and healthy preparation.  Service was good and quick.  Parking is in the back.  They even have a drive thru!  Recommend the Pad Thai and the Fresh Rolls.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0jysa5m28UvY6AMjHtU4aw"
  },
  "jwafSnD7GSzqUADqaqPm-Q": {
    "date": "3/16/2016",
    "text": "Currently sitting here now. While the food has been delightful so far, the service has been severely lacking. We started our evening by walking in to the restaurant and up to the counter, where the server had her back to the door and us for several minutes. My friend and I stood there talking and while I hoped that the sound of our voices would cause her to turn around and notice us, it did not actually happen until she went to move away from the counter.   The entire ordering process was painful as she kept telling us that \"she'd be right back\". Despite only having one other table at the time, this girl seemed to have a great deal of trouble multitasking.  Considering how much I enjoyed the original location in Phoenix, I'm greatly disappointed with my experience tonight.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "onYPcCY0Wxgl3PeoJjM1EQ"
  }
}