{
  "iV9Ib7-AAdf_L7jhoVy_Kw": {
    "date": "11/21/2015",
    "text": "The staff was friendly, courtsey,helpful, the service was great the food was great hot I would recommend them for food this was my first time here I'll be going back for lunch again in the near future",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "01SmNktz-M6sQV0xEImhIQ"
  },
  "f-6oae7TltlfJicUiZdC8Q": {
    "date": "2/12/2013",
    "text": "Had a hard time focusing on reading my book due to the rowdy crowd around!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "519-B5QRcwP1pd1QolV6Jg"
  },
  "LZTV7Xcm8h8ZNd7nB0-6rA": {
    "date": "10/18/2010",
    "text": "CK's is in our neighborhood and we have gone several times. It's pretty spacious, even when is full it doesn't  feels crowded. They have TV's everywhere. The patrons ranges from bikers to families to rabid sports fans.  The food is your typical sports bar food. The fries are pretty good, I've had wings, burgers, and they're OK. I don't know why, but my wings usually barely have any sauce on them. I'm sure though that I could have asked for extra sauce no problem.  The service has always been great, friendly and fast.  All in all I'll give them 3 stars for food and 5 for service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jOERvhmK6_lo_XGUBPws_w"
  },
  "wF7yNLjeiTijhRYdp8DVFQ": {
    "date": "12/12/2013",
    "text": "New to Phoenix from out of state.  Found the bar staff extremely nice (Heather) and talkative in welcoming a new patron.  Beer prices were \"a bit\" steep, but overall a great experience and good apps.  Took the family back for the Friday fish fry which was outstanding and as close to home (Wisconsin) as we have had in Phoenix.  We will continue to be regulars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ryrKNfppYzFj39tnMXQ8Sg"
  },
  "MgqFsOsKg_A0ueRv0y0nGQ": {
    "date": "1/20/2010",
    "text": "Since the husband and I have finally decided that we've exhausted our choices of restaurants in PHX (mostly due to me being so finicky) we have pushed our restaurant search a little further out of the city.  This search led us out to CK's Tavern and Grill.  My first impression was that this place was nuts!  There was a rather raucous crowd on the patio watching the Suns game, and everyone seemed to be having a great time.  Inside wasn't much different, with most tables being occupied, but a couple were quickly cleared off to make room for us.    We only sat down for a minute or so before our super efficient server came by.  I really like watching servers and seeing how they do their job, because frankly, there aren't very many good ones anymore.  This girl was awesome.  She didn't do one single thing without doing three others at the same time.  If she was bringing our drinks, she was also bringing the check for the table next to us and the drinks for the group on the other side.  She was awesome.  It actually seemed that most of the other servers did this too.  They must do some awesome training camps here or something.  Anyway, we each ordered a dozen wings, I got the honey and I tried the husband's raspberry chipotle.  We also got an order of beer fries just in case.  The fries were great and super crispy and we got a big fat side of ranch with it.  The wings were searingly hot and when I finally got to bite into them, they were pretty good.  The honey one's are literally just that, honey.  It was a nice alternative to the heavier stuff.  The raspberry chipotle sauce was pretty tasty, but not my favorite.  Meanwhile, after I ate most my wings, I decided I wanted more fries.  They were no longer hot, but surprisingly, they were still crispy and tasty.  Sweet.  We will most certainly come back here if we're in this part of town.  When you group a really fun atmosphere with a million TV's and awesome service, you definitely get my vote.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "XNSyl47aXuPsvC5zXm5uhw"
  },
  "g52CCGtgrJriu77DijHUKA": {
    "date": "9/11/2013",
    "text": "We come here all the time because it is a good mix between sports bar and good place to bring the family for a fun dinner. They are typically fairly busy but we never have trouble getting a seat and it is a good place to catch a game. On nice days. we love the large outdoor patio. I do wish they had some light beers included in their beer specials, but the food is great and the drinks are priced right where they should be.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KiPMHu2VvWYqOvsRklZjfQ"
  },
  "7V1zR-jLXmlstDCrXLahjw": {
    "date": "3/27/2015",
    "text": "Really disappointed that I wasted my time and money here. The restaurant was dingy and band too loud to hold a conversation. The wings were dry and bland, salad tasted like feet, beer tasted like soap and burger was undercooked. Server was very nice but don't think I'll be back here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "00Z4RW8QuRbS-o10PVPb-Q"
  },
  "yOGdfO94xwvBGSN-eeCb-w": {
    "date": "9/8/2015",
    "text": "Food was good, drinks are priced right and it is a great atmosphere for watching sports. I would recommend this place to anyone interested in a casual and fun time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BtJ_JaUGhEVMkhKk3OgPeA"
  },
  "6Cwf3Tc0XQxEb75uZKS8gg": {
    "date": "6/30/2012",
    "text": "Stopped in for a drink while killing some time. Service at the bar was fast and friendly.  Didn't try the food, but if I was in the area, I would go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DYP5LC1egv2b2GNo7D8FNQ"
  },
  "zEcd6d9b5NPNMpIOBmjXNg": {
    "date": "3/9/2015",
    "text": "We thought we'd have a problem getting in on a busy Friday night. We were happily surprised to be seated immediately, and as soon as we were we had a waiter getting us a drink (great beer selections!). Our food order was taken and came out quickly, and was fantastic. They also have the on-line Buzztime trivia contest, so that was fun to pass the time. All in all, the service was fast/friendly/efficient, the food was great, prices reasonable, and beer selection excellent. We were first-timers, but we'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N3zJl11fqiy2ZcFa8z-ALA"
  },
  "5OZL6BmICnbfxO9WTIdl8w": {
    "date": "8/9/2014",
    "text": "Went here on a first date last nite, we met on the internet, so I was a little nervous. The wait staff was super kind and the band was great! The whole vibe of this place really made me feel comfortable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "481SZ4QBm3vXJ36q924dLQ"
  },
  "rlgwu67ulRTkCtaepCoU-Q": {
    "date": "8/13/2015",
    "text": "Service is always great and the waiters and waitresses are always super friendly. The boneless wings, raspberry, finished on the grill, with a side of hot sauce might sound crazy, but I'm telling you, no joke!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-IWEAlIu06QavzqqUpwyYQ"
  },
  "ozo-79m7xvCNHAdprrHnTQ": {
    "date": "5/7/2012",
    "text": "Every time I go there it seems to be about the same great atmosphere. Excellent service, cheerful wait staff, clean restrooms, tables and the selection in live music is awesome. I always recommend any of my friends to this place when we want to hang out, have a few drinks, eat or watch the bands. Only thing I would say is not that great is the parking. It's extremely tight and your car will get dinged.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2EoDMnaTeS82IRu5m4ATnA"
  },
  "Z7GYmXgt1Cq13aR2Andyhw": {
    "date": "1/19/2010",
    "text": "This place kicks serious ass.  We went on a Friday night and, while I expected it to be busy, I sure didn't expect this.  There were TONS of people here.  It seemed like everyone knew everyone else and that everyone was just there to have a good time.  There are easily a dozen tvs on the wall in the dining area.  They have tons of beers, arcade games, and pool tables.  There is a nice patio with tvs and the servers are great.  As for the food, I only tried the raspberry-chipotle wings and the beer fries but both were great.  They don't charge you for ranch and don't screw you by making you order a minimum number of wings in a certain flavor.  You could get a dozen wings in all the flavors if you wanted - now that's how it should be done.  I don't usually go to this part of town but this will definitely become my new hangout when I'm in the Tuk.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-RhRXVW9z9fs5zzxhFfnHg"
  },
  "b1LRVUTf1fAnUFNnv8rw9g": {
    "date": "11/7/2012",
    "text": "Simply put.... Typical run of the mill bar food and service. Nothing special, but nothing bad either.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NwTxmU7bJW5p43onH1ObQA"
  },
  "yNfzQxn9DWcQLrNO1w1jSQ": {
    "date": "10/14/2012",
    "text": "Best place to go to for wings booze and good times! Very friendly environment. Staff is amazing. The honey hot wings are so yummy with a side of bleu cheese and ranch. I suggest the buffalo chips with everything. Happy hour is 7 days a week and well worth it. It's always a good time at CKs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_fIke2GaYsD_enl51O7uQ"
  },
  "bM-uuPOuOOSYHkF_1Qx0Eg": {
    "date": "4/4/2015",
    "text": "Great place to watch the Final Four.  TV's are everywhere and the wait staff is very laid back and helpful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UfB_Yb3MXJXRD-OusFnAnQ"
  },
  "QTPk1eWegqMxx_Zt0w7Q6Q": {
    "date": "10/20/2012",
    "text": "I went to this place because the best wing flavor award someone told me about. Chipotle Raspberry wings gives a new twist on played out flavored wing. The service is good and the food was hot and affordable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jEjMfYBBFnhcuT1WU4Y-2A"
  },
  "DP97ew25C3g-gsEuq0hKGg": {
    "date": "7/1/2013",
    "text": "Service is very good, the staff is so friendly it made me want to come back even before getting any food or drinks. Food didn't dissapoint either..boneless wings were some of the best ever..lg portion, cooked to perfection. .not the soggy, overly breaded ones that everyone else serves..just naked, white meat chicken breast strips fried up with a tasty sauce...wife has a small chef salad..now she gets this all the time at other places and you would be surprised how many restaurants screw this up.....not here..everything was fresh and top quality.....can't wait to come back here and only wished we lived closer.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pZMaLb0C6oHARUmf-_C3-g"
  },
  "hQ85frqmteu_GSA4muH6kQ": {
    "date": "3/23/2012",
    "text": "Great service! Tasty, well prepared food and good variety. Buffalo fries nice and spicy! Service started out ok but s,owed a little towards the end. Fun upbeat sports bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JLfp1PxNPI_8sGukOFfnhw"
  },
  "psYgvWBQqnRG24Bk1bywaQ": {
    "date": "4/29/2015",
    "text": "Pretty good place. The live music quality is pretty poor. However, the wings are delicious. Specifically the raspberry chipotle wings! Downside: No Moscow Mules.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Gl9ca17BFELtYWplPWM5Cw",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Gl9ca17BFELtYWplPWM5Cw/o.jpg"
      }
    ],
    "user_id": "_7fLIfvnfPHjdyPqlrMTVQ"
  },
  "CgLb18UlA2gGXdctibt87A": {
    "date": "3/10/2015",
    "text": "We are in town for spring break and someone recommend this place to us.  Service was slow at first but was rolling after that!  Salad was Super delicious,  we had a vinaigrette dressing, the penne and meatballs were excellent!  And we had some wings which were good as well.  Gotta try the cheesecake for dessert,  so good. We will be coming back! They have great specials all week long.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TdOpCxG2JOeSy0ad9uIM6w",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. Penne and meatballs with the salad.  Delicious :)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TdOpCxG2JOeSy0ad9uIM6w/o.jpg"
      }
    ],
    "user_id": "WiMF6pQTnMlaQuEGTskcIw"
  },
  "vejPYNQePOco9HT1noH0cw": {
    "date": "10/5/2016",
    "text": "Great atmosphere and food, the beer batter fries were crispy and not oily, burger and chicken sandwich were excellent,  drinks very reasonable, great happy hour. Definitely will go again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vXiLlRtx8Q9earcTMAwUsA"
  },
  "XzVsIIm53Rzzz43QMVXtZg": {
    "date": "2/14/2016",
    "text": "Sent my father and some friends here to dine and watch a basketball game tonight based upon the favorable reviews. The men had the meatloaf and the other had chicken. They reported that the food was very poor quality. Had it not been for the pleasant waiter, the experience would have been awful. Management did respond and seems to be very committed to customer satisfaction, which tells me it was probably a rare occurrence and a second visit should be in order.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4bcNhTtLC_VISOC8S3vk7Q"
  },
  "x-8euVcAod17SZvqCMdTCg": {
    "date": "7/13/2016",
    "text": "best serves  cold beer good wings Chris you are the best",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ifn1cWyI6v0EC3bn2yhVvA"
  },
  "rJqJH1ml6o5F7DKbMINHGg": {
    "date": "11/17/2015",
    "text": "Before my boyfriend and I moved, we used to come here during late nights for wings. I absolutely love their raspberry chipotle wings! So delicious. I would always order those with a Stella on tap. This is a great place to kick back and the food is always good. One time we came in and didn't get acknowledged for 15 minutes so we left, but generally the service is good too. I highly recommend for wings!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "o_omRoAfmXQmN-6wDUVtvg"
  },
  "SRCHxRzq5ik0xm4LTUmurg": {
    "date": "1/16/2016",
    "text": "We stopped in after the Cards game for a late dinner and drinks. The band was awesome but the food was far from good. Nachos were bland and boring. The Philly cheesesteak was decent but small. The food quality was below that of a Denny's type of place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QkWXnyxhW8dCvIXJYcRJ_A"
  },
  "eARIFwOK_F1mKaX1xLpCLg": {
    "date": "1/15/2014",
    "text": "This bar is your typical neighborhood sports bar.  Decent food and good service will make you want to return. Large smoking porch with mist is nice if you are a smoker (I am not) The smell of cigarettes tends to drift into the bar.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SsYDYuT792irBRoGpcOmrA"
  },
  "pDvZuWbbYPHV16GAmnGjUw": {
    "date": "8/7/2016",
    "text": "Definitely the best bar to be at in Ahwatukee!  Anyone else been going here since the Famous Sam's, than Bar None days?  Once it became CK's many years back now the food menu took this place over the top!  Some of the best bar food in all of Arizona!  I always get the medium wings, only grilled and they are phenomenal!  My wife gets the chop chop salad and says it's amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xoRfEjxEJZxXEJOyTFk3nQ"
  },
  "9zOH3LPgAUi_kcmLK17szg": {
    "date": "2/22/2012",
    "text": "Let me start this off saying the place is quite good for bar food, but it just is not to my tastes.  If there were 1/2 stars, I would rate it a 3.5.  I came here last night with the family and we had GREAT service from our waiter.  He was on top of everything except soda refills, but he was VERY busy.  He was excellent at providing recommendations and he was very friendly.  Top notch for this kind of joint (especially compared to Loco Patron, where servers can sometimes go missing for 15 minutes or longer).    We ordered several dishes.  Here's what I can remember: beer battered french fries with melted shredded cheese (sides of ranch and ketchup), three kinds of wings (mild - for grandma, hot and hot bbq (both grilled), salad, chicken fingers and tots for the kiddo (she didn't even touch them so I have no idea how she felt), Sierra Nevada pint for $2.50 and a glass of wine for Grandma.  The french fries were yum-o dipped in the ranch. The wings were good but... I am just not a fan of their crushed red pepper flakes.  Plus, my wings were charred black and I am just not into eating burnt wings.  I like the heat of the wings, though they were NOT really HOT to my palate.   The salad was covered in egg, so if you are into that sort of thing... go for it.  It was Grandma's and she liked it.  I just don't like egg on my salad.  Or cheese.  But that is me!  Overall, I think it is a decent place and the service definitely bumps it up.  Would I eat here again?  Well, maybe.  I would not go out of my way, but I would join someone if they were coming.  I appreciated the good service and that's why the 4 stars.  Service is a rarity in the so-called Service Industry.  Hopefully CKs pays their employees enough to entice them to stay!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CqQckjSabqVNz7R1BhtfYQ",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. 1/2 shrimp (4) 1/2 chicken basket (2) and buffalo fries.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CqQckjSabqVNz7R1BhtfYQ/o.jpg"
      }
    ],
    "user_id": "_jjbwHWLFA5GjWFWGLj4ZQ"
  },
  "BUq86pfGBkiTQK6n6C_-DA": {
    "date": "11/20/2013",
    "text": "I enjoy CKs.  It's a dive but it's a comfortable dive.  The food is decent, the live music is always enjoyable, and the daily specials are a staple.  The happy hour is 3-7 daily and there are reverse specials as well.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sOudRDE_R3VYni0rEYFkSA"
  },
  "uAgF0aBHP4lb_cCi0W83gw": {
    "date": "11/20/2014",
    "text": "Krista is the best bartender, CKs is an awesome establishment to bring the family, great food and fun atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mtvfgWnsXg8WBjcPgrkP6g",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. Top floor dining with a band",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mtvfgWnsXg8WBjcPgrkP6g/o.jpg"
      },
      {
        "img_id": "vThKfp_UImZXsdmiVI86pg",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. Pool table",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vThKfp_UImZXsdmiVI86pg/o.jpg"
      },
      {
        "img_id": "6dFWRxJr1uFeP68QXRbXcg",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6dFWRxJr1uFeP68QXRbXcg/o.jpg"
      }
    ],
    "user_id": "ULiqcNeq0-yxqDE6k6WNug"
  },
  "RrFY2KXUsjqsxYK77AFMQg": {
    "date": "1/28/2015",
    "text": "I like the Carne Adovada plate.  Really good and filling. Lots of draft beers.  Good to bring the kids.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G9HdDKXZnIGgIMcfUE4b_A"
  },
  "W8YVsRIEz7_eVbP3oP06Pw": {
    "date": "1/27/2016",
    "text": "This is my favorite place to have a burger in Ahwatukee, I was very disappointed the other night that I went there . I ordered my burger well done and it was served  medium to raw. I told the waitress and she asked me if I wanted to make another order, um no...I want my original order the way I ordered it. I wish I could post a picture of it on here, a photo speaks volumes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bm9sru7f8ifVRnTHfAtfhA"
  },
  "qw-m8wZJZWxLGJjlOE0Tew": {
    "date": "4/13/2017",
    "text": "After being a relatively regular patron for the last two years (visits at least once a week-don't judge!), I have finally decided to put my two cents in. There is a reason that CK's is the place we go when nothing else sounds good. Let me start by saying they have SO MANY tv's. Any sport you could imagine watching. Trivia (Buzztime). Nearly every televised NFL game. Now food. I would rate good 4/5. Better than five bar. By no means gourmet but absolutely edible and without complaint. All salads great (except they got rid of kale :(...). Burgers fairly  decent. Nachos awesome. Decent sandwiches. I mean it's a sports bar. So considering that, food is nothing to complain about. Awesome daily and happy hour special. Monday is San Tan night. Friday all you can eat fish--OMG. That's their BEST. What keeps us coming back is the AAAAMMMMAAAZZZIING beer selection. And the service. Katie is honestly the best server I have ever had. Sadly for all other servers at every establishment, they are all held to Katie standard. None have measured up. Rarely do any even come close. She honestly cares about interacting with her customers. A keeper-although I hope she goes on to rule the world for her sake. Anyway, she knows exactly what we want and when we want it and it took her a grand total of once to learn it. Juleesa is a close second as is Kelsey. And honestly, in all our visits, we have had half a visit with less than acceptable service and never have seen that server there since. Live music weekends although the type they play is not really our thing-not terrible. Just not my cup of tea or whiskey. Fair prices. Clean. We are more than happy that we got an off-the -cuff recommendation for this place several years ago.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sSPbLBHcEMXaJfoO8zs1bA"
  },
  "dYEg2NVwVqGjIFNowPk-yA": {
    "date": "12/30/2016",
    "text": "ordered a burger with a side of jalapeno coleslaw thinking it was made with some kind of jalapeno based sauce. what I received was a bowl of regular coleslaw with one sliced jalapeno on top. 5 stars for being so literal.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pVGlJzEj_e5SNDjbmZtsww"
  },
  "D7gU5VzTkNBkr-wr4dtT0Q": {
    "date": "5/8/2016",
    "text": "This place is always chill. Great service and really good wings! Easily the best lunch spot in the area and great for evening sport events as its not overly crowded yet still exciting environment. Def recommend the chipotle raspberry sauce for wings and def get their beer battered fries, holy cow they're amazing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W5Iaz9BcTEvJmWKYT6aktQ"
  },
  "6eO-9tuLj80vjAK_Od_hjw": {
    "date": "3/25/2015",
    "text": "I came in for a couple of pints of Guinness,  first tasted ok (not what I'm accustomed to, but not bad). Number 2 was not good...noticed that the bar keep didn't know how to pour it.  When I asked for my check (my card had been handed to a different host without telling me), I mentioned the taste of the Guinness,  and the bartender and waiter became very defensive...both came to me to apologize to me, but didn't ask what the problem was. Not sure what I did to make them uncomfortable,  but I just settled up, finished up (as much as I could) and went home.  Not sure I should come back...kinda weird.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z11rcTbR7Wx_7oKvh6Kulw"
  },
  "08mW22ysYc7Xw1FSOF6rrA": {
    "date": "11/7/2013",
    "text": "Can't beat this place! Excellent service, excellent food, excellent company!  I've been a regular (although not as often as I'd like lately) for over 4 years, and its always awesome.  From Brenda, to Heather, to Erin and of course Kendra, all of the staff at CK's is amazing!   Great place to hold a fantasy draft or just drop in for wings (raspberry chipotle grilled with a side of hot!) and a beer.  You're always treated as a VIP at CK's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MTDhKoQ-av8gO2_Xk4pWSg"
  },
  "Qt42FrfICPXlorf_5Kdivg": {
    "date": "8/9/2015",
    "text": "Food was amazing, healthy and fresh. Brittany was just icing on the cake with her great customer service. Price was very reasonable too. We will definitely go back to this neighborhood bar",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "v9KLzK_2OnsWqqyAIFck-w"
  },
  "1awNIzBp3srSy3IQRwKpkg": {
    "date": "3/31/2017",
    "text": "Not too shabby of a spot... cool for drinks and wings type occasion. Not in a rush to go back. Staff was very friendly however. Burger was somewhat bland.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "taQba8i8A6OhEKwwdyhKrA"
  },
  "BJwDLzzCq5hpetFCPIWCiw": {
    "date": "9/3/2015",
    "text": "If Tukees think this is the business of the year, I am concerned we don't have high enough standards. Food is good, yes. Decor and cleanliness is lacking - big time! Grease coats the framed jerseys and posters, and woodwork hasn't been maintained since it was built. The place is dirty! The place is tired and needs a remodel.  The bathrooms are from the 80s (and can't even lock the doors or sit on the commodes due to no seat covers available), the OHIO theme is ugly, and the dining area makes me feel like I never left the disco era.   Come on CKs - make us proud in The Tuke, so that we could consider bring guests here without embarrassing ourselves.  Fellow Tukees there are so many places in The Tuke we can go and get great food AND feel good about being there.  CK's doesn't meet the standards of the specialness of Ahwatukee.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "0E1ye_BTDdHn9przpjm3Ng"
  },
  "_vyjJ7EpayIqBhwDnj8chA": {
    "date": "9/15/2015",
    "text": "We used to love CK's and visited frequently. The old happy hour was awesome-both food and drinks for a great price. The kids also loved their kids meals (around $4).  A few months back (after their \"remodel\") the prices changed and so did the Happy Hour specials. The service also seems to be lacking now as well. Last time we were there we had a party of 10 and they couldn't get out orders right. Some of the party was finished eating before the other food was brought out.  Parking is always hard, so just park further out in the parking lot and walk. Or better yet, take Uber.  We loved going to see Chuck E Baby there. I know he still performs there, but I'm not sure it's worth going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ke6-eR2JMENyFENQnWZ3tA"
  },
  "r1edVYOdBvaiG3bH99QNhA": {
    "date": "8/26/2013",
    "text": "It was a Friday night date night and CK Tavern was the place that was picked, it was his pick and I was going with the flow.  We were seated ordered our drinks, then the conversation just started to flow, our waitress came by 2 twice to see if we were ready to order and to be honest we hadn't even picked up the menu as of yet. She then told us to let her know when we were ready, and after an hour went by we took her up on that offer.  I wound up ordered the Chicken Cheesy Phil with a side of fries. This was a great little sandwich, chicken was perfectly cooked, the bread soft yet firm. It also had the perfect amount of cheese too, not too little nor too much, I have to say I really enjoyed my sandwich.   We wound up staying for few more hours, and I had to ask him why he picked this place because he is neither into baseball, football, basketball, and he said it was because it was close to my work. Scored him some bonus points! Haha   CK's a great place to catch some games, grab a drink or just hang out with some friends, glad I gave it tried, and look forward to coming back!   **oh because this was a 1st date night, I wasn't fully comfortable with exposing my Yelp Nerd yet, so no photos were taken :( haha **",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "bpgbVPJcG-wQ4cNBcPPIxw"
  },
  "ghLkKDaN4HLImbvg8_9ZfQ": {
    "date": "6/15/2017",
    "text": "Recently relocated to the neighborhood and CKs is our new hangout.  Awesome service every time we visit, food is great.  Live music every weekend.  Great local hangout!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M4ADPO1lsHHgGkAuMnoRDA"
  },
  "3-g6ozbi8lfGtgzLWoae3g": {
    "date": "7/27/2016",
    "text": "My boyfriend and I used to visit CK's Tavern & Grill more often before we relocated to another part of our city. I remember ourselves getting the wings for a late dinner. So nostalgic. I recently came there to find out if the place was remaining such amazing as I knew it. I grabbed the raspberry chipotle wings and realized that was exactly what I expected. One more must-to-try is their Stella on tap! Generally, this place in great, except for the time it's getting too busy.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "q_6fDDpKXk0GiQkQ5BwZfA"
  },
  "Y-UcmpEZxpQETd27GYW2DA": {
    "date": "2/11/2017",
    "text": "We live across the street tonight..frequent visitors... we got a pleasant surprise... TRIPWIRE they are awesome not to loud and not to quiet please come back your awesome!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hZqyiqFmuCl-bwfDEoN-RQ"
  },
  "8fw15d575D0-_SIH-hfY-g": {
    "date": "2/26/2017",
    "text": "Great back room for families.  Kids can play around while you enjoy a beer.  Always great service, pretty good grub.  Even showed a ton of love to my little girl scout and asked for cookies which we happily brought in and sold a ton.  Local, family friendly.  We like CKs!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HtK0cIly5ZF3h_JtnratwQ"
  },
  "HwllCtaCnrlEKPlQSmbUpw": {
    "date": "5/18/2017",
    "text": "Best happy hour food specials! Great burgers and even better fries, wings are delish. Staff are super fast and friendly. Live bands on Friday and Saturday nights. Love this place!! We are there at least once a week :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RZAdAj_nXAt2DaG5w8GPlw"
  },
  "nFlw4LVOpp9t72PO2j_8-w": {
    "date": "1/13/2018",
    "text": "Drea is wonderful. Food is good. Music is awesome.  Please CK'S,  fix the ceiling fans!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lO0eVRm1gxpuMDq6YdkTsw"
  },
  "RRdfB2q8qNAlIuI407FDmA": {
    "date": "2/11/2017",
    "text": "I tell you what 5 stars for CKs as a place for food and drink! Been coming here for years...but the band tonight Tripwire had me want to review! Both are awesome! CKs bring them back ASAP!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XTK_NqPWhX24MlxBkJo4ag"
  },
  "xTRxXoRzFRiA__8Nc0RokA": {
    "date": "8/28/2015",
    "text": "Nice happy hour specials - good wings, and the all you can eat fish fry was very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MZcBOC9KbiSgRO98Wu-wHA",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. Good hot wings!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MZcBOC9KbiSgRO98Wu-wHA/o.jpg"
      }
    ],
    "user_id": "JRZnzzAnlQAzttZBlMj1Yw"
  },
  "EQcu1xm3msEfCXdAwd7Xkg": {
    "date": "4/25/2017",
    "text": "I absolutely LOVE the food, the atmosphere, and the staff at CK's! Their menu is full of surprises. The Chipotle Raspberry Wings are a MUST try! If you are in the mood for a burger, the Big Father Burger is the one to try. It's HUGE! With two patties, onion rings, bacon and 4 types of cheese....you won't go away hungry. The staff are sure to put a smile on your face. Cheers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vUCd6dXCz5ky3wV7O9P7aQ"
  },
  "ZSgGc9W0DX0rV0ytoI1ZWg": {
    "date": "9/11/2016",
    "text": "This review is based off the wings. My BF wanted wings so we stopped in here. The flavors were ok, definitely nothing to write home about, we got the Raspberry Chipotle and the Sriracha Glazed. For $10 we got the smallest wings ever. I almost felt bad for the baby chickens they killed to even get wings this small. I've never been so disappointed. SIZE DOES MATTER PEOPLE.  We also ordered the bruschetta, also bite sized. Other than the wings, the service was friendly and the beer was cold. That gave them 2 stars. Left hungry.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KC_xSxWjWUVEznSX8ObaRw"
  },
  "5lmYGhKkYJYJk8fqAcW_ww": {
    "date": "1/7/2017",
    "text": "Great neighborhood bar.  The have good food and decent prices on drinks.  They have an outdoor patio that is a fun place to watch football games.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ooYoM6jYMXt0XuVy5LQ6xw"
  },
  "56kE5txyzs5v3BX4uJNs7w": {
    "date": "2/19/2017",
    "text": "Ordered a shot of her Neato three times each time a bug in my shot gave me 1800 but did not compensate",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X-WjjhrnflPy_RzcjXfMyg"
  },
  "yb0AMU8bF7Q_n5Rx7YwsvQ": {
    "date": "7/10/2016",
    "text": "Been going here for years, no over a decade now.  Always been invited by family and neighbors of Ahwatukee.  I try to talk them out of it but I get stuck going.  Why only 2 stars- the food is so below par, it's obvious they get items from Costco.  And it's over priced.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4N9UHNHERY33dELmZOhnTA"
  },
  "1mSeqZw_Uh4yW4wXhTr7MA": {
    "date": "6/10/2015",
    "text": "Ok I have now moved up CK's to the 5 star elite group. I keep coming back for wings, salads, burgers and their sweet daily specials. My honey likes them too. So I recommend this to everyone that wants to have a good time. Music is good too and so much more....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "XMQeA7VHNS-NS2Feh5W2Kg",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. Enjoying the sweet16 with John the main man at CK&amp;#39;s. Best place in Ahwatukee by far....",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XMQeA7VHNS-NS2Feh5W2Kg/o.jpg"
      }
    ],
    "user_id": "5ewWUpDuTUFPVGov9DxsxA"
  },
  "3j3F6mlLjpkHhUOWWpwCkQ": {
    "date": "3/27/2015",
    "text": "I wish I had come to Yelp before going here. The service was the worst I've had in at least 10 years. The bartender was too busy talking to either her co-workers or some guy she knew to be bothered with basic things like asking me and the guy sitting next to her if we needed anything else, if we needed to pay or if we wanted anything.  I ordered the sliders (which only came with cheese and meat by the way) and had the person that brought it out pretty much drop it in front of me and walk away. At 99% of establishments they ask \"do you need anything else?\" but I guess service isn't a priority here. Usually ketchup and mustard are at least brought out, but not here. I had to ask for everything from napkins to a menu.  The bartender was either story telling or just talking because all I could see is me waving trying to get her attention for about 5 minutes and all I heard was her dropping f-bombs when talking to this guy who I assume was a regular.  I left a little note on basic customer service but I'm sure it'll go ignored. My first impression of this place is really as low as it gets. Bad service, average food and a wasted night.  I truly believe in supporting local business but this was dreadful. I would advise anyone to avoid this place at all costs. Very, very unimpressed with everything about it.  You've been warned.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bsC85AP-2NhJqBd__M-mDA"
  },
  "8I7IERyzmTU5u_pwKGkmwQ": {
    "date": "8/30/2014",
    "text": "My office just moved to Ahwatukee and so my boss treated us to lunch as we got more familiar with the new neighborhood. Our staff enjoyed a variety of salads and sandwiches, but the menu has pretty much anything you'd want at lunch or dinnertime. And beer, but that wasn't on our agenda this time!   I ordered the teriyaki chicken sandwich and tots. YUM! It was soooo good. I didn't have much to say at the working lunch, because I was too concerned with stuffing my face! I really liked my meal. The sandwich was even complete with two pineapple rings and teriyaki sauce for a sweet combination! Our service was attentive and the bathrooms were clean. I think our staff will be making CK's a regular thing!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_9WKSGfBn193Wl3vd7kt1A"
  },
  "LdRR-7vqBAtDzHldbeEMJw": {
    "date": "5/8/2014",
    "text": "I was surprised the food showed up so quickly but then I realized it was probably sitting out for an hour or so earlier. The wings were bone cold. The pastrami sandwich was almost as cold. Here's the kicker. How can you screw up water. The water we ordered could not be consumed. It tasted like it had chemicals in it. If I end up with a tumor I'll know it was because of this place. Do not enter. Drive down the street a bit further and try your luck somewhere else. I am not sure why this place was rated so high. My guess is that their taste buds were burned off in the intense Arizona heat.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tUGFPlSUP_l7PGqKX0HbqA"
  },
  "UP9Jeea2Fy1DXgpDpY22vA": {
    "date": "9/6/2014",
    "text": "Dive bar experience at upscale prices. Good place for cougar hunting, so it saves a star.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7M2snsVHGq1DBVSxcBQklw"
  },
  "6z3ajbBwldh6JT_mH7EJzg": {
    "date": "4/7/2014",
    "text": "I love love love their raspberry boneless wings.  SO GOOD.  they also have really good burgers and its just a fun sports bar.  The prices are decent and service is great.  I always return for the same thing my wings!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3mfOGv0puI7a4dU_iRXYxg"
  },
  "aIRceKOt0zig9B9Yx-zTiw": {
    "date": "11/25/2014",
    "text": "Been there once for happy hour they have great deals good food and a lot of options. Only bad thing I can say is it's kindve dark and there and not really welcoming for a sports bar but the staff are friendly and attentive",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gusL5kiK4ALvt2LeDcC-uQ"
  },
  "sple5ACpt5CbfqGbh8Ostw": {
    "date": "11/30/2015",
    "text": "Expected more from a place that claims business of the year.  My wings were over cooked and the bartender seemed like I was bothering him. Love the patio for a beer and a game though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SEgN685ZDVXInVzbnu2ipA"
  },
  "5O3ci-WjsNQ_mECQ71LwWQ": {
    "date": "10/6/2015",
    "text": "My first yelp, CK, just be thankful I wasn't there with my adult daughter and wife.  As a professional chef I am not the easiest person to go for food with, that said I have visited CK often enough to know what to expect, decent food, price and service.  Wife and daughter have dinner, daughter orders a stadium dog, one bite \"meh\". Takes another, not liking the taste, doesn't eat it too salty.  Server comes by asked her about the dog, didn't like it and says she will take 1/2 off and leaves the bill.  My girls look at each other and with question marks on thier faces, \" 1/2 off, why not just comp the meal?\"  Asst. manager comes to the table and asks about it and my talented professional server daughter says she didn't like it, he says \" I will take it off the bill.  My girl says thanks, not asking or expecting anything, just going to pay and next time don't order the dog. Next here comes the manager, lets call him MR. Duche.  He starts to grill my girls over a 1/2 eaten dog, \"What's the problem, you ate half of it so we should only take 1/2 off.\"  They tell him that the asst. mgr. was the one taking it off the bill, no grumpy customers here, Mr. Duche continues to say that he was wrong and he will deal with his Asst. later.  Mr. Duche continues to discuss the 1/2 eaten meal and my kid is like what the hell is going on, lets get out of here.  Manager looks at my wife and says can I get you anything else, maybe not because your daughter wants to leave.  Take a look at the other reviews, pattern, just be thankful Mr. douche I wasn't there",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3z07A_f4-IGThfLoRr69A"
  },
  "gLtFG8J0jHWQw_rdtmE0VA": {
    "date": "7/31/2014",
    "text": "Bottom Line: CK's is my take out wings place, excellent quality, reasonable price easy pickup.  It's also a great place for live music, good appraisers and a pretty decent happy hour menu.  It will continue to be one of our Ahwatukee neighborhood places to frequent!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jd1Dl5mYmtKpPX3wn9rfJw"
  },
  "LP5WQmVJumM0NNVEgc_LKA": {
    "date": "4/3/2016",
    "text": "CK'S is a great place with great food, great service, live music and a love for the community. Kendra and staff go out of their way to make your experience enjoyable. We love CK'S!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aIDnn4BY1XsDQ0BI5VuHGQ"
  },
  "Q2SgOmx37ORudniNiZGaEQ": {
    "date": "3/6/2014",
    "text": "I've heard so many great things about this place that I was looking forward to giving it a try after moving into the area. I've given it about 1/2 a dozen tries and have to say I've been underwhelmed every time. I keep trying new things, trying to find something I love and would continue to come back for. I've had no luck so far. That said its a great place to watch a game and the staff has always been great. I'm sure I'll be back for cocktails and to catch a game. I'll just probably eat elsewhere before going.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vH1rENGv8sJez_ic6Pj7gg"
  },
  "YIL1LgeEbTlYU5t_odoldQ": {
    "date": "6/5/2014",
    "text": "Great happy hour! If your late night eaters like we are,  make sure to call first and ask if they are still serving food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Wb05teOBXlKC2ktfcLuRA"
  },
  "nemzcWY1os6xuoTGpoC1eQ": {
    "date": "2/22/2016",
    "text": "Love CK's! Food is consistently good and staff is friendly. Really good salads and hot sandwiches. Drinks are always served cold and quickly. Only complaint is about the pushy, intrusive, and rude table busser. What a mistake keeping him around to end great dining experiences on a sour note.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-gYRZks2MZAHX2BfDCjVew"
  },
  "cqoEeEfiQTEbLWxSPYuMPg": {
    "date": "1/27/2011",
    "text": "For a two-month period this Summer and early Fall, CK's was a remote office as well as a Saturday night hangout for me. Fond memories, actually.  Good:   Very good wifi Snappy service Sports-bar menu items Good patio where you can smoke cigars Live music! (including a band staffed by employees of Fender Guitars) A fairly good place to meet new people (I found).  Not so Good:  Sports-bar menu items (and not much else) Limited parking (at times)  A good place in the neighborhood, and one of the few things that tug at me to return to Ahwatukee.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vBSzgSvcawxtaDuIdi9hCA"
  },
  "dblfrU27znnWB4VJ0AxtEA": {
    "date": "10/14/2011",
    "text": "Honestly, I love to dance and have been here a couple of times just for that reason.  I also am a 'lovely woman' of a certain age and just don't feel comfortable in a place frequented by a majority of 20 and 30 year olds.  I do like that age, don't get me wrong...but notice the word \"majority\".  Anyway, I digress. What I'd like to point out is that the crowd is a mix. Yes, there are people older than 30-ish and that's why I love it.  I decided to spend my birthday dancing the night away and that's the place I chose.  When I called them about reserving space for myself and my zumbalicious friends, they were so kind and reserved the space.  They didn't even mind the birthday cake we brought.   The staff is great and the fun is plentiful.  They have pool tables as well. The food is okay; I'm probably not a great person to review the food since I've only eaten there once.  We go mostly for drinks and dance. (We're in walking distance..)  ANYWAY, check it out. You'll be glad you did.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yeTyvwBDm0Y4yuRS7pVl6Q"
  },
  "Xtm877a66TrbY323n_lYTQ": {
    "date": "3/7/2014",
    "text": "Of course you got to get the boneless raspberry GRILLED wings! Yummm! Must go here if you are new to the area! And I like the sweet potato fries! Also they usually have any and all sport games that you want to watch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a3q3o5FEpyYBECaqca1olA"
  },
  "izryl2Ida-JLyI-KUELoSw": {
    "date": "8/29/2014",
    "text": "Love this place. Its close to my house, all of the staff is friendly and the wings are great! Definitely try the chipotle raspberry wings!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X6rTpuMG0GLn809IBJ8JoQ"
  },
  "BvDrmBn43J5l-Hb-QKiIaQ": {
    "date": "3/29/2014",
    "text": "My husband and I have been coming to CK's for a few years.  I must admit, it has declined over the years.  A Bar Rescue is in order.  Recently on our last few visits we have noticed an increasing displacement in our experience.  Last night was the defining experience to seek yelp to express our displacement.  Here are some of our dislikes:  The food is not fresh. 1.  We ordered the potato skins.  they were not fully cooked and very dry- difficult to cut and chew.  We returned them -the 2nd plate replacing them were still difficult to eat they were dry.  2. We ordered the meat loaf dinner.  the meatloaf was dry and the barbecue sauce used on it was so bitter and too spicy to eat. the mashed potatoes listed on the menu were not the mashed potatoes served.  The mashed potatoes were plain and tasted bland.  3.  The server appearance was unkept.  hair unkept and clothing not professional.  The server was inexperienced and did not pay attention to our needs. We witnessed her walking in circles through her section and not checking in with her customers.  food not brought out in a timely fashion.   We ordered our drinks and she forgot my husband's drink and we sat and waited until she came over.  She did not clear off our table after serving us, leaving dirty plates and paper on our table.   4.  The Bar and seating area appeared dirty and unkept. behind the bar it appeared unkept and unorganized.   I hope the owners read this and find a solution  Both my husband and I have decided to not return after this recent experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ln1H27_saTwzWd72rW9ozQ"
  },
  "xwOofdGt0Nw4mTv5lr-YvQ": {
    "date": "3/24/2011",
    "text": "Short and to the point:  Excellent Happy Hour \"half-off\" prices on appetizers, and all of them we chose were good-to-excellent.  My son and I got a TON of food, and I drank a Bloody Mary, and with food to take home and two very full tummies, we paid $30 including tip.  Prices are reasonable to say the least.  Gonna take the kids back again on another Friday.  Parking kinda tight in the busiest times.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jfGevhcYLxY13Fa3drpzoA"
  },
  "WaJn8L0-Zj3cbw96rRJKEw": {
    "date": "6/14/2011",
    "text": "I should have reviewed CK's months ago! It is one of our favorite places! The happy hours are fantastic, and on top of that they also have daily specials! Our favorite day is Thursday, BOGO half off chicken sandwiches! And not just a plain old chicken sandwich... the possibilities are endless such as BBQ, Hawaiian, Avocado, and more. With beer battered fries, sweet potatoes fries, buffalo chips, tator tots, again too many options to even remember!   Everything I have tried there is delicious and a big portion. They always have great drink specials too! And on top of all of this... their servers are the best, especially Tommy. I love CK''s for watching a game, dinner, or just hanging out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YcgddEm2VxCiqvfh6sYFuA"
  },
  "YyPjWqZjf7NvFSsStkcNkw": {
    "date": "8/11/2010",
    "text": "This bar is what a Walmart plus a Benigan's (old school bankrupt TGI wannabe chain restaurant) version of a bar would be.   The whole place has this strange odor...  The food is all fried, oily or piled on with a bunch of different sauces and marinades...  The drinks are cheap but you get what you paid for. Their wells is the $3 per bottle generic ghetto brand. So, their drink specials are not worth drinking since it will taste like watered crap.  Check out the Maricopa Health Dept Restaurant Review website - this place has had major violations - ex) having outdated food in their fridge and brown slime mold around the soda nozzles at the bar. Disgusting.  It's too bad that there is no cool lounge or bar in this area and this is the only bar that most locals like to go to. But hey... most people's expectations in life must not be very high if they frequent this place.   Oh and I want to state one last thing: If you WORK at CK's you can't CHECK IN and become the DUKE. That's double dipping. It's pathetic that you want outside attention for just showing up for work.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qtRl8WTq-pn356WQ7QtBrg"
  },
  "anqD3w5PsY3XBij4X78H6g": {
    "date": "6/21/2010",
    "text": "I have finally joined Yelp and need to make it a priority to share my thoughts about CKs.  I have been going to CKs well over two years now.  I used to be a regular (until I had my baby) and try to make it back to CKs every chance we get a free night.  First and foremost, the staff that works at CKs are amazing.  My boyfriend and I have developed \"friendships\" with most of them.  They all are very attentive to their customers and make you feel welcome.  Second, the food is unbelievable.  I have had almost every item on their menu.  Some of my faves are the veggie burger, the chicken tenders (because they will dip them in the raspberry chipotle sauce if requested) and any of the salads!  Our food has ALWAYS been served hot and has never been more than a 10 minute wait.  This is the one and only place I will watch football on Sundays!  There are so many tvs and the Sunday football crowd becomes almost family.  I am a huge Bears Fan and the Bears game is usually on in the patio area with sound (there are many Bears fans that have become family on the patio).  The breakfast on Sunday mornings is also fabulous!  I couldnt think of a better way to watch football.  I like that CKs is a casual place that includes good friends and good drinks.  Anyone that lives in the area should make it a point to stop in here and enjoy the good times!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "h1q1U8zd7l_LkjM0daF6uw"
  },
  "fYK1c-P62h7iQ74nP4s3yA": {
    "date": "9/15/2018",
    "text": "One of my favorite bars to go to.  They have great boneless wings and fries. Amazing staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7xxLBDOqqghRptfpo5SWQ"
  },
  "0sWgrEpjtUdIn1wiRjO8EQ": {
    "date": "12/3/2016",
    "text": "This was my first time here. I have lived in the neighborhood for years. I wasn't really expecting too much, but it was disappointing.i ordered a patty melt and it was very greasy. I can only compare it to something you might get from Sonic. So not worth the $10 it cost. I got tater tots with it, again, same as Sonic's. My friend had the pastrami sandwich, not great either. It was 3 thick and tough pieces of pastrami on a non toasted hoagie roll. She had beer battered fries which were fairly bland. Absolutely not a great meal. However, there is a ton of TVs and all the games are on. Our server Sage was really sweet. We didn't complain because we wouldn't have gotten any other food. So 3 stars because our server Sage was nice and the atmosphere was nice. As a neighborhood pub they could do so much better without even trying much harder.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_qZh2hx4l2yFjT86HpApdQ",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. Greasy patty melt",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_qZh2hx4l2yFjT86HpApdQ/o.jpg"
      }
    ],
    "user_id": "KsXwMl08Q9wQL83COsEt1g"
  },
  "p9vuRTlce8XfPxAPswrLfw": {
    "date": "4/7/2018",
    "text": "Very long time customer who spent $400 to 500 per month at CK's plus many many recommendations to others. Probably one of CK's biggest advocates. Wife ordered a basket of popcorn. At end of night, when the check was presented ($60) we were charged $1 for the popcorn. This had never happened before? I ask a couple of experienced servers and was told it is discretionary depending on the check total. Both servers looked at my check (again $60) and said no, you should not have been charged, stating the rule of thumb is any check over $30 and popcorn is typically comped. I asked to speak to the manager (Chris) who tells me that CK's has been charging for popcorn the last 3 years. Huh, news to me. But didn't want him to argue with me, since he arrived at our table looking mad/aggressive and ready to go. Was completely unaware of the popcorn charge, but I did notice an across the menu price increases of ~12% about a week earlier however.  Long story short, Chris decided to play hard ball and refused to remove the $1 popcorn from my check, because he didn't like the way I \"Came at Him\".  What does that mean??  Is that the way CK's trains their \"Managers\" to address a customer and talk with them or in my case \"to\" them? Don't know what \"Come At  Me\" means, but I was polite and seated during the entire conversation.  A matter of fact, My wife and I kindly relocated from our previous booth seat to a high top in the bar so Kendra could accommodate a large party at our original spot. By any definition, this incident was a colossal customer service 101 failure. Really? Apologize and comp a 10 cent basket of popcorn and retain a high value, $500/month previously loyal customer versus be a jerk to the customer and his wife and make it so they never return. Hope Chris the \"Manager \" thinks he won?  Most would have comped an inconsequential basket of popcorn rather than lose a family that has spent thousands of dollars at their business. Short sided and demeaning service that disrespects an original patron to the business.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TGbQeHZaAM9dQYAUS4BwZQ"
  },
  "5bAdD5ZtekDrcbEc3EFl0w": {
    "date": "4/13/2017",
    "text": "This is our neighborhood bar!  We are pro happy hour and bar people!!  Don't judge!   Great atmosphere to watch football!   We are Broncos fans and we have a small group that sits outside.   Even when we play rival teams it's alway a friendly fun time!! Great food for a bar!!  Not gourmet but for a fun time reasonable price in Awhatukee.  Nothing better!   Big Father will fill you up!  The reason we are writing our reviews is because of Katie!   Not for sure if I spelled it right but she is the best!   She is kind,friendly and sweet!   We go there and she is always happy and fun!   I drink PBR and my glass never gets close to empty until i get a full one from her.  Can't say enough about her!   Hope she stays here for awhile!  We love her but we know she will go on to big and better things.  Awesome Awhatukee bar!!!   Did I say PBR ON DRAFT!!! Enough said",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B_fq3GTEOpwEUApt483ogg"
  },
  "xZZgiLC-JIDV5QM_gGf9nA": {
    "date": "2/8/2018",
    "text": "My brother and I ordered food to go from this place today.  First they stated that they sent our order out with another customer so they offered my brother a beer as he waited for our food.   When my brother brought the food to my place, the chicken in the quesadillas were NOT even cooked so I called to speak to a manager and all she could say was that she was sorry.   I have been a regular at this place for many years since I have lived in Ahwatukee since 1996.  Well I will NEVER go to this place again!!  The quality has not been the same now for years.    My recommendation is do not eat the food there to go!  Only eat it at the restaurant.  The managers there are also unequipped to handle issues.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KBcA2EkbIRWVUM6Gx-SWMA"
  },
  "0UC4f4b-1l_AzI0ic_vUtQ": {
    "date": "12/18/2017",
    "text": "This place has got one of the most authentic Midwest Friday Fish Frys that I have found. Also the raspberry chipotle wings are a must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NfaI56Z_iViKcNdbDMq37w"
  },
  "n8c-Yn7XSbv_Q9-fsHkj7w": {
    "date": "9/28/2014",
    "text": "Did not have such a great experience tonight at CK's. Not sure what was going on. We have been here quite a few times in the past few months and I have come to the realization that CK's is just okay most of the time. They do a few things really well and most others not so much. I really like the original burger sliders and the pulled pork sliders. I also enjoy the boneless hot wings. Other than that, my experience has not been very good.  Service is pretty good most of the time. Tonight it took at least ten minutes after being seated to be greeted. Our waitress did apologize and she look stressed so I felt for her. We ordered the pepperjack cheese dip with tortilla chips. It was not good. It was pretty much velveeta heated up in a cup and the chips were extremely stale, tasted like they had been sitting around for at least a month in an opened bag. I ordered the french dip sandwich for my entree (see attached pic). It looked pretty good. Looks can be deceiving. It was bad. The beef tasted off. Like beef that had been sitting around too long. Very unappetizing. After two bites I was done. All of the food in general looked old and not at all fresh tonight. A huge turn off. If our dinner was this bad, how bad was the food in kitchen? Just an all around bad experience tonight.  I still gave two stars because I think that this place still has potential. I am asking that if the manager or owner read this, please take note of this experience tonight. Take a look in the kitchen and make some improvements.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "iOoIsvXQ50HgWlk0rTfyxA",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. French Dip",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iOoIsvXQ50HgWlk0rTfyxA/o.jpg"
      }
    ],
    "user_id": "4TY8dDlgoso_xdfVvLkW1w"
  },
  "yJytovZO_bfE7T7c94wdtw": {
    "date": "7/26/2017",
    "text": "So this place was \"interesting\". I wasn't expecting a typical \"smoker's neighborhood bar feel\" atmosphere. I can say that the food was decent and service was actually excellent. We had a friendly and attentive server who made it a great experience as she knew it was our first time there. They honored a coupon we had that had just expired so that was good customer service. Our food came out relatively fast too. I wouldn't return only because it's not my type of place. It looks like an older restaurant, sort of run down feel and not my type of crowd. But if you're ok with this type of bar, this is your place. I guess I was expecting more like Native New  Yorker as I had heard (whether it is True or not) that the same owner owned this place. I felt like it belonged in Apache Junction, not Ahwatukee.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DUuxKUVMKhxpdbwThqerEg"
  },
  "4IeuqMvYb3U8WT_tnHLuSQ": {
    "date": "7/1/2016",
    "text": "Great bar food and atmosphere. Food was really good and the service was excellent. Had the happy hour wings with the raspberry chipotle sauce. Fries were cooked perfectly... Great stop to meet friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0kdF-JVpDNU0VENSPs85uQ"
  },
  "7BMFRbpQHyAsKBi3AAwxsw": {
    "date": "3/24/2016",
    "text": "Sticky seats, dirty tables, and poor service!  My family and I came here for the first time today. Sat down and ordered a drink and then waited 25 minutes before the waitress ever came back.   Terrible service waitstaff forgot about us. Never going back!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pMoD7oXjaG0uwvEITpzTOg"
  },
  "IFDAkwU70tGQTEYY3HluJg": {
    "date": "4/26/2016",
    "text": "I went to CK's today because I received a bunch of \"welcome to the neighborhood\" coupons for moving to Ahwatukee. I guess they treat their residents right in this suburb!   Being that I was getting free food, my expectation was that they were giving away free food because they were desperate for customers. Far from it though! I went here on a Tuesday night and you'd think it was a Friday night. Very busy for a weekday, but still quick and friendly service.   Great atmosphere, lots of TVs and great patio seating. I used the free boneless wings coupon and tried their house flavor called \"Chipotle Raspberry\". I can see why it's so popular - great flavor and a perfect blend of spicy and sweet. As for the wings themselves, this place definitely has the best boneless wings I've ever had. Rather than the traditional from-the-package frozen and reheated wings, CK's uses actual chicken (who would have ever thought this was possible) and they are hand tossed/breaded. Definitely worth a try if you're like me and don't like bone-in wings.   There's a lot more I want to try here and it looks like a good place to have a beer as well. Seems like it might be geared toward the older crowd, but as I said I went on a Tuesday. Maybe it's different on the weekend. You should definitely try this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FUejaSJ0Dcd8NQlxKP6u2w"
  },
  "UX7vXjitR0Vd11z9zEjuMA": {
    "date": "7/29/2016",
    "text": "First time here it was memorable. The chucky baby allstars are awesome. They made the night. I will be back if they are playing. Great band. Thank you CK's",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BsZ6Lo9Uv-DnBJng6Epyrw",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BsZ6Lo9Uv-DnBJng6Epyrw/o.jpg"
      }
    ],
    "user_id": "1AKf_1cyKliulq-lEkEpaQ"
  },
  "sp6xPMxdVGXg81Xx4I9BAA": {
    "date": "5/5/2016",
    "text": "My friend and I went here for dinner last week.  I was surprised she selected this place as neither of us drink, and it's definitely a sports bar.  She said it's a neighborhood hangout, and we both live in the neighborhood, so there ya go!  That being said, the food is bar food and nothing more....so don't go with high expectations about the food.  People go there to drink and watch sports on the many TVs located through out the restaurant/bar.  They DO serve salads though, so I ordered the taco salad with the grilled chicken.  I always bring my own salad dressing, so I took that and everything worked out fine.  The waiter was nice and very accommodating.  I probably won't go back just because I'm not a sports-bar kind of person....but if you are, this is a good place to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Zlmlq8CDvY-_TIyRSYNC2Q"
  },
  "5-1I5a3p2GTxu2wh09g7Qg": {
    "date": "10/20/2017",
    "text": "Best wing sauce in town.  If you live in Ahwatukee (or anywhere else for that matter!) this is the place to go.  Food and staff is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S7Imm3pxqBjR2KXRPx7CTQ"
  },
  "GS6YtdINmVNYj1n022dt1Q": {
    "date": "5/2/2016",
    "text": "Really wanted to like the place. The wings were fair. Never got to try anything else. NOT at all busy, but asked for a menu, received menu, and was summarily ignored for more than seventeen minutes. I only know the exact time because I texted my wife \"just got a menu. I'll call after I order.\" seventeen minutes before she came back and I asked for my check instead of ordering. What is wrong with service these days?  Looks like I'll give someone else my money for dinner tonight.  That said. The happy hour isn't terrible.  Avoid the patio unless you like smokers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TRHpg6XSoLi-bqMNJnsLag"
  },
  "jkDUqSJZpH6-HCBFLhvLXw": {
    "date": "7/8/2017",
    "text": "CK's has delicious food. My favorite is the carne adovada. My teenage son orders the cheeseburger every time. My daughter likes the mac n cheese. And, the dinner salad with bacon and cheese and boiled eggs is perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z-U59D-8axw1A7emuGu4QA"
  },
  "B1axh6jfiNBedQuTydx8zA": {
    "date": "4/4/2016",
    "text": "What can you say about CK's? I've been here one other time to see a band, and tonight the same reason. Great beer selection, didn't have any food.  Seems like everyone is a regular here, and the type of place that the bartender knows what your drinking before you even sit down.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PdCR2ElSc0cVym5dCN3Zsw"
  },
  "FeATUFySdotndbmmK0QZ2g": {
    "date": "11/17/2017",
    "text": "I have been coming here for years. The French dip is great and so are their frys. The owner is very friendly and the staff is as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_CUnbbQ8AuDPrmDk-vePvQ"
  },
  "G5SOQQkhxNfH93w9-5NouQ": {
    "date": "3/22/2017",
    "text": "This has been my favorite place in Ahwatukee for more than 10 years. I come here at least once a week because it is the perfect place to get great food and giant beers.  Sometimes people go to a restaurant once and have a bad experience. I strongly believe that is not enough to give CK's a 1 star review. Its also not fair to the restaurant.  Coming from a regular, this place is beyond awesome. It has everything and they do it better than anybody else. They go above and beyond every single time. Sure they get busy every once and a while. I might have to wait a few extra minutes sometimes, so what! You cant rush perfection. I will continue to come here until they close their doors for good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dL1olw0p3vlNYHzrVAkZeg"
  },
  "TgDijvWj5w0u_yq-ky2o9g": {
    "date": "9/2/2017",
    "text": "Stopped in for lunch. Our server, Britt, was super attentive and got our drinks and food out quickly! We order the wings, hatch burger, and the California wrap. Everything was delicious. I will definitely be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLwBouURsOntWVPziPbkZA"
  },
  "VhKiUhqDS342X4CvxyZ6PQ": {
    "date": "3/4/2010",
    "text": "I have been going to this place for several years and it is just awesome! The food is amazing (The club sandwich and fries mmm) and it is a great place to hang out and have a few beers after work. The wait staff is always friendly and the live music is awesome! Keep up the good work CK's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BAZTxYWS3x-wvw9ONIaflw"
  },
  "VrvlUBKcaYGybuSJKTMdwQ": {
    "date": "10/5/2009",
    "text": "Ate there with the fam a couple of times food was good, customer service sucked! Went there SAT to try and eat dinner with my 20 yr old niece after she got out of work like 10pm and they wouldnt let us EAT there because you needed to b 21 to set foot in there. The guy in the front that asked for ID was VERY rude and because of this experience I will never set foot in there again myself or with my family. I am going to let everyone I know the horrible experience we had and not ever recommend this place to ANYONE.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "Zs-YBS5eVWDOsNfJ46JGeA"
  },
  "569LkbXIVkQAY_s9lf_FvA": {
    "date": "9/2/2013",
    "text": "I live nearby so this place is convenient. Always great service and tons of TV's to watch any and all sports. The raspberry chipotle boneless wings Rock!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q82koTgF5bjhokWXfaCiCw"
  },
  "bU67jSq-k-XH5sbp3omkkQ": {
    "date": "11/11/2010",
    "text": "Voted BEST in the area for everything! The Raspberry Chipotle Boneless wings are SO Yummie! . The menu is varied-- whtever you are craving , it's there. The portions are more than generous; you won't leave hungry! The kitchen is open late---The staff is very friendly and attractive. We really enjoy the live music at CK's-- especially Chuck E. Baby and the All-Stars--",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fV96v1Tt8JzliIYe_PbXBA"
  },
  "EiR2hx8SfBmX4JjzYeILYQ": {
    "date": "4/20/2010",
    "text": "Nice change of pace from Native New Yorker, but the food just isn't as good.  WAY too many smokers on the patio, so you can't enjoy the nice weather unless you are breathing in cancer fumes.  Saw pregnant woman drinking here, and question bartender ethics (she was actually double fisting a beer and wine).",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GPqdt5ZcTc-QOBALH6wSHA"
  },
  "jKNZjfiH0pVPqr5QlxgYoA": {
    "date": "7/31/2010",
    "text": "Really good service.  Food prepared fast and was pretty damn good.  We went on a Friday and it was busy but not crazy.  The reviews are accurate.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tt5h9hXKEsKwQc88hH657A"
  },
  "eVmPBXxKvxOJkSN-Art39A": {
    "date": "1/10/2011",
    "text": "Food is crap the servers and staff are all rude and stuck up. I use to go there a few years back same staff but just to drink. I didnt like the mixed drinks other person that said they taste wated down with cheap liqure for drink specials. Not for younger crowds and dont feel welcome u less ur part of the bar rats that are always there. Not a family place like it use to be. Look at there maricopa records for heath department i a  suprised they havrnt been shut down. Good luck if u choose to eat there. Ps if u thi k cus they have a lot of five stars those are the bar rats that are friends with owner and staff. Take my word for it go to bleachers staff is nice food is good and the drinks are always what u ask for and are made right.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9q8uss0DhtUeJ1uBqr6sFw"
  },
  "VX8ANsYEp3bvgaOO2CoTAA": {
    "date": "9/26/2010",
    "text": "Daily specials friendly staff, great place for the game tv on every wall. You could not sit anyware and not see tv!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BUMQS0Wy2bdVoXfSBuXAUw"
  },
  "_mzl3T6Rn7SakouSKt79fg": {
    "date": "1/14/2010",
    "text": "Upon my friend's urging, I ordered the raspberry chipotle wings. Unfortunately, I had them finished off on the grill. Although I do like this done on some wings, I feel that they lost some taste. My friend lives around the corner from CK's and always talks up the wings. The wings are pretty damn good though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dt9IHwfuZs9D9LOH7gjNew"
  },
  "UAqzvTMSLUYkXXZ_o43umg": {
    "date": "9/14/2013",
    "text": "We were looking for a great place to watch a college football game and tried CK's after reading positive reviews online.  We called ahead to make sure the game we were looking for would be on and they confirmed it would be.  We got there and were seated right in front of 2 big screens one on top of the other with our game on the bottom screen.  So far, so good.  We thought we'd hit pay dirt and had found the perfect place to watch ball games in our area. Another party came in and was seated in the booth right next to us looking to watch another game.  Their game was tuned onto the set above our game.  They didn't seem happy to have their game on the top TV and asked for the volume to be turned onto their game.  The bartender came over with the remote and turned the volume OFF of our game and WAY up on their game.  When my husband gave her the \"what's up?\" signal she said \"I know, know. - they're here every week.)  I can't remember ever being blatantly told that another customer is more important.  We asked for our check, paid and left.  CK's advertises themselves as a friendly neighborhood place.  I guess you just have to be an established customer to get the \"neighbor\" treatment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GDxfsLIdyK5zUhJPki_y5g"
  },
  "BDd3H4FSSEBQMFCbPqHqtA": {
    "date": "6/15/2010",
    "text": "Recently moved back to Ahwatukee and hadn't been into CK's since it was Bar Nun years ago. Have to say the food was great and portions were BIG!! Raspberry chipotle wings are great and the Bleu Cheese burger and Hawaiian Chicken Sandwich very tasty! The staff were all great as well. It felt like it took a little long to get our entrees but It was a busy night because of the NBA playoffs and we had a 4 y/o with us so that could have magnified the wait. The only issue was that the bacon on my sandwich was forgotten by the kitchen. But since I didn't realize it 'til I was halfway done and stuffed anyway, it wasn't that big of a deal. 5th star next time when I get the bacon...ha. All in all a great neighborhood bar and grill that has good food and makes you feel right at home. We'll be back for sure....and probably often!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uBdqcuw7cSnKg8ikjT_Z3Q"
  },
  "dxZlvqesykDB5ZH0WJDYKg": {
    "date": "3/29/2010",
    "text": "This place is super close to my house so I visit pretty regularly. Tommy and Nick are two of the awesome servers usually out on the patio and I always have a good time with them as my servers. Sunday nights they have  $3 you call it's which is always a blast. The food is also pretty good... my favorite are the chili cheese fries. If you're younger like me (22) you may want to stray away from Friday or Saturday nights... since most of the local Ahwatukee cougars are out on the prowl but it does make for some interesting sights if you do venture out on these nights... but I prefer to stick to the weekdays. All in all a good place to hang out, catch the game, or shoot some pool! GO!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y6k8J0j9QcQ0iHu2VReB9w"
  },
  "4LzBGjDQ17C4Bl5qqjpcwg": {
    "date": "2/16/2009",
    "text": "My family and I love this place. Yummy food, great service, kid friendly, rarely a wait, great prices, nice beer selection, food always comes out hot, and people around you are having a good time. The boneless chicken with raspberry barbecue sauce is so so yummy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u47LXIdE3oSrFXn-V7LKQw"
  },
  "qpE90tSTNWaz4Ii5-Nw2OA": {
    "date": "5/31/2010",
    "text": "Nice local bar.  Good wings, i tried the chipotle sauce and can say that its delicious.  I also have tried the slop burger and its a better than average burger.  They have some pretty fun bands.  Does not purchase ufc ppv.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XUYZHfydYjrFU1JQEeCe0Q"
  },
  "tU5ju-6n2JgBlYDu2HABKg": {
    "date": "9/5/2008",
    "text": "Dig it!!!  Love the food. Go with the Reuben! The rings are a good bet too.  K runs a sharp shop and all her staff know what they're doing. Thanks for keeping my personal beverage handy when I visit.  Might need a few more sets on game nights.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oGn6HuBuJEePpXwI-J6m3A"
  },
  "VczNWuAsjhtRUpJxBGTP3w": {
    "date": "11/30/2011",
    "text": "I seriously love this place, it has a comfortable atmosphere with a bar and also dining area for families. They have the most amazing wings and dipping sauces! i LOVE GOING TO THIS PLACE!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L14NsQzmNKAPFiSWRKk4dg"
  },
  "FhH5mFCtXTnupqwyw6S2vA": {
    "date": "7/24/2010",
    "text": "Good food, great sliders, great bartenders, service is fantastic",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ntIc17q0L2KMpYFwwfjV2w"
  },
  "updwH6ot1kmQ4ePVtn9R5w": {
    "date": "4/7/2010",
    "text": "We love taking out of state guests to our neighborhood Cheers bar aka  CK's in Ahwatukee for the fabulous food and a nice outdoor seating area. The raspberry chicken is my husband's favorite and the burgers are excellent. For a nice family setting (no frills) with excellent food and service at a reasonable price, you can't go wrong.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "W2-UinX4Eb8vFlA0CY2hcg"
  },
  "81k1TW2GMj2zNsRxkCBfdA": {
    "date": "1/27/2010",
    "text": "I visited CKs last Saturday as a family event after a funeral.   It was a fun time, decent food, and a relaxing atmosphere.   Our group took up most of the entire restaurant but all of employees were very accommodating and helpful.    The food was good and service at the bar great!    If I lived closer I would definately visit more often.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "26BIgqP7U8t8IC9rDwcZXw"
  },
  "Cf_ZLqEK3y8nNGaFkjUGgA": {
    "date": "5/2/2010",
    "text": "CK's Tavern & Grill is a great place to grab a good meal and watch the game.   The staff is friendly, helpful and quick.  Sometimes the place can get busy, because it is a popular local hangout, so if you are in a hurry, just let them know and they will give you the extra attention.   Good place for kids, because you won't worry about them making a little noise, or messing up the place.  Later in the evening it's a great place to stop by and meet some new people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sFd1xD_izIso8WI0Ta_pKA"
  },
  "mP--rSiGPCrcMJvBfNLHfA": {
    "date": "12/4/2017",
    "text": "Cks is such a great local watering hole. But don't think of this place as your typical bar. The food is not your average bar food. And the service always so great.  This is from someone who lives blocks from it. Outside of the food you need to check out the music on the weekends. They get some of the best of the best local music scene.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aIDjxHCMgNdtApwFDllg6A"
  },
  "st8gKtc_nMQ73hCNkPIorw": {
    "date": "10/23/2018",
    "text": "CKs is great. Great happy hour. Great food. Great service!!  Plus lots of TVs. Try the boneless wings....you will be glad you did!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KeXFFcXHhPmKRso-vgQ-wQ"
  },
  "mPnB3P-v8tn5mgdPADyR5g": {
    "date": "7/13/2018",
    "text": "So glad we picked this spot for lunch on our vacation! The service and food were EXCELLENT! Staff was so friendly, and anticipated our needs. The cheese curds were amazing, as were the burgers! Homemade salsa was so good too!  If we are in the area again, we will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LMdu1S3j8ys_WHcLRu2nCw"
  },
  "pdoedkIVws54vMX-AhbhOw": {
    "date": "2/16/2018",
    "text": "They treat you like family from the first moment you walk in. We found this tavern by happenstance and are now hooked. From the inviting design of the interior as you walk in, to the friendly faces that work at CK's tavern and grill, not to mention the food is outstanding, it truly is a home away from home. We had to go two nights in a row because it was so wonderful. I can't get enough of this place and will be a life-long regular.  If you haven't been, do yourself a favor and go. You'll be hooked too.  See you at CK's!!! Angel & Randy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gzYlNRafXCRT5ZzQMiEBxw"
  },
  "lX1XmNFa2WXXQ5AOVTac9Q": {
    "date": "10/6/2017",
    "text": "If you had a real bar called Cheers this would be the place, the staff is very friendly, manager is always around if you have an issue and the food is amazing! Everyone knows each other and the atmosphere is fun",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9_bYM5K3IdxFWQINrsX7Rw",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. Good times always",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9_bYM5K3IdxFWQINrsX7Rw/o.jpg"
      }
    ],
    "user_id": "F17nx7q237Exv1ucuDQsBg"
  },
  "cPAa8uMsJUDo9GMln8Ynvw": {
    "date": "9/21/2016",
    "text": "The place is a very typical sports bar - lots of TVs and has a HH on the weekend.  PROS: Good service from our server and changed the channel for our game Prompt with refills and was really good with offering my date another beer Cheap beer during HH - $3 for Blue Moons  CONS: Wings were very average, was not a fan of the sweet ones. (Buffalo ones were better)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-8rSnT5ztVk6vmTDkxTqsQ"
  },
  "YrKkqfMm37LwmxUPyHiteQ": {
    "date": "6/6/2017",
    "text": "The wife and I came to see a great cover band our friends told us about.  Being our only time there, we left impressed.  Older crowd that quickly filled the very small space for dancing left me thinking they should rearrange tables on concert nights to allow more people on the dance floor.  Waitress was superb especially navigating the crowd.  Got the vibe that very loyal locals and all fun, good natured people.  We will definitely be coming back to catch local bands.  I believe the band was called Trip-Wire and these guys covered all the 70's-80's favorites and were great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bDcmdEJsMDVV5o2eiLtaGA"
  },
  "VqomQGgNbp4l1nbNOiJZgA": {
    "date": "6/5/2018",
    "text": "Best bar in Ahwatukee to watch a Cardinals game. Cold beer, reasonably priced and excellent wings. What more can you ask for. As a side note, sure beats Bleachers across the street.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "civqkf2umpn_hDMOUV3bBQ"
  },
  "TbFmaNjNuazyvJV_IMQdtQ": {
    "date": "7/18/2017",
    "text": "We have visited here once. I am still on the fence about this place. So much going on in one place.   First the beer is lacking! If you are into the usual american beer this is enough. HOWEVER, the wait staff said they don't sell much of it, but they do carry Huss Brewing Beer. Not sure why anyone would drink the other stuff, but if you like craft beers the local brews are here, but have to find them and remind the staff they do offer craft beers.   I liked the tvs all around and there is an app to listen to the screen if you bring earbuds. Which I think would be great if I were here to watch a game.  Ok. Onto the food. I ordered a Hatch Burger because someone recommended it. Totally not what I was expecting when I read the description, but I tried it anyway. Ham and a hamburger patty do mix well together. It also had Hatch green chile. It was very different from what I could get in NM, but it was oddly tasty. The burger served open faced on sourdough was good, but the sourdough was soggy. Who needs the carbs anyway! Next time if I were to order it would be just on the plate. I ordered a salad for my side. It was really good. Romaine!!! No iceberg here! It had everything I liked on it too. All the ingredients were finely chopped and added to the salad. Next time I would hold the bacon, because I don't like salad with bacon. The balsamic dressing was the best. The pickle spear, served with the burger, lacked crunch, but the salad more than made up for it. Brad ordered the carne adovada, he is brave and likes to search for food from home. It was not as good as home, but it was tender and moist. The red chile, or what ever it is called, was tasty for Arizona. He surprised me and ate the black beans. I have not acquired a taste for black beans, but he said they were good. Lastly, because Brad cannot live without dessert he order the Mile High cake. It looked nice and was dark chocolate flavored. He said it is moist and delicious. He said he would order it again. Of course! We will put this on the visit again list.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "S33IUieqzZpVDZMwEvHQNw"
  },
  "0kY2GVIeiIKuIvp9Cce0nQ": {
    "date": "4/1/2018",
    "text": "We had a couple drinks, wings and a southwestern salad. The chicken was rubbery and not very tasty. In terms of food, maybe it was an off night. The atmosphere was fun and the staff were very prompt and friendly. The drinks were great. We will go back again to try some burgers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "epv59fY7ieCnOENb8Kkp6w"
  },
  "N8VVcVBDD2tOviIxYAvKNw": {
    "date": "2/20/2018",
    "text": "This is our new go to place for Wings, Beer, and Trivia.  They don't charge anything extra for the wings and they come in normal increments. They have Guinness and Strongbow on tap ( Snake Bites! ) and have the playmaker trivia all the time.The servers are top notch being friendly and come back to check on you just the right amount of times. Most of the food here is very good and comes out crazy fast. The wings are great and you should try the adovada pizza it was recommended by our server and tasted great.  If you are in Tukee give it a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rhE4gLtM0gb3XLwSz6HPCw"
  },
  "KDib_o6pAFIrcAgw7dDJwA": {
    "date": "3/17/2017",
    "text": "UPDATE:  The owner did come over to talk to us and told us she will work on training her employees on how to handle people who cut in line. She also did comp one of our entrees which wasn't necessary but appreciated.  I've been here 5 times and 2x we've had some issue.  Previously it was with a large party for happy hr where our waitress told us a certain beer was 1/2 price but not on our final bill.  She did later remember and adjusted the tab but having issues 50% of the time doesn't seem like good odds.  Overall I do like their food and atmosphere but not too impressed with the overall service.  OLD REVIEW: It takes a lot for me to leave a negative review but I feel this place lacks proper management and is a bit chaotic.  Let me preface this by saying I've been here before so this review is not based solely on today's experience.  We arrived at 4:55 pm and we're told it would be a 20 min wait.  We were seated at 5:45pm.  The problem was that as tables opened up people coming in would sit in them bypassing the dozen or so people waiting.  Myself and another lady told the hostess but they still served them!!! This happened 4 separate times...why bother having a waiting list if you are not going to honor it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mq_WrnnAsKJSHsxpEpB_WA"
  },
  "G2lQgg1zBm9r-8u3DzA8Pw": {
    "date": "2/9/2018",
    "text": "Neighborhood restaurant/bar that really makes you feel welcomed. We had several appetizers which were all great. The burgers are fantastic! Will definitely come here again. If you can, ask to sit in Brittany's area- great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oiWga3qInJZYWnrUr-8eyA",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oiWga3qInJZYWnrUr-8eyA/o.jpg"
      },
      {
        "img_id": "ZkiVVUiV_TWNJAquGEcSOA",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZkiVVUiV_TWNJAquGEcSOA/o.jpg"
      },
      {
        "img_id": "odTZIXTcy8fvtjdrcEHLWA",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/odTZIXTcy8fvtjdrcEHLWA/o.jpg"
      }
    ],
    "user_id": "K2WEdnTD5eNkHWvWFX_WEw"
  },
  "yzhF2dJcYJ6ScjPDUXQT4A": {
    "date": "1/29/2017",
    "text": "Pretty much didn't want to say anything about this business again. I didn't even Yelp for a long time because of the bad taste in my mouth. But due to genuine inquiry from Yelp member ~ I will respond. I had a \"friend\" who told me over and over again of situations where they were being singled out by a staff members, being treated badly & ignored and drinks slammed down ( hostility) no response to requests, etc.  At first I considered the temperament of my \"friend\" and thought maybe he had rubbed them the wrong way or something, but, I kind of dis-regarded it until one time when I met that \"friend\"  there & I witnessed it myself. I was treated great but my friend was NOT. We were sitting at the same table. THE ONLY 2 AT THE TABLE. WOW!!! Okay, so maybe my friend (with some of his eccentricities) did something to offend someone, who knows? So I continued to patronize. Until 1 evening I came in and was hanging out with some of the staff( great people, I miss them) as they were getting off work had a couple drinks but sat and witnessed on the patio someone in a CK shirt acting very rude to a female - scary rude. Patrons: a cute little couple, a guy and a girl ~ they were cute little Yuppie types, college kid types or something, but obviously she had had a bit to drink and her date went inside to probably use the restroom or get their ticket I don't know but they have the guy with the CK shirt on acting very perpetratory towards her in her dates absence. This gal, I can assure you, would be lucky to have even remembered what she was experiencing the next day or for the next five minutes for that matter. I am 49 years old and I know what it is to see a perpetrator targeting someone in a weakened state. Her date came back and he scooped her up a little bit to help her outside. Comments were made from the employee to them as they left with laughter (one sided). And as they came around and we're walking behind me in the parking lot trying to make it to their vehicle there were still comments being made until that customer yelled out \"why don't you leave us alone we're just trying to leave you need to leave us alone\" and the employee (I only knew who he was because he yelled out) \"what are you going to do about it who you going to tell I am the security at CK's!!!\" OMG... I emailed my \"old friend\". I felt horrible that I never really believed what he was saying to me. Keep in mind, none of these situations were directed at me. At CK's they have some wonderful staff that are smart brilliant people that can brighten anyone's day. The food I miss so much. I miss my patio and I miss my misters ~ most of all I miss my friend. It was our Spot. When I have sent good review of this business it's owner immediately (within 30 seconds) responded thanking me. When I sent that review, she didn't respond at all. She didn't have to believe anything I had to say - she only had to look at the tapes. I gave her the dates and the time frames. She never asked/cared what happened. What I mean about having benefits being members is that there are specific dollar amounts that occurs so a business can pay to be a part of a Yelp membership and they call up and complain about my friends (honest) review of their business and then they said that it wasn't True or whatever and got it taken down. It wasn't until later that I saw what their security guard did to that couple. I thought Kendra would call me. I work in private sector Healthcare. I am also a local business owner. I am a single woman who wants to feel safe when she goes out to eat, drink & work. There are only two drinking establishments locally that I will NOT return to. I have seen business owners perpetuate specific behavior (even require it) from servers or staff to victimize men and women and it's actually part of their business model. Didn't have to happen to me. Not at CK's, anyways. But if it had or even just a \"friend\" I can assure you I won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "IhR4x6oXVFh3ccImXcFrJg"
  },
  "yKS-OGFvbNuVcD-NY19Lsg": {
    "date": "12/2/2017",
    "text": "CK's Tavern & Grill is Outstanding!  Small town atmosphere with world class service.  I've seen thousands of sports bars around the globe, but none can touch CK's.  Kendra's heartfelt influence on the brand is felt throughout the entire place.  Bar food?  No this is feel good food with a hit of attitude.  Just the way I like it.  Brenda and Krista are always there when you need, yes, dare I say, another beer!  This is by far the best home town bar in Ahwatukee!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "TYpWR0o1CsWU-BvYZPYmLw"
  },
  "DyXjRzlNiV3rCq1V6TwZTw": {
    "date": "3/18/2018",
    "text": "Great food and Beer selection. Awesome place to watch a sports game. It sounded weird and i was hesitant to try them, but the raspberry chipotle wings are the most amazing thing ever. Service is always awesome and they even have live music on the weekends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DGR7utowLPjazufGfvq-qA"
  },
  "LOFMYH0fFHDeZ6iiLnavwQ": {
    "date": "1/2/2018",
    "text": "This little place has such a cool vibe. U walk in and there is music playing and pool tables and nice tables to sit and have dinner or just enjoy the awesome drinks and appetizers that are offered at happy hour.  The waitresses are so nice and helpful. It has become our new Friday night go to place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "-CCBKWlrHrN5aL2zhTANvQ"
  },
  "e5dIt1tws-GYaeEdW1dZuA": {
    "date": "11/18/2015",
    "text": "CK's is the best bar in Ahwatukee.  We decided to head over there for lunch, and as usual they didn't disappoint.  We had the hatch Chile burger, a regular burger and a dozen wings(50 ea on Tuesday).  All of it was awesome, the hot flavor wings were perfect, no shortage of classic hot sauce here.  Also, they use pretty good quality chicken, no obvious fat on them and fried crisp without breading.  Even the carrot and celery were good, I didn't actually realize there was variable quality on the veggies, but there is; they're better here.  The two burgers were awesome, getting rave reviews around the table.  The seasoned fries are really more like thick chips, and they were good too.  Basically, everything was good.  They also have a good sized selection of beer on tap, so maybe we will head over in the evening and try something new on that front too.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "QGgWWhEi5R4SLAKN-xwtNQ"
  },
  "MJSmYhbKFgN9FwY7T5O82g": {
    "date": "2/28/2018",
    "text": "Food is very good there very nice very clean don't have to wait long for food me and my family go there all the time affordable price",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzUPppk2FT7_JltV-3OPfg"
  },
  "bzsObVFiB6BZRV9AUEG77w": {
    "date": "1/29/2016",
    "text": "Try their Guinness Mussels   We've been regulars here now for years, love the place and the people, and just had them for the first time . . . Really nice!  No dead mussels, tasty broth, and four longboards of baguette to soak it all up in.  Give'em a shot",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Glf3diUQ1TBxgpv5dGH2SQ",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. Guinness Mussels",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Glf3diUQ1TBxgpv5dGH2SQ/o.jpg"
      }
    ],
    "user_id": "LUTiF1sD99N6yAmdZywA1w"
  },
  "oircyjtnI51deeS0rJLY8g": {
    "date": "5/16/2009",
    "text": "I have been to CK's several times. The service is great, and the pub grub is some of the best. We had the raspberry boneless wings for the first time last night, and they were awesome! A little breading, good raspberry sauce, with just the right amount of heat.  Good service, low prices, and big portions. Like Debbie, I also wished I lived closer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cw--kFEWAkhTyMAQQ_pUVA"
  },
  "RC0vE6KnFarpyDaHGh1Arg": {
    "date": "9/29/2013",
    "text": "Good place to watch a game or just enjoy happy hour. Do not expect anything fancy, this place is a bit of a dive. Sticky tables and menus with crusted food on the salt/pepper shakers. The staff is friendly and will go out of their way to help you out when ordering. The tortilla soup is fantastic, everything else is typical bar food thrown in a flash fryer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FL4RLugM9P_GVvP0y1yo1Q"
  },
  "zseSRJHYlWcFieUBdpR7nA": {
    "date": "1/23/2012",
    "text": "Great sports bar in the area with good food, service, and drafts. You are literally surrounded by TVs & can watch the game from every seat. The chipotle raspberry wings were really good, but the hot wings weren't all that impressive. Beef nachos were also good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qjrn5UsK2HBZxx40HYA1iQ"
  },
  "ThjwNZZSw87jKsxjd0V91Q": {
    "date": "6/1/2012",
    "text": "Alright, nothing special. Service was very good for how busy it was.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m3pe00cjMxEW_mHuKyftAw"
  },
  "ZgDZAoSwzjDN_OZtoY_mdw": {
    "date": "3/3/2012",
    "text": "When I am in this part of town and want amazing food, Awesome service and friendly faces CK's is where I want to go. Sad to say that Tommy Pierucki is no longer there and has moved on to bigger and better things but he will always be credited with spreading the word to me and others about this amazing restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ll9KdKBIohH62EP7tx7zow"
  },
  "9lVkDlj69MlFj_0u7mmydg": {
    "date": "5/15/2009",
    "text": "I've been to this place a few times and I wish I lived closer. It's a great place to hang out, the service is excellent and what food I've tried is really good.  The bands I've heard there are good, too. There are a couple of pool tables and the patio area is misted so the summer heat won't be too bad.  We had our #evfn meetup here tonight and they arranged an area just for us. The server Katie managed everyone's separate order (as far as I know) without mistake, which almost never happens. Great job!  I'm sure we'll be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tn0er-fqQ33egNc9PX29XA"
  },
  "woVC_63bEW9hPqdojEfszA": {
    "date": "3/14/2012",
    "text": "Had lunch at the tavern today.  Service was excellent.  The burger was cooked as requested, medium and was good, except it was a little dry.  The french fries were excellent.  Will go back....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fNT9-mv1SXptEL0Gdg-CyQ"
  },
  "IEY7nVsav4Van7pKWE1pHg": {
    "date": "11/12/2011",
    "text": "Nothing special, standard sports bar fare.  Probably better as a hang out spot than as a restaurant, which is what I was looking for.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qq08QJT0jfwn46C7SSnJ5A"
  },
  "Cc38ffzkDTbbj2YCPQA2iw": {
    "date": "11/13/2011",
    "text": "A really nice neighborhood sports bar. Sitting out on the patio was really nice with the perfect spacing of heater. Watching the staff interact with everybody it was obvious that this is definitely a regular hangout for many people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N5L1kEeq8ixhuuFvD7Q8hQ"
  },
  "bTAEZIFNnffiMt9mtt1Jow": {
    "date": "11/18/2009",
    "text": "THE very best wings!!  The raspberry-chipotle wings are unreal. If there is breading on this, I can't tell! Tastes like premium white meat chicken that is cooked to perfection.Truthfully they are so good, I have yet to eat anything else at this place and have been going for years.   The beer is served ice cold and the wait staff and bartenders are very friendly.  This is a great place to hang out and catch a game.  Doesn't matter if you come with a group or roll here solo, this place serves up quality food at great prices...especially  happy hour!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1MtpLk_TJfj16k_KZlkvJQ"
  },
  "sOmNWs0O3A1t2YMqnKY1MA": {
    "date": "10/5/2010",
    "text": "CK's, why did it take so long for me to write a review on you?  Perhaps I have taken your awesomeness for granted.    I am always critical of neighborhood bars.  Read my reviews, I'm critical of everything.  Believe it or not, I've even been called an asshole.  The thing is, I really don't have anything bad to say about this place.  I hope the owner/manager reads this because the only way a local bar survives is with repeat business, and you sir and/or madam, have earned mine.  I will now use my college education to cite with examples:  Here is one thing you are kicking ass and taking names at Dirty Harry style. (did I fire five chicken wings or six?  In all the confusion, I have kind of lost track myself)  Daily specials.  Not only are they awesome, they never change.  Nothing pisses me of more than expecting something, driving down, and it is different.  I have been coming in for quite a while on Tuesday nights with one of my friends.  We always order the same thing (by the way, 40 cent wings on Tuesday and HUGE beer for $2.50...bring that shit on)   That leads me to your servers.  Usually, we are lucky enough to have the same one, and she is frigging awesome.  Knows our regular order, walks up, takes the menu's away, jokes and says \"I know what your order is!\" and brings it.  (extra buck or two on the tip just for that) Even if we have another server, they are always polite, attentive, and friendly.  Not coming up every 5 minutes bothering me or being non-existent.  Seems like they wait until you are 75 percent done with your drink and THEN ask if you want more.  Perfect.  They attack with military precision few possess.    Longest I think I have probably ever waited for my wings was 10 minutes.  Maybe.  Had a family birthday party here a few months ago on a weekend night and they made things VERY easy and everything was organized.  Still on the subject of the servers, seems like there is virtually no turn over here and the wait staff seems like they actually enjoy their jobs, not like my job and unlike some other bars where the employees are bitchy and seem like they would rather stab you in the throat than take your order.  CK's does not possess the bitchiness and violent tendencies as previously described.  Other good points condensed in cliff note form:   -Bands 3 nights a week with no cover.  Awesome.   -The video games actually work.  Nothing pisses me off more than cramming a few dollars into playing big buck hunter and the fucking gun is broken.  Or golden tee and the goddamn wheel is lopsided.  The \"claw machine\" actually has prizes you can win that are big enough for my dogs to at least have more than 5 minutes tearing up before I have to take it away. -pool tables aren't crooked or ripped up felt.  All required balls are present and accounted for (it is amazing how many bars think two or three balls missing is acceptable) -Bathroom is free of the typical \"lake of piss\" found under urinals or the crapper.  Also very little graffiti on the stalls. -I don't think I have ever seen a dirty table here longer than 60 seconds.  Nicholas Cage can't even steal a car that fast. -Patrons here seems to have a much lower douche bag ratio than most neighborhood bars.  Still there, just lower. -They serve Pabst cheap (honestly I can't drink that ghetto piss but my Dad loves it and that is why he comes here) -They have that awesome trivia shit on the TV's.  Bad points about this place:  ..............I'll edit this if I ever come across any.  Until then, this section stays blank.    Keep up the good work!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "cUvDvAuMp4x9U7Qsj8VayQ"
  },
  "tQXOTLG3TwpvLyvz7N7_Yg": {
    "date": "3/11/2011",
    "text": "I love CK's. Their happy hour specials are great, service is awesome, and food is tasty. Try the adovada pizza...it's goooood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GM2PTwsoqZdjcmtvqiF2Wg"
  },
  "-co2iU2jxINgKsiLIl4nnA": {
    "date": "11/30/2011",
    "text": "I LOVE the raspberry chipotle boneless wings! Fun place to go watch a game, the staff is always nice -  and Chuck E Baby plays on Friday night for dancing. We enjoy this place a lot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TnLigfJgs9CWVO5yg7FuZw"
  },
  "kJMhEaKqHb7wKN3_CwZNbQ": {
    "date": "11/23/2013",
    "text": "Simple, great pub fare food. We had the club, brat sliders, and italian sub and would recommend them all. The fries and onion rings were fantastic.  The service was fast and friendly, and all was reasonably priced. Highly recommended!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hhif8NUcprWlkgyEVYdyBA"
  },
  "SJPxW3hqAMDpX5RGDHL9Nw": {
    "date": "8/26/2010",
    "text": "Nice place to grab a cold one and listen to some live music. They have everything here that you need to drink...Red Bull to Vanilla Vodka, and lots of flavors of Carbonated Malt Beverages! The band was Rug-Burn and they played some killer cover tunes. There was a wide variety of clientele there, from early 20's Hotties, to some seasoned veterans. Overall a good time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "i24aQvY6bcOC-pJEvepkgw"
  },
  "SS8HDUBOZiRh53Ahfmkbbg": {
    "date": "12/18/2013",
    "text": "Beer battered fries with chili was awesome lots of flavour but the wings were not very good dried and very little flavour but the service was great",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "70bHweHbDfBMSJwcERYolw"
  },
  "1Cx3aa8xGNd49aOTWE3A0Q": {
    "date": "3/16/2011",
    "text": "CK's was a fun place to have an early Saturday night dinner.  I was pleasantly surprised to find that they have Happy Hour prices on Saturdays.  We ate on the outdoor patio, which was nice but does allow smoking. The BBQ pork sandwich I had was very good and the staff was very friendly. For Happy Hour or a fun night out, CK's is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bqr4qKdJqJM9BM-HpAmghQ"
  },
  "zdhpmdDp16hMb-PD9AZARw": {
    "date": "4/7/2010",
    "text": "Again, my favorite spot in Ahwatukee for the last 10 years! The food is always great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7FN6aCyvhByS7YJhFG-CQQ"
  },
  "lP9fmYLNdieHjnz7JcKVpA": {
    "date": "4/5/2011",
    "text": "25 oz Monster Domestics $2.50 (Happy Hour), Boneless Rapberry-Chipotle wings that are unreal, and fast and attentive service.  I've been coming here for years and it is as good as the first time, every time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2nYedD8V94jE_5zFAeArbA"
  },
  "JwY7yYmX47Al6CurUrGL7Q": {
    "date": "3/4/2013",
    "text": "Its a nice little bar/ sportsbar.  They have some pretty decent wings, nothing spectacular, but if thats what you are looking for go to a wing place.  Their buffalo fries are yummy, thats what we default to when we go there.  Pretty good selection of beer, overall its a nice place to go and hang out with some friends and relax.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BZDUm_EXPbZ7eptAMX9JDQ"
  },
  "W9WuHlVb7oc08vMzNo6Omw": {
    "date": "8/18/2019",
    "text": "Had the wings. They were really good. The waiter, Dylan was awesome.   I will definitely come again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qD9hMP-iiQGjb6qg6OsjSg"
  },
  "xj5hVw3r3AiUIMmSp__ZEA": {
    "date": "7/23/2019",
    "text": "This is an update. It seemed that for a while the service, food and specials were in a steep decline after more than a few experiences. However, after giving them another couple tries over the last couple months, it seems things are back on the upswing. We stopped in for some food, happy hour specials and to watch a couple games on their many (many!) big screens. Steven was our server and he was super friendly, attentive, knowledgeable and on top of things. While they don't offer as many happy hour items as they used to, they still had a pretty good selection of food and drinks during happy hour. Watching sports here is really good, lots to see on lots of different TV's. The food is very good and prices are reasonable. Atmosphere is comfortable and relaxed. It's pretty clean inside and open. It definitely feels like a family business instead of a chain, and that's a good thing.   Favorites here include the boneless wings in raspberry chipotle sauce (these are super good, the sauce is different from anywhere else), regular bone in wings, tater-tots (who doesn't love tots?!?!), burgers are good and their spicy criss cross cut fries are awesome. They offer a HUGE burger that they took off the menu, but you can still get it if you ask, I think it's called the Grandfather Burger. It's great!  They have a couple pool tables and games, a decent patio with lots of TV's (but it's smoking out there) and even a private-ish room with games and tables you can reserve.  I love supporting local, family owned businesses and CK's seems to be back on the upswing, so that's great. We'll be back for sure and recommend you try it for yourself.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "FWW0x5aoy-hFXALL5-mq5g"
  },
  "muvVDfbNTynBVbvJVYwBVg": {
    "date": "7/9/2019",
    "text": "We have continued to return and with great pleasure Friendly service Excellent food Great ambience Doesn't have that sports bar feel We even bring our out of town company there now  I'm considering doing a group for dinner soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgUNlC8Il89ljyxvB_yeUQ"
  },
  "yHWc0XOvac2TKkX5pVi-xw": {
    "date": "9/12/2019",
    "text": "Just left this place! I had high hopes for this local bar especially because its walking distance from home. Unfortunately it did not meet my basic criteria.....Service, i came in sat down at the bar next to a really nice lady but waited 10 mins for anyone to come by and at the very least acknowledge I was there. Nope no one came and i honestly believe waiting anything more than 5 mins for bar service is not worth my time or money but I stuck around a little longer because I really wanted it to be my Thursday bar.  Sorry CK's I really gave you a chance but left without even an acknowledgment that I was ever there. Sad!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c4m7ykrkjWIXTsEzrljFnw"
  },
  "kIPwLZuJUQr5HmaIbqmOOA": {
    "date": "3/27/2019",
    "text": "We just moved to the neighborhood and tried out CK's for the first time. They have great yelp reviews and our neighborhood Facebook pages says they're the best sports bar so we were excited! We love hot wings and haven't found any around here that we love until we tried them here! We got a dozen, half medium sauce, half roasted garlic dry rub. Both were excellent! We ordered ours extra crispy (we always do for wings) and they came out perfect.   We both got a Mother Road Tower Station IPA to drink. I think they were 25 ounces or something but they were $6ish on happy hour! Awesome price!!   We also tried the Adovada Pizza from the happy hour food menu. It had great flavor but the tortilla on the bottom was very soggy (understandable from the meat and cheese being on top). We ate it with a fork and knife and got a few crispy pieces. The house made salsa was delicious! Next time I might just ask for a bowl with some chips!   Our server Drea was very friendly and gave great aervuhey have happy hour daily, tons of TVs and great food & drink specials. We look forward to coming back and most likely becoming regulars!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n2geGkxdbHBeqGufXoCdYQ",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. Adovada pizza. It was ok, pretty mushy but good flavor.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n2geGkxdbHBeqGufXoCdYQ/o.jpg"
      },
      {
        "img_id": "vTsHgr0FUrErj3yQfPV58A",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. Half hot sauce half dry rub",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vTsHgr0FUrErj3yQfPV58A/o.jpg"
      }
    ],
    "user_id": "U6beJJmfvDcPc-ry8vpeQA"
  },
  "4OEuX0ENbmf03Y9qG7Yoiw": {
    "date": "8/28/2019",
    "text": "Great neighborhood place. Katie has been our server for the past few months and always makes the visit great. The carne adovada is a great go to dinner",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AC251ih5DbMrzmSx_periw"
  },
  "HEVZvntBQeF2zJO1TANIew": {
    "date": "6/19/2019",
    "text": "Nice sports bar with a lot of TVs. Server was great and area for games as well. Clean place with big bar...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "61J02jL55nqMy3QSc4niMQ",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/61J02jL55nqMy3QSc4niMQ/o.jpg"
      }
    ],
    "user_id": "07wbZv8nXR4T9qxF9DrfBQ"
  },
  "2XQb593VPS51VsyrbWdjwg": {
    "date": "10/30/2018",
    "text": "How can you go wrong with this local sports bar, it's fun, modern and got tv's everywhere. Saturday and Sunday's are the best, lots of people and sporting events on. They have a masssssive bar area with tons of beers on top. Food is really good and they do typically have some specials going on.  Icing on the cake is the small arcade area, including Golden Tee!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "lGdkLxdrCzMRth0Nrq5Wkg"
  },
  "7BTTkggCH6hxJo4onTnqWw": {
    "date": "10/3/2018",
    "text": "We have been coming here for years and I have finally written a review.  Fun and friendly environment with excellent bartenders and staff.  Beers are really cold and the food is tasty.  Their wings are the best in Ahwatukee!  We had the hummus platter tonight and it has plenty of veggies.  Chris is our bartender tonight and he does a wonderful job.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qBEY-sZ86STw1x1H3jG7tQ",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qBEY-sZ86STw1x1H3jG7tQ/o.jpg"
      }
    ],
    "user_id": "Z1m-dWqtaB2NHHDSi0LKHg"
  },
  "ti1p6gE5UILhuogx2C9DrQ": {
    "date": "5/6/2019",
    "text": "Pretty standard local sports bar. Food was decent. Had cauliflower \"wings\" which were tasty and nice that they had a veggie alternative.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "S1NQi8H3qo4eEyfwcILXfQ"
  },
  "CHW9_jybDdRIOYPYAxqAvA": {
    "date": "9/6/2018",
    "text": "Decent beers for happy hour. Hottest wings I have had in a while. Tons of tvs for watching some games.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ly-JRFUojHYIWmt90fJVfQ"
  },
  "DYIJuqlGwZRElSkaiLxt0A": {
    "date": "2/13/2019",
    "text": "Good food, full bar, Great bands and solo artist appear here often. It can get crowded but That's not so bad.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hOrHA6KhFNhad7hJHT5X8A"
  },
  "NiLe8eWFaeMTLra9cVcqCQ": {
    "date": "4/7/2018",
    "text": "My rating is based mainly on their service.. so my friend and I stopped by to grab drinks before we meet up with our friends.. they have happy hour from 3-7 and otherdaily specials.. we just had couple beers and a basket of fries .. our waitress was very attentive and kept checking up on us even though it started to get busy.. I will be coming back to try their actual food other than a basket of fries ..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c40DTzCb-fHY6vI03PNRLw"
  },
  "SsnSvPiroUPpMiybWOQIiA": {
    "date": "11/13/2018",
    "text": "Food was just OK, place was dimly lit and just average. Waitstaff was friendly and helpful.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M8YOrhkNnE0ezzPEjPoeHg"
  },
  "sI-n8raEM-Fo1U_kqcP6sA": {
    "date": "4/26/2019",
    "text": "Good chicken philly, great fries, great service and atmosphere. What more can you ask for!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y34QSpv_z3qJ_dMLBy3hMw"
  },
  "qxbKkYX03OtVPL1lOc02Dw": {
    "date": "12/3/2018",
    "text": "Always great staff and service! This is the perfect neighborhood sports bar. Some nights they have a live band , usually Friday and Saturday nights so expect it to be a little busy and loud. Basic bar food but still really good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zGllWcpgDcUiuXK8lscwsg"
  },
  "xoyx8jOsTDlEjOYYjsSJyw": {
    "date": "10/17/2018",
    "text": "Yummy salads and delicious wings. The food always comes out fast so its a great place for lunch break!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U9dTE_n9BE1PsuhKHV2GRg"
  },
  "FfuA_gaOkJQykLi90V0g5Q": {
    "date": "4/12/2019",
    "text": "After venting about some customer service issues we spoke with the owner and are satisfied with the resolution!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IUFDPfYN11JQCSmKp5G8Tw"
  },
  "uWiAbSye7JEpy3ALI4sgwg": {
    "date": "11/25/2018",
    "text": "The band was good, the drinks were good, the staff was nice, so why do they decide to have last call one hour before they close. Why do venues insistent on chasing out the patrons one hour before they close. Maybe the staff would like to leave. Ok, I understand, however does the venue prefer not to make any money that last hour, because no one has any desire to buy anymore food or drink when you turn all the lights one hour before closing. Don't pretend to be open till 1am when you intend to run the customers out an hour early. So, this makes me hesitate to came and party with my friends at CKs again. Think if this is where you want to spend your money, there are a lot of other places in the East Valley.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J8oeCdlWSsafPz07J9wdPw"
  },
  "msmap6nPbq1ux65881uMug": {
    "date": "2/9/2018",
    "text": "\"Chincy in the ranch and the fries\" but the fish was fantastic! Quote from my bf. I loved the fries but no unlimited refills. I'm sure ranch woulda been supplied if we asked.  The fish was fried to perfection and was tasty. Worth $11.99!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P-r4_92JwEAK-OulJC3EDg",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P-r4_92JwEAK-OulJC3EDg/o.jpg"
      }
    ],
    "user_id": "M34OdhhYnxgsPBIJQ70nEA"
  },
  "yqMe14TjFyo00X8cYm-H3w": {
    "date": "4/12/2012",
    "text": "Pretty decent sports bar in Ahwatukee. Their food menu is decent but not earth shattering. I haven't been disappointed by anything but I also haven't had anything that was really memorable either. Ok beer selection but they have good daily specials that make it an economical place to have a meal and beer. Lots of TVs around the place make it ideal for catching sporting events. They frequently have live music and it is frequently mediocre. Not a great bar but definitely one of the better ones in the Ahwatukee area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R2skENKD8yaO6hOixQxBiQ"
  },
  "lPRRhMJFfIeq6ywOlYkEXA": {
    "date": "12/15/2012",
    "text": "Ck's was one of the worst experiences I have ever had. We went in the middle of the day to get wings which were honestly the worst wings. Mild buffalo was a weird cranberry sauce that was runny and didn't taste like buffalo at all. The honey BBQ was just wings with plain honey on them which was disgusting concidering the \"boneless wings\" we're dry chicken strips that were chewy and gross all around. There was no one there and plenty of servers who took 30 minutes just for drinks after telling him what we wanted multiple times. Didn't like the atmosphere food or people . What a let down for ahwatukee!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o5bpwN55B3qWwB2e2vaX8w"
  },
  "OlCPOBPDmWQt0lo0-DIE_Q": {
    "date": "2/24/2010",
    "text": "Please allow me to begin by saying that all my reviews are category specific, meaning that if I believe this place is a sports bar/pub, I'll rate it according to my relative standards for such an establishment.  That said...  This is a fantastic sports bar.  Big screens, cold and lots of beer, GREAT food, and good service.  While Cassie and I are not regulars, we have been more than 5 times now, and have yet to be disappointed.    When here, please try:  Raspberry Chipotle Boneless Wings - yes, as good as they say, and deserving of the \"franchise\" tag; Spicy K Barbecue Pork Sandwich - delicious w/ flavorful BBQ sauce and cheap!; Hatch Burger - spicy, w/ flavorful beef and cooked to order; Barbecue Cheddar Melt - fantastic!!!; BBQ Burger - if it's slathered in BBQ, it's delicious!; Beer-Battered French Fries - especially good w/ cheese; and Onion Rings - crispy and tasty!  My opinion is that these burgers are better than Delux Burger's...  Let the games begin.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kXwDkqmUfnDNePu8zfvxXA"
  },
  "EjiAhDx16pchara1pNvweg": {
    "date": "5/21/2015",
    "text": "I was here last Friday during the live music night. It was a little packed, nothing extremely crazy. I am asked for an ID since it's 21 + at night, and then the person just stood there talking to someone. I stood for a while then asked if I could seat myself, he finally said something \"yes\". I sit myself and wait about 10-15 minutes before anyone comes to me and even gives me a menu. I ask for a cup of water with extra lemon and only get water with no lemon after waiting a while. After waiting, and waiting, and waiting, I finally get someone to ask if I'm ready to order. I must say the people who run this place are cheapskates. They charge for every little thing, even a certain dressing on salads, and everything is over priced. I order a salad which comes out to $4. The salad was tiny, the dressing was disgusting, didn't taste like Italian dressing, and even after asking again, I never got my lemon for my water. I got ripped off and I'm not going back again. If you like over priced, mediocre food and terrible customer service, this is the place for you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YzEc-w2FKkgmGRT2iMV_Lg"
  },
  "m7l0PP2o0Z29CUl5cC3SkA": {
    "date": "5/4/2015",
    "text": "Cocktails that \"supposedly\" contain liquor are DEFINITELY watered down.  As if the customer will never notice.  Stick with the beer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RUZ0SO7vfmyDDnqhwL9r_Q"
  },
  "A8gz6s4lsxvZ_v6xM4N8XQ": {
    "date": "1/24/2013",
    "text": "This place is fabulous! Best place for just about anything. Food is amazing. Try the meatloaf sliders with provolone (special) or the pulled pork sliders or Raspberry Chipotle wings.... the BEST.  Servers are super friendly and it's the best neighborhood bar you could find! All you haters can get on out of the Tuke. CK's is the shiznit! The patio is a great place to watch games and enjoy a fine Cigar and drink with friends. Can't get any better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x_9_Xr0_X5YVQ5X4ha6NXw"
  },
  "RJXKdWmiMg8KYcPvJoth2Q": {
    "date": "5/12/2009",
    "text": "It's not easy to blend being a good bar, a sports bar, a live-band bar and a place for good food. But CK's manages to do it.  My last trip here was for a birthday party over the weekend. It was packed, as usual, but they had no trouble accommodating the dozen-plus of us that showed up. Our waiter was fast and remembered every order. I'm still puzzled how they do that.  The band was great. I've heard 3 - 4 bands here. They always seem to rock. Well done, whoever does the booking.  In fact, it was such a good time that we're going to have #evfn here on Friday night!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "isy4gf66dvSLbiItR9kERA"
  },
  "pTxiqp8lzhAEBwiw06LoVw": {
    "date": "4/28/2015",
    "text": "Classic!! Such great food and the owner is the sweetest lady in the world! I go with my family all the time and it never gets old! Great service and great for Sunday football!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tTZZfW9o8vSgSqtgLrcELw"
  },
  "_jIqi_TUorvmA3fdjCumdg": {
    "date": "3/9/2007",
    "text": "CK's is a real find in the SE valley. Warm, friendly, yet vibrant. And... live music! Th. through Sun., check out the bands while you relax on the patio (no smoke there). What a way to unwind.  The service is very attentive. For example, when greeted we are usually asked, \"Are you here for a particular game?\" checking so that we can be seated accordingly. The wings are great (try the Chipotle Raspberry-- seriously!) and the burgers are big and juicy. They also offer a wider assortment than typical sports bar fare, such as Mexican specialties, salads and seafood.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Xj9-p-_zm37ALyR1Qq34fQ"
  },
  "Zhp2J5R47dEbQ-bLHEZPvg": {
    "date": "1/19/2008",
    "text": "CK is a great place to have around. We been there a bunch of times and never disappointed. Every single day they have drinks special, and some day food special. Like today is Blue Moon Pint $2 C'mon!!! Its great. Food is also excellent. Fresh, tasty and sizable. I favor their Special K sandwich - it really is very good. Ask for them to wrap it for you instead on the bun. Good stuff. They have inside and outside areas. Inside has 2 pool tables, bar and bunch of TVs. Outside is a nicely sized patio with a TV or 2. They do not mind if you smoke outside.  Just a note - parking lot is usually really full and it may take you a bit to find parking.   All in all CK's is a great place for lunch, dinner, watch a game and/or have a few.   \"I like\"  Eugene",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "v00qwDpy4uMRZd4WdNsABg"
  },
  "ooSTmZfxud-GCIv1p8dctQ": {
    "date": "4/10/2015",
    "text": "Staying in Awathukee for 7 week escape from cold Alberta, Canada. CKs was recommended by a neighbour in our condo complex. The service was great and very friendly. The food was fresh and hot. The prices were very good too. Will definitely be back. The patio was a great place to hang out and watch the baseball games.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VdLQcDqzKMRqqgG6bzHOYg"
  },
  "Y0F8u1Aw52N_3Gl_ajXsVw": {
    "date": "4/7/2015",
    "text": "I have two favorite bars in Ahwatukee. This is one of them. Yes you do think you have time travelled back to the 80's when you open the door. If you are looking for upscale Gastro Pub or a fancy mixologist to dazzle you, this isn't the place for you. I am a snob. I transplanted here from Portland, OR. Home of some of the best beverage and food in the country. So when I say CK's hits the mark, you can believe me. The Slop Burger is phenomenal. Good Happy Hour, although they need to broaden their choice of apps. The beer is cold. The well drinks adequate. The staff is friendly. It still has a jukebox that plays everything from classics to contemporary. My daughter likes to play the games in back, especially the claw. There's one well loved, well used, pool table in the back near the patio.  The appeal of CK's is it's bar that could exist in \"anywhere\" America. It goes back to the basics of what pubs and bars once were. Ck's is that meeting place within the community.  It proves that bars don't need to be complicated to be successful.  Couple that with good staff, good food and a sense of familiarity, and you have a winning concept. Cheers! See you at CK's.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kuOsBRRdbtFNsVJo4Rp1yQ"
  },
  "g62oAWJWcDB0k5mQnfT8_w": {
    "date": "4/26/2008",
    "text": "This place is pretty great and it doesn't hurt that it is walking distance from my apartment. Really good food with more variety than normal bar food.  Great beer specials.  There is a band that plays Thursday nights and they mostly do covers of songs that are fun to sing along or dance to.  And...they have NTN.  What more could you want?",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "J2RMgLpTCjTyMT-Z_ozoAA"
  },
  "oX_niwxljcZYSWqqw5Ucwg": {
    "date": "12/17/2012",
    "text": "We had our annual holiday party in their back room. Great food, and service. Thanks for making it a big success! This place rocks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7FPowmRCpulSIma1VF3-mw"
  },
  "iGFLHZk3L6MCaTv0CJwUZw": {
    "date": "12/9/2012",
    "text": "I love their boneless wings! They also have a good burger, but I wouldnt recommend their chimichanga. Good beer and good service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h4gfdAEaw98fjpNmpVx8KA"
  },
  "xc-ILoO_Z0Lbv8ykHBGJ7g": {
    "date": "7/30/2009",
    "text": "I LOVE this bar. My first visit was in 2004 when it was known as Bar Nun. I'd just moved to AZ and I was drawn in by the neon green light and funny name. Little did I know it was the beginning of a love affair.   Since I didn't know anyone yet I went by myself and sat at the bar. The staff was friendly and so were the patrons. Some of the patrons turned out to be a little too friendly, and the bartender, Jennifer, insisted that the barback walk me to my car to ensure my safety. As if that wasn't enough to make a fan out of me, I found out they serve $2 Blue Moons all day Saturday and the food is awesome!  The burgers are great, and you can order them rare if you like. I also became addicted to their BBQ chicken sandwich. And the wings. They'll grill them instead of fry them for you which is a bonus. In fact I don't thing there is anything that I have tried and disliked here.  Thursday-Sunday night they usually have a pretty decent cover band. Usually classic rock or 80s stuff. They also have NTN and a ton of TVs if you're into sports.  I was so in love that when it came time to move from my apartment, I made sure my new house was within walking distance. Not that you'd need to walk, (since half the year it is hot as hell even at 2am I can see why you wouldn't want to walk) they offer a free ride program on the weekends where they'll pick you up and drop you off. That way you don't have to worry about Sheriff Joe and wearing pink undies at Tent City.  Wow, I kinda wanna move back now. CK's I miss you!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VF_rA0PiJCypyeWSFYxLPw"
  },
  "xRXq4R3FmyI_gIHtGLqdHQ": {
    "date": "6/13/2010",
    "text": "I have honestly never had a bad experience here.  The wings are the best...lil secret...request to have them put on the grill to make them a lil extra crispy!  The fries are so crispy, crunchy and hot!  Had the opportunity to enjoy the Bloody Mary bar where you fix up your own with all the fixins'.  You basically get a glass with your choice of poison and you fix it up with the juice, hot sauce, pickles, peppers, etc.  The servers are awesome!  Never have to wait for anything.  They are on top of it there.  It appears they enjoy their job and you can tell by their service.  Man wish I would've gotten up earlier and went and got me some honey bbq wings!!  Well let's see it's 230am now...9 hours from now I can have me some of those wings!!  Ok...go to sleep wake up and go eat wings! That's the agenda for tomorrow!  Price is moderate that's if you drink beer and the time of day you go because of specials.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rPrBGjBeB99ExxKp-HkB4w"
  },
  "TOKxZnyK6BGrf0q3WatcQw": {
    "date": "5/29/2009",
    "text": "I liked this place!  I got the special k Pulled pork, in spicy bbq sauce, with coleslaw and pepperjack cheese YUM  I thought it was delicious for bar food.  I'll definitely come back.... just seemed like a very chill sports bar  Yay!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OPN-dDUBkH7uH-G8nOnskg"
  },
  "eRoGAZWJVl7YjJY0PHinDw": {
    "date": "3/24/2010",
    "text": "As Debbie W said... \"I wish I lived closer\".  I tried the Hatch Burger, this spicy treat was perfect and smothered in cheese and hatch chili sauce. But the one thing that really made my night was the Chipotle Raspberry wings.  I thought I was in heaven eating them.  By the time the Hatch Burger arrived I was full so the burger didn't get the full attention it deserved.  I tried a taste of hubby's beer and well it was also very good, I just can't remember the name of it.  I have to say if I lived closer we would be there at least once a week for burgers.  Much better then where I usually end up.    Excellent job tonight!  You guys rocked it out of the park and I really enjoyed it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4cHbhUrLXhlKStUpNzBL1A"
  },
  "PS9Ho5q-E6VzNuXmIi3dDA": {
    "date": "7/19/2012",
    "text": "The raspberry chipotle wings were fantastic. I ordered the patty burger which was good but not something to write home about - a sauce would have made it perfect! Service was great and every TV was tuned in to sports.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gXHuqQqCxW8vP878tPKP0w"
  },
  "NcBPmKgiS0Xu8LaQBgQ6Xg": {
    "date": "4/30/2016",
    "text": "This is the first time my wife and i have been here and this is a  very nice place. Its more resturant than bar which was very nice. The burger was to die for. The Buffalo chips were amazing. My wife got the carne audovada and we got wings and everything was supurb. I can see why they were voted best of tukee. The service was top notch. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "G1qXkV1K9oEgyFhQZeF-iw"
  },
  "T2BMPz7KgfqVzOXk-29nag": {
    "date": "10/9/2016",
    "text": "Great Sunday football atmosphere. The servers tending the bar are fantastic! After being away a year, the waitress remembered my name! Food is always good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wLyo7WRwOZ881_0c2alClA"
  },
  "wEQr1byHB-lEzFpPx7x3XQ": {
    "date": "9/17/2016",
    "text": "If there's a better staff or an owner more in touch with their patrons than CK's I have yet to find them.  This is a classic sports bar where you're always treated like family.  My wife and I frequent numerous restaurants and bars in the east valley, and CK's is always where we feel most at home. You won't be disappointed when you visit here.   Support local, folks!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NOiy9SBKXCKvbNzpZwOuIw"
  },
  "Cnd3VcX-vltyYy0P2HOUng": {
    "date": "4/10/2012",
    "text": "New to ahwatukee and figured it was time to find a local watering hole to spend my nights, so I popped in on Friday night to sample the food & service, and I left happy as  clam.  First, the staff were all super friendly and attentive to my needs, but not pushy and always around to interrupt my meal or the fact I was watching a game on the multiple flat screens available for viewing. Also, the band playing did a great job of keeping the evening lively, but since i was a first timer i sat at the bar, so I bet the folks near the band were having more fun with them.  The food, which was awesome for being a local tavern, had a lot of flavor and the portions were huge, which is always a welcome site. I had the jalapeno spinach dip (awesome) boneless hot wings (super tasty and a bit of fire)plus some chili cheese tots, which stole the show.   All around great experience and am certain this is my new go to spot for local eats and drinks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "anHzk1C0oQRtfuDj74p2RQ"
  },
  "SgCkE0oU-EzJ9BKcleyVfA": {
    "date": "5/16/2016",
    "text": "The mushroom and Swiss burger was very good. Perfectly cooked to order. The buffalo fries were half cooked properly and half turned into some sort of solid-state disk. Some of them must've been fresh cooked and some of must've been sitting around for quite some time. They were stone cold and hard as rocks.  They were not only old work they were obviously over Cooked from the color.  I have read a lot of the reviews and they range from very very good to very disappointing. I can understand why that might be, they obviously have trouble executing sometimes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QoeoNQlXtfaiiwTDYIYveQ"
  },
  "L6BIYWZhuOZUNKxBxyLk4Q": {
    "date": "7/24/2014",
    "text": "Be careful what you order from here.  I ordered the potato skins and asked for sour cream only instead of sour cream and the chipotle ranch sauce that comes with it. They charged me .50 extra for the other sour cream. When I asked to talk to a manager, his explanation was that sour cream is more expensive than the ranch sauce. BS! I realize it was only .50 but it's the principle.  I didn't get any more condiment than what I would have gotten if I wanted the ranch sauce so why charge me more? It'll be a long time before I return to this establishment, if ever, if this is how they treat their customers.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y9mIRfB88BHIbtBEyrgq8w"
  },
  "GP9dSrZidHzz4t4CjAvOug": {
    "date": "1/31/2012",
    "text": "We ordered a steak sandwich and the raspberry chipotle boneless wings everybody was raving about.  The steak in the sandwich had no flavor, I've had better steak at a chinese buffet.  The bread was kind of nasty..  almost stale but I think its just how it comes?  The tots were the thing we liked, but how do you screw that up.  The wings were shrivelled - kind of like chinese food in a way where they batter and fry up chicken pieces that are sliced thin and then cover with sauce.  The ends were dried up chicken and batter that were more like jerky than wings.  The sauce was creative, but definitely not the next ranch or honey mustard.  Maybe a little more of a spicy kick would make it better.  All in all, won't go back.  Mostly because we don't live in the area so the next time we're there, we'll try something else.  If it was in my neighborhood, I might go back for happy hour.  Their drinks looked pretty cheap and I wouldn't feel so bad about the wings if I'm paying half price and drunk.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "niKu4se6xtf-ctlm0udr1w"
  },
  "Qq4Sd3nDYku3EwPr0svMdw": {
    "date": "9/3/2009",
    "text": "How is it possible I've never done a review for CK's yet?  I live right next to it and eat there like once a week and had a huge birthday bash there... whaaaaaat?   Wow... so anyways.. here's my review.  GO THERE :)  done.  Srsly tho... awesome food... the friday fish fry kicks ass and isn't expensive and you can choose between cod and perch.  The breakfast burritos and stuff are good and they have some pretty decent drink specials... only one I remember off hand is $2 Blue Moon pints all day Saturdays... yum!  The live bands are always good, two pool tables, bunch of flat panels everywhere you look, huge outdoor patio with misters and TV's again, and they even have some arcade games towards the back.  Staff... always friendly... never had one person in there be bitchy or short or anything... very nice crew they got working there.  I see a TON of regulars too meaning there's some good local culture in there.  Anyways... had no idea I've never done a review for them yet... sorry CK's! lol...   I'll see ya in there!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "V3oVkdVjfIGKkhS2OFriLA",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. CK Tavern &amp;amp; Grill Logo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V3oVkdVjfIGKkhS2OFriLA/o.jpg"
      }
    ],
    "user_id": "9lKCs1d4AE5eOmtIpuviAA"
  },
  "RW--14t8BB7AjoVPNfKLrQ": {
    "date": "4/28/2009",
    "text": "Since my last review, I've been to this place several (maybe 20) more times. They have live music (with no cover) on Thursdays-Sundays, which has proven, without fail, to be very entertaining.   They also have free wifi so you can bring your laptop and get some work done while you eat. The place is generally very quiet on weekdays during lunch, so it's convenient to sit in a booth and actually get some work done.   Really can't think of a negative thing to say about CKs. Actually chose this as a venue to throw my boyfriend's birthday party on a Saturday night. Can't wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "jQjuysPsJRdeUGkvSEIOcA"
  },
  "7n1qgZ1toDHV7uylHwjtoQ": {
    "date": "12/8/2013",
    "text": "I ate there with my husband on a Saturday and watched some college football.  It is a dive, but it has some nice tvs to watch multiple games on.  Standard sports bar atmosphere.  Our booth wasn't very clean, and the restaurant smelled kind of smokey.  Burgers were ordered medium and were well done, not even a little pink.  Food was ok.  It seems popular with a 50 something single crowd.  I probably would't go again personally.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gCSlX2tvG-M51Pok5WDmnw"
  },
  "ESSIWS0B0CHnQ6kRL7l2jQ": {
    "date": "3/21/2012",
    "text": "Went in midweek for lunch with a few guys from work. Place was quiet, easy to get seats. Staff were super friendly and efficient.  Some of the best wings I have ever had... Try the boneless wings, hot, and \"Finished on the grill\"... AWESOME!!! Also highly recommend the patty melt on marbled rye with sweet potato fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fgXIN9dWamEPphjdcyDD_Q"
  },
  "1XqsS_8s8UyyFdKYGU1s-Q": {
    "date": "12/27/2012",
    "text": "They have an awesome selection of beer. They have live bands on the weekends. The prices are great, and the raspberry chipotle wings are PHENOMENAL... Great place to watch a game with TV's everywhere. My kids even love going there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1I3ojmZODqEGtOI44axDOg"
  },
  "5UKPmYIwfTlRnDXhsQ6AYQ": {
    "date": "8/14/2014",
    "text": "Great dive bar. Good service at the bar. Awesome specials. Regular bar food but it is what it is. And if your in the mood to kill time it's great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uAZ6Sp3uaH3TIztZqqtmPw"
  },
  "wRpCoObasdPs9uUk0y6obg": {
    "date": "11/7/2011",
    "text": "I should probably have reviewed this alonggggg time ago.. because honestly, this place is my Cheers. Except...not.. really haha. I usually come here every day after work, unless I am really busy with school or something. The regulars that come here are awesome, same with the servers and bartenders..basically everything about this place is amazing...oh but of course, I can't forget about their rasberry chipotle wings and their hamburgers.. SOOOO GOOD.. just thinking about it is making me drool..attractive ;)  Oh by the way, they have amazing choices for whiskey and a day just for whiskey drinks! (Thursdayyy!) Another reason why I love this place :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "K2Jl8phx-078qp11z4EU_A"
  },
  "T4AJAFX_f-0CVXgUEdh2Gw": {
    "date": "9/28/2009",
    "text": "The owner wrote to me the day after my review - nothing like owners that pay attention to what their customers have to say.  We need a new category to rank owner/manager responsiveness - how about it Yelp?  I'm amazed at so many places that get Yelped and yet no one at the restaurant seems to read the reviews....what a waste of great customer feedback.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pNOST_hTkcZzr4nsx_oYQQ"
  },
  "6aGCV4U8-lTQii2SK6VlYw": {
    "date": "1/20/2014",
    "text": "No wait at all... very cool people on the patio, and nice service.  The only reason I'm not giving it 5 stars is because I wasn't blown away by the food; however, was decent bar good.   My wife and I will definitely be going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "T0FXHb64dv8rs-2aGGO82g"
  },
  "ps2Ls8o5dECi-gQOnjpDKw": {
    "date": "5/29/2013",
    "text": "Cheap beer, decent food, nice change of pace from all the chains around in the area. $2.75 Heineken, plus their buffalo fries and Guinness mussels are my favorite.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "ewtL3plKywXuLtmFZoUczw"
  },
  "HAHwpniI2_0HY70lUzkcuw": {
    "date": "2/6/2015",
    "text": "Had a good experience. Good food and very nice servers. The French dip had plenty of meat and no fat or gristle.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "spNmGA17OFg4yzeouzGPJQ"
  },
  "g82rz9gtuaKcPVSLMjEy0g": {
    "date": "5/19/2014",
    "text": "This is a fun place to hang out at. They have great service and really good food! They also have a live band playing on Saturday nights.  It's a bar but also a family place, where you can grab a bite to eat with your family.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CSrq168peLxtoKYDrCkDYA"
  },
  "-F-ZtLUSy_s_-x78PGkGsg": {
    "date": "12/31/2014",
    "text": "I always love it when Erin is there, so tonight was awesome! Always get great service and the food is good.  I love the salads and the wings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-FhX7CeDsknIFduPIfHfKg"
  },
  "eaRDwz1kHS6UbT8J3fP7uw": {
    "date": "3/30/2016",
    "text": "We went here for an early lunch. The food was average- boneless wings were dry, burger was just ok.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sg3lKLP-hDBNocBP1mL8iw"
  },
  "p2S2uT2rNR3aPlRBVCXQ7Q": {
    "date": "11/6/2015",
    "text": "I had the Boneless Wings...grilled. I recommend getting them grilled.  Cold beer, great staff and lots of screens.  Sit at the bar when Brenda is working for a good time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LbRcwzDoCqtQdbc7oN1ejQ"
  },
  "wP7MVLI77kWkuFOAe2k2HQ": {
    "date": "11/9/2013",
    "text": "I'm thinking this place gets the high reviews for their awesome drink specials... definitely not the food. The drinks are always a deal, and it must be popular on weekend... it was dead the night I went.. but at least l could get some bad wings and a few beers at midnight. Barkeep was very nice too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "slwF_B8N7SBTeaYTmN3Bzw"
  },
  "yQfKMiqa8L_XzPICKh24Hg": {
    "date": "10/4/2015",
    "text": "I really want to like CK's ... And normally I do. I love the grilled wings and many items on their menu. The service is great however the lighting is low and dingy, plus the bathrooms are kinda gross. I came here for the Cardinals game figuring I'd support the local bar. I was disappointed that the sound was constantly switched back and forth between the Packers and the Cardinals game. At times they even had both game sounds overlapping each other. You'd figure the sound would be kept on the home team. I won't be coming here again during football season. The new Philly's on Warner has an amazing tv set up and always keeps the sound on the Cardinals game.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IDmVrk_8FZO06x31shqKdg"
  },
  "mi4kKbrS9OTl6N_LbgUWLw": {
    "date": "1/16/2014",
    "text": "Cks is by far the best hang out place in Awatukee.  They have a fantastic happy hour that always fills you up. Also I love the staff. I've been living on and off in tukee for the last 17 years and will always choose Cks.  Look if your like me you like a good soft pretzel. I make a point to order a pretzel at any place that serves them. Cks has the best in the valley.  Its huge, ridiculous, and delicious.  I love this place. Best restaurant in Tukee  to watch a game have a drink get some great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "C7eD-rvmhskbVook4KKr_g"
  },
  "6nJyDaFXMFFoPynDfXhfTA": {
    "date": "5/17/2011",
    "text": "Right.  Solid.  Great sports bar.   They used to sponsor my buddies' softball team and so we would always go over there afterwards and drink.  They gave us so much free beer.  Pretty much went every Friday evening for a year.    Great wings, good food in general, tons of TVs, huge bar, huge outdoor patio and even a couple of pool tables.     The live music on Friday nights sometimes annoyed me.  Old people seem to be attracted to this dance floor and the music was just too loud to talk even if you are seated at the opposite end of the restaurant from the band.    Yes, I realize that is an ironic statement.    Whether you are going to watch a game, have some strawberry hot wings, get hammered, or just to dance with some old people on a Friday night, you can't go wrong with CKs.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "s79vzEzqavL_29pmraXZBA"
  },
  "XVEwMXyDxNYTJQzqtyD2JQ": {
    "date": "4/13/2011",
    "text": "Once again, CK's hits the mark!   Go for Happy Hour, and order the raspberry wings grilled..tasty! Also get the Southwestern  Dip and chip great with a tall Fat Tire! A nice atmosphere out on the patio...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UW5IXAaubhYO9uUPSl7GWA",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UW5IXAaubhYO9uUPSl7GWA/o.jpg"
      },
      {
        "img_id": "sVD93Kn127EOxRDBlzuKOQ",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sVD93Kn127EOxRDBlzuKOQ/o.jpg"
      },
      {
        "img_id": "fkRex4yDeSjogD9e6z6zSw",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fkRex4yDeSjogD9e6z6zSw/o.jpg"
      }
    ],
    "user_id": "PNx1x8x3wjTIjrjhaNiVAQ"
  },
  "KYEZlhdZNgr0FCwjblqIjg": {
    "date": "3/9/2015",
    "text": "I reviewed CK's a while back and I would like to say since then, their service has really come back up to par, their food is great and we are regular customers once again. I ordered take out tonight and they were super fast, the food was hot and great and I was so impressed that no less than 4 staff members either asked to assist me or told me thank you for coming, have a great evening. I'm so glad because I have always loved this neighborhood eatery",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "GiZtUWsrGCEUsCM_HyT9Pg"
  },
  "4PNEa2VGxML3DtThb0T-tQ": {
    "date": "6/18/2015",
    "text": "All around some of the best bar food in Phoenix.  The wings have gotten a bit smaller over the years but they have a great taste.  I recommended the grilled hot wings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IGseYnL1j8q9Pyt6byaEgQ"
  },
  "y3pQILKLEoN3pu5LxOLH9w": {
    "date": "11/22/2015",
    "text": "CKs is an excellent neighborhood bar and grill. Whether you want to watch the big game with some friends or just want to have a few drinks and some tasty, fresh food, CK's is the place to go. My favorite thing to eat here is the Bleu Burger with hatch green chili added. Pair that with some buffalo fries and a cold beer for a perfect meal. Go to CK's next time you have a hankering for a great time with some great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i8hwcv5UOSvtyXXy-7I4zg",
        "caption": "Photo of CK's Tavern &amp; Grill - Phoenix, AZ, United States. Chipotle raspberry wings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i8hwcv5UOSvtyXXy-7I4zg/o.jpg"
      }
    ],
    "user_id": "BQFEVvNH-zLkXSROHAtkRw"
  },
  "uekVmm01WfEgLPhliJAcBw": {
    "date": "3/14/2016",
    "text": "Great local restaurant and bar!  Food was very good, reasonable prices, drink specials and wonderful brownie ice cream. Waitress was fantastic.  Even had a pool table and juke box!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4rmgulehr7o9iL-e5dHuyA"
  },
  "Bs-LJS1afhHk0tEY96eCkA": {
    "date": "12/10/2014",
    "text": "Thanks CK'S for making hump day Wednesday evening, better, nice evening decide to sit on the Patio. Servers (syndey and sway) were friendly and attentive.  Once again chicken parm is perfect, there went the diet...Live entertainment was awesome (Juliel), and much appreciated bonus.  Raises for all!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JE2-SsoGJXuJmJEWdbUGrA"
  },
  "_4qorQXpO4AEPxnS5lx_0w": {
    "date": "4/30/2015",
    "text": "Being new to yelp, it's unfortunate that my first review has to be so negative.   I brought my family into this establishment a few days ago. I must say that I was absolutely disgusted. This place was low class. My wings were way over cooked and dry, but I was not about to complain to someone in that place. The floors were dirty, the employees had scowls on their faces, we overheard one employee talking to another employee saying that she hates people as she stood at the hostess station, the lighting was terrible (dark and dingy) and the games stole my kids quarters!!!   The only positive experience we had was our waitress. She greeted us at our table and introduced herself. After we told her that this was our first visit there, she welcomed us and also told us as that she was new to the establishment as of a few weeks and also new to Arizona. She spoke highly of the place and the food and was cheerful and polite. We talked with her for roughly five minutes and had a very nice personable conversation. I asked her what she would recommend on the menu and she gladly gave us all recommendations on the food that she thought was good. After taking our order, the food was delivered by a male waiter. This person was extremely rude and when I asked for more ranch he grumbled and walked away. A few minutes later, our waitress showed up with the extra ranch and again was very attentive and polite. She asked us if we wanted anything else to drink and so I ordered another beer. I then overheard her asking this male waiter questions about the beer and he snapped back at her with a very rude comment. As she struggled with the ordering system at the hostess station, he and another waitress looked at her and just laughed and made fun of her. Instead of helping her, the young man began to belittle her. Once my beer came to the table, I asked her if there was a manager on duty that I could speak with and she pointed at that young man. I declined to talk with him when I found that out. I was completely turned off to find out that management in that place treats their employees like total dog crap!  Needless to say we all ate what we could of our food and left her a very nice tip! Her service was splendid, but I will never go back!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZFElw7itR-16KMwnYya36w"
  },
  "A1xaVF9nUUQ9GNzCyMWXxg": {
    "date": "12/4/2013",
    "text": "Great food, friendly staff, reasonably priced, and they have great live music all the time.  You can't lose!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ty03qtbp3yyPbQK4RVM4eA"
  },
  "MrFyUyw-WKO4MjLigKlI4g": {
    "date": "3/9/2014",
    "text": "We frequent this place quite often as we enjoy the trivia games on t.v. and the general atmosphere is appealing. The chicken strips are always delicious and the fish fry on Friday night is a good deal. Be careful not to finish your fries and cole slaw too quickly though, unless you want to purchase more. The fish fry is an all you can eat deal but just for the fish, which can get a little boring after a while...pace yourself and it'll be fine!  Good beers, good service. Nice neighborhood spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L1cK7QpbVxDd3l0HrPbq6g"
  },
  "_EcFWcwN_9RnS8_yDVtraA": {
    "date": "9/28/2012",
    "text": "I've been here on several occasions to watch sports with my boyfriend and whoever else is with us and so far this place still is just considered \"A-OK\" to me. The food really isn't all that great consistently. Last night we got some wings that we're small, barely had any meat on them and basically were bone dry. Their fries were really yummy and we also got a meatball sandwich which was good. Whenever I've gone its been a hit or miss with the food.   Also whenever we sit inside we get great service..outside however not so much. I think the waitress forgot about us the majority of the night.  I think overtime I could easily become more fond of this place, its always clean and the staff is friendly. Over all its a pretty good sports bar.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wSASZkO5XnuWcxlgDpJXWA"
  },
  "6Dm6GnvkSgoQ3rD0Dir1zg": {
    "date": "6/19/2015",
    "text": "Love this place. Friendly staff, good selection of beers, and buzztime trivia. Can't go wrong.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JTegUiKlmLNyTn0AdPSKbA"
  },
  "tH7OLrriv47hbHGDFICxNw": {
    "date": "11/6/2014",
    "text": "Probably my favorite wing & sports grill in Ahwatukee. Very nice staff and service. Very good value.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gYVwUG70JJUSVeO_jCKpEA"
  },
  "wI0w3uXcFDMdj3IRRM3OqA": {
    "date": "4/20/2014",
    "text": "We've been here a lot since our first visit. Unfortunately, I have to lower the star rating. While service is good, and we like the Friday and Saturday night bands playing, there are a few things that are starting to bother us about CKs.  The only food items we really enjoy are the fries, the wings, and the zucchini. We've tried different burgers, sandwiches, and a couple entrees and it's just boring and bland, or the portions are too small for what you're charged. The burgers are pretty good size but their sandwiches aren't and regardless of which you get they seem to gyp you on fries. Last night my sandwich came with 4 big fries and about 6 or 7 little skimpy fries. My boyfriend ordered the hatch chili burger which we were told was an open-faced burger. While that's fine, they didn't give him the top bun. Generally an open-faced sandwich means both the top and bottom pieces of bread are laid on the plate and all the other messy ingredients are poured over top and you eat it with a fork and knife. CKs only gave him the bottom bun. When I looked over and saw that he had barely eaten half of it and I knew he didn't like it. This man tears through a good burger. He said it was really bland. It honestly didn't look appetizing at all. He was also gyped on fries. We've noticed this happens every time we order burgers or sandwiches. The same seems to be happening with their appetizers. The first few times we came here we would always order the zucchini and the wings. They used to fill the $8 basket of zucchini up, now it's barely enough for us to share. The zucchini is so freaking good but it's no where near worth $8 or ordering it anymore.  Lastly we're getting a little tired of waiting for the bands to play at 9:30pm. We really enjoy the music but with our very early work schedules we're used to going to bed quite early so on weekends we're ready for bed by 9:30pm. Lame for us, I know, but there are many other bars or restaurants where the music starts at 8pm or even 7pm. Also, their website isn't accurate anymore on who's playing. We went last night because the website said Broken Toys was playing and we really enjoyed them last time. However it was a different band who never introduced themselves and who weren't as good. Sad...  While we still like CKs, we most likely would eat dinner else where and just come for a couple drinks and some music...if we're willing to stay up.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "v8QnvfWXCf4651Bxg2vvIw"
  },
  "1Txp-EYCLSNrg5CVGDGkgg": {
    "date": "4/26/2014",
    "text": "I've been a Ahwatukee local since 1999. CKs is a cool place to hear music.  I don't like the vodka they use as their house vodka,  it's always bitter.  So this is not my choice to go.  I had a coupon and went back on Good Friday for their all you can eat Fish Fry.  The breading had no flavor what so ever.  I gave 2 stars because the service is always good, I wish the owners/managers would taste the dishes that their cooks put out,  and add some creative flavor to their fish fry.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "jhS0mEh_Ygv6p5i-zviLgQ"
  }
}