{
  "uTL5JHD7wFmBehRgXmXhvA": {
    "date": "4/25/2016",
    "text": "Always love me some Pita Jungle when I'm in the area. This is a great place for groups, as the menu caters to Vegans, Vegetarians, Carnivores, those that are health conscious, and others who don't count the calories. Although they do not take reservations for large parties, there is plenty of space to easily accommodate everyone. Meals are priced within reason, service is great, and the food is appetizing. Hipster/ eclectic decor with bohemian looking staff that are welcoming.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "k2ap_dScTIr0n1D6RqVOFA"
  },
  "U1TvhIAknP5QC6iPJCx8oQ": {
    "date": "2/17/2017",
    "text": "The place seems clean it's just getting your food that there always seems to be an issue. I Ordered a Wood Fired Vegetable salad to go and it took over 30 minutes to get. I thought I learned my mistake and ordered it again but for pick up; so I don't have to wait that long. Now I have the wrong order, a cold salad, with meat.. Probably won't go again. Too many inconveniences for something seeming simple. Not to mention I've only been twice. Not a great expectation to start off with. Slow service and wrong orders.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DgLQsFlR2pJ8BMLJasmzgA"
  },
  "ozq0MbSWd1Xe7PVCb7lUlQ": {
    "date": "6/1/2016",
    "text": "Great food, great service. Cool vibe inside. I got the pasta salad and it was much bigger than I expected but very good. My boyfriend got the chicken tikka masala and enjoyed it. And of course the gyros are always a hit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "73glAiJwJwBMOGQo1CuZYg"
  },
  "qza3YYfB8o8MFJRE6-xOQA": {
    "date": "12/16/2016",
    "text": "Love pita jungle and the variety lunch today with Co workers. Someone ordered a turkey burger and after eating half, we realized it was uncooked. Not even rare, this was plain ole raw ground turkey! Waiter was apologetic though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nWWySQRrd1a8PCC2e_RELA"
  },
  "x2sNDk2xhfO79vC6aY3WuA": {
    "date": "3/10/2015",
    "text": "Awesome as always. Everything I've tried is amazeballs. I keep bringing friends Lol.  The cilantro jalapeno hummus is forever awesome, at every location. The chipotle chicken flat bread pizza is <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>, but I usually sub tofu instead of the chicken and it's surprisingly WAYYYYYY better than the chicken!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DbO-4CXHyPbPk2PECjcFOQ"
  },
  "4C8ZwDReUxu5-VfMS-ujFg": {
    "date": "10/8/2016",
    "text": "Outstanding! The Jalepeno and Cilantro is the Bomb! And their pitas are really good .... if you want to change it up ... do it jungle style, then do it at Pita Jungle.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "womRqX6pC37knKPB8AVFcw"
  },
  "WBb8GGNqQu8J597mrodiew": {
    "date": "1/30/2015",
    "text": "Every time I am in Phoenix, I absolutely MUST stop in to have the Chicken Del Sol!   Paired with a glass of wine, the perfect dinner on a chilly day",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Fw6Qlj2x6fOiooZEnedmA"
  },
  "kPF8ysW2--P-upN8hVyZyw": {
    "date": "6/19/2015",
    "text": "Love pita jungle! I've only ever done pick up never gotten to sit down there yet. Love the chicken! Pita is always soft and delicious. the hummus is delish. And love their salads. I've tried a few. It's always busy here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "21Kuy5Cv3SKj27zTPGf-tg"
  },
  "JGYHwkxdJi-CcKP35h_Isw": {
    "date": "4/24/2015",
    "text": "Normally I love Pita Jungle. Still mostly do. The food is always great. But today, with a group of people, we had, by far, the worst service I have ever gotten. And one of the people at our table was friendly with our server. Well, she was served just fine. The rest of us? HORRIBLE!.  It started promising with immediate drink orders and deliveries. And then it spiraled down real fast. It was 30 minutes (maybe more) before she came by to take orders. And if you are wondering why we didn't waive her down, she wasn't anywhere to be seen.   Orders taken and 25 - 30 minutes later we are wondering where our appetizer was. She asked if we wanted it first, we said yes. I am certain if I didn't call her over and ask, we would have gotten it with our main course - something I despise. (It is called an appetizer for a reason!)  5 minutes later, appetizer. 10 minutes after that the very slow bringing of the food and the \"Auction.\" After we all had our food...oh wait, we had that lone person that had to wait a while longer. No, she didn't have a special order. Finally, we have food and drinks. Oh wait a minute - some of the table got refills.  Here is the worst part - I LOVE LOVE LOVE the food at Pita Jungle. but today, my stomach was in such knots and frustration, I really didn't enjoy the food. It was delicious, I just didn't get a chance to enjoy it.  A FEW HOURS LATER - I am very impressed by how fast Pita Jungle got in touch with me to find out more about the issue. I will go back because the food is great and because of the way management is handling this.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bKzLbgvl_83eSxZxKrUspw"
  },
  "6yAOeF9Y6M3tydmuf0M4XA": {
    "date": "6/8/2016",
    "text": "Great food in an eclectic environment. The pretty hostess at the front smiled at every single  person she came in contact with. The server was attentive and professional, and a cool guy. Even offered free hummus as it was our first time. We came in from Dallas on business and we could not have felt more welcome. The gyro was very good as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "64A0xX-WpISgl_n-MmBWpg"
  },
  "ijHr97GQ3R8ACuIZGRJvng": {
    "date": "5/27/2015",
    "text": "Great spot for a healthy lunch. Glad they had patio seating as the inside had a very high noise level.   Had the cold tuna pita. For me it needed a dipping sauce so I ordered a side of taziki and that was perfect! The chocolate covered baklava for dessert was excellent.   My spouse had the grilled vegetable salad and whole food vegans will appreciate it. It would be nice if they offered whole wheat pitas as an option. Also would like to see calorie count listed by menu items.   Enjoyed the good friendly service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n5chTYoLF3-hWrLWdY46CA"
  },
  "n2GzYzT7ooW0JALJfL7EpQ": {
    "date": "12/2/2016",
    "text": "My daugher and I love this place! Great service, great food and great prices!  Our favorite starter is the red bell pepper hummus with chicken! My 2 year loves everything we have tried so far!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wplGDJTICogP8MJYC_NOnQ"
  },
  "d36AtDawtmm5QOTQE02D7Q": {
    "date": "7/6/2014",
    "text": "Pretty much our go to place in the area if we have 2 hours to kill, are relatively hungry for something that won't clog our arteries, and need to get our toddler out of the house.   Biggest complement I can give: Out-of-town in-laws here months ago, with a few of them pickier than your average bear (for glutein free, organic, etc). We met them here when they first arrived thinking this was the best bet for finding a good match for them, and they kept coming back for nearly every meal. Seems to be a little something for everyone, and we bring a lot of others here for a nice casual meal.  First off the service has always been outstanding. It's obvious they make a real effort to give a good experience, and bringing our little boy here isn't as much a chore as some other places. Very kiddo friendly, always lots of high chairs, by default they give crayons to the kiddies, and the kids menu doubles as an activity page (connect the dots, coloring, etc). Kids menu is also great, you get to choose one thing from each of 4 food groups-think we got mac&cheese, tofu, broccoli, and corn this last time.   Restaurant is bright and relatively clean, and when it's not scorching hot, the outdoor patio is a nice setting. Portions are Mucho large, we're usually taking something home for each of us for dinner. Food is above average, but some aspects are hit or miss (Lavosh bread wraps are too starchy for my taste). I'm a big fan of their flatbreads (especially Chicken Fetoosh) and some salads (Lentil Fetoosh, Falafel, not chicken pasta). Jalapeno Cilantro hummus and most other hummus is a good bet, but the Ahi hummus misses the mark in my opinion. Pretty good handful of local beer options for a healthy place. Overall usually a positive experience, and we'll keep going back as the ol' local standard.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "yJT2CndTPZ00BvIOwlmbrQ"
  },
  "6sX2xvrMZ79RkP8D1IBF4g": {
    "date": "3/20/2016",
    "text": "Hard to beat pita jungle if you like fast healthy food the chicken pasta salad is excellent - good service - quick healthy good food - good ambiance - good energy - well worth the trip - hummus in a wide variety of dishes - great lunch and drink under $10",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_gU9tEogTKJ9SENJSP4fvQ"
  },
  "bWhVWRLTCKJ4n9PsZYEClg": {
    "date": "4/29/2014",
    "text": "Pita Jungle. I am a pita junkie for Pita Jungle. Let me count the ways I love this place:  1. It's healthy. There is nothing better than giving your body a shot in the arm of nutrition like you do when you go to Pita Jungle. I love feeling good about eating out.  2. It's fun. The decor in every Pita Jungle I've been to (and I've been to a few) is awesome. Bikes for light fixtures? Why not? Rotating chalk art on a giant chalk board? Sure!   3. The employees. Cheerful and helpful employees who are also just cool. So cool I get somewhat embarrassed when I show up in corduroy shorts and a  simple t-shirt.   4. It's delicious. Holy crap is this food good. I dream about their hummus, their lemony vinaigrette, and their lavosh  schwarma wrap.  Which brings me to my one criticism: they screw up my order five times out of ten. Whenever I order a lavish schwarma wrap it seems they inevitably confuse it with their chicken schwarma wrap.  PLEASE, if the Pita Jungle powers that be are listening, change the name of either your lavosh schawrma wrap or your chicken schwarma wrap so that poor Pita Jungle lovers like me don't get disappointed when we get our order! If they did that (or just stopped messing it up all the time), this review will be updated to a glowing five stars!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "cNkofgeZTGNkmw8m5jR8LA"
  },
  "IrPjkR08YKx2u1OAmcXXuw": {
    "date": "3/22/2015",
    "text": "Traveled to my company's Phoenix office for work, and this place was right down the street.  It's hard to eat healthy while traveling, and I was pleased to stumble across Pita Jungle.  I went with the spicy chicken wrap, and was not disappointed.  The portion was HUGE, which was great because I had a flight that evening and figured I wouldn't be eating for the next 6 hours or so.  The wrap itself was so fresh and flavorful.  I also loved the fact that I could eat lunch outside in 68 degree weather, which most of my Phoenix co-workers thought was \"too cold\".  Of course, I had just left 20 degrees, so 68 is pretty awesome, and worthy of eating outside.   Service was top-notch, and they had us in and out quickly.  When I come back to the Phoenix office for work, I'm definitely coming back to Pita Jungle.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u5HGHKg9T4KCkSygxdpxng"
  },
  "dSTsVVA1IMGsrEDnbJl7XA": {
    "date": "8/5/2016",
    "text": "When you order your app and you want to try more than a few I suggest the red,white, and baba. It's a good trio. The Schneider Weisse organic beer is good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZL0AEkN6n5_WY1t-N9qNTA"
  },
  "Y49_QlI1IBsBX50OyT6Lqw": {
    "date": "9/24/2016",
    "text": "Dropped the ball today..   7 servers standing around while my server is clueless to our tables drinks that have been sitting there for 10 mins plus at the server well done.  Not good when you want you cold beer and a full glass of ice for the sangrias.  So I had to go up there and grab them myself.    The bartender sees me and I say looks like I have to get these myself or I won t get them..   So she says yeah you can take them..  Then she doesn't think to mention anything to our server or the manager.  Then... We don't get our appetizer at all..  We ask to speak to manager ... He is to busy to come over to talk to us because he is stuffing his face in the private dining which we can see...   On top of that all it looks like the last 10 people to eat at this table left their food underneath it which would normally make sense to clean up by the staff.....Apparently not.    Food was good though!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBAOiwzigMemVnzO25dyAg"
  },
  "_Y0SRYBwgLqd6yMxRqrN4A": {
    "date": "5/3/2015",
    "text": "I have been a fan of Pita Jungle for 10 years. I keep going on a regular basis simply because it's good food. Their home made ice tea and lemonade make a great Arnold Palmer.  Their Moroccan Gazpacho is a seasonal item that I always get when it's on their special menu. It's just so refreshing and full of goodness.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WfsF16BDB7fKzNfwhMP8MA"
  },
  "mcv1U8GzaPRZVasZo4T5Ug": {
    "date": "6/11/2016",
    "text": "I thought this place was small and drive through, but I was way wrong. It's a super huge sit down restaurant with happy people working. I loved the dolmas, I ate the whole order when I wasn't supposed to. And the chicken was really good too. I won't hesitate next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JHa6QhwsnQ3tBfoHwz9pJg"
  },
  "Rxe0QKev7_k8oAcFkfW3MQ": {
    "date": "3/20/2012",
    "text": "Amazing!!! Try the cilantro hummus and the Mediterranean chicken pita mmmm :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nvX8ju-CDmlt5WuacxHzmQ"
  },
  "Nir5-iuG9s82qoz9bqHrSg": {
    "date": "3/7/2012",
    "text": "So happy that Pita Jungle has arrived in Ahwatukee.  We had the opportunity to visit them on their second night.  The food quality and taste lived up to Pita Jungle's reputation.  I can't say enough about the Assistant Manager RC.  It seemed that he was always in the right place at the right time to offer some assistance on the floor.  Although part of our order was lost in the kitchen, his attention to detail and assistance made me want to give the location a second chance.  So happy that another healthy eatery has landed in Ahwatukee.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z0pwLkdy82JIyWGcqnq0pg"
  },
  "HDul1Jv7bTKhw9uVpECr3Q": {
    "date": "6/15/2012",
    "text": "Great service, great food, great environment! My boyfriend andand I are so pleased with our experience at this location. I used to dine at the location on Ray and Dobson, and the only reason I did was because of the view on the patio, and the food! The service was never horrible, I was just rarely impressed. Thought I would try out this location with my boyfriend this morning,(Friday) and I was greeted by a young lady that had the biggest smile on her face actually acting like she loved her job. She introduced herself as Jen. She then asked, \"can I make that smile bigger and start you off with a nice pineapple margarita?\" That made my boyfriend and I laugh, and if his mind wasn't set on beer, and mine wasn't set on a Cosmo, we would have gotten one. We didn't order much, but Jen still had that smile, making sure we were happy and everything was alright. She brought our drinks with waters, which I really appreciated as well. Made sure she took the plates when we were done, and was great on time. She kept small talk, but didn't bombard us, nor neglect us. We will definitely be back there very soon. And probably won't ask for anyone but Jen. I was overly impressed by her service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jINpWg0ZMO6l3Mp4iHfLzQ"
  },
  "IQEj5-inY7dTMR9TCHCYTw": {
    "date": "10/17/2017",
    "text": "Went here today. It's very clean and the server was very friendly. However, I noticed the portions are smaller than other Pita Jungle's I have been to. Food was still great, but I will probably be sticking with my local one!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JaZsPYHY8t6t67l9_AQwlQ"
  },
  "lgGSlM58oWYH0XOUGWcujQ": {
    "date": "2/23/2015",
    "text": "I stopped into Pita Jungle on a Sunday afternoon to grab a gyro to go for my drive back to San Diego.  The gyro isn't what I would call \"authentic\"...the flavor seemed off a bit, but I did like that they grilled the pita bread so it was a little crispy.    The inside of Pita Jungle is very unique...very hip and very un-Greek.  Most everyone working was white including the amazingly cute blonde hostess at the front.  Wow.  Five stars...but deduct one for the lack of fries.  I tried the garlic potatoes and though they were okay I'd rather have fries or wedges.  I'd come back for sure for the well, scenery, and maybe even some food.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "_yNy5tQ--Ct6WmP8UbJNMQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Gyro with a slightly toasted pita.  Not great but not bad.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_yNy5tQ--Ct6WmP8UbJNMQ/o.jpg"
      }
    ],
    "user_id": "07gdGKMkho4maba0lQyoQQ"
  },
  "VZXby9hjaBqc_b09eeROXQ": {
    "date": "2/4/2018",
    "text": "I like this place. It's good, simple and usually pretty quick. The happy hour here is actually worth checking out. The food portions are large for the prices.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "QGgWWhEi5R4SLAKN-xwtNQ"
  },
  "5bq9-8OgnC_EK7p5Qp_0Zw": {
    "date": "6/25/2017",
    "text": "I go here often and I love their gyro. Usually, it is very fast-food type and pefect place for quick lunch. The decoration inside is very modern and casual.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ILCVi2berb_N4z1XSSnySw"
  },
  "6TariN1m-aIfNxhmUpDNqA": {
    "date": "3/9/2018",
    "text": "Wow!!! Is all I can say....I really enjoyed the food and thought the service was great. But just placed a Togo order and came in to pick it up was acknowledged and sat at over 5mins staring at my bag of food while the manger stood in front of me speaking to another employee and once conversation was over walked into the kitchen and never came back. Poor service is all I have too say",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5k3B2FtLkP-px_dQy4VLFg"
  },
  "YKFDRBGkYsFgtM17caEgGQ": {
    "date": "12/9/2018",
    "text": "Service was horrible. We were acknowledged about 15minutes after we were seated for drinks. At no point did anyone check in with us or refilled our water. Waited another 20minutes for our check. Place was not busy at all. Food was good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ANqvPgBZygTUbyUzingazg"
  },
  "4y4rrIw76jP1qPii4q530A": {
    "date": "6/1/2016",
    "text": "Great service and tasty, yummy food. I've never had a bad meal at any Pita Jungle location. It's hard to pick a favorite dish. Some things are no longer on the menu, but I've asked for them anyway and they have always been accommodating. I kinda love that in a restaurant.  Our server today was great. Ask for Mariah. She'll hook you up with beverages to go and is fast and sweet.  :)    Take all your out of town guests here. Each location has different decor but the food remains consistently good at each and every one.  Love me some Pita Jungle!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DvDEccGguYTxxPDNU35y8w"
  },
  "tn6k-3r4XpxJvB89nGwPSw": {
    "date": "12/2/2018",
    "text": "The service here was amazing! Our waiter made us feel right and home and the decor inside the restaurant was beautiful. And of course I can't forget how great the food was. Their hummus trio and caramelized cauliflower appetizers were to die for!! Definitely recommend everyone come here at least once while they're in town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "etCBbUY9ETdOI_2nW2W-kg"
  },
  "mlmoBSKmA4FYVKJXEBlg4w": {
    "date": "4/25/2018",
    "text": "Stopped in as the reviews where great and have to say they where spot on. The food was outstanding and the service was awesome. My soft drink never got below a half full before the waiter refilled it. The place was packed and obviously the staff was extremely busy so I was surprised even with as busy as they are their service is outstanding. Will be back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6yWkwJEmKMypOk2NnjHLzQ"
  },
  "CVvjHR8ywPmtoSYSYX91ng": {
    "date": "10/9/2017",
    "text": "Wow... loved everything about this place. Went during happy hour and tried several small plates.  Not a big hummus fan...well I wasn't till I tried the treo.... I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TQFvfvddJwQFTDMi1couQQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Great salads",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TQFvfvddJwQFTDMi1couQQ/o.jpg"
      },
      {
        "img_id": "WAlrfhJzlV4iPBoBlTDt6w",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Great salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WAlrfhJzlV4iPBoBlTDt6w/o.jpg"
      },
      {
        "img_id": "dK5SHkAdFjOTBxu20jaCEg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Small plates.. Yummy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dK5SHkAdFjOTBxu20jaCEg/o.jpg"
      }
    ],
    "user_id": "CBYlr6bksWM1WA_pTumeeg"
  },
  "8c1kQz006VwMrxH09fvP7A": {
    "date": "5/12/2016",
    "text": "Good Hummus  Pita jungle doesn't disappoint with its tasty hummus and pita bread to snack on during a night out with friends or business lunch meeting...  Convenient locations and good service...",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3R_dB9VQ_D3WPJEw7pmorA"
  },
  "kQyhoXSe_Rm4QpoTyTU38A": {
    "date": "6/15/2017",
    "text": "Two words are all that is needed: garlic dip. I have my friend Alice to thank for turning me onto this amazing treat. I tried it with a bit of skepticism because of the explanation that it was mashed potatoes.  In fact, I am one that usually reads every word on the menu description but in this case I just took her word for it because I wanted to try it with an open mind. Anyway, skepticism and hesitancy, be gone! I have never really been that partial to PJ but I will be returning over and over again just for the dip. In fact I'm working really hard at home today and if I complete my projects, guess where I am headed...you got it! As far as PJ itself, I can't really give a fair review because I was so enamored with the dip!  I vaguely recall average service. I had the large greek salad with gyro meat and a pita which brought that to well over 10 bucks....will have to ponder that next time however I did get two meals out of that serving.   Again, two words: garlic dip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gZ7qCh2brweH3_VO9iNPRg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gZ7qCh2brweH3_VO9iNPRg/o.jpg"
      }
    ],
    "user_id": "vqc-vtgyrxSMGZNV5s6L4A"
  },
  "VixpDO4ZDrt12ZyTHbLLog": {
    "date": "3/23/2018",
    "text": "Made mistake in ordering online, when I arrived it appeared my food had been sitting on the counter for some time. Although the time estimate online was still 10 minutes away. Upon getting home which took all of 10 minutes opened sandwich and it was cold. As that it had lettuce and other items which couldn't be microwaved, I had to eat it cold and tasteless. I have eaten at Pita Jungle and always enjoyed, but stay away from ordering via Yelp.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uVC3EFXZLnoIRcvPU1R9xQ"
  },
  "uvdsXvmvJsE6anGe9dmVIw": {
    "date": "11/15/2018",
    "text": "I was visiting on vacation and decided to stop here. Everything about this place is amazing. I really love the food here. I believe that every single item on the menu is outstandingly delicious. And I will definitely be stopping by here again next time I visit. 5/5 would recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cxmr9jkbDIikiwW-ZfcNDQ"
  },
  "IUlY_doA5B-EQzvrwyqzIA": {
    "date": "11/6/2014",
    "text": "I come to this Pita Jungle occasionally for lunch since it is close to my office. I love the variety of healthy options they offer - fancy salads, wraps, and appetizers. I almost always order hummus, whether it's regular, bell pepper, or cilantro. So good!   My favorite salad is the tuna honey sesame salad. It has seared yellowfin tuna, leafy greens, fresh strawberries and mangos, topped with a honey sesame dressing. Awesome!  For entrees, I have tried the mahi mahi with pita chips, the chicken del sol, chicken tikka masala, chicken and onion lavosh pizza, and pesto turkey lavosh wrap.   Pita Jungle is a good choice for a fresh, healthy meal. They update their menu with different specials so you can always find something new to try.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gc1_t9SCrBcT3KvGeD__Vg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Mahi mahi with cilantro jalapeño hummus, pico de gallo, pine nuts, pea sprouts, lemon and pita chips. Too good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Gc1_t9SCrBcT3KvGeD__Vg/o.jpg"
      }
    ],
    "user_id": "105tIg6brHiGDBXuGbbizA"
  },
  "D0oIPX75k7E-3fK-0HxfNA": {
    "date": "11/12/2018",
    "text": "They went from being a great, fresh and trendy kinda place to an over priced hipster chain.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wCTjlCmtageif3nuZpi9lQ"
  },
  "LL1lQ5Err90no8gF0avqDg": {
    "date": "4/2/2018",
    "text": "The food here is always pretty good. There hummus is some of my favorite and their gyro and philly steak wrap are also amazing. One tip I have though, the Tikka Masala needs some acid (lime juice or something) to get the flavor right. Service has always been very good as well. They should try to get some better beers on tap though because none of the stuff there is too appealing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9e936RT1yD7j5ZT4RkDR4A"
  },
  "GXdYyk--DXGCa8ds3QVAsw": {
    "date": "7/19/2017",
    "text": "We like Pita Jungle.  My son loves to get a deconstructed gyro and make his own gyro taco!  If was really good!  I ordered the chicken tikka masala and I love curry.  I would have to say that the dish was a nice concept but when you love Thai and have a Thai meal but with Greek flavored chicken and what tastes like paprika. They didn't go well together for me.  But aside from that, all the tastes separately were really nice.  Chicken was so tender!  Just not working cohesively for me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JK-7IoZX7ZZN0FZu9JYLSA"
  },
  "CLn5tekBnEiu8wpWb9Dz0A": {
    "date": "10/21/2018",
    "text": "Food was amazing!! Ordered chicken cilantro hummus with pita chips and chicken pasta salad Togo and everything was made perfect to order!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "88D2t2r2B7nPh2cYKAf6uw"
  },
  "TU0m6M1veKHYb1ahs37LWg": {
    "date": "1/4/2018",
    "text": "I dunno whether I like PJ or not. They bill hemaelves as \"healthy\" what's healthy? Is your water filtered and cleaned of contaminants FULLY including Fluoride? Do you fry your foods in canola oils? Is your produce organic and pesticide free? Just because you serve vegetables doesn't make you healthy and all the friend and doughy food they serve has me questioning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V2LGfi7mRErVQnZs3uNlKQ"
  },
  "h9DydawpUdvgztq-JVuBsg": {
    "date": "5/12/2014",
    "text": "Lol wtf is up with AZ and shit service?  6 people order food got 1 right!  Good job PJ.   I will say what i did eat was good but no matter its not worth adding stars.  Welcome to the jungle, your going to dieeeee!   Haha",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0DHGvyz6BY5ZikfpSdMKOA"
  },
  "AEtJZmGIvnYTZGlNca2bzQ": {
    "date": "6/1/2016",
    "text": "I went here for my sisters surprise birthday party and everyone working there was so much help! They gave us our own back room which completely hid us from the front, they helped identify my sister and her boyfriend so we could surprise them, they dealt with a fairly large group of people in such a nice manner that I couldn't help to applaud them. I will definitely be returning and hope I get the same waitress, I did not get her name but she was blonde and super helpful. Ps the food was also wonderful, the pita bread and hummus was amazing as was the turkey wrap",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pvig-h8KJ5DLqsGcVYJs5A"
  },
  "47s0VQYTrl4MOWOQZ5AG8A": {
    "date": "9/7/2014",
    "text": "Love the food; however, the service is always supper slow. If you are trying to stop in for lunch make sure to add an hour to your trip as it is always packed. They don't take reservations but they do have online ordering which is usually what we do.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qHNbdI-3SnIke_xqUMNmQQ"
  },
  "Dcnsmugun_nkBTcFiSMPPQ": {
    "date": "4/11/2014",
    "text": "I loooove their chicken shwarma pita. Good quick service during lunch time and friendly wait staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ad5YOuoqGt5k36SdzkMxEg"
  },
  "qQkwgWwyGclsEGz7QgrU4g": {
    "date": "10/22/2015",
    "text": "Good food ... But servers were very slow to provide additional sauce and pitas. Almost like they figure if the customer waits long enough, they will say it's never mind too late. However, my companions waited them out!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wGJIOyAtrDUSPLvXJRrHnQ"
  },
  "5biB1xeHpUE5mSRT9gjZsw": {
    "date": "8/16/2014",
    "text": "Absolutely love the food and service. Always quality food and service. Best waiters and love the indoor decor. So good my wife and I had them cater our wedding. Try the Jalapeno humus!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pXXg97y4-FB3xzhCx9qY4w"
  },
  "QJXrZk14yQwVAX42G2coRg": {
    "date": "4/2/2014",
    "text": "Another one of my favorite places, especially this location!!! It's right along the lake, so I definitely recommend sitting outside before AZ's summer heat catches up with us! The food is always delicious, and the service is excellent! They come and check on you frequently and your food comes out pretty quickly. For hummus, my recently new favorite is the Jalapeno-Cilantro (not spicy). For entrees I recommend the Chicken Pasta Salad, the Ginger stir fry, or the Broiled Chicken Pita. Honestly though I haven't had anything here that wasn't good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "27S7R-IMq7VHtpRageqaBg"
  },
  "KRq-L3g8xAeUAAm6qlWJeg": {
    "date": "7/18/2014",
    "text": "Great, fun place to grab some healthy food in Ahwatukee. Double check their specials and the seasonal beers. There's some good stuff here. Also, happy hour is a great time to try out all the apps!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rloeIs3SU7uj-Y_YMafXSw"
  },
  "wR1XOhgZ9EsXUNDPtsDvew": {
    "date": "7/16/2012",
    "text": "An angel from heaven was sent to earth to open a restaurant named Pita Jungle.  Amazing Grace, how sweet the [ lental salad ], That saved a wretch like me.... I once was lost but now am found, Was blind, but now, I see.  Blasphemy?  You can't judge me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZZ22VpfHQDHDV9ZSe_sB8Q"
  },
  "QFOvZeFz-Z1A9IH2LEja7w": {
    "date": "7/1/2013",
    "text": "I am a takeout regular--even though I should eat here more often. The interior is beautiful! I can't live without the Mediterranean chicken salad, cilantro hummus, chicken shawarma pita, the spicy chicken wrap, and the chicken pasta salad.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fu1b8n8D2ayq4fXVeuQSRA"
  },
  "NXvRegpczbWcxxVIoAqkWQ": {
    "date": "4/3/2016",
    "text": "Ordered the spicy chicken wrap.  I never expected it to be spicy curry.  Very disappointed.  You need to explain it is curry spice in the description.   This is one of the few times in my life I ordered a meal I could not eat.  Two bites and threw it in the trash.  I had taken it to go so I could not complain to you in person.  Yuck!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2tfSmgXo0JuDhO4adeqhsA"
  },
  "KCJ71ur05uDvfmlDa502Dw": {
    "date": "2/15/2013",
    "text": "Firstly, I was so excited that a Pita Jungle opened in Ahwatukee. I have been going to the Chandler and Tempe locations for many, many years and was always more than willing to make the drive because I love it there. Until recently, I was frequenting the Ahwatukee location on average of 1 - 2 times a week to meet friends for lunch. However, the last four times (in a row!) that I have been there, the service was abhorrent, and the food sub-par.   Here are some basic, common sense rules of thumb that the Ahwatukee Pita Jungle wait staff should learn to adhere to:  1) When customers order appetizers, soup and an entree, a waiter/waitress is supposed bring the appetizer out first, then the soup, then the entree. They aren't supposed to bring it out all at once and crowd it onto the table allowing most of what you ordered to get cold. This happened the last three times I was there.   2) It is absolutely disgusting when you see a waitress wiping down tables then, without washing their hands, turn around and pick your glass up by the freaking brim and refill your drink. NASTY!   3) It really shouldn't take 3 people to wait on a table of two. Especially when wait staff cannot effectively communicate with one another. Things inevitably get screwed up. It isn't a confusing job - I waited and bartended for years and have infinite patience and respect for those in the service industry, but Jesus H Christ, where do they find the staff here? The other locations aren't like this!  Anyways, I could keep going, but why bother? Don't waste your time at this location. the Chandler location on Ray and Dobson is only 10 minutes away and it is soooo much better!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "VUx9hYobdy4zTn6M1a1xRg"
  },
  "c9aGq81HI7mPguUH0KwFCA": {
    "date": "10/3/2013",
    "text": "Visiting from Cali, had dinner with some friends who lives in Maricopa.  From the moment you walk in, your nose is tickled with the fantastic smell from the open kitchen!  The four of us shared 2 appetizers; mediterranean antipasto platter and the cilantro jalapeno hummus...we almost fought to lick the plates.  Then my husband and I shared the falafel pita and gyro pita, deconstructed style...the falafel was phenomenal!  Nothing negative to say about this place.  The decor was unique, kinda street-art esque.  Wish we had one of these in Cali!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vFnYYmtVwcMGyyGesNImVQ"
  },
  "GX4S8sAAngZh4TIlqkVZzQ": {
    "date": "1/5/2013",
    "text": "I am a huge fan of Pita Jungle but the Ray & I-10 location just doesn't seem to have their act together.  I have had to send food back several times - cold steak, super salty, there was even a metal piece from a scouring brush in my daughter's food once.  Sometimes the food comes out super fast and fresh, other times its cold and the pita is hard.  So if you are going for PJ, go to Indian School or Ray & Dobson...they are way more consistent.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "342_56LsF89LzOD1WHsg-w"
  },
  "UVf-rxKTlmaJfBBcuEDFcQ": {
    "date": "9/4/2012",
    "text": "Great service every time, no matter how busy.    Great beer on tap.  Great food and food specials.  Beautiful women.  What's not to like?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EyoytgSNrhO8kfBrhWY8VQ"
  },
  "SMufD4Hq-mtIv4cies__tw": {
    "date": "10/22/2013",
    "text": "I go here when I feel like eating something healthy. Yesterday I had the falafel salad which was very good and filling. It came with two pita's that I barely touched and didn't quite finish the salad either. The atmosphere is bright and clean. The aromas are mouth watering. I prefer this location to the other Ray Road one because its newer and cleaner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vabOPELZkAWxy9jajB0nhQ"
  },
  "Ki5I5SG-S9D3tjiiDmQHbA": {
    "date": "8/22/2014",
    "text": "Ordered blackbean burger anf falafel salad. Food was ok and lacked proper seasoning. But the ambience and service was really great and worth coming for again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vm04HIDvILx4edJKHPuuYg"
  },
  "9x9FDQw-WFnZMd8yX2mWJQ": {
    "date": "3/18/2013",
    "text": "I read some of the two star reviews and still can't figure it out.  I think this place is great!!!  Fantastic service, some great vegetarian food in Ahwatukee (finally!!!!) and there is absolutely  nothing for me to give it anything other than 5 stars.  The waiter was very fast and friendly, the atmosphere was pleasant, and overall the food was excellent.  I lived in the Mideast years ago and I love falafel...you can't find good middle east food in my neck of the woods...at least not until now. I'm sooo happy they're here; it beats Chinese by a long shot!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yeTyvwBDm0Y4yuRS7pVl6Q"
  },
  "Whdbpy9VjfC4nViQW8_dxA": {
    "date": "7/21/2013",
    "text": "WONDERFUL Atmosphere!!! Best of all the Pita Jungles. I would definitely come here for a nice dinner (for a casual price). You have to get the Jalapeno Cilantro hummus and try the iced teas. Love this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TzanQwY5rfIAWoav5zxQYg"
  },
  "BqoxdNIEDAcCk_O__XZFbg": {
    "date": "9/20/2014",
    "text": "This location seems to have better food than the others. However the service here is a little slow. The staff is friendly and we are always sat quickly but once at the table it seems like it takes longer than it should for the server to come around. None the less, this is a great place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yxDoKFfzL6ZzDDr8Rwe8Iw"
  },
  "sNFQOashOdNwSbpuY3yu6Q": {
    "date": "8/21/2013",
    "text": "I decided to try Pita Jungle for dinner with a friend one evening. I was initially really unsure because it's not anything close to my normal cuisine, but I figured, why not try something new?   I'm really glad I gave it a shot! My salmon was great and the pineapple margarita was definitely worth going back for. I also tried their jalapeno hummus and have nothing but good things to say about it. I will definitely go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dp40Yd9d1MuMZtWfr5ng4g"
  },
  "5UCeLETxiS_Fn5p3H0x0Zg": {
    "date": "5/14/2015",
    "text": "We always come here when family is in town because we have a mixture of vegans and non-vegan family members so Pita Jungle can usually accommodate all our needs. We love the hummus garlic dip, just a bummer when they only give you two pitas to share with 5 people or more. All in all, I am a happy returning customer anytime I am able to make it to the valley.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kmf5Vy_yi7-qxPlXO5E3cA"
  },
  "53IEjHbnPFh4VF2-btskvg": {
    "date": "2/16/2015",
    "text": "Love love love this place! I always get their chicken pasta salad and it's is so amazingly tasty. The chicken is always so perfectly tender and seasoned, and the vinaigrette is to die for!!! I love their hummus too! My favorites are the original and the red bell pepper :) I always look forward to coming here :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iO-Dii7x9yAfUmkpeWZRIg"
  },
  "fbTHE78Wzde9XAh2mrzdLQ": {
    "date": "4/13/2012",
    "text": "Fresh delicious food and generous portions. I freakin love Pita Jungle.  The roasted chicken salad = delicious. Jalapeno cilantro hummus = divine  My son had the kids meal, you build your own.... broccoli, diced chicken, fresh fruit & macaroni, plus a drink is $4.99. Great price, and again huge portions for mostly healthy food.  We'll be back fo sho!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0LZ1WwVa3HVS3BZyNMf-lA"
  },
  "JaqGfnWp0Yi1eMGENgeeFQ": {
    "date": "10/28/2013",
    "text": "I have always been a fan of Pita Jungle. Their food has never let me down, especially their hot pitas! My top pick is the Mediterranean Roasted Chicken (Shawarma). You can get the roasted potatoes for an extra .99 cents. They're not bad, but not my favorite.  The staff is very hipsteresque, but extremely friendly. You always get a warm welcome when you come here. They have a lot of art on their walls that's for sale supporting local artists. This place has a great bar with some great beers on draft. Great place for a nice meal!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "xVdchFi3vgmPYxkiXYHmZw"
  },
  "zgUyDrr30iiE5-CPwF1yZQ": {
    "date": "9/20/2015",
    "text": "One of my favorite restaurants!  Fun atmosphere and terrific food. The service has always been great too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fOOsLwOqFGJ8p2X_GCDvJw"
  },
  "-Qw1potMON-ntItdF6q1uQ": {
    "date": "8/9/2016",
    "text": "Another great experience there. Alexis had a nice inviting personality and really made us feel at home. The Philly steak pita is the tits and the cilantro jalapeno hummus can't be beat. I still go about every other week or more and consider Pita Jungle to be one of the tops in Tukee.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xoC5XTB9vM326yht3GoZEQ"
  },
  "VX8hQgX-IXt_x0UJotqvBw": {
    "date": "3/22/2012",
    "text": "My husband and I have been going to ALL of Pita Jungle's locations for over 13 years and the consistency, friendly service and good food was always expected and delivered. Not once have we had a bad experience.  Love, love LOVE that Ahwatukee now has their own PJ with AMPLE OUTDOOR SEATING. Best place for fresh, crisp iced tropical tea or a glass of wine. Great art (often for sale) on the walls and delicious pitas... My fav's for lunch are the Chicken Philly Pita (ask them to add mushrooms if you like), the red pepper hummus plate, and the Lavosh Schawarma Wrap. For dinner, their fresh fish dishes are always prepared in some tasty, unique way...love the Mahi Mahi with Pita Chips and the Broiled Chicken Salad is huge and satisfying...yum! Desserts are very tasty too, if you have room for some Baklawa or Carrot Cake.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gYjP8zOIJaXh9MrhqqzwRg"
  },
  "5nUXAMYzBEFFzKLuB8J0vQ": {
    "date": "6/12/2012",
    "text": "Eating Pita Jungle is like being blasted off from the mundane world of Valley eating to a fresh, innovative, alternate universe.  I highly, highly recommend the Chicken Tikka Masala. Even if the Indian cuisine scares you off, there is something you must realize: by its very nature, Pita Jungle excels at that area of cuisine. The two other people in my party (especially the one who ordered the wood-fired salmon) could not get over how fresh the food was. My dish had flavors that wanted to jump off the plate and right into my mouth.  The mountain of positive Yelp reviews for the Pita Jungle locations in the Valley is a testimonial. It might just be the best fast casual restaurant in Ahwatukee and west Chandler.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ndt0mjRskHBYOEDst6vfxg"
  },
  "CyeULzh71WtTTP9iWDvsXQ": {
    "date": "7/23/2016",
    "text": "Pita jungle has a very friendly environment, and very friendly workers!The food is great and they have a wide verity to choose from.The service is great we didn't wait that long for our food to come out.I would recommend the chipotle chicken lavosh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BMDO8P8DsltpogY8NPjcuQ"
  },
  "inaH_ewGA3-O3Tm8yNVR9Q": {
    "date": "8/24/2014",
    "text": "The salmon salad is exceptionally great tonight. The non sweet tropical berry tea is so refreshing and service was outstanding although, i didn't get his name. Tall, dark hair, charcoal gray/black pita jungle shirt with a tattoo on his right arm, something about love cant remember  what it said. The hummus trio was really good too. The pitas get really hard fast. They're nit as fresh as they used to be when they first opened.   Overall, enjoyed the experience. My company was the best.  He was the icing on my cake",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v9KLzK_2OnsWqqyAIFck-w"
  },
  "W_7ccxm6D4ZJ3UkOeKSS7Q": {
    "date": "9/20/2014",
    "text": "Best tasting pita jungle in the valley!  Fast service too.  I went there the other day with my family during a busy time and we got our food within minutes.  Check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i3fiKHLinMF2E8341Lzenw"
  },
  "9TCxf6d13KgkstmdO2-uew": {
    "date": "6/16/2012",
    "text": "We ventured out for a bite and decided on Pita Jungle. We were greeted very nicely by the hostess.  There were quite a few open tables inside and outside, but the wait was 15-20 minutes...?  We asked to be seated outside and were taken right away.  For a party of five (three adults and two children) we had plenty of room on the patio.  Our server was nice and made a suggestion or two.  We opted for drinks and appetizers, we wanted to catch RA for sushi.  Our choice of appetizers were delicious, the tri-flavor hummus plate, falafel platter and mozzarella tomato and basil plate.    We had an odd feeling throughout our meal and couldn't place what it was.  Then right before we left we realized there wasn't any music outside!?!  Overall we had a nice experience and would recommend trying their great items.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cD-Z3ML54AbgLyT-wXrEhw"
  },
  "U2PQbUEaeJzgSvsJPB4HZQ": {
    "date": "6/15/2014",
    "text": "Great staff and environment. I'm never disappointed here! Everything I've tried here has been tasty and for great prices too! The Mediterranean chicken wrap is my go-to! I just had the salmon salad and it was excellent! Their happy hours are great too!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GS52fEm7fWPhGPdH-VB2cA"
  },
  "OF632ZjnYluBntK8WSIU7g": {
    "date": "3/5/2012",
    "text": "This is Pita Jungle's first day open at the new Ahwatukee location. I stopped by for takeout, and despite the fact that this place was brand-new, service was great and the Lavosh Shawarma Wrap was wonderful! Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K12mUmWO2Z78TLBkhLmp3g",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K12mUmWO2Z78TLBkhLmp3g/o.jpg"
      }
    ],
    "user_id": "e0pVHbAZE3B_iwRenLfImA"
  },
  "GyhA5IfUq3SWGRKHhRa9PA": {
    "date": "6/17/2016",
    "text": "Stephanie that runs the bar, is the bomb! Her boss should be so proud! She runs the bar, phones, take away orders with a breeze! Pls her customer service is awesome! Thanks Steph! We had a great time with you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YfpdkzVidI8WYfYqRsG3uA"
  },
  "DQaLOGfLdU7tqiaqYqx2oQ": {
    "date": "5/20/2014",
    "text": "Pita Jungle is by far my favorite restaurant in the Valley. I Love the atmosphere at this location and the servers are always friendly. With that being said, nearly every time my family and I have been here, (at least once a week) the server we have isn't very attentive. The only time we really see our waiter/tres is when we order and receive our food. Any time in between that, they pretty much peace out. We do continue to come back though because the food is always amazing and even though the service is not always the best, it's the friendly smile on their face that counts!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HLhJX_WSl8r1f2O6zTt0sQ"
  },
  "gnrSpJmqMhdsa0SGtMmJqg": {
    "date": "7/12/2015",
    "text": "Still one of my favorite restaurants.  However, getting tired of the BS of Sunday's and making people wait 20-30 minutes for a seat at 1 pm while the dining areas are 50% empty.  If anyone is listening from Pita, maybe hire or schedule more staff???  Anyway, went to Ra instead of the wait.  Have a movie to catch.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "2BQet2DF5oezdsEvW0hUmQ"
  },
  "_zhSYoDe8gBph79TFDxUnA": {
    "date": "8/15/2013",
    "text": "I love to eat here. The food is good, light and fresh. Tasty cocktails if you're in the mood and convenient for a date night with the hubby.  My favorites are the tzatziki and the chicken phily pitta.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "dFen4ej-XqElsEBcD6SQqA"
  },
  "kFcsP-cHpct47E-72qR7kA": {
    "date": "6/12/2016",
    "text": "the place is really nice but sometimes there are flys in there that can get annoying. the gyros are amazing, I just have to get past the fact that I'm eating a baby lamb. the iced chai latte is super sweet and good. the servers are always nice and the food is always quick to the table. also the pita is amazing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9u_uBl2RTNRJ2FMCHvPnaQ"
  },
  "p4vHL-jv2_p20IHHNapJHg": {
    "date": "12/18/2017",
    "text": "Ate with some coworkers at this Pita Jungle. Ordered the hummus platter which was actually pretty good (although the pita themselves weren't warmed at all and actually felt crunchy in some pieces which really shouldn't happen). I ordered the Chicken Lavash flat bread and was really not impressed. My chicken was over cooked and dry and the flatbread was super crunchy (almost like a tortilla chip). There was zero flavor/sauce which made it taste even worse. In the end, I only had about half (since I was hungry) and did not ask for a box. Overall, not a good experience and will likely not return. Pita Jungle really needs to up their game.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "H7x9sZ0aXkI6zU1yy6NuEw"
  },
  "xt4HI3pCHH8NYOcL4iq17Q": {
    "date": "3/4/2016",
    "text": "Have been to pita jungle in Pasadena, CA before and stumbled upon this place while staying in Chandler, AZ. When we first walked in, we weren't really greeted and had to walk around before people noticed us. After we were seated, we ordered our drinks and food and began eating as it was our first meal after a long drive from Los Angeles, CA. After eating a bit, we noticed a long hair underneath our pita bread which wasn't too much of a problem as had it returned to the kitchen. The server brought out new pita bread which was hot, I guess it was fresh? Fresher than the cold pita bread we received before.   Service isn't very attentive but the food is good, so I can't complain too much. At least they're friendly. Overall, food quality is consistent to the Pasadena location which I have frequented many times. Good healthy lunch to start off our vacation. Location is pretty big, so maybe just have servers keep an eye out for guests walking in so they don't pile up at the door waiting.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "j2RTcjp1dOX-dXVjV_w6mg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j2RTcjp1dOX-dXVjV_w6mg/o.jpg"
      }
    ],
    "user_id": "ULVeXqO6xJXuUbk1n2AMJQ"
  },
  "sm1tm-UsG8ZKIlR5aklNxQ": {
    "date": "10/21/2018",
    "text": "Pita Jungle is amazing! I love it so much! Whenever I go back home for a visit, it is one of my go to spots. The food is amazing!    Open one in Dallas and I would be one happy girl!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mDltrHBrVcUIgGgEZzv7Vg"
  },
  "nM9NjjYIyOy4U27M5QbK9w": {
    "date": "10/21/2018",
    "text": "Love pita jungle! I'm new to Arizona and I love pita jungle for a healthy option when I'm in a hurry. Their brunch is also yummy, don't forget a mimosa!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eb3PF4kRhwNgynnCH0fKRw"
  },
  "6_MJgyXPAuYsNcr87O0zpw": {
    "date": "3/6/2018",
    "text": "I don't think I have ever been to another restaurant that is as hit or miss as this one. I have been here a couple of times and had a pleasant experience with good food, then the next couple of times, the service is awful and the food is dry. It is truly a wonder how food we took as carry out was better than eating in the restaurant. Also, really bad cocktails. Don't know how those get messed up as badly as they do... but definitely don't count on their drinks! It really varies with the staff, and lately they have had too many misses that makes me think I won't be going back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W9tCJix6PIFrfDa_MnZ7Nw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/W9tCJix6PIFrfDa_MnZ7Nw/o.jpg"
      }
    ],
    "user_id": "tITpMkP38tNaUETtkQ9Cag"
  },
  "gzbp5b19utXUoARQHSKLug": {
    "date": "8/9/2018",
    "text": "The last 3 times I've come here, I've been told they're out of spinakopota, if it's so popular, order or make more. The service has always been good until this most recent trip, our waitress was very short and cold and unfriendly. Oh well, I'll take my business elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TQuB_qjHA05Z2ojejtB-8A"
  },
  "wdWBtf2tqxLiGEoLOgkFhQ": {
    "date": "11/21/2017",
    "text": "Ate here today.  The service here is the worst I've ever seen. It took forever to get our order taken, after that it took over 30 mins to get food.  One person in my party ordered a black bean burger and the beans were not cooked.    My other coworker also wants me to add that he had pickles In his falafel.. \"who does that?\"",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGY8H8bOwgmCCCh_fa1ZWg"
  },
  "PRdB4vrm3dWH42fuLLraew": {
    "date": "1/15/2017",
    "text": "I love Pita Jungle but I really prefer the Chandler location. It's just a personal preference ya know.  Same menu, great servers, chill atmosphere.  All the good stuff. I have popped in here twice for a to go order at the bar.  Good dark beer options and quality service too. I recommend the Jalapeno and Roasted Red Bell Pepper Hummus and the Chicken Shawarma.   Did I spell that right? My Man prefer the Philly Steak Pita.  You know, something familiar. Good stuff here.  Some say it's not as healthy as I think. Here's what I say.. What do they know?!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "rEau14stbn-6xJD3Ec5Zag",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Cuz I can&amp;#39;t wait until I get home for the Jalapeno Hummus.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rEau14stbn-6xJD3Ec5Zag/o.jpg"
      }
    ],
    "user_id": "quH7oYf3C-_klKjP-cklCQ"
  },
  "e2iG9BaRnJD41cjf4RzEGg": {
    "date": "4/19/2017",
    "text": "Such a great place with outdoor seating. They have the best tapas happy hour menu and a nice wine selection.  So many great vegetarian and vegan options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qMuj5FB4FKatRSjpRdJW_w",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Inside Pita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qMuj5FB4FKatRSjpRdJW_w/o.jpg"
      }
    ],
    "user_id": "aIDjxHCMgNdtApwFDllg6A"
  },
  "wJbCybrrXNZdbAqRxnhpSQ": {
    "date": "1/23/2017",
    "text": "Welcome back to my quick and concise reviews.  I will talk about the food and what I think of it.  What tastes good to me might no to someone else.  I will not talk about every single stupid little detail.  Plus I will not cry because the hostess did not smile at me when I first walked in.  I only care about how the chefs feel anyways.  If you want long reading.  I suggest you read about how to assemble a Haiku poem.    We stopped by here on Saturday at lunch time.  I ordered the Turkey Lavosh Wrap and it was really good.  The salad was really good too that came with it.  We ordered some fried pastries stuffed with feta and spinach.  It was really good.  I did not notice the green pesto on the plate.  That took it up a notch to awesome.  This place is good and I recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tFSnxUGaNa2pwb4zClBu_Q"
  },
  "P8cqDvvhb9svv8W-Q9sFAw": {
    "date": "3/17/2016",
    "text": "Been going to Pita Jungle for YEARS! This is a great spot to go to if you are looking for something nicer than fast food and is still a casual atmosphere. The food is good and price is reasonable.    Love the cilantro jalepano hummus! I generally get the chicken pasta salad. The dressing for the salad is zesty and yummy! I also really like the chiptole chicken wood fired pizza. The nachos are yummy as well. I recently was able to go for their Happy Hour and was pretty happy with rhe outcome. The portions were small but for $1-$3 a plate  ...I won't complain! (See pictures).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fOHgI19paRp4wnOsV3P1Kw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Happy Hour - this was split!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fOHgI19paRp4wnOsV3P1Kw/o.jpg"
      },
      {
        "img_id": "Fs_AgUi7AfUMstuNMRecRA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Happy Hour - portions smaller but $1-$3 a plate!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Fs_AgUi7AfUMstuNMRecRA/o.jpg"
      },
      {
        "img_id": "Kams9xY6TWpYKWmrXhVMkg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Happy Hour",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Kams9xY6TWpYKWmrXhVMkg/o.jpg"
      }
    ],
    "user_id": "H6HS5pZDrnc4HG7eWYz6nQ"
  },
  "KNQGDp48pgJ-Fz_VT6_xGg": {
    "date": "3/9/2017",
    "text": "Food was good taste like the other pita jungles. Customer service started off well maybe because they had been opened for 30 minutes. I was seated outside as requested. Nice view and the waitress was attentive at the start. Our food did come out fast and it was delicious, but we were not checked on or asked if we wanted more to drink when we clearly needed more. The waitress I think forgot about her first customers or just became very busy... I honestly do not know...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YhjGZHIbEC70L2_xuJqUFQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Mediterranean chicken salad side view",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YhjGZHIbEC70L2_xuJqUFQ/o.jpg"
      },
      {
        "img_id": "mFAUh9KSUUmAL7IMCo20Hw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Mediterranean chicken salad top view",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mFAUh9KSUUmAL7IMCo20Hw/o.jpg"
      }
    ],
    "user_id": "Za04ZUz8FQYyG67Mmg50Hw"
  },
  "JAPk-2kVKFO9bfoItHlQHw": {
    "date": "11/21/2017",
    "text": "This place had HORRIBLE service. The worst of my life! I continue to hear awful things about this place from many people at many locations. I left a facebook review and someone replied trying to make it right and wanted to know exactly what happened. I told them everything and after promising me some sort of coupon they just flat out ignored me after that.  This place needs to stop hiring entitled hipster kids who don't give a shit about anything especially customer service and running a restraunt.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4nq1FioWwwO3789IdzVjwQ"
  },
  "ff_1licY4xJbtl_wn_VTxg": {
    "date": "5/20/2018",
    "text": "Honestly, Pita Jungle is one of my favorite places to eat, but tonight the service just sucked. I waited for 15 minutes & not a single server came up to me at all to take my order. I was just about to leave when a server finally came up to me to take my order (honestly I think she only came up to me bc I probably looked ticked off). The food was good as always but the service was just bad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kgNbSp7uczvdGdT4Wy1sGA"
  },
  "dQNsTijmF8dAgXjWN08-RA": {
    "date": "10/14/2017",
    "text": "I really love this place. They have a very nice patio setting and everyone is really nice. They also have an amazing tea selection! I got the Cilantro Jalapeno Hummus with chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "129-1KY_GsPyfEJTmWl_MQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/129-1KY_GsPyfEJTmWl_MQ/o.jpg"
      }
    ],
    "user_id": "FuDh2apxMSZrqkdNr4Br1g"
  },
  "LNYo8cTrPafC_r2G9P3uaw": {
    "date": "4/29/2018",
    "text": "Came here for family dinner before a movie on a Sunday evening.  We were seated almost immediately and ordered drinks and an appetizer (6:20pm).  Both came out very quickly.  Despite the kids drinks being wrong, we rolled with it.    We finally got to place our order at 6:53pm.  Service suuuuucks.  I love the food at PJ but the service here blows.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CRxAtJxW607t-93mnfe2fQ"
  },
  "Vo1oYnd43cmbaQzyD1-Peg": {
    "date": "12/21/2017",
    "text": "Yum yum yum!! Been here 4 times in the last couple of months. Twice for the Saturday & Sunday Brunch - which from my understanding is a rarity and we are lucky to have such a nice full menu at our Tukee Ray Rd location, and 2 other times for lunch. Brunch has some really wonderful options, and who am I kidding - the $2 mimosas that's what I really love!! Also, my Mom brings her dog and we sit outside, so overall it is a really nice weekend spot. For lunch have been enjoying some of the incredible salads, and happened to stop in on half price Wine Wednesdays, got a lovely bottle of Estancia Chardonnay for only 13 bucks. TIA and JOE have been our servers lately, and they are both incredible. The host is also extremely welcoming. Looking forward to our next visit!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ovrSfCOqBPE1ow0b4gCmNA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ovrSfCOqBPE1ow0b4gCmNA/o.jpg"
      },
      {
        "img_id": "pcyL0o4pz2EIJpVdIzlGVQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pcyL0o4pz2EIJpVdIzlGVQ/o.jpg"
      }
    ],
    "user_id": "lv-mflnXGnNfZnyIRfUACA"
  },
  "hyfIwl2RNt-vwrOoxXWdVQ": {
    "date": "6/6/2018",
    "text": "Stacey the general manager was amazing! She went over and beyond taking great care of us. They were out of blue corn chips for the nachos...she went to neighboring restaurant and got some. So to our surprise, we had delicious nachos because of her level of service! Thank you Stacey! We will absolutely be back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uCmOoWtoP0-D3zfCRyKfUw"
  },
  "pVqxF2pj4cR_2tk0TiPszg": {
    "date": "5/19/2018",
    "text": "The table service was great, but sadly the food was not. The chicken shawarma was really dry. We asked for tzaziki and garlic sauce to try to moisten it up, but alas...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "suuNVw9puMu1Ot1VI__bcw"
  },
  "mjvv4QM3DXL3_KSEENFtHg": {
    "date": "1/15/2019",
    "text": "Sorry, I have to agree with Tracy,  I tried the Mediterranean roasted chicken on a pita. The pita was hard and cold the meat was chewy and cold.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ha5Wgg5g-iseLNWkgyDT8g"
  },
  "rz4LfVgt3Wg_Y-UAuDRPbQ": {
    "date": "9/1/2014",
    "text": "It was my second time there. Both times the food was fresh and tasty. The atmosphere is in an open feeling room well lit with natural light.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K371r8ObVZkapFMdPrcsMA"
  },
  "N1DDU7YBwXikWRoiQvQICw": {
    "date": "5/23/2012",
    "text": "Another fabulous Happy Hour.  They have stupid fantastic Happy Hour prices with everything being $1 to $3 a plate.  I love these little plates that make it like doing  Tapas.  My g/f and I had loads of food to share and a glass of wine each and our bill was under $20!  I absolutely LOVE having Jennifer as my waitress - she is FABULOUS!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3D7Ie-Rmmhn1RzFrVieRZg"
  },
  "SdLAW0CtDG_6CqdwwbAkNg": {
    "date": "8/5/2012",
    "text": "I have enjoyed going to Pita Jungle on a regular basis for a couple years but the last several times, I've gone to the new Ahwatukee location and have been more than pleased. It has a great ambiance, very friendly staff and fair prices. The servers are hard working and always tentative to your needs. If we have ever had an order come out wrong (which is VERY rare), the manager RC and GM Christine have been awesome in making sure we are taken care of and our experience is positive. We actually went yesterday with the kids and had Devon as a server...she did an excellent job! No matter what we order on the menu, it's always delicious. Some of our all time favorites are: baba ganoosh, hummus, mediterranean chicken salad, veggie & portobello mushroom burgers and the pesto lavosh turkey wrap!  I would highly recommend eating at Pita Jungle...specifically at this location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1y1sH-QB7S2EHghUBpI0sw"
  },
  "zwfEx6swpyO3xHCiBqjg6Q": {
    "date": "2/14/2013",
    "text": "Great atmosphere. First time at this PJ. Hop Knot and Cauliflower app is calling my name. Digging on the music.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hRvXpWoktUL1TLrt0IWbEw"
  },
  "nwNNtYd2K-mQ35voFmKMuQ": {
    "date": "11/16/2014",
    "text": "Great food, as is the norm with all the Pita Jungle locations. Ambience is a little lacking at this one, not bad, but not up to the Ray & Dobson location. Hard to match up when you're playing a strip mall/ movie theater parking lot against a community lake. The service is up to par but not exceedingly good. You'll never go wrong here though as the food always exceeds expectations!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S1KWscove8tEzyb0rhH-4w"
  },
  "pQZiiN69bvJpSh4sezzBew": {
    "date": "11/5/2014",
    "text": "This is a great restaurant for anyone craving a variety of Mediterranean food. The food here was fresh, clean and tasted great. The service too was excellent and the waitress and hostess were both very friendly and welcoming. I would definitely recommend this o anyone considering to go here! I enjoy eating here a lot, and find this a great place to have great yet reasonably priced food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NWp_FtgXmfRkh9x3TCFDdQ"
  },
  "iMubT3kGT-wzyCoCLoXoLQ": {
    "date": "9/27/2013",
    "text": "After several tries, we are finally giving up. We were seated in close proximity to everyone else. I know this is done sometimes to help the servers. But since we hardly saw ours, it wasn't worth sitting at a tiny table with people on either side of us. There wasn't enough room at the table for the appetizer we ordered and our entree plates. Some of the food is consistently good, but other items are disappointing. The many, many bussers didn't think to clear our empty plates. Our server was very friendly, but we only saw her once, and then had to flag her down to pay our bill. Inconsistent food and crowded seating will keep us from coming back. We will head over to the Chandler location for the quality and service we've come to expect from Pita Jungle.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KthduukiyV20JWu-dtBI4w"
  },
  "uhz8NQaMzv9X-YEJG0wnEQ": {
    "date": "10/31/2014",
    "text": "The jalapeno hummus is very tasty. I recommend the caribbean salad for something fresh... And you can never go wrong with the lavash chicken shwarma (excuse the spelling).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xkpe2Ox2k458c4WI0RsxkQ"
  },
  "T1-V_AqJSlMbF1InxRp0Gg": {
    "date": "3/9/2014",
    "text": "This is our first visit at this Pita Jungle since moving to Ahwatukee.  As others have mentioned to me, the service and food is not as good as we have experienced at the other locations.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bb91vcfkeF5Jb_30N6OAww"
  },
  "jAWf0BbGOqnuPdlkoJvZcQ": {
    "date": "3/20/2012",
    "text": "We had an awesome girls night out at Pita Jungle this evening!  The dinner, dessert, and coffee was great.  \"Server Sam\", was so personable, timely, and made an effort to know us all by name by the time we all left.  Was a great experience as it was my first time at any of the Pita Jungle restaurants!  Thanks Sam, we will be back for dinner/lunch again soon! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GwGoROzmyKhdI5V_mAYZDw"
  },
  "U5UwvUuW9jNErTI1lMmQjQ": {
    "date": "5/22/2013",
    "text": "I have been eating at Pita Jungle since the original location opened and have never had such a horrendous experience.  I recently met a group of friends at the Ray Rd location. When we arrived it wasn't that busy, but we still waited quite a few minutes for anyone to greet us. Most of the young servers seemed busy hanging out in the kitchen and the drink station areas. This doesn't set a professional atmosphere. Customers are waiting, so the employees can \"hang out\" at work? After waiting around ten minutes our server came to the table, no introduction, and said, \"Drinks?\" We decided to go ahead and order the Hummus with chicken, Spanakopita, and a Greek Salad to start with. The chicken served with the hummus was horrible. Little tiny pieces of burnt dried chicken that looked as if it had been chewed and somehow there was a puddle of grease surrounding the chicken. Pita Jungle usually has some of the moistest, flavorful chicken. The pita's served to us were hard and still seemed to be frozen in the middle. The Spanakopita was very bland at this location and almost has a sourness like it wasn't very fresh. This was also served cold in the middle. The Greek Salad was another disappointment. The spring mix was obviously bad, with a lot of rotten pieces. At this point, it should have been obvious to our server we did not enjoy our appetizers, since we barely ate them. She came to the table, asked if we were finished and took away our barely eaten appetizers. Our mistake for not walking out then. We ordered a Chicken Combo, Salmon, and a Gyro. The chicken was raw this time. I see this is a common occurrence for this location. When we brought it to our servers attention all she could say was, \"Well, what do you want me to do about it?\" We were in shock, she didn't seem to even care we were served raw chicken. We asked for her to do a re-fire, which was a mistake. Apparently the kitchen staff wants to retaliate on customers who send food back. The chicken was cooked this time, but it was as if they add a cup of salt on top on my food. The salt almost made me choke. The salmon was mediocre at best, way overcooked. The gyro meat was still frozen. The meat was not even warm, how did they send this out to be served? Seriously PJ? We finally asked to speak with the manager. I believe her name was Christine or Christina, now I can see why the staff is so unprofessional. She wasn't apologetic to any extent. She became defensive as we described the cold dishes. When we brought up the raw chicken, she exclaimed, \"We would never serve raw chicken to our customers!\" Totally blown away by the treatment of everyone, especially the general manager. She treated us as if we were just looking for something free. She finally offered to take off the chicken combo, and laughed as if it was a joke. Completely appalled at this Pita Jungle, I have even reconsidered ever stepping foot into another PJ. This has left a very very bad taste in my mouth. You should find professional management, who don't argue with customers and laugh in their faces.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AZIzbu_Y_LDNkXGn5C3C6w"
  },
  "nKOe4tNa9LTl2GK0sqze8A": {
    "date": "3/25/2012",
    "text": "Having been to several of the Pita Jungles around the valley (corporate and franchised locations) it looks like the owners have refined their formula for future growth.  While this location lacks some of the funkiness of other, more intimate Jungle spots, it seems this version will be the template for large-scale  Jungle world domination.  The space has ample seating, a good sized bar area and a large patio for Phoenix-style al fresco dining (which,unfortunately, typically means a lovely view of the parking lot).   What sets this location apart, however, is Sam!  If you have the chance, ask for this dude to take care of you.  Sam is perhaps the most accommodating server we've had anywhere in some time.  He even handled my mom (the prototypical high maintenance, special order customer) with aplomb and grace.  He was on the spot and his attitude and knowledge of the menu were exeptional. In all honesty, we may have enjoyed his service as much as the meal, which was the consistently fresh and tasty Jungle fare.   We have only one recommendation for improvement: please. please, please stop serving gyro meat of the stamped and pre-sliced variety.  Good gyros mean meat shaved off the spit (like those found at Haji-Baba in Tempe). Aside from this soap box admonition, score another win for PJ in Ahwatukee.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "knl-4xK47tdSUZObaFjVHQ"
  },
  "ySVvEHHt1SNZxSuZlyw72w": {
    "date": "3/20/2012",
    "text": "Ahwatukee Pita Jungle is open!!!  First trip was great, went for our weekly girls dinner, server Sam is the BOMB!  I have been to every location in the valley and this one is my fav.  Will be a regular spot for us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R7yH_Od3pCOHKKa7FcIgpA"
  },
  "2eM6ULeNHfK1Yi3whvtFyg": {
    "date": "3/19/2014",
    "text": "Thanks for your message, Bettina. I am not going to the trouble to dig out the dates and times of the occurrences, Pita Jungle troubled me enough and anyway that won't solve the problem at all. We have not and will not be back, but I appreciate the message. ~ MJ",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W5R9mChdqv80WPBO67uCGg"
  },
  "IahoCHTibzHZN0VCH7rhKw": {
    "date": "3/11/2012",
    "text": "I can't say enough about this Pita Jungle and the staff. It was my first time ever going to a Pita Jungle, and my server Kyle was very helpful and knowledgeable when it came to the menu. He made some great recommendations and I loved the food. The hummus, chicken pasta salad, the salmon, chicken combo, salads and desserts were delicious and amazing. The ingredients were fresh and the portion sizes are large, which makes for some leftovers. :)  I am also a big tea drinker and was shocked to learn how many different tea combinations could be made, thanks to our wonderful server. The service was top notch and and we enjoyed the friendly atmosphere. I can not wait to go back again, and I will definitely request Kyle as my server!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v1C2gBzXKt9B_bPGu5YJGw"
  },
  "2mk1dfTAqYxRVZVzenUO8g": {
    "date": "1/31/2014",
    "text": "Fantastic and fresh food.  Just as good as the Tempe out post.  Hard to find this style of food around here.  Fish is always great, and pitas and giros are amazing.  Go here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NSZK3vy4Q6LgITt6OU1ykw"
  },
  "WtyzKgg2ceSKvH95--HHVg": {
    "date": "10/9/2012",
    "text": "As a Lebanese-American that moved to Phoenix 2 years ago, from Los Angeles via Chicago,  I've been very disappointed with the selection and quality of Middle Eastern.....oh .....uhum .\"Mediterranean\"\"  restaurants in the area.  I finally made it to my neighborhood Pita Jungle.  The location is excellent, right next to a movie theater and other restaurants and shopping.  The restaurant itself, is large and airy and is very hip.  The service was OK, friendly but needs some work with getting the order right.  To be honest, I wasn't expecting an authentic Middle Eastern food experience.  I ordered the Tabooli (Parsley Salad) and a side of Hummus and a side of 3 falafels.  I am pleased to say that I was surprised how good the Tabooli was. Very authentic.  I asked for a side of olive oil and lemons. I like it extra lemony.  The humus was excellent and very flavorful.  The falafels on the other hand need some work...They looked overcooked (falafels are supposed to be a medium brown, and these were almost black). The mixture needs work, maybe a hint more garlic.  The pita bread was warm and tasty.  Overall I was pleasantly surprised and will definitely try it again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JU4Pcp7YKP0QRcORv63Rug"
  },
  "lQRAW3FYmvfIjWgGKD8yKA": {
    "date": "4/30/2012",
    "text": "Awesome place...fantastic food! This is the best Pita Jungle yet! One suggestion...the happy hour is from 3-5pm. That's great if you're a high school student or unemployed...however, if you're neither of the previous, their happy hour doesn't suit you well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0w7UHiKN4MxxvreMFxdElw"
  },
  "r8-fKeazXC3pLEBWnGgRwA": {
    "date": "8/21/2015",
    "text": "wiat was a bit long during the lunch hour, however great food  and great service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WsXdBbcfo2Rpva_ExIBfYw"
  },
  "FLE3TGPPVHMA-qh-UvpwpA": {
    "date": "7/4/2012",
    "text": "Went for lunch and had the chicken curry salad. It was solid, but a very mild curry sauce. We also had the falafel platter, which included two very dry pieces of pita. It was ok, but nothing to rave about.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4k7llbKSNvZTy6pKZ4pr9w"
  },
  "Ni0spMfvaLp4We9HeOrBrA": {
    "date": "2/26/2018",
    "text": "I ordered takeout for the first time and it was a great experience. The gyros we ordered were still very warm and delicious when I got home. The meat was juicy and the sauce just right, not watery. Let be those gyros!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yAV6tJYbdKEr4DOTaVCKsw"
  },
  "BASZtdoMp8SAANyx1Oy86A": {
    "date": "9/8/2016",
    "text": "The food is always good here. bit of a hipster/Mediterranean/local ambiance. Their hummus is fresh and awesome. Mahi Mahi and Chips platter is very good. My favorite and regular dish is the Seared Ahi Tuna with Hummus. Jalapeno cilantro hummas is my favorite.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "cKpBRurDHfW3z-YwZbKWlw"
  },
  "SXQbH1nUFYMM8ARemXF8Ew": {
    "date": "3/18/2017",
    "text": "We came in during the lunch rush today (Saturday) expecting a little wait. Despite remaining patient for 10 to 15 minutes after being seated, my husband had to ask a server to find our server. She kindly brought us waters but our server didn't ever arrive. We left and are now eating Tuna at Ra Sushi next door.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xaCuvgIA4HTZBHaW3Ezs8g"
  },
  "e-cwEqrW-bKopF7Kn7n2sA": {
    "date": "2/6/2017",
    "text": "Fun food and great flavors. Work your way through the menu like me and enjoy different dishes. There is quite a variety. For small and large groups there is unusually something for everyone. I suggest you get the three flavors hummus with chicken. It's a crowd pleaser.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8YORPF12Mtz-rHYhiM2s8w"
  },
  "eMh2EuPFYjphgsl4SDThtg": {
    "date": "2/25/2014",
    "text": "My friends have been raving about Pita Jungle forever. I don't know how it's taken me so long to get here! We went for happy hour recently and ordered quite the spread...how can you not when everything is less than $3?!  The hummus trio ($1) was much less than expected but nonetheless, really good. It was basically a teaspoon of each hummus; even our server agreed it was very little and brought us a second. The jalapeno was my favorite. The baba ganoosh ($1) was soooo good- and there was plenty of that to go around- although I may have eaten most of it myself! We enjoyed the dolmades (2 for $2), and the falafel (2 for $1 were delicious). I ordered the garlic lemon chicken ($2) for myself, and had to shoo away random forks that kept landing it in- it was a very generous portion, so I was nice enough to share a few pieces. Other than the happy hour dishes we ordered, we got a cup of the cocunut curry soup (?) which did not disappoint- in fact, it was so good, we got a second cup!  The restaurant itself is quite large inside, but opted to sit outside. The patio is also a nice size and is shaded, which was perfect on this unusually hot winter day.  Happy hour is definitely worth the trip, and I can't wait to come back and try some of the amazing looking salads and pitas I saw!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0j_OA1mIDDlhNm3lnZDDOQ"
  },
  "6eZQ5YjbLvuk2eX8bedPtw": {
    "date": "6/2/2015",
    "text": "I really don't understand why anyone would put pickles in shawarma. Maybe that is the authentic way to do it and I am just not aware, but to me the flavors just don't really belong together. My most recent experience here my chicken shawarma was like half pickles. As in there was an equal ratio of pickles to chicken. It was really weird. This Pita Jungle right next to the AMC is nice looking and convenient but somehow the food and service never quite measures up to the other locations.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tsm8VraTp5OGyVALtUiCeQ"
  },
  "X1FXFNnErvwQtAHRcinMkQ": {
    "date": "4/25/2017",
    "text": "Had the best soup here...I don't remember the name,  but I highly recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lvi-CKZcoAGQv7k5YUHW4w"
  },
  "0fDUs2Yl1MluyolDzmee7Q": {
    "date": "4/24/2017",
    "text": "We tried this location for the first time on Saturday night. There was a short wait to let the kitchen catch-up so we ordered drinks at the bar. Drinks were ok, if not a little on the overpriced side.   I ordered the Salmon over spinach and potatoes and my companion had the burger. The burger was overcooked and this side of flavorless...under-seasoned. My salmon was ok but the mashed potatoes were real watery and again the whole dish needed seasoning. The salmon was cooked fine but over-all both entrees were very bland. The watery potatoes were really bad.  The service was fine at the bar, hostess and server. The place is way too bright. The patio was a nice dining option. I don't think we'll be back which is a shame because we go to that AMC theater there quite often.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3f5wM1-7OXtxfryVm4y6A"
  },
  "xJRjMwzbBkGJ5UCw6XQSYg": {
    "date": "1/8/2016",
    "text": "I LOVE love pita jungle at Val Vista and baseline... Get the same salad each and every time curry chicken salad! Amazing best is the brown rice!!! This is the worst salad they have EVER made!!! There is about a WHOLE pound of carrots I assume to make up for the fact there is NO brown rice at All!!!! I am sooo disappointed that I spend my whole lunch hour driving and waiting for a salad I won't even touch! Will never go back to this location again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sWks_3CbAmy2enFxC9e53w",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. No brown rice and about a pound of carrots",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sWks_3CbAmy2enFxC9e53w/o.jpg"
      },
      {
        "img_id": "PJEBSlplSQRU2dCzOS0kUQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. What is should look like and normally does",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PJEBSlplSQRU2dCzOS0kUQ/o.jpg"
      }
    ],
    "user_id": "41A7Bj6X6oyqhDCRwVKDeg"
  },
  "G3-lOQ0iXNj43IaZN65o-w": {
    "date": "1/1/2018",
    "text": "Terrible service, my food was ok but my sister's food was wrapped in tinfoil and tasted like metal. The chicken was dry. The kids meal was crap: a glob of steamed spinach, an orange slice, more dry chicken, and noodles with shredded cheese posing as \"Mac and cheese.\" This was not my first time coming but it will definitely be my last.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TMm66q4E7avPzU5oHkO5wA"
  },
  "XrZP5Oa0QR942QWMZ0lYrQ": {
    "date": "1/1/2018",
    "text": "I won't be back. Tried this place 4 times and each time I'm disappointed. Chicken was super dry. Waited forever for food. Service was lacking. Relatively expensive for the quality of food and the dining experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lR_URWzIikrN_TKzZcIdtA"
  },
  "AshYZNauqfLZHuBhVAaFGA": {
    "date": "3/7/2014",
    "text": "Went for lunch on a Friday. We were seated in the patio right away. As soon as we sat down the server came & took our drink order.  Holy moly the hummus here is to die for. Get the trio. The jalapeno & red pepper are to die for. Seared ahi tuna was a little over cooked. Sizes are big enough to share.  Great service & yummy healthy food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ztV5_17vhdh7-X3X5_4kww",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Hummus trio &amp;amp; seared ahi tuna",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ztV5_17vhdh7-X3X5_4kww/o.jpg"
      }
    ],
    "user_id": "FyOT8tsaw-k2VYYGIr14GQ"
  },
  "XuoyMhvQejj1Im00Jq0a8w": {
    "date": "12/30/2017",
    "text": "I just love going to this place! I'm not a vegetarian but they just have such a unique food menu and the service is always great! They have a great variety of tea and I love getting one to go! The warm chicken salad with the pasta and lemon dressing is amazing, I was skeptical to try the dressing but I was pleasantly surprised! It's a great local spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ogsk-Kso_fhuFazQmMvunA"
  },
  "f0zRPPsO31vbk7N4KXlKqQ": {
    "date": "7/7/2016",
    "text": "Love these people and their food. Everyone's super quick and everything follows a great flavor palette. Would recommend for large groups based of this particular location'a layout! Other locations are smaller I think but this is the only one I've actually been inside of myself.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JNuN1B20W7Lxv4O_QH3plw"
  },
  "V--548UcMuuQeM6EVamZQg": {
    "date": "5/23/2013",
    "text": "I recently had my baby shower party here in their back room (I was so happy they had a room all to ourselves!) and I was very, very impressed with their service!  My girls arrived at 10:30 to setup since we had it starting at 11am and the staff was friendly and helpful even with helping carry things in.  Our server, Valerie, was very attentive, sweet and quick.  The place itself is very cute and since it kind of went with my theme of 'natural/wildlife', it was an ideal setting... all the decor was spot on and we had very little to decorate for the event (the back room is very well decorated in that sense).  We hosted Sangrias and Tea/Lemonade as well as Appetizers and Lavash Pizzas (basically everything) and with the 10 girls, it came out to $13 a person which was pretty perfect, especially since it included alcohol (the girls ordered whatever drinks they wanted).  The girls afterward said they had a great time, especially since the pizzas were so good (and the sangrias)... I'm happy they liked the food.  This was a great place to host a party and the price point was perfect, too... decor was in-line with our theme and the staff was 5 stars!  I recommend this place :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ACwN3HGetqPVhAgGKzdnsA"
  },
  "Om9eKavjiXQhOZh5qKWUbQ": {
    "date": "12/29/2016",
    "text": "Best food ever! Cheap, delicious, and fast! Highly recommend!  Chicken shawarma wrap is so good along with the cilantro jalapeno hummus Kate salad with quinoa! A Phoenix favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XV8wFI52aM2zvoPHWkAGTQ"
  },
  "osdyEWZbuPKgxn47n-VKkw": {
    "date": "12/14/2017",
    "text": "The food is delicious, the location is prime, and the service is good. The guava lemonade is the best lemonade I've ever had, anywhere.  I'm a single person and I eat out alone half the time.  My only complaint is that the last two times I've been here I have been seated in a small table, in between other customers when the restaurant is practically empty. So now, instead of enjoying a quiet bite to eat, I'm forced to listen to conversations on both sides.  When I asked the host to seat me elsewhere, I was told that there's no server for that table/section. I understand that some restaurants give their servers sections instead of a table rotation but that shouldn't negate good customer service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6wAr1Q-f54EaO2KzXPIkPA"
  },
  "o5i6Z27BNmHe6UvhWX4evg": {
    "date": "12/24/2017",
    "text": "Horrible!!!  Chicken Tikka Masala was \"Freezer Burnt\".  Will never go there again!  It took a while to figure out the off taste, but finally did & fortunately didn't get sick from it.  Couldn't finish, because it was so bad, bad, bad@",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HDKwHkjakjE0yrz5Jdzkow"
  },
  "5ZnR6sv1dwzBB2Oll4Cfzg": {
    "date": "2/26/2014",
    "text": "I've always heard of hummus and this place but never thought once to give either a serious try. I stumbled in because a friend referred a girlfriend and she wanted to try (thank you Janae).   This particular location isn't much on the outside but has a pretty cool environment inside and on the patio especially at night.   It's always lively and a little loud, which I love. The waiters/waitresses don't have uniforms so it's got a pretty laid back feel to it.   This place isn't just a cool nice hangout though, the food is delicious. At first I was apprehensive to try hummus but I tried both red and green with pita chips which are great themselves (I'll get to those next). My favorite is the red hummus but the green is very refreshing.   You've got to try the pita chips, I always see them in the bag at grocery stores and never tried them and still haven't till this day because I'm afraid they won't match the taste/texture of Pita Jungle's. I always get them when I go, a must. They offer them baked or fried.   The portions for each meal are pretty good size so expect to take some home. Oh and try the chicken chipotle pizza! It's to die for.    The bad:   I've gone to the Tempe location twice now and coincidentally got pretty bad stomachache and ended up hurling both times. It seemed a little dirtier than others but it didn't deter me from going to the other locations because I simply love their food.   Five stars because the environment is nice and the food is even better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GkqaZ-YgxBreGTBuIauDig",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Diet coke &amp;amp; lime",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GkqaZ-YgxBreGTBuIauDig/o.jpg"
      },
      {
        "img_id": "icgP43yJu4NjUFJHx6Julg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. A mellow Monday night.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/icgP43yJu4NjUFJHx6Julg/o.jpg"
      }
    ],
    "user_id": "ah8m3l9EDjgJOA7y9HXp8Q"
  },
  "ZiLx-3ygg4FSbbLDPQ6xEQ": {
    "date": "10/28/2017",
    "text": "Depends greatly on the location the one in ahwatukee is going downhill. Probably won't visit that one anytime soon because every time I go order the same thing and the portions get smaller and smaller. This last time we went with eight people and not really anybody was that impressed with the food portions.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mtZpzcNKfJq4l6IbDyG-8A"
  },
  "WwfW8_Y0aRcmWFCIhbZlrw": {
    "date": "6/21/2018",
    "text": "Review from a 5 year old on the Kids Menu:  \"I like the mac and cheese!  It  had good cheese and made it nice and yummy.  It was a special mac and cheese.  I also got the turkey and fruits (strawberries).  It was yummy and fresh.  Pita Jungle is really good!\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tUx19UShtzaqi7tglR34cg"
  },
  "ZpLmTO1-5Y-pR08NVjRHCg": {
    "date": "5/27/2019",
    "text": "I just moved into the area and was excited to see a Pita Jungle so close to home. This location had great service the first 2 times I ordered here. I ordered online the first time and at the restaurant the second.. With my recent visit, the staff were so busy chatting and giggling with each other that my order was mishandled and prepared incorrectly. I would like to think that although my order was remade quickly and without further issues,  I would continue to eat here.  I'm leaning on not. I'm in the customer service field and understand the weight of making the customer feel appreciated and not like they are an afterthought. It's fine to obviously chat with your coworkers,  but don't be so outlandish that it looks like you're not working or have any ounce of professionalism. You all are handling other people's food and drink.  The customer service at this location could be alot better, in my opinion after this recent trip.  2 stars for the first visits. I'll be hard pressed to come back here any time soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UIfmCwaC0uxxVSzwf5sqrA"
  },
  "6BUjb8ShhNxd5grqhNAHhg": {
    "date": "11/15/2018",
    "text": "Honestly, Puta Jungle is one of my go-to restaurants. The wide variety of offerings make it easy for just about everyone in your group to leave very satisfied. A personal favorite of mine is the blue corn nachos! So yummy. Healthy options are sometimes hard to find. Also, PJ is great for catering work meetings or other events.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C-IhW1F2o36U5YOJZWJsbg"
  },
  "tLrefECm7NZh8YfU0oCmHw": {
    "date": "7/2/2017",
    "text": "Great food with a lot of unique options. We got the hummus sampler, (3) avocado toasts and the Mediterranean platter. I was not disappointed with any of the plates. They were delicious as well as the drinks and service. I would recommend for groups as it is large with a lot of menu options for all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Wy46nmzhCSQuyta4ShTJ1g",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Wy46nmzhCSQuyta4ShTJ1g/o.jpg"
      },
      {
        "img_id": "fm0IQ147so5MVdLj8j35-Q",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Avocado toast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fm0IQ147so5MVdLj8j35-Q/o.jpg"
      },
      {
        "img_id": "xUFVHh6Crr7TqvrnvzwBvg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Mediterranean plate",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xUFVHh6Crr7TqvrnvzwBvg/o.jpg"
      }
    ],
    "user_id": "SAC9IW6InrQHdUrroXWxpA"
  },
  "PCuxRu-m1uNYp9BDJbTiNA": {
    "date": "1/1/2019",
    "text": "I really do appreciate good food, great atmosphere and great service. Pita jungle on ray road has been a go-to for my family and I for some time. First, I love the decor and art work. However, I think the space of the tables do not accommodate a family that well. They are small and have to many things on the table to feel comfortable. The bathrooms are somewhat clean and s mirror is missing in the men's bathroom, the paper towel holder was out on one side and water all over the counter-top. My recommendation is there has to be more attention to detail.  The food, is always good, that is what keeps my family and I coming back. On occasion we get stomach aches, but all-in-all I respect the cooks and type of food that is served. I really like the ability to take the drinks home with fresh drink to go.  The service, is always great. I appreciate all the servers and hostess's. For example, the hostess Madison was such a great personality and greeted my family and I with kindness and respect. Her up-beat personality was addictive. She helped my family get to our table in a area that was not in the middle of the restaurant. I noticed How busy today was, but she still made our first 5 minutes at pita a outstanding time. I appreciate great employees.  I never give a 5 star rating. However, I give two thumbs up for great service, good food and good environment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEzkzJ6dsfOEG0zfMGroxw"
  },
  "duBkoQAapW6ubtzFM1FA8A": {
    "date": "6/22/2017",
    "text": "UPDATED REVIEW:  The same day as my visit to Pita Jungle, I received a response from Kevin. He asked that I contact him and give him more information. He did indicate to me that lunch is absolutely served at this location at LUNCH time and that he would take some time to educate his employee on how brunch works. Kevin was very kind and considerate, and also promptly sent a free entree card, which I did use, right before my cross country move. When we walked in, we asked for lunch menus and I received my broiled chicken salad. Service was great.   With my current diet, I am limited on my food options, but Pita Jungle has always been a go to for me with their broiled chicken salad. Showed up and sat down, at 12:00, mind you, and noticed that we were only given brunch menus. After waiting for our waiter for a good five minutes, he shows up and we ask for lunch menus. He proceeds to tell us that they do not serve lunch until 2:30. Well... I like to eat lunch at a normal time. Not at dinner time. We decided to leave and the guy acted as if we had offended him by doing so. Shame because their lunch was spot on. I will not be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4BDt4f_h_cncggJFsjbAvA"
  },
  "EZX0jKQF4R7z1t6Y7xBdpg": {
    "date": "11/3/2018",
    "text": "If I could give less I would. I basically didn't get any service because no one for 10 mins even can over to my table. It wasn't busy and 5 waiters looked me directly in my eye but nothing. I left feeling neglected. I went next door and got a friendly welcome and faster service. Pita you just dropped the ball.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kSx3tuMPEffYq3hxqZWyiw"
  },
  "yMZqNUaDegUhs5LpgBD2Kg": {
    "date": "11/16/2018",
    "text": "My partner and I really enjoy coming here for dinner. The menu has a ton of options and their garlic hummus is so good and so is the black bean burger. Waiters/waitresses are quick, thoughtful, and attentive. It's always clean and you can hear the person across from you talking, which is what you want!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kls31KIemrLj5MwOvq6r5w"
  },
  "lFlmNmgkYQmukD4ORy8cFQ": {
    "date": "11/28/2018",
    "text": "I am already a HUUUUGE sucker for Mediterranean food but Pita Jungle always blows me away!!! Love this place and all the great staff here. Get the starter hummus plate- the cilantro jalapeno hummus is to DIE FOR!! You're gonna want the large- trust me! Also a big fan of their chicken shawarma!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7pT_p3gdPR2V6BLW9H1x0g"
  },
  "xofAFcqI6lzdk2vUwqES1Q": {
    "date": "7/26/2018",
    "text": "Great food, great atmosphere! Come here five or six times a year. Always consistent and very tasteful. Healthy options available.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "M22zgFsTTQ_enDRKd47fEg"
  },
  "7iJdEh90psENJAdhMCZRqg": {
    "date": "11/6/2018",
    "text": "Great bar, fast service. Food and presentation was good. Got a couple drinks during Happy Hour! Was not disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2wdbiUgonnCtKNNj83a88g"
  },
  "DS0d-rD9qXz9XcCMTHs1fA": {
    "date": "11/29/2018",
    "text": "This is one of my favorite restaurants to visit in Ahwatukee. Not only is the food amazing but their happy hour program is one of the best in town! This is the perfect place to bring a group of friends to enjoy tapas and outstanding drink and sangria specials. Highly recommended! Pro tip: stop in for happy hour and then visit AMC next door for a movie. It makes for a great date night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kov6mQCMerSl9KOSR3TBEQ"
  },
  "xtIICVO2ijrpErgBejm2IA": {
    "date": "11/29/2018",
    "text": "Always love going to Pita Jungle! Their hummus and chicken shawarma are so so good  I love that it feels like you're being naughty when you eat there but it's healthy and fresh ingredients! My hubby and I love the atmosphere at this location in particular, always friendly staff and our food comes out quick. 10/10 would recommend :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vbkXORDxQyldn4UfXY_oBw"
  },
  "xWFbaFLQBlP2h-mYZs-iIA": {
    "date": "11/29/2018",
    "text": "Awesome spot for healthy but delicious food! Try the salmon with potatoes and spinach, so good!  I've been to this Pita Jungle location many times for lunch and also have catered for parties of 20+, never disappointed and will always be a go to spot for me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N6qrZOXPvp8j2Rj5ZpCqEQ"
  },
  "LKn6ZsWfK0K8ZAnxpQm7bA": {
    "date": "10/21/2018",
    "text": "Pita jungle is my favorite for healthy choices! My favorite plate by far is the pasta salad with chicken. Not only is the food amazing but the environment and vibe of the restaurant is very laid back. It's great for date night or dinner with friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5UJwnfivN6C7XbTatoy48A"
  },
  "lUN8NoCZuUh7PpL4CmWkTQ": {
    "date": "3/17/2017",
    "text": "Always Fresh and Always good  I have always enjoyed eating at Pita Jungle , the service is exceptional and you always leave wanting more.   The serving sizes are generous. Today, my friends and I ordered the hummus for an appetizer, and we split a few Chicken Chipotle Pita Wraps. If you like hummus at all, you need to try it, you won't be disappointed.  If hummus isn't for you Pita Jungle offers a wide variety of entree selections. There are  salads and great desserts.  The service is always friendly, courteous, and the food is always fresh and delicious.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "MMf0LhEk5tGa1LvN7zcDnA"
  },
  "jd-e-haBfQUeXOpxAh3w0g": {
    "date": "11/15/2018",
    "text": "I always look forward to eating at Pita Jungle! Recently my manager and I ate here for lunch because we knew we could count on their quick service, and healthy options! I also got to try my first banana leaves!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XKmx3_YFgcCfjbJRBhlOqA"
  },
  "7PhOBo8uJ8p3_c_Ak_paNw": {
    "date": "11/15/2018",
    "text": "Where to start! This is my favorite go to food restaurant. Easy, fun & amazingly delicious food. There happy hour is to die for!! & the menu is healthy. You don't have to use a cheap meal when you come here, there is something on the menu for everyone. There hummus is absolutely amazing (cilantro jalapeno one is my fav.) From the starters to the salads to the wood fire pizzas, I have the hardest time choosing because all the selections are so good! Go here!!!! You will not be disappointed",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gQe4XRqPnxOVbDgEl4bouA"
  },
  "d6CTcvttgb-FiJW2RXM4hA": {
    "date": "11/15/2018",
    "text": "The service is great! Got seated fast and helped right away! the food is AMAZING! I would highly recommend this store and this location for a nice friendly night out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AVcVue-dUKXI2kSFnfECqw"
  },
  "CBREImE-UZV7g6IoHf9zgA": {
    "date": "7/27/2017",
    "text": "Wine Wednesday-1/2 price bottle. Love that!  Try the Italian Pinot Grigio and you won't be disappointed. Enjoyed the seasonal avocado hummus.  We split the Lavosh Shwarma which was nicely plated for us with our own little salad. Perfect night with great service and fresh flavorful food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yis0tDX83YnFLzUbKZ_KFg"
  },
  "PR2J3YTCEXb4ig8f1xBNew": {
    "date": "12/27/2014",
    "text": "We've been going to this Pita Jungle since it opened and it had been one of our favorite go-to spots. Lately, however, the service is not as good, the portions smaller, and the quality inconsistent.  When ordering to-go orders we used to be offered something to drink while we waited for our order - not anymore. While dining in, we used to have a to-go offered of whatever we were drinking (tea or lemonade) - no longer the case. A large order of soup to-go now gets you a large container - half full.  It just seems as if the details have slipped and what were once \"delighters\" have been axed from the experience.  Bummer.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CK1RBINAL261BJyTC-BaPA"
  },
  "l3ODs_6YRGUIP7FJ0QvyvA": {
    "date": "11/6/2013",
    "text": "Summary: delicious food, relaxed atmosphere, attentive and friendly staff....and as someone who has a lot of kids to feed, it is cheaper then McDonalds to feed them and so much healthier!  We have tried many of the dishes and my favorite is ole faithful, the gyro. You have to spurge for a side and get their broccoli. Steamed is great but their seared is just ridiculous.    They have great drinks too for dinner, drinks and a movie. They have a pineapple mixed drink that is tasty and potent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ek4Z8jlazFgvi-QvL0npvg"
  },
  "5azQYXNBz-scIqyLBySY8Q": {
    "date": "12/15/2016",
    "text": "Pita Jungle is our go to!  My fave is the Giro sandwich w/Greek side salad. Get extra Tzatziki, it's super good.  Husband trys everything.  Salmon with grilled vegetables, last week. I like their Tropical tea combined with lemonade (PJ Arnold Palmer) more than my usual white wine!  For an appetizer we shared a bowl of red lental soup, wonderful. Get extra pita points, it's all so delicious!  We love the huge outdoor patio, but the music and general inside vibe is always upbeat and relaxing.  Service is outstanding.  Someone else said this may be the best Ahwatukee/East Valley restaurant restaurant.  We agree!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cnjC_LzYKDIt6zxt6ixA1g"
  },
  "JzmjysBkWGmCAyuc3XJamw": {
    "date": "7/8/2012",
    "text": "I have visited all of the east valley locations of Pita Jungle in my many years here in Tempe. I am super impressed with the management of this location. The staff is super friendly (which is typical of all the locations), they look hip (of course) but the best part is they are on top of it! I have not had to wait long here. There always seems to be enough employees, even when it is super busy.  The actual restaurant is artful and visually pleasing, full of fun and whimsy. The bikes on the ceiling are fun and the colorful wall above the kitchen are my favorites. There is a lot of room which is helpful since I have small children.   I enjoy the menu, which is consistent with all locations. The hummus cannot be beat anywhere. It truly is the best available I have ever had.  The kids meals are so nice. I love the options for the kiddos. It helps kids feel like they have a say in what they eat but all of the options are healthful. I don't have to lie and omit options from their choices. It's great! The most touching thing about this location is the management went above and beyond to consider the families with kids and had a small basket of toys the kids could pick from with their meal. It actually was a \"happy meal\" for all. Just such a treat.   Thank you for providing a wonderful dining experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "JYtnn6zmF3AsGnjMeQdlBA"
  },
  "ssazkUO1bvAY5o7_tkzShg": {
    "date": "10/7/2014",
    "text": "Great, healthy food.  Service is always good.  I always get the chicken plate with a side of hummus.  Add an IPA and it is super good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "G9HdDKXZnIGgIMcfUE4b_A"
  },
  "6mJBLvSq46TaMX6uNm2HbQ": {
    "date": "5/6/2012",
    "text": "new location, same horrible service!! they just can't get it right!!! Food was sub par because it took so long to get quality service. They go hand in hand. I had to politely remind the staff that there were 4 tables sitting outside still waiting to get greeted. After the poor service & messed up meals, I told the manager the problems and he worked to correct them & was grateful that I said something to him, but u would think it would get better... Nadda even worse! Disappointing experience for myself & son (who is 3). At one point, my son asked to go next door to RA as he was just bored sitting and waiting for juice, ketchup, & his dessert.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "fwasfCCwbxLjxLNhYLuF3Q"
  },
  "4bSrUkUIwzwZsLVFPsyU8Q": {
    "date": "4/17/2012",
    "text": "Much like Sam A. (4/12/2012) we had an incredibly disappointing experience with the food. Our server was better and more attentive, hence 2 stars instead of 1.  To start with we found the Spanakopita to be incredibly salty, like they used a tbsp instead of a tsp. My wife ordered the Broiled Chicken Pita which I have had before and is good, but this time it was a disaster. The chicken was cold and the pita was cold and stiff. It got sent back and we got a new one which was better but still not as good as the Chandler location that I have eaten at before. I ordered a spicy chicken lavosh wrap. Now I love spicy food, but besides being spicy, this had absolutely no flavor. It seemed as if the mix had been marinating for a few days killing off any flavors that the beautiful ingredients should have had. Again very disappointing.  Not sure if it is because this is a new location or a large location for them, but I have experienced much better, and the food quality was so far off their standard it makes me hesitant about ever going back. It is not complicated food so it shouldn't be that hard to get it right.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "qoeYvAbJMoemSpX-NvXE5g"
  },
  "-3g5SWt1UeWrNJlqzBtSFQ": {
    "date": "10/14/2012",
    "text": "This is a great location for Pita Jungle.  I love the fact that there's a comfortable outside patio.  Service was fast, and the menu is great, like all the pita jungles in the valley.    I got the black bean burger, which was delicious, but hard to eat since it was loosely packed.  Next time, I'll get a real burger.    Their food is always great, refreshing and well presented.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2I83Ft0lRgu4oAbA9mQYyw"
  },
  "0XVbSEj7qBBMYxbT2OrGuA": {
    "date": "3/24/2013",
    "text": "I'm craving this food right now. This location has an awesome expansive dining area - great for groups. Our server was ah-may-ZING! And probably the best baklava I have EVER had. So glad it is next to my office!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ziqFJ5NsPW3EqINiS2IpBg"
  },
  "RL-uQAQMcaHP0Qj7AKUefQ": {
    "date": "5/25/2015",
    "text": "So delicious!! My wife made me come after me saying no for years. Thank goodness she did. I had the wood fired chicken with garlic mash potatoes. It was so fresh and tasty. So good! A must when you visit Arizona.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f04jBA1sl3QrD9iG6SKIag"
  },
  "V_y00qwmYFGb3Ayxe9ZQwA": {
    "date": "4/9/2013",
    "text": "One of my favorite local places. I love the Shawarma, Philly Chicken Pita, and Pesto Lavosh Turkey Wrap. The Happy Hour that starts at 3PM is really good, with Hummus for a dollar, and Falafel for $2. It has a good local restaurant atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "biDhaMVK7zXqsT9phXW1-g",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Shawarma. Classic!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/biDhaMVK7zXqsT9phXW1-g/o.jpg"
      }
    ],
    "user_id": "94mF8GhkBM-eDx8OgrLWGA"
  },
  "hPOVID52X-uDo2Yp4kR-vw": {
    "date": "5/30/2014",
    "text": "This is the first time I came here. Good and service was good but my goodness, invest in some shades like your neighboring restaurants or run over to Fry's and buy a few umbrellas.  It's miserable sitting on the patio with zero shade. And when the server even mentions management is aware of the issue but does nothing to improve the comfort of their customers it not good for business. Next time I'll go to the nice shaded Sushi place next door.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0vPN7RddNIfNWbCORqovxQ"
  },
  "7UggeTjIUBipyyK9PbBDCw": {
    "date": "5/29/2012",
    "text": "We had an incredibly disappointing experience with the bar.  It was my husband's birthday and we decided to go to Pita Jungle for a late lunch. The hostess promptly seated us at a table that wobbled so bad I thought the top may fall off and on the floor was a host of objected to help steady but without success. We asked to be moved. The next table was better but not perfect.   We ordered 2 pineapple margaritas from the drink menu. Our server took our appetizer order and brings 2 glasses of water. The water was non-filtered and had a smell I guess that why they put lemons in it. Now our appetizers arrive and our server is assuring us our drinks are coming. We see her go back to the bar and tell the manager she needs these drinks. But I don't think the manager now's how to mixed drinks because they still aren't getting made. In fact no ones are getting made. The table behind is wondering where their drinks are and the table across from us too.    Drinks finally arrived. It took at least 15 minutes maybe longer to get our drinks. Our food arrived 5-7 minutes before the drinks. Sad but True. It was at this point we decided to go elsewhere. The appetizers were good and the waitress was kind and this is only reason I am giving them 2 stars.   No excuses we watched the hostess get over whelmed, the servers get over sat, tables not getting pre-bussed or even cleaned once the customers left. Did the busser have the holiday off? Did the service bartender have the day off? A manager was present and it didn't make it any better. Is this a fluke?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HCOfZHhuEbpC0BEII4cIjA"
  },
  "UVim6XYCSjG3JXAUZ3DL9g": {
    "date": "6/24/2015",
    "text": "Love this place. Service has always been good. Only have had to wait 20mins at most for a table on a busy day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nIZJ8ahifiIDG7zczUBwrw"
  },
  "8P569WQozTDJVZgy8MZuOA": {
    "date": "8/30/2017",
    "text": "second time enjoying some appetizers here! prompt service, friendly staff-- even though we came in later than usual, i think it was 830pm!! we had the nachos, SO GOOD. i had to ask for extra chips because well, i gotta get all that goodness in my belly! Joe was our server, he was polite and patient as we took our time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "caYuCBJzQVXeAwX08tltBA"
  },
  "O0Owqn-B_nvGNkWaY76ctw": {
    "date": "11/16/2014",
    "text": "I just love this place. One of my favorites. The happy hour menu is great and the tapas are amazing . Their hummus chicken is off the charts .You can't go wrong with any of them. The atmosphere is so funky and fun. YOU MUST TRY THE PINEAPPLE INFUSED MARGARITA . It is like nothing I've ever had before....simply delicious . We always sit at the bar because the service is great and the girls are so friendly . I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zvcVvZbfhV_cTI6ZfzHcLA"
  },
  "3yaytdwmoBnBD2PC-sLs0w": {
    "date": "3/23/2012",
    "text": "Same high Pita Jungle standards great new spacious location! I'm sure this Pita Jungle will be here for a very long time. As always the service is fast and friendly. The Hummus was smooth and bold; my salad was fresh very developed in flavor. No complaints here... well maybe their prices, but keep in mind I am a little cheap but the food is worth it which is why I keep coming back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "RB3_GtWgvQYTLu3bxY2-VA"
  },
  "oS5UYPMvqD9TpZaI-kcaHw": {
    "date": "3/14/2012",
    "text": "Nice to have a closer Pita Jungle.  This location is missing the Pond they have at the other location past the 101 on Ray Road, but it has a much bigger patio which is always a good thing.  The inside of the restaurant is pretty big and a little more modern than the other Pita Jungles.  The staff was very nice and efficient on my visit.  Since they have only been open two weeks I think that is a very good sign.   This is a busy shopping center so the parking isn't as great as you would assume it to be. A special note to the Minivan that parked in the compact spot next to me, your car is not a compact.  Try:  - Nachos! - Ginger Stir Fry - Lavosh Pizza  - Hummus",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rhE4gLtM0gb3XLwSz6HPCw"
  },
  "XyOv7zovpHO1CpAZaO6Q8w": {
    "date": "6/28/2014",
    "text": "My family and I enjoy dining at Pita Jungle for their reverse happy hour (from 9pm to close). We especially like the grilled lemon chicken, hummus, and tomato and mozzarella platter. Last week we stopped in for a late dinner and it took any single server about 15 minutes to come greet us. Many staff members looked at us, and saw that we had not been helped (we did not even have menus) but keep walking. My family loves this location because it is very convenient and the food is always on point (my favorite dish is the macro platter). We are both shocked and upset at the lack of customer service we received during our last visit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2xE5ceyNaSyJ9CHpciXtUQ"
  },
  "rrgjadN21DsAiJqgd-Fa8w": {
    "date": "5/29/2015",
    "text": "I have been to five PJ's in the valley and have to say this is the worst one. I love PJ and the food is great but this location has the worst service. Every time we go we have some issue whether it's getting our order wrong, not returning to refill drinks or something as simple as making sure we had silverware. This one needs to step up the training!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PUfazrc0OMbH-YBipTznGw"
  },
  "mqiIMSheImgJHekP3wisuA": {
    "date": "5/20/2014",
    "text": "Ive been to this Pital Jungle many times. Each time, I get great GREAT service. I eat  a little fish, but mostly vegetables. I can't think of another group of restaurants that cater so greatly to that demographic.   But, if I were to be honest, EVERYthing on the menu isn't great.  My husband.. who is stricktly meat and potatoes, isn't a fan of PJ. It's like the meat options lack something for him.   For a year, I only ordered the Mahi Mahi special. I think that dish, is amazing. That Jalapeno hummus is like crack! I love every moment of eating it. Couple that with some decently cooked grilled fish.. and pita chips... and SALSA.. well I am in heaven. lol   A couple of weeks ago I decided to get the black bean burger. It's good. But, I think I ordered it twice because it really does have the potential to be outstanding!  Here's the problem: 1) It's messy .. BUT most things delicious are, so you look past that  because it's on a  fantastic bun... with hummus.. except 2) it's kind of dry. Like the hummus and the bean burger makes it dryer than it should be.. it's missing a good BBQ or some sort of sauce and 3) some grilled veggies on top like mushrooms or something would have been nice.  But the potatoes  that come on the side area also friggin amazing.. so knowing me.. I will order the burger again and doctor it up a bit.   Like I said, its a greatly made (and large) veggie burger.. it's just missing the extra to make it outstanding.  Other than that one must seriously try:   The Jalapeno Hummus The Ahi Tuna and Hummus.. lol   Oh .. and did I mention there is crack in the hummus??",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwZ0oo5gfwjFYQcubAeKLw"
  },
  "uoPw8kmJLRDt-gwk3rD-nA": {
    "date": "4/9/2014",
    "text": "Always get good service.   Great, fresh tasting food and lots of options to choose from!   My favorite is the red pepper hummus appetizer. It comes with one pita so if you have two or more sharing it I'd recommend ordering an extra pita. Their tzatziki is especially good and fresh tasting also.   Their Arnold Palmer is pretty good, but a tiny bit on the sweet side.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cb2l7p1SsGo1le570wOoeg"
  },
  "qMVsW_mpW5NcSuj5TGvLBA": {
    "date": "4/25/2017",
    "text": "Just read the review from 3 days ago. Not only do I know exactly what your talking about but I've had this happen to me 4x and I watch him do it to most of the customers that walk in. I was in there tonight. You basically have to argue with him to be able to sit where you want, even when the whole patio is empty. The funny thing is, he puts you in the absolute worse table possible. It's funny to see which customers will ask for another table and then be unfortunate enough to experience his indifferent and subtlety rude attitude. Worst host ever. He looks kinda like Ray Romano with a tan and his nose is pierced. I would think the owner of this  restaurant would be extremely disappointed to see his patrons experiencing this. Everyone else in that place is fantastic, including the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-IWEAlIu06QavzqqUpwyYQ"
  },
  "aJUotbd9h6GGBtAUGVQLEQ": {
    "date": "6/29/2014",
    "text": "My family and I have been going eating at Tempe Pita Jungle for last 14 years. always great service, great food and we decided to visit Ahwatukee location, with 12 family members, to be surprised how rude and lousy customer service is at this location.  It may not be fair to say that everyone was rude, but two out of three waiters, managers, have been very rude.  Surprisingly rude in suggesting that we sit outside in 103F weather with small kids, after being asked to accommodate us reasonably with better seating.  Customer service is art, it is a backbone of every service oriented business, so my suggestion is that Pita Jungle management seriously examines their expansion and what they want to become.    We left, 12 of us and took our business elsewhere, and I hope that others will not tolerate low standards at this location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pz19u93C-PNLDECogeEiLQ"
  },
  "83yHtSihs2LLGxmqQGbNlg": {
    "date": "2/29/2016",
    "text": "I find myself at Pita Jungle Ahwatukee once every week or two,  mostly due to lack of other more healthy options in the area and the fact that I can order vegan very easily.  However it is unfortunate that the food almost always far exceeds the customer service standards...  with the exception of a couple of servers, Keith being one of them. It seems like management is too lax and although I can appreciate a casual environment, it shouldn't mean service suffers. It is usually expected that our waiter/waitress will be talking to another server at a POS or by the bar when we are waiting for drinks or even after the food has been delivered, rather than asking if there is anything else we need. We have been on the patio numerous times and it has appeared the servers pick up patio tables so they have some inside then maybe a random few outside, which typically lends to patio tables getting poorer quality service and servers feeling too strained.   Pita Jungle offers great options for children, however when I asked on our most recent lunch visit, which of the food options are organic for the kids meals (i.e fresh fruit) the server said \"I don't think any\".  With the spotlight currently on non-gmo food and organic living, I am very surprised that Pita Jungle hasn't taken the organic plunge yet.  I think the business would sky rocket.  Overall it's not bad,  but it could take steps to hold servers more accountable while still maintaining the artsy edge and definitely introducing organic options.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6rG3-v-x45q1CPZ2zn2LkA"
  },
  "p4POiq7ZnDAJAJsUCKvTEA": {
    "date": "6/28/2015",
    "text": "Love Pita Jungle. Never had a bad meal. Each location is on point with decor,  atmosphere,  food quality and speed of service as well as the friendliness of the staff. There is a reason this formula is so successful it works!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uSl8Xx13jwNm9wqxy6QpOg"
  },
  "hE3afG3Gizm6vXG_IN3kRQ": {
    "date": "7/25/2015",
    "text": "As always, great food, atmosphere and service. Good for a casual lunch with a friend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LLNPc4bDJH212s279cFzIw"
  },
  "LRhP8gduprUHPfRg_VAkSQ": {
    "date": "3/16/2017",
    "text": "Okay, since going to Pita Jungle the first time off of Tay Road near Ahwatukee... I had the chance to go back as the manager was nice enough to reach out and offer to give me another try.   I did go back but this time I went to the location out in Gilbert, I will say this, I got the California wrap and it was awesome it had great flow an awesome filling with the chicken olives and veggies and side salad, I was ready to jump to my pic and update my review in an instant.   The same weekend I went back to the Pita Jungle on Ray road and my opinion again Hit rock bottom.  We ordered the exact same dishes and the food was missing ingredients that were not in the wrap we had had at the Gilbert location.  Not only my food but my guests food as well was no where near what we had from the other Pita Jungle.   I don't know what it was or why but I know there are some Pita Jungles I will visit and others I will pass by.   Hence the three stars for this particular locations.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n9FjHXrmvNq2o_EFTcgAgA"
  },
  "VQSGZHN2RD2SqxPdDIteuw": {
    "date": "1/16/2016",
    "text": "We love Pita Jungle! I go to this location at least 3 times a week. The staff are nice and the food is always good, regardless if it's for dine-in or take-out. Our two favorite staff are Keith and Jen, their fun and actually engage in conversation:) Pita Jungle is A great option if you're looking for healthier food choices, especially for the kids.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZlJyGOB0rvtCWXJSdV84IQ"
  },
  "fklqEWQyw5PONBQWmC5OuA": {
    "date": "1/6/2015",
    "text": "Pita jungle is awesome! Great options for healthy eating! Ice tea is on point! Every time I come to Phoenix I stop here at least once! They are kid friendly and have a bar area. The jalapeno hummus is a must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "arJG4vUAP2jqa0w_3AOEgw"
  },
  "tHQysSZJH1N3u_NWCqypPQ": {
    "date": "7/3/2013",
    "text": "This is the 3rd location I've tried out. Pita Jungle does NOT disappoint! Everything about their food is consistent. The staff is friendly. I wish we had these restaurants in Florida. FIVE STARS!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "inZuoA-YYTh5Q9colDKjTw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. My friend Aliki LOVING herself some Pita Jungle!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/inZuoA-YYTh5Q9colDKjTw/o.jpg"
      },
      {
        "img_id": "aHIvfFUAsCYzpmPEZETe3A",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Tomato Basil Mozzarella Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aHIvfFUAsCYzpmPEZETe3A/o.jpg"
      },
      {
        "img_id": "4HM-QDCXv1Y72E7MmzK6Nw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Greek Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4HM-QDCXv1Y72E7MmzK6Nw/o.jpg"
      }
    ],
    "user_id": "HpG1UNAYMlkDaraE6BCdJg"
  },
  "JFl7gXSRBc_YY4FtyKr3Dw": {
    "date": "9/25/2015",
    "text": "I love Pita Jungle but just this location alone woukd be 1 star. Everytime I go I get forgot about, so never greeting and getting me a drink for 10 minutes or so. And my stomach just seems to hurt when I leave. Only location w this issue",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ThTUwfNAdWrK6tKvl-Dtpw"
  },
  "6t0n3nBlAe_9hoDASD2RVw": {
    "date": "12/4/2013",
    "text": "I came here a few times I always ordered burgers this time I decided to order Greek salad, however I was very disappointed to find lettuce in a Greek Salad, please google real Greek salad and see if it has lettuce Staff were nice, clean place and nice crowed. They also charged 39 cent for an extra pita. I think it's a little \"cheap\" not the price but as an attitude.  Overall I was happy with others food than mine. Still, I would go back!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "37FnGSWDxlD6uCoRHkdRJA"
  },
  "RqL7efOzcKRnsXFw0VXUXg": {
    "date": "2/11/2015",
    "text": "You can never go wrong with Pita Jungle! These restaurants offer a wide variety of quality and delicious foods for reasonable prices. Some of my favorite items are the chicken pasta salad, gyro, falafel, and the baklava for desert. But seriously, anything is good from this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kIcQu4A5VXkP9joCho5L6g"
  },
  "iyrQL1sCfDeBDZjgW43n-Q": {
    "date": "1/19/2014",
    "text": "Stopped to have dinner before a movie. We waited less than 5 min for a table. The food was great! We will return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bRqfVtkXxL-4WNXD-mVSFQ"
  },
  "BCEkkGegb9mJDVezrNLtxw": {
    "date": "12/8/2015",
    "text": "I've been to this location twice now.  I have to say I'm impressed.  Having not been to a Pita Jungle before, this one made a great first and second impression.  The tables were clean, the food came out quickly and was delicious.  My server on both occasions was very pleasant and attentive.  Thanks, folks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OodMvG5xrJNko0LTVM8fqg"
  },
  "WeWwohOdnXYoB2JYc6xIMg": {
    "date": "1/16/2015",
    "text": "I love Pita Jungle. I am so glad a location has opened near me. Everyone always has a wonderful sense of humor and tolerates my sarcasm well. They have decent prices and everything I have eaten there has been really tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2A7AgxB0phzWtAB5KRkd0g"
  },
  "Gju3V46RsV53hBdy5mGelQ": {
    "date": "5/1/2015",
    "text": "I ordered the spicy chicken wrap because when I saw a photo posted on this yelp page (it's been removed) it looked appetizing. It was picked up with a bunch of orders placed with coworkers in my office. What I got instead was this open-faced pita that clearly was not wrapped. There was also a swirl of sriracha sauce on top of the aluminum foil it was wrapped in which wasn't wrapped nicely either. I called and was explained that the kitchen \"makes it that way\" because it's \"big\". I get it, but they decorate aluminum foil with sriracha sauce, really? I asked for the manager but they had to call me back because they were busy. They waited so long I couldn't answer anyway since I was off of my lunch hour. Thank goodness I was starving since I had no time to return this ugly mess they call a \"wrap\". Here are a few photos from what they advertise on their menu online vs. What I was given. This was a disservice to pita jungle and I wasn't happy at all with either my food or the person who answered the phone that tried explaining that slop.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2g-nulMU7RdnObe-TLjEnw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. The two on the right was supposed to be the spicy chicken wrap advertised on their menu on the left. Sad.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2g-nulMU7RdnObe-TLjEnw/o.jpg"
      }
    ],
    "user_id": "U4rN2LzNHU7CiRtJwkVMxg"
  },
  "I9Xzl_5J1x75e_miYpAbrw": {
    "date": "11/23/2016",
    "text": "Had lunch at this location the day before Thanksgiving. We sat on the patio and both the lunch and the service were awesome. Our food came out very fast and it was very good. Have eaten here a couple of times before, it was good but nothing great, this time it was definitely above average!  Would recommend for those who have family in town or want to sit out on a patio while our weather is fantastic",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1CRKG-NBFzPrVXTzSekJw"
  },
  "IhQGJoR9kW838vpV68Wl0A": {
    "date": "9/24/2016",
    "text": "I waited at the bar patiently to put in a to go order. The bartender was busy on the phone taking a to-go order which took ages and def not her fault. One guy was at the bar and pulled at his credit card, so I assumed he was ready for something as well...when she got done with her to-go order she then took a couple's order who were sitting at the bar. However, not once during this time did she acknowledge me standing there with a To go menu in my hands...not even a quick, hello! or even a, I'll be right with you, nothing. After serving and bartending for a majority of my life, that is just what you do. Once she took the couples order and entered it in, she walked passed me to the guy with the credit card since he was there before me and took care of him. Again, no acknowledgment. At that point a new guy walks up right between the guy with the credit card and myself. After she finished cashing out credit card guy, she goes right to the new guy who just walked up and starts taking his order. I immediately walked off. After waiting so patiently, I was shocked she'd skip right over me and go to the guy who just walked up. Unbelievable. It's called customer service. If you didn't know who was next, just ask!! Everyone waiting will know. I decided to leave and not give this place my business. As I waited by the hostess stand, a man came by to ask if I was helped. I said, no, that's why I'm leaving. He then said he's the manager and would like to take care of me so I'll return. I told him what happened, he said the bartender is really good and must have not seen me or something.  Either way, at the end of the day, the manager spoke to the bartender, took care of my salad and took the initiative to make things right. That and the fact their food is delicious is why I have this location 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t20uEOgX9kxO6gzmDO4qTw"
  },
  "o3aAU0ip1R_BYCcbjnE2Uw": {
    "date": "4/2/2019",
    "text": "Love this place. Great stop for meat eaters and non. Drinks are bomb. I always get a marg. Became a regular place I visited while living in AZ. DEf worth a try",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "McvUG4y8b-YGHQsVz9CnDQ"
  },
  "a_tj3kupDGDyTIjOuu8RDg": {
    "date": "5/8/2018",
    "text": "Ate here after a long day at work in the hospital in Tuscon and decided we'd rather dine in Phoenix. Since it was late we decided at Pita Jungle. We were surprised the food was pretty good.   The waiter was great he brought us an array of appetizers hummus, pest hummus, falafel and cucumbers with Pita bread. The chicken tikka masala was actual decent and so was the shawarma wraps. It was perfect after a long day.   The waiter was great friendly and great at suggesting what we should have when we had questions. The menu was a blend of different cultures which was great cuz if you can't decide what to eat there are enough choices on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GFzXHFn6lOaHiMJOs1GYsg"
  },
  "TIarN3OzF8wbA4pvwhcsaw": {
    "date": "10/14/2018",
    "text": "Great service and nice patio dining. I had the grilled chicken entree which was fresh and tasty. Large portion with two chicken breasts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ppWMu36uqUI6crUX4urhFQ"
  },
  "7J4wRyXkDe4IprBSfWRgPw": {
    "date": "12/2/2018",
    "text": "I decided to come here with my siblings before seeing a movie next door. They have an amazing selection of healthy food options and everything we ordered was absolutely delicious! My favorite dish is the Glazed Chicken Pizza - this is a MUST!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y0rO0di01JJxF8cQoqlBQQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y0rO0di01JJxF8cQoqlBQQ/o.jpg"
      },
      {
        "img_id": "8DczO4lQATkc7T03pJeA1A",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8DczO4lQATkc7T03pJeA1A/o.jpg"
      }
    ],
    "user_id": "gi9a4f6347TVsaytDWsZIw"
  },
  "gshSOmoXrLWUskUEcjNtYg": {
    "date": "11/29/2018",
    "text": "One of the best parts of a Sunday afternoon is walking out of a good movie at the AMC Theater into a great dinner next door at Pita Jungle!  Pita has happy hour seven days a week so a cold beer is so appropriate along with fresh hummus and a hot chicken combo platter. When we are extra hungry we get some of their happy hour Tapas.   Pita has a nice Ambience with local artists featured on the walls and the service people are usually pretty good and very eclectic.  We have been going to the  Ahwatukee location for quite a few years and they never disappointed!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9yPnO0ysJDJgG44AwyWZkA"
  },
  "mhH55sCB-uGffvsPSFfvNA": {
    "date": "1/13/2019",
    "text": "This location continuously under performs. Maybe it's because I order via Doordash, but they always disappoint. Whether it's sloppily prepared food, smaller than usual (based on other location deliveries) orders, or missing ingredients you're assured to be underwhelmed. Anyway, don't waste your time with this location. You're better off finding a mom and pop Mediterranean place close to you.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4NLBJiJiTQihEFtNoYfe7w"
  },
  "W_L1EUuBRoMXoDlgxiIllw": {
    "date": "1/7/2018",
    "text": "Always good food and Service can sometimes be a bit sketchy.  We don't mind as the food is generally very good and the atmosphere is very laid back.  This location has a full bar and a bicycle theme with large bikes hanging from the ceiling and light pendants attached. As always local artist show there work and it's available for sale.  The large patio is very nice as well and offer great heaters to stay warm in Arizona's cooler months.    Today I enjoyed the caramelized cauliflower appetizer which was very good.  Definitely going to get that again.  It was light and crunchy, almost like a popcorn consistency in a nice sauce.  I also had the Kafta pizza.  Even though I enjoyed it, next time I will add some jalapenos to the mix and make it a tad more flavorful.  For gluten free seekers, at an up charge you can get gluten free on any pizza.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "l5dyL7L2oM0SORDRkIiwUQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Chicken Lavash Shawarma Bowl",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/l5dyL7L2oM0SORDRkIiwUQ/o.jpg"
      },
      {
        "img_id": "woDeVV4ScftZ0H6tKiLy6Q",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Caramelized Cauliflower with Tahini- So good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/woDeVV4ScftZ0H6tKiLy6Q/o.jpg"
      },
      {
        "img_id": "Pdho1Q8Po7MaWO0AZxRJtQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Kafta pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Pdho1Q8Po7MaWO0AZxRJtQ/o.jpg"
      }
    ],
    "user_id": "1zfdRlzvd3SpuFEDoqKUWg"
  },
  "XMICTkhgCN-nLrj73iLfcA": {
    "date": "4/9/2019",
    "text": "Fabulous food! Fabulous food! I have ea ten there weekly for a long time,and I have never had a bad meal!! The menu is extensive, and everyone is friendly and accommodating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPGWGwZT_iGJTRXbD7nbDw"
  },
  "qDNJH3bmMrRUGi-SrWgBBA": {
    "date": "12/11/2018",
    "text": "My go to for any mood. I have been coming to Pita since it was on Apache. I order a few different items and love their Guava Lemonade. The Sirracha sauce is a nice addition to the food. Love the red roasted and cilantro jalapeno hummus, the salmon salad, the nachos, chx schwarma, the broiled fish, etc...It's pretty good and consistent.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mgtjGHTZlnDa11YuyqEy1w"
  },
  "OAUjngOkXjPKnvYmxskfAA": {
    "date": "3/17/2019",
    "text": "Loved the food, service and inside decor  the prices are very reasonable and the menu has a variety of options",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PgM-8pe6k0EIBZHAihdlFg"
  },
  "Y1W-ZcRHzbN8Xj0THPgJVg": {
    "date": "7/12/2018",
    "text": "Came for a quick lunch break and was not disappointed! I tend to eat lunch a little earlier so we were actually the first people in the door once the restaurant opened at 1030. Super interesting atmosphere with antique bikes hanging from the ceiling for decoration! Food was great, highly recommend the hummus and pita bread!! I ended up getting a gyro which was equally phenomenal. Only downside was service was super slow and food was a bit pricey. Take this with a grain of salt though as it was just opening for the day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bx4vVVXyl8OJR-8ForTi3w"
  },
  "Jmcfl6DWd-IOvgzKROzYEQ": {
    "date": "9/6/2018",
    "text": "I would give 5 stars based on my 1st visit. The food was delicious, service was great. I was so excited to go back with my husband & 3 kids. The place was packed, a single person walked in front of us, the hostess sat him in the last 4 top. Then she told us we had to wait, we sat for a few minutes, then a couple came in and she sat them imI was irritated as I looked through the place to see many singles in tables with 4 chairs. I think she needs a few \"hostess placement lessons\". We walked out right over to Savor Flavor, and had a delicious fast meal. I will go back to Pita Jungle, but I hope this review makes someone teach their hostesses how to properly seat people when the place is busy.   Update: Kevin mailed me two free entrees for his establishment, I am more than pleased and can not wait to return to the Pita Jungle with my family. Thank you Kevin!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WCe8j6Q_ceWqnAqrrv_E6g"
  },
  "DIeWZcmbASZ1wTErejxJDQ": {
    "date": "10/29/2017",
    "text": "This is a great location in Ahwatukee if you're coming from the movies or seeing one after! Service and food are solid as always. This time I tried one of the seasonal dishes as an appetizer and it was really solid! Avocado, garbanzo beans, cucumber, lemon, and tomatoes served with chips! Try it before it goes out of season!   Also, they have wine Wednesday's! Half off any bottle of wine.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Gvtp-qe4KcX12FTqsxcTQA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Avocado balila",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Gvtp-qe4KcX12FTqsxcTQA/o.jpg"
      }
    ],
    "user_id": "WjPLEr26Y0nW_ZtCEymnDw"
  },
  "9hV4kr3qyChoK2ePPYpVYw": {
    "date": "6/9/2018",
    "text": "This was my first time eating at a pita jungle. The food was good but the server thought very highly of herself. We ordered 2 rounds of drinks along with hummus, side of cucumbers, and some kind of hot dish. We were one cucumber slice away from finishing everything and my girl noticed a hair.   We brought it to the waitresses attention. In short management offered to comp one round of drinks and the side of cucumbers . I thought it was a joke. I didn't have the energy to teach management how to treat customers that experienced a dirty dining experience. Rude wait staff, a manger without logic, and a hair in my food. I won't recommend or be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y4IR83bnRSMU1bPNFdoqhA"
  },
  "C-gE7eeELPTYsI-X3eWvZw": {
    "date": "11/19/2018",
    "text": "Love this place!!! They have so many great vegan options that mix health with flavor! Came here with my family and will definitely be returning to try all of their seasonal favorites. My boyfriend was very impressed with the food as well, he even left with a bottle of their delicious green sriracha sauce. Would recommend to anyone who loves hummus or health food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ne2s3D6g0UXl59vVSHEVcg"
  },
  "kkCcj-sRkfEQbLq555v5Qg": {
    "date": "11/28/2018",
    "text": "This place is super easy to find right off the freeway! This a great place to get something light yet filling while on a road trip and it's conveniently close to the freeway. I tried the California Beach Lavish wrap which had so much flavor! If you love Kalamata olives you'll love this one",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dGqPTJ3VSq6DzxsqTMpbhg"
  },
  "QXmRe5JagfJZbuKEZQnJBw": {
    "date": "7/14/2018",
    "text": "OMGOODNESS! My plate was almost demolished before I took a pic it was SOOOOOO GOOD!! I gotta \"summer plate\" with a tostada.  The atmosphere was very busy, it was Friday night. I like the ambiance of the Glendale, but this one wasn't bad either. Whenever I am in Chandler again, I will be stopping there for a bite to eat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PlSw8Yb2l2JTPFdKzrkzrg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PlSw8Yb2l2JTPFdKzrkzrg/o.jpg"
      }
    ],
    "user_id": "d1rrBKwoAoEqUJ_QVQkaSg"
  },
  "WrxWZh1ziJEUQomdTjIfDg": {
    "date": "12/27/2018",
    "text": "Love going there every time I'm in Phoenix. Tasty fresh food, lots of choices to pick from. Good options for kids as well. Not expensive, you get a lot for your money here. Great service as well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "68KDVep8ZQj66dekL14jNQ"
  },
  "SQTKWNJilpqilUaxwSGNcw": {
    "date": "6/18/2018",
    "text": "Usually a favorite choice.  I took 7 ladies with me after movie.  Service was very slow.  2 ladies were informed there was no shrimp 12 minutes after ordering and our orders were being delivered.  1 guest got her tapas pizza after most had finished their meal.  She reordered after shrimp info. The tapas pizza shouldn't take too long.   I poured refills on teas and waters as servers did not.  One came to the table while I was pouring and didn't offer to finish pouring remainder glasses.  There was an error on one of the checks, it was adjusted. We paid bills and sat at table chatting.  There were many empty tables Monday 4:30.   I did speak to manager on our way out, he had reasons for poor service  and offered a comp appetizer next visit. How will that be documented? Most managers give you a business card with item written. I will not ask for free app.  Food was fine.  Lots of dining choices in the area.  Won't rush back.   Best part of meal, a former student is now working in the kitchen.  Thrilled to see him grown up.  3 ladies at the table had been his teacher in elementary school.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-UUM0s9yaLjw8ak8OUPMNw"
  },
  "VFaJZQ5OBmMjlu3f_k_oIQ": {
    "date": "1/21/2019",
    "text": "Great place for food. My complaint is that it states that it's has a dog friendly patio .. so when I went with my dogs they (host) told us dogs have to be outside of the patio with the dogs being on the sidewalk. Very misleading..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dJugBRX7pn5O-IPMlQTICg"
  },
  "IbRezo7pLiU4UFLjRViZYg": {
    "date": "8/5/2017",
    "text": "Loved the food and the server was amazing. The Greek salad and tropical tea was very good. Loved the atmosphere. I will recommend everyone to come here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "97NzIp3HLM6hHyYsmKmjdA"
  },
  "LVS3s02nm_-W14UWkibGcw": {
    "date": "8/2/2016",
    "text": "I try to stay away from big chains like this, but I just moved here and was craving falafel so bad, and I really wanted to try it.  Food was ok. I ordered a falafel sandwich. Didn't blow me away. The pita was hard and flavorless. I also ordered tabouli, which was pretty much all parsley. The mixed beans were really good.  Atmosphere was pretty cool  Service was good. Between my server, the manager and the buss boy, they asked me if I was okay about 10 times which was a little annoying.   Wouldn't really come back too many times because I can make this food better at home.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G73LpvPfxfzUC3ROWbv3ow"
  },
  "1ASpWdjaFVU-4xI7rcSaCw": {
    "date": "10/16/2014",
    "text": "Let me start off by stating that I love fresh food. The people here are, hmmm...unique? Nice, but weird in the \"I'm trying to be a hipster\" kinda way(I dunno). I like the happy hour food menu because I love eating a bunch of different foods in one sitting and the tapas are fairly priced and just enough. Now, if you're starving order whatever but if you're ordering something other than a wrap be prepared to eat enough to feed 4! Not the cheapest yet not overly priced either.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xZGAEBlshe2Wnnl4J9xRGg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Mahi mahi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xZGAEBlshe2Wnnl4J9xRGg/o.jpg"
      },
      {
        "img_id": "T9Z5ms4SJqIuM3y08-Ou5A",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Tapas! A whopping $2 spent right here",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T9Z5ms4SJqIuM3y08-Ou5A/o.jpg"
      }
    ],
    "user_id": "GTw-6VmePjDclOl50VKvRg"
  },
  "IkrxIGClqtVajgehIZTwSw": {
    "date": "8/4/2012",
    "text": "I wouldn't say that the service was unfriendly but where was the service? Coming in was okay, and we sat outside so maybe that was our own undoing. I always feel when you sit outside, the waiters forget about you or something. It was so lovely out we didn't want to be cooped up inside though. The timeline went as follows:  -Drinks were ordered, took at least 10-15 minutes to get our basic order. Longer for the booze, it came a little before the meal and the waiter had to be reminded. -We ordered several tapas since the waiter pointed out that they were having happy hour specials. They never arrived. -They were busy but the wait was so long for food we eventually ended up trying to find our waiter to see if they had forgotten about our order.  -At long last the food came and we had to remind her we had ordered tapas and we had wanted them before the meal. So we ended up with tapas with our meal which was ideally ordered to go with the drinks.  The falafel platter was a little disappointing as is the case whenever I order it from here. For some reason they always over-fry the balls leaving them too hard. Nothing really beats Haji Baba's or Elie's Deli.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3vMHFNzM6nL5K3qjnR4fxg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Chicken del sol",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3vMHFNzM6nL5K3qjnR4fxg/o.jpg"
      },
      {
        "img_id": "d53lcCEKo5NWeMLaQxDXoA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Tapas pitas and hummus.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d53lcCEKo5NWeMLaQxDXoA/o.jpg"
      },
      {
        "img_id": "RcVXHonhic1eGBlFVUyR2g",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Falafel platter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RcVXHonhic1eGBlFVUyR2g/o.jpg"
      }
    ],
    "user_id": "25W8CVIdQDIkyPb8ISCGpQ"
  },
  "Y3ESNR4gfaXFTx0xyBK2_A": {
    "date": "6/1/2014",
    "text": "I had a disappointing dinner at this location.Cobb Salad had dry chicken and lacked freshness  in addition and  especially concerning besides my food order was the behavior of a young lady working the bar. She constantly had her cell phone in hand at all times and even delayed service to her customers while she took and made  personal calls. Very unprofessional and found it unbelieveable that the management allowed it. I and my wife were there on a Thursday for an early dinner between 4:30-5:30pm. The dining area did not protect you from the blinding Sun since there were no shades. We had to move to another table in the corner of restaurant.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lXEPwm3S6iILKljoeYmWiA"
  },
  "PHnDVBar-cBbEz9-3ueLDg": {
    "date": "8/27/2013",
    "text": "I don't know why Pita Jungle is so popular. The food is expensive and it's somewhat bland.  I had a portobella burger that was OK, although somewhat tasteless. The best part about it was the grilled red pepper on the side. Some bland potatoes didn't help.   My partner had a trout salad. The fish was kind of smelly which indicates it was too old.   I have eaten here several times and have never been impressed. There are many Mediterranean places in the valley that have far better food and they are way cheaper.  The building has no sound dampening so the eating area is extremely loud. People start yelling at each other in order to be heard so the din was annoying and uncomfortable. I had a tough time hearing my partner or the waiter. There was so much noise I was afraid I was going to get a headache.   As for atmosphere -- it was industrial and not pleasing. They should call it a Concrete Pita Jungle.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "38F0slYX4N1FLVqt1kM0Wg"
  },
  "LP13ZmvaFIt_nJnsbfHedg": {
    "date": "12/11/2015",
    "text": "Great place when your looking for healthy, delicious Mediterranean food! The Gyro and Falafels are to die for, great service and ambiance.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wveslZZhd3DNY8y6y6v8CA"
  },
  "-uTHrW7SfaXLKJPAN0hPuA": {
    "date": "3/23/2014",
    "text": "Huge fan of Pita Jungle, and this is my favorite of the locations I have been to. The location is in a strip with a movie theatre, sushi bar, book store with a coffee shop, and a couple of bars so you can make a night of it.   Oh yeah, and the food is awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "YiXRvEQ-YI7NugG6CPZS-g"
  },
  "dS6pRCIuC242l3M4diXGrw": {
    "date": "9/18/2015",
    "text": "Pita jungle may be everywhere and there is a reason. With vegan and vegetarian options it's great for everyone (if your kids aren't too adventurous and only like McD's than maybe not)... My favorite is the seared ahi tuna on hummus app. It's a meal in size and is so delicious!!!! The butternut squash soup is out of this world too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Sz4N01C2R3JCKU4cznr2Zw"
  },
  "YY_EFn-Z_bNclDmTVfYKiw": {
    "date": "11/8/2014",
    "text": "This place is casual and has a large open patio for outdoor seating. Food is priced reasonably and tastes delicious. We ordered quinoa and tandoori chicken... Totally enjoyed our fish and chicken for the night. Service was good as well. In fact we ended going there twice in one week and we ordered gyros the second time... You will never be disappointed with any item on the menu... A must try if you are in the area...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I5qjZd8Syy2HyfUBbWjrkg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Pita jungle patio",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/I5qjZd8Syy2HyfUBbWjrkg/o.jpg"
      }
    ],
    "user_id": "3PThFhwBwI8xnGCrFQ467g"
  },
  "xFBB52Hs6RDdIxjC9TQxqQ": {
    "date": "4/25/2014",
    "text": "Food is always good (love the Philly).  Happy hour is 3-6 daily (despite what the website says!) and they have a bunch of tapas for a couple of bucks during that time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sOudRDE_R3VYni0rEYFkSA"
  },
  "_as26WjzsA2BPblPIn9dFw": {
    "date": "5/10/2014",
    "text": "I'm in love with Pita Jungle. Delicious food that is fresh and (can be) healthy. Cool vibe inside...and outside. Most of the servers are friendly too (except that one guy). Good beers on tap. Tasty gyro wraps, chicken & hummus, salads, and pretty much anything on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lU_aNRWw8edBmIi5_NARmg"
  },
  "csJbEDUZAZ3pWLInL-I_qw": {
    "date": "6/11/2016",
    "text": "It pains me to say this but the quality of Pita Jungle is going down little by little.  The Chicken which used to be consistently awesome is now hit or miss. I'm not sure if this is because the food is being sourced from a different place to save money or what but the fact is I have had bad, tough chicken on several occasions.  I sure hope this is not a trend but I have seen this happen to other restaurants in past.  Please keep your attention to detail your customers notice this. Update: last visit, quality much improved!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j0mfi5CI12lLEYQ62AtcpA"
  },
  "7FFsUZG7wx78VlfLdZ0otA": {
    "date": "1/27/2016",
    "text": "Amazing staff. I travel from Las Vegas to come here a couple time a year. This is always one of my first spots for dinner or lunch. The staff truly knows the menu and when you ask what is good they don't just read the menu they tell you what taste great together",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ebuCeDMe0TGGWmEMEbQaQ"
  },
  "jHiw8DX7KwvgYWDQxpQoxQ": {
    "date": "3/25/2017",
    "text": "The hosts were total sloths. It took 2 people about 8 minutes to figure out how to seat us. That was because they just talked about their weekend and would not take us to an available table. They waited until another wait person went over pointed to the table. Is that really the best you can do? I won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZRnSFEsW_2etThEmuvkiww"
  },
  "lc0zUMtasigz2C7FepwemA": {
    "date": "10/16/2015",
    "text": "Always a fan of Pita J.. I like this location since they seem to be very family friendly and still great quality food and funky vibe...with little less of the attitude that comes with some of the other locations. :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8BF7knw4uXx2zTUoqHhvA"
  },
  "HViYd6JG1N47j-7UpP4YHA": {
    "date": "6/21/2013",
    "text": "Update.  I received a message reply from Bettina (and my name is WINDY, not Wendy) on June 15th  to send my contact information via email which I did. I promptly received the following response from Kevin Berk;  Hi Windy, And thank you very much for sending your contact info to us. I will have the manager get in touch with you today and we will make this right for you. Again, we are very sorry for our poor showing. We expect and will deliver a better experience next time.  Thank you for your understanding and your patience.  If for some reason you do not hear from them today, please let me know.  Best regards, Kevin  TODAY is Friday June 21st, I have not heard from Ahwatukee PJ and sent Kevin an email that I am very disappointed.  This PJ is not worth my time or money.  I wish I trusted the reviews and chose a different option for dinner. This company doesn't care about their customer, charges them for items not ordered and does not refund their money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "kF9J2uyU2u5B8LnKoBmodQ"
  },
  "HPdUjBi4lh9xPV_QPvQR2Q": {
    "date": "5/9/2013",
    "text": "We have eaten here a few times. The food is ok, it's healthy. The workers are friendly.  The place is clean, ok.   The prices are high for the sizes. There aren't many ingredients on most dishes, they are simple so I feel the price is a bit high for what you get.   My 1 start is because 2 times I called in food to go late at night. When I get home my chicken was uncooked inside. It was cold like if it was frozen before. One time is not good, twice is unacceptable!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "lGUJVBaRBV-tQ66rePslYg"
  },
  "2udlz_sXozRgjVNYdEp1kw": {
    "date": "1/27/2016",
    "text": "I really wish I had taken a photo our food was well presented. My friend and I ate here last Saturday for girl talk. I had the albacore tuna pita and every bite was so amazingly fresh and oh so good. I really like that the flat bread is served on the side. My friend had the black bean burger and loved it. This is definitely going to be a restaurant to return to. My only regret was they do not serve a plain green or black iced tea. All featured teas are fruity, but no worries, I had San Pellegrino instead with a twist of lime. The host and staff are wonderful. Delicioso!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X7NHc1i4LgqCPiltnuvR1g"
  },
  "PtIuxBV1aDdRnS3XxI-UGw": {
    "date": "6/10/2013",
    "text": "I had lunch there on Friday with my wife. She had a roasted chicken salad that looked good. I ordered a philly cheesesteak pita which had an extra dose of some bad bacteria! Yep, I got poisoned the pita jungle. About 2 hours after lunch and for the next 24 hours, I was spewing even when there was nothing in me to spew!   Anyway, I really liked pita jungle until this episode. Sadly, I will not be eating there ever again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "OG6q40EnCDY6JSHDmatOmg"
  },
  "WyfL0AGEpVpUyry0IH3bUw": {
    "date": "8/25/2019",
    "text": "I have only been here during happy hour. I really enjoy the items they have available during this time. They serve tapas during happy hour so it's easy to try out a few different things at one time!   Their hummus trio is always a hit. & if you're a garlic lover, I would recommend their garlic dip! Their baba ganoosh was okay. Glad I tried it but wouldnt order it again. It didnt taste like much to me, very bland. But their chipotle chicken pizza on a Greek pita is freakin amazing!! So flavorful! The spinach & pesto pizza is good as well, but hands down the chipotle chicken is my favorite. & their falafel's were seasoned and cooked perfectly. Those can get dangerously addicting!   My girlfriend and I also split a spicy chicken wrap. This wrap is huge and can easily be shared. The wrap was okay. Nothing spectacular about it but it was good.   Service at this location was fast & very friendly!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uhYUuzBbz1q_uPeTj4-I2g"
  },
  "XaLi66gWcaErbVEORXfi7g": {
    "date": "8/22/2019",
    "text": "This was my first visit to Pita Jungle and it won't be my last. First off, there was 13 of us in our group and Pita Jungle was very accommodating. We did call in advance to make sure they could. When we got there our table was ready and we were seated right away. I was very excited to see a glass of water already at each seat. Being over 100 outside, cold water was a pleasant sight.  I ordered the Wood-Fire Chicken. The quantity of the plate was great. More food then I could eat and believe me it was sooooo good, I tried to eat it all. The chicken had so much flavor and was very tender. The garlic tomato sauce was a perfect topper and the potatoes was a good bottom.   The only reason why I'm not giving this review a 5 star is because we ordered a round of alcoholic drinks and it took 15 mins for us to get them. I understand that it was 12 drinks but you could tell they were sitting for awhile cause mine was watered down by the time I got it. This was disappointing.   Check out the pictures. I get hungry just looking at them lol.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_w-ReF1HPEy7tEzL3cfX0A",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Wood-fired Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_w-ReF1HPEy7tEzL3cfX0A/o.jpg"
      },
      {
        "img_id": "2f0hy4krh6_ZZp8opGrrqA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Cilantro Jalapeno Hummus with Grilled Chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2f0hy4krh6_ZZp8opGrrqA/o.jpg"
      },
      {
        "img_id": "9MkdQtvVy-iEqC7W-iN1Eg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Humans and a green tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9MkdQtvVy-iEqC7W-iN1Eg/o.jpg"
      }
    ],
    "user_id": "9P2xH64sS0UBkPoGK35Kmg"
  },
  "GT_1k2K38AD-vwC3a7EcVA": {
    "date": "7/25/2019",
    "text": "Recently I can say that the quality of the food has really decreased over the last two years. However I want to talk more about a very disappointing issue that occured recently while I was  ordering my usual vegetarian salad, the host asked me if I would like the chicken salad. After explaining that I was a vegetarian, she finally found the salad on the menu she proceeded again to ask me if I would like \" Chicken\" on this vegetarian salad, with a sarcastic smirk on her face. This was an obvious racial slight.  I reported this to the manager who was semi responsive ,but didn't say one word to the young lady that committed the offense.   I will never return to this store and if you are about racial equality and good customer service, I would suggest going elsewhere",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hxpKKhJ3kJIKzy9SwOSH_w"
  },
  "mk-ETy4DLOZOzimyJA50kA": {
    "date": "5/1/2019",
    "text": "Visited pita jungle for the first time on a Tuesday evening to grab dinner before the movie at the neighboring AMC. The ambience and the service was amazing! The fuzzy lemon cocktail (I ordered with no sugar) was just enough sweet. The taste was so good that my husband ordered the same as he disliked his original order (mango margarita).  Ordered the food from the happy hour menu ($2) each. The babaganoush was nice and flavorful. The hummus trio (classic, cilantro & jalapeno and red pepper hummus) was delicious specially the cilantro & jalapeno flavored hummus was the highlight. The pita was warm & fresh. The falafels (2pcs in one serving) in particular were nice & crisp outside and moist in the inside -packed with flavors.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jRmlHMjcmInxi7_ulczVZQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Chocolate Dipped Walnut Baklawa Rolls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jRmlHMjcmInxi7_ulczVZQ/o.jpg"
      },
      {
        "img_id": "8waoup9fVmpB6dTlJEeZDA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Fuzzy lemon cocktail",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8waoup9fVmpB6dTlJEeZDA/o.jpg"
      },
      {
        "img_id": "E0smkQjGEvsbn-57AsEjhA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. 1 Piece Pita",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E0smkQjGEvsbn-57AsEjhA/o.jpg"
      }
    ],
    "user_id": "A2UXTirzw8j6ifwZx2klTA"
  },
  "-TYuBzB1W4dnuGWQztfkkw": {
    "date": "9/17/2019",
    "text": "It was freezing cold inside so we sat outside. Our waitress was a young girl probably in high school. She had blonde hair and glasses. She was rude and inattentive. I ordered a beer and went inside to chat with her coworker for 5 mins. It took about 10 to get my beer because she was slacking off. She didn't even deliver our food. Food was mediocre.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FwqOBPeKrSIumvssQFfeiw"
  },
  "E0bIyqrvYRCekSCtS3ynUg": {
    "date": "4/30/2019",
    "text": "Terrible. I ordered food with my company and this food gave me food poisoning.   First, I don't think they gave me the correct sandwich. I ordered a chicken shawarma and it was supposed to have everything on it: lettuce, tomato, onion, pickle. This sandwich only had tooo many onions and tomatoes.   I have been sick for over 12 hours now. I will not eat here ever again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0HtGmq4yDhNOwl9HtLT21w"
  },
  "RWVDksUlsnv9Vq9qhh7bOQ": {
    "date": "9/7/2019",
    "text": "I really love Pita Jungle. I'm used to the Tempe location and also the one off of Indian school in the Arcadia area. However, the Awhatukee always has an issue. I've tried to be patient as I know every restaurant can have a bad day. Yet, once again my Togo order was incorrect. We ordered a kids meal and they failed to give us the chocolate milk I specially asked for. In addition, the bun to the salmon burger was burnt. Like on the top fully burnt (photo below), and staff thought it was still acceptable to bag and serve. On the phone, when ordering the person could barely understand which is ok I get it places have background noise, but then set up staff for success. The girls at the door barely greeted me and once they knew I was there for pick up it was like oh go over there. The poor girl running pick ups was by herself and clearly overwhelmed. She made me wait while she put a phone order in. Last I checked it the customer present in front of you goes first. Just common hospitality etiquette, but again she was running phones and orders and pick up orders solo, while there was two hostesses chatting at the front. So I guess this boils down to management. Please just be aware of which pita jungle you go to. I love pita jungle, but this one barley gets two stars. The food is decent and it's closer to my house, but I shouldn't have to drive out of my to get a better experience from the same restaurant company. Pick your battles folks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Aff-1RMs3WMAJRrBCUgcoA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Salmon burger with a burnt bun",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Aff-1RMs3WMAJRrBCUgcoA/o.jpg"
      }
    ],
    "user_id": "uIlCWmdFGdSmjwhfiE63ew"
  },
  "CwyjuTeUDi4Jqr9X3_D0Jw": {
    "date": "9/14/2018",
    "text": "I have tried every Pita Jungle in the valley And this location is a winner!!!! I order the Mahi salad or plate  Hummus- next level jalapeno cilantro  Grilled chicken pita Tropical tea! Love the unique art- completely different pieces at every single location. Staff works very hard so be sure to tip generously :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "UWjnEtv5nagcadc9Mi3xCA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UWjnEtv5nagcadc9Mi3xCA/o.jpg"
      },
      {
        "img_id": "JjJhyByUumEO37lOFLNphQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JjJhyByUumEO37lOFLNphQ/o.jpg"
      },
      {
        "img_id": "9q7-3sdeSM7hXH457CCWTw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9q7-3sdeSM7hXH457CCWTw/o.jpg"
      }
    ],
    "user_id": "WEQZSx14YkAI_KEfKPhXrg"
  },
  "kK5GTffpaIJXtqhYs88TGQ": {
    "date": "1/6/2019",
    "text": "Let me start by saying I LOVE PITA JUNGLE.  I always order the California beach lavash without pickles or olives. The last three times though have been a disappointment.  We came yesterday and my sister and I ordered the usual our California beach lavash. It was missing the avocado and was dry. My sister also got an upset stomach we don't know why... we eat here often.  Long story short the waitress gave us vouchers to come back, so we did today.  Today my mom and I ordered the same lavash and this time it was dry (missing the mayo mix) again, missing avocados again, and was cold. The staff is super nice and offer to bring the ingredients but since it was already cold by the time they brought the mayo and avocado my lavash was super cold. Also it falls apart when you open it to place the items inside of it. The staff is always friendly but the kitchen staff is messing up! 2019 has not been off to a great start for them. I hope they fix this because we love coming here! Please see picture the lavash wraps usually have color and mine looks uncooked.  Please please please fix this pita jungle!!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "bNwvHKV6g-bwegXWJNQ18Q"
  },
  "dwIq0HmTu6kKYPlW9_pnLQ": {
    "date": "3/8/2019",
    "text": "Added a star solely on Kevin's attempt to resolve the issue. Good costumer service, sadly after the fact.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jiZ_4SZsTX5j5PWM6jhfSg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Mold",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jiZ_4SZsTX5j5PWM6jhfSg/o.jpg"
      },
      {
        "img_id": "mjdwZg7ajtL1u731Bo1wUg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Mold",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mjdwZg7ajtL1u731Bo1wUg/o.jpg"
      },
      {
        "img_id": "6PrRX0Cp3EyUJJxowNJsnA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Very small amount of hummus. Just thin enough to look like enough",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6PrRX0Cp3EyUJJxowNJsnA/o.jpg"
      }
    ],
    "user_id": "moy7hsuUfcBqYux2yj-dgQ"
  },
  "weMmsOM5Uf-J5eKkUZ5zuw": {
    "date": "12/13/2018",
    "text": "My new favorite place. Kevin reached out to me and sent me a free entree card which he didn't have to do since I still had a good experience last time...but this time was even better!  I ordered the Avocado Hummus Tostada bowl with tofu which was amazing...it had a little crunch and spice along with the tofu and avocado...my new favorite meal!  I had a seasonal sonoran drink, not sure exactly what it was but coconut based and so good. Also the trio hummus on happy hour was only $2! Their happy hour looks amazing.   Thanks again to everyone at Pita Jungle...I think this may be my new favorite place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "j0InyNhDvOsuOLIfvz4T8Q",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Avocado Hummus Tostada Bowl.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j0InyNhDvOsuOLIfvz4T8Q/o.jpg"
      },
      {
        "img_id": "wreoXJdP44eMvnWji0m8xA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Sonoran.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wreoXJdP44eMvnWji0m8xA/o.jpg"
      },
      {
        "img_id": "5rXFv1dvWPWnjzpFLGtytQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Hummus trio, falafel wrap, key lime martini.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5rXFv1dvWPWnjzpFLGtytQ/o.jpg"
      }
    ],
    "user_id": "HkVnslspLbmATUzBs3ZdKQ"
  },
  "GfP15w5qtI0sOsbfd-IVZQ": {
    "date": "1/10/2019",
    "text": "Update:  The last 2 times I've eaten here it's been awful!!! Not sure if they changed cooks or what.  I pre-ordered door dash so I'd have some fresh food for lunch. Thinking it'd be fresh because they just opened.  Got my order, I'm starved, started to eat the gyro, hard pieces of burnt dried up meat crunching in my teeth. I spit them out. Open the gyro to find cold, very very dry meat. Looked days old.  Non satisfactory! The lettuce was wilted and old.  Will not be wasting my money here anymore!  Gross!!  Previous review of 5 stars is a thing of the past.  So disappointed!   Great food! Love that they do door dash. I'm Never disappointed in what I order. The fire grilled salmon is amazing. I love their roasted pepper hummus and grilled chicken. The chicken shawarma is tasty, I add taziki to",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lHc8fCwCg8hX_gsSv6eMiw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lHc8fCwCg8hX_gsSv6eMiw/o.jpg"
      }
    ],
    "user_id": "NLbfheu9meAhWjKFO0GGAA"
  },
  "-jMjUkL7AawxMTJbkvkFtA": {
    "date": "4/17/2019",
    "text": "Excellent food and great place to eat. This menu is thorough and delicious. I recommend the chicken Shawarma bowl. Their falafel is very good as is the hummus. The guava lemonade and passion fruit tea are both super yummy. The service is fast and friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7kMfuFh7h8PYbcHrqSyqZg"
  },
  "goBWr1B5J4cg0UGcA_4neA": {
    "date": "4/23/2018",
    "text": "I ALWAYS order the Chicken Combo Platter because it is that good. It was just as tasty this time, however, I think the delivery was a little sub par.  I didn't have a \"to-go\" utensil package to eat with which made it immensely difficult to cut the chicken (which is normally sliced, but wasn't this time apparently) since I only had a plastic fork to use that I had at my office.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OLQ4oud1r4jmw0Xtmnuv2Q",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Chicken Combo Platter (to-go)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OLQ4oud1r4jmw0Xtmnuv2Q/o.jpg"
      },
      {
        "img_id": "Y4rHzd9x6fYlsogPIZn7Lw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Chicken Combo Platter (to-go)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y4rHzd9x6fYlsogPIZn7Lw/o.jpg"
      },
      {
        "img_id": "etpli3q4Ll9PxyZ6P5O5cA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Chicken Combo Platter (to-go)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/etpli3q4Ll9PxyZ6P5O5cA/o.jpg"
      }
    ],
    "user_id": "7bWZAphAjvu5PuTIKDDTow"
  },
  "zrDfwMh-FIZ32m9WaZuvYQ": {
    "date": "6/5/2019",
    "text": "This place sells very amazing, good, and healthy food. The place itself is very bougie. Their employees here are super nice and always has a smile. There are soooo many food options to choose from. It's not as expensive so I would come back here again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5KPEflsk4Y55WlfiNYr1fQ"
  },
  "41LdrbBxXKAuY00VQVALKg": {
    "date": "5/13/2019",
    "text": "This place is YAHESOME...Jocelyn is the best. The food is amazing with all that guava lemonade. YAHUMMMY.  Mz Liz & Martin",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XweNAd9Nm5s0gTOG8XiKVw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XweNAd9Nm5s0gTOG8XiKVw/o.jpg"
      },
      {
        "img_id": "5pWyxu7lvrAw1QLWFvBFeQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5pWyxu7lvrAw1QLWFvBFeQ/o.jpg"
      }
    ],
    "user_id": "5DnL8xTQSm_dq7l0r3WSLA"
  },
  "_7viNNR-62Au6VdHjMq6Wg": {
    "date": "4/24/2019",
    "text": "I have big love for this Pita Jungle location. The food is always on point. The servers have always been attentive, well informed on all the different dishes & very efficient as well.  Jocelyn was our most recent server. This young woman went far above & beyond in making our dining experience feel so personable. Robin had us laughing out loud with her witty sense of humor & great personality. Her section was very busy but she still treated us as if we were her only table.    Menu wise, we like to try different foods each time we dine here. None of the dishes have ever been disappointing.  Great job to Jocelyn & the entire team at Pita Jungle!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rMUT-KhIfD2OVeszXH281g"
  },
  "_MwCeRjyc-Gbjpqn24R8iA": {
    "date": "3/9/2019",
    "text": "Was a surprise find. Thought the place would be a lot smaller. The food was good. The ambience pleasant.   The server was friendly and attentive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HgvjDfITtOwb-tTCu15-KA"
  },
  "MCAqEFMzi5I3nPmCeV9jfw": {
    "date": "6/24/2019",
    "text": "The food is \"okay\" but the chicken was way, way overcooked and dry. Also, the customer service was sub par, for example:  When I arrived and asked about my pick up order, the hostess said \"check in at that desk\" pointing to the back, but I immediately noticed there was nobody there, so I asked if she could go grab someone so I don't have to sit, and she was clearly not happy about that and sort of froze, then said, \"oh, I am sure she will be back soon\" but of course she wasn't, so I asked again, \"can you please step in and get me someone that can ring me up so I can pick up my food\" (since I knew it was already ready).   She said \"um, you can try going to the bar and they can help you.\" It was funny how little she or the other host understood or cared about my situation. I was thinking \"isn't every customer ALL of your responsibility?\" and it's not like they were doing anything, i.e. nobody else was waiting to be seated. I hope it's just a training issue, and can be fixed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l8-If5KB4N3hY2mLskIkeA"
  },
  "0p6u1_qWMAwjp5w0hWXEWA": {
    "date": "3/13/2019",
    "text": "I had the yellowfin tuna with honey sesame on bed of greens and I was in heaven!!!  The tuna was seared on both sides which encrusted the sesame seeds with honey to the fish.  The portion was big and I was stuffed after I finished eating. I can foresee I'm going to have problems trying other dishes there after having the yellowfin.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uuSglw0iYYcPmpzcNPBezw"
  },
  "Xx9JFmdQfVKOA5f85RnQhg": {
    "date": "3/28/2012",
    "text": "I love Pita Jungle.  There's no denying that. If you read nothing else in this review, read this: Do NOT go to PJ on a Saturday for another couple months.  It is CHAOS.  Now that is out of the way, on with the review.  SERVICE: My server, Ahkil (pronounced like Shaquille, as he pointed out), was friendly, on top of things and as patient with the kitchen as humanly possible.  KITCHEN: The kitchen was so far behind that our order of two Mediterranean Roasted Chicken Pitas, which take no more than 10 minutes at every other PJ, took more than 50 minutes to get to us.  FIFTY.  That is FIVE TIMES the normal amount of time (for you math-challenged Yelpers).  BACK TO SERVICE: When we were seated, Ahkil stopped by immediately and said \"I will be right back.  I have to check on some food for the starving kids at the table behind you.\"  A-OK in my book.  Hungry kids = cranky kids.  I know this for a fact.    Later, when DH and I were starting to become the cranky kids, Ahkil asked the kitchen to make us ANYTHING (we found this out later).  I saw that the table next to us got a free order of hummus for waiting so long.  When one of the servers stopped by our table and asked if we wanted complimentary hummus and chicken while we waited for our food (at about 35 minutes in), I practically KISSED her.   DESIGN: I love the new dining room.  Above the kitchen there is an art piece that is reminiscent of the rolled magazine vase on the host stand.  Very cool.  The bar has what appears to be a \"color me in\" wall.  There are a lot of different lampshades hanging from the ceiling in the dining room.  The ducts are exposed and painted white.    FOOD: Typical PJ food, which is to say... AWESOME.  Of course, for some reason the chicken in my pita was cold.  I can't figure that out since it took so long to make it that I thought someone was actually PLUCKING the chicken.  Still, it was yummy and I ate everything except for the appetizer (which was redundant since we got the free \"please don't walk out\" app from the kitchen.  Let me reiterate: Let this place have a few months to slow down so they can figure out how to accommodate all those orders.  In the meantime, I will get my PJ fix at the Tempe location.  The first is really always the best anyway.  ;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VkUntKTpJIz5Z3f2dsuEVA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Sadly, this hummus was 1/3 its usual size. There was not even a tsp sized portion of the cilantro/jalapeno hummus.  $1",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VkUntKTpJIz5Z3f2dsuEVA/o.jpg"
      },
      {
        "img_id": "50Oo8PjdyZVoVFaZV898Sw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. This is how the kids meal should look - take note 3rd Ave PJ!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/50Oo8PjdyZVoVFaZV898Sw/o.jpg"
      },
      {
        "img_id": "c9a_eWJ5-aIhj6RHu_mi_A",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Dining room and bar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c9a_eWJ5-aIhj6RHu_mi_A/o.jpg"
      }
    ],
    "user_id": "_jjbwHWLFA5GjWFWGLj4ZQ"
  },
  "T3mWq_7W6vQm0Br23kM5zg": {
    "date": "4/16/2012",
    "text": "This is one of the new locations, love the \"newest\".  The server was awesome!!!  I ordered the hummus with chicken.  It was good.  Why 5 stars?  The server refilled our drinks into togo cups when we are getting ready to leave.  +++++",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "iDlkZO2iILS8Jwfdy7DP9A"
  },
  "FKo1iuCN7i20DDuBIZ01aw": {
    "date": "7/18/2016",
    "text": "Friendly and attractive staff, quick service and consistent quality. I would absolutely recommend this location of pita jungle. Try the tea lemonade and the seared ahi tuna and humus dish",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ZrJ0Fst8QaJI-xZyHoRXQ"
  },
  "tzEUAJ5m9GUudGQh_xaLmg": {
    "date": "5/13/2016",
    "text": "Amazing chicken pasta meal. I forget the name but it's amazing it has a Zesty dressing with lime and juicy chicken and hefty pasta. Delicious!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmtrtjMJwhIvrU8xk-RUfg"
  },
  "CMOdy9fOt8E-nr4cayq_JA": {
    "date": "9/29/2016",
    "text": "I have enjoyed this Pita Jungle location for years.  The food is a 5 Star rated and alway fresh quality.  The problem has been with the wait staff honoring happy hour and having issues with my order of house wine on 3 separate occasions.  1) The first time I was told I had to ask for the happy hour price and was charged full price. I asked for a manger and was told the adjustment could be made. 2) Another time I was told they were out of house wine. 3)  Two weeks later I was told they do not have reverse happy hour on wine any longer and was given a wine list.  Watch out for upsales and check your bill as the errors I found were in their favor.  Review your bill before you pay and don't feel pressured ordering something you don't want.  I enjoy a good full body wine but on these 3 occasions the house table wine was sufficient for my meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CoOFjudo15N1BsLAdOrV3g"
  },
  "KbzZNFsZlSIFjDD-GPRhOw": {
    "date": "11/4/2016",
    "text": "I love this Pita Jungle! It's right on the lake, the food and service are great and the atmosphere is relaxing. My favorite dish is the roasted cauliflower and the grilled chicken/baba ganoush entree. Yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wb7gD_OuRNplpQvR1PXBlQ"
  },
  "aN98I_eee94kBCDj6FAeYw": {
    "date": "7/9/2017",
    "text": "I've been eating at this place for years now. Today was the first time I got food poisoning from a salad. I've never had a problem eating here until now. I just hope the cooks really aren't being careless now.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V1q_I9E4of_31YmUrqepew"
  },
  "b3hsHe8__vVlGRhAk5jrYw": {
    "date": "1/9/2016",
    "text": "I dont eat here often as I mainly just do pick up orders.  Jaimie (spelling?) Helped me out tonight and she was great!  My order was a little slow coming out but she kept me posted, offered me water and was just the ultimate professional.  Glad she works at the PJ I visot the most.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wqd3mWZBAO6rQT-BISy3Vw"
  },
  "zfFYSkL4APg147pY9ss1qw": {
    "date": "4/4/2012",
    "text": "So happy to have a Pita Jungle in Ahwatukee.  Went yesterday (Tuesday) and it was very busy for a late lunch crowd. Great view of South Mountain from the patio.  We went during happy hour they have tapas for 1, 2 and 3 dollars speaking my frugal language..... the tomato mozzarella.... FRESH and tasty.  Small but perfect for starters. I normally order the fruit and cheese plate served as a meal but we order as an appetizer then I get the pita pizza perfect for kids or for someone that has devoured half a cheese and fruit platter on her own.    For my husbands birthday they let us bring in a cake ( most restaurants will not allow at all or will charge a plate  / serving fee) no singing...... they are not that kind of restaurant....  my husband would have divorced me if people came out singing and clapping happy happy birthday to our guest.    Great experience LOVE the eclectic decor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hj20fg3vyzKnJwnLn_rMqw"
  },
  "S3EVgZyGn65qDsOhZ5eS2g": {
    "date": "5/19/2014",
    "text": "I love pita jungle. They have great food! And good service too. This is a pretty big location with a bar and outdoor seating. They hummus, chicken and Greek pitas and delicious! I highly recommend the cilantro jalapeno hummus with chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PzynNKLXPtx1bUBNRnZtEg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Chicken &amp;amp; cilantro jalapeño Hummus appetizer. So yummy!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PzynNKLXPtx1bUBNRnZtEg/o.jpg"
      },
      {
        "img_id": "VZ9-bt9SoJszeDAYASG6Pg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Chicken &amp;amp; cilantro jalapeño Hummus appetizer. So yummy!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VZ9-bt9SoJszeDAYASG6Pg/o.jpg"
      },
      {
        "img_id": "ZgR1mGXTIKcuw-0VU0f7UA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Cran&amp;#39;Fizz (cranberry infused vodka &amp;amp; champange) delish!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZgR1mGXTIKcuw-0VU0f7UA/o.jpg"
      }
    ],
    "user_id": "CSrq168peLxtoKYDrCkDYA"
  },
  "qB4tQ3ewnBQngQoY7HNJIA": {
    "date": "2/28/2016",
    "text": "Pita Jungle has to be one of my favorite restaurants in all of Arizona. It's probably the non-chain restaurant that I have been to the most. Whenever I have out of state friends come in, we always go to Pita Jungle and no one leaves disappointed. I normally always get the grilled chicken with hummus as my entree (it's on the appetizer menu) and I substitute the white hummus for their garlic dip. Their lemonade is also amazing. I have been to many locations all across the Valley (Ahwatukee, original Tempe, Ray & Dobson, downtown, Fashion Square, MCC, Dana Park, Williams Field) and they are all consistent in my opinion. Overall the menu at Pita Jungle is on the healthy side, but that doesn't mean it's not delicious. I would definitely recommend giving Pita Jungle a shot if you've never been here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "d8G1W648S6UeHehQUdBqfQ"
  },
  "WnM0M3UWVv1crjaodBqxww": {
    "date": "8/30/2017",
    "text": "the food is usually fantastic but ever sense they began brunch the service is just awful! I will not be making a trip back there for a long while",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-QLyUqUWaAAOFf_9t3YVjg"
  },
  "ztAyTvKciJMquePUGdBzmQ": {
    "date": "8/28/2017",
    "text": "This place has a ton of options, I never would have tried this place based on the name alone but it was a suggestion of a co-worker of mine. I was actually surprised at the menu. Tons of Mediterranean type options. I like the vegetarian choices. The service was decent.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gQlGDbA3S4Rgze88jiL9ew"
  },
  "WwNlWIpXYy-guGsQ88AoLg": {
    "date": "2/21/2015",
    "text": "Ok so I have been going here for a long time and just never got around to a review for some reason.  This is a great place to eat. The food is always hot and fresh. The staff is great and the atmosphere is casual and fun.  I highly recommend this place for lunch. Have the philly pita or the Schwarma   You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h7lcWmavQNi3nwanELz51g",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Philly pita.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h7lcWmavQNi3nwanELz51g/o.jpg"
      }
    ],
    "user_id": "p6dzzYSa_c64PtkZd_wGWA"
  },
  "3-mqGyeX6Ha59coSOgXstg": {
    "date": "1/21/2014",
    "text": "This place is awesome;  everything we ordered was spot on and delicious.  The patio was a nice size but unfortunately had no sun!  They lose a star because they were understaffed and made people wait when there were available tables.  Also they could afford to carry a little better of a beer selection.  I'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "QGX5wOzqUxnfd8sePiNQWA"
  },
  "SqkbHsh6iwPNfIhFb79pow": {
    "date": "5/30/2016",
    "text": "Came to eat after the movies with the kiddos and my fiance waited for 15 minutes and still no service.  Waiters walked by us and served people after us. Told the manager my frustrations he offered a gift card but at this point the damage was done.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l7narnzYnOivpwaHsM594w"
  },
  "qZ4xQ8qZSPCJsBZpSOIUAg": {
    "date": "10/22/2015",
    "text": "The hummus trio con pollo and pollo shawarma pita (per Stephanie) were great.  Nice beer list + happy hour.  4 thumbs up  + 1 big toe up = 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "LRo8nXyXIEGZXr281Wjxlw"
  },
  "eC_5x-ErhgU2t4KlVKgmtw": {
    "date": "3/23/2014",
    "text": "3.5 Service was okay. It was really busy so the server forgot a few things, but she always apologized.   We had ordered hummus with seared ahi tuna. Hummus was okay & the tuna (separately) was okay considering this type of restaurant, but the tuna & hummus was a weird combo. The portion is pretty large. The chipotle black bean burger was the other dish that was ordered, and it was good ($8).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qjrn5UsK2HBZxx40HYA1iQ"
  },
  "iTQXEKDsBJizETBbVSMkHQ": {
    "date": "8/7/2016",
    "text": "Always great service and very nice atmosphere. They have a nice beer and wine selection and I love going for their late night happy hour. My favorites are the shrimp and hummus and for lunch I love the buccaneer and the Thai soup. The hostess today was very friendly and professional:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XHXqJvulbNhRV0UbNel5FA"
  },
  "xOk10v8gJ3IJGt5JeY4Xbw": {
    "date": "7/28/2014",
    "text": "The Ahwatukee location is much larger and louder at lunch.  Service was great.  I love the art on the walls.  I enjoyed my cilantro jalapeno hummus and grilled vegetables.  Always been a fan since I went to ASU and went to the Tempe location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r9tjKaqLvLKF7PvDnUsFnA"
  },
  "DgDXNfNidZUFoojA2-JMFg": {
    "date": "7/10/2012",
    "text": "Very cool laid back vibe. Everyone is very nice and personable. The Red Pepper Hummus is very tasty ( ask for an extra pita) We had a Gyro and Stir Fry with Shrimp. Both were very tasty. We will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VXluaYeaDKxPunJG_bdSZg"
  },
  "yk6iDooDWFCCKmM2v2NiGQ": {
    "date": "3/14/2012",
    "text": "Ahwatukee we scored!  Yes, a Pita Jungle in our own neighborhood!  Went tonight with husband and some friends, the food AMAZING, the service, EXCELLENT!  A special thank you to Tanisha our server!  She made some great recommendations and answered all our needs tonight!  Welcome to the neighborhood Pita Jungle!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2wpX7wMgQhPTtvlzumFCoQ"
  },
  "9ixMi0_dgALDy3YmTHP7bw": {
    "date": "9/11/2015",
    "text": "They no longer allow dogs on the Patio. Uncle Bear's next door does.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hEXAtJQUJE8r5NrMgon0g"
  },
  "cYDceaQJpPSb5VUO3Yt_MA": {
    "date": "2/16/2014",
    "text": "We love the Pita Jungle on Ray & Dobson in Mesa, so when were in the neighbor we stopped at the E Ray Rd Pita Jungle.   The site needs some very serious management attention.  We arrived for a very late lunch and while they were not busy, they had a long wait list.  There were several tables for two available and I asked if we could be seated at one of them and the young man seating people said I would need to wait until he seated some of the larger groups.  We waited about 15 minutes (Not horrible) and then he seated us at the table I originally asked for.   We waited over 15 minutes for the waitress to take our order and then another 35 minutes for our salad and black bean burger both with iced tea to come.   The gentleman at the table next to us vocally said he would need to get up and hunt down the waitress to get their check.  After our food arrived (It was well prepared and tasted good) a different table got up and started to leave.  They were stopped by an employee and they told them they waited over 15 minutes for someone to come and take their order and that they were going to the Mellow Mushroom and had received bad service here before and we never be back to try it again.   After they left the waiter for the table came and asked the employee what happened and he said \"They waited  3 or 4 minutes and left\"  Total LIE!  We love Pita Jungle but will never try this location again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oey9qRf5EcTToRHy3_4wjw"
  },
  "cfCmy_C4Bh3ucplY9QFUew": {
    "date": "6/6/2012",
    "text": "Always a classic. Pretty consistent, great prices. good food. The service could improve, though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LnnYSUlw_MVdtoYUt4oZ5g"
  },
  "MB2Ik0MmgyRnI5hqfBM20g": {
    "date": "6/22/2012",
    "text": "Love Pita Jungle!! Absolutely request Samantha..she is an amazing server!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_iOxBbbJvTuwADNOyixFvA"
  },
  "CD3LFGvXcqjEnSRThxkWjw": {
    "date": "2/27/2013",
    "text": "We had a great experience at this Pita Jungle!  We love the food and the atmosphere.  We had great service and what an affordable Happy Hour from 3-5PM Monday -Friday.  I really enjoyed the Pineapple Margarita's!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1h4O0kQ9AqNb6d64mibmUw"
  },
  "lNrPteOecgBPwSe3haww-Q": {
    "date": "1/1/2015",
    "text": "My girlfriend and I stopped in today because we were in the mood for something healthy. I ordered the broiled fish sandwich because I wanted to try something new. Should've stuck with my usual fare because the sandwich is the worst thing I've ever ordered from there. The fish was only cooked and crispy on one side and the other side actually had a fishy smell which I've never encountered with cooked fish before. There really wasn't a lot of seasoning on the fish and was totally overpowered by the dry wheat bun that it was served in. The potatoes didn't have a lot of seasoning and were very bland. My girlfriend had a better experience with the falafel salad and really liked it. If and when we go back, I certainly will not be ordering that sandwich again, nor anything that's paired with the mahi mahi. Our waitress was excellent and very accommodating. The downtown location is always more consistent in regards to excellent service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PGOY-ncw_bfJ8wdkJY1ETA"
  },
  "gB4sjl7ywSNqd-eePLjSeQ": {
    "date": "9/28/2012",
    "text": "If I could eat pita jungle every day I WOULD!!! My favorite things to order are jalapeno cilantro hummus with chicken, the Greek salad, the mahi mahi dish, and the chicken shwarma.  Great happy hour here and the menu isn't expensive.  Love love love some pita jungle!!!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UedTLWb7nCVJHiZkuBs2iQ"
  },
  "OrKtulinaj_UV-ciCEK6sg": {
    "date": "5/28/2012",
    "text": "YOU GOTTA GO!!  I have been there several times - each experience has been wonderful - friendly staff, great food, great price!! This last time, our waiter SAM was funny and professional and AKHIL... what can I say about AKHIL.. he noticed that we ordered hummas and didnt have any \"green stuff\" (cilantro jalapeno hummus) and asked if we wanted to try it.. brought us a sample... YUM!!!! (now my very favorite - the hummus and AKHIL - lol) he also made a kind remark when he noticed that the \"green stuff\" came on my mahi mahi plate (something to the effect of \"nice choice - I hope you like it\")... it goes without saying that I LOVE this place, the people are all so friendly and fun!! KUDOS to you all for making my experience something other than good food at a good price.. which is the case.. and if that weren't enough, in addition -  the people, the fun, and the service are EXCELLENT!!!  FAVORITES: Cilantro Jalapeno Hummus, Mahi Mahi Plate, Tropical Fruit Salad",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kADMdnV7op1U9PWzab0Stw"
  },
  "eUjHE0-AMkg6IMO1dL6ofA": {
    "date": "11/4/2012",
    "text": "Excellent food, and great service. The portions were large and very tasty. We had the 3 hummus and chicken, and spanakopita which were both excellent and the Mediterranean plate was huge and great. Kind of an American-Southwestern-Middle Eastern fusion kind of place and vegetarian friendly. My new favorite restaurant for when I visit Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EFe-NAt9fKlu57iJSrpa0A"
  },
  "7YdQKRRD_ReqSV7z5LjlJw": {
    "date": "3/25/2013",
    "text": "Really fast service, even during a really busy time. Great specials, always something to eat/drink that's worth trying. Their happy hour is nice, but their prices are low to begin with. All around super convenient but really tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HWF4hfCN2YinguesPp-4hA"
  },
  "1EOGbl0CPEiqtVx1p236SQ": {
    "date": "6/20/2015",
    "text": "This place has the best food and great service. Their Lentil Fatoosh salad is so delicious I order it every time in addition to anything else and just  take it home to eat later because I can't get enough.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ACyCXhww30a9P1zHc7NVHw"
  },
  "xAQ0eo7gY3otxSm-DlQU-g": {
    "date": "1/17/2015",
    "text": "This is my favorite Pita Jungle location! The staff is so friendly and accommodating and the food is delicious of course! I love coming here whenever I am in Ahwatukee!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wdHdC71sjvigipqUiXZ11w"
  },
  "88x4Yv7A2OfXY9AtnA3M3Q": {
    "date": "8/29/2012",
    "text": "I absolutely love pita jungle the service is always pleasant and the waiters are so helpful and educated on the food and menu. The food is amazing! Always fresh and tasty. Iv been to three different locations and I'd say I'm very happy with all iv been to. If your coming for lunch I'd suggest getting here a bit before noon or call for take away because they get busy! Also prices can run a little high but definitely worth the treat :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jEG_kO7nqBA97n2beBSkhg"
  },
  "dKWl-2slhKzvp0-El2g-Aw": {
    "date": "9/26/2012",
    "text": "We love all the Pita Jungle locations but this one on Ray Road has become our favorite. the Chicken Del Sol is amazing, the wraps and salads are realllly good. the only thing better than the food is the amazing service.,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uLDyS6-t01znJiU0ixrGLA"
  },
  "6hoOLl7FiXFMplgJpsff3Q": {
    "date": "5/22/2015",
    "text": "Best salmon and amazing hummus. No bad foods here! Only downside is everyone knows how great they are so sometimes a wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7EpkF4ELJWWGXFmaGtpMSA"
  },
  "HYSgiMVf2sZ_1aJqQp5fHQ": {
    "date": "3/5/2012",
    "text": "Pita Jungle is incredible! Every location I've been to is clean, professional, healthy! A HIGH Recommend!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_8-sxLc56n2YxhDAEYjmJA"
  },
  "sss_iki8ZMTT16yRS8lOtw": {
    "date": "10/4/2012",
    "text": "I've been to two other Pita Jungle locations, and was excited that one finally opened in Ahwatukee.  I've been here six or seven times, and the food quality has not been up to snuff.  Last night I ordered the portabella burger.  Portabella was overdone, shriveled, with no taste, and the garlic potatoes, which I usually can't get enough of, were inedible and left on the plate.  Last time here I ordered the chipotle black bean burger, which was fairly tasteless.  My husband got the ginger noodles on both occasions, and they were fair.  Service at the bar is good, but I don't think we will be back here soon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Da2Uq20jkrBkpx0exMe7Qg"
  },
  "BsNbJXd7s-rUB-2l8y-YVQ": {
    "date": "11/23/2012",
    "text": "Was there with my daughter the other night and got the chicken pasta salad. Not sure what they did different but it was seriously the best chicken I think I have ever had!  Super moist and garlicky!  I love pita jungle and not just because my daughter worked there and all the staff are fabulous and attentive!  Ask for Valerie when you go,she is my favorite waitress!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ktzZaLuYHNGc6Vf5wxzEug"
  },
  "3B4eGD_Pmltv3ErIlj_-9Q": {
    "date": "6/22/2018",
    "text": "Love this place. Friendly atmosphere with good quality food. Very comfortable and happy hours are a great catch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JcrXanXg6CtBEazT60clkg"
  },
  "hanKbR-XGvetQ0lggoVwWA": {
    "date": "8/14/2017",
    "text": "Came here for lunch today and we (myself and a co-worker) were seated promptly in the very back corner. It took about 10 minutes for us to received any type of service. By that point we had already decided what we were going to eat as well as drink. There were 3 other tables seated after us, all of which received their food before ours. We ordered a gyro and spanakopita, and 2 waters. our waitress finally came back to us and said that they burned the spanakopita therefore they had to remake it. She then came back a second time and said that there were onions and tomatoes in my gyro (which I had asked to please leave off due to an allergy), so they had to remake that. We FINALLY received our meals and my gyro meat was burned. It was burned so badly that it just shattered into crumbles when I was trying to pick those parts off. I was sadly disappointed but didn't have the time to send it back. So I ate what I could.   Needless to say, it's not our waitress' fault but I couldn't eat half my gyro because I couldn't chew it and the time to get everything was terrible. I won't be heading back to this Pita Jungle though for lunch - no sense of urgency nor a sense of how to cook gyro meat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GwA_RuxXF0JGiFihx7_pYA"
  },
  "f4ZiTczPXMJcZYalMlsf4A": {
    "date": "4/25/2015",
    "text": "Found a surprising little fact if you are in a brunch mode. They have great bloody Mary's! A stealthy fun day drinking spot. Most come for the hummus but come and have some chicken and hummus or garlic dip. Great menu. Fun beer selection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "gPBzCRu6-g9vR5PWwKGHYw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Bloody Mary.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gPBzCRu6-g9vR5PWwKGHYw/o.jpg"
      }
    ],
    "user_id": "TSE_ZF_QxXXv7DlCtRCacQ"
  },
  "n81F2dmtHo-1X3_lw8JXIA": {
    "date": "11/11/2016",
    "text": "Great service! I get the chipotle black bean burger all the time. Since i dont eat eggs, i get it without the bun.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "egz0m12INuczFK752CLaWw"
  },
  "07_EwXIqh60_XRGlMQEt-A": {
    "date": "12/6/2017",
    "text": "I love eating here. Great food and lively service. The falafel and hummus are my absolute favorite. Love the atmosphere as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JY7x60yFHUmAp_kE9_ZeJw"
  },
  "nUCct12CwerrV-8axgR13A": {
    "date": "6/22/2017",
    "text": "Happy hour is a good deal at the Pita Jungle. The tapas (small, sharable plates) are tasty. There is a cilantro jalepeno hummus is scrumptious. The pitas could've been warmer/fresher when served.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "amgdPLp1lEphtLiiGiFBjQ"
  },
  "5Afl5Kt89eMSqSQBZWUSjg": {
    "date": "7/1/2017",
    "text": "For healthy, fresh and god food pita jungle never disappoints. They have great variety and something for everyone. Happy hour and tapas menu will fill you up and be budget friendly. Customer service is good. We've been several times, eat here regularly. The last time we were there June 2017 it was clear the kitchen was struggling to keep up (first time ever experienced this). Our server not only acknowledged and apologized for this, but offered a free appetizer. We didn't want anything, but had planned to get a pizza to go so he comped it. Excellent customer service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wUEWWeqNytUKLqwgTdxe7Q"
  },
  "oho6R20ZY5CR1_vPHKVdbA": {
    "date": "11/17/2017",
    "text": "I wanted to thank another employee at this Pita Jungle.  Every time I go in, they are great.  This employee was Brittany on 11/15/2017 at 1230pm.  Brittany came to my table immediately and was so nice.  Every time my ice tea was down about half, she was there to fill it up.  My food came out really fast and when I paid, she was so fast at caring for the bill.  I don't believe anyone could be better at customer service.  She really stood out as someone that really knows how to make customers happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fPP2MDWAzt-O3njoNWXfeA"
  },
  "VNuEqimy9T_5PM6h2P3o_g": {
    "date": "12/21/2014",
    "text": "My family eats here at least once a week. The food is delicious and the service is outstanding. Tabor, the bartender, is always on top of things. Servers Joe and Dennis are great too! All of them are kind to our kids-this is our kids favorite restaurant (and they are picky!). The manager, Mike, is always doing a great job making sure the restaurant is running smoothly.   The kids meals are a great option! For just $5 you get a huge, healthy meal and a drink.   My favorite appetizers are the hummus and falafel. I also really like the baba ghanoush. They have various types of pita too-I prefer the Greek pita. If you are into veggie burgers, you will not be disappointed with theirs. For a great side dish-try the carmelized cauliflower-it is amazing!  If you aren't sure about what to order just ask your server. I haven't had a meal here that I didn't like. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ke6-eR2JMENyFENQnWZ3tA"
  },
  "0tPQc6Fv05sL7nKoNZ5otg": {
    "date": "4/30/2017",
    "text": "Was seated rather quickly. Asked for a high chair for my little one and they said ok, then forgot. Couldn't find anyone to help so had to just go get it myself. They provided us a nice kids menu and coloring pages with crayons. Ordering and receiving food was normal. Server refilled all drinks relatively timely. There was just nothing special about this experience. The food was good and the atmosphere on par with expectations. The staff could be more organized and friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WLQPkSn3g1vONLkl_HSoEQ"
  },
  "mjwn-8jhuadjmlyb9iAMrA": {
    "date": "4/10/2016",
    "text": "Nothing bad to say about this place.   Food: best around for this style of cooking. I love their grilled chicken on the cilantro-jalapeno hummus.    Atmosphere: casual, laid-back, classy  People: staff is great  Prompt, upbeat, attentive.   Price: I feel the cost of my meal is more than fair because the quality of food and service you receive at Pita Jungle, is comparable to that found in higher-end restaurants.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "0VYkLWEPBikRUlttqMxbtQ"
  },
  "6mPxEP9QA_A3iXzlNQmiCQ": {
    "date": "8/13/2017",
    "text": "Love Love love the Greek salad and the dressing that is on it :) it's also a nice touch when they give you a drink to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mEmecgrG_D_ZGrJ3JVErcw"
  },
  "MaMrPG4HOIO5UOy56PfEtw": {
    "date": "10/21/2014",
    "text": "I think I am yelping all the places that I love and/or frequent first. Pita jungle never appealed to me until this location. Now, my household comes here all the time. They have a great happy hour and their food has always been fresh. Also, for all you spicy food lovers out there, Pita Jungle has every popular hot sauce possible. It is great! The staff is wonderful as well (at least the ones I've associated with have been) and they are defiantly healthy. I am glad this Pita Jungle exists.  Food = 4.5 stars  Service = 4 stars  note: this restaurant could improve if they had ranch, TVS, and WIFI.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xVmMOpl1o5TelFBedyj0_w",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Pineapple martini",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xVmMOpl1o5TelFBedyj0_w/o.jpg"
      }
    ],
    "user_id": "8T1T5WOp2QJUAKjfrZ4XEg"
  },
  "tAE4HfuUUhf27v87-v_6Ww": {
    "date": "4/9/2016",
    "text": "I have been living only 6 minutes away from this place. I love pita jungle, it's always been that way. This location is right off the 10, so it's super convenient. Their hummus is the best around. Everything about the entire menu is great. Awesome variety to order from. Staff always super friendly! I will forever come here until I'm tired of it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rGm8NKrjhoqKRx5eJc_3qA"
  },
  "I_sfLYxcNV1-cJd0h7MVQw": {
    "date": "4/4/2018",
    "text": "Industry standard exceeded!!! I had a dining issue at the Pita Jungle on Ray Road, an issue that could occur at most any of our valley eateries, it was service related. I won't spend time with the details, even though I was disappointed with this locations performance on that evening, it was really the recovery that was memorable. I did what most of us would do after a frustrating meal and service experience, I contacted the company through the corporate website and explained my discontent. What occurred next, was a series of  prompt, caring phone calls from the guest relations department, the restaurant general manager and  the Director of Purchasing George Strom. George and I had a frank discussion regarding the opportunities and solutions associated with them. George was genuinely concerned, not listening if the future, but in the present. After our discussion, George ended up refunding the cost of my meal and sent a gift card as well. As much as I appreciated that gesture, more importantly was the time George and his team spent listing to my concerns. George and PITA JUNGLE don't just say they care about the guest, they prove it in their actions which speaks to, and validates a phenomenal culture at PITA JUNGLE, well done and my family and I will again be regular guests at your wonderful establishment! WAY TO GO PITA JUNGLE!!! Signed, A Raving Fan Charles",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bbzvRUSWrBVu7FnmmmH2kw"
  },
  "TEOX614HA4bHK45kvYLn1w": {
    "date": "1/23/2014",
    "text": "So, this was my first time to ANY Pita Jungle location and I found it to be good....But, JUST that....Good.  I had heard many GREAT, stellar raves about this place that I was really wanting and hoping to have my heels topped......But, unfortunately - NOT.    Now, don't get me wrong, the ambiance is cool, the vibe is cool, the service is cool.....the traditional lamb Gyro, was average.  First off, I had to salt the lamb itself a little more than I'd prefer to bring the flavors forward, and the Tzaziki sauce (which I ordered on the side, Thank God) had more sourness hints to it than it should have, and that I've experienced at many other Greek spots (that KILL and take names) on the Gyro I had today.  So, while I probably won't ever go back to PJ (unless I'm forced to by a mob of friends/colleagues), I don't bash its teeth out....I just turn my nose up to it because I know of a much better place that I'll continue to get my Gyro Pita's from - And, that place remains the Champ!...Crazy Jim's - 15th Ave - The Original! :)  Take my word for it - I'm ELITE!!! LOL  Happy Dining!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "mwNug51WDeuu9eScy1L3JA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Traditional Lamb Gyro with Tzaziki Sauce on the Side. Sirracha (sp) for Heat. Black Iced Tea.  *Served as Lunch &amp;amp; Dinner for Me!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mwNug51WDeuu9eScy1L3JA/o.jpg"
      }
    ],
    "user_id": "B0A2Af2F7DRsvdyfz_giOw"
  },
  "qashKkTeKkUgADjS2nDj8g": {
    "date": "3/19/2017",
    "text": "Service was very slow. Had to stop waiter several time to ask for drinks and food. Sauce on salad was very minimal.  Only order side order of humus took over 30 minutes to receive.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "98S0b7UD-CGBGX0f4LPNvQ"
  },
  "NKrhk8E_rIrLhnVKt1Ui8A": {
    "date": "6/4/2017",
    "text": "My only con was that service was a little slow. Food and everything else was great! I went on a week day night for dinner and it was pretty full.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1uL6uwYdDaEb1SoSFd3WpA"
  },
  "Ly2bRPngAmJoTFsRrf-wHQ": {
    "date": "8/14/2017",
    "text": "The food was not fresh AT ALL! I couldn't even eat it, the workers were very nice and friendly but I was so disappointed, I've heard great things about Pita Jungle, this was my first time. I ordered a Mediterranean wrap and it was nasty. Not eatable.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E01D3RSm4VVj_Dxrp1eDbw"
  },
  "oD3DVcHBfjkbBfwgObteKw": {
    "date": "8/6/2017",
    "text": "Love Pita Jungle but my experience at this location was horrible...got my order wrong and was just a very unpleasant experience....the lady at the table next to me returned her order because she found a hair in it...gross...  They also have out of date information on their website....looked at their online  brunch menu before I went but when I got there, the menu was different and they didn't have the dish I wanted. Epic Fail.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_b7lNrXb-a9CaFuPVgB05Q"
  },
  "ofbDg9HMm5yoASGe_zgzfg": {
    "date": "12/1/2015",
    "text": "Met a friend here for lunch Saturday. For starters we shared a small roasted bell pepper hummus. She had a Falafel Pita and I had chicken tikka masala and we sampled each other's. We decided all the food we had was good. We had really good service, especially as we had a 2 hour lunch. We never felt hurried even as it got busy later on. The decor was nice, a mixture of different size tables that they were moving around to accommodate different size groups and some high tops and a community table. They have a nice patio but it was a bit chilly to eat out there in the shade. Just as we were leaving we noticed the lamp shades and bicycles hanging from the ceiling.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "t58HzFioXdL4jEit0zhWVQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Chicken Tikka Masala",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t58HzFioXdL4jEit0zhWVQ/o.jpg"
      }
    ],
    "user_id": "Z128ihQea7BLPh2T9q9sKA"
  },
  "-ABxT7G83Si4w0FneYVsKg": {
    "date": "4/25/2017",
    "text": "Food always consistent and delicious. Service always great.  Hummus choices are awesome. Delicious flatbreads and salads. A fabulous lunch spot",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XPTsmTZqvWbvlMwboks7Hw"
  },
  "rZ2IneIIJG4tOwErY3Q0kQ": {
    "date": "11/18/2015",
    "text": "I've come here once a month for the past couple months and just like other pita jungle locations, I always really like the food and the service.   I had Jennifer today as my server and she was really nice! I ordered the buccaneer wrap (spicy chicken with curry sauce and a side salad is what it comes with) and it was divine. I usually get the hummus trip because I love their shawarma, but dared to be a bit different today and it definitely paid off.  It's a bit cold in this location but I like the open floor plan quite a bit, it's great for people watching.  Will definitely bring friends in for happy hour sometime, because their specials are pretty great.   Thanks Pita! You're a keeper for The Tukee!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "ICw4trkmmulxI-SwmY0yiQ"
  },
  "-l1lIMM7arXqP-vZCzpxZQ": {
    "date": "1/10/2018",
    "text": "Love this place. Lots of options for your vegan and vegetarian as well. The have a regular happy hour as well as a reverse later in the evening for cocktails as well as appetizers. They have a rotating special menu as well as a good selection of craft beers",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MEmJHiXtNOesJXmjNHwPhw"
  },
  "1h2b4UFoopjZmq_4owsNww": {
    "date": "5/31/2018",
    "text": "Ordered through Yelp, delivery by GrubHub.  No complaints w/ either of those services only w/ the food.  Cauliflower was warm only not roasted or wood-fired and hummus w/ chicken was completely missing the pine nuts.  Will NEVER order take from Pita Jungle again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KF5LP_K_3EgoYZ1cGWKA8A"
  },
  "pqrCrCd2etd3L8LRzdNrDg": {
    "date": "7/24/2017",
    "text": "Awesome food! I'm never disappointed whenever I order in or to go. I love the house special Blackbean burger and potatoes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ScRUkS54m-5vh_spGbWOfw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Blackbean burger and potatoes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ScRUkS54m-5vh_spGbWOfw/o.jpg"
      },
      {
        "img_id": "zh-KUF4RATE3H1OBblC0nw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Blackbean burger and potatoes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zh-KUF4RATE3H1OBblC0nw/o.jpg"
      }
    ],
    "user_id": "Jv7tSYZRce0CdBw5keE0zw"
  },
  "HgFkcqfokdXhkS2yq1GyDA": {
    "date": "2/28/2016",
    "text": "Love the food at this Pita Jungle. It's consistently good, every time!   It's strange how different locations vary in terms of quality.. I really don't care for the Pita Jungle closest to my house, for various reasons, but this one I will keep coming back for.   My favorite dish is the Lentil Fatoosh salad and it is very delicious! It's quite a hearty salad, piled high with lentils, rice, cucumbers, tomatoes, and caramelized onions (my fave!), and did I mention the fried pita bread on the side!? (It's really the best part of the salad, IMO!) It's the type of salad that leaves you full, but wanting more bites of it! Not many salads have that effect on me! ;)   Service is always really great too! I don't think I've ever had one bad experience here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "b5-bCtvbvj65vT10UBz_PQ"
  },
  "aTUL45jHOKtQe5D9J87k3Q": {
    "date": "4/19/2016",
    "text": "Love the Salmon, great and amount if food was just right. Pita chips and Tzatziki -  10 Coconut Curry Soup - 10 Grilled Salmon -10    Service from Jamie outstanding!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "atFhVJIjRV3-IwfYupvZUw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/atFhVJIjRV3-IwfYupvZUw/o.jpg"
      },
      {
        "img_id": "5iSoAq5SL-BG9uBjWlbpDQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5iSoAq5SL-BG9uBjWlbpDQ/o.jpg"
      }
    ],
    "user_id": "lnTpZX2zCqC6UEpX0CSaGw"
  },
  "gzB5QyLs74u5M5s2HXIZgw": {
    "date": "8/25/2015",
    "text": "Delicious and healthy - I love to eat here for any reason! Recently, my coworkers and I have been to Pita Jungle for a slew of work-related celebrations. Everyone can find something that suits them on the menu and they even have yummy cocktails and a bar at this location. Hummus anyone? Yes, please! I'm a big fan of the tzatziki, the Philly Chicken Pita and Mahi Mahi with Pita Chips.    Tip - if you are dining in for lunch either get there early to avoid the lunch rush or opt for a later lunch. This place gets slammed and sometimes you have to wait for a table. No complaints from me though, I enjoy walking around admiring their local artists work on display.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "c_NY3DFV5_MBtYa0ppN_Kw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Sweet sea turtle chalk drawing",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/c_NY3DFV5_MBtYa0ppN_Kw/o.jpg"
      },
      {
        "img_id": "5uqcX-OLYNz8FsmRDiD4UA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. White sangria",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5uqcX-OLYNz8FsmRDiD4UA/o.jpg"
      }
    ],
    "user_id": "_9WKSGfBn193Wl3vd7kt1A"
  },
  "TczcSgK_ph_E06BRQolG2Q": {
    "date": "3/7/2017",
    "text": "Spinach and Pesto Pizza is bomb dot com!  They have great service, too. We came on a business lunch and our leftovers were prepared in boxes for us and they gave us to-go drinks! Gotta try their iced teas, by the way.   Only complaint is parking which is no fault of Pita Jungle. It's almost impossible to find a good spot like....at any point in the week. Ugh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t6uAOJHnui8zl2-PJ9m_Jw"
  },
  "geAnyVa8Pd14mwwCWhAnmw": {
    "date": "4/22/2017",
    "text": "We were told there is a 15-20 minute wait while half of the restaurant was empty.   The rude hostess told us because tables were not clean. Although they were all set with new silverware. Not sure if this is etiquette for restaurants..??..??   Keith out server. Awesome.   Food, good as usual. Won't go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XlqA1xvmQJtnn4r9MGCezw"
  },
  "fgDLBt0RkNVUoVwjr-hReQ": {
    "date": "8/29/2015",
    "text": "The Pita Jungle has delicious but healthy food.  My son 8 year old  is the one who originally  turned to this place.  They even offer healthy meals for kids and educate them on how to eat healthy.  I need to make sure to visit the Pita Jungle more often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ypiSKddCv8FQlL5NV1hzyg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ypiSKddCv8FQlL5NV1hzyg/o.jpg"
      }
    ],
    "user_id": "67HwuY1mtttvvnqn9tHU0Q"
  },
  "JjEFSwss3XCV1eZ2G2BmrA": {
    "date": "3/2/2017",
    "text": "I'm just not a fan of this place. I wanted to like it, I came 3 or 4 times trying different things off the menu - veggie burgers, salad, pitas - but just wasn't impressed. I love the healthy concept but the flavor just isn't there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7I8fbJe02Z4ZE3J2-kEQHQ",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. chipotle black bean burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7I8fbJe02Z4ZE3J2-kEQHQ/o.jpg"
      }
    ],
    "user_id": "IaFTkW1cvQe_Tf-k2_JCoQ"
  },
  "orEd0on2fgQU2m-OVxcILQ": {
    "date": "11/16/2016",
    "text": "We love Pita Jungle!!!! Stephanie is the best bartender we have ever had.. So good that we actually eat dinner at the bar to sit under her service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2IztLTOD4tEpUXkPqekEtg"
  },
  "l-23EDOwpVQoi6mPHDlYDg": {
    "date": "7/19/2018",
    "text": "Too old for all the tattoos and piercings. The food is very good and a nice selection of craft beers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KeXFFcXHhPmKRso-vgQ-wQ"
  },
  "8t4HvSi-_gTWMSrBXEKblw": {
    "date": "3/11/2018",
    "text": "By far one of our favorite restaurants. It is consistently good with so many options. The menu is big and I've never had something I didn't like! Their hummus is so delicious and their garlic dip is amazing. They also give you huge to go cups of whatever you're drinking! The iced tea- any flavor is so good. I think the prices are very reasonable as well. Great happy hour as well! My go to is the Mediterranean roasted Chicken shawarma as a bowl with brown rice.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7lQCnsSgx2WjtVak1h8GOg"
  },
  "cCOz4Bz0e8T4uWvF6SViaw": {
    "date": "12/24/2017",
    "text": "Always solid...never had anything I didn't enjoy! Humus is delicious and chicken Schuarma always does it for me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fHdjvG-_4bg-tnRyPr26DQ"
  },
  "BuEZ0JppYGk7YxZ-YD6-GQ": {
    "date": "11/23/2016",
    "text": "The manager Dave did a great job at taking care of us. He did exactly what he is supposed to do as a manager. Will go back here because of him.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8PL8qGpLgCeh_2z4MgHaag"
  },
  "bc000l-y6xYv5iojgGKMOw": {
    "date": "3/5/2013",
    "text": "So some for their lunch time crave hamburgers or sandwiches, but me, sometimes I crave pita bread & shawarma with tahini  and arabic pickles. Some coworkers where headed to Pita Jungle for lunch and I thought it would be  perfect time to try them out, get what I was craving and see how they are, so I placed my order.  I ordered the chicken shawarma pita with tahini & garlic sauce, pickles, tomatoes, onions & some mixed greens, Omg it was just what I wanted. The garlic sauce was not too over powering but you could tell it was there. My friend makes the best garlic sauce made with 40 cloves of garlic it's my favorite stuff, but for days you just sweat out garlic , but keep the vampires away, but this garlic sauce, it was perfect, hint of garlic to let you know it was their but not enough to offend anyone near you.  The pita bread was the perfect texture and the chicken was perfectly seasoned and cooked. This was a good shawarma pita wrap.  Happy to add Pita Jungle to my lunch rotation.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "4KBU0HkUsRc2L9ynnF59tA",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Garlic potatoes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4KBU0HkUsRc2L9ynnF59tA/o.jpg"
      },
      {
        "img_id": "qD8300Ls9KZHjk7gsplTPw",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qD8300Ls9KZHjk7gsplTPw/o.jpg"
      },
      {
        "img_id": "neGKngVbCb7gv3Wt4i98Cg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States. Chicken Shawarma Pita",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/neGKngVbCb7gv3Wt4i98Cg/o.jpg"
      }
    ],
    "user_id": "bpgbVPJcG-wQ4cNBcPPIxw"
  },
  "F70tnfm9r-BTFu64RkM4Zw": {
    "date": "11/30/2017",
    "text": "Normally pita jungle is so good but I got takeout tonight and the chicken looks like it's saturated in Taco Bell mild sauce and the veggies are burnt yet undercooked. I'm so irritated.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "id-Xq8q1f0e_WnL_Ql60qg",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/id-Xq8q1f0e_WnL_Ql60qg/o.jpg"
      },
      {
        "img_id": "j1Khci5Pjs9o-y_8GRXV6w",
        "caption": "Photo of Pita Jungle - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j1Khci5Pjs9o-y_8GRXV6w/o.jpg"
      }
    ],
    "user_id": "4OuY8zCZ6LoiQNpMtE802A"
  },
  "3TWwHbBa0YpNVjt5D1NQKQ": {
    "date": "5/19/2015",
    "text": "Absolutely horrible, got here they said it would be a 5 min wait I saw over 5 open tables, after 20 minutes of waiting I finally got seated then it took our waitress 5 min to ask us for or drink order and food order rushing us, got food in about 15 minutes, horrible food, got a chicken pita - over stuffed with lettuce and tomatoes, chicken was cold, and way too much sauce, told waitress she said it was because of the veggies! my girlfriend got a philly pita, not hot at all and no veggies in it! My daughter kids meal was probably the best but still not hot, this place can't get out hot and fresh if I could do 0 starts I would, this place needs new management and a new chef",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pi__fXkTm_VMR0wkZcHjow"
  },
  "zesfZ3JWVEBoV2BixnMyDQ": {
    "date": "12/21/2015",
    "text": "Went into pita jungle tonight and had the worst service I had ever had. The only thing good was the friendly host who seated us. About 5 minutes later another host gave us a friendly welcome when he noticed we had not been greeted by our waiter, he said he would grab our server. Finally our server came over with water. He was extremely awkward. He did not give us any type of greeting at all. He didn't introduce himself (say his name), and he didn't ask how we were doing. All he said was \"would you want any other drinks\", so my friend asked for a guava lemonade and she tried to finish her sentence by telling him what she wanted to eat but he interrupted her by saying \"hold on\" and proceeded to check a table next to us to see if how they were doing. After being cut off my friend put in her order and I put mine in. All he said was \"okay\" and took our menus and left. When he brought back my friends guava lemonade he quickly dropped it off and walked away (it was not busy). Our food came quickly. He just dropped it off and left, didn't ask if we needed anything else. After that he didn't check up on us how we were doing, never refilled our cups. He awkwardly came out with the check, he didn't ask if we were splitting and when I asked him if he could split it he looked really confused. I repeated what I ordered and what my friend ordered to let him know how to split it and we had to tell him a couple more times. Keep in mind each of us only ordered two very small plates. He came back with the checks and of course handed us the wrong books( easily could have handed us the right ones by checking our orders that we recited to him 4 times). We put our cards in immediately, he picked up the tables books next to us and looked at ours and kept walking, my friend stopped him to hand it to him and he then took it. He came back and dropped it off he didn't say bye to us, and didn't tell us to have a good night. We had to figure out his name from the nice host( or busser not sure) who grabbed the waiter for us. His name was Nick, was wearing a ball cap, stripped grey shirt, and probably really new. Just hope he can improve so people don't get that service again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4yoB-SpWP3RBZX-yiiGveA"
  },
  "NnD8ie12dDOYEerlBenFlA": {
    "date": "11/17/2013",
    "text": "I have been here twice with friends from Phoenix while visiting.  Great food.  Nice variety of items on the menu.  Huge seating area indoor and out so never a long wait.  Best sangria I have had in a long time.  Ordered a greek salad this time out and it was great.  Just like back in Greektown in Detroit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v_-LBzUa0ldTJtBwooIRbg"
  },
  "r5-1wOrh2HdY39X7n_LUqA": {
    "date": "5/9/2015",
    "text": "A few years ago my son was turning 5, I asked him where he wanted to go for his birthday dinner his reply Pita Jungle. So naturally we repeated our visit to Pita Jungle many times. My boy usually gets a special burrito, all the beans, some cheddar cheese wrapped up in 2 pitas, simple and delicious. Last night we had went out on an adventure and remembered there is a pita jungle on ray we have never been to. We called in our order, we were on our way out of town. I asked for chicken and hummus, that was great. My boy wanted his burrito. I told the girl on the phone, she sounded really put out by all of this and insisted that we get a bowl of beans and cheese and a pita on the side, I thought while traveling this is highly inconvenient for me but what ever, I'd rather comply that get my poor boys food spit on. So we show up after 20 min. of our call, it was ready. However we did get to stand there like idiots for 4 minutes... The damn bill was $5 more than usual, they put salsa on his bean bowl and rice and all of this other stuff he didn't want. I raised my son right, you eat it anyways, but he was disappointed, especially cause it's his all time favorite restaurant. I had to pay more to be rude to, and not get what I want, awesome! (sarcasm) Every other Pita Jungle worth my time, I guess the fancier the neighborhood the worse it is. To make things even better I saw 7 tickets that were ready, getting cold the cooks getting irritated and no one was running anything out. I know my business and this was poor. To make it all the better it wasn't even close to busy lots of open seating, and most of the customers looked hungry. Perhaps new staff is in order, something, I'm not asking for the world to cater to my feet, what I'm asking for all around when I choose to go in somewhere and spend my hard earned money and support other businesses is simply respect. And well I got none, and they made sure to hand me the percentage rate to tip. I left $2, more than I should of ever but hey what can I say, I didn't know it was all so bad.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "66Rv2Oz2LtSS54rc5ZktzA"
  },
  "QXWtPTkfde35RhZcpR0uFw": {
    "date": "1/12/2014",
    "text": "Today was my first visit to this location.  The location is big but tight.  The outside seating is nice if you are a people watcher!  Inside is decorated with bicycles hanging from the ceiling, colorful lampshades for the overhanging fixtures, painted canvas on the walls.  The bar is made from some sort of metal or tin painted with cartoonish figures and designs.  Seating is tight but comfortable.  The open kitchen and high ceilings bring much space to the restaurant.  All the employees were young and hip with beards and leather jackets and stylish scarves.  The energy was lively and there was music playing but I couldn't tell what.  The volume of the actual room was louder than the music. The hostess was prompt to seat us where we chose.  Our waitress was very pleasant and attentive and smiled often.    Smiles are contagious :)    We ordered the Falafel on a bed of greens , Black Bean Burger (that will make you fart for 3 seconds straight when you get home) with pita instead of bread/bun, Coconut Curry Soup, Caramelized Cauliflower with Tahini, and Brown Rice.  Oh yes, these items were fantastic.  It was my first experience with the cauliflower, and it was amazing.  Big chunks of steamed cauliflower drizzled in spicy tahini with caramelized onion strings in the middle.  I really really like it.  I'm going to make it at home now.  The falafel is something I have had here before and I always liked how Pita Jungle makes theirs.  Can't go wrong with the falafel.  The greens were fresh and abundant.  The black bean burger was good.  It had pieces of corn and cranberry in it so that was pretty rad.  Two of my favs.  The burger is just an average black bean burger though.  And if you are vegan you have to order it with the pita instead of bread/bun (according to the waitress).  The burger comes with garlic new potatoes, which are softened potatoes with garlic.  I like them, such a healthier alternative to crispy, deep fried french fries.  Brown Rice is just brown rice with parsley.  Coconut Curry soup was soooo delish.  My favorite out of everything today.  Creamy curry with chickpeas and peppers and cilantro.  Served with two crunchy pita chips on the side.  LOVED IT.  So good for not making it at home.  I gave this location of Pita Jungle 4 stars because the space was a bit tight and I didn't have like an epiphany or anything while eating my food.  I love the Pita Jungle concept of being trendy and hip but also serving fantastic, easy to create, HEALTHY alternatives to the other restaurants near by.  Pita Jungle doesn't break your wallet and you leave with a tummy full.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ow8eXdDcWvavM0DpNTtxiA"
  },
  "SadBolh5Gl6vLsuGDl5EVQ": {
    "date": "3/16/2012",
    "text": "This new location is just great. I have to compliment Brody who was my server. She assisted me in deciding on a Cold Tuna Plate that was delicious. I will be eating there quite often.  Ron Hourihan 480-285-1652 <a href=\"/redir?url=http%3A%2F%2Fwww.SMME.com&s=caf2625d0dd4102fcbadc06291f41570c6f99e017aa2a935c9a32603b46f344a\" target=\"_blank\" rel=\"nofollow\">SMME.com</a>",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ySgmgIfTm6tUqKRHdK3j9Q"
  },
  "X45vSXC8jRu15Ghw2Q96NQ": {
    "date": "8/11/2013",
    "text": "Ah, trusty ol' Pita Jungle. I've been here on several dates and with friends and with my dog. At all times I felt like the place had a little hipster vibe. I love the fact that they seemed to be dog-tolerant. I don't dare say dog friendly, as I've hardly seen that in Phoenix, but dog tolerant is enough to impress me in this city. Thanks for always providing a good experience, PJ.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WNovaBSxQ4jmydyYrsbJaw"
  },
  "H2au6UPYrF6UgoPbZLx-NA": {
    "date": "10/20/2012",
    "text": "Pita Jungle is awesomeness! The only reason I'm giving this place three stars is because the last time I ate here my lettuce had fruit fly on it. YUCK! The Gyro's I had before the fruit fly experience were tasty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jEjMfYBBFnhcuT1WU4Y-2A"
  },
  "1DctrMzgGf3h75Wtja6vVw": {
    "date": "2/20/2013",
    "text": "Had to wait a little for a table.  The first time we were seated was right by the open kitchen.  It was so loud that we asked to be moved.  We had to wait again for a new table.  The waiter wasn't overly friendly or helpful.  (In fact he spilled one of our glasses of wine.  He right away brought over a new glass (in case the first one had a crack in it) but didn't bring a replacement of the wine until we asked and even then he brought like 1 oz.  I'm sure more than that spilled and it seemed rude not to just replace the entire glass of wine.)  I had a cucumber cocktail that was so good I had two.  Also, we shared the sampler of hummus that was delicious.  For my meal I ordered the caprese plate with pita chips.  It was amazing.  Really, really good.  My only complaint is that it only came with 3 wedges of pita chip.  I needed more and was charged $2.99 for a small plate.  Darn!  If the food and drink weren't so good I would never come back!  ;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bhJ6ivAuSpgXP4JiKWjSZQ"
  },
  "AY_uoZltPNsakOzF5r-CVg": {
    "date": "11/11/2015",
    "text": "Never had a bad experience . this menu seems to have a way of pleasing any and everyone who visits. The staff is friendly, although they can be distant if it gets busy, but what place doesn't ? I do prefer to sit outside due to the decor in the restaurant the sound seems to bounce off the walls when the place is busy. My favorite item on the menu is definitely the Sharma wrap ! Their garlic hummus cant be beat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "820E85fKcsoHYD_VKEpGBg"
  },
  "37nF4XzO0YNFE-9Ub87X1g": {
    "date": "4/12/2012",
    "text": "We were incredibly disappointed with our experience here. We had a friend visiting from out of town and last Saturday decided we'd like to check out a new happy hour around town. We saw that Pita Jungle's happy hour looked pretty promising and waited an extra hour to go out to eat so we could get there at the beginning of happy hour (3pm). Note that this location (Ahwatukee) opened in the beginning of March, and the information on the restaurant website has still not been updated to include this location. We arrived around 3pm and were sort of greeted by the hostess. When we asked for our party of four to be seated on the near-empty patio, she made the \"I'm sorry\" face and proceeded to explain that all the tables out there are two-tops. The plastic, easily-movable tables. We waited for a couple seconds longer for her to say \"Well, I can see if we can work something out.\"  You do that. Don't think too hard.  While we were waiting we looked at the menu and found out that THIS location doesn't do a weekend happy hour. Thanks for updating that website. We almost decided to leave and come back another time, definitely wish we would have done that, but we were pretty darn hungry at this point. After pushing two tables together the hostess came back inside and grabbed four menus, then proceeded to greet another group, then flirt with a co-worker, THEN say \"you can come with me\" to our party with barely a glance in our direction.   We were seated in the very far corner of the large patio, as far away from the door into the restaurant as possible. I imagine this came into play later with our terrible service. Our server came, got our drink and app orders, and did well to check on the apps when we were about halfway through them. Our friend got a strawberry banana smoothie and it was delicious. We ordered the baba ghanoush as we were promised that it was extra smoky, and we love it that way. When it arrived we were surprised to find a pile of lumpy, stringy eggplant that clearly needed another round or two in the food processor. The texture was gross to the point where my SO couldn't eat it, and she is usually crazy about baba ghanoush. It was smoky, however. Our friend ordered the stuffed grape leaves, and they were fine. Comparable to what you would be served at a fast food Mediterranean place - definitely nothing special.  For our entree we ordered the black bean burger. We have had the burger once before (take-out from the Arcadia location) and liked it, but it is SO mushy and hard to eat as a burger. It just falls apart very quickly. We like the cranberries in the burger, very nice touch. The toppings both last time and this time were disappointing - the onions were cut so thickly that the taste of onion took over and it was hard to enjoy the burger. The tomato slice was incredibly thick and included part of the hard center near the stem (again, both last time and this time) and we had to do a lot of doctoring to enjoy the toppings.   Here is where we started to be severely unimpressed. While we were eating our entrees, our server was no where to be seen. Not once did she return to the table until about 15 minutes AFTER we were finished eating. During the meal we had to ask a hostess to refill our four empty waters, and then another server to refill another one later on. At the end of the meal, after we had been sitting for quite a while, we finally had to ask another server if our server was still around. She replied \"Well, I hope so!\" and went to find her. It should be noted again that this was about 4:00 on a Saturday afternoon. It was NOT busy and there were plenty of waitstaff. Our server eventually showed up looking a little sheepish and took our plates. We asked for the bill and lo and behold, it took another five minutes to get the bill out to us. We didn't even consider waiting to have her come back outside to pick up the credit cards - we just walked them into the front desk. We had written clearly on the back of the receipt how much should go on one credit card and how much to put on the second. After waiting for the hostess to track down our server to run the cards, we got them back to find that she had gotten the amounts correct, but the cards switched around. Really? Really?  Yeah...we won't ever be coming back. Left feeling disappointed and frustrated at having spent any money on this dining experience.  EDIT: Changed to three stars. After our last review we were contacted and given $25 credit at the Ahwatukee location. We returned for happy hour since that was our original plan. Our server was fantastic, very attentive and positive, fun to talk with (didn't tell them about our credit until the end). We had a hard time spending $25 at Happy Hour with all the $1-$3 tapas. Good margaritas for $3.50. We had all the vegetarian tapas and they were delicious. The only thing we'll still be staying away from is the grape leaves -unimpressive both times. We'll be back, but probably only for happy hour.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "p51t568ahZRzPsK6dFvSMQ"
  },
  "cO51xokp_gozytBhFlLlLA": {
    "date": "4/16/2015",
    "text": "This location is crazy crowded on Friday and Saturday nights. Of all the locations I've visited this is my least favorite because of the waits. Minus one star. We usually arrive as a group of 6 after a movie night out with friends when we leave the AMC Ahwatukee. A 30-45 minute wait is common for us. As you'd expect from a Pita Jungle the food is great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5mM-cjhJ0-Ij8-Y8zUkGjQ"
  },
  "CUgb1SN8UwuePa74U4dZUw": {
    "date": "2/12/2013",
    "text": "I really liked Pita Jungle. Our server was very sweet, she was very helpful when I asked for suggestions, she also made my entree a special custom order (which I appreciated and she encouraged). The food tasted good and I would definitely come back. The bf ordered the chicken pita with the greek pita and I ordered the \"Pesto Lavash Turkey Wrap\" but substituted the turkey for chicken (upon her suggestion).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i8bPEu8NTRkWcKEUYpIRUw"
  },
  "GmYKFspb4U0xpfJea1Zk9w": {
    "date": "2/27/2013",
    "text": "Great happy hour and really good healthy food! The California wrap is my favorite. Try the trio of hummus and mini tapas during happy hour.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "asBFS8k9REpYniB9gVu2Dg"
  },
  "1efMIzuKTS1d2Lf-jYkWPw": {
    "date": "8/22/2012",
    "text": "I usually love going to Pita Jungle.  I have frequented both the Apache location and the location in Glendale.  But last night I took my husband to the one on Ray for the first time since it had opened.  I had actually been there two days prior with my family.  I noticed on both occasions that the manager was walking around and making snide comments about the employees.  Huffing and puffing while standing at one of the computers.  Yesterday, though, we walked over from the theater and I heard the manager on the phone standing in the empty patio seating area complaining to someone quite loudly about the staff, again.  This time someone was just standing around when they should have been prepping their station, someone else was late coming back from a break.  I know things like this happen, but it doesn't make me feel very good when the manager feels so poorly of the staff.  I think it would have been better if he would have taken the call in the back ally, maybe in an office..but not some where that incoming customers can hear him.  I just didn't expect that every time I went there I would hear him complaining.    I'll go back...but because of the food....not the management.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdafCxPXzbsv-zzpdy7-UQ"
  },
  "SrSSQr5eQ6wDTVLzNI9c5A": {
    "date": "8/8/2012",
    "text": "so. while the husband and I were dating, we ate at various Pita Jungles a couple times and I declared that I disliked it.   I have now changed my mind. I got take-out during the lunch rush and my order was ready in 5 minutes!!! The girl at the counter was the sweetest. Yes, it can be on the pricey side, but the wraps are delicious and healthy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSwb7qNpSgU3ekHMpiHsOA"
  },
  "KsBdZm9UKs0ay6PeAt5ocA": {
    "date": "8/2/2012",
    "text": "It took over 10 minutes to even get greeted. We watched people that sat down after us receive drinks and have an order taken before anybody showed up. Even after we had mentioned that we needed to see a server   Disappointing :( I'll go back in hopes that it was growing pains since it just opened. But.....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pYBosKYzE5h-eZS3O81qJQ"
  },
  "XM4AiCPsvCP9rLe5uoPVfQ": {
    "date": "8/23/2012",
    "text": "I'm sort of torn on this review because when I went to Pita Jungle a few weeks ago pats of it were really good, and other parts were really bad.  First off I guess I'll start with the bad. I went with my BF around 1:30, the lunch rush seemed basically over, there were a good amount of people in there though. When we walked in it took about 5 minutes for anyone to acknowledge us and to get seated. It looked like the manager was standing around chatting with employees. Another 5+ minutes went by and a girl came and took our drink orders, a different girl brought us our drinks then she said she would get our server. 10 more minutes went by and I was wondering what was taking so long since they weren't very busy and she came over and asked us for our drink order, once she saw we had our drinks she took our food order an that was basically the last we saw of her. Yet another girl brought us our food and no one came over for re-fills or anything which was disappointing. Our \"waitress\" did come back to give us the check and ask how everything was. We didn't tip very much since we had like 5 different girls help us..or something like that.  Now the good! The gyro was amazing, a great portion that I could barely finish. My BF got falafel that was also great. Loved the atmosphere and the \"feel\" of this place. I'll definitely go back and try to see if the service is any better. If the service wasn't so terrible this place would be a solid 4 stars! Worth a try for the yummy food...but still, so unimpressed with the professionalism here..or lack there of.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wSASZkO5XnuWcxlgDpJXWA"
  },
  "MA1yETDos8tWgHFLlTbh2A": {
    "date": "6/2/2012",
    "text": "I've never been to this shopping center/Pita Jungle location before and I was really pleasantly surprised! The restaurant was large and very bright and clean. There was a big patio out front that looked inviting even with the 100 degree temperatures! The waitresses were attentive and the Roasted Vegetable Salad with Chicken that I had was really good! The next time I am over that way I'll likely stop in again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2qya62J99lKO3UfhHP6kvg"
  },
  "8zwPs1MaF7b5Ylu4TJJueQ": {
    "date": "4/22/2012",
    "text": "Let me start by saying giving this Pita Jungle location 1 star is generous. When I first heard that this location was opening, I was excited! Not many places around here have healthy, fast, & good food! I decided to take some of my girlfriends out for dinner one night and thought I would try out the newer location on Ray Rd (I live downtown and ALWAYS go to that location) We walked in the door around 6:00 on a Tuesday night, we were immediately ignored by a couple of young girls hosting while talking to some other co-workers. We stood at the front door for 4 minutes before being greeted (I am a server myself so I notice little things like that). When the host came up to us, she barley said anything to us, asked how many and sat us at a table directly infront of the kitchen next to the takeout stand. She put the menus down on the table and left. 8 minutes go by and no server has greeted our table yet, we were about to leave. Right as we were getting up, our server, Halley came by and greeted us and apologized for the wait and explained that she was dealing with a messed up ticket for another customer. As I said before, I am a server myself, so I understand these things. The place was pretty busy and we got to ordering our drinks, it took her 10 minutes to bring us our margaritas! We tried not to get very rude with her, so we then ordered our apps, we chose the Chicken & Hummus as well as the chicken combo. The chicken and hummus came out wrong, we ordered regular hummus and we got the green hummus. Also, the chicken was extremely cold. The chicken combo was cold but we ate it because we were afraid to order anything else and have it be cold too. We just were going to leave and take our money elsewhere. Needles to say, our experience at Pita Jungle will be un-forgettable.... but the icing on the cake to our dining experience was walking by the kitchen to the bathroom and hearing the conversations in the kitchen. I stopped and acted like I was watching the flow of the kitchen, but I was really interested in hearing the big red headed kitchen manager screaming at her employees. I don't know if it was a joke or not, but her employees looked de-motivated.... I wouldn't blame them.  Some other locations to check out: Downtown Phoenix, Arcadia, Tempe & Scottsdale.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "S3-JpB5dBhMXmauMqeoN-g"
  }
}