{
  "QUyPpqbLzrKUNhGOypJsXw": {
    "date": "11/17/2013",
    "text": "We love this place!!    We used to like to come in, when they offered up an all-you-can-eat (early-bird) dinner, that wasn't publicized, but we knew about it, and utilized it up to the last day of the program.  :)  They have THE BEST 99 cent margaritas ever!!  Plus, if you come in at a certain time, you can get appetizers for half-price.  A couple of chicken quesadillas, an order of guacamole, and 2 margaritas each, and we are out of there for under $19 - you can't beat that!!!  Plus really delicious chips and salsa, including a bean dip, that is pretty tasty!!  Ole!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1NibHthdxvr5Sw11_UdL3A"
  },
  "SHe0WHslFWKgGwMC8RiV5g": {
    "date": "4/13/2017",
    "text": "Love this spot! Always the best service & great happy hour. Enjoy $2 margaritas & cheap eats. One of the best hidden Mexican joins around Phoenix. 10/10 recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zqT7H2WEKVbAyTtyIbon8A"
  },
  "Ja4nFtq9KnE9yh3S__EZXw": {
    "date": "3/8/2014",
    "text": "I went in at 11:30 AM to beat the rush and got seated quickly and had my order placed within a couple of minutes.  Not more than 5 minutes later my food was ready.  I ordered the chimichanga with ground beef.  Nice mix of spices, but not too heavy which is what I like.  Some places tend to add too much to ground beef and it dominates the taste.  The rice has a pepper mix added to it which wasn't to my liking, but to each his own.  The beans could use more flavor or maybe some cheese on top to mix in.  The server and bus boy were both friendly and came around very often.  Overall the chimi was great, the place was clean, and the service was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ap0-JqUsibRaVSlTf_HqnA"
  },
  "fXD9M0kGZGzI-IpztNJmqQ": {
    "date": "11/29/2015",
    "text": "Three words.. gourmet chicken tacos. You must try the tacos. This place is always a great option for lunch or dinner any day. They have a good salsa bar. This place is always better and fresher than anybertos restaurant. Come eat here",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "55e_HUm0WQ64rT0kIixiXA"
  },
  "M1l9uBZHK8q-NLvx_zRCmw": {
    "date": "1/5/2014",
    "text": "5Star service. Our first time here and everything couldn't have been more perfect. From the looks of the giant video billboard outside advertising $5.99 lunch specials we expected average Mexican fare. We got much more.  Not only was the food excellent, the service was equal to the likes of The Pointe.   The Food - Brunch served from 10:30-4:00 I got the South of the Border Ranch Style Eggs with pork chile verde, eggs basted. The taste of the pork was superb. You can tell everything is made fresh. The food didn't come out in 5 minutes either so it's apparent they take their time making everything to order. She had the Breakfast Tostada substituting fajitas veggies for the meat, otherwise served with chorizo. Again, all the ingredients were fresh and tasty.  The Little Things John, our waiter is low-key, extremely helpful and knowledgeable. He knows how to adapt many dishes for the vegetarian and gluten free eaters. We never had to ask for a thing.  If we needed an extra napkin, it was on the table before we had to ask. Used creamer and sugar packets were immediately bussed. A new cup of coffee was on the table just as I was finishing my last sip. The manager, Jason, made a nice appearance and welcomed us.  After the meal, John spent a little extra time socializing but otherwise he was the invisible waiter who took care of all our needs.  We'll be back and next time we're bringing our son on Sundays for face painting and because kids eat free.  Thanks Arriba!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l9G9qMq0M97HP6LWN3akVA"
  },
  "WfvD2G0pMPBCr3jgFK2XcA": {
    "date": "3/25/2015",
    "text": "I totally forgot about Arriba's being on Camelback and went there for lunch recently. I ordered a bean and cheese burrito with their white sauce (can't remember the name) but it was very good! They are very aware of people on their lunch hour as they were SUPER quick. I will certainly be back for more.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "79D7HDjpw0iZq6iu52vsSg"
  },
  "22VRkVEFkW8oRH2Td9WGxQ": {
    "date": "9/2/2015",
    "text": "I love this place, me and my friends started coming here for happy hour when the margaritas were 99 ! Now I think they're like 1.99 which is still good. We come every week faithfully Lol and we always ask to sit in Michael's section he always takes care of us and is so nice and friendly. We all think he's the best waiter ever! We  him",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1qlWrNnq8tjS4QFK0nEkGg"
  },
  "_oVtXFHh07NsPl5kzt1PLg": {
    "date": "4/19/2015",
    "text": "Our first time here, gotta say the food is great! I got the chimichanga plate and I loved it.. Will be back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Yqzz7VfXMPWlDXB2W_TwBA"
  },
  "pnJiTjnFnIndG1dojhiYxQ": {
    "date": "3/3/2017",
    "text": "I go to Arriba's Mexico Grill frequently and have always received great service however today I entered the establishment only to have not one but TWO employees walk past both my husband and I and we received no acknowledgment whatsoever while we waited to be seated for at least 10 minutes. It's really unfortunate because I had been raving about this restaurant and it was my husband's first time there. Needless to say you have lost not one but 3 customers because if this.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ayHBRBCerNMpb1E7O-pgw"
  },
  "hIWxjew130dgETjO8p3HaA": {
    "date": "3/28/2013",
    "text": "I'm all about the Chips & Salsa.  My usual Happy Hour fix here: Queso Fundido & Chips and an Iced Tea. Always great service. I can't wait for tomorrow's Happy Hour here. Cheers***",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RUn2C1UgxiY1enPzYG5OyQ"
  },
  "r5ioztlJ5nHEnEetYzyB7Q": {
    "date": "8/26/2012",
    "text": "Their breakfast on the weekends is the best-kept secret in the area. The menu features not only Mexican items but plain-old bacon, eggs, and pancakes. Prices are better than at most typical breakfast places.   The great thing about it (and something that this review might change somewhat) is that the Sunday morning crowd seems to not know about it, or are scared away by the fact that it's a Mexican restaurant that they think only serves huevos rancheros for breakfast.  Thus, it's always easy to get seated.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "vBSzgSvcawxtaDuIdi9hCA"
  },
  "OVvQyQqhwbctQMtWbuAuKQ": {
    "date": "9/25/2015",
    "text": "Great service, Festive decor, Hospitable, Great flavors! Very busy and happening place! Will go back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mR0N5-ypFf2lFZn8SJ-cUw"
  },
  "u6mCANFfl2mN0cIg6GgTIA": {
    "date": "11/5/2013",
    "text": "Excellent food. They serve chips with bean dip and salsa. Typically, bean dip is an okay thin for me, but I do especially like the bean dip here. It has great flavor and has a slight kick to it.  They have good lunch specials daily, and so far I've liked all of them.  Aside from the lunch specials, I've had the Carne Asada and Fajitas. Both were fabulous! I haven't veered from those yet because I love them too much.  The staff are pleasant and friendly. Today, the hostess seemed a little timid, but still pleasant.  I definitely recommend this place for excellent food at a reasonable prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "it1h3pk_GO4fQ88V01j_CA"
  },
  "XE11xT9YUscdTK8whHRLYg": {
    "date": "11/19/2012",
    "text": "Although I was familiar with Arriba Mexican Grill, I recently ate there for the first time.  I prefer local eateries over chain restaurants, and with only 6 Phoenix locations I can classify them more as a local place than a chain.  We went there after attending a function at Biltmore Fashion Park and we both had a taste for Mexican food.  Since it was a little late, it was good to find a restaurant right on our way that was still serving.  The first impression upon walking in is that the place looks pretty touristy, but many sit-down Mexican restaurants do, so no negative there.  We were greeted by two friendly hostesses who seated us immediately.  A busboy immediately brought water.  Now that I've used the word \"immediately\" positively twice in the same paragraph the next use of it wasn't so positive.  Within seconds the waitress immediately came over and asked us what we wanted to drink.  Now, there's a fine line between being ignored for 5 minutes or more, but this young lady hasn't learned the fine art of counting to 20 before approaching a table.  I recognize it was probably nearing the end of a long shift for her and there weren't many other customers, but that was not the most pleasant way to start an experience at a restaurant.  She gave us a little more time to look at the menu after she brought the drinks, but not much.  There she was again!  Fortunately something caught my eye that looked really good and I was ready for her.  I ordered the Carlsbad Stuffed Chicken Breast , which was stuffed with vegetables, cream cheese, and topped with queso fundido and served with rice and choice of beans.  Arriba takes great pains to distinguish themselves as a New Mexico style of food and a large percentage of menu items were uniquely different than most Phoenix-area Mexican restaurants.  They also make a big point of using Hatch chilies and denote the hotness with images of 1, 2 or chilies.  Mine was 1 chili.  It was served in a reasonable period of time and was a surprising amount of food.  I loved it.  I also ate all of my rice and beans (I rarely do) ... the rice was light and fluffy and the beans did not taste greasy.  There was also a tiny salad of undressed lettuce and tomato, more for decoration than anything else.  As we were both slowing down the waitress made a well-timed visit to our table and we requested to-go boxes.  She returned promptly with those as well as the check, which was picked up within a minute.  While we were eating a lady who appeared to be a manager stopped by to ask if everything was okay.  Bottom line ... this is a decently good restaurant.  Service is good, decor is nice, not too noisy, lots of food for the price (not that it's cheap, but at $12 for my entree I got a very large and tasty chicken breast.  At most Mexican places for $12 you get a couple of tacos or a burrito or a couple of enchiladas with a little shredded meat inside - my plate had much more real food than expected.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pj9YpaP0T7A_5S_PT8IpNg"
  },
  "ncIOLvLCQ94bm9vtXlweog": {
    "date": "1/17/2016",
    "text": "Great place to start a Sunday, jumbo marigatas, tacos and wonderful serivce from Alexandra and Jason! Our Sunday tradition.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VTv799yXf545oPIB1O0F5w"
  },
  "iN5079Agk7nNUF-KMne7ug": {
    "date": "6/29/2015",
    "text": "There's Mexian food.  Then there's Mexican food.  Arribas is the best around.  Been to ALL the other places, and hands down this is the best.  Last night must have been the umpteenth time for dinner.  Had my new favorite, Green Chile Machaca Tamale.  The portion is very large and comes with two tamales.  I usually order a side of beans to go because I always have the second tamale to take home.  Plenty of chips and great salsa- hot or mild with bean dip.  They're not kidding when they tell you the hatch chiles make it hot.  Because the chiles are extremely hot - be careful if you don't like it that way.  I just have them hold the chiles or put them on the side depending on what I order.  The staff is very friendly and they remember you each time you come in.  There's hardly ever a wait because the place is so big.  If there is a wait, it's not for very long.  Did I mention great  Margaritas too!  Even their 99 cent margaritas are great, I forget what day they offer them at that price.  But if you're there when they do, don't miss out.  This place makes great Mexican food.  More importantly, their food and service is always consistent.  I've never had a bad meal here.  The building is nostalgic.  It's been there for a very long time.  It was once \"Tony Romos a place for Ribs\" and before that is was a fun place called \"Googs\".    The upscale version and night dinner spot for Guggy's Grill, which was kinda like a better Denny's or Brookshires if you remember that place.  Now I'm dating myself.  We're talking ancient history here.  This place has seen a lot of people in and out of it's doors.  I'm sure everyone in Phoenix has been there in the building one time or another.  If you have or if you haven't now you can have Mexican food there.  Go, It's great!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x1wKQ9vr3Le3sH4WrDSKMw"
  },
  "Lj8EmZSENsnRF3-1ElEptg": {
    "date": "8/6/2012",
    "text": "Mmmmm the food was so good! The chips, salsa and bean dip provided in the beginning were plentiful and replenished without even having to ask for it! That's a big plus because a lot of places almost seem reluctant to give you more chips and salsa.   I had the two enchilada plate. The lettuce and tomato salad that came on it seemed fresher than other places, and the rice was good (no beans for me). I went with a party of 7 and everyone else's dishes looked very good and there were definitely no complaints from anyone!  It was my niece's birthday, and the servers all assembled and sang happy birthday with a big sundae for the birthday girl. Our server was named Caesar, and he did a great job. So the service was top-notch!  I'll definitely want to come back!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "pe3AX1Mw9HCcngmjl02Nxw"
  },
  "i5GmANbUvXLhLJgAW-i9nw": {
    "date": "10/3/2013",
    "text": "Meh, service was decent, vegetarian options were not that great. Water was tap, and the food was not fresh. Nothing special about this place, but it did not make me puke.  Had the vegetarian enchiladas and they were not that flavorful.  Price for lunch menu was cheap, under $10.   Would I go again? No. If someone took me there, would I go...sure...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Ad4ErIl1mZiZ_2kvI6MVA"
  },
  "QDWWW4SPK4uCzUU_9Eum-Q": {
    "date": "2/15/2015",
    "text": "Today's experience was awful! We used to love coming to Arribas, but today we have decided to go no more...It started with the not so welcoming greeting, followed by the immediate change in language as they discussed who they wanted to attend to first-us who arrived first, or the party of 5. Fortunate for us-not so much for them-we speak Spanish! Next it was the catty sizing up of myself and my 2 teen daughters and the smiles to my husband and 3 sons as we were walking to our seats, followed by the dirty table setting when we were seated (silverware covered in hard caked on food). They brought us all the requested water, and when my 7 year old asked for more water we took the lid off if his kids cup to discover it was filthy! Some kind of dirty black residue was on the inside wall of the plastic cup-I thought this cups were all new??-it was almost like a thin layer of dirt or soot. When we addressed it with out server she looked at it and acted like this was not the first time she had to exchange a dirty dish (not including the afore mentioned spoon covered in hardened food-like shredded chicken). Once the food came it was ok. We used to come to Arribas regularly because the food had great flavor and quality. Not so much today. At one point my daughter had ordered some enchiladas and bit into one to find a bone. Normally I would have let it go but from the time we walked in until then it was such  a bad experience. We told a our new waitress (I think there was a shift change between us being seated and getting out food) and her response? \"Well animals have bones, so\" whith a shrug. We're not dumb. We know they have bones; I guess I was the dumb one for assuming we wouldn't be dining on them. The only good thing about our meal for seven was the happy surprise that kids eat free on Sundays.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_7POwpZjxO73p7xuyiVa2A"
  },
  "8sJ-k-7xPVITQDsh0SwgoA": {
    "date": "8/26/2014",
    "text": "Love the drinks, love the happy hour! 99 cent house margaritas could you go wrong with this? They also have large drinks you can share. The food is always awesome. Service could be better but it's not bad. We are frequent diners here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "eSqMc6Nh8pQSQtI1OT_mBQ"
  },
  "F3rTJn929FUNzzUSsCTkzA": {
    "date": "10/13/2017",
    "text": "I really liked this place.  Stopped for lunch on a tip from a fellow passenger on my flight in from ABQ.  Ordered chili relleno stuffed with ground beef and a green corn tamale.  AWESOME!  Great service.  The manager stopped by and sat down to visit at my invitation.  Genuinely cared to take time to listen to my feedback!  Tough to compete in PHX restaurant atmosphere and Arribas is doubtful to ever disappoint you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FDytgW-ogupNdq6-DpUuTQ"
  },
  "o04MEdYvmHThYNiQXTBAbg": {
    "date": "3/26/2016",
    "text": "I'm mildly obsessed... I love chips and salsa! The cheese crisp is yummy, and so are the mini chimis. And man oh man!- their street tacos!   My only complaint would be is that they're a bit misleading. They don't bother to tell you that the sour cream and guacamole they offer when you're ordering with your meal, doesn't center with it. We learned that the hard way when $12 of our check was just sauces! Oops! Live and learn.   Besides that, I think they're great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uHmOM1EOA4sYmhCs1x7iqw"
  },
  "MG-cZ9u5evShXg9Fscgnxw": {
    "date": "12/25/2014",
    "text": "Arriba, Arriba! Let's get this over with. So they are definitely the home of the BIG ass margaritas and nothing more. The two times I ate here have both been a disappointing experience. They get the one star for being open on Christmas though.  So this place is definitely located in the right area. I'm certain the lack of seasoning I.e spice, flavor, is geared towards a few of my Caucasian brothers and sisters who dislike spicy food (no offense). As far as flavor goes, you can see pepper on your rice. The cheese (which is sprinkled on in quantity like a Panda Express employee would do 5 shreds at most) nor the sour cream does justice to such bland offerings.  I ordered the White Sands burrito the first time I came here over 5 years ago and it was so salty,  I'm certain I walked away with high blood pressure at a very young age. So this time around I ordered the burrito plate. I had the Machaca meat with the side of blands and rice....pardon beans and rice. With each cut of my burrito, water rushed out. Talk about sustainability, here's where our water is going Arizona. I would've enjoyed it more if the meat were drained and seasoned.  Our waitress was pretty good. I don't know her name though. Anyhow, the restaurant was pretty packed, so packed we sat next to the busiest bathroom ever. With each swing of the door, I could smell that pink colored hand washing soap. Not a minus though, hey it was a full house sit where you could.  In conclusion, I will NEVER come back here. Nothing against the service. It's not you Arriba, it's me not liking the food. Although the chips and salsa were alright.  P.s OMG the mints are amazing!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G79OaDhmFC_KcKnkq1eBqQ",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. And around this corner is the restroom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/G79OaDhmFC_KcKnkq1eBqQ/o.jpg"
      },
      {
        "img_id": "O4KkclVB5iX--5AdVsGLlA",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Burrito Plate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O4KkclVB5iX--5AdVsGLlA/o.jpg"
      }
    ],
    "user_id": "cqDBxzGz-fcN9A7IA-7Wdg"
  },
  "gAEGTG2JMozcoA_mlrxnlg": {
    "date": "2/14/2014",
    "text": "I've tried this place twice now and while the food is pretty decent, I can't get past the filthiness of the restaurant. Seriously, the owner needs to close down for a couple of days and deep clean this place.   It also didn't help that I found a hair in the chips.   Redeeming factor was that service was really good.   But still won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "SsYHb0uyECshxjzUJ8ynag"
  },
  "lLaAaDjbbOYmc1WvfooSng": {
    "date": "7/18/2017",
    "text": "After a exhausting day at work i decided to try this place out and it was pretty good. Nice setting food came out great i got the steak/chicken fajitas with rice and beans .. waiter was cool too checked in frequently without being overbearing.. got to try out their spicy  peppers on the side was a good experience.. would def come here again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AL_yZu7wJ72vNObXMk2bqQ"
  },
  "AmQP1fM9UUI066NlRpRu1w": {
    "date": "8/9/2017",
    "text": "I was recently staying at the Biltmore for a conference and was looking for some good Mexican food.  Arriba Grill was highly recommended by a friend that went to grad school in the area. Well, he was 100% on target with his recommendation.  The Hatchet chilies made the Salsa Verde sour cream enchiladas just about perfect.   The service was pleasant and unobtrusive , the food was great, the decor is \"original\".  What more could I want?  This is NOT you production food Mexican chain restaurant.  Thank you.  I'll see you next time I'm in Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n92nMqQJrlUy81NvRHA-5A"
  },
  "xgVKXKHpFy0gcH9Fy6AXUg": {
    "date": "7/3/2014",
    "text": "I have always heard of this place on tv. I was around the area and decided to check it out. Walking in was not to expectations. It's to dark, dungeony and it has a weird smell and very hot in here. The place highly needs some upgrades and natural light. I was by myself to I sat at the bar. Ordered house margarita... Prices are from $7-16.99 a drink depending on the ounces. The staff is nice but not friendly. The restaurant provides u with chips, salsa and spicy bean dip. I have ordered from the lunch menu and seems a little high priced for a lunch min. 7.99- 12.99 majority is $9.99  a plate without an al carte option. I had gone to discount tires and obtained a 20% coupon for eating at arrivals since it's right next door.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q1D0yKXZz3CBnZaHYA2b0Q",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. House margarita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q1D0yKXZz3CBnZaHYA2b0Q/o.jpg"
      },
      {
        "img_id": "WyDeCBWPDPdiww477ToP_Q",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Lunch Mini New Mexico enchilada",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WyDeCBWPDPdiww477ToP_Q/o.jpg"
      }
    ],
    "user_id": "o14yqhb6OSrQb_8KZrHfDg"
  },
  "4uuGvScvMW1eXRiFhJlYUA": {
    "date": "8/22/2017",
    "text": "I came in on my birthday on Aug. 16 and I let them know and even the waitress and I felt like they didn't care the margarita did not taste to great as well the food no the checking in on me  no I just wanted to go and I was so sad on my birthday( but hey I went to 7th Ave / Osborn  to (Mi Patio) great happy hour Million stars for them Go MI PATIO  )",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PSfaLZRQp7MAZLUn3KZ5Dg"
  },
  "H1i0GobpDjZ5uKw4DaiCog": {
    "date": "8/15/2016",
    "text": "Great Service Logan... just move back to Arizona great food great beer great  service",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lm_GaXpkJFLQaXjrOQ8UEg"
  },
  "zv-P7r_eKfhYVKMiRu-__Q": {
    "date": "6/13/2014",
    "text": "Honestly, my first time eating at an Arriba's and I've lived in the Valley quite some time. I sat in the bar area for lunch to pass time while my car was getting worked on next door. Free chips & salsa & bean dip...that bean dip...delicious! It doesnt take much to make me happy! My food was good. Prices good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WsAejVneMXU-_yp_W0b_2A"
  },
  "UNkeDk-nALES3TZiLgjIkg": {
    "date": "2/27/2016",
    "text": "After years of coming here, either today was an off day or things have changed. I always order the same thing- pollo con queso.. Today was inedible, I sent it back and didn't dare try anything else ( That's just me) The chicken was heavily seasoned and I got a lot of Grissel.  Even the rice tasted blah.....Arriba's what happened??",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h2AML5vaZ_YNAnS_Q1oraQ"
  },
  "K4UgoQuBqWzdYXxog0l-6A": {
    "date": "7/16/2015",
    "text": "While the food isn't bad, I cannot believe the bad service.  From the bartenderess (Saturday, July 11th, 10:43pm) who could not wait to get out and go home, so much so, she packed my order to go when I never mentioned \"to go\".  I wanted it hot and fresh; I got it home, cold and microwaved.  And then there's the voicemail to corporate that to this day goes unreturned.  Well, four days later I did get a call, \"broken vm\" he said.   And then there's the completely disinterested operator at Arriba Corporate, like she was doing me a favor.  Hey, honey, I got at least 2568 Mexican retaurants left without Arriba.  Last, the \"contact us\" form on Arriba's website doesn't function.  If you fill it out, enter the code that makes sure your a human, it always returns as incorrect code. DO YOU THINK THEY GET LESS COMPLAINTS WHEN NO ONE CAN CONTACT THEM?  I DO.  The food is good. But do you know that with the exception of the bartender who greeted me, there was a complete lack, void, dearth of hospitality. If I gave away a medal if make doubly certain things went well. The manager on duty, who was better dressed for sleep than managing, she acted like she was paying for my meal out of her own pocket!  Not a word. Not, \"thanks\" not nothing!  HORRIBLE, HORRIBLE experience. Oh, and by the way: this place has been painted and repainted but it cannot take out the dank smell and the age of this dump.  Go anywhere else, Mi Patio, anywhere, just not here.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "t7b1lU39lHosuU9_U4jeuQ"
  },
  "r8vmf42c9ds5K0pXaxP7OQ": {
    "date": "4/28/2017",
    "text": "Wow, amazingly good food!  Just moved here from So. California and it's been hard to find delicious and spicy Mexican food.  Both the service and food are terrific.  I recommend this place and will definitely be back! The beans and chips are the best I've had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "abvu9ezv5cBB83zcPkku5A"
  },
  "EvW6mYr2kKgqht_ehwqO5g": {
    "date": "7/1/2015",
    "text": "My rating used to be 5 stars, but this place quickly went downhill. I used to get chips and salsa with taquitos every time I came here because they were really good. The last time I came in here, during the day, the taquitos weren't thoroughly cooked and the queso had a 'fishy' taste.  Tonight I came in and the salsa had to have been bottom of the barrel because there was almost no salsa in the salsa. It was almost all salsa water, or whatever it is. I actually got the taquitos at the same time as my chips and salsa, which was odd, and they were barely cooked at all. When I said something to the manager she replied \"well we are almost closing\". Instead of making excuses maybe she should be a real manager and address the issue with her employees because I don't like gambling with my food because employees are too lazy to do the jobs they are paid to do.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "H4-vxusdtYXXlw1xVNoH9w"
  },
  "iZ8d4Sz8V3BdknZTYhjwlA": {
    "date": "3/22/2017",
    "text": "Wonderful service, friendly people, accommodated a family member with a service animal and were very nice and attentive! Excellent food, great flavors, fabulous margaritas",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "elMdavJLpG0KT3SHTjJvEA"
  },
  "YWiNw8CTLRUH-DplvaXu_g": {
    "date": "3/11/2017",
    "text": "We've been going here for years, but the last two visits have been disappointing. I usually order a green chill burro. Both times it was packed with black pepper.  We won't be going back until this changes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZJ6lmZ4MY5jP_Ok9ZE4DYg"
  },
  "weIDTkynykyyMKmMsIPdFg": {
    "date": "1/15/2016",
    "text": "Service was a tad slow as we were sat in the back room and I think he kept forgetting about us but.. .the fajitas were decent and hot, the queso dip was hot and good as well. I guess everything was just a-ok. Not spectacular, not horrible. Chips were crispy but the bean dip was watery. Hot sauce was good too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvYN86BmZyP87SaTO7mHkQ"
  },
  "VKq5MprIiYwHsWF6CPWGHA": {
    "date": "5/18/2017",
    "text": "We decided to give this place a chance. We ended up just ordering tacos and were very disgusted with what happened. We were given uncooked chicken so undone there was still blood on some of the pieces. My fiance and I addressed this issue with the manager who told us it was because it was overlooked. Needless to say we both got very sick from eating some of it. The manager refunded us 5 dollars for the trouble. We would never eat here again. Terrible experien",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aOgkrq1LWdYfR7RFTTYdGw"
  },
  "RMYSW7JXkxM8HrwVDq03OQ": {
    "date": "8/6/2016",
    "text": "Wow after going to ARRIBAS for the past 10 plus years and giving them several chances we are DONE  we used to go once a week or more but in the past few months food started to get worse,  \"spicy hot is not a flavor \" we have had from bad service to raw chicken and everything in between but today we had enough when the waiter took our food before we were done eating  WE WILL NEVER GO BACK TO ARRIBAS, it seems that the management don't know or don't care they can keep their bad food we are DONE",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9msFz4lRFOP0634LAicJag"
  },
  "IXBy9kDdYOSalE_5S2LHuw": {
    "date": "5/4/2017",
    "text": "Really decent Mexican food for the neighborhood! Highly recommend trying it out! Prices are AMAZING for how much food you get! I normally do to go and with an entree, side rice it cost me $7.50 but I'm top of that you get a big bag of chips and salsa for free! However, I notice with the chips that they may be reused as some are salted and others aren't and they can be stale (minus 1 star). Very tasty I would give it a try!  And with parking I couldn't find a spot at all. They should have to go parking I had to park at a run down apt behind the restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jLm0wLUYcwAa7KDTE7qdKw"
  },
  "_QJxQHr_JBbCbSCePSKcrA": {
    "date": "6/4/2007",
    "text": "I concur. Arriba's is good Mexican food but watch out, because it is HOT.  I'm not just talking the normal style of hot where you have a glass of water handy and take a sip here and there. This is the hot where you need a few pitchers of water sitting right next to you to quench the pain that is their hatch chiles.  If you get a cheese crisp, I dare you to order it with the chiles. Holy mackarel they about burned my mouth off.  They made my eyes water and even made my lips burn. And if you're thinking that I'm just a wimp when it comes to chiles, think again. My brother can handle pretty much any level of hotness, but even he couldn't eat these.    In fact, we had to pull the chiles off the cheese crisp to eat it, but it was too late. The hotness had already seeped in and it was just too mouth-flaming hot for either of us to eat it.   The rest of my meal was great (enchilada and rice) and I loved their jumbo margarita!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "sYQyXDjGaJj7wfaqz5u8KQ"
  },
  "EORZMJMry6rDiV5rQ-w4yA": {
    "date": "6/4/2007",
    "text": "CHIPS and SALSA (2 kinds) and BEAN DIP all while you wait for your food.  Don't bother ordering appetizers, the chips and dips will satisfy you.  If you like margaritas, order the jumbo marg and sit in the nice air conditioned room.  Arriba is Mexican food, nothing fancy with a twist- just good ol' Mexican food.  You know the kind you eat and say \"why oh why did I just eat all that?\".  I come here ever so often.  I had the carnitas just recently and was was very happy with my meal.  Have Fun!  Prices range anywhere bettwen $9-$15ish.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "0UI9KTPdtkwl9lMdMT-Sgg"
  },
  "-0ClfVAUNEbRfKMqSzWpAg": {
    "date": "1/28/2013",
    "text": "Great food, short waits. Good service. For dinner try the white sands chimi, has a nice kick to it. For lunch try the specials, you'll get a drink, chips, salsa, and the special all for $7!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NWnr3vP4hVDJtAWsUNelaw"
  },
  "ddkAjFtJ38Tms_QT5UV9zg": {
    "date": "5/6/2010",
    "text": "Almost three years later and I still love coming here. The food has become more expensive, but the bean dip is still a-flowing, and my out-of-towner visitors are always satisfied afterward.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "_AJwWscnIRVtdxXuYXAHWQ"
  },
  "N6mgN2vD8KoHOXt00nwAXw": {
    "date": "2/19/2010",
    "text": "At lunch time in this area, parking sucks. Staff are friendly. Food is nice and spicy. Tastes really good though, so I get heartburn later. Prices are average for a sit down meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gIWzYF7HQ8FPhPZ8e1xhuA"
  },
  "Ck4mPWUb4ok0Sy_xlsVpwg": {
    "date": "1/28/2009",
    "text": "Read the reviews on Yelp tonite and decided to give Arriba's a whirl.  We went to the Camelback location.  The place was OK.  Nothing stupendous and nothing God awful either.  The whole place looked pretty grungy, in particular there was trash all over the floors; bits of paper, wrappers, gum and such.   The service was \"meh\".  After we were seated a highly disinterested bus person or food runner dropped off a heaping wrought iron edifice of greasy, pretty tasteless chips.  They actually tasted more like cereal than tortilla chips. She also sloughed off extra ramekins of bland, but spicy bean dip and salsa.  She kinda dropped the stuff on the table and withdrew quickly as if she were throwing a diaper into the trash.  Our server barely spoke English and barely seemed to notice we were there.  She seemed either aloof or afraid to speak, which I guess was her personal rendition of subservience or something.  The BF and I both wanted to try the White Sands Chimi after all the awesome reviews on Yelp, so we agreed that he'd get it, give me a bite and I ordered the Arriba sampler, which was like 8 appetizer sized chucks of really greazy, indistinguishable and pretty tasteless finger foods.  He ordered guacamole with his and I asked for sour creme with mine.  His guacamole did not come out on his plate or on the side, but we were charged $2.50 for it.  I did get \"sour creme\" but it was more of a frozen glop of dairy than anything else.  The White Sands Chimi seemed like it would have a good flavor but I couldn't really savor it because the intense burning was too much to endure. The BF & I literally swapped plates halfway thru the meal b/c he couldn't take the heat of the chilies anymore.  I really don't think they're hatch chilies. They burned like jalapeno.  I buy roasted hatch chilies fresh-roasted at Food City all the time and they do not burn the crap outta your tongue like this food did.  Our server never came back to check on the food, our drinks, bring more water or soda and I literally had to flag her down to ask for the check.  It was NOT busy in there at all and I saw about 5 other servers buzzing about serving the maybe 10 tables total that were seated in the whole place.  All in all -- nothing overwhelming, including the food. It just all tasted like overly greazy fried corn chips that had been in a half empty cereal box for 6 months.  Other than \"spicy\" -- there were no particularly memorable or enjoyable flavors.  I don't think that just burning my (I suppose wuss-assed, from other people's reviews) tongue on bland fried foods is authentic Mexican.  There were some people hootin' it up in the bar. I guess if you like Big Gulp-sized margaritas, this place might be cool. Doubt I'll return.  The BF liked it though, so who knows. Maybe it was just an off night for me.  The desserts did look amazing so maybe some other time we'll check it out for sweets.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "MhbjMiuR74hpqgrjdlZmoQ"
  },
  "SdhxK_QULMFFbHM4LM1q2A": {
    "date": "7/5/2008",
    "text": "Not good for vegetarians. They put meat in EVERYTHING. There is nothing like getting a \"vegetarian\" meal to find meat chucks floating in the sauce. In addition, every time I eat there I get sick. Seriously, the chain Mexican food restaurants need to be banned from Arizona. There are so many great authentic Sonoran Mexican food places around town, the chains just ruin it. Unfortunately none of them are by my house, so I am forced to try these crappy chains... When will I ever learn?",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "SWw6UreEI0KRej3lQ48uxQ"
  },
  "vACOFjPlZjAo7JWeTRi1Lg": {
    "date": "4/20/2008",
    "text": "The food here is great!  I agree with those that believe the food here is good.  I've eaten Mexican food throughout Phoenix and this is one of the best.  I live in Southern California, and I can't find anything that compares.  I love the salsa and bean dip with chips.  The combination meals are great.  Their chimichangas and burritos are fantastic.  What I also love is that the portions are large, so I always have a midnight snack or breakfast for the next day.  Arriba!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "R4ey-vi9Vj1pYvWkmwy5Yg"
  },
  "7GSJ9upijUqm6I8NGpRrmg": {
    "date": "4/27/2009",
    "text": "if you want delicious americanized mexican, colon cancer causing food, then come here. if you want authentic, go to mexico.  no but really. they have ridiculous sized margaritas and martinis.  i really think that's what they should be called. \"RIDICULOUS SIZED\" it's like \"may i please have the gallon sized cosmo? yes by myself. yes thank you i'll need a cab.\"  i love the abodaba pizza and the pollo con queso.  been coming here for years and i still love it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eh_j1Ukde1T9nyjVlqCnEg"
  },
  "7ipILUjDfsAXTkzEkPzf9w": {
    "date": "3/13/2008",
    "text": "place wasnt so great.  i came here earlier today for lunch with my dad and some of his coworkers. the staff wasnt great. they got orders all wrong. food was average. ive had wayyy better in southern california. doubt i'll go back to this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bvpqCNZYl590EwWHqPNGlA"
  },
  "mMZJr7FAiI4wCOuVpx5ZMg": {
    "date": "7/7/2009",
    "text": "Not impressed at all.  I went with my husband, and as always he ordered a bean burrito, it was very bland and way over priced.  I had a chicken and a beef taco, the chicken was horrible, and the beef was very dry.  For desert we ordered apple chimichangas which were very good, but how could you mess up deep fried apples and tortillas dipped in cinammon and sugar.  The only  thing good I have to say about this place is that every time I ordered a beer the waitress brought me one immediately and then about 20 minutes later the busboy would bring another out to me thinking I never received the first, either way, no matter how drunk I got the food never tasted good.   I would never go here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DyejokcqogJkUo3AD5iJsQ"
  },
  "GZWhL6S6P18JpDubIkfACA": {
    "date": "3/9/2010",
    "text": "It is much overpriced, and in my opinion the flavor and texture of the food was similar to what I would expect from any drive thru 'berto establishment. I don't mind that type of food when I'm paying 4 dollars and expecting to throw away a bunch of styrofoam.  But 40 dollars for two people for lunch and one drink each was money that could have been spent buying taco bell and a six pack of bottled margaritas, with money leftover for a tank of gas.  The layout of the establishment is also really weird. (And I'm coming to notice that I have an issue with weirdly laid out restaurants, but I digress.)  You're practically knocking people's food over to get to a table in the back. But this isn't a place you'd want that kind of attention.  This place gets a star for the drink being huge (and for the price, it should be) and giving me a cool buzz on a Saturday afternoon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-73QalI4iMTK0LvOhHEsVg"
  },
  "K3-rQI-a5zMYW-7uGFFzzA": {
    "date": "3/21/2010",
    "text": "Okay place.  Like the chips, salsa, and warm bean dip.  Food is mediocre.  Service okay to good.  I've been here a half a dozen times and think it's consistently okay.  I'm yet to find a mexican food restaurant I really like (for dinner, not a dive).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rWk_AbsnkXxjC_GAUlNV6A"
  },
  "xrT0ItGzSCsmmSGu98oVZg": {
    "date": "4/17/2010",
    "text": "Very good food different kinds of salsa and each one is excellent.  Wonderful service, no complaints about any servers.  Now for the food,  very, very good food,  chimichangas, burritos, tacos, pizza, charro beans, rice and the mexican pizzas.  LET ME JUST SAY it is all VERY YUMMY!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HNqXNnPIs_YUwaWPhneJMg"
  },
  "5CYsTBxhJMoVmKfpJFIftg": {
    "date": "5/7/2008",
    "text": "When my mom suggested we eat at a simple casual Mexican restaurant for her birthday/my brother's grad school graduation celebration, I was a little surprised. She herself has only been in one other Mexican restaurant years ago and loved it...no wait, I take that back. She's been in one other one but did not enjoy it as much as the first time. Eh. Anyhoo...My brother suggested Arriba because it is one of his favorite restaurants. (Note: I keep encouraging him to yelp about his favorite places in Phoenix since he lives there.)   It was not terribly crowded for a Saturday afternoon, which was nice. I was pleased to learn that they have brunch options which is served until 4 PM on the weekends, if I recall. Up until the restaurant, I had trouble deciding what I wanted to eat since I had gained some weight being around family....eh, that happens right? I opted for the make your own omelet, and it came with beans and some potatoes. The potatoes were bland and needed a little salt for flavor. My dad who has never stepped in a Mexican restaurant, only because he is not a huge fan or an expert in Mexican cuisine, enjoyed his carne asada and rice. His plate was CLEAN! He did say he would come back again, and for my dad to say that is a good thing. My mom and brother shared some a lot of food, but honestly I was not paying attention to what they ordered. Oh and for dessert? We had 3 orders of the flan. I still stand by that my mom makes the best leche flan ever, but the one at Arriba was just as tasty. I think the cinnamon sprinkles help. ;-)    Overall, I would have to say that we as a family enjoyed this place. Sadly, our trip in Phoenix was too short otherwise we would have gone back for at least a second round. We were seated right away and had great service.   PS: The little to-go menus at the front are slightly different than the big menus at the table. I only know because my dad wanted to order something else from the small menu, and apparently it is only served during the week.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R7St_jRlyZ21eusIPi_14A"
  },
  "QVfVrs4JFPRmxtJwNoHy9Q": {
    "date": "4/25/2011",
    "text": "Yum, all good, great flavor, more depth in flavor than I expected, love all the sauces, I enjoyed the fish of the day with yummy rice, guac, and sauces.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ABklVMmVoP2e8n7JVhOd1Q"
  },
  "so_8ohrhoqU3SzSNB_AzSw": {
    "date": "4/7/2011",
    "text": "I love the hot sauce here and the bean sauce you get with the chips. It's very reasonably priced and the food rocks. I don't think I've ever had anything bad. The wait staff can be a bit slow at times but that's only when really busy. Super friendly too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K20WZcZG2ToeF3bmipTqvw"
  },
  "Tp3UwDsszNNDwr2QtHXFow": {
    "date": "10/23/2008",
    "text": "A favorite lunch spot of mine.  If you get there before 11:30 am they have a \"recession friendly\" menu where almost everything on the lunch menu is $5.95.  Quite a deal considering the portions.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9ebT1nhvsbQ5MXN7FqhhA"
  },
  "IG6d4FU3dv5Ot2Ii5E2Aiw": {
    "date": "3/18/2012",
    "text": "Heard this place had the best pozole in Phoenix and it did not disappoint!  A little small, but the right amount of kick.  Homemade flour tortillas were great and we added a side of jalepeno bacon.  Very tasty.  Price just a bit high.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v2w6_BIAFS-alKP5-KOGug"
  },
  "n1c6iTk8_Ss-h_6UoW9Afw": {
    "date": "8/12/2008",
    "text": "If you're looking for chain Mexican food....stick with Macayos.  I've gotten nothing but bad food here and bad indigestion. Food quality is poor and is on par with Taco Bell.  Just drive a little further to somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wuSlr4tuOjaByyaoscMtcw"
  },
  "WGWdluBtaMvYvBibJNsKYw": {
    "date": "8/7/2007",
    "text": "Great Food!!!  The food is quite spicy. So be careful of what you order. I have been there twice now and was very satisfied both times.  They make a great Mango Margarita.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BnQomByQnL2hmniEi2mYWQ"
  },
  "9AkSwY8kft6RGmh4PdOl8Q": {
    "date": "9/16/2012",
    "text": "Yeah um this place rocks. Cool bar area. The bomb",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LfMNlTCmBih0ScN34nZJRA"
  },
  "RVipge0Vf7YSMkdZHL8zIg": {
    "date": "1/23/2013",
    "text": "Arriba's Mexican Grill is probably one of my least favorite places to go for Mexican. I am compiling a list of the best chips and salsa in Phoenix. I personally think that the food is bland and doesn't really have that authentic flavor. I wasn't a huge fan of their salsa either. The prices and service was fine. I don't think their food is horrible, I just wouldn't put it on the top of my list when picking Mexican food places to go to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I9B8lfpZZIcbsufNEfYHkQ"
  },
  "FWAjRGOXS0DfUUc1Cglshw": {
    "date": "7/11/2009",
    "text": "I have been running into this problem lately where restaurants have a choice between sauce with meat, and really spicy sauce.  This makes me sad because I am the most spice averse vegetarian you will ever meet.    Arriba has a gigantic menu with lots of pictures of the food.  I found the menu hard to navigate, especially in terms of finding something vegetarian.  I wanted the enchiladas, but the sauce options changed my mind and I got the tamale which was very sub par.  Very bland and chewy.    I suspect my experience wasn't the norm though, they seem like they would be a great place for someone who likes spicy meat.  Or cheap happy hour margaritas.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tsh3TXXPSCCmVDW6nHlE0A"
  },
  "sQ04aEPdREX_fjJmiKfXjg": {
    "date": "4/19/2014",
    "text": "Favorites here are:  Hatch chicken Especial; White Sands Chimichanga and most of the daily lunch specials.  Nice place and the food is always the same consistent quality -- good but not fantastically spectacular -- but then again that isn't a bad thing over the years. Ditto for the margaritas.  Recent visit the food was as expected but as mentioned by others below, the place needs a good cleaning!  Sometimes a mop and a few rags just isn't enough.  I'll still stop though for lunch whenever I'm in the neighborhood and don't want to deal with the 24th/Camelback crowd.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zUyOEDggJ6jZH_y7_d3_mA"
  },
  "ml8Mq152QlPfQ6nJfEo7Yg": {
    "date": "8/28/2008",
    "text": "This is really a 4.5 from me.   I have been to several of the Arriba's and have never had bad service or any problems with my food. (I have been to the locations on Camelback, at Arrowhead Mall and off the 101 in N. Scottsdale)  They bring out chips, salsa and bean dip and it tastes absolutely amazing. The chips are always fresh and they have great salsa. They just keep refilling and refilling them, so my only complaint is that I get too full and cannot eat all of my food!  Jamie M. mentioned having trouble finding a vegetarian option there, but I have not had a problem. I normally get the bean and cheese burro topped with queso dip. I have also had the abado pizza with beans vs. beef the taco salad sans beef and the cheese quesedilla. I would eat any one of those items again.   The red and green sauce are not veggie friendly, but you can easily top your meal with the salsa or their queso dip, just ask for no chorizo on it.  The margaritas are really amazing too, and HUGE! I think you pay $11 but they are big enough for 2-3 people to share. The cost of the food is reasonable.  The restaurant itself is pretty fun. They have a cool mexican/sonoran theme throughout and everything is bright and colorful.   It's one of my favorite Mexican restaurants in the valley.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rA97zeqOrUYuEM69n0Xn4w"
  },
  "e4T85ytsHgCygcf9s9YwNw": {
    "date": "6/9/2013",
    "text": "Love the bean dip you get with the salsa and chips.  I like spicy and the Hatch Chicken Especial delivers in spades!  The White Sands chimi is also very good and packs a good kick.  Really great place if you want to find a Mexican restaurant that has mild, medium, and spicy food on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gkpnqHQHkEwTrJ2QXToJ9Q"
  },
  "UsnZveUaiA5MjU9_ewHcvw": {
    "date": "4/11/2014",
    "text": "If you love spicy food this is the place for you. I always feel like a get great service everytime I come. I bring my family often because We always enjoys the food, spirits, and service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "36f-SO89NLLEeNU-gUA_UQ"
  },
  "ZS5aug15UoZInHcWcQxgdA": {
    "date": "9/8/2013",
    "text": "Visited the Gilbert Restaurant tonight at 7pm.  Host was unfriendly, took 3 other tables before seating us (a table of 5).  We did our drink and food order at the same time.  After 30 minutes without food (3 adult meals and a kids meal.  2nd child did not eat) and two tables around us being seated and served drinks from the bar AND dinner, I went to the front to speak to a manager.  Manager said he would check on it and be back to me.  He never returned to me to check on us.  6 minutes later, our food was delivered.  We asked for extra napkins and a cup of water for my nephew.  Never received either.  The two tables around us that came in later were paying their checks while we were barely eating.  A simple dinner took over an hour.  No one apologized or explained why our food took so long.  We will not be returning to your establishment as I was completely disappointed in our experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BSSBFjDpj9iZfdbSOcBdKA"
  },
  "LMdQuV4HAJe1RSILYzA5hQ": {
    "date": "11/12/2011",
    "text": "Great Hatch spicy Beans, Queso Fundido is hot and spicy love the spinach enchiladas. It's pretty good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_jAylDOGlM3HxnZIAe0_7w"
  },
  "9comJOuXcxsoK3tH5_f0ew": {
    "date": "8/7/2011",
    "text": "For my first time it was pretty decent. Just as everyone said it is pretty pricey. I had the taco plate which consists of two tacos, seasoned rice & refried beans. My bill was 11.57 for that. Pretty steep considering that usually runs $7 most places. But I can say 3 hours later I am still full as if I just left the table. The chips, salsa, & refried beans appetizer was a great start to meal as well. My friends have already planned the next visit in which I will try the swirled strawberry/mango margarita which is 24 oz for 6.99. Sounds like a steal. I hope the flavor is above the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eh63JPLF3nyOlfA0uv2PmQ"
  },
  "qw5KmJMEvfxmgpPXICJ6kA": {
    "date": "9/30/2009",
    "text": "A typical chain restaurant. In the city of Phoenix, there are way better Mexican places that are not chains. I would go elsewhere.  DO NOT GET THE MICROBREW BEER!!! I had the Pilsner and the Amber, and they both tasted the same. I have consumed over 190 different bottles of microbrewed beer, and I was stunned to see that a pilsner tasted the same as the amber. Also, the pilsner was cloudy, which is the opposite of what a pilsner should be. Pilsners are clean, clear and crisp with a thin body. The pilsner I had could be described as a confused Hefeweizen.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KhcUqD7sIQPQlZmhqaZcQQ"
  },
  "1LWdpi0C2m1ThPuNPmeQUA": {
    "date": "9/18/2012",
    "text": "Arriba has been one of my favorite places to eat in Phoenix, but tonight I have really had to examine my love of this restaurant. It has been at least 6 months since I ate there and I was really excited about going back. I was seated in the back room. I immediately noticed that it looked like it needed a deep cleaning. My table was clean, but the walls and the areas surrounding the cheesy nature scenes in the back were filthy. The service was good, and my meal came quickly. As I was eating, something caught my eye not far from my table in the nature scene plants. It was a set mousetrap. This really turned my stomach. The food that I was eating was great as usual, but it really creeped me out that the place was so dirty and that they apparently had a rodent problem. My advice to the owners is to bring in a professional cleaning team and for heaven's sake don't leave mousetraps out for the patrons to see.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jFUb8AWRswcKB2OuvqFN9Q"
  },
  "WEg-D7FgpfN6kah4n0gODA": {
    "date": "1/8/2010",
    "text": "*pffffffft*  That's how you spell the sound of a fart.  And that's exactly what I did for 2 days this week, after my trip to Arriba. It's basic Mexican fare.  We had a group of about 12 and they were great taking care of us.  I never had to ask for my iced tea to be refilled.   The food?  We made a list at work ahead of time and ordered it right before we left the office.  I ordered the fish taco dish.  It came with a side of refried beans and rice.  The beans were nasty and then I realized they probably weren't vegetarian, so I only had a bite and put them aside.  The rice was...rice.  The only way it had any flavor was because I had doused it with hot sauce.   The fish taco?  No flavor!  The fish was grilled, but I could barely taste it.  Everything was covered in some sort of white sauce and it was all that flavorful, but still covered up any flavor that *could* be in the fish taco.  I still prefer Two Hippies. The service was great, but it was really the only thing memorable.  I doubt I'd go back there.   *pffffffffffffft*",
    "rating": 2,
    "rated": {
      "funny": 19,
      "useful": 13,
      "cool": 14
    },
    "photos": [],
    "user_id": "tJ1qdNdG0tZywbgH9uw9qw"
  },
  "7RZIUD1VoXc4dJ6BxoGkpA": {
    "date": "6/22/2013",
    "text": "this place is not very impressive. not terrible, just wouldn't recommend it. it seems to market to those recently turned 21 types who want a sugary birdbath margarita and haven't figured out yet that sweet and sour is gross. there are better places to spend your time and money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6izI9Z_gB0nTjv342SBw9Q"
  },
  "5mgJyuJnnAtWo7qg_EknLg": {
    "date": "4/16/2010",
    "text": "We are hungry, we do not want to go on an expedition. We want spicy, cheesy goodness. And a margarita. We decide to hit up Arriba's since they're just up the street, and per our usual chill demeanor, sidle up to the little bar to grab a margarita, and decide what spicy green chile dishes we want to eat.   Now, I haven't been to this place in a couple years, and the last time I went, was driven there, half in the bag after watching a softball tournament. At that time, maybe I didn't care so much, maybe it was because I couldn't see the bartender making my drinks, I don't know....BUT  If you are a *new* bartender, don't upsell me a handmade margarita with Cuervo, instead of your house concoction that comes out of a tap,  use the small side of the jigger to pour said tequila into one of those ridiculous tiny cactus margarita glasses, haphazardly salted, expect me to pay $6 for tiny little glass and crappy pour, and somehow appreciate that you have any understanding of what it means to make a good margarita - you know, one where the orange from the triple sec lightly dances with the tequila flavors rising above the  sweet and sour and the tang of fresh lime juice - especially when you still haven't given me a menu, and are now serving jiggerless poured Crown and diets and Jack and diets to your 21 and a half-year old friends who are leaning all over the bar with slithering arrogance and no sense of personal space (yes, I can smell your drugstore perfume, and no, it doesn't make you pretty).  So, no, I don't want this crappy tiny margarita, and no, I don't even think I want to eat here.   We went to La Pinata instead, because that's what we should have done in the first place.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s5LPMo5XRkqUp2I-2bu65A"
  },
  "2gybu0i1afuLP3Mbx-sHhQ": {
    "date": "8/6/2012",
    "text": "It takes a lot for me to write a review and blast a company like this and to be fair, all the negatives come from their Gilbert location; the auwatukee location has always been good.  I've tried Ariba's several times and have been disappointed every time.  In the four of the last five visits, I've found the floors sticky and the tables dirty.  If they pay this little attention to the cleanliness of the front, I'm scared of what I might find in the kitchen.  Although I've always found the service to be slow and the waiters inattentive, Sunday's (8/5/12) experience was one of the worst I've ever experienced anywhere.  I thought I would take some out of town relatives to a good AZ Mexican dinner, but once we received our water/Ice tea, they were refilled once during our visit and that only after flagging down the waiter.  Minor, maybe, but when the food was delivered to the table, one of the meals was missing and I was assured it would be right out.  20 minutes later I flagged down the waiter once again and with apologizes, was told they would get it right out.  Another 20 minutes went by and my guests had all finished their meals before the waiter came by to see if we needed anything else. When I told him we still hadn't received the meal and since everyone else was done, we no longer wanted the meal and wanted it removed from our bill.  Again with apologies, he left and finally returned 20 minutes later with the meal removed.  Annoyed with the slow service I tried to return the bill with my credit card immediately.  I was ignored and waited another 20 minutes for him to return to take my money.  Save yourself a lot of aggravation and disappointment and go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yklv72xKO5q5UU7U9LzLPg"
  },
  "1FEoCTvzY8PdRy80qQxjcQ": {
    "date": "3/10/2013",
    "text": "I like this place for the most part. I find the service good and have never had a problem with the staff. They have great chips with salsa and beans to eat before the food comes which always tide the family over while we wait. They have $.99 margaritas and they also have jumbo ones (I love the big strawberry margarita... awesome.) My go-to entree is the two tacos with rice and beans. The first time I came here I loved the service and food but the last two times I came, my food came and it wasn't hot and fresh the way I'd expect a restaurant to serve it. Then again, I suppose they do have to wait until everyone's food is ready to serve everyone all at once. A definite family favorite of our family",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x6hKmvInDfuVF_psEQ-Yww"
  },
  "NixCgETjihA8Iu_pnQ693g": {
    "date": "8/24/2010",
    "text": "ARRIBA, ARRIBA!!!  I could of mistaken myself for being on the other side of the border.  Right when you sit down they great you with fresh tortilla chips and hot and mild salsa, and bean dip.  My dad, and little brother enjoy that taste of the creamy, spicy, triple \"pepper\" rated, Steak Tapico;  a tenderloin steak smothered with Hatch chile and queso fundido and served with a cheese enchilada and  rice. They both hate guacamole and black beans so they ordered double rice, and the waiter delivered exactly what they ordered. Based on how hot the food is, they rate each of their foods with peppers, on the menu.  My mother and i, ordered something with little less of a kick, and loved the Chimichanga Plate; a huge flour tortilla, with your choice of beef, ground beef, chicken, and either red or green chile. The sour cream was just the thing to top it all off. With the rice and beans on the side, it was enough to leave the place content.  The staff were dressed in traditional mexican, festive outfits, that make it a fun, exciting evening for the family, no matter what ages.   The prices range from pretty cheap to moderate, but without the need of an appetizer, it leaves you with your pockets still heavy.  We got there around 7, and it was packed, but we got in within a 10-15 minute wait, and the staff were pretty friendly. The food could of made up for it.  It was a pretty clean, comfortable place, and ill be sure to visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Qn3TCyBQTrr1xZOXHIqiuw"
  },
  "SPj8xMzMEt35JRPgYAc-4Q": {
    "date": "12/26/2010",
    "text": "Pollo con queso is ridiculous! Huge menu. Also try the white sands sauce.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5BPT1Kr62r3hm4WELtWA5g"
  },
  "B69ZrnhuTfHtBikpud-MNA": {
    "date": "9/23/2017",
    "text": "Five starts because my top plate in the world comes from this little New Mexico food restaurant. Ps:I have not been around the world. The Rio Grande Enchiladas with carne adobada are the best. The sauce is queso fundido spicy cheese sauce. It's sooooo yummy. During happy hour they have  $1 little margaritas, the house is good. Always feel so full after so don't like it as a date place.. more of a let's stuff my face place. Lunch special Monday through Friday, once of which are my enchiladas. ! Love it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P2-6fFaloQscwnrfcPBFAw"
  },
  "uRF3_0dGGFt0Do1iJdNU-Q": {
    "date": "10/28/2016",
    "text": "I came here on the lunch hour......and to my surprise the service was quick! (I ordered to go). The food was great too! Definitely going to come back here again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nX3xWxo8iRt1fKdB7iAvFw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nX3xWxo8iRt1fKdB7iAvFw/o.jpg"
      }
    ],
    "user_id": "D-_qUWMH3FqhMNqvYx56tg"
  },
  "Ptn3MOWfFbgLBoUKgsdlxw": {
    "date": "11/26/2017",
    "text": "The food was fine. My only issue was that most dishes were spicy, even when our waiter recommended them as non spicy, they still turned out to have a lot of spice in them. Their meat ball soup was good but missing something and felt incomplete. Guacamole was good but spicy. Shrimp fajitas were fine, but nothing extraordinary. Overall good experience but not wow.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YcBihZ1myhV2_mcv9j5Y4w",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YcBihZ1myhV2_mcv9j5Y4w/o.jpg"
      },
      {
        "img_id": "LvbrOwEyCVrXFoAeXfWRZw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LvbrOwEyCVrXFoAeXfWRZw/o.jpg"
      },
      {
        "img_id": "dm2oDkD6GSX5Cn9jMhbFpw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dm2oDkD6GSX5Cn9jMhbFpw/o.jpg"
      }
    ],
    "user_id": "t4xtjFAznjwgZyBDgGKpTw"
  },
  "XNRAMcGV_MnLDJBzeY-mVg": {
    "date": "9/4/2017",
    "text": "Good, cheap place to grab more Americanized Mexican dishes here in Phoenix. I would really recommend coming here for some tapas and margaritas.   Food was great, like it typically is. I really like this place.  Big, cheap margaritas as well. This place would be a good place to stop if you were in Phoenix on a vacation or something like that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "trAVeKmbiL956IaW-QO6bw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/trAVeKmbiL956IaW-QO6bw/o.jpg"
      }
    ],
    "user_id": "H-8XAPvVls9PROmECeW_Uw"
  },
  "aLbPL8VrDZsvqzTEL3D8mg": {
    "date": "3/13/2018",
    "text": "This place was awesome! Being from Los Angeles, we are spoiled with plenty of authentic Mexican restaurants and Arriba's did not disappoint. I love the hatch chile addition to many of the specialities. There were also $1.99 house margaritas being offered during our visit - you can't beat that! Worth a visit if you're in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H2iQ0JnbwwP94EO6pXtjfg"
  },
  "w_WN5m5QiBYApMUItLTQGw": {
    "date": "4/17/2018",
    "text": "Delicious! Green chile is spicy and flavorful ! Had the Carlsbad Chicken and it was bomb!! Salsa and Guacamole are a must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJTblrsMwyTnTOmnjQJU6Q"
  },
  "0lzO1onNT3CGB4LwKITefA": {
    "date": "2/7/2016",
    "text": "Had a deliiiiicious brunch this morning/afternoon at Arriba's Mexican. I'd not had anything off their brunch menu before so when our server, Michael (he is absolutely fabulous by the way!!!) brought us the menu, I was troubled having to select from the multitude of delicious dishes they offer. I opted for the South of the Border green chile tostadas which had guacamole, green chile, two over medium eggs on top, and tomato, cilantro fixings on top - I couldn't get enough of it (until of course I was stuffed!)! I added the beans and salsa before I squirted a bit of lime on top. Serious yum!!  They bring out chips, their in-house-made beans, and some salsa (they have several - be sure and ask your server) and they were delicious!! I enjoyed a margarita as well (was just in the mood) and it was a full 24oz so this not only quenched my thirst but had me pretty happy for the rest of my meal! They offer 1.99 bloodies for brunch however and I heard they were tasty. I'll have to try one next time. Ask for Michael if you want absolutely stellar service, excellent recommendations, and a unique flair .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bkYjpVOLx0jd9mmWH9v3RQ"
  },
  "O_zYewtwJx3wKOxC-j7N3Q": {
    "date": "12/9/2017",
    "text": "Yuck! Fajitas bland (if you like lots of onions it's for you). Chicken tortilla soup had stale chips in there (not soggy but stale). No rice with the fajita plate. Bean dean was bland too.  Salsa not good unless you like a salty salsa. 2 stars was for friendly service and cute place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HuBa15i43QZf3mkuHzf-0g"
  },
  "g-u9Tsv1m1hUXQx1PPRRmQ": {
    "date": "1/3/2018",
    "text": "Love the bean dip and cheese crisp the margaritas for good very affordable at happy hour",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mKfT8lLLwJKJ_RqdDlndRA"
  },
  "Pui1QuEAHxvz-PbiVzoqNw": {
    "date": "3/7/2019",
    "text": "always the best food, the white sands chimichanga is a beautiful creation! great service every time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dTvMSaebp0V9FxpMb3id6Q"
  },
  "J7mljS0SKoKbNcLnGMWoRA": {
    "date": "1/20/2017",
    "text": "My boyfriend and I stopped in to this restaurant an hour and a half before closing time on a Friday night.  It was dead inside and we stood around to be seated for 15 minutes and NO ONE came to help us.  We went down to ask a server if there was a hostess to seat us and he said someone would be there soon.  We waited around for another 5 minutes or so and no one came to help us.    Definitely won't be coming back here since no one seems to care to help customers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MtAN3V3aMvL_L0jhTzfMvg"
  },
  "G6JbCFFNftsGPl-kEpeEnA": {
    "date": "10/21/2016",
    "text": "I usually \"dine in\" at Arriba's and am always 100% satisfied but last night I decided to order take out and boy! was I highly disappointed. (Ordered: 4 shredded beef tacos with chips)  I got home, opened my container of food, bit into my shredded beef taco, and what I tasted was \"old food or overcooked\" (hard, dried out beef). I should have known something was wrong because the take out container is usually so hot on the bottom, I can't hold it. Not this night! The chips were cold too. I immediately drove back to the restaurant and asked to see a manager. The so called \"manager\" walked to the front and just stared at me like \"what do you want\". I told her how disappointing I was with my order and that my food was old. She opened the container and said \"well i tasted all the food this morning and everything was fresh\" (so I'm a liar now)?.   She then opens up the taco and sees the meat and says nothing. This woman didn't even attempt to make a move towards the kitchen to make me fresh tacos. I had to ask her to re-make the food. She takes the container and heads towards the kitchen. She comes back with the SAME containers only this time with new tacos. She hands them to me and stares. I said \"let me check them and can I also get fresh chips?\". She leaves again, comes back and hands them to me like \"leave already\".  The entire time this \"Manager\" doesn't apologize for the inconvenience, even attempt to try to make the situation better by asking \"what can I do to make this better\". She was young and was not experienced whatsoever.   ***I recommend that if you go to Arriba's, BE SURE TO DINE IN!!!!!! or if you order take out CHECK THE FOOD AT THE COUNTER.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "FocsBFRTduZnvVk_pUfNVg"
  },
  "vw9aW3HcMc3y1tyZfAZStA": {
    "date": "12/31/2017",
    "text": "Their hot sauce is mild. I requested  the hot who h is much better.  The bean dip is flavorful.  And good fresh  chips . Tried both carnitas and machaca  with green sauce.  This meal was much better",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AY_cjY1bRAD-I_K11dYvOA"
  },
  "KKkysFD0ato3qOb8eF_BGQ": {
    "date": "12/28/2017",
    "text": "Great atmosphere. Very good green chili (pork) burrito. Aka white sands burrito.  Some prices are good and some  on the high side. But overall affordable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fgfJ112m74gbLrbXgespXQ",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fgfJ112m74gbLrbXgespXQ/o.jpg"
      }
    ],
    "user_id": "CXShVNbJHHGExOW9Sqou6Q"
  },
  "NQNrzDoPBWG_3Mdo0Lkrkw": {
    "date": "9/8/2016",
    "text": "Best service I've had in Phoenix in a while. Fernando was friendly and very hospitable. There's a $4.99 Thursday lunch special - Chicken Chimichanga. I got it with red sauce, rice and beans.  yass!! Not spicy (I love spicy though), good texture; could be a little crispier, but still a great value. My Corona ($5.25) was served with a perfectly frosted mug and wedge of lime. I was greeted promptly and checked up on periodically. The chips served with bean dip and salsa was fantastic. I'll definitely come back to try more things on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OWoXbZD7ko3dzZ_ioFBvag",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. $4.99 Thursday Lunch Special. Chicken chimichanga with red sauce, rice and beans.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OWoXbZD7ko3dzZ_ioFBvag/o.jpg"
      }
    ],
    "user_id": "6mFyyszrQReUg1XTMSN9qQ"
  },
  "f1zOyDcEjxJgm3bNRUOmhA": {
    "date": "5/14/2016",
    "text": "Taco salad had so much ranch dressing that is tasted like I was just drinking straight out of a bottle of ranch.  Also some of the lettuce was soggy and brown.  My wife's plate was good...taco and enchilada, hance the 3 star  I think this place would normally be good but this time was not so bueno .....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "glDX-zY-Y9Qe0WWH6P0kCQ",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Too much dressing",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/glDX-zY-Y9Qe0WWH6P0kCQ/o.jpg"
      }
    ],
    "user_id": "Kl274K5p9Ge3LgkMGq2Mvg"
  },
  "CnN_xsZXO9pgvRfoWsYzKQ": {
    "date": "12/1/2016",
    "text": "Good stuff.  I had the green chili stew.   It was very peppery and hit the spot.  Standard fare Mexican food.  Our server Alexandria was really good and attentive.  Place was busy and the staff all work together to insure you get a good experience.  Would eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_7tJPtOrXz7XQLqEGJQ0nw"
  },
  "k5wm4JZXYmJTHsJcNtPyBQ": {
    "date": "11/16/2016",
    "text": "A cut above the norm. We had a delightful meal with fast, friendly, professional service. Portions are very large, enough to take home. Restaurant is located in a convienent area with plenty of parking. This seems to be a very popular place with the younger set.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NGRGG7nW7mv63SZ-IOfYKA"
  },
  "8PE3LoRk6_5CDmOKVD9zeQ": {
    "date": "3/22/2017",
    "text": "I love this place and the closes I can get to New Mexico enchiladas. It don't taste the same but close enough being I'm from New Mexico it's good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LyXo7gfAs8IYmb9aC1FSzQ"
  },
  "ERtmlGow621rcoXguxt4-g": {
    "date": "7/27/2015",
    "text": "At first I was upset because they didn't have vegetable burritos on the menu but the waiter decided to make one for me anyway and put everything I asked for in it. He kept it at the same price as the other burritos too! Which was like 10 or 11 bucks. I really appreciated that he did that. The vegetable burrito is huge and really good! They put enchilada vegetables, sour cream, guacamole, onions, jalapenos, beans and cheese with rice on the side. IT WAS DELICIOUS!!! Arriba Mexican Grill is the new mexican spot for me! Ask for Jonathan. He is a great server! He is the reason for the 5 stars! You guys need to give that guy a promotion or something. Great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S8bMOZqW2MBiZxHg3uWsXA",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Vegetable burrito with rice!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S8bMOZqW2MBiZxHg3uWsXA/o.jpg"
      }
    ],
    "user_id": "aeuo-PdHqd4IQSoH-Kueyg"
  },
  "H18c8IJxVqDSdE9XVp5HTw": {
    "date": "4/16/2016",
    "text": "Food always has very good flavor and the portions are huge. You also get chips and salsa/beans right when you sit down which is a nice tasty treat. If you like spicy this place is for you! The margaritas are ginormous and have good flavor. The last time I came here I brought my mom and girlfriend, on a Sunday afternoon, we got our food but had to ask for utensils and the re-fills were scarce. It was a busy day but those 2 things are simple things restaurants should have down.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ir0stkOXlnnTrT9hN0Kozw"
  },
  "Py0NS6-ylYr8ZA8rBBfb6A": {
    "date": "1/8/2012",
    "text": "Let's just say that if I'm going to be successful @ keeping my hour-glass figure, I need to stay far away from this place! But is this even possible when the food is so tempting and the chicken tastes sooooo good??!?   The Queso Fandido came with flames hovering over it and the taste matched the awesome presentation. I can't even remember which cocktail I ordered, but whatever it was, it was only one, and it had a bit of influence on the lovely tip our attentive waiter received.   I recommend and will return!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mCe4ZUDDZUUHftDFbcwkNw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Queso Fandido en Scottsdale, AZ",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mCe4ZUDDZUUHftDFbcwkNw/o.jpg"
      }
    ],
    "user_id": "GO9H-0Vl-3zDitNUolMBSQ"
  },
  "VzHwZM_rKj1-R88QAHvKAw": {
    "date": "8/4/2016",
    "text": "Very good food.  Large portions.  The rice was a little bland, but my enchilada was very good.  I will be returning in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V9MbFRNzm2ksKcyzMgR-4A"
  },
  "QCvRwofqdL3BoLxrGdQ4Zw": {
    "date": "5/8/2016",
    "text": "Have been coming to Arribas for years. Consistently good food and good service and very affordable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JTegUiKlmLNyTn0AdPSKbA"
  },
  "8cjFwoPRyWTrphxHGjVU6Q": {
    "date": "8/2/2017",
    "text": "I've been frequenting this restaurant for years and have always enjoyed the food. But when a roach crawls on the table to join you for lunch it's time to say I'm not coming back. I know this is common in most restaurant kitchens but to have one on your table tells me these critters are aggressive and rampant at this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xsDIudwx2h0OO5yWWH-IuQ"
  },
  "OgLUk8aRp9J9OGqP8ZsH5A": {
    "date": "6/6/2015",
    "text": "The food excellent and the service was superb. Sara our waitress was very attentive. Thank you for a most enjoyable dining experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QryWJvr7Nf2xuYsGt-Ar8g",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Chicken fajitas!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QryWJvr7Nf2xuYsGt-Ar8g/o.jpg"
      },
      {
        "img_id": "FttHxazrAhbv6qWmaqcujQ",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FttHxazrAhbv6qWmaqcujQ/o.jpg"
      }
    ],
    "user_id": "HfnwK-IBMq1gHOxgz-OA9Q"
  },
  "P_aSTn5r2nNVKGV-vuf2Dg": {
    "date": "7/26/2016",
    "text": "We usually go here because of the chili they provide with the chips and the enchiladas. However, the SOPAPILLAS we ordered July 21st (6 altogether) came back FLAT AND HARD..  They are supposed to be light, fluffy and soft.  We could not chew them so we asked for replacements.  Waiter said he would fix one order but came back with the same sopapillas.  This time they were FLATTER AND COVERED WITH GREASE!  Seems like the cook took our sopapillas and used a pancake turner to re-heat them in grease. Maybe he was getting back at us   for us not liking them the first time.  We didn't even try to bite these \"replacements\".  Left them on the table, paid full fare, and left very puzzled.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gms8IGio87ft4CC00VCH8w"
  },
  "I4ckI9lDDl3AHvsjWDjYVw": {
    "date": "1/1/2014",
    "text": "I went here the other day when I was in the area and my friend wanted to stop for lunch. She recommended this place, and I'm so glad she did! The salsa they bring out is delicious and you can make your food super spicy!   The best part though, was when I got the bill--2 margaritas, and each one was 99cents! I guess they have a daily happy hour every day from 3-7? Correct me if I am wrong, but yeah....that is pretty awesome. Sorry waitress, me and my friend were telling stories and laughing and were there for 3 hours and split a dish--our bill was under $11 including drinks! Haha, awesome!!  I just knocked off a star because the service wasn't super friendly...but I am not a picky little brat when it comes to that....I was In the restaurant business before too, and I know the Biltmore area can act a little too pretentious sometimes. I am going here again when I am staying in this area for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CYt_ncUjSrDQWcCnuE8Oqw"
  },
  "g08SRLd1h3az0pySqHV4mg": {
    "date": "1/10/2012",
    "text": "I've come here a few times now for taco Tuesday's with coworkers during lunch, and I figured it was time to write a review already.  I'm not the hugest fan of Arriba's, but I do dine here from time to time.  The place is usually pretty busy since its in a busy strip of town, and the service is pretty good.    I usually get two taco's and a drink of some kind while I'm there.  I guess the shredded beef taco's are not part of the \"taco Tuesday\" promotion, so their a whopping $4.99 each, which kind of chaps my a$$, if you know what I mean. I could go with the ground beef, but sometimes I want what I want.  They also have chips and dip, that come along with whenever you sit down in the restaurant.  The one thing is, depending on how busy they are, there have been a few times where I have been out of my drink completely, and been parched for a beverage, especially in the summer time.  I know their busy, but hot is hot, and dry is dry ,and I like to stay hydrated during the summer, and I'm a big beverage drinker anyways.  I'm not a Mexican food connoisseur by any means, but it seems to be average food at best.  I leave full, but not craving to come back for more.  If I wasn't going here with co-workers, I don't know that I would be dining here at all.  It's not that their bad, cause their not, but I think its more of an average/blah kind of feeling when I leave.  To my knowledge, theirs no outdoor dining here, and getting in and out can kind of be brutal with the traffic on Camelback. Overall, not a bad experience here to speak of, and I would return in the future, but nothing that strikes me as \"amazing\" or \"to die for.\"",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qibGLHABNReGeJr2w4_8yQ"
  },
  "Wq-ukTl80kzRiRMLbquNEg": {
    "date": "11/26/2015",
    "text": "Went here for thanksgiving lunch. Our server was Carolina. Good service, she made sure to follow-up with us. I ordered the chicken taco salad which was not good. Lacked flavor and the beans tasted like they were canned. My boyfriend had the chicken flautas and corn tamale. He said the tamale was delicious. We would definitely give it another try and order the tacos next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ib_ZTEwlCyz7xUCNXfmv_g"
  },
  "RFWaHuFnSiSds01I1mtYOw": {
    "date": "11/19/2015",
    "text": "Service here sucks our waiter Martin who goes by Jesus was not welcoming. He made my brother and I feel like we were a hassle and he made faces when I asked him questions about the menu. As if I annoyed him it was unfortunate that my first experience had to be with such a waiter.  However besides bad service the food, chips and salsa with bean dip is awesome. Get new staff who actually want a good tip he didn't deserve any tip that I left him but since I work in that line of business I left it. Next time I won't and yes I will be back and making sure I request a server who's name isn't Martin/Jesus.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ekDENN9LR6oFAGuIC17asw"
  },
  "JAlH2k_f8cTUvSXU08N8bA": {
    "date": "8/3/2014",
    "text": "Last time I was here probably five or six years back? Saw they have a sign out they have Street Tacos for lunch special. I never try Street taco before I always order other stuff when in a Mexican restaurant. I am glad I tried. It was pork topped with chopped onions and tomatoes and with some lime juice...hmmm...yum yum. Try to avoid lunch rush hour tho or there will be wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tQLjj5WhRaNDacOmKYGj9A",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Street Tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tQLjj5WhRaNDacOmKYGj9A/o.jpg"
      }
    ],
    "user_id": "Tnl7W-J1JvlU1sDA3C5M3g"
  },
  "tHPPVgEoKB2DuTC1V455cA": {
    "date": "12/12/2013",
    "text": "One of the best happy hours in town. Super cheap beer and food. You'll have enough leftover to take home for tomorrow's lunch. The downfall with this location is that the bar is super small -- only five seats. There are a few cocktail tables, but the lounge/bar area is definitely lacking. I'll head over if I'm by myself, but if I'm meeting people and want to sit at a bar, I'll go elsewhere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ISNbZn_lBKP7w1aGGaVyvw"
  },
  "qirBSzysgq2-rNg-mvacMA": {
    "date": "1/1/2016",
    "text": "Ok first off the decor made me feel dirty. Staff was friendly and polite. I ordered a shredded beef taco and my wife got the chicken con queso. She ordered charro beans as her side along with rice. The side of charro beans was laughable.  Jar was the size a side of sour cream would come in. Rice was very bland. My taco was good. I had some of my wife's burrito and we both agreed ajo als does it better. The cream cheese sauce was kinda weak in the flavor department. Chicken inside was moist and had good flavor. Chips and salsa were ok. I ordered some of their hot sauce and it was chunky like their salsa. I like my hot sauce pureed.  Flavor was there though. They also have a bean dip for the chips that was a nice touch. Now let me tell why I felt dirty. The decor had a layer of dust all over it. Millions of knick knacks and picture frames creating a generic Mexico feel. It felt very 1991 inside. Even the staff looked like a time capsule. Then the bill came and the receipt wallet was so filthy and shiny from never being cleaned and passed around by millions of greasy taco fingers. It made me sick to have to touch it to pay. Overall decent food. Just needs a good deep scrubbing and maybe an update.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6BlD7OcNqvgPI4hfonZXYg",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Dusty place.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6BlD7OcNqvgPI4hfonZXYg/o.jpg"
      },
      {
        "img_id": "SmDEfatKyU-xnlIqY7jZ6w",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Hot sauce and salsa same consistency.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SmDEfatKyU-xnlIqY7jZ6w/o.jpg"
      },
      {
        "img_id": "rgH8WojFXLj0R3WrNZGo8w",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Tiny side of beans.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rgH8WojFXLj0R3WrNZGo8w/o.jpg"
      }
    ],
    "user_id": "XnnpRRWSw28rwXU065gJSg"
  },
  "HownDpjmxmOXxz2aHSVstQ": {
    "date": "11/28/2015",
    "text": "My husband and I went here on Thanksgiving. We go here all the time but won't be back. We have eaten here on holidays before and they have always honored happy hour and lunch specials but not this time. We went there for turkey enchiladas but didn't see a sign advertising them so we ordered something else. After we done eating, come to find out that they did have turkey but never would have known because there was no sign. Salsa was horrible. There was a drunk guy in the bar singing loud and out of tune. They kept serving him beer. Very annoying. Several customers complained. Our server Rebecca was in outer space somewhere and it was obvious that she didn't want to be there. Terrible experience. We won't be back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iKUi4lad0Nf850riOcqdgA"
  },
  "fp6iU-L68yJuRWhoxtJ6aQ": {
    "date": "5/1/2016",
    "text": "Been coming here for 5 years for brunch. Good mimosa's and a nice breakfast/brunch selection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OkEffcUN-fs6GNH8VCluEg"
  },
  "fP1V3wcXGabTS7wOr-JSFw": {
    "date": "6/9/2016",
    "text": "Great place to drink margaritas $2 during happy hour. Sarai was awesome she kept them coming.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "55F-WujQjcsg23MD_xc63w"
  },
  "5ahXhD-LlKWAoxOXCs5ehg": {
    "date": "4/13/2016",
    "text": "My last visit was terrible. Served moldy tasting chips in a dirty bowl. The food and service has declined over the years. The wait staff made fun of a patron after they left. The Beef Enchilada had fatty pieces in it. I make better at home. Guess I will look for a New Mexican food place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-2IwTzPT4DB4tcFKdZZqtw"
  },
  "5L8jgiLmP7N4FfR49p0fkw": {
    "date": "10/29/2013",
    "text": "Would I go again? No.  i agree with some of the other reviews. chips needed salt, food was not fresh, beans were runny...i had the cheese enchiladas, they were ok...  my husband got a booger in his sprite. and the manager kept standing in front or around our table...not very comfortable.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R4-68tlEQjtxpR2PN4lKag"
  },
  "UTep0S9GQwgdqMPPKcbjiQ": {
    "date": "4/4/2014",
    "text": "I get that this is a Mexican food establishment but shouldn't the servers know more english than what's on the menu? I've been here twice and the first time was better than the second. I had a hard time communicating with the server on the second visit that made me feel like the first visit kind of a 50/50 shot that i had a good time.  The building also seems a little on the rugged and dirty side...really, REALLY dim lighting as well. I could barely read the menu!  Aside from the questionable service and quality of the place, the food is quite enjoyable. Try the cheese crisp!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kd9--kcOScxGYuDbW9wOBQ"
  },
  "ByCNKR7_bk41wwKQKIVD5g": {
    "date": "7/15/2018",
    "text": "Great Customer Service but HORRIBLE FOOD!! Ordered Heuvos Rancheros-Spicy... had no flavor! Very Disappointed-Presentation of food was not appetizing. Won't come back or recommend to anyone!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "_LKU5ioYlCL1JYXmURwD9g"
  },
  "ZOBzCyYij47NqiboDYsprA": {
    "date": "11/2/2018",
    "text": "Great food and service. Had the mini chimis and taquito appetizers which were delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bg9bPfthAfCDzmd1-FScRg"
  },
  "vVcU8N_5Qv7eRdWs3Hu50A": {
    "date": "6/28/2018",
    "text": "It upsets me to have to write such a negative review about a restaurant that serves very delicious food.   Went in on a nice Saturday afternoon and were seated immediately, no wait at all. We received what we thought was decent service consisting of quick food delivery, several drink refills, and all of our dietary and pricing questions answered.   We had paid with a credit card and upon receiving our credit card statement, we noticed an additional $10 added to our bill from Arriba's.  I really hope that this just happened to be an honest mistake, not a dishonest and purposely done action on our waiter's part and the manager's, as the managers should be overlooking all of the waiter's checks while conducting the waiter's checkout at the end of the night.   Due to this unfortunate experience and unacceptable action, I have to give this restaurant a 1 star review.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DWMDs0eRYFFZTvjqFHE5kw"
  },
  "DsJ54D8fs1wNPfssB2WpQQ": {
    "date": "1/22/2017",
    "text": "I've been hearing the commercials for Arriba's for what seems like my entire life hahaha, but last night was my first time ever eating at one.    Pros: Friendly Service  Great complimentary Chips, Salsa and Bean Dip.  My wife enjoyed her (2) Cheese Enchiladas, said they weren't bad at all.   Cons: Disappointed and a bit over priced for my meal.  $14 for a chimichanga seems a bit much.  Also my chimichanga wasn't the best, the tortilla was extremely dry, even though it was soaked in red sauce.  The carne asada wasn't freshly cooked, you could tell it was cooked earlier and just thrown on the grill to warm up before going into the chimi.    The menus were dirty.  There was literally greasy finger prints all over the menus, I  had a hard time reading them because of all the grease smudged onto them.    The location just seemed a bit dirty.  I have no problems walking into the same decor from 1995 but they could use a deep clean in there.  Overall, I could possibly be convinced to come back but it wouldn't be my top choice.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qAyh6OgfJ_09jvIKdpKI3Q",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. $14 Chimichanga",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qAyh6OgfJ_09jvIKdpKI3Q/o.jpg"
      },
      {
        "img_id": "mTXsy2EkU7wZOF5SYoAssA",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Ambience level 100",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mTXsy2EkU7wZOF5SYoAssA/o.jpg"
      },
      {
        "img_id": "DLJiWBeLUKsp_sbDYnmEmQ",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Love me some complimentary bean dip",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DLJiWBeLUKsp_sbDYnmEmQ/o.jpg"
      }
    ],
    "user_id": "9E35LB29RXJixo0563Iwew"
  },
  "-jiusElRRkJ9uQ54J4oMOg": {
    "date": "7/15/2018",
    "text": "My husband and I have been coming here for nearly 20 years.  The food is awesome, service impeccable, and we are blown away at how attentive the management staff is.  Martha, Jonathan, and Sarah are absolute ROCK STARS!  Best management team in the restaurant industry!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Gi_I0OJTVbLLRNcXufSgwg"
  },
  "FI4dLvDrniiQvHv7KBkq3g": {
    "date": "4/1/2019",
    "text": "I love Dos Los Molinos, but couldn't convince friends to go to South Phoenix for dinner. They suggested the TeePee, which I think is subpar. I am SO GLAD we settled on Arriba's! The service was excellent but the best part was our food! I had the most amazing meal, literally one of my favorite meals of all time. I ordered the shrimp and scallop enchiladas. I really couldn't have been happier. It's also reasonably priced. We can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CCCcSCoezcp2jMeVxJNGjQ"
  },
  "qwSs-8NeKJda2M0iROjQSA": {
    "date": "9/14/2018",
    "text": "Best tasting prickly pear margarita on the planet! Love the food and atmosphere plan to go back again soon",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ljxG9xmh35VVtS2wf6pLw"
  },
  "wvAIvVhtUjB6Uoo3lQkfYA": {
    "date": "7/3/2018",
    "text": "This is one of my favorite restaurants in Phoenix.  The decor is very cool, the have painting and lots of Mexican decor.  No matter where you sit there is something to look at.  This place is kind of tight in space.   Another note is the tiny awkward bathroom.  It can be a pain to get to just keep that in mind.  We love the flaming fajitas and mini chimis.   Many people might claim it's not authentic Mexican food but I guess I would define it as inspired flavors of the southwest.   I love the hatch chile dishes.   I tried many of the dishes and have never been disappointed.  They also have a big menu of drinks.   If you're around the area invite friends and have margaritas.   The kids will also enjoy the food here.  They have a breakfast menu if you would like a twist to your typical eggs and pancakes.   The severs are always very friendly and helpful.    I believe on Sundays they have a balloon person for the kids.  It's a fun place for everyone!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NHQr66EItUcrSppkAndWKQ"
  },
  "y7EWsIE0JjqvNWQ91puZ3Q": {
    "date": "8/1/2018",
    "text": "This review would be 5* is if was solely based on food and drinks. My preferred dish is the pecos sour cream enchiladas with green sauce. They are amazing! Made perfectly with rice and beans and their re fried beans are the best with the roasted chili. This is not a spicy dish at all, but it packs all the flavors. $13 may be a bit pricey for lunch, but rest assured, its two meals! Every time I order for pick up, I am given a large bag of chips with extra beans and salsa. This deserves a 5 *. The only reason I didn't give it 5 * was because the male greeter/cashier isn't the best at multi tasking. He tries his best to take care of everyone all at once but fails causing a longer wait time. It is much better to take care of one person at a time so that they are finished and he can move on to the next. He also forgot to pack plastic silverware and napkins. Thank goodness I had some!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kZwzJN4dtLsiW-ep_8Masg"
  },
  "kGwL6S7bp7rcQ6s1fKrhyA": {
    "date": "2/5/2017",
    "text": "Arribas is located right off Camelback sadly location is a bit busy 24/7, but is one of my favorite Hatch Chile Mexican restaurants in the Valley. Happy Hour Pricing is very affordable.  Food; The spicy cream cheese dip by far is yummy, and highly addictive. Cheese crisp is large, crispy and great appetizer.    Service;  Yolanda was super friendly and very outgoing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sGO-stZSJKX39qzKfUraYw"
  },
  "EYDxaXuxV3rf24sfEXdMDg": {
    "date": "3/3/2019",
    "text": "The food was good, my only problem was I ordered the special drink that was 16oz of alcohol. When I got the drink it wasn't close to that amount at all. My husband n I swore it wasn't n it bothered me for the price n False advertisement of it being 16oz so we asked several workers n then we ourselves had to measure it. It wasn't, I don't mind but don't Falsely advertise it if it's not . The manager did fix the problem after all.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PkjqMqJ9rhOd8ee4p7ND8A"
  },
  "2HixcidAJ_n5rWqAYjhAAA": {
    "date": "4/29/2019",
    "text": "My girlfriend and I just moved in near this place and decided to eat here with friends upon arrival we were quickly seated. We ordered the trio enchiladas and a margarita for two. I figured the margarita for two would be like 1.5 times the size of a normal margarita since it was only a couple of dollars more. This was the night that I learned how big the sizes were here. The trio enchiladas and their side plate of rice and beans filled us up and brought us leftovers home. They were also EXTREMELY delicious. The complimentary chips and salsa and bean dip were amazing too. And for the margarita... my friend we took is a math major in college and took the dimensions of it and it is roughly 1.7 litres of margarita for around 9 bucks. It is the best deal in the valley and it was an exceptional margarita. This will now be my girlfriend and I's go to Mexican food place. Exceptional food, exceptional drinks, and exceptional value. If I could give it more than 5 stars I would. The service was also exceptional and they were quick to bring more and more complimentary chips and salsa and bean dip as we waiting, and filled the waters as well. This is one amazing place to eat",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9uOuo8Uv8_VFbz0PFHUgLw"
  },
  "jf291HHhNgJ3NJUydjg5AA": {
    "date": "2/19/2019",
    "text": "The service and food were excellent. So much food we brought half of it home. Margarita special $8.99 not so good. Advertised at 16 oz special. Mostly ice and no liquor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CV_IBSte1yYfQY9FU4eu8g"
  },
  "0XIZX6a5Jzqh8w-d1J8thg": {
    "date": "9/11/2017",
    "text": "Don't do it. My girlfriend and I were there last night and sat near the kitchen area in the back. Our wiater was great, very friendly and attentive. However, while waiting we could see the other waiters just standing there and one of them (dark skin and a flat top haircut) picked his nose! When our drink (a large raspberry margarita for two with no trace of alcohol in it) and our food came out  it all looked good. So we ate and then as we got ready to leave a small roach ran from underneath the table to the top of the table.  Luckily my girlfriend didn't see it. As we walked out I told the manager. I'll never eat there again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "flUEOfsxld_N0mcDadIC7A",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. This thing had no alcohol to it and it was right before a roach ran on to the table.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/flUEOfsxld_N0mcDadIC7A/o.jpg"
      }
    ],
    "user_id": "-XXNYOT4fiuH2-TbqfLVLQ"
  },
  "9GclbHomkOEsaP_eIC88fg": {
    "date": "4/21/2018",
    "text": "Friendly staff, but many mistakes. First, drinks took quite some time and the non-alcoholic drinks were delivered as alcoholic drinks. Secondly, when the food came it was not for our table. Lastly, the server had his hands full and put my credit card in his mouth to carry it back to the register. (Gross). The food took FOREVER. It was good food and the staff was eager to make it right, which is why the three star review.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_t4ebet86InNL-87Pwsjg"
  },
  "F41Y_DVaIJiHMEKscDg49Q": {
    "date": "2/25/2018",
    "text": "This is pretty good Mexican Food at a low price.  I really like the \"free\" bean dip and the Chimichanga (Mini & Regular).  The margaritas are good too, but the service is usually average.  The location is in a great are, but the parking is somewhat limited If you are looking for a inexpensive dinner that is pretty good than this is the place for you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wsi3PhgrVHv4b-FRDqdqyw"
  },
  "jUw0XVvEMfSJ0gpNXZjT_Q": {
    "date": "11/16/2016",
    "text": "My husband and I stopped in for lunch Tuesday afternoon. We made it in time for their lunch specials which end at 4:00 pm. We were greeted by a friendly hostess and taken to a booth in the back where it was quiet and next to a large fountain positioned inside the wall. Our menus were already on the table. Our waitress appeared and we ordered two waters. While she was getting those, a young man brought out fresh tortilla chips, spicy warm bean dip and salsa both very good. We asked our waitress what the $4.99 special was? It is two tacos with beans and rice. We ordered two of those specials. While we were noshing on the tortillas and dip, we were brought more. Our lunch specials arrived after about 20 minutes. The tacos were delicious with crunchy tortilla shells filled with ground meat, cheese and lettuce; the refried beans and rice were also good. Our waitress, hostess and bus help were friendly and nice. It has been years since we have ate at Arriba Mexican Grill. I am glad we chose them for lunch. We will return in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vHQbTTUkm2mxq2zPpVagPQ",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Lunch special $4.99. Yummy!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vHQbTTUkm2mxq2zPpVagPQ/o.jpg"
      }
    ],
    "user_id": "WfZFj0OH9tuOdxEfSaM1vA"
  },
  "x-JNwMJA-Vc9veowJN3VTQ": {
    "date": "8/8/2018",
    "text": "My lunch today was the best ever.. Delicious with fresh ingredients. They fill your platter to the brim you can tell it was just prepared. No need to drive to south Phoenix to a very popular Mexican Restaurant. Arriba has much better food and nicely prepared. The Restaurant is nicely decorated comfortable seating. The staff makes you feel welcome. Extremely nice.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mv2dhyZ0VSx6ABV3M31pbA"
  },
  "SpTTDCdMKhSXNOCivjXbdw": {
    "date": "10/24/2017",
    "text": "Great lunch or dinner spot. Been going here 30 years. Great for dates or family outings.  Carne asada tacos, Carnitas or any terestrial enchilada with green sauce is good. Fabulous margaritas, excellent service.  The manager often checks tables for happiness. Clown faces or balloons for kids Sundays too",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4k96hr2XzTl4EkFj-TLkaA"
  },
  "35ClZJakdl_YhP06NTbdPg": {
    "date": "4/28/2018",
    "text": "Normally,  Arribas is one of our favorite places to eat but this location was awful. The food was OK but the service was the worst we've seen, from the waitress, to the bar tender, to management. We regularly eat at the Goodyear location and would never come back to this location. Additionally,  the margaritas were not even close to as good as the ones in Goodyear.  The parking lot is a disaster and handicap access not desirable. So disappointed!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qKgtvqfggq6DYQZcd3apfw"
  },
  "gS8heVGwQwHd1vw2gBJdSg": {
    "date": "7/8/2008",
    "text": "3.5 stars. If you must do a chain Mexican restaurant in Phoenix, then Arriba is your place.   Don't bother with Macayo's, Ajo Al's, etc.  Sure it's not the best, but when you want full-service and don't want the uppity Barrio Cafe type of place or the counter-service La Tolteca type of place, Arriba is good for that.  The servers are always friendly, the atmosphere inside is more gawdy than its busted bright Vegas jumbotron on its exterior sign on Camelback -- but is to be expected -- and the chip/salsa stand thing is righteous.  We were in there and out of there for dinner last Thursday in under 40 minutes (a measly 10 minute wait for our food) and under $30.  While I sometimes order the White Sands Chimichanga adorned with a creamy white cheese sauce and a mini New Mexico state flag toothpick, the Pollo al Diablo is my favorite and features a grilled chicken breast covered with fiery Hatch chile and monterey jack cheese.  It's one of their more well known dishes and is not for novices.  I am not responsible for your indigestion or hyperventilations.  Just sayin.",
    "rating": 3,
    "rated": {
      "funny": 7,
      "useful": 12,
      "cool": 10
    },
    "photos": [],
    "user_id": "Yej5B4nd8PqpHMQcmCTDrg"
  },
  "TFbV_Htla4RZyv8Pt3BphQ": {
    "date": "4/7/2015",
    "text": "This is a great little place.  Very friendly staff and the food is always           spot on.  We've had both sit down and take out and have not been disappointed with either.  Portions are good with kids meals just the right size.  We don't live in AZ but when we visit, we come to Arriba.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oaSbmBQsDX8sg-bOAn1GlQ"
  },
  "PwTOJI8_W1EJKhBnKN2CCQ": {
    "date": "7/26/2012",
    "text": "I have been to different Arriba locations and the food has always been consistent and I have always had very good service here.  I LOVE the White Sands Chimichanga, all rice,  no beans!  I have never been to a restaurant that provides beans like the ones you can get at home (you spoiled me mom!).    The Chicken Chimayo is pretty good too.   The chips were good.  I prefer the smoother chili/salsa because it is spicier than the slightly chuncky salsa they serve.  I don't really care for the bean dip but the rest of my family enjoys it.  My only complaint is that I have ordered a side of the sauce that they put over the chimichanga to put on my rice (like a cup for ketchup when you order french fries) and they charged me about $3 for it.  It was a pretty small serving for that price.  I usually try to avoid \"chain\" mexican restaurant, but Arriba is really good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l9jOntsf6-I63YtOLhawGg"
  },
  "tcmYJzhve5FumsDqOYOcjg": {
    "date": "6/11/2015",
    "text": "I have been coming here since I was 8 years old so 12 years now and I have never been disappointed! The chips aren't too salty or flavorless-they are always refilled and the plus is that they are free! My drinks arrive promptly and the servers always have my food come out exactly how I ask for it. The ambience is great because it feels like you're in a real authentic Mexican restuarant and the people are always kind and polite. I will never stop coming here! Keep up the great service guys",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "web-2Hic7FraI55rJmyxvg"
  },
  "IvXEC-DkM-YseTGz9hsVmQ": {
    "date": "3/6/2011",
    "text": "We didn't eat an entree here so I can't comment on that aspect.  We had their house margarita for two (but it wasn't 99c happy hour time) and enjoyed it, great value for 8 dollars.  One of our party had the Ultimate Margarita and he rated it 4 stars out of 5.  We ordered some guac dip to go with the chips and salsa (spicy but good spicy) and left satisfied.  The server we had was great, and gave us top notch service even though we were only having a drink and chips, although I did notice other servers weren't as attentive to their tables.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Yyau7jL3W3ba7D6qMvoHQ"
  },
  "HCcNQCPH2vWDlxHPzIgPSw": {
    "date": "5/2/2010",
    "text": "My husband and I always love this place.  We've catered from here for Superbowl events as well as gone to lunch and happy hour.  We also picked up some fresh roasted hatch chilis when they have them out front during promotional times.  They were amazing and we made some great dishes at home!  Our favorite is the pollo con queso, but there are so many good menu items.  We often get the pollo con queso and something else to share so that we can try something new as well.    We just went there tonight because Sundays kids eat free and that is just great!   Their patio is awesome because it has an indoor/outdoor feel and is backed by a waterfall for some sound ambiance!    Great salsa, great food, great with kids, I love this place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "19W2kFWTxKHanWfMq2jZew"
  },
  "ceJgc_PVaUzExr5PmcrS7g": {
    "date": "4/29/2008",
    "text": "This is one of my favorite restaurants in the valley, seriously! The atmosphere is great, first off. So much personality in the colors, paintings, plants, and other unique Mexican decorating accents. I knew it was a cool place the first time I went there as soon as I saw the Frida Kahlo painting on the wall that you see when you first walk in. There is always someone  smiling to greet you and take you to your seat, which I've never had to wait for.   It is quite a large place, and each room is decorated differently - one room even has a mural-type painting on the walls of a scene in a charming-looking Latin American town. The waitresses wear dresses that reflect their culture.   I noticed instantly that most of the customers were of Hispanic descent (a really good sign!) and that the staff had thick accents. I felt like maybe I wasn't in the States anymore!   Oh yea, and the food is SSSSOOOOO good. I like it that their menu has a photo of every single meal they serve. That rocks! And, they have levels of spiciness for the hotter dishes on the menu -- five chili peppers next to the description means you better be able to handle the heat they serve!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "Tae0HmJ96bVaIpGslSvQ_A"
  },
  "tTM2-m8bRpGI16-upVNzOw": {
    "date": "1/1/2010",
    "text": "I had the Arriba Pollo Con Queso. Deliciouso and only $10.59 for tons of food.  Festive environment. The booths in the bar area a little snug.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6K6c9SFyM0jCGXMNuyP4PA"
  },
  "82sxaY4c--F2_w23C_Cvsg": {
    "date": "8/13/2009",
    "text": "I don't give five stars often, but here's my rationale. Their margaritas rock! It's the only place that you get your money's worth when you order a margarita. They are huge! They have a good variety of cool flavors to try too. Love it. But that's not it. They have the best green chili around, and it is HOT! I love hot spicy food, and this does not disappoint. Lastly, the chips and salsa service is good. I love the bean dip and the two types of salsa provided. i could just sit there and eat that alone.   Service is usually good. I normally just cruise in and sit at the bar. Can't wrong with service with the bartender standing in front of you the whole time. :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "-OOQirK-4ptTprGFrY2L0w"
  },
  "oMd_3tlQjFhAvi5g7zsOUA": {
    "date": "9/14/2009",
    "text": "Maybe I'm biased, but I'm giving this restaurant 5 stars! You see, I'm a California transplant to the East Coast, and let me tell you their Mexican restaurants are terrible!!! While I was in Phoenix, I specifically asked the hotel receptionist about a really good Mexican place and she directed me to Arriba's  I had the white chimichanga and asked them to substitute the pork with chicken, which they had no problem doing. It was fantastic!!! I also ordered a margarita, which was huge!!! and also very good. I wanted to order the flan, but I was so stuffed from good food that I couldn't even order dessert.   I ate with a co-worker and unlike one of the other reviews, they did not have an issue with splitting our bill.   I highly recommend this place to anyone in the Phoenix area... you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "maAS8wjPYVT8rorSHe1Vug"
  },
  "NnrBRgCW6Vw6PzWMB2zVCg": {
    "date": "2/15/2009",
    "text": "Why, hello, 99 cent margaritas.    I used to go here with a friend when I lived in the Biltmore area a year or so ago, and I lived and breathed off the shrimp and scallops del mar.  Nowadays, another friend and I like to frequent Arriba for their happy hour margaritas.  The chips and salsa are excellent, and although the servers speak hardly a lick of English, service is generally pretty good.  The food leaves something to be desired, excepting the shrimp and scallops del mar, as well as the chips and dip, but the drinks and service are awesome.  It's just the right place to drop by after a crappy day at work.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "vj7e30OSjhWtI8RU5m-TRw"
  },
  "v2BcjNh3zcEF6a1NHl2mvQ": {
    "date": "1/17/2012",
    "text": "Thank you God for this place.  I was starving from a very long drive from the Grand Canyon to Phoenix and was craving an enchilada.  I googled mexi-whatever cuisine somewhat near the airport and came up with Arriba.  This is a chain restaurant, so the decor/service are all acceptable.  The hostess sat us immediately and our server took our orders.  I love the unlimited chips & salsa that come with every meal.  The salsa was surprisngly good!  I ordered the rio grande enchilada with pulled pork (they call it something else, i forget).  I was delicious!  I'm actually surprised it was a bit spicey.  Normal tex-mex food here in Boston is not spicy at all, so I guess I wasn't prepared.  I ate the whole thing, but passed on the rice and beans.  That's just not my thing.  Overall, 4 stars!  Ole!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "p8rCTA139YIM6DQNq5s5XA"
  },
  "5n-_b7nAbbT2v_mpxcb8XQ": {
    "date": "8/25/2010",
    "text": "Eh, 2.5 up to 3. It was certainly edible...  We got a bunch of takeout here the other nite. Everything was decent, nothing great. The burritos were OK. Nothing as hot as I thought it would be.   I probably wouldn't eat here again but that cheese crisp with the hatch chile's is pretty awesome....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_7FtKIGjqYXagtDjVdN7g"
  },
  "j-384D-FCUXJto2oNjY2DQ": {
    "date": "7/12/2011",
    "text": "I liked, it was spicy, the beans and hot sauce they bring to u for dipping is so so so good, also order their mini chimichangas for appetizer, their margaritas for 2 is good shear with ur company ;-) from their menu i liked the chicken, steak fajitas also the white sand chimichanga its a bomb...",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "SdZIv6z2Tgpn_49GUG5miQ"
  },
  "QCE4hnQHGr9GwpsrCtAspw": {
    "date": "9/9/2012",
    "text": "Pros: Ambiance.  Cons: Definitely not the place for delicious Mexican cuisine. The wait staff is extremely slow in providing the bill.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xVuXPljZRPk90K30A8kupg"
  },
  "_kXvDTKOBeRHJvv35KbFuQ": {
    "date": "10/5/2012",
    "text": "Awesome food. First time here so I can't guarantee all the items, but what I tried makes me think the menu is promising. Wow. Yum. And they have a daily special that's happy hour prices. Not to mention the awesome chips and dip (mild, hot hot, and spicy bean dip) that come out as soon as u sit. Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LKMPcOB1YOwKWOPsKJSRJg"
  },
  "OuL_pOfCbqHlgYwRznKVtw": {
    "date": "4/27/2009",
    "text": "Their food was okay. The issue that I really had was that most of the chicken that's used is dark meat and makes the food taste more different than you think. There's also not very many non-spicy food items on the menu that are edible.  If you want margaritas the size of your head, and extremely greasy and spicy food, Arriba's is the place to go. If you dont drink and are a weenie like I am with spicy food, then this might not be the place for you.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "U5yuZTdCBKomSNdyhU3feg"
  },
  "YLL9UG5DTbIz9H4kprKOiQ": {
    "date": "5/31/2010",
    "text": "I have been here for lunch a few times, but recently my wife & I went here for dinner.  Have to say the service and food were very good.  Both of us really enjoyed ourselves.  Even though we didn't step up to the #3 pepper\" meals, our food was plenty spicy.   Huge menu and great looking deserts too.  Give it try, you won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wSDWSlOCDAXf6eIOlN471Q"
  },
  "soNFgU86xpHgJCMirkhH7w": {
    "date": "11/5/2011",
    "text": "My visit was on a Wednesday night...the same night they offer fajitas for two for half price, $14.99.  The chicken and steak were not only plenty but very tasty.  The dips served with the nachos are also tasty.  My one complaint were the drinks. We ordered the Sunrise Margarita which is a cobination of Mango and Strawberry.  Although quite tasty is lacked KICK if you know what I mean ;) .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XQskSuKW9TzYwmYzY58EFg"
  },
  "FpyPfBkZYxe8coyJ0iJblg": {
    "date": "5/7/2009",
    "text": "Hatch Chilies... just the thought of them, make my mouth water. No one, and I mean no one does hatch chilies like Arriba Mexican Grill. Every Sunday the haul out the fire roaster and roast chilies all day long. You can buy them $5 a pound. Now, on to the dishes... there are so many, I wont list them. My favorite is the Hatch Chicken Especial. It is just the right mixture of cheese, beef and hatch, served in a mini pyrex with rolled flour tortillas and your choice of rice and beans. Unlike Renee A., I like to go on Sundays because I bypass the seating line, and go straight to the bar. No kids, and a great brunch menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "20R7Kaad_cnEDj99QbJWCw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/20R7Kaad_cnEDj99QbJWCw/o.jpg"
      }
    ],
    "user_id": "sW-Civa9U8SbXlMZa5M60g"
  },
  "rqCogHTdoPzIQfBjKrg4ew": {
    "date": "9/18/2010",
    "text": "P.P.S. The 1.99/lb HatchChile Special has ended, Like GirlScoutCookies, VidaliaOnions, et cetera,  et cetera. Never long enough......",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "I5ZsSESQutmB9H6K5e4vBw"
  },
  "JOWyumIbsS2hVUgNf_otuA": {
    "date": "1/2/2013",
    "text": "Great atmosphere and service.  Food is too spicy for me but that's my problem.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ITPb3Ecy1uv0bLNN6JlGCQ"
  },
  "G59pCiYzzJL3C4z4MixuUw": {
    "date": "8/6/2011",
    "text": "After 10 years, I am giving this place another try.  i don't know why I waited so long.  Service was great and the Cheese Crisp was awesome.  Can't wait to go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "avhs-KN20vEJ2kiqYiJvcg"
  },
  "iaHluiDTrmMzXLNkQ3xpVQ": {
    "date": "9/4/2015",
    "text": "good happy hour Friday on a holiday weekend...yummy pitcher of mango margaritas for $7.99!  kinda sweet so get a shot of tequila $2.50 - shoot half other half to spike the drink haha it's tgif.  plenty of good free chips and bean dip and salsa - good service on refills.  also enjoyed mini chimis, cheese crisp with hot hatch chiles and good guacamole...3 half price appies plenty for our party of 4 adults.  always a good time here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ChWFX5QrRn1H6VYa-9eKHg"
  },
  "aBVcwV-rt8qT1ePudLTgmA": {
    "date": "1/4/2016",
    "text": "This has always been of our favorite places until the last two visits.  We took some friends that were visiting from out of the area.   They said the food was good, but way too salty.  We thought maybe they were sensitive to salt, but then when we had the same experience at another location I knew something had changed.  The food is become extremely too salty.   Yesterday we were at the Scottsdale location and had to return our grilled fish filet, because it was not edible.  Even the beans and rice were too salty.  I tried to contact them via their website but it is not working.   I hope they see this review and make some changes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kP5cJmpIZVdQwq9tVyyfDw"
  },
  "QGHAGqetQLn5wrX44zf2SQ": {
    "date": "3/2/2015",
    "text": "I like that they give you a bean dip with the chips! I had the enchilada plate which was mediocre but I enjoyed dinning here and I will return to try some other plates.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1p9C4RYpklNUcUXvxGjpeA"
  },
  "gAY1pv-r5WJLvDigbqjw_Q": {
    "date": "4/16/2015",
    "text": "We always end up going on a Sunday which is nice because they usually have a lady doing face painting and ballon animals. I think it adds a lot of fun to the day seeing kids sword fight with balloons. The staff are very friendly and can provide useful information about the menu items if you need help making your selection. The food, and of course the plates come out hot and always well prepared. They offer all the staple food including complimentary chips and salsa, which sometimes is hotter than you probably will be expecting. That could be good or bad for you depending on your heat tolerance. Demerits for a difficult parking lot to navigate and on really busy days you may be required to take a bit of a walk. In the summers this is not ideal. You may also find the dining space cramped, but it's never really bothered me, much. Great place for the whole family especially on a cool Sunday afternoon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dav5aXAklIoiWQTA3wmfJw"
  },
  "QnrNJ5ea5LBOOptkQA7Fag": {
    "date": "4/22/2013",
    "text": "Finally doing a review after visiting Arriba's for years. This past stay stuck with the Chimichanga with Machaca beef covered in Green Sauce. Loved it! Over the years got the Posole (since I have a Posole addiction); but I resisted this time. If you like spicy head to Arriba's. They also have great margaritas, had the mango margarita. Will be back again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w34SWUnjFpmpQMYOLrs51A"
  },
  "XQgNOVUkzSO3L1XBRKMjjQ": {
    "date": "5/31/2010",
    "text": "Service -- not so much. :( Food - - we just stopped in for nachos, and they were super cheesy.  Margarita - - 99c during happy hour 3pm-6pm. Meh! Tasted like a lot of sour mix, but what can you expect for 99c, right?   The nachos were $11.99, but then marked down $2 to $9.99 for happy hour.   Needless to say.. we've had better nachos. But really the lack of service will prevent us from coming back.   What were we thinking? :)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "igll2PdsMvQHzJhzttrx1A"
  },
  "H012zc5D0EEowsuUS5yqFw": {
    "date": "7/28/2012",
    "text": "I enjoy eating here frequently, my favorite is the White Sands Chimichanga, it  is always good I have not had a bad meal here ever. The staff is friendly and the service is excellent. I also recommend their chili relleno.  Their prices are moderate and the portions are generous. If you want good New Mexico style mexican food in Phoenix, this is the place. Every part of the meal is good. No canned beans or tasteless rice here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cD8kW_56oxtkSd_4TtfHYQ"
  },
  "4xQU3sFJP-kVUG-mTqKHoA": {
    "date": "5/6/2010",
    "text": "I feel like this is partially my fault for eating at a Mexican food place with a neon billboard in front. Someone told me it was good so I decided to go the margaritas were just right and the chips and dips were yummy. I ordered the floutas and yuck! The meat could not have been beef, I ate two bites and that was it. Our server asked if sour cream was okay said sure and then noticed a two dollar charge for a lump of sour cream on there. I really wish I would have just stuck with Ajo Als up the street.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_mfVg2apfsD8BIpgCMoIig"
  },
  "xw3__BBt3RIPxX8agGYwSg": {
    "date": "5/6/2012",
    "text": "Oh Arriba, how I miss thee! We just moved from AZ to MN, and what we can't find . . . good Mexican (or New Mexican, as some of Arriba's dishes are). My absolute favorite dish is the Rio Grande Enchiladas - the spicy meat, the cheese - mmmm!   We recently went to the Arriba in Tempe (or Awatukee?) and the service was awful, but our typical Arriba is Phoenix, and the service is good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "O3pLkBtaiDueRgllK_97Hw"
  },
  "r9PHFuNoTjNZkODVcTqE0A": {
    "date": "8/1/2014",
    "text": "To be honest I was fairly disappointed with Aribas. People had given me mixed reviews prior to me going there and it seemed either people really liked it or weren't impressed at all; and upon going there myself I could see why. At first I was shocked and ecstatic by their dollar margarita special during happy hour, however when we got our drinks you could barely taste any tequila (although they were only a dollar, it literally felt like I was drinking flavored water). The chips and salsa at the table were awesome (probably the best part of eating there). I ordered enchiladas which were pretty undercooked and didn't really have much flavor outside of the melted cheese. My friends got the spicy chicken entree and a chimichanga. The spicy chicken was ridiculously spicy and not very good; the chimichanga was pretty good however but nothing special. Out waitress seemed very aloof the whole time we were there and the one thing that bothered me the most was a small side of sour cream was $1.99!!!!! despite the meals being pricey to begin with.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjVvYDqN8Z5LtlVp9zDMkg"
  },
  "uXsh91hVP-_H6WKh5V5wgA": {
    "date": "1/20/2013",
    "text": "So Christmas \"dinner\" was kind of an afterthought this year...travelling and a time warp sort of forced that on our little merry band and we were famished by 9PM.  We went to a couple of other places first, one had an excessive wait and one was just a perfect storm of a bad idea (more on that in another review).  We ended up back at Arriba and, I must say, the reliability of a good Mexican meal (combined with a good marguerita) really helped save the day.  The staff was upbeat, even though they were working and (as always) the pricing was really reasonable.  So thanks, Arriba, for helping rescue our Christmas \"dinner\"....it was yummy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EMM4HqI1mV7SwqXen6knJw"
  },
  "eQiQqpSJLoC-Sl4_sckr-A": {
    "date": "7/2/2012",
    "text": "I really like this place just for their fiesta ambiance, good salsa and chips, and great service. They offer such an extensive variety on their menu, it's fun going back just to try new things. Their enchiladas are GRRREAT!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dVywlQksE_8vY2PnZXspBQ"
  },
  "1ZBgSmDXhBjn-FrhIYhkCw": {
    "date": "5/28/2013",
    "text": "I am not a fan of chain restaurants but Arribas seemed to be a local chain so I decided to try it during a visit to Phoenix. It was the best Mexican food I have had in a long time. Some may argue the food quality but I am a sucker for large margaritas and a Mariachi band. Most Mexican places I visit on the East Coast are afraid to make anything spicy but Arriba has heat indicators listed on the menu. Try one of the 2 or 3 chili listings if you like spicy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NMHXhk_1OnKcGJF2r5IPzA"
  },
  "cBuZ_s4WeUilPxL6VB409g": {
    "date": "11/20/2010",
    "text": "Good Mexican food, but not great. We got there just in time to take advantage of the .99 margarita's, but the food wasn't anything super special. The salsa was knock your socks off hot, which kind of numbs your tastebuds to other flavors and everything was very peppery, which I'm not a huge fan of. I got the chicken tostada and the hubby got the chicken picado, which were both pretty good. The bean dip was awesome and the service was fantastic though.  I think we'll go back sometime to try out other dishes to try to get that rating up a bit. If you go for happy hour then the prices are very reasonable...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XiqziC8skzXUSc0UdNNdAA"
  },
  "NRzn8afcarwF_kyTIyJy-g": {
    "date": "8/16/2015",
    "text": "I've been coming here since it opened. The prices have increased but the food remains as good as ever. Especially if you opt for one of the New Mexico inspired dishes. They are generous with the chips and always have two salsas and a delightfully spicy bean dip. I've always enjoyed the Chili Colorado, White Sands chimi and the Rio Grande Enchiladas. Recently as I've gone to lighter entrees, I've ordered the Roswell Chicken Tacos. Although I've had less than stellar service in the past, lately it's been fine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OuiErHx5Gt7uisrZC8XUqQ"
  },
  "ydZuZye9DXwydRL-dsvAFA": {
    "date": "1/10/2013",
    "text": "This was pretty darn awesome!!!  I went here with my roomie a couple months ago, and this place rocks!!  I was full from the free chips and salsa before I ate my enchilladas, though...  :P  My roomie ordered the Margarita for two people, and when our server brought it to our table, my eyes were so wide from how large the drink was!!!  We couldn't even drink the whole thing, because my roommate had to drive, and I couldn't drink the whole thing myself!  I think it was only $8.00 for that large Margarita, too, unlike the $12.00 you spend for a tiny drink in Old Town Scottsdale (yes, there is a time for Old Town Scottsdale too, though.  :P).  The restaurant and bathrooms were very clean, the staff is friendly, and I left full and happy.  This is definitely a place that you should go and check out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i0MKqqfJ3InvP1SqZF9sjg"
  },
  "wXJajcVnl-TDHE11eK2-sg": {
    "date": "7/22/2011",
    "text": "Best part of dining experience (6pm on a Thurs nite):  We were seated right away and chips, salsa, and bean dip came immediately to our table.  Our waiter appeared quickly to take our drink orders.  Requests for refills on chips/dips and extra napkins were taken care of promptly.  Our food was good, hot, fresh, and plentiful.  The flour tortillas on the side tasted a lot like flour tho.   I had the Chile Poblano with chicken and green sauce, refried beans and rice.  Very nice presentation and tasty!  My friend had the White Sands Chimichanga and she said it was good too.  Our waiter, Calixto, gave us excellent service and attention to detail.   Not so good aspects of dining experience:  Crowded, warm, noisy.    Watch out for soft drink prices: $2.49 and extras, a small scoop of guac also $2.49.  Ladies' restroom very small and hot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zPH0cUQ_VU48kPxrEMxmZA"
  },
  "8pFDxlgk3fOoMmQK4Y-0yA": {
    "date": "7/27/2019",
    "text": "Best margaritas and best service in town! Have been coming here for years and it never disappoints. If you should be so lucky to have Onieda as your server, you will have the one of the most pleasant experiences. All of the staff is friendly and welcoming and will do their best to accommodate all of your needs. Truly amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zcGGYF0Qwbf6SMRZhtiiug"
  },
  "7wPFNwazbnCn3uSlQR1fAg": {
    "date": "7/19/2019",
    "text": "Had a wonderful experience, the staff there are amazing. Heather is a very amazing worker her personality with customers is excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "v8Kuj2YM9-lx7UcSixo_jg"
  },
  "hzdZ9deoIL5t70Vcl40DCg": {
    "date": "5/5/2019",
    "text": "Been to multiple locations and can not get a COLD beer at any of them. Food is great, tasty.....would be better WITH A COLD BEER. Bottler or draft...pretty darn tepid.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BoInVv8to_1E3Xz5JtD1FQ"
  },
  "cOtOngmYv1leei7vCob8fQ": {
    "date": "8/12/2018",
    "text": "Service: Jamie was very nice and had a cheerful demeanor.    She informed us that during happy hour, all appetizers were half off.   We went that hungry and so we proceeded to order an app and a small main dish.    Food was decent.  Large (dare I say, unhealthy) sized portions.    Upon leaving, the check was handed to us and the numbers didn't quite add up as they charged full price for the appetizer.   I asked Jamie who said she would look into it.  She \"spoke to her manager\" and was informed that the particular appetizer that I chose was, in fact, not part of the half off HH promotion DESPITE the fact that it is listed on the appetizer page.    Also, bear in mind, the nachos and the Mexican pizza (which I ordered) pretty much consist of the same contents and the nachos were half price.    Needless to say I was disappointed - an incorrect expectation was that and the lack of customer service to make it right was not present.    I will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "YBNtm7-mDi0Z05KxCMIYuQ"
  },
  "jLBW9dL_HRJegazIAvUfPg": {
    "date": "11/23/2018",
    "text": "First time here and definitely won't be the last as I frequent the Phoenix area often.  I ordered the hatch chili cheese crisp first.  My mouth was on fire but it was so delicious!  I ordered the chili Colorado.  Excellent flavor!  Others with me ordered the chicken and steak fajitas, which I tried.  Also, so delicious!  As well as the chili relleno.  Everything was prepared to perfection.  Highly recommend this place.  Joseph was our waiter. Excellent service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1cMqWmiK2ySzUa6N27aj4w"
  },
  "9dRre8jkzujWAR1N-uepgQ": {
    "date": "3/24/2019",
    "text": "My most favorite restaurant ever. I'm a regular there. The salsa is amazing. I like the hot one the best. And the bean dip! So good. I love their margaritas.....the margaritas are my favorite part. everything I've tried has been delicious. The staff are all so nice too. No matter who we get as our server we're never disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VG99DHPjl6p3yhu-aoY2QA"
  },
  "FO-52Z9RvAZeolkwpoEC9A": {
    "date": "3/20/2019",
    "text": "Really good New Mexico style Mexican fare. Everything we have ever tried from this location has been excellent.  On the downside the wait staff seems to turn over continuously and is hit and miss on table side service. It's never been terrible however and the food keeps us coming back.  Parking and entering / exiting the lot can be an absolute pain due to its location. There is a rear entrance at the back of the parking lot that makes getting in and out easier once you learn how to use it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "d7kwiUgpQLC04YOhb1C4hg"
  },
  "eCYJqgAHB3yku8KyBGvpCw": {
    "date": "3/11/2019",
    "text": "I have been attending Arriba Mexican Grill for a couple of 10 years now and I can honestly say that as far as chain Mexican food restaurants with free chips and salsa plus bean dip and occasional mariachi entertainment not to mention the rare creepy balloon clown for the kids go, it is the leader of the proverbial pack. Every time I am there I can count on some good times and perhaps a memorable happening or two, such as the first documented sighting of #arribakid or the time a beetle showed up. The food is consistently fair to middling, with my regular plates being the chile colorado, carnitas and the green chili beef chimi. This isn't the best or even great or really good Mexican food, but it gets the job done and I really like the idea of free bean dip. Usually at other spots it's free chips and salsa with no bean dip. Free bean dip goes a long way for me. So why did it take me so long to write a review? Well, in this case I can be counted among the reviewers who wait until they have a bad experience to speak on a place. My wife and I arrived at the Arriba on Saturday night around 7 PM aka full-on Arriba hour. With us was our 5.5 month old baby. We were immediately greeted and escorted to a private table, which was bullshit because everyone knows booths are better. My wife glanced back at me and I gave her the \"do something before I do\" glare, after which she calmly asked the hostess, \"Could we maybe get a booth?\" \"A booth? Let me see if I have any available.\" \"Okay, great\" Two minutes later we were standing next to our assigned booth while the staff scrambled to clean it for our dining pleasure. We were extremely satisfied with the effort put forth, and would have been satisfied overall with our seating if not for the table directly across from us, where five or six jetsetting cool kids sat being all loud and opinionated. They seemed very much like hipsters and it occurred to me that they may have been eating at Arriba ironically. The thought boiled my insides and I made sure not to look over at the table, for if I would have locked eyes with one of these snotty little punks I might have snapped and that would have spoiled the entire occasion. I didn't mention anything about the table to my wife, who honestly may not have even considered the table to be a nuisance. Also, I hereby acknowledge the fact that this table and our proximity to it is not something that Arriba's staff should be blamed for, and as such I am not blaming them, merely framing the scene for the events to come. I wasn't very hungry because I had eaten a big boy lunch, and I knew I was going to get ripshit on bean dip n chips, so I decided I was going to opt for the two taco platter. I knew that while you could always order the two-item combination plate from the back of the menu, and choose from items such as tacos, burritos, enchiladas or tostadas, there was also a menu item called the taco plate, which was two tacos, beef or chicken, plus rice and beans. Now, the two-item combo plate costs $11.99, but the taco plate costs $10.59. So if you're like me and love gaming the system for $1.40, then the taco plate is most definitely the way to go. I asked the server for the taco plate and asked if I could get one beef and one chicken taco. Done deal. My wife ordered the sampler platter which is always a good time.  We enjoyed our meal in spite of the loudmouth millenials trying to ruin the whole world with their bloated musings on organic food and a music style called \"noise.\" My wife and I laughed and carried on, having fun with our baby and our seriously okay meals. Everything changed when the check arrived. I glanced over the charges whilst extracting my wallet and gasped in horror when I realized that I had been charged for the two-item combination plate instead of the taco plate. All of the food I had swallowed in ten minutes threatened to come back up in an Old Faithful fashion. Gone was all the happiness and tra-la-la that had preceded this ghastly discovery. My plans of getting over on the man for $1.40 had been dashed to bits. I frantically ripped the bill out of its holder and shoved it at my wife, pointing out the egregious offense printed clearly on its face. My \"better half\" smiled uneasily and shrugged, looking back toward the 5.5 month babe sitting in her car seat (who can't even eat tacos let alone understand their value or more importantly the besmirchment I had just suffered). I glared around the room, first toward the kitchen door which was swinging wildly as if someone had just run in to tell the cooks about how badly I just got hosed. Then I heard the laughing. I looked over at the millenials, who were in the midst of some kind of new age hot yoga laughing fit. None of them were looking at me, but I could tell it was the $1.40 slap in the face that had incited their sneering guffaws. All I wanted was to watch everything burn. Luckily I had cleaned my plate or else I definitely would have been setting fires. Oh well.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wR-jAGrFGnDfRBoGtkwLwg"
  },
  "EhfsahzOocEswREm4LuHog": {
    "date": "3/3/2019",
    "text": "Had a party of seven and they handled it well. Every dish was delicious and I would recommend this place to anyone in the area or not.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ntRsoAbJa67pK-wECqs7zw"
  },
  "30yLCUdkREGTSCGHtCpzhA": {
    "date": "1/24/2017",
    "text": "This place has been for many years now. Obviously, many people must love it. I can't say that I love it.  But, I like it. A few years ago, I was here for lunch and got some type of creamy item. I got food poisoning .I never wanted to go back. However, I came here with my friend for lunch because, she wanted to go here. So this time it was a lovely experience. I got the fish tacos ,nothing creamy. They were very good!! Very good. My friend got some combo dish with lots of sauces on top. But, she was totally healthy after eating it. She thought it was divine. The chips and salsa or also very good.  The service was great. The manager even came over and talk to us. We were sitting in front of the fireplace and he even turned it on for us. With the rain and cold outside it was so nice and comfortable. So I'm going to say, that I do  like Arriba's, And that I  would definitely return. The restaurant is beautifully decorated with lots of colorful paint. As well as cool artwork. Lots of parking all the way around the building",
    "rating": 3,
    "rated": {
      "funny": 7,
      "useful": 10,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "KNysOndJxhGt8xXplQqVNw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. The wonderful fireplace that was next to our table",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KNysOndJxhGt8xXplQqVNw/o.jpg"
      }
    ],
    "user_id": "7GVA958q4zs5Z8cdHauU5Q"
  },
  "6Byud_w4AbuLjdZILuDMqg": {
    "date": "7/17/2018",
    "text": "We went last night for dinner & that was the worst meal ever. A waste of money!! Food was disgusting & all employees catered to the caucasian customers only. Was really discriminating. I will not be returning.   No Stars for this restaurant",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "86ZJhLXJD5QRNsVejpJ_lw"
  },
  "s1rPJtTDovTKRX4Qk73sZA": {
    "date": "1/8/2019",
    "text": "Really like this place - new Mexican style. We always sit at the bar because we love Oneida and Heather. They make a pretty awesome handmade margarita. The New Mexico enchilada with chicken is my favorite. :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HQSbyK_HQwAC7thdUVXcMQ"
  },
  "ZJi3p1aq9Zmi_iSQJC4U5Q": {
    "date": "10/18/2017",
    "text": "Ok Arriba - I want to love you.  I really do.  The last three times I went to happy hour, during happy hour, the bar tender tells me that all the items on the happy hour menu are not actually on the menu.  The last time I was there- I'll quote the bartender \"anything with cheese\" is not on the happy hour menu.  Although the menu they gives you says otherwise....cmon guys.  Dinner last night was meh- carne adobada was hot temperature wise but not spicy.  Beans were a bust and seemed watered down.  .  Go for drinks and chips - go and see if they have the same happy hour technique for you too.  **update and my final visit.  The hostess team is awesome.  The remainder of the crew just doesn't have any effs to give.  The service is meh, the food is meh, and the chips are just flat stale.  Summation- about $25 per person for dinner drinks.  If this was a dive bar and beers were $1.00 it would be legit.  However it's not a dive bar, it's just a dive.  Skip it- trust me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_dzH4ozyTWigVPySzzQ3rw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Men&amp;#39;s room and the last straw for my relationship with Arriba. .",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_dzH4ozyTWigVPySzzQ3rw/o.jpg"
      }
    ],
    "user_id": "N2OUdPlS9RQHjE3zB7dtQw"
  },
  "QwfzBqY7PHfm0ervXMuc_A": {
    "date": "6/1/2018",
    "text": "Always enjoy Arriba's Mexican restaurant. Being from Albuquerque it is imperative to eat everything with green Chile's. That being said,  Arriba's delivers.   Spicy if you want. Great selection. Great service.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lFY1j36uRMNXzvuyFDby4w"
  },
  "JFHsUUCojs4dwGLrGj3sbA": {
    "date": "9/2/2018",
    "text": "Our regular go-to place for Mexican food but last night I ordered 'fish' tacos and they came with cheese on them. Someone doesn't know the cardinal rule of fish and cheese.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fEMdDmchvJeMX4fP9VLZyw"
  },
  "aNJ-iiryatGFXs4bDR1SCg": {
    "date": "11/5/2017",
    "text": "When in Arizona -- try Mexican food. Definitely in Hawai'i, you don't get authentic Mexican food, so I'm glad my friend took me to get some! First off, portion sizes are humongous! Definitely worth the price!  The atmosphere made you feel like you're in a real cantina; lively and definitely spacious. Staff and service were wonderful. Always made sure to re-fill waters and chips -- unlimited chips and dip plus salsa.  I ordered the Pecos Sour Cream Enchiladas which were two corn tortillas with chicken and sour cream, covered with green or red sauce. Also served with choice of beans and rice! Very filling and quite delicious! My friend is a very spicy food person and ordered the Hatch Chile Relleno which was a Chile covered with ranchero sauce and stuffed with jack cheese. Served with the same fixings.  Super glad that my friend took me here; only wish I could get this in Honolulu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oFkBHUxqVuAb-BrdKEE7dA",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Unlimited chips, dip, salsa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oFkBHUxqVuAb-BrdKEE7dA/o.jpg"
      },
      {
        "img_id": "eye1_WDOsDav09mk7VzaCA",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Pecos sour cream enchilada",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eye1_WDOsDav09mk7VzaCA/o.jpg"
      },
      {
        "img_id": "wHXvoy__lGkd4YT_Z8TPSA",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Hatch Chile relleno",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wHXvoy__lGkd4YT_Z8TPSA/o.jpg"
      }
    ],
    "user_id": "XcCovlR56b_uaNKymmZ4RQ"
  },
  "SJRvLcFBL0k93HjWGw9FpQ": {
    "date": "10/18/2017",
    "text": "I have gone to Arriba since I was a younger and have usually been very pleased with the experiences.  The food is delicious, and not too Americanized. Their hatch chili's are *amazing* when added to dishes. The queso fundido and beef fajitas are terrific each and every time.  The last time I was there, the bathroom was absolutely disgusting, and not just in a 'the trash is overflowing' sort of way. I brought it to the hostesses attention, and did not use it again so I am unsure if it was addressed",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L89_l5fe8ZAMdWQCfECUag"
  },
  "Ov8ubFSkgDc_gcM2Q3tQ5A": {
    "date": "7/26/2018",
    "text": "So disgusting. The restaurant itself was nasty. Started off with a ripped up, sticky menu. The cup that was brought to me had food smashed to the side and I needed to replace my drink. The waiter doesn't understand what \"not a lot of cheese in the quesadilla\" means. Quesadilla was packed with cheese couldn't even eat it. The tacos were dry. The salad tasted dirty. The complementary chips were stale and tasted like they came from frys. The salsa also tasted like it came from a Pace jar. Everything was just nasty the presentation was gross the salsa was splashed on the side of the Cups. On top of that the service was not all that good.  Even the people eating there look like truckers and low class people that didn't mind nasty food.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mtsT8yJfRJnbwlpPqCRYkA"
  },
  "qPKumaTaoOboq63QwagJ7w": {
    "date": "1/29/2019",
    "text": "Really good food! Christopher just kept the bean dip flowing and that's the exact reason we wanted to come in tonight for revers happy hour was the bean dip.  Well no disappointment there.  Fast fast service.  We came in right before close and still were treated like it was dinner time.   My mini Chims. Yummm.  My friend got a quesadilla and it was so tasty.  Thankyou to the guy with the cool hair by the bar who got me my grenadine when I was being Indecisive before leaving.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "RfAXiQA1E1AhpfFdaVVRGA"
  },
  "-ioq6gwRxKqUfsFbAYueXA": {
    "date": "4/24/2018",
    "text": "Early memories of cheap margaritas and half way decent Mexican food. This screams Arriba all day long from the plain corn chips found stuck together. Down to the salsa that's tastes like it's made fresh once in a while. There is something charming about this location though. I continue to return because in a strange way the imperfections make me smile. Warmed up Fajitas complementing my margarita flowing out of a soda gun. Some of the best servers and bartenders in the food service industry can be found here. Join the fun, throw your hat in the air and just shout Arriba!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "amW0WVi-G-psVD85eIeRzw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/amW0WVi-G-psVD85eIeRzw/o.jpg"
      },
      {
        "img_id": "UZ5UZZr7IeyL8D4b8Yvizg",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UZ5UZZr7IeyL8D4b8Yvizg/o.jpg"
      },
      {
        "img_id": "6lw5kFOWH3HFq7czrw9T6w",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6lw5kFOWH3HFq7czrw9T6w/o.jpg"
      }
    ],
    "user_id": "Z_PFVN3z3RpEAMwe94cqVQ"
  },
  "oVt9dcedtmWd_IKpnWNJjQ": {
    "date": "2/21/2015",
    "text": "Best Mexican I've had. Had a chicken chimichanga and it was fantastic. Definitely coming back next time I'm in town from Colorado.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2DEGmig3TK-xgCY0aA7Ww"
  },
  "Ldnj2TxcO1dAMyA2148jvA": {
    "date": "7/24/2010",
    "text": "Our team from work came here for lunch.  It is my first time!  After all these years, I finally made it inside for some food.  I selected off the lunch menu (quite a selection for lunch).  I ordered the Poco Pollo Con Queso.  It is a golden brown chicken chimichanga topped with two kinds of cheese.  It comes with rice and I got black beans.  YUM!  It was really good.  The refills are drinks were fast and you did not have to ask.  The only weird thing was they took our bowl for the chips away.  I thought they were refilling it, it never made it back to our table.    I agree with Jacob L. the deco was WAY over the top.  Almost touristy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iDlkZO2iILS8Jwfdy7DP9A"
  },
  "-Ofux98lPm6a114iRqSTXA": {
    "date": "5/13/2015",
    "text": "Had Posole, bland and would not recommend! The happy hour margaritas were the sorriest I've ever had!. YUK! Waitress was nice,  chips were good, hot sauce- not good- no flavor.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0VII-XnYMesCjBOtktWtDw"
  },
  "PTp0lCAveU62vIaUvUkcGw": {
    "date": "10/26/2014",
    "text": "Gross. This place is a disgrace to mexican food . I swear everything in our plate came out of a can. Not fresh and not by anyway good. I hate leaving a place hungry but you couldn't force half that stuff town my throat.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Aw6jQyL8t2vXRgKIq7m5PQ",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. That is not sour cream. That&amp;#39;s a huge yellow glob of gross mayo. What the heck is this place thinking.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Aw6jQyL8t2vXRgKIq7m5PQ/o.jpg"
      }
    ],
    "user_id": "ANyoazSNFS38sKTxN9kZoQ"
  },
  "mZmS--I2Ng6CGCuWwmFBoA": {
    "date": "5/22/2009",
    "text": "Well i seen some 1 and 2 stars, don't know what the hell they talking about, but this place rocks. I gave them a 4 star cuz too many people take their kids and cant control them there. LOL.   But the food is the SHIZZNIT!!!!   The Chips they bring out are nice crunchy and salt to taste. the salsas and the Lil bean dip uffffff, love it.   The food is nice and spicy, since I'm Mexican i can handle the heat.  I always get the Pollo con Queso, can you say DELISIOSO!!!  My favorite.   Waiter/es all are kind and helping on ordering.  If your into Mexican food, its a need to try.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Kzp3q208Jl5eyQYVKg0W0A"
  },
  "A0jRyzMp-oiETadl_JxOOw": {
    "date": "7/4/2016",
    "text": "Looking for a New Mexico Cuisine Aribas is the best that I have had. The green Chile is authentic here and the service was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPd06K_RyzcfFUMQqjwN5Q"
  },
  "7IHbiCfw74sijX_rZFqsbA": {
    "date": "6/6/2013",
    "text": "Went to Arriba today for my second time.  My first time for lunch and tried the $4.99 chicken chimi lunch special.  The service was good for the most.  Good salsa served with the chips.  Everything was good for the most part, Chimichanga was served with rice and beans.  Good enough flavor.  Nothing spectacular.  The Chimi was a bit smaller than it looked on the add and what I am used to seeing at other places(probably about the size of three tacquitos rolled together), but well worth five bucks.  Still I am not a fan of deception, speaking of which when I ordered I was asked if I wanted Sour Cream and Guacamole, which I thought was an offer not an upsell.  It ended up coming up to $2.25 together, nice job bumping up my bill by 50%.  Overall though I would return and just avoid the upsells.  The food is good, not great, but you will not find a whole lot better for $4.99.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "I-q-YN6E-kabXeriVckI8A"
  },
  "XLvH4hDfF02SFqnvGT63cQ": {
    "date": "4/18/2011",
    "text": "Unfortunately, yesterday's visit was one of the worst dining experiences I've had during my 10 years in Phoenix. The food was sub-awful (seriously, a cheese crisp that a 7-year-old deems inedible?), the service was terrible (zero smiles, and I had to basically tackle our server get the check, much less some refills on water glasses), and the atmosphere was equal to that of the third lunch shift at a nursing home.  I won't go back. Ever.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "IfKHh1RbkXNMoAZuFXa1rA"
  },
  "DudKSeV0CYf3K9ApnihG2A": {
    "date": "11/4/2014",
    "text": "Very low budget! Margaritas in a plastic Dixie cup!!! Will not return. We were told because of budgeting. The server Josh was great,he made the visit good. Give him a raise!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rNkfYMWW6JII40qt3WDczA"
  },
  "y1UdBgDHr1ADJm2g-a402Q": {
    "date": "8/4/2012",
    "text": "This place was just okay for me. As a vegan, there were hardly any options for me and what I did get definitely left something to be desired. I also spent way more money than I expected to ($2.50 to add a tiny glob of guac? Really?).  I did love the salsas, though, and the hot sauce is very tasty. I would go back and just munch on the chips and dips that they bring you, but I wouldn't order anything off the menu. I've had better Mexican food for cheaper.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XlA4e5LgshydIxpWE_kNLA"
  },
  "D7C5seHBBeviTZfjDOv3pw": {
    "date": "8/8/2011",
    "text": "Been going to Arribas for years. It used to be one of my favorite restaurants, but the last few times that I have been it was not so good. The service was awful and the wait was too long. Also I was not to impressed with any of the food that day.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7hFs6tINw1e-NHUvMxmAWg",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7hFs6tINw1e-NHUvMxmAWg/o.jpg"
      }
    ],
    "user_id": "RbN1622aTtVR9ykrloljsg"
  },
  "rlHZrfABqyRtpaH6pzT76g": {
    "date": "3/11/2014",
    "text": "I'm a nacho addict and the ones here are greasy, orgasmic deliciousness. They pile on the toppings, mmmm so good!! I rarely come here because it's a heart attack on a plate but it is GOOD. Oh, and combine it with the Happy Hour 99 cent margaritas. ... Can't really get a better deal anywhere else. The service here is okay ... Not the friendliest service, but whatever ... The good food and prices is where it's at.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OrQ06EATTyJkOqGJazutjQ"
  },
  "NjZN89zLY-YCl63qreHI-g": {
    "date": "5/19/2014",
    "text": "I got sick eating this food.. DONT EAT HERE.. my wifes co workers had the same experience",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3JikwTynwaq7rY9aeL9aZA"
  },
  "sgoIv52VeVlMiXknvjsJgg": {
    "date": "12/9/2011",
    "text": "You  know you have to rate a place when you start craving it... which is the case with Arriba Mexican Grill. The first time I was there it was good but, nothing amazing, I just simply did not order the thing that I like the most.  I went here and ordered an enchilada dish (can't remember what it was called) with chicken, sour cream with a green sauce, and was blown away, it is some of the best mexican I've had since I moved here from Canada.  They also have fantastic complimentary salsa and bean dip with chips when you sit down, and to top that all off $1.00 margaritas (yes I said $1.00) during happy hour before 6:00 pm... can't beat it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4JivgQSNQZILZpvKO4Xx3w"
  },
  "XsnYKj5HKbg0A9I-5SJt7Q": {
    "date": "7/31/2013",
    "text": "We were seated immediately & our waiter Cesar was very attentive.  My sister & I wanted to share a plate. We ordered the Pollo Con Queso. It was my first time having this dish. It is so good! Overall experience was great!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BOP3BD72GHECRiJOJ7HIJQ"
  },
  "8Yil__v9NkOZBspSEdv_8Q": {
    "date": "2/7/2012",
    "text": "This is the typical Mexican restaurant that serves Americanized Mexican food. Food was decent and would probably give it four stars but my waitress didn't understand English that well and my order came out wrong.  Steak fajitas were good but nothing. Special. Cool atmosphere and affordable prices",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LDPEAJhpzdxx-w8Zw26Dmw"
  },
  "wSfoxIWoqCXbaB6huI5L0w": {
    "date": "2/11/2016",
    "text": "I really love Arriba's however this location was terrible today!  My colleagues and I went to lunch there and as we got our meals my friend noticed a piece of plastic in her food, the type that is used to seal a jar of salsa or something.  She flagged the waitress down and asked that it be remade but in a to go container.  By the time her food came out we were done with our meals so the \"to go\" option on my friends part was smart.  This is when we got upset, they still wanted to charge my friend for the $8 meal that she didn't even get to eat with us, they wanted to give her a free app her next visit and for her to pay for her food.  You would think they could have comped her meal since she had to sit there and watch us eat ours the time we were there.  They said since she was still taking it to go it's not free.  The manager was unfriendly and snatched the food and walked away when we said that she could keep the food, and she definitely didn't leave the appetizer comp card after that.  We paid the two remaining bills and left.  I as a consumer think this could have been handled better.  The appetizer and the meal cost the same, although I'm sure they just cared about the return business not the customer service.  We will not be eating at that location again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o4FVgn9Gojr9uWwDpfTHSA"
  },
  "IE5sxNdTh68mbYDrRu1G1Q": {
    "date": "7/22/2013",
    "text": "I live in walking distance to Arriba's and was so excited to give it a shot. I mean who can really beat $.99 margaritas right? I went with a close friend. The food was okay, decent, not real mexican food but I wouldnt complain The margaritas were AWFUL. They tasted disgusting and I'm pretty sure there was no alcohol in them at all. They really need to step up the drink game, especially in downtown phoenix.. Just gross..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "P_JAregvntdTm1ZxnQYIow"
  },
  "zwjzMY-sZfuf8vNOSgYoOQ": {
    "date": "3/30/2015",
    "text": "I recently visited this Arriba and let me say, I have never had such a horrible experience in my life. My girlfriend loves cheese, I would say she's somewhat of a connoisseur, so she ordered the queso fundido. The waitress was great, she lit the plate on fire creating a cool little show, but when we ate the cheese I nearly threw up!!! The cheese tasted rancid and sour. I thought maybe it was the everclear they added to create the wonderful light show, so we asked for a new plate without the light fire show, but when we tasted the new replacement queso fundido the same rancid taste filled my taste buds. I ordered the cheese covered chimichanga and although it tasted alright, the meat inside was not cooked completely. It's as if they threw it in the microwave for 3 minutes. The food literally took 5 min to come out from the moment we ordered it. I feel that had alot to do with the poor quality and taste of the food. I would not recommend this place to anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-8pG2k4dMErNPBxreePVyQ"
  },
  "ZE0qiWEdBoKpUXRhfXS0Og": {
    "date": "8/8/2012",
    "text": "Thieves. Stole money from us, admit to it and refuse to make it right. Beware of this location.   The GM is a DBag, the waitstaff are criminals. No wonder they are about to lose their business.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "OPdrN6fEWPFbV9HM72jDzQ"
  },
  "LrNWNOzpf2xBe3IUjdjedw": {
    "date": "8/14/2019",
    "text": "The food and employees at Arriba's on Camelback is never a disappointment. Great authentic Mexican food taste and the hatch Chile's are bomb! Our server this evening was wonderful! I would had given five stars however there is only \"one\" handicap parking spot available and the ADA ramp is broken and other patrons were smoking right outside the front door and the smoke had entered into the restaurant. I'm a smoker and it bothered me. 20 feet people.  Overall we enjoyed ourselves and loved our good and server. Please upgrade your ADA Ramos, parking lot, etc.. My mother in law at age 92 is a badass and got along well however I feel some upgrades are definitely necessary.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HRhj5evoPX3XLGpZiBG1ow"
  },
  "_joCRq1a6vVmLG8LBhrOPw": {
    "date": "8/24/2019",
    "text": "Usually have great service.. but tonight Fernando dropped the ball.  Just wasn't really receptive to us today.  Dropped off drinks. Okay. Came back to take our orders.  Dropped off orders. Never checked on us.  Never asked if we wanted more drinks( we did).  Had to ask for more napkins. Luckily there was another server working close by that was able to get us everything we needed.  Asked if we needed a box. Yes please.  Dropped off a box... that was it.. never asked to box it himself.  Okay... can I have a bag? Nope that never came either.  Sorry... just not the best tonight.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QsL18CaxY00bF-5o8dw9Zw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QsL18CaxY00bF-5o8dw9Zw/o.jpg"
      },
      {
        "img_id": "Z9zOOSYLUU_KwQw-OZiSoA",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z9zOOSYLUU_KwQw-OZiSoA/o.jpg"
      },
      {
        "img_id": "Ejx7GBdxH6Qcku634jtV3w",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ejx7GBdxH6Qcku634jtV3w/o.jpg"
      }
    ],
    "user_id": "PT6GrJLyXYtXvprtQ79IMQ"
  },
  "vM1hZ9VqxreAPsjHHXxKIw": {
    "date": "4/25/2019",
    "text": "It's been a few years.  Mostly because my kids don't like Arriba, but now they are grown, so I can go back.  It was a sad experience at best, though.  My absolute favorite dish here is the White Sands Chimi.  A green-chile pork chimichanga, slathered with a spicy white cheese sauce.  Oh, man, this was one great dish.  I visited last night to have one again.  It was not the experience of my memories.  In fact, it was not an experience that should be foisted on any customer.  It started out fine, we were seated at 6:00pm in a booth right away.    Then came the wait.  It's like our server was on a timer and could not come to our table more often than every 5 minutes.  5 minutes - she arrives and talks my wife into the \"Especial\" margarita.  I'm the DD, so I have iced tea.  The table was dirty, and after requesting a wipe down, she did it immediately.    5 minutes later my tea arrives.  I ask about chips/salsa.  5 minutes later the margarita arrives, and she takes our order.  5 minutes later the chips/salsa arrive. 10 minutes later, our dinner arrives.  The chimi looked and tasted like it had been pre-fried and frozen, then taken out and microwaved.  I mean, seriously, the filling was molten while the cheese sauce was skimming over.  The tortilla wrapping should have been crispy from the fryer, but it was soft.  The molten filling tasted okay, savory and not about to scare anyone with chile hot.   My wife commented on how bland  her combination dinner (chicken taco, bean tostada) was.  And she likes bland.  The bean dip that came with the chips tasted the same as the bean dip that was on the plate, no more options of black/charro/refried - or at least that was not offered.  The salsa offered was mild and a \"taco\" sauce.  the taco sauce tasted like it was strained mild sauce.    The highlight of this dinner was the margarita.  We both agreed that it had a good tequila/lime combination and she enjoyed it.  I wish we could have enjoyed the meal more, but the service, food and experience was mediocre at best.  Vaya con Dios, Arriba.  We won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hZtc9ARVP0XiVIickBrPpw"
  },
  "H6O09qGc5G9ZWTZfRUWhxw": {
    "date": "9/18/2019",
    "text": "Had dinner here to celebrate my cousins birthday and it was fun! The server was very nice and made sure we got everything that we needed. The food was delicious. I got a burrito plate and my fiance got the street tacos. We were both very satisfied with our choices as well as our son, who ate from our plates. Most likely will make time to come eat here soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zv_YwGypJsPu3Cvn66hwhA"
  },
  "LmYIzOQ9DeJUkZSqtPBLrA": {
    "date": "9/18/2019",
    "text": "We had dinner here on Monday Sept. 16, 2019 and the food is beyond fabulous!  Anyone familiar with Hatch Chillies and loves their flavor must come here.  The prices are extremely reasonable, their famous margarita was superb and 16 oz, not only is the food so authentic but the staff was so attentive and genuinely nice...you feel as you are family! Dita was our server and she was a delight.  I highly recommend going there and you will not be disappointed.  I am so glad my friend introduced me to this restaurant and any time I am in Phoenix it will always be my go to place.  Thank you for a wonderful experience and the Green Chili burrito with a side of Hatch Chilies was the very best Mexican food I have ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ivtGN4SHqATz3ap7yz_sxQ"
  },
  "L0siSyPJ_rtC8MnqYYjEqw": {
    "date": "7/16/2019",
    "text": "The food was good and the strawberry margaritas were delicious! The food was definitely a bit overpriced though albeit good. And the AC may have been struggling because it was really warm. But good tasting food and a cool environment!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "g9u_zZpi9DCsZIEdzBboXg",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Strawberry margaritas! Chips and dip! Yummy!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g9u_zZpi9DCsZIEdzBboXg/o.jpg"
      }
    ],
    "user_id": "gfItDJgpB0fSSeTpZ9XGNw"
  },
  "gMC8c9gExuKHqQlIJAaHbQ": {
    "date": "3/20/2019",
    "text": "It has been a while since I have had a Mexifood experience this bad.  I was at the Arriba location in north Scottsdale a while back and it wasn't bad at all, so I figured I would get the same thing here--the New Mexico Burrito.  OMG.  No flavor, just heat.  Delicate tastes of beef and corn and cheese and tomato were pulverized by unrelenting spices which just kept building and building.  Hey, look, I don't mind heat if it accompanied by some good taste.  I've had hot food at some spots keep me coming back for more, especially in salsas.  Ironically, the salsa here had zero heat at all.  This was fortunate, because I finally had to stop eating the tasteless sh*t in my plate and just fill up on chips.  My wife had the same experience, and my daughter, who actually liked the taste of the food, got sick and threw up when she got home.  The real crowning achievement of the day for Arriba, however, were the sopapillas.  Nobody had ever bothered through the course of the day to clean off the honey container, which was completely sticky.  We were fishing ice cubes out of our drink glasses to clean our hands off.  We picked up our MICROWAVED sopapillas, soggy and limp, and dipped them in the honey.  Might as well have served us Eggo waffles.  Bad.  No.  Stay away.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "oWd7wL340Z9JiGf5Wu_bSQ"
  },
  "CjUJSvnRuKn9GkQdd6i06g": {
    "date": "12/17/2018",
    "text": "I came in because I'm killing time while my car is getting fixed next door at Discount tire. They gave me a 20% off coupon which is great because I love businesses that partner with each other. I'm in the bar area grabbing a snack and a small margarita, but this place has one of the best Happy Hour specials. The free chips with salsa and bean dip are so good I almost didn't need to put in an order.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "jyh6-wfxo0h0Z7xqJ-6njA",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Mini machaca chimis",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jyh6-wfxo0h0Z7xqJ-6njA/o.jpg"
      },
      {
        "img_id": "8yORJGGzcI1TaAokVpJmXA",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Peach margarita on the rocks",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8yORJGGzcI1TaAokVpJmXA/o.jpg"
      }
    ],
    "user_id": "MRyA8wET82gzk3cAvEFJvw"
  },
  "CZ-Gx7OGUh3vcgXYXOi9Rg": {
    "date": "7/27/2019",
    "text": "I've gone to this place for years. The food is always solid and the chips are amazing.  Fast, inexpensive and good. Not gourmet, but solid.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "RDfUtYJQWiIoIRjsThmCEQ"
  },
  "KT2bY9C0SN4YqqL2Tz4hJQ": {
    "date": "7/21/2019",
    "text": "DITA WAS FANTASTIC! Ask for her to serve your table, she was prompt at every turn and checked on us numerous times. Great attitude, energy, and service. The food was quick and delicious. Thanks DITA!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "c2ClRQs1oibhFsW0EQ65AQ"
  },
  "ogvLKr9COcGF75H_oMP-jQ": {
    "date": "8/11/2019",
    "text": "Good little hide away place. They've been here awhile..so they know what there doing!..large portions of food..just the rt amount of spice as well. Carlos our waiter was cool..Good atmosphere..good vibe...good eats too",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-pjcLZwPZp5gXilGZUCvCQ"
  },
  "6E4PrThn-rJhFYT3gXSUCA": {
    "date": "3/22/2018",
    "text": "The ambiance is lovely as it is colorfully decorated with an assortman of cultured decor. There are multiple seating options available in different rooms. It is definitely much larger than it appears from the outside.   It also gets busy quickly so try to get there before 5pm. Ample free parking on side and rear of restaurant.   Service was appropriate for the size of the restaurant. They have happy hour with $1.99 house margaritas that are moderately sized and appropriately prepared (not too sour).   Food is good. Tortilla chips were served with beans and salsa. Tortilla chips appeared to be freshly made. Beans and rice had an even texture, consistency and taste; however the beans served with the tortilla chips had a bit of spice to them.   Service was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xIdkqY4ThnDJmPBjeF6hRw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xIdkqY4ThnDJmPBjeF6hRw/o.jpg"
      },
      {
        "img_id": "_s0uUc2ZKIxbMKlAN5giow",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_s0uUc2ZKIxbMKlAN5giow/o.jpg"
      },
      {
        "img_id": "fZH18uAnMlCCbNvorKMTBw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fZH18uAnMlCCbNvorKMTBw/o.jpg"
      }
    ],
    "user_id": "kA6H0FTukkmTXv5H3S9XCg"
  },
  "tn-f3BJAUSAonIxbwT5dog": {
    "date": "4/8/2019",
    "text": "The best $1.99 margarita i have had in my life .  The bean deep with the chips is amazing.  The service is great.   My first time Herts but I will be back  Arturo was a great server   Super nice. Love him",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vWQRmv8kVibtchTSBR1LWA"
  },
  "58b1b4F8sAaYtRf55xoVPw": {
    "date": "9/22/2018",
    "text": "Mostly here for the drinks, chips and salsa...  house margarita is $7 and it's HUGE. It's more than a double. And if you come during Happy Hour, you can get a small house marg for $2!  5 stars for value alone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-m4nPVaO_ybT4Zh5-tPwBw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-m4nPVaO_ybT4Zh5-tPwBw/o.jpg"
      }
    ],
    "user_id": "I5mnCTuSC-Yuc6KP8XcRJA"
  },
  "pAkFw49Z23r-SH-33nVoOQ": {
    "date": "10/8/2018",
    "text": "it's fantastic!  If you like Southwest Mexican food this is a great choice!  The menu has a little bit of everything to please various tastes!  Their salsas are great and I highly recommend requesting the spicy one if that is your wheelhouse!    The servers were very attentive and knowledgable so it was a great first impression!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "H8E0U8CCaRA1mVJpd3mMDw"
  },
  "9wYVZWpeqQ44HXLQiRVO8g": {
    "date": "7/19/2019",
    "text": "Great Mexican food and other items. They have daily specials and Arriba's has a full menu for catering. We eat here frequently. Great service, treats customers like family.  Arriba's does need an improved website.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FDqFFZHUWcPvVu7XnQ8pug"
  },
  "_UIoioeNrZQ1I5lTWrN9PQ": {
    "date": "7/19/2019",
    "text": "As a long-time customer, I can't say enough about the consistently tasty food and beverages, and the attentive service. My favorites include the carnitas street tacos, pollo con queso, and the white sands chimi. If you're not in the mood for great mild or spicy salsa, the flaming queso fundido is a wonderful alternative.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMkBCsnI_JrOKzgtbB-QfQ"
  },
  "TyUXnvAZqOEyYM-tX6Ebpg": {
    "date": "2/9/2019",
    "text": "Let me just say the staff here is stellar! I was waiting in the lobby area for my take out and FIVE staffers asked me if I had been helped. To me, that means staff all help each other out - it's not just the hostess' job to take care of customers when they first come in the door. Fabulous attitude + work culture. (I've waited tables before & that's not always the case) Since it's a \"cold\" (under 60 degrees in Phoenix) overcast day, I ordered their Chicken Tortilla Soup to go. They are incredibly conscientious for to-go orders. The Tortilla Soup is the soup itself, then tortilla strips, grated cheese, avocado slices, with sour cream as a garnish. All were packed separately so that when I got home, I could assemble the soup so it was fresh, not a hodge podge. Soup has a tomato onion base with chunks of chicken & then the delicious additions to it. Hit the spot! They also packed a huge bag of chips & salsa, just like you get if you dined in. And when I've dined in before, I had a positive experience as well. Consistently delicious & excellent service.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VmO9tE3sy5aK8_WMbpB3fg",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. &amp;#34;Hasta Luego Amigos&amp;#34; - on your way out of Arribas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VmO9tE3sy5aK8_WMbpB3fg/o.jpg"
      }
    ],
    "user_id": "nJbmNlOe515ttlWSD697rg"
  },
  "Yit-EcsVOa7ZL-Q6qmQweA": {
    "date": "1/10/2019",
    "text": "Worse restaurant I have ever been.  Food doesn't taste good at all and it's very pricey for what they serve.  Not recommended to anyone.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qWxxJ1YnAX33FhsSIDSJ-Q"
  },
  "REfJq1w6ltOdNA73dAyaBg": {
    "date": "5/11/2018",
    "text": "This is one of my all time favorite Mexican food places.  The fact that it's 2 seconds away from where I work is even better.    I think I've been coming here for a good solid 10 years now and every time i can be guaranteed a great Mexican meal.  The beandip with the chips is one of the main reasons i love to come here.  I don't think i've ever been dissapointed by a meal here and the staff is always super nice.  The owner walks around frequently and asks how your meal was on a regular basis.  Love this place and is my go to for mexican food anytime i have the craving!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3IZC92G8kpoW0vBosH1i3w"
  },
  "HcQ45cghxRzHQa0tcz5bIA": {
    "date": "10/3/2015",
    "text": "great food!!! amazing service! This is a really authentic Mexican food restaurant it has really good micheladas and their food is also very tasty and fresh ingredients you can taste.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oTXPR9WVLN8GylGOxqX9_Q"
  },
  "rpvD6j5_TitGy_fJisZl5g": {
    "date": "7/22/2013",
    "text": "Great service. Good food. I ordered something a little off the menu.  I had the chile relleno but had them add the carne adobada instead of the regular shredded beef. Turned out to be a great choice. I think this may be my go to place for day drinking. They have a full bar. My birthday is on Saturday so it might be a great place to start the day.   Go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6xXMPPNb4IlFg1_xB6hydw"
  },
  "Q5M5c5qgw4qy8-68LkGt-Q": {
    "date": "2/22/2015",
    "text": "Overall, it's a pretty nice place. The food is nice. The atmosphere is nice and makes me smile. The staff are very nice... BUT, what really puts them over the top and makes me give them 5 stars is their lunch special. You get food for like two big meals for the price of half a meal during that time. Also, they're very generous with hot and mild salsa and bean dip with your chips while you wait for your food. You can even time it up to where you are there for the lunch special AND happy hour (coinciding between 3 and 4 I believe). I've gotten lunch, a margharita, and left generous tips for almost less than $10 all total and was more than satisfied. Always a good experience when I go there for the lunch special.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SvUtoAeyY3cJFKWSRK7Ukg"
  },
  "jnV0ZyVdX4Wnd_b03PxV0A": {
    "date": "4/19/2010",
    "text": "Service 4 Food 4 Cleanliness 4 Atmosphere 4 Value 3  Pros: When they say something is spicy they mean it. Dependable quality. Great Starters  Cons: A little pricey Way overdone on the Mexican theme.. Very tourist trap'esk.  My first experience here was probably 7 years ago. Went out to dinner with some friends. This was recommended by a buddy who had bused here back in high school. Suffering from testosterone poisoning all chow'ed into the hatch chili cheese crisp and pretended it wasn't as hot as it was. Later this turned into a weekend ritual for my Dad and I to catch up, have a cheese crisp, and some delicious pork chile verde. Ahh the old fat and happy days.  Onto the food:  Chips: Thinking back on all my Mexican food experiences I've had a bad chip experience once or twice at every place excluding this one. The chips have always been fresh, evenly salted, never burnt, and have never suffered from an oil slick.  Salsa/Dips: Mild: Tasty standard senoran style salsa. Stewed tomatoes, green onion, green chili, cilantro, onion, garlic. Nice bright clean flavor. Hot: I really love this stuff and I wish they gave you larger sides by default. This is a super garlicky \"taco\" style sauce but with more texture then the pureed cousin. Very heavy on the garlic and red pepper flakes. Crave this stuff. Bean Dip: Delicious fatty creamy refried bean dip.  Queso Fundido: A spicy, cheesy, melty happy place. Its brought to the table with some type of alcohol burning off. The chorizo, jalapeno, onion, tomato, and jack cheese are a perfectly melted and ready to burn through some baskets of chips. This will do wonders for your girlish figure.  Hatch Chile Cheese Crisp: Often a little overly done for my liking. It will snap into a million pieces on  your if you aren't careful. The cheese blend is tasty. These Chile's are HOT! I'm a spicy person and they warm me up. They will burn... twice ;) What is it with 50% of all Mexican places failing miserably at fully slicing their cheese crisps? Good luck pulling off a clean slice. Cover this in the hot sauce for and extra happy mouth.  Pork Chile Verde: I don't consider Arribas to be a True chain since it is local. That being said it still pains me when my favorite variation of a dish comes from a chain-like but it's the case here. This is the best pork green chile I've sampled in the valley. The chile flavor, the tender pork chunks, the liquefied pork fat mixed with the chile juice. Making myself drool over here. Ask for sans the jalapenos or on the side, it just takes away from the flavor.  Ribs: WHAT?!?! ribs at a Mexican place? Yeah that's right and they are actually tasty. I often have to try and fit multiple food cravings into a single restaurant. I don't believe all locations offer these but camelback does. They are likely parboiled then grilled off which is a strike in my book. However, the sauce is the right combo of sweet and spicy, very tender, not insanely fatty, and I think I can safely say they are the best ribs you will have at a Mexican restaurant ;)  Guacamole: Not my favorite. This stuff is so packed full of tomatoes and onion filler that it's a terrible rip off. It is fresh and it does have a decent flavor but it leaves a lot to be desired.  Rice: Nice and fluffy here but a tad on the greasy side. It also tends to be a little al dente which isn't a bad thing.  Beans: I really love the charro beans. Ranch style whole beans but in a salsa base with a smoky meat flavor. I would go for these over the refried any day.  I've never had a bad service experience here. It can be a little slower at times but the staff is always nice and attentive.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "pzwWHxfgzWsGiKENwKgIhQ",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Chile Verde Dinner",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pzwWHxfgzWsGiKENwKgIhQ/o.jpg"
      },
      {
        "img_id": "7m7aAXXN32xUphv5Hop-Cg",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Full Rack Ribs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7m7aAXXN32xUphv5Hop-Cg/o.jpg"
      },
      {
        "img_id": "6aMDItiAFWFsRFplyqKMlQ",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Golden delicious chips and tasty trinity of salsas/dips.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6aMDItiAFWFsRFplyqKMlQ/o.jpg"
      }
    ],
    "user_id": "9kqUhQoYxdPoHiSlIPwNzw"
  },
  "ZO8C8S-FlH4kItOJn4VCtQ": {
    "date": "6/8/2015",
    "text": "This has to be one of my favorite places for a flavor of a Mexican meal with the best cheese sauce ever. The green Chile on anything is delicious plus can't beat the $0.99 margaritas after three. The service is prompt and the food taste great. The atmosphere is lively yet personable. I love coming here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1AKf_1cyKliulq-lEkEpaQ"
  },
  "ueGr2vd8TCHsibVJzgREjQ": {
    "date": "5/11/2015",
    "text": "This is my go to Mexican spot. I hate margaritas but always seem to order a margarita when I'm here. I love their spicy bean dip and always ask for the hot sauce over the chunky salsa. Their nachos are way too big for one person so I recommend sharing with the table. Wait staff are always personable and attentive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vgKsPicPEr9adOg_ck9yGg"
  },
  "0U2xAKlSLsTTXDY-26BpFg": {
    "date": "8/29/2015",
    "text": "My family and I had the worst experience at this restaurant! We felt like we were held hostage due to their system going down and only having a card to pay with. We waited well over a half hour for their \"system\" to get back up. We asked for a manager 3 times before he arrived at our table. Then he asked that we write down our card number and expiration date so it could later on be processed. The bill was only $25. Was it really that important for them to get their money instead of trying to keep their already annoyed customers who had been waiting for the \"system\" and waiting to speak to a manager? We did not feel comfortable leaving the card number, but did so any way. It was a terrible experience and we will never go there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xKH0p69gRwSVwi_ljK9SFA"
  },
  "1ohFeM7GkW_skVAbu5DyXw": {
    "date": "6/5/2014",
    "text": "If you are looking for tasteless Mexican this is your place.  Besides no flavor, the dishes don't come with any garnishes such as sour cream or guacamole. I had a chicken tostada except there was barely any chicken and was about five inches in diameter. My husband had a Chile Relleno and Two Tostittos plus a coke. No rice or beans and our bill was $28!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "27w82_xzmOZi6xKj_l9ktQ"
  },
  "rTH6Dc2xzWcBZ4NiU_OM4Q": {
    "date": "8/10/2015",
    "text": "Hubs and I have been coming here for 15 years - even when it was formerly named Andale - and have never been disappointed. If you like spicy Mexican food, you must check this place out. Our standard fare that we share is the hatch chili cheese crisp and the rio grande enchiladas with carne adobada. Plenty of heat but very flavorful. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZDVFYqO0aWnaH1PJGdz1-A"
  },
  "sz3c2bpS0i3TSvbmBkMdfQ": {
    "date": "2/14/2015",
    "text": "Came here by accident with the wife after a workout (ironic). The food very good. Large portions cheap drinks (we didn't have any drinks that night) and overall a nice place. I give 4 stars because I plan to go back. Highly recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8wgT6-ixwqmkX8EJWu8PBQ"
  },
  "_PCX4RzWY7Fxr0Wrevdf_w": {
    "date": "11/16/2013",
    "text": "Food...it's not the best Mexican in the world but it's pretty good. The portions are generous and everything seems tasty in a good way. Skip the steak fajitas and order a ground beef chimi instead. Kids meals are generous and they always seem pleased. Bean dip w/ salsa is quite good.  Ambiance....it's ok. Nothing to write home but always clean and cool. It can get a little crowded on the weekend.  Staff...for the most part friendly. The manager can get a little too talkative.  Verdict....for the price it's quite good. Definitely worth a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1l7ELHpI7tal9iXHlNZ0Lw"
  },
  "0BWd-T0tYZ5812BCTAm80Q": {
    "date": "12/17/2009",
    "text": "Next time I should ask them if they can tone down the chili pepper heat a bit, at least for my order. The White Sands Chimichanga dinner I ordered was tasty, but the heat level was a lot more than I was comfortable with, and I usually enjoy spicy food. It would probably have been a much more enjoyable meal if it weren't partly like torture trying to finish the fiery food. The service was very friendly and attentive, and the place has a nice and informal, if kitschy, look.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "pSdnqWPV4QRu39fu8iyFOQ",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. inside Arriba, on Camelback",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pSdnqWPV4QRu39fu8iyFOQ/o.jpg"
      }
    ],
    "user_id": "24AzZDQKHySwMQR7VQVCAg"
  },
  "oXRIPYABarJQ-5ypD8079w": {
    "date": "3/28/2016",
    "text": "I first want to start off by saying that costumer service was EXCELLENT!!! Our waitress was extremely nice, helpful, and efficient. And to top it off the food was delicious!!!!!!!!!! The bean dip is excellent and very unique can't wait to go back to Arizona to eat in this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Tp0SzFgJXC0ceyBVocP7eg"
  },
  "GMp33BhdiLcqBMuTznslrQ": {
    "date": "8/30/2014",
    "text": "We often stop at Arriba after a Dbacks game, or anything downtown. The menu is huge and everything is delicious. My husband had a steak (carne asada), wanting a low carb option. I drank the huge 1800 margarita and it was yummy, not all ice like some restaurants will serve you! I had the mini chimis and they were greasy but good, very little filling, though. The rice and beans were good, but I would order the charro beans instead of the refried. The reason for 3 stars, the bathrooms.....not awful, but need a good scrubbing. The walls, floors, maybe even the ceiling....look like they need some attention.  I just had to wash my hands and left the bathroom wondering if maybe I was worse than before I went in.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jGGQBoFA7P0A8jEcQRhCjA"
  },
  "UGN8PqZxZsZGDO8SHRdG7A": {
    "date": "2/7/2015",
    "text": "This was in-between, because my husband's Rio Grande Enchiladas were amazing, but my beef burrito was pretty gross (old chewy meat and a flour tortilla that tasted like the fridge).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WOrCzAOgs50Wf-dlnHrzDw"
  },
  "BKIF_GApwBGPloHGnVJLxQ": {
    "date": "7/25/2015",
    "text": "I just had the absolute worst experience ever at a restaurant at this location. The bad part was the food. The worst part was the service. Some how my wallet had fallen out of my purse, so I went to my car to get it. I had already asked my server for the bill because I was in a hurry and she took forever to come back to my table. As I was walking back in to pay and finish my food she was walking out and even though she is watching me walk back in with my wallet in hand she says very loudly,\"you didn't pay your bill.\" I told her I went out to get my wallet from the car and I was returning to finish my food and pay. I told her she wAs rude and disrespectful. Her only reply was that they have problems with people leaving without paying. They have lost a customer for life and I will never recommend this restaurant over a bill of $11.12. Good job!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SszpADbCvmEa9Lfqf-CgdQ"
  },
  "FSXns-n6bGod1uWdgErjCQ": {
    "date": "11/24/2011",
    "text": "Arribas is a locally owned and operated Mexican-American food restaurant; no illegals here, so stay away Sheriff Joe.  Seriously, food is good, drinks are strong and reasonably priced, and usually they have a scary ass clown lady that will paint the mexican faces white, and the white faces Mexican!   It's a great place, and doesn't make me want to go all SB-1070. I thoroughly enjoy their enchiladas and burritos. It's a great place with a date or with a group. The staff is very diligent and polite and speak english as their first language.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4GMTQSSXOlk3CejH1RG8aQ"
  },
  "fPIHz8HLalojnqYAtFSe4w": {
    "date": "12/21/2011",
    "text": "Average to overpriced, slow service, and the food was average.  In short, we'll be trying many other places before we might consider giving Arriba another shot.  We were there during the week, I believe on a Tuesday during the lunch hour.  At least once we had to ask for refills...and then wait some more.  There were 4 of us that had a variety of dishes, none of which were great, ranging from \"alright\" to \"I wouldn't try it again\".",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UodOBKFEFy4M_lCqw9q2jA"
  },
  "xtvHrUFt1yA92DR2AVEX4Q": {
    "date": "4/5/2012",
    "text": "Food here is great. One of my favorite Mexican restaurants, and they use Hatch chilies. Depending on the day/ waiter  yes, I may have to wait for a refill, but that's happened at one time or another everywhere I go regularly.   Waiting for a meal is a treat, though often I fill up on the chips and salsa they bring out. Not only that but they bring out mild and spicy salsas as well as bean dip. Which is great since I then take most my food home, and it becomes lunch for the next day.  Food is plentiful as well as their size of their margaritas. Price is moderate, comparable to most other sit down Mexican restaurants.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K7nquF7kX2HgFqHsoD0dfg"
  },
  "GWjMnMyfkFUqZWO1msGSZw": {
    "date": "10/16/2014",
    "text": "Im drooling just thinking about this place!!! Once again, had a bad craving for Mexican food and was across the street. SOOOOOO good. First, the fact that they brought out salsa AND bean dip, I love. Not everyone likes salsa, I liked having a little of both. Both were good. I ordered the 3 cheese chimi with jalapeno cream cheese. OHHH MY GOSH!!! One of the best items ive had, of all Mexican food dishes!!! Obsessed. Probably will only order that from here on out at this place. The waitress was so nice, and attentive. Margarita was cheap and good. AND on sundays kids eat free. Good food cheap liquor and free to feed the kid?! Winner in my book!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KKZH45QAT6-nJJjvnUFHdA"
  },
  "I_F2AGDEGRLOyLwrbfQprQ": {
    "date": "5/1/2015",
    "text": "Best lunch specials during the week. Great service. You will get chips and salsa before your meal and the plate is a decent portion. I highly recommend having lunch here if you have only a few dollars.  I like this place because the atmosphere takes you out of your work zone.  I did see that they have huge margaritas.  They look good.  Didnt try one because I was on my work lunch hour.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IXSTfBSe56Z0RvYg4Cfn2w"
  },
  "Nrjgeas46S3Dblle4rn9sA": {
    "date": "9/20/2017",
    "text": "I've been coming to Arribas for quite some time and for only 2 reasons: 1) the complimentary bean dip served with chips is excellent; 2) their chicken tortilla soup is delicious.  I'm disappointed every time I deviate.  Today there was a cockroach crawling on the wall at my table.  I desperately tried not to freak out and keep my irrational phobia at bay. (I'd rather fight in a barroom brawl than deal with bugs) I digress. It disappeared into a crevice and I thought \"ok.  I can live with that\". (the soup is THAT good)....until it surfaced again and refused to retreat.  I had to call the hostess over and show her the bug dancing all over the wall.  She called the manager.  The manager came over and kept asking me where the bug was....I kept pointing to where it disappeared to...he kept saying he didn't see it, which I don't give a shit if HE couldn't see it...I saw it.  My lunchmate saw it and the hostess saw it.  He also brought with him an Ecolab exterminator report that indicated they were just there and that he was aware of the problem and that he's been trying to get rid of them.  I don't know why he felt he had to do that.  At any rate, he was anything but apologetic.  The whole while, our server kept walking by our table and visibly scowling at us as if WE brought the roach for a discount.  The situation was handled poorly.  He could've just said \"sorry, we are working on this.  Let me take care of the bill.\"  Seriously, we only had soup.  A mere $15 total.  For this reason - I won't go back again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89115UaPNhiK1TIuuJN0CA"
  },
  "MN-xoCWog9WWP2k-zrMS3w": {
    "date": "6/2/2014",
    "text": "This is 1 of my sister's favor8 places but not quite mine. She luvs spicy, me not so much (a li'l kick does me fine, but more than that kick's my (_y_) & there's not much 4 those like me 2 select from off their menu). Most everything including entrees & appetizers has their sign8ture hatch chili's in/on it which is just 2 much 4 me.     Last time we went here 4 her B~day celebr8ion she didn't touch anything on her pl8 but took it home 4 l8r. She was more focused on nursing her gargantuan margaritas so her fascin8ion may also b w/ the drink specials.     I ordered some breaded mushrooms, a side of guacamole 2 go w/ my chips & had the spinach enchiladas w/ a chile rellano side. The chips w/ guac & bean dip were actually the best of what I had. Mushrooms were ok but over~fried & bland, the enchiladas were good but WAY 2 Salty & the rellano was drenched in sauce that tasted kinda fishy 4 some reason (perhaps cross contamin8ion) which was unexpected & not the most complimentary flavors 2gether but still decent.     Our w8er kept missing details & tho I know he was busy & seemed nice 4 the most part, he still could have made things a bit better knowing we were there 4 a special occasion. We ordered a special sopapilla churro dessert they were promoting 4 my sister because we wanted 2 c her @ least eat (instead of drink) something. It showed a large mint green choc chip scoop of ice~cream pictured in the center w/ choc sauce drizzled over but she got a small scoop of vanilla in center w/ no chocol8 topping. I don't trust sending food back (especially after seeing the movie Waiting) so I asked him 2 pls bring the correct ice~cream in a small bowl which was the 5th detail he missed while w8ing on our small party.     So overall not good nor bad, so it'll most likely stay a place I go 2 only when it's my sister's B~day choice as I really don't care 2 spend my hard~earned $$ on average food, service, &/or experience in a somewhat outd8ed interior. Maybe that's why they push the enormous drink specials so much cuz then no1 would care but I hardly drink~like 2 experience things in their entirety so here's my take...",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "tt_9YGKMlzNaKoUR-XhODA"
  },
  "OrubF75MA8LktzP5nQpqWg": {
    "date": "10/16/2016",
    "text": "I come to this location often, love the food and service. Amiable servers and they check on you! I always leave happy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BJSB3zQyhUNSpQ_r0bI5Jg"
  },
  "7oI4Cx0cPPfIm-OffAOZ1A": {
    "date": "7/31/2012",
    "text": "Fun atmosphere!  Nice menu selection. David the waiter was great.  Drinks are huge but don't taste much alcohol!  Better Mexican places...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Ms5wpxVloadWFvDbb77kg"
  },
  "tqw_OKOECFnFpxdz3yR-1A": {
    "date": "4/10/2012",
    "text": "I LOVE Arriba's food.  It's flavorful, plentiful, affordable and varied.  There are only a couple of Mexican food restaurants that I will go to (as a native Arizonan I have high standards for good Mexican food) and I think that Arriba's is just about as good as you can possibly get for a chain Mexican restaurant.  In my humble opinion it's a tad better than Garcia's, and FAR better than Macayo's.  The only thing keeping me from giving them 5 stars is that the restaurant itself is starting to show its age around the edges and you can see the wear and tear in the decor itself.  I think it's time for the owners to shut it down for a day and do a massive floor to ceiling deep cleaning and give it some fresh paint.  Then they'll deserve 5 stars.  :)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "XMy-OTpVY8O1L-8w1zOKcw"
  },
  "CXyJYr3BBqL97n6ZfWGsvg": {
    "date": "11/7/2016",
    "text": "Me and my friends went in last night and ordered food , we've been here before in the past and of course we come for the food even tho the service is never great ! last night that changed, we were waited by this waiter by the name of yuri or something like that , it was her first day on the job and let me tell you , this girl was amazing . Her section was full and busy . Great smile , great attitude , awesome personality and most of all she never forgot us and the order was perfect ! Although it was her first day working here she definitely  deserved her tip which i never tip that much at the place . She definitely deserves 5 stars ! If I'm able to request her next time I'll do so .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FTcD5sthPp9f0ItRYAvUWg"
  },
  "RhjJ3uLcrFcLN2I0__n3PQ": {
    "date": "10/23/2014",
    "text": "Great lunch special 4.99 chimichanga , rice ,beans with all you can eat  chips, salsa and refried beans. I would recommend it for lunch anytime, with fast service and with friendly service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0wWzqDiiMRwG-wp-2ikhhA",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. .99 cent magarita.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0wWzqDiiMRwG-wp-2ikhhA/o.jpg"
      },
      {
        "img_id": "kljgspIHOAuua1fot8pmfw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kljgspIHOAuua1fot8pmfw/o.jpg"
      }
    ],
    "user_id": "-fu6XNcD3oaXmycQpsVpzA"
  },
  "KE0li3m820cThO50Jn1TYg": {
    "date": "9/16/2015",
    "text": "So I went here for the first time today I'm new to AZ been desperately trying to find decent Mexican food since I moved here I came to the right spot the flavor was amazing the food was to die for I'm very picky about the way Mexican food is cooked and there were no complaints I do wish the server was more helpful with the menu recommending choices since it was my first time but she got all the food out in a timely manner I will definitely be returning",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RjGlMki-iWA1h_I2Ic_Kpw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RjGlMki-iWA1h_I2Ic_Kpw/o.jpg"
      },
      {
        "img_id": "dmgqC_u_PnQN2b58UkpyqQ",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dmgqC_u_PnQN2b58UkpyqQ/o.jpg"
      }
    ],
    "user_id": "zdIlIYtrc8RkdYAdpZdXwg"
  },
  "tjJFaUQY2WwlkZmqo9aZUg": {
    "date": "4/10/2016",
    "text": "My husband and I loved this place! The chips were warm, the salsa had a little bit of a kick but not too much, and the bean dip was perfect. I had cheese enchiladas. Their sauce is right on, the size of the enchiladas were on the smaller side. I'd go back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "l_urxDubusB1pn_VYOssuQ"
  },
  "Ks0qQGGgXTLCUMDBrOn_RA": {
    "date": "8/1/2014",
    "text": "Go here for the happy hour...$1 margaritas!! M-F 3-7pm & 9pm - Close  Tortillas and salsa: good, you get 3 types of dips Food and service was ok...nothing too spectacular  Decor is cool but it is quite dark in here making it sometimes difficult to read the menu.   Would def go back and sit at the bar!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "b4Ie47uteUB_nxJ4y02pvA"
  },
  "-T_5OtqHP3ni_8fSmRqvUA": {
    "date": "10/14/2016",
    "text": "Very disappointed in recent visit. They used to have the best bean dip around, but now not so.  Food has gone way down.  Won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zi1ainYBCFDvsvR-rXzfPw"
  },
  "DNFMxagnU0QVh5O-rX0YNQ": {
    "date": "4/5/2015",
    "text": "My family used to come here a lot when i was growing up, but we quit coming a few years ago. I recently come to visit my parents in Phoenix so we came back to try it out.  We were sure sorry we did. Hands down the most aweful margarita i have had in my life. The food and service were just as aweful.  Do yourself a favor and skip this place. There are a ton of awesome restaurants in Phoenix. Go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "woaPzFVaC7BDstiq5_c0VA"
  },
  "LUVjfITpcKm8l-g7Rfk6rg": {
    "date": "12/28/2014",
    "text": "I had the Chili Colorado and wow it was great!  I eat a lot of tex-mex so I wanted something different.  Beef in a stew with jalapenos, beans and rice. It came with flour tortillas.  Very tasty.  The beef was very tender and perfect.  Their beans and rice have a lot of flavor too.  The service is always very attentive and liberal with the free warm chips, salsa & warm bean dip... mmm.  The ambiance is typical tex-mex with Spanish themed items on the walls and bright colors.  This location is a bit cozy, but it has a nice feel.  I came in with a party of 10 and they were able to seat us quickly, our food came out quicker than expected and everyone enjoyed their meal.  Plus they recently updated their menu to include pictures of ALL entries. Not everyone's thing but I appreciate it and so will your family.  Grab a couple chocolate-mint candies as you leave.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6AMwQ8cFWIKGbGpVwehkfw"
  },
  "UaPdsgJexdAGZtwYeqUgHw": {
    "date": "11/30/2011",
    "text": "Woohoooo  My 100th Yelp Review!!!!    Met up with a friend for dinner on a Tuesday night, he picked the placed and picked Arriba's, I was down for that cuz I do love the spicy food and here they cook with the Hatch Green Chile!!!    I got to the table and was greeted by our waiter, Dave, who had a dimple it was cute when he smiled, haha.    I ordered ice tea to drink, friend ordered coke, We placed our orders and got to talking and I swear it only took like 10 mins for the food to come out to us, it was like they were waiting for us to order LOL  My friend ordered an appetizer for dinner, really?? When I know I am going out to dinner, I order a meal and I don't like it with the other person just orders a app or something and they are like oh I'm not that hunger, dude did you forget we were going out to eat?? LOL and believe me that's what I told him too. Im not shy haha  I ordered the chimichanga plate and told Dave to make sure it was covered in the hottest sauce, bring on the heat baby! I had the machaca beef and Dave said if you like heat get a side of green chile for your dish, so I did what he said, let me tell you it was good!! It wasn't the nose running, eyes covered in tears, lips burning on fire kind of kick I was looking for it, but it did bring a little tear to my eye (just want to say, I like heat, and though it wasnt hot to me, it might be to others) LOL it was very good, it comes with sour cream, which was good because it was a like a cool mild balance also the plate comes with beans & rice and have to say both were delish! I normally don't like rice but this was perfect!   Company, food, service was great! I look forward to coming back!   (side note: I checked into Arriba's last night, but it's not showing up on profile today but it does on my app,,,oh well.)",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 6
    },
    "photos": [],
    "user_id": "bpgbVPJcG-wQ4cNBcPPIxw"
  },
  "U9W-MgSJGOYfDLGpTGaNyQ": {
    "date": "7/30/2016",
    "text": "I thought this place would be more like a chain but it in fact felt family owned.  The atmosphere was inviting, our waiter (Michael) was extremely polite and appropriately attentive and the food was not only really good but came really quick.  The deal on margarita for two was awesome also.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z8IoOwTLbYK-5Zkcd0BCNA"
  },
  "wAtrDmc2hffx7qP1ZY4M_Q": {
    "date": "8/23/2015",
    "text": "Asked if they had a sour cream sauce enchilada. Received enchiladas swimming in a cheesy sauce, swimming to the point I can't find the food.  I removed an entire salsa bowl of sauce, and the entire plate was still swimming in this not so good sauce.  The rice was covered in it as well as the beans and the salad.  When the server returned, I told him it was inedible.  He said:  Ok.  Would you like another margarita?  When the check came, I told the server again that the dinner was inedible.  He said;  Okay and walked away.  He removed my full plate of food from the table and took the check and payment away.  I left a tip for his service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1xEpRT7ASF8CBdbd0YXAEQ"
  },
  "wzKCOG7S7dWEkoz_E-Jhkg": {
    "date": "8/4/2015",
    "text": "I highly recommend  this wonderful Mexican  restaurant the only one I go to when I have the cravings for Mexican food and I sure would invite my friends to come with me as I know they won't be disappointed this is a great place I highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sbsh2Zk9fD2lqeaQXAi_Bw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sbsh2Zk9fD2lqeaQXAi_Bw/o.jpg"
      }
    ],
    "user_id": "9A4K_4aiP9yJKb2VEw-I0g"
  },
  "TGXGxSGV1uYz0EVHHVMjNg": {
    "date": "6/5/2017",
    "text": "I decided to try something new. I picked the New Mexico Enchiladas the photo on the menu made it look good. Very disappointed. It tasted very bland. The enchiladas didn't taste cooked the ground beef had no flavor. Their salsa is pretty good and the bean dip. But the main course just stunk. No flavor.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2KpLC6hMu-AilGzY9dUSCg"
  },
  "jU7o6HKVAIPaVZN5uRWOzw": {
    "date": "8/15/2016",
    "text": "The food is good nice and fresh. The servers are very attentive and make sure you have everything you need to enjoy your meal. I had the Santa Fe chicken salad and my friend had the Hatch chicken especial. Delicious!! We always come here it's close to our home!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8L8YQqKZC8VSE7cM6xgduw"
  },
  "Et3Y2rYHVl8AlgqkGvjEWw": {
    "date": "5/12/2013",
    "text": "We ate here last night, and wasn't really impressed. Everything is made with lard, and smothered with cheese! Since losing weight, I have tried avoiding everything unhealthy. Unfortunately, my friends  wanted to eat here.  I really wanted to like this place, but they just don't have a lot of options. I ended up ordering the Spinach Enchilada which was okay after scraping off the cheese. I also did not touch the fried beans and fried rice. The dish just didn't look edible to me, but to be fair. My friends raved about this place, and they really enjoyed their dish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nXMMoDzXRByQiWH9cf-FAQ"
  },
  "D3d8PoMMpw8zS3HAUm4h4g": {
    "date": "12/28/2014",
    "text": "Welp...i actually have eaten at other locations and absolutely hated the food and service. Haven't been back to an Arriba's in probably close to four years or so thats how disgusting and horrible i thought the food was everytime i went. Very hesitant on coming here especially on Christmas for dinner, but since it was literally the only place open in the area i decided to go for it. Surprisingly,  our server was awseome and super friendly and my meal was excellent. Couldn't believe it. Not sure if it was just this location or what the deal was but i will probably only eat at this location if i eat at Arribas again.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "TuoT4Y-MZQhjbbZmwQN3QA",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. House Margarita on the Rocks w/salt!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TuoT4Y-MZQhjbbZmwQN3QA/o.jpg"
      },
      {
        "img_id": "Xj_Z1HeXgM8vHrpNW3jcNg",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. El Carbon Tacos!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Xj_Z1HeXgM8vHrpNW3jcNg/o.jpg"
      },
      {
        "img_id": "lhs_yM5BthWDFInsKgWuEw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Pazole!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lhs_yM5BthWDFInsKgWuEw/o.jpg"
      }
    ],
    "user_id": "0mWRAT95QOSkc_PqKTURbg"
  },
  "BRuXrJoJjixHsmpPmRadOg": {
    "date": "2/1/2017",
    "text": "I absolutely love their happy hour Margaritas. And all the bean dip you can eat, it's hot too. The staff is always fast and friendly. I go out of my way to drive to the Camelback location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dpev2kxku7nAzYLTIXOGAQ"
  },
  "yqoKzIJMvTCbvkkiMt7m1w": {
    "date": "4/21/2013",
    "text": "Went here last week while on a layover in Phoenix.  We had been shopping across the street at Last Chance. (separate review)  Arrived at 2pm.  Sad HH didn't start til 3.  :(  Oh well, paid full price for a nice tall Dos Equis draft.  Sad that their locally brewed beers were not available at this location.  Here's an idea, don't advertise them if you don't have them.  Received some chips, salsa & bean dip.  The chips needed salt & the bean dip was too runny.  Passed on the $4.99 lunch special of the day 2 beef tacos. (TUE special)  I instead went for a chicken enchilada layered dish with verde sauce.  The waiter warned me it was spicy.  I'm a fire eater so I said bring it on.  Man was it spicy!  No joke!  Some sour cream would have been good with it to tame the heat but I abhor paying $2.50 for a tablespoon of sour cream that is worth $.25.  Portion size of entree rice & beans was just right.  Not overly generous portion size.    Waiter & staff friendly enough.  Like the decor.  :)",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8sW6YwBkyO4LhWvhknmzog"
  },
  "WkJQKlEBGbZpoGfO1p-p6g": {
    "date": "1/19/2017",
    "text": "What an awesome experience!   Great Margaritas, awesome happy hour, fajitas were perfect, cheese dip was outstanding.   Guess you could say, it was Great!  Great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xkx2jOSryGpQHW6XLl1jgQ"
  },
  "mA4CUoCRHzPhGfODtldmuQ": {
    "date": "2/26/2017",
    "text": "Just had dinner here, and we really enjoyed it. We just moved to Phoenix and Arriba Grille is right down the street. The menu has many New Mexican and Mexican dishes. I have no idea if the food is authentic, but the Tacos al Carbone and Fish Taco plate were both really good. The chips they brought to the table were freshly made, and the salsa was very flavorful but not too spicy. Our server - Michael - was very nice; overall the service was a little uneven, but all in all ok. We will definitely go back - maybe Arriba Grill will become our neighborhood Mexican restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VwXePB6BMAFiiWHjAYJwQ"
  },
  "TnpZZqV1JXcFEceTIYcsbQ": {
    "date": "7/8/2016",
    "text": "Okay I know this is a chain, but I had to review because I was expecting average service and food. First off superb service from the hostess to the waiter to servers to table clean up crew. Now onto food, I usually stay away from places like this because they seem to offer the same bland overcooked food (i.e. Macayos, Manuels, Pancho's), but everyone in our group enjoyed their meal. We will most likely visit whenever we're in this part of town again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a68Rb4Wq2PzP6Kcif1-Hiw"
  },
  "snXddtjCbHcxSK-5-xoCcQ": {
    "date": "3/16/2017",
    "text": "My Finance and I have gone to Aribas for the last year at least once a week. . . Until now. This restaurant is making us deathly ill!!! It seems like their supply for chicken must be contaminated be because last Sunday it made me sick, and tonight we are both sick again. Stay away from this restaurant, do NOT get this sickness!!!! It is no fun!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEm1JpWYeD_vcUbmnEQzPg"
  },
  "JfnvFYOPGXyoV2dT0oU7Qw": {
    "date": "2/20/2015",
    "text": "Not impressed.  Food is ok. Service is ok. Prices are a little high. Atmosphere is blah.  You can put it along with Macayo's, Chile's, Applebees, etc. Just nothing special. No reason to go back. Gringo Mexican. Just blah!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ayHvt_WaKGO44oe6BbgSsA"
  },
  "ku50tXtGfhGjyYHzBCvYXA": {
    "date": "9/5/2015",
    "text": "Maybe one of best Mex restaurants we have been, though mostly typical American Mexican. I had a Mex Pizza and was amazing good, I thought. Great service and good looking food items for us all. I would sure return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZRnsUs9q6DbeJbOLjCY4ZA"
  },
  "fEWhkU68K1WvPXSaaIY_7Q": {
    "date": "8/6/2016",
    "text": "The waiter that has waited on us for years come to find out he has been doing disgusting things and was arrested for doing inappropriate acts at a child's school he has 20 counts against him he was arrested November 15, 2016 and was totally shocked just seen it on the news channel 10  fox! Worst food I've had in ages, horrible lazy service, chip seamed to be old,  I receive my food and had asked for green sauce and server said sorry, but then never came back, could hardly eat any of it the rice was dry the sauce was so hot you couldn't even eat it, told the server and she took my place with only about 5 or 6 bits from it and said could I get you anything else, I said know that's it for me and then handed me my bill for the food I hadn't eaten, didn't even think of taking my food off the bill, so if you just want to throw your money away on crappy food this is the place!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7nvIzUjToM8JtDhJE0d2mw"
  },
  "zmjmbIvgdpiouox5EEsBLg": {
    "date": "8/28/2014",
    "text": "Omg, what happened to this place. Had some shopping to do across the street.  Me & boyfriend stopped in after work, sat in the bar. Checked out the grease covered hh menu,  order a beer & Jim beam.  Drinks come & the beer is half ass cold, Jim was fine. Chit chatting with the old man & we noticed a fly...no big deal...As the conversation progressed we couldn't keep the conversation going without swatting flies.  After a while I burst out into hysterical laughter,  this shit was ridiculous!  Instantly transported back to rocky point hungover eating fly infested tacos roadside and you don't care because your lucky to have survived the night in Mexico!  Its Ok, I'm Mexican I can say this shit! Anyway still sitting at the bar waiting for pozole & enchiladas,  the couple right behind us is in sneezing distance - literally this fucking guy is sneezing open mouth all over the place, my back was wet.  Fuck it, I actually taste the food. Eh,  the posole was decent & the spinach enchiladas salty.   Oh wait we also ordered taquitos appetizer.  See the photo, the fucking fly posted for a SELFIE!   You want Mexican,  tons of other places. Skip this place, overpriced.  Loved it back in the day, crash & burn this place is toast!",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kBQ-sHBWNJ14aqEFTxmSlw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Zoom in for fly in queso!  Happy dipping!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kBQ-sHBWNJ14aqEFTxmSlw/o.jpg"
      }
    ],
    "user_id": "UUEPY2SW2p5aQQT5hYHLcg"
  },
  "3Cyq-ds8orUuQ2LKBOVVlw": {
    "date": "10/28/2015",
    "text": "Such an amazing place love their happy hour. Queso Fundido is gross tastes like rubber but everything else is great I recommend the mini chimis! The hatch chilies there are very spicy I love it! Marcelino is the best!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ISxBWMqeUWwwoJoJGG9pTw",
        "caption": "Photo of Arriba Mexican Grill - Phoenix, AZ, United States. Yuck",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ISxBWMqeUWwwoJoJGG9pTw/o.jpg"
      }
    ],
    "user_id": "yafSoCfUfh_ZWM6IuPOeiQ"
  },
  "XpCqRnazAb_KPuxuxRZvdg": {
    "date": "8/3/2016",
    "text": "This place is amazing...all the times I've been here they have not yet disappointed me. Customer service needs a little work but the food is very well prepared!!! I definitely recommend this place! Also I'm from New Mexico and the green chile is awesome!! Reminds me of home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "O12wPlac0ZjbdqxjwG568A"
  },
  "FPIMP4kOaVei12Pm4KZpNA": {
    "date": "6/24/2016",
    "text": "I will NEVER eat at this location again!!!!   My daughter and I were eating our chips and salsa waiting on our food and a giant cockroach fell from the ceiling onto our table. My daughter screamed and I grabbed my purse and we ran to the front of the restaurant. We waited for a few minuets as even though we didn't receive our food yet I still didn't want anyone chasing me down in the parking lot. Finally a woman who I am not even sure was the manager came over knowing what had just occurred and didn't even apologize. She wanted to know if we wanted to sit somewhere else........UH HELL NO!!!  All she had to say was they had already called Orkin....Oh...and you know....it's summer.....Well it's summer at my house too and I don't have Roaches falling from my ceiling!!!!  This was no big deal to them. Clearly they must have an issue and this must be an everyday occurrence. GROSS!!!!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "F_U8aoTJYdx4lslotBx1cA"
  },
  "1QyBc7_vOSbQUPoA1uRVdA": {
    "date": "9/9/2016",
    "text": "Love this place!! Good Mexican food and even better margaritas!! Every time I come, there is always great service as well which is an A+ in my book. Happy hour has some awesome deals. And then like I said for the margs, they're amazing. Get the big one. It is so worth it. I got Mango which was incredible. I thought it would be a weak drink but let me tell you I was wrong. Great drinks at great prices. Food is good too, I love everything I've tried so far. Haven't taken any pics cuz I'm always just focused on eating everything! Definitely recommend this place. I can't wait for the next time I'll be back! Oh and one more thing, we had Heather as our server tonight in the bar and she exceeded our expectations. On top of everything and just super friendly!! I hope we get her again :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rrjB-HqvK1IEgQETHxqXWQ"
  },
  "6OqqUCxEruLkUjkVH9bFCQ": {
    "date": "1/9/2017",
    "text": "Ate here about a month ago.  Its just what i expected with the food, delish.  I like that it has its own personality.  Everyone was great and got us all the extra sauces, sour cream, etc we needed.  I will happily stop back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3tPiEiJJ8-pjAl6Y090CLQ"
  },
  "ihJWhmDLvtCmgSi-qntYNA": {
    "date": "8/9/2013",
    "text": "Interesting menu!  Many items feature the Hatch chile, which is a formidable bit of hotness that you can even purchase to take home with you (wear gloves.)  Decor is festive, music is wonderfully authentic and the place is usually jumping with customers around lunchtime and dinnertime.  I had the New Mexico Enchiladas and they rocked my world.  This is a nice blend of authentic and creative approaches to traditional dishes that never get too ritzy or complex.  Margaritas were super and service was superb.  I haven't been brave enough to try a \"three hatch\" entree' yet (their rating system of peppers skews low - one hatch will fire you up) but that's certainly going to be next!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KQ-gI-xsZzq5xeHYev6eYg"
  },
  "p05z7xbugcgrGKGQGl55-A": {
    "date": "5/28/2016",
    "text": "The only thing worthy of a taste was they had a bean dip that actually some jalepeno spice. Other than that nothing was worth eating. Talk about bland no flavor mx. food this is it. If all u want is cheap this is your place. Might as well eat at Filbertos.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mbdtyUUzZZx5ld1Qc4iGtQ"
  },
  "vZKyG7ZYH9YbLzxyevPdBQ": {
    "date": "7/14/2012",
    "text": "I came here with bunch of coworkers on a Thursday evening during happy hours.  The margaritas are cheap during happy hours, only 99 cents!  This place gives you complimentary chips + salsa + bean dip. The chips are crispy, fresh and tasty. The salsa and bean dip are not anything exceptional.  I tried the supreme nachos. It could've been better. They definitely put lots of toppings and meat on it. I felt like it was very greasy (but I expected it to be). It can be soggy near the end of the dish because all the cheese and meat soaks in it. The beef is just ground beef. Everything is stuck together so sometimes it is hard to share. It does come with a lot of ingredients on top like sour cream, guac, jalapenos.  The cheese crisp is interesting. It reminds me of a tortilla pizza with just cheese on it. Nothing exceptional.   Service is mediocre. I think since our party was big, it was difficult for the waiters to see what's going on. They tried to refill our drinks but they weren't always on top of everything. They didn't ask us for refill for chips and salsa but we definitely kept requesting for much. I always like complimentary chips and salsa (how can you go wrong?!)  Parking can be an issue before 6pm because sometimes the parking lot gets full but some people park at the other parking lot close by after 6pm. There's a sign regarding it.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "ttauTXuRemnMf1SDhMgQZQ"
  },
  "qrKbyHvqxhR04U3BDPiHoQ": {
    "date": "10/16/2009",
    "text": "This was a nice little mexican restaurantt.  Had good food.  Menus were large and plentyful.  Price was reasonable.  Staff was friendly.  Can't really complain about it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zf3ChqU8JwE4oR1UXLAOww"
  },
  "gmc4WXZq04SbU7F_NIc2Ww": {
    "date": "2/23/2009",
    "text": "Muy mas caliente, but my favorite restaurant in Phoenix. It's not swanky, and sometime you can feel like they're rushing your through. But the food is savory and very, very hot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4XnjI0Ss2bashAAQdYWgwg"
  },
  "dgmvBGw9sTF0M3pwTmWL5Q": {
    "date": "2/28/2009",
    "text": "Popped in for lunch today before heading over to see the A's Spring Training game.  Best mex food I've had for some time, but then its been 30+ years since we lived in LA.  Server was prompt, bi-lingual, attentive, and knew the menu (my wife is allergic to onions).  All in all, it was just what we were looking for... not fancy, not a take out burrito place, just decent eats.  Good for our Sat. early lunch. Didn't have a margarita.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x_yp2-8DrpVIyzfacJOZag"
  },
  "0oP5uDCzA20oiom_HMalWw": {
    "date": "7/3/2009",
    "text": "I used to live in New Mexico and have been searching for Mexican food that came close to the flavor and heat of the hatch chilies used there...until I found Arriba on Camelback. I love spicey food and theirs in the hottest in town (the menu has a \"hot\" factor so you can avoid the heat if you want). My fiance and I always start out with the queso fundito and then take our pick of the rest of the amazing menu. I recommend the Roswell Tacos and the Spinach Enchiladas.   I have been to other Arriba locations but this one has the hottest food, best ambiance, and service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W_VDMxCZ7sR4dqmop131IA"
  },
  "6Qvzww5OXv34VMZ8RrLjpg": {
    "date": "8/28/2011",
    "text": "I must have had the best food on fri night..best server..I forgot to ask his name dark hair  maybe Eric??I asked to have a take home box  ..He even brought a small container for the really good salsa..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVCbWQnBYVUVcWdHlAZqyg"
  },
  "aaxZ5kdi044fLOgsY7eMEw": {
    "date": "8/10/2011",
    "text": "The food was great! But it was really expensive for a Mexican food joint. I love the hatch chilles that they put in a lot of their meals.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKPY6iHx6LRSxxPm8GVj2g"
  },
  "yn6diqGlM62YmkTcUOjEoQ": {
    "date": "7/9/2011",
    "text": "I love this place. I usually get the fajita quesadilla. They also have great guacamole. I've always had nice service and never had to wait for a table.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TRphIN1RU8NvoabBhdRSAg"
  },
  "fHn_kt_YtgiytExtBy1s0Q": {
    "date": "4/5/2009",
    "text": "Maragarita's as big as your head.  Spicy, affordable food. Convenient locations thorughout the valley.  Only woarning is to not go on Sundays.  KIDS EAT FREE on Sundays and apparently that equals, parents don't have to pay attention to how annoying or obnoxious their kids are being.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YmTUXcWWuk3Hc0O7FMiOMg"
  },
  "zrtFmfMe2AHMiQkGRyEIcQ": {
    "date": "7/23/2007",
    "text": "Spicy hot is a very subjective thing. Arriba's dishes are made with Hatch chilis from New Mexico. For the lightweights, they have a heat scale next to the chili items. They can't make their food too hot  for me. Everything I've had here has been good. Service is usually good, but have had a couple of issues with the service in the past. I've been to the Chandler and Scottsdale locations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xBqSzb1UUd1PRufDsVohAg"
  },
  "PsmvUxkQLP9z6gk6NX-FBA": {
    "date": "10/3/2010",
    "text": "Decent but typical Phoenix area Mexican food.  Very comparable to Garcia's and Macayo's type of food.  We went on Sunday for kids eat free.  After sticker shock, yes I thought it was pretty over priced we  ordered.  My taco salad was $11, and my wife's lunch was similarly priced for 2 enchiladas.  The kid's cheese crisp was humongous.  Portions in general were pretty large.  Taco salad was good and fresh, but you could taste the oil in the shell.  Cheese on the cheese crisp, and daughter's enchilada was excessively oily.  Excluding the oily cheese and the prices it wasn't that bad.  We would go back again.  They seem to have some decent specials.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b7U-ZMom4C0F3r59w0Ny5g"
  }
}