{
  "PN8PcU1AcOZYQ3TcDYygqw": {
    "date": "8/8/2016",
    "text": "Definitely gross food. Don't know how dine in is, but carry out is terrible. Paid $30 for garbage",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0EIJ6CYmvwEjlv4hcHfm1g"
  },
  "S_-aLgRYmVaw6f1p2H1Scg": {
    "date": "1/19/2017",
    "text": "Since the new owners took over last year, this place has received a facelift in interior design, while still keeping the same delicious pizza and friendly service!!! I stop by every time I am going out in old town on the weekends, plus other times when I am in the area. (There is always a long line in the weekends after midnight. They stay open every day until 4am). The pizza and the service have always been great. It has way better pizza than most other pizzerias I have tried in the Phoenix metro area. This is the go-to place in old town Scottsdale. Keep up the great work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PCDBhkVTufpGZwFfoFE8CQ"
  },
  "2Bii8UjmZhKWPXpkaFi3xQ": {
    "date": "10/11/2016",
    "text": "Greasy disgusting and expensive. No chance I'd order again. I can't speak for anything other than the pizza. Really poor quality.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KXRT2AQFswllV1fM6GiSsQ"
  },
  "21KyyHDWPRG6xcxqk_Xdeg": {
    "date": "12/5/2012",
    "text": "No matter how snobby you think old-town Scottsdale socialites can be, the truth is they like to get hammered and stuff their faces just like us real human beings. In the indiscriminate hours of 2-4 am, you can dine by the slice, or if you gotta have it fresh like yours truly then reject the premade meal and get yours made-to-order.  $20 for an 18\" with two toppings is a bit pricey by some standards, but after shooting Patron all night like a rich bitch I could overlook it. They're busting out the dough and making my pie FRESH in the middle of the night, so tip them well. Crust is legit, cheese is REAL, stringy mozzarella. Staff is kind and quick; the manager keeps the young guys running around, working hard. This pizza is quality hangover protection.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "YpGt3hdq5adPlEFn9fQ2Zw"
  },
  "7yUEi92pHJqydepDGCKcjQ": {
    "date": "7/18/2016",
    "text": "One word... Well, actually two words... Greasy/  overpriced. I had pizza delivered to my hotel on Saturday it was over $55 for two large pizzas or 10 wings and bread. Absolutely would not order from again",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nabZzezZdUrTipN2wAPCJg"
  },
  "aFZRzw1BhXVkqSI-P8UCEA": {
    "date": "2/6/2017",
    "text": "Ordered pizza from this place twice while I was in Scottsdale. Good pie for being in Arizona. Definitely recommend the place!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1eyzopQ4TSeTGqlMyZCjTw"
  },
  "tdYaediX6LrrBxQFJ_yNOA": {
    "date": "5/13/2016",
    "text": "Um no.  Ordered delivery tonight. The cheese pizza was flavorless, bland and just plain icky. I've never been to NY but I hope this is not an accurate representation of their pizza. If you have zero taste buds this place is for you!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "0GjGcwNyBH6hDoZDGtbPoA"
  },
  "EwNJSEPVc6CTUW8rQzDqfA": {
    "date": "12/3/2013",
    "text": "I'm giving Joe's four stars but that may be a bit a generous. I just feel like three is a little low but my experience was more like a 3.5. Allow me to explain.  My boyfriend and I stopped by Joe's with our friends after going to the nearby bar. We picked up a slice of cheese and a slice of margherita pizza to go. Everything seemed fine until we got home and looked more closely at the margherita pizza. We're pretty sure that instead of basil, it had spinach on it. I've never had a margherita pizza with spinach instead of basil so we're wondering if it was a mistake. I suppose the two green leaves look somewhat similar. And I'm assuming it was supposed to be margherita pizza. That's what we ordered and no one corrected us.  Aside from that misstep, everything else was good. The cheese pizza was delicious, especially topped with a bit of parmesan cheese and garlic. If only we had only gotten the cheese, this may have been a five star stop.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hHgNg6u9P_Ym5wLXmnoBcw"
  },
  "0Y8a2JyC_Dck87n-bSjvgg": {
    "date": "6/23/2016",
    "text": "Just got some pizza take out for dinner, nothing crazy. Honestly it wasn't very good at all. We could have gotten one of those $5 pizzas from little Caesars instead. Tasted exactly the same. Disappointed that we spent $14, we could have gone somewhere better with that. Oh well. Lesson learned.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0wYUSca-TrMMGrew1GMkMQ"
  },
  "rtgi4g-vHC8othxWEkfmGw": {
    "date": "12/31/2016",
    "text": "They delivered to me at 2 am on a week night. Awesome! When I ordered, all the big pizza chains had stopped delivering. I love the traditional garlic bread with cheese. Much better than cheese sticks by a long shot. I really liked the cheese blend on the thin crust pizza. Closest taste to Imo's Pizza (St. Louis style) since I moved out West.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eoBtncGCgsEyEC5__rtIag"
  },
  "Vup8EIxQixGtjjeyNzDnIA": {
    "date": "6/6/2015",
    "text": "Joes wife licked my pizza and drank my water. Very angry lady.  I switched my pizza out for garlic knots - not free.    Come on Joes wife - you gotta represent. It's not my fault you were all angry prior to us sitting down next to you.  Your friend tried to calm you down, no?",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f3NPIoxxE8Bg2LnttCYgIg"
  },
  "C4-0zA6b9mSJuW51kkHOgg": {
    "date": "5/21/2016",
    "text": "Delivery took an hour and a half when ordered at 6:40p on Friday evening. The food was a huge disappointment for the wait and price. We ordered a pizza with half cheese half sausage. They put sausage on the whole pizza. The garlic knots we ordered were terrible and had no taste. I will never order food from here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "d8G1W648S6UeHehQUdBqfQ"
  },
  "vS-mxrYr5nYcnkOQeHuO3Q": {
    "date": "12/18/2016",
    "text": "They ain't ever showed up. They are the worst. It use to be my favorite. You let me down Joe. #gusforlife",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rkJ95ti1d6OwB9QlEt9ooA"
  },
  "avfpk0DcPE9ZzWlO6gPRYA": {
    "date": "10/7/2014",
    "text": "Customer service means a lot and Joes does not have it. Found Joes by accident and it looked inviting from the outside. They make their money off serving the after clubbing drunk crowd who just want the closest food. Someone needs to tell the counter employees to treat people who come in there on a Wednesday afternoon with appreciation & respect.   A strange non-feature is that there's no iced tea. No sweet, unsweet brewed, or fountain tea. Also not a large selection of fountain drinks and one of the flavors was not working.   The veggie sandwich was really good (see pic.) Thats the only positive thing I can say about Joes.   Got an order of cheese fries and they were disgusting! The fries were soggy with no seasoning. Don't know what kind of cheese was melted on them but it wasn't good either (see pic)  The only reason I didn't try the pizza was that it had flies all over all the pizzas and the employees clearly didn't care. Since they leave the doors open the small, crowded restaurant has many flies all over you food.   Even after the next time I leave the club in search of munchies one night I will NOT be going to Joes.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "svmWfvbaChvYZKHVIbFwyg",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Awful &amp;amp; gross cheese fries. Stay away!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/svmWfvbaChvYZKHVIbFwyg/o.jpg"
      },
      {
        "img_id": "Y0TVFkoUpF9DdFhKUHjIog",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Veggie Sub",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y0TVFkoUpF9DdFhKUHjIog/o.jpg"
      }
    ],
    "user_id": "bA_0WltreAfajPFUm5rgfg"
  },
  "FjZlN4NYJHWcIuS8BcXIHw": {
    "date": "8/21/2015",
    "text": "I was excited to see New York style... But was very disappointed with what actually arrived. For some reason pizza seems like the easiest thing in the world to make but these guys missed the mark on most everything. It arrives in a giant square, the crust is like a massive piece of tasteless focaccia bread. Sauce tasted like watered down Campbell's soup...no seasoning that I could detect whatsoever.  We basically ended up eating the cheese off of it. The good thing is that it will feed a family of six no worries because it weighs about 50 pounds. It was cool to be able to order right off yelp, and they came exactly when they said they would.  That's why I have them 2 stars.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YS3shR8RfHnOu5Xyi_ew4Q"
  },
  "EpyQiC96xLbhGS7dJxKlag": {
    "date": "10/25/2016",
    "text": "The pizza was fine, the mozzarella sticks warm, and the mac n cheese okay... HOWEVER I am giving you FIVE STARS for delivering my food in fifteen minutes when the estimate was 60-70 min. GOD BLESS (it was a long day)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lhGqnhW95cCikBfylR4oXg"
  },
  "gOo8ZHUQHvGZTrIhVnscJg": {
    "date": "5/31/2016",
    "text": "Vary bad customer service for delivery. Order from Rosties pizza much better they would not validate there own coupon. I thought guses pizza was bad they are just as bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DdkbITDRx0EcrEHX4fP0QA"
  },
  "Y2TdZRKH_HA0Lmaxuva8_g": {
    "date": "12/1/2017",
    "text": "Great walk in for a slice of pizza. Friendly atmosphere and generous size for the price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3OlupJ98DRqYT1V_zUtJg"
  },
  "_Z8ZQ3hKqDPXswLXu0Lqcg": {
    "date": "6/18/2015",
    "text": "This is definitely one of the best pizza places you'll find in Scottsdale that's open late. After a long night of partying, Joes is definitely the spot to be to eat after Old Town has done you in.  My favorite thing about this place is that if you work in the nightlife industry (lucky for me!) you get a discount and the staff is extremely friendly to all!   This is my favorite place to go after work and while on break!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JkDABH58jy7VOGPIvj4xSQ"
  },
  "aupeB1S9HIac_jr5KF98zA": {
    "date": "4/27/2015",
    "text": "I expected a lot coming in here. Real NY attitude, RC Cola in a can, pizza looked amazing. For some odd reason I ordered chicken parm. Odder still, it came out on bread rather than pasta. I decided to take it to go and grab a Yoohoo on the way out, the cashier edited my ticket to include a $5 tip rather than ringing it out, thus messing up my expense report. Upon getting back to the hotel I was eager to tear into my food, which was terrible. Thrown into the trash, nothing good about it. They get 2 stars because the pizza looked amazing. I might give it a shot on my next trip for the pizza, but I do not know just yet.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ETUltw5xeoXXQkxon-M-gw"
  },
  "9UcuKdrlZx8abMcZdDH9AA": {
    "date": "1/20/2011",
    "text": "We are visiting from Minnesota and staying in Scottsdale.  There aren't many places that deliver, but thank goodness we found Joe's!  The pizza came promptly and it was very tasty.  For a huge pizza and salad, it cost $28.     Laurie, the girl on the phone was courteous and friendly.  She even threw in a piece of the thick crust pizza for us to try.  She also asked if we were sure we wanted the thick crust b/c it is really thick.  I'm glad she included the piece because it was thick, like pound cake and we were pleased she warned us.  The thin crust was perfect.  If you're in Scottsdale, go to Joe's website and you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EsHuZbXpz5ijxZtN1YxJ-g"
  },
  "t41dndpuzMjBaIChQEOhnw": {
    "date": "7/24/2011",
    "text": "Service was quick.  The place makes several pizzas and then throws your slice in for a quick reheat.  Because the crust is so thin it comes out cracker like after a re-heat.  The pizza was ok but I'd rather go up north to Ray's or a little farther west to Taste of Italy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UpblbZr7zbnNICFVM9WAmQ"
  },
  "41sLpswydFCzKbcPsa9M7w": {
    "date": "11/18/2010",
    "text": "I've never been to NY, so I can't compare the pizza AND I'm a die hard Chicago pizza fan, so I am a little biased; however, if this is what NY Pizza tastes like, it's better than I thought. The pizza is crazy good and the calzones are even better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UktKGyMjLI41xz9VNFwULQ"
  },
  "n3_ZtxPNV3sF8czX0Ov0wg": {
    "date": "3/25/2009",
    "text": "I walked over for slice at lunch today and realized that I hadn't reviewed Joe's ! What a horrible oversight! Well, oversight corrected. There aren't that many places in Scottsdale (even in this gritty urban jungle where I live, called Old Town), to walk over and get a slice at lunch. That's all I've ever had at Joe's...I know they have sandwiches, calzones, spaghetti, etc., but I just wanted a slice. I will have to try the other stuff one of these days (so many places, so little time). Joe's does good job. It's not Manhattan, but a slice here will fill you up. They do a good job with toppings, and the cheese to sauce to toppings to grease ratio is just right (the pizza creases up just right for eating). If you ask them to make your slice well done, they leave it in the oven for a little extra time and that gives the crust a little more crunch, for those of us that like that sort of thing. Nice people behind the counter and the place is clean, has a few tables outside for sitting and eating on nice days. And, finally, a big slice of pizza and drink only sets you back about $4.50. It's good, cheap eats for lunch!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "SrF972IxsELYQ3eaWB5X4A"
  },
  "jrx6iMKdLTOeF4YIu9ImMQ": {
    "date": "12/3/2008",
    "text": "So for a number of reasons that I won't go into, we got a free pizza delivered from Joe's the other night for dinner.  Half pepperoni, half chicken pesto.  I was highly unimpressed.  Even after I lowered my expectations due to the fact that it was delivered and free.    The pizza was cold.  Crust was bland and rather cardboard-ish.  The cheese was waxy.  Toppings were not very flavorful.  Don't get me wrong, I appreciate a free meal.  However, a free meal is always an opportunity to get or keep a customer.  Based on the pizza I wouldn't order again.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "qObjB6PbqsAxyRuBDL3c_Q"
  },
  "aaVkGvjGHlv2C__UcRnZYw": {
    "date": "11/17/2010",
    "text": "Reminded me a bit of Z Pizza.  Pizza was modest, just cheese & pepperoni but it was big! Wings were good and came exactly as we ordered, baked with bbq sauce on the side.  Totally worth the price.  I will be ordering from them again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N2JbGLHvN8Fmgd03rMJUrw"
  },
  "9HWBng3kjH2_Us4MrpPVOA": {
    "date": "9/28/2009",
    "text": "I was drunk when I ate here. It did save me from a getting a hangover. The sicilian was garbage. The regular was the same. $10 for 3 slices. Bogus slices. It was just like Sbarro's. The pizza was floppy as hell.  I guess you can't really complain when you are drunk. In hindsight, this place was a poor imitation. I would prefer the hillbilly trash pizza I eat in Cleveland.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "dt9IHwfuZs9D9LOH7gjNew"
  },
  "6KezGUlYfNLfX-Zpq7Lj1A": {
    "date": "3/6/2009",
    "text": "This is not great pizza by any stretch of the imagination but it will get the job done at 2 in the morning after a night in the club. This place gets crowded but the line moves fast. It's also a good place to try to chat up a girl if you struck out in the club.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "0XO_M4dLk4v3f7PgeCnqPw"
  },
  "-En-OcMN9_jKHL4Th2oerA": {
    "date": "2/15/2008",
    "text": "I am from NYC and Jersey and this is the best pizza I had in 3 years.... enough said GO!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "nk-YLm-uY7KiyoNv88V7Xg"
  },
  "2M7Olytb2evdlqGJm-dP3Q": {
    "date": "2/28/2007",
    "text": "How much is good pizza worth? Is it worth being subjugated by a tyrranical owner slinging expensive pizza?   Maybe, but only if it's really good, which the pizza at Joe's happens to be. Decisions, decisions.   It smacks of the soup nazi in its unfortunate contradiction. If the pizza weren't so delicious, this would be a quick and decisively negative review. Sadly, for me the reviewer, for me the consumer, it isn't that easy.  My suggestion is to go during the day, before Joe is embittered by partiers and the lunch special is readily available.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "R4eLJKwG9yQ44vfwaUHS3g"
  },
  "UVJ0rIYUjZQvtNKFmmLl4g": {
    "date": "1/17/2010",
    "text": "Good place to stop for a slice, the pizza is the perfect consistency with a slight crunch, a large enough slice with thin crust that you do the traditional fold and the tip will drop slightly with the right amount of grease dripping off of (it is definitely not diet food, but it will fulfill your need for a real NY style stop in pizza joint).  My first time I tried the meatball sub, which while not bad really was not memorable.  They have cut outs from Drake's baked goods on the walls, and if they actually sold them it would push them straight to 5 stars for me",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KVXF6b-tSyQoRVLSdJqdbw"
  },
  "5_HD945O3htObfG6gJ7b_Q": {
    "date": "5/16/2009",
    "text": "I would have to say this pizzeria is closest to nyc pizza you can get in this part of town.  Nice big thin slices and relativity cheap.  But I sure do miss the real nyc pizza though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rSfZv6qsEOXJxdNYWDtPDA"
  },
  "OgQWn0Q8UeeD8JW0LnjDOw": {
    "date": "11/12/2008",
    "text": "Ok so there really isnt any good new york style pizza around where we live so we gave this place a couple second chances. The pizza is starting to grow on me and now I look forward to grabbing a slice from Joe's because gosh darnit it really is pretty tasty! As for the garlic knots, well those didnt get any tastier after a second try but this place is still worth going to just for the delicious, nearly perfect new york style pizza. They also have the famous east coast tasty cake products that they sell individually for only a dollar! Definetely adds to the allure of the pizza when you know you can get a tasty cake to finish off your meal! Second Overall I give this place a \"Mmmmm, tasty cheese pizza tastes yummy and make my tummy happy\"",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ECcXvW4cLQF9zYH8KoynJA"
  },
  "wOGfW-JLdb_7OabS-XeVWQ": {
    "date": "8/26/2009",
    "text": "I try just about every pizza joint near me and this is one of my favorites.  Something about the cheese at this place reminds me of the pizza I'd get in Pittsburgh.  Another great thing about this place is they sell it by the slice.  Good, greasy, thin, NY style pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RqOL1_Z0DGqLWFVRq0WWsQ"
  },
  "XXyNIuFlStZO6U7ULlfUfA": {
    "date": "8/18/2012",
    "text": "I'm a NY'er and long time Joe's fan as it is the only place in town with a decent slice.  I must say that lately the quality has been declining.  Not enough sauce on the pies, bad tomatoes in the salad and even some bad entrees lately.  I just hope that someone over there reads these reviews and gets things back to how they used to be as this place has great potential.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wbjXL9usi7MkJelwVbVeFw"
  },
  "wr2GdhbTW2ms0IP-kJMYqg": {
    "date": "8/19/2007",
    "text": "New York Pizza joint, in Arizona, with a Chicago owner.  Interesting....  This pizza was awesome, but a bit overpriced.  The owner was there when we went and she was super nice and got into some good conversation with us.  I'd definitely eat there again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BitdrPsmX1SJtNHFpWuj5w"
  },
  "H7-LgV0oerKYHSPD918L0g": {
    "date": "5/21/2006",
    "text": "The Best in Phoenix by FAR.  Get the house chopped salad as well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ynO_IxNhmU4vRKQ-g37x7w"
  },
  "claRmn3i2WNBKT_rJzt7pg": {
    "date": "9/9/2012",
    "text": "Great New York Style Pizza. Just like what you would expect to get in NY or Jersey. Legit crust and sauce.  Have yet to try other menu items because the pizza is so delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4odYObI8Tsnf7o73FWRepQ"
  },
  "_wp5_ogjxevwQWjJUiDk2g": {
    "date": "12/2/2008",
    "text": "I just love this place.  yes I have had better pizza in ny.  but I dont think I have had better west of the mississippi. especially I notice its really great when it first comes out of the oven.  so I recommend if you go late night pick a slice that just came out not one sitting around a while.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ekGdlTrmubO6SJvzZTtz2Q"
  },
  "sz6F-8kXrFy1zR5RDnpRlg": {
    "date": "9/27/2010",
    "text": "This is as good as it gets if you are in Old Town!  The pizza is as good as it gets in Phoenix.  I would put it up against Bianco's downtown any day!  Don't go real late night because you run into drunk fools, but if you go early you can get a great slice very cheap and still have time to enjoy yourself without being harrased!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rLIGOTonZ0lD4AsOhv6K9w"
  },
  "yrOgbwTRFqTgbhNZm5C3Dw": {
    "date": "6/13/2018",
    "text": "The pizza was good. The amount of pepperoni on it was disappointing though. There was about 2 pieces per slice. But it's pizza so it wasn't terrible. What was awful were the garlic sticks (knots?)! I took one bite and had to spit it out. They were covered in giant chunks of garlic and tasted as if they had just fell into a pool of olive oil. No flavor, gross texture, do not order these!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k2p0SufCa2ZZ_D85u55IZw"
  },
  "5q-xTQoyn0E2LOnwhU0yEA": {
    "date": "2/15/2018",
    "text": "Ordered this late night after a concert the delivery was about what they said maybe a little late but after trying my first piece I was pleased I'll definitely eat here again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "aKBe5QsCroM9C6mxxPu7AA"
  },
  "8PmadqL0h7AqF55LQvGa7A": {
    "date": "4/23/2017",
    "text": "DO NOT ORDER FROM HERE!!!  Wow, this is probably one of the worst customer service experiences I ever had. Cliffs are, I ordered a pizza last night, was supposed to be an hour delivery. An hour and a half later I call and ask where the pizza is, they say the delivery driver is on the way. One hour later, no pizza, I call the store and its closed.  So that was crappy enough, but today I called joe's new york pizza to talk to the manager about it. The owner is was there, the employee I was talking to on the phone relayed to me that \"since I was paying cash there's nothing to do.\" I said- \"yeah what about me waiting 2.5 hours for nothing and you failing to deliver?\" I asked to speak to the owner, apparently he was too busy.  I told the employee if he refused to talk to me I would just leave a negative review, and that I'd rather not to do that. The relayed to me that he didn't care. WOW!   The owner of this company DOES NOT CARE about their business. Truly I'm amazed, one of the worst customer service experiences I've seen-- and from an owner!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tky57vsFW9hYx7trGI--Gg"
  },
  "uA_6fUvQW1bfvhc5xZu9_w": {
    "date": "10/9/2018",
    "text": "So I would never write a negative response about a buinses to hurt them intentionally. I need to be honest, 1st dont put NY Style Pizza, furthest from the truth there. The Cheese on their pizzas  is filler with the worst sauce I've ever had. The only thing good about this pizza place is their frozen food that is brought in by whomever their supplier is. Chicken wings, Mozz sticks etc. I cant speak for anything else than the tasteless Pizza and their marinara is equally as bad no cheese whatsoever and sausage was horrid. I would proceed with caution seriously not good for the high prices.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hQbeWCpaNMrtc5pV-3uV3A"
  },
  "Hqps9mNDBEDNGIIgHZsPVQ": {
    "date": "11/20/2018",
    "text": "This place is great! It was fast service, with phenomenal pizza. Even sober! The squares are size of your plate!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vp3Gkxrk_9HvJvvZ_RBvaQ"
  },
  "e6DKlL-aqJh6O2X8R5Wd-A": {
    "date": "5/10/2017",
    "text": "The manager at night sucks and the actual pizza cook is the only one that knows what's going on. I ordered a full pizza and the other stupid employee decided it was a good idea to serve it to customers walking in, now the third time in a row they messed up and proceeded not to fix it along with insulting my intelligence by saying oh I can take half one pizza plus 2 and another 2 is 8 so it's the same as a full pizza they also don't wear gloves or wash their hands",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "togJ7kODd8GbBFqe7w1cTg",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. The one on the far left has attitude problems the one in the middle is one who messed yo and gave away my food",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/togJ7kODd8GbBFqe7w1cTg/o.jpg"
      }
    ],
    "user_id": "F7joyElQhwJKwZzEUtX4oQ"
  },
  "NAY74ic-LWuQK1HYYKLhYA": {
    "date": "3/8/2016",
    "text": "Well HUGE disappointment.  Really NOT good food.    Pizza with tomatoes and spinach sounded awesome.  It might have been good if not delivered ice cold and soggy an hour later.  Actually, no...it was pretty flavorless even when we reheated it.  A single pizza with a side of Mac and cheese $40 plus a tip.  The Mac and cheese was literally a few noodles and some watery cheese sauce.  VERY Gross.    It seems that many of the positive reviews are from post-party people. I get that.  With enough alcohol anything can pass as good food.  But don't try this garbage sober. You'll wish you were drunk.   Absolutely NOT worth it.  Also, could they not bring a single pack of cheese or red peppers?  Apparently that would have been too great a cost for them to spare a single pack of Parmesan cheese.    I have no problem paying a premium for really good food.  Not the case here.  It is sad when I wish I had ordered cardboard dominos instead -- it would have tasted better and cost half as much.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 13,
      "cool": 4
    },
    "photos": [],
    "user_id": "CZ4tdIXmiiMQHQ62lesnKw"
  },
  "3KklwYH10whheIRtyqq9Fg": {
    "date": "2/10/2018",
    "text": "My husband and I drove 40 minutes to try this place for the first time. Let me tell you something...it was worth every damn minute of drive time. This is the best pizza I've had in Phoenix. Great location next to some other popular night life spots! My husband is from New Jersey and said it's the closest thing to NY pizza as it gets.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mGXkaFbhWiQZfhND2-kJUg"
  },
  "FDi0FMVyvTFOlTHvhcKGtQ": {
    "date": "3/17/2018",
    "text": "Ordered a pizza for delivery at 6:30pm. Was told it would be about an hour. It is now 9:48pm and I have NOT gotten my order. I called 3x to check on status of the order and was told it was on its way...apparently not. The manager told me he was going to call the delivery guy and see where he was. Yeah, that was at 9:00. Good thing my 5 year old had leftovers from dinner the night before.  I'd give it a zero just for service alone since I have no idea what the pizza tastes like.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N7fBlQXqeTNhLOnzpdBPOA"
  },
  "JEoeg1GgW_e968jmsNwgsQ": {
    "date": "2/7/2018",
    "text": "I am from out of town. This is a small place no frills great crispy crust pizza. The sauce is excellent and cooked perfect.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "01XkH1nZF7DtauNLdhFA3g"
  },
  "TsfVAarXWlmlX5dOoaKzQw": {
    "date": "9/6/2018",
    "text": "The best. Especially when your drunk.get the vegetable Lizzie or whatever pizz you feel like.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fCETQfxnCHv4tGA089P79Q"
  },
  "J0GRPbYrPaAZ_S6f1QkVIA": {
    "date": "7/5/2018",
    "text": "Worst place i've ever ordered from. Came in around 5:50, ordered a large pepperoni pizza, and half barbecue half buffalo wings. Wings were done in minutes, sat on the counter. They were busy so we waited patiently however after 30 mins went and asked if they forgot our order because they'd made around 6 pepperonis for people who came in after us. They told us we were wrong and had only been there for ten minutes and to wait. Another 20 minutes passes and we ask again, Guy couldnt remember our order and just gave us the pizza out on the tray, and then our now cold all HOT wings, which was not what we had order. Horribly horribly rude, mean, awful service. Hour long wait for cold wings and mediocre pizza. Just save yourself and go to little ceasars, or ANYWHERE else. Cant get over how nasty they were to us.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WVNUCd2-LmXV0RC8gl4t1Q"
  },
  "FcpnoewujKwtgt4SudR4AQ": {
    "date": "9/21/2018",
    "text": "I am not a big fan of Pizza but when it comes to Joes NY in Oldtown I turn into a pizza lover. Great pizza, ranch is so good you can drink it, reasonably priced, and excellent staff and customer service. Every time I go in for lunch the young gentleman in the front with the tattoos is always helpful and friendly, the cooks always cook my slice to perfection and box it up with a smile. THANK YOU JOES NY and STAFF FOR MAKING ME FEEL LIKE IM BACK EAST AGAIN",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LJ4oU6whJr3UZJurcHYugw"
  },
  "RGSwj3hDUUvmDKIIXu6bsw": {
    "date": "2/22/2018",
    "text": "This place is the best pizza I ever had in my life and all the other food is very very good the waitress Lynda is very kind and the owner joe is also I will be there at least 4 times a week for there great food. I give them  stars if I could. Everyone please please please go try Joe's pizza and tell them Brian Williams recommend y'all",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nbTpck-otlwaLLWhQANbTg"
  },
  "tOw4WvctdxMeYOYbvQv3bg": {
    "date": "6/23/2017",
    "text": "I enjoy a good pizza and it's very hard to find a good slice .   I stepped into this place about a 5 days ago , and it was made perfectly.   I just ordered by slice one pepperoni and cheese and very well cooked, the curst was very crispy like a chip.   Will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QvdbscVrF1ixZA5CHqufJA"
  },
  "QqpeEjb55BH_N5pPFdMEmQ": {
    "date": "2/21/2018",
    "text": "Joe's used to be better. The owner sold it about 1 1/2 years ago, and she moved back to NJ. Shame how the new owner tweaked a great recipe. Hopefully they go back to the recipe they purchased.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RyRHUcWSwQLUfy8ai6xf5Q"
  },
  "NtaH6IOCcj6iN54r_ceeyQ": {
    "date": "3/19/2018",
    "text": "Not happy with the pizza.  To begin with I got the delivery which was a mistake.  Gave them easy directions to get into the complex, of course they did not listen.  Said about 35 minutes, took an hour.  Cheese was stuck to the box lid and the pizza was not even warm.  Not that the price was an issue, but for a cold pizza, it was not worth it at all.  It was as if they used very little cheese, barely had 2 pepperoni's per slice, if lucky.  I was trying a different pizza place, because our neighborhood place is closed on Monday and I wanted a Non-National chain pizza.  I should've just just gone to Hungry Howie's.  Won't make this mistake again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4rqKS8Xl2O_i7WinoQtYLg"
  },
  "i3lz5h2zHiyOw-KuPyq1zQ": {
    "date": "5/3/2017",
    "text": "Came here for my dads 45th birthday great service But there was this girl that couldn't stop stealing the Hi-C and another couple that kept making out and there is no way they would last a week he was clearly trying to get in her pants. Also styrofoam cups are not good for the environment but I have hope in you guys in changing your ways.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "L-kREYnikLAkAEIbsH8m_g"
  },
  "ZRhO0OpPdmzG9fjXCWISeQ": {
    "date": "9/6/2018",
    "text": "You won't regret going here. Anyone that gives it less than 5 stars doesn't appreciate good pizza",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K8ZDD7LoeBxi9t44f5v3uw"
  },
  "JhLmL1bw393n19hXcJHqDg": {
    "date": "1/14/2018",
    "text": "Hey this for delivery service and rude grumpy driver. I think the pie would be good at the restaurant but don't order it to be delivered. Too many other choices that deliver hot pizza without an attitude. The driver actually had s problem with me because he couldn't find the address.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hVG_vMCVn9pEKU5chZpTw"
  },
  "fggI1X6KyvoNomfGh5ge_Q": {
    "date": "9/27/2008",
    "text": "This is my favorite non-gourmet pizza place in the entire Valley.  As a transplant from the Northeast, Joe's satisfies my desire for decent New York-style pizza (and associated items like chicken rolls and garlic knots) in a metropolitan area that is largely devoid of high-quality \"by the slice\" pizza joints. I have visited both during the daytime and evening and have always found the service efficient and friendly.  If one has experienced less than stellar service at 2 AM, than maybe one should consider why he or she is getting that service. To borrow the lyrics of the New Radicals, \"you only get what you give.\" If I had to deal with some of the Scottsdale populace at 2 AM while in a state of exhaustion in a kitchen where the temperature is in excess of 100 degrees, I might be a little cranky too about having to deal with drunk antics.  I only wish there was a Joe's closer to downtown Phoenix. What this restaurant does is so easy! Why can't more Valley pizza restaurants do it? I guess we'll never know...",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "X8qQBHUgHu6mMZJj24kgTw"
  },
  "8j76Bq-EPwDbdzaAUfwFNw": {
    "date": "3/28/2012",
    "text": "Horrible. Even my 8 year old son said so upon his first bite.  Now I am literally forcing him to eat it because we have nothing else to eat in our hotel room. My 10 year old won't eat it either but he was quieter about it. If you like their pizza and are in the area, come and take our...PLEASE!  Save your money",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CciWjHqrDIHzMfBdIiAmKw"
  },
  "9bubRZJ32YACvfS8YOvb1w": {
    "date": "9/30/2014",
    "text": "First off, the place gets five for the pizza alone. Haven't tried anything else. The slices are the best I've ever had. The crust is perfect and so is the sauce. If there is a downside, it's the dining area. It's small and not very inviting. 90% of the time I get it to go and eat it in the car.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yhZZPzv9PdDLZ49yTugt9w"
  },
  "AjcGywRr9twuLWRKt2_oFA": {
    "date": "3/17/2015",
    "text": "We were staying at Scottsdale Plaza Resort I asked the front desk where to get a great late night pizza they said to call Joe's I called and 30 minutes labor later there was hot pie on my porch it was excellent late night pizza",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J8Rte8s0dVTAeAjFx0GCYg"
  },
  "IcwOG-Pi8hPjmz9AKkuZhg": {
    "date": "5/9/2014",
    "text": "Absolutely terrible, do not order from this place. Worst pizza and longest wait time ever",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QUmxcprkhTn0-Nk_cVivow"
  },
  "-s4DSxL0-4DIN2VJCn5Ltg": {
    "date": "3/3/2015",
    "text": "There are only so many places you can get great delivery food in Scottsdale. This is one. For what it is it- this is great pizza and wings.  Fast service. Did I mention delivery!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f-EY6wRr5LZAMQ5pmYAnuw"
  },
  "9CnZZhtqOWCpysAZP1ug2A": {
    "date": "8/2/2014",
    "text": "This place has decent pizza but it is REALLY greasy.  I always have to dab the grease off before I eat it.  I order cheese most of the time, I ordered onion and green peppers once and the pizza came... It looked like an onion festival was underway... I could see a few green peppers and barely any cheese due to the enormous amount of onions piled up.  I was not happy.  I called next time and asked if they could do a third of the normal toppings, told the lady on the phone my onion story to explain, she proceeded to laugh at me and say \"That was me! I looovvvveee onions! Hahaha!\" Really?? She didn't even offer to give me a free topping or anything.  It was odd.  Other than that for delivery they are very fast, and stay open the latest in the area.  The chocolate cake is disappointing.  It is that same frozen layer cake I used to thaw out when I was a server at a spot in college.  I usually order it and microwave it for a bit then eat it, much better that way!  Really if this place used better quality ingredients and fresh vs. frozen items they would be 5 star....  Don't order the cheese sticks, they are not pizza style, they are fried mozzarella and gross by the time you get them.  Hell, those things are only good fresh out of the frier anyway...go with the garlic bread, it's solid.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L8tEiDuQDulfQcf6AGk0jA",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Cheese pizza with half green peppers and LIGHT onion;)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L8tEiDuQDulfQcf6AGk0jA/o.jpg"
      }
    ],
    "user_id": "fk-jBk1cFF9rsU7Mt-bV2g"
  },
  "HIBsmA0J0pOpO8BadixuSA": {
    "date": "5/2/2013",
    "text": "Took forever, was soo dirty inside, and was the worst food I've ever had.  Walk next door to Gus's",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "y60M9rxcFub7kwv41AOIRw"
  },
  "fJPwQLamkRzCKE2WFq4aXw": {
    "date": "12/13/2011",
    "text": "These guys know pizza. There are a few pizza options in Old Town but I would walk out of my way to go here. It's your standard fold in half and drip the grease into your mouth pizza, but that's exactly what I went when I come here and they always come through.   Great for a quick lunch if your work in the area. Also it's another great end of the night meal if your at the bars/clubs in Old Town, there is usually a lot of people when the clubs close but guys it gives you one last shot to spit game when you failed all night on the dance floor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OAN4FPoDiP2xgy6_9X5bbw"
  },
  "rI3wlB3PIA83pqOGx46cIw": {
    "date": "8/24/2014",
    "text": "Pizza is okay but the people that work there are awesome. They are always friendly, the lady boss says hi to me every time I go in. The pizza could be less greasy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-IHMksCDiZjGmkFHhxqKyA"
  },
  "3NufLGQcZfaQZJpudWkOEw": {
    "date": "9/28/2013",
    "text": "I can't find a single good thing about the this establishment or their so-called \"pizza\"... First, the website did not work and after wasting too much time there and finally calling, they would not honor the prices quoted on the website. Second, the prices were way too much to begin with, nevermind when you call. Third, the pizza arrived very late and I was starving so I begrudgingly accepted... And regretted it. Fourth, it tasted like a foot wrapped in a cardboard. I'm no pizza snob, and I hate this place and the pizza. Do yourself a favor and eat the drywall instead.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9PUNgpo6ZKv6gKZPt9Rtvg"
  },
  "6retpGUFrlOhDF3RPI_LVg": {
    "date": "10/12/2014",
    "text": "Joe's of New York rocks!! They donated all the food for spaghetti dinner and were absolutely the most amazing catering team I have worked with!!  Please... as the co-chair of the event that served 470 people!!!..... We can't thank you enough.....Delizioso!  Thanks Joe's-- Laurie you and your team are \"A\" number 1, king of the hill, New York....... New York!!!!!....... Grazie from Our Lady of Perpetual Help's Family  Activities Team!!  Can you say.... Yum!!!!!!!!! And don't even get us started on the pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jumsRnKLLa-V-OMeiddCig"
  },
  "BO-lE3JE4zNie9-KChchcA": {
    "date": "5/7/2014",
    "text": "Just had it tonight and it was fairly good pizza, not great though. The slices I got were pepperoni and a chicken alfredo slice (?) but they appeared to have been sitting out for a bit so perhaps if fresh would have been a bit better. Either way a good place to get some fast grub especially if you are out for some drinks. Will review again after a fresh slices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XlnJaTkb-jrL-GUw-09hjw"
  },
  "x1hQMm8Wfpavj5I6DDptEg": {
    "date": "3/18/2016",
    "text": "Ordered a pizza at 1:14 am. Called at 2:46 to ask about my order. After being hung up on the lady calls me back to say the ticket never printed. Well if it never printed how do you know what my order was? If you can't handle late night delivery then don't offer it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n200NLeJ8HG-ble0za6D9A"
  },
  "i78JIX4xIJoudacfVOISIQ": {
    "date": "3/15/2014",
    "text": "Delivered early and was legit. Thin crust New York style with wings and garlic curls. Service was good and for a great price. Awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JuQ1KXtEHiDELx6meAoKHw"
  },
  "DDRGEJxODMPL4T5Yv5nBrw": {
    "date": "5/17/2015",
    "text": "I only got as far as the phone call for delivery. I talked to 4 people just trying to place  a delivery order over the phone. Everyone was very rude with me. I guess you could say it was authentic with the New York Style. I asked for the minimum price on a late night delivery, and minimum distance from restaurant. Sorry if that's too much for you to take on. Obviously McDonald's holds a higher standard for late night dining. I manage a restaurant . Minimum orders suck, but so do minimum restaurant sales. You never know who will over tip when no one else is open.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YmXTkYHdQJDNfpfPx1UNwg"
  },
  "zrQqzdiNwYAhXjjjQPXMkQ": {
    "date": "10/11/2015",
    "text": "Terrible! Will never order pizza here again. I usually order pizza to go for the family. Tonight it was like eating cardboard. I called them to tell them and basically",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NML7g-OY88v-t4uilaEraw"
  },
  "aRtCwvGmzfGhMpVWPrOXIA": {
    "date": "7/16/2014",
    "text": "This is a great pizza place to get late night food they are open late every single night whenever I need a late night snake I always end up here definitely like the jalapeno pepperoni by the slice it's good for late night but maybe not the best for daytime",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mm4XmqJSx5HWpouGXyY0Sw"
  },
  "BUhcCbFfL7RQKcm7aX31zg": {
    "date": "1/6/2016",
    "text": "Just received delivery this evening. Delivery was prompt, pizza hot and good and no problem with delivery person at all.  Ordered on line.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jgz8LAIZ6itMCn6c1In6bQ"
  },
  "uT_RqAcamG2MeAIvpnK1iA": {
    "date": "7/13/2014",
    "text": "Been ordering Joe's Pizza for years.  The delivery is anywhere from 25-50 minutes. The pizza is fresh. We order the Italian subs and the dressing/sauce they put on it is fantastic. I usually order it on the side so the bread stays fresh. We are are not a fan of the french fry's or chicken tenders, they usually lack flavor and are soggy.  We order this food after a night in old town or a lazy Friday night. Prices are reasonable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9uKB3_1tXWRPxr-hNO9SQ"
  },
  "OJYWt0lplaPSgrrbcG895Q": {
    "date": "12/20/2015",
    "text": "I order a Pizza . I live within a half mile away , super close . Looking back I shoulda walked ... I'm told 30-40 min . Cool. Over an hour and two calls later I cancel because everyone passed out here from waiting . After cancelling , that message gets relayed to the driver. 15 minutes later  I get an angry knock at the door . I open and say, \"Hi , sorry man I canceled 10 minutes ago \" then, as if he rehearsed his verbal reprimand he was determined to dish out to me,  with a pissed off look, he explains wait times and what I should expect for delivery time looking like he wants unload and tell me off as I stand in the doorway in my pajamas , half asleep . I get a slight whiff of the pepperoni and sausage pie he's holding in his right arm and deja Vu rushes over me as I start to get hungry again. However, I still say no thanks and he mumbles and grumbles as he walks away looking like he wants to shove that pie right in my face . It's obvious he was told I canceled the order but he wanted to get some satisfaction from telling me off. Maybe I'll try again but I'll walk next time .",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "PXyrSnVbeAfnM4leK_Skqg"
  },
  "65HzHEdvLJOUH7AkAGROWQ": {
    "date": "8/31/2016",
    "text": "Most of us who crave pizza are either drunk or having a cheat day. Well this is my FAVORITE pizza place to go for either of those. Their 18\" pizzas are cheesy and greasy, and pair perfectly with ranch. Keep up the good pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1GA6teMgohf6XQxH4OuL3w"
  },
  "4yZgSa5WEohys4tj9SNwjA": {
    "date": "10/23/2014",
    "text": "Daytime visit - slices were fairly good.  Good cheese, base crust ok, though the crust at the end was nice and airy with good chewy inside and good crunch outside.  Two cheese slices and a drink was a little high for $8 but it's not a cheap area.  Seating was extremely limited, mostly community seating in fact, and tables not cleaned.   Parking was somewhat challenging on the street.  Would only go here again if it was an off hour, perhaps right at open or after lunch rush.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q4Qfu-3vYtL1LRm2X1b0Gg"
  },
  "FtYUY0aNKTSh-uEUwkjMhQ": {
    "date": "6/14/2012",
    "text": "Found these guys here on yelp ordered a cheese pizza (delivered). They had a special with chicken wings, so I said \"what the heck, I'll get those too\".   I got the hot wings...they were ok.  I wouldn't say they were ridiculously hot just hot enough to make you wanna drink beer.  And that was fine...  The pizza however was amazing!   I was pleasantly surprised to know that somebody in Phoenix actually knows how to make pizza!!   I would definitely have the cheese pizza again.  The crust was perfect.and the cheese was tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "QjC6g-SP1zcc1lpmEeuM-A"
  },
  "a2fPswf5S_IZ7b0Kbu8ohA": {
    "date": "8/2/2012",
    "text": "To be fair, I haven't had the pizza. Considering that \"Pizza\" is in the name, I should probably try it one of these days.  I have had the chicken roll, the philly cheese steak, and the cheese fries. Their fries are a little bizarre because they are very much homemade (big thick potato wedges that are soft and soggy, not crispy) and covered in cheese slices.   I love that they deliver late. The food so far has always been good enough for late night eating.  Short list this place if you're in the delivery area in case you find yourself up late and craving pizza and subs!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LhV7Uxe6cvOBU4OBh6PPdg"
  },
  "G9kHM2zPhgGXnvS6wYqPMg": {
    "date": "5/8/2015",
    "text": "Closest thing to NY pizza I've had in AZ.  Owner knows what she's doing. Keep it up Joes, thanks for restoring hope for NY pizza out here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T_s7yOCHWuSKaq_oaT_pOA"
  },
  "gVcTGKaw52FUObNYpzU5ZA": {
    "date": "4/16/2013",
    "text": "My fav pizza place in town. Jalapeno/Pepperoni way to go  Best pizza in town  If you havent gone to Joe's and left the town. You missed the delicious pizza which this town offers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zEQZZTd-HXebVr10J1QbFg"
  },
  "riJqcXrB35CM7MEVklxAuA": {
    "date": "2/2/2016",
    "text": "Liars. Sold us half a bottle of wine, 12 beers, and a pizza for 80 dollars promised  2 bottles of wine, and  24 beers. Hung up on me when I called them to talk about it :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4e3s5fdYTfDtygR3wMFtpg"
  },
  "jd2cdx4ZGNL_Dq8vgkzEQA": {
    "date": "10/19/2014",
    "text": "Not happy with you joes. Don't bring correct order and don't offer to correct mistake.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MH7NihrEfKBYcim2gCv8zA"
  },
  "AanPqkBt3mmdmZZ_BJrkhg": {
    "date": "1/10/2016",
    "text": "Really Upsetting! Ive have been a loyal customers of Joe's for years now as its in our neighborhood and have always had such good service and amazing pizza...I ordered their pizza weekly! Ive always loved their greasy large super cheesy pizza. Ive noticed the last few times i have ordered the pizza was horrible, cheese was falling off everywhere, so much sauce or its not even NY Style. Tonight just really ruined it for me. I ordered my pizza and left in the comments to add ranch and buffalo. Our pizza arrived almost an hour later after the delivery man who didn't speak such good english called me 20 minutes prior to arriving asking where my exact place of residence was, i literally live 7 minutes at most from the store. When he got here, even though it stated on the receipt when delivered about the sauces the driver looked at me clueless when i asked where the sauces were. He just said its not on the receipt when it clearly states so. I sit down to eat and open up the box and the pizza is ICE COLD. Literally stale at this point. I called them to complain and was HUNG UP ON 4 TIMES IN A ROW. Horrible customer service. After calling back the woman who has an accent had a rude tone. I was transferred to the store after 20 minutes of being hung up on and being on hold numerous times. I was told the manager was to contact me tomorrow to resolve this. Its just really disappointing to see how downhill Joe's has gone in the last few months, it almost seems like its under new ownership or management because instead of calling the store directly your sent to an outbound office. I definitely wont be spending anymore money here and sadly have to find a new neighborhood pizza spot of my liking.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "uW4ZVFRbJGpdwN51W7qNvg"
  },
  "Tlue_fDxP27HdkUQPvVfOQ": {
    "date": "7/9/2014",
    "text": "It was ok. The pizza was good and \"foldable\"\". Garlic knots were dry with no garlic - really disappointed in those. Unfortunately I have nothing fantastic, witty or biting to report. Very middle of the road.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wrbrLjAgupNnS8FaTM1HVA"
  },
  "bcD01dfTS9U94i5jIloZ2A": {
    "date": "1/25/2015",
    "text": "As a born and raised New Yorker myself this is probably the best pizza I've had in Phoenix. Not exactly New York good, but close and definitely best in Phoenix (so far). Great price, speedy preparation, overall good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVOstGtEn8zJmlxfr6JA6g"
  },
  "aQRhMncTgq9T0WbNFJkxVg": {
    "date": "1/4/2012",
    "text": "It was 2:30 a.m. and I had the most excellent idea to order pizza for everyone after partying the night away for NYE.  Being not from Scottsdale, I had no idea where to find pizza in the area so I went to my trusty Yelp app and found Joe's New York Pizza. They were open till 3 a.m. and it was 2:30 a.m...score! They also delivered...score! So I ordered three larger pepperoni pizzas for our gang and said they would be there in about 45 minutes. No biggie!  The pizzas arrived before we knew it and we quickly devoured them. It's definitely not the best pizza I've ever had but it did the job and soaked up all that alcohol, haha. It was pretty expensive for pizza but I wasn't going to complain about that, we were hungry!  Thanks for dealing with a bunch of drunkies at 2:30 a.m. Joe's NY Pizza...much appreciated!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "3HHLpfU7q4HoREEOXtt7pw"
  },
  "j8f05vag51ZsEQ87l0hzlg": {
    "date": "7/9/2016",
    "text": "Best pizza I've ever had! Their pepperoni pizza and barbecue wings are my favorite. The crust is so good and it's what makes this my favorite pizza place. I would honestly recommend to anyone in Scottsdale wanting a good pizza for a really good price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DAWnj-gwbZXJ0J5p_el3Aw"
  },
  "puAtTHuOvC1LN1Aaz2SOrQ": {
    "date": "2/1/2012",
    "text": "If you are from  NY  and love NY style pizza this is hands down the best place!  I'm from the NYC area and live off of pizza. This place gets five stars  for the quality of their food. It is just a bonus that it is open late night as well. The owner is amazing and takes care of everyone that comes in. I feel like family here!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9G8hAE4lRezNlTghoXuqaQ"
  },
  "Oq8oUydwXmlv9jyPjYTDYQ": {
    "date": "11/25/2015",
    "text": "Don't let these guys fool or intimidate you. They are posers. They are too cheap to purchase the True ingredients that New York pizzerias use. The delivery guy threw a fit because apparently I did not answer the door when he supposedly rang the bell. Never heard it but I did answer the phone the first time they called me and responded to the door immediately. A real New York pizza company? What a joke.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-NeczTpg5hVXUUpDukLCiw"
  },
  "_I2eZwW95HW-Dz142XuV4Q": {
    "date": "12/17/2013",
    "text": "UNRELIABLE. UNPROFESSIONAL.  DO NOT USE FOR DELIVERY. I ordered a large pizza with garlic knots on line for delivery (work function).   The pizza never showed up and when I called, the guy who answered sounded like he just woke up. He said \"Oh, well our fax machine is broke.\"   He asked if i still wanted the order and judging by his manner, I said no and that i would like a refund.  He asked me what website did I place the order on, he has no record of it and he needs to call me back.  Then he hung up on me and I am out 25.00!!!!  Will NEVER give this place another chance.  Our work location is pretty close to Joe's, and they will not be receiving future business from us.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "d9WBDzNkuQnrEXpH0kCRRQ"
  },
  "2SfJ2iHMD5KPennZqIAulA": {
    "date": "11/19/2012",
    "text": "My office ordered three 20\" pizzas, a Stromboli, and cannolis for lunch today. This was our first time ever trying Joe's.  Of the six picky eaters in the office, everyone liked the food. The pizzas are huge with thin, slightly chewy crust, plentiful toppings, and just the right amount of grease. I didn't try the Stromboli personally, but my boss who is born-and-raised New Yorker said it was the best Stromboli she's had in Arizona so that is saying something.  The canolis were very tasty - not too sweet and small enough that you can eat one without feeling terribly guilty.  This is definitely a place we will be getting delivery from again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RRhJUH7p5TKs66ufVXHkzw"
  },
  "otp0jKq_3atTeqc89rsMEA": {
    "date": "5/5/2014",
    "text": "I'm glad there is a place to get a good slice in this particular part of South Scottsdale. Although the delivery took quite some time , I will say it was worth it and the left overs made a great hungover breakfast.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GhX6pIeVsTolrqOvchXsSQ"
  },
  "gESOvAHfeDrEkJjT0VbDkA": {
    "date": "10/1/2014",
    "text": "Great drunchie spot. Better pizza than Gus', but also longer line, typically.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fZP1xM8h3ev2zeVAYHN3cg"
  },
  "iTGMnzB7aSrYL_5-DWNuWg": {
    "date": "11/14/2016",
    "text": "Great sweet red sauce and they came 20 mins early. They had the perfect cheese ratio on the pizza and the mushrooms were the right amount. The food was very well done!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tO2PnqszC3X-Zy0ciCDcDA",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tO2PnqszC3X-Zy0ciCDcDA/o.jpg"
      }
    ],
    "user_id": "04Yay6wY_leHMTxLV7h4WA"
  },
  "TLgXnAOxo48q6y4SwsCgFA": {
    "date": "1/1/2019",
    "text": "We ordered a pizza through door dash that was randomly cancelled. Called and they placed me on hold. I could over-hear employees talking and received no answer. I eventually hung up after 25 minutes and called back to no answer. Will never order from this restaurant again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cSNqNTVMUXp7AG8OTPt3Qg"
  },
  "oMTiyXE68krvazBZwEzAuQ": {
    "date": "12/19/2017",
    "text": "So... where can you buy a slice of pizza at 3:00 a.m.? Only a three or four places in the valley and I have tried them all... Good thin crust crispy NY style pizza... So, I says to my self, \"This is pretty decent pizza for 3:00 a.m. Then I think, \"This is pretty decent pizza any time...\" Give it a shot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J5iD8Bmh2ezQPo5JWbqmjw"
  },
  "B21zqlH_de8SGi9f8v4NKQ": {
    "date": "12/8/2018",
    "text": "An embarrassment to anyone who has had pizza in the northeast. Remove NY from the name and continue to serve the drunks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BpYAeeylQHdlX4JYT0E-8A"
  },
  "pEACRWF9fLhPkCyHWGPIbA": {
    "date": "8/5/2018",
    "text": "If you want a lunch special, don't come on a weeekend. They say there working on something but we will see. It was cheaper to buy 8 slices than a whole pie. Does not make any sense. The pizza is fine if your looking for a quick bite that is near the bars in that area. The part that really got me was the cashier that took my order was not enthustiastic at all. He looked as if he did not want to be there. You want costumers to buy anything at your restraunt, you expect someone to be happy to help you. That is what sells. In my opinion.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ymNzhlA3-UYClMuSLt37xw"
  },
  "n5gOEwETSmQwnR1nAq38RA": {
    "date": "12/7/2018",
    "text": "Not the worst pizza but edible, but the portions are very small for what you pay. Came in for 2 slices and ended up paying 3.50 each which was ok, but slices were small and one was soggy. Came in again 30 mins later and they increased the price to $4 a slice which is really pricy and the guy didn't even tell me they increased the prices and I was just in there and he told me they were $3.50 lol. Paid 15$ for 4 slices...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KF6qk5jHsIAKIZQvQ1qqkw"
  },
  "gEwh3GSzuREF1aJp25oUcw": {
    "date": "7/11/2018",
    "text": "Joe's pizza is sooo good! We ordered delivery through grubhub and the delivery was quick, hot and so yummy. We ordered the cheese calzone, Greek salad, and their special pizza with pepperoni, sausage, mushrooms, and peppers. It was delish! No more Pappa Johns, Streets of New York, or Dominos for us. We just moved to Scottsdale, Joe's will be our go to for pizza delivery from now on. Yay!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ez2RUQWZm3HsK55G21KK5w"
  },
  "UzjBdw760dSzKjNndyoYkQ": {
    "date": "2/16/2019",
    "text": "Within the framework of a slice place in the middle of that zoo entertainment scene it's a 5 but comparing it to any regular place it's a 4. Went to the one in NYC and that is a five any way you slice it. Nice thin crust, no flop, good cheese and sauce. Would go back many times and if I was stumbling around after drinking all night in that area knowing I had that slice to look forward to? What a perfect end to the evening!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IM1YrpUjuHCiUUX8IjC9QA"
  },
  "iprGFcNG19rHXGBlTGd6qA": {
    "date": "2/12/2019",
    "text": "something's changed about this place.  Just got a meatball sandwich and chicken parm dinner delivered. The delivery is always pretty timely,  tho sometimes they mess up the order. This time the food was not what was expected. Four meatballs cut in half, owith too much sauce, gritty cheese on some kind of flatbread roll ( not a traditional sub roll). It was definitely not what was pictured on the menu. The price was 11.99. no fries, no pickle (as shown).  Basically a rip off (Subway would have been better for the price)   The chick parm was way overcooked. Generous portion, but not very good. I think we are done with Joe's.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wD_UtAAADO-1lIc9V8ozLw"
  },
  "jYZbKBABBOKYajZrdzzdDw": {
    "date": "8/12/2018",
    "text": "This was a huge disappointment and waste of money. First the buffalo wings were dry, no sauce. The salad had stale croutons. The pizza crust tasted like a lunchable, the cheese was downright awful, and im not sure there was any sauce. Worst pizza ever and doesnt resemble anything out of new york.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cY_v3iv2OZgDNbFIU5bREw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Not good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cY_v3iv2OZgDNbFIU5bREw/o.jpg"
      },
      {
        "img_id": "HMmILREqY5HUyALPSTuDaA",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Plain wings, where is the sauce?",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HMmILREqY5HUyALPSTuDaA/o.jpg"
      }
    ],
    "user_id": "86_g-bOF3IGIo4ML2b5DIg"
  },
  "8qX1LIKQ7kLrcVz2LXc2pQ": {
    "date": "6/19/2018",
    "text": "I was impressed. The good was tasty. Ordered a pizza, wings and fries to go. The food stayed hot when I got home. French fries and wings stayed crispy and not soggy like most places when you take it to go. Can't wait to go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBRkJp59aKz5kiypt2WjFg"
  },
  "dYihHTRSv96BlcoMZP9nGw": {
    "date": "8/1/2018",
    "text": "We ordered the 18\" special from the speciality's to go. It was one hell of an xtra delicish pizza. 3 people (including our son which is kinda grasshopper) were fed. Thnx Joe's New York pizza @ Scottsdale, AZ",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J5O9vG8wK8KEW1dRBRlmeQ"
  },
  "m0UpF47kkG_jDaMkc32U7Q": {
    "date": "7/30/2018",
    "text": "I paid 32 for a 14 inch pepperoni pizza and 12 wings!! First off the pizza was cut POORLY the cheese was all over the place!! How do you ruin a pizza that bad??? Than the wings seemed like they had no hot sauce on them they tasted plain and were soggy!!! Last but definitely not least I paid so much money and even tipped them And they still ruined my order!!! And I even ordered for Pick up smh I will never go here again! I understand it's near down town Scottsdale so Alot of drunk People go there and they maybe happy but I'm extremely disappointed and will never return! I've been there a few years ago and it was bomb but not this time! DONT WASTE YOUR MONEY.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VlrEJ_7uzO0gJJoZaFWF-w"
  },
  "y8xP4v4Y7nu21yz_x6x5YQ": {
    "date": "5/28/2018",
    "text": "Not even close to NY pizza. Sorry guys. Also it's way too expensive. Good luck with the business. I won't be back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zGIMoedamiu-YxWdVzYeEw"
  },
  "uPM-LYGC1n3jvbaQGqb19Q": {
    "date": "3/31/2015",
    "text": "Time for an update and a bump in star rating too...  It was my daughter's second birthday and we celebrated our house on a Sunday evening.  I put out appetizers and made a couple of salads, but how can you host approximately 20 people and not serve pizza for a kid's birthday party?!    I used the Eat 24 App and ordered that afternoon.  I love the feature that you can select a later delivery time.  I selected 5pm and ordered the following: -Vegetable Pizza + eggplant (highly recommend adding that eggplant; it was awesome!) -Meat Pizza -Plain Thin Crust 20\" Pizza -40 Wings - (Buffalo style with ranch)  I was able to add tip to my order when I placed it so I didn't have to worry about tipping the delivery guy.  Everything arrived on time and hot... and was demolished by my guests.  I had a slice and more than a few wings as well, and it was worth the calorie splurge for sure!  So, bottom line is that Joe's is great for lunch, for delivery, and for late night bites as well.  I'll definitely be back soon!",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 14,
      "cool": 9
    },
    "photos": [],
    "user_id": "dIIKEfOgo0KqUfGQvGikPg"
  },
  "boBnpoSC4MuBOipmMx4LNw": {
    "date": "7/7/2017",
    "text": "BOYCOTT JOES DISGRACEFUL BEHAVIOR.  I've been a loyal Joe's customer for years and recommended them on taste alone but their service is horrible.  The pizza is a very thin crust thin cheese ny style. I recommend going to Gus Pizza across from them because their service is much better.  I ordered pick up via yelp eat24 and when I came in after my order status was done it was full 1 topping and not half and half like I ordered. I pointed this out and the cashier \"Isarel\" (older tan) said it was my order. I had to read the order (2nd half pep) to him 3x to get him to believe me. Also didn't believe me I had 2 side sauces and it's also on the order... They took a cheese and added pepperoni to it... Guess someone else's order will be late. I told them not to rush it and undercook it and it's undercooked yep hope I don't get food poisoning.  I then said can I get anything for having to wait? He said no and Joe the owner, would also say no and refused to give me his public owners contact info to ask. Joe came in as I was waiting btw and he didn't say anything. Told me to come back tomorrow 9 to 2 to talk to Joe. I asked again can I get a water bottle, a drink, garlic knots or a coupon for next time! I was settling for coupons that he HAD IN A DRAW fam! He had them! Refused to give me anything for their error.  Joe is there 9a to 2p allegedly if any of you want to talk to him.  I'm shocked and appalled this inconsiderate behavior has not shut them down with the BBB. This is not the first time Joes messed up my order, overcharged me, tried to double charge me or was downright rude. If you believe in the moral good don't go to Joes and maybe they'll get the message to CARE ABOUT PEOPLE WHO GIVE THEM MONEY.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "xTHoZ5p6P0SGr3Hh7PXQ_Q"
  },
  "HPpsaq5Hij-qxLa5UTRr2g": {
    "date": "10/31/2018",
    "text": "The owner of this place is so rude, I literally couldn't believe it. And I was behind him in line and the Costco business center where his cart was filled with PREMADE FROZEN pizza crusts. To make matters worse, he was being rude to the workers at Costco because they were out of frozen pizza crust and he needed it to sell his fake nasty pizza at his restaurant. His pizza isn't even authentic! No thanks. Bad pizza, even worse customer service, I'll never go back",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zCBNYx99Ap0gkbNzhjWaew"
  },
  "4XfPAiBFSjUVxzSev32OpA": {
    "date": "7/15/2018",
    "text": "So BAD! We ordered through UberEats. BARF!! Pizza was cold, which we could have dealt with but the flavor was awful. Garlic bread was warm-ish but nasty! Half was soft + half was crunchy like a crouton, not to mention zero flavor. Not sure where all of the positive reviews are coming from... only thing I can figure is I'm sober and all other reviewers are wasted! I'm all for wasted, enjoyable pizza, but this was terrible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MeG-sbz6bz3JEv9wkKWQGA"
  },
  "ThZ2qrp80F4AMd8azT4r9A": {
    "date": "7/11/2018",
    "text": "The best pizza in Scottsdale! Service was excellent and food was amazing. The wings were cooked just to perfection. Definitely will be coming here more often, would highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4VyRwCmG4eK1AzZ0TWUQiQ"
  },
  "GRXAKHDOhPACYFkp4NKasQ": {
    "date": "7/4/2018",
    "text": "Great pizza and reasonably priced usually. It lost a star because they illegally price gouge on Friday and Saturday nights. If you walk in and order a pizza they will charge you for 8 slices and not a large pie. Another star because their website works is extremely buggy. It doesn't put your order through a lot and also the drivers option says I'm outside their 5 mile radius when I'm only a mile away.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fvOBEOoPXnUvw8ft87c3Eg"
  },
  "Ppj8eykHOj3MOPOs89didA": {
    "date": "7/2/2013",
    "text": "this place is creepy.  there was a cop standing around patrolling all the pizza eaters last Saturday.  what kind of restaurant has police officers parading around to intimidate its patrons?  Hire private security like every other establishment.  Seriously a cop at 2 in the morning at a pizza place on a Saturday.  No thanks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvvMbgftjssGaHJkFqEjDQ"
  },
  "d8YRuZtPl7HQ33LxUgUKVA": {
    "date": "9/22/2008",
    "text": "I think the rule to actually like this pizza and actually want to eat it is to be drunk.  I was drunk and I loved the white pizza with spinach.  My friend had the cheese pizza...she didn't like it.  She was sober.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7SFUWbb33dOR8lmO51h3dg"
  },
  "NzACmNZ2V1lWA-gZobyYSg": {
    "date": "3/18/2012",
    "text": "Oh my! This pizza is addictive. I absolutely love it. There is no pizza in Scottsdale other than Streets of New York that compares. I've got my son hooked on it too. He always asks to make a special trip over to get a few slices.  The eating area is serviceable and fairly clean, with a good view out of the window. Sports usually on TV, which fits. The place is filled with NYC memorabilia from various teams. The woman who runs it seems like a typical no-nonsense New Yorker, so if that's not your style, fa-get-bout-it! Go somewhere else. The pizza is incredible and it is consistent in its recipe. Very important! And yes, they do stay open late. Some have complained about the different prices from regular hours compared to midnight and beyond. To me, it makes sense. If people want to eat pizza at 2:30 am, be prepared to pay a lot more for it. Its the big-city way. Someones gotta pay for the employees to hang around all night. In short, get yourself over to Joe's Pizza. Try it plain or Hawaiian style. This is REAL New York Style pizza all the way.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4jGOuYyOtWBMd8aQS-5jAw"
  },
  "ilDdzuEvCrS0oo3Qm6x04Q": {
    "date": "7/11/2011",
    "text": "Best pizza in town. Hands down. Thin crust and not greasy. Their cheese steak sandwich is also great.  I ordered 15 extra large cheese pizza's double cut from them for my daughters birthday last year and everything went smoothly.  Everyone loved it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XSzGEZUO86dOT_HIq-9mnA"
  },
  "8QBbfbMdWATkc9Wtp0i4hg": {
    "date": "3/9/2013",
    "text": "HORRIBLE! I placed an order online last night, it said it would arrive at 1:25. I called them at 1:40 and they said it was on its way. I called again at 2:15 and they hung up on me, then stopped answering my calls entirely. When I called from a different number, the man who answered the phone sounded drunk and could not give me any definite answer about the status of my order, after wasting my time he said he couldn't find the order and then hung up on me. After calling AGAIN at 2:40 they said that the order has JUST printed. I asked if they would comp it for me and they said no but said they could give me some free food, so I asked for a free pizza. When the order finally arrived over 2 hours after I ordered it the driver didn't even ask for a signature, and I got no receipt. The \"free pizza\" was 3 nasty slices they just threw into a box. I was so unsatisfied, I would have cancelled my order from the beginning but since I placed it online it had already ran my card and they refused remove the charge. I will NEVER give this place my business again! I understand deliveries take longer but the amount of time I had to wait was insane, especially since they could not clarify the problem. DO NOT ORDER FROM HERE THEY SUCK!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "OfRQkmzinfNoq-6h9XpYXA"
  },
  "Ph5XlcmT2kvm1yKhr8sPQg": {
    "date": "3/1/2009",
    "text": "Good late night spot for some pizza after hitting up the clubs in Old Town. We came here after going out this weekend for some good old fashion late night food. There was a constant flow of people coming and leaving. They have a good selection of pizzas ready to heat up and serve to you. I dont know if this is a place Id go to on the regular but its definitely the late night joint.  Also, I thought it was kind of interesting because there was a cop standing inside the restaurant keeping an eye on things. I assume things can get rowdy in a place like this considering that everyone there after the bars is pretty sauced. I guess it's the norm but not something Im used to seeing.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JOr0dVjhNINbpiks6YZE_A"
  },
  "50NfeDVz3tSawSadiceh-g": {
    "date": "10/10/2014",
    "text": "Forever looking for the New York pizza from my childhood only never to find it UNTIL I had Joe's pizza! Perfect chewey crust. And, the meatballs OMG! If you love garlic, gotta try to knots but warning - they are for True garlic lovers. YUM!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9fm-31XwVBT3661q0MDPvw"
  },
  "93XpAJaO14Jpk-s2co6_uA": {
    "date": "10/7/2014",
    "text": "Best ever!  Not only do they serve the best authentic New York style pizza but their spaghetti and meatballs and eggplant parmigiana are just like my Italian grandmother used to make.  Worth the wait if there is one!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ayCLCmPYqBVMBoJj2tdCEQ"
  },
  "xpZXS2kznj64WF9VteuL6w": {
    "date": "1/19/2012",
    "text": "The pizza here is good after a drunken night out in old town. It's just a bit greasy.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PVlH_t4RI8p7ncFUzokapg"
  },
  "_AoKNQ4ire_zgVZzA9zerw": {
    "date": "1/10/2012",
    "text": "I've been looking for a place with pizza like this for a while now. I can't stop thinking about it! Unfortunately they are way out of the way for me but it's definitely worth the trip. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hgv2w87Aka5m0YDX5GVDRg"
  },
  "25twohvCwy_atLicuFiWJg": {
    "date": "8/24/2014",
    "text": "Joes never fails when you are getting off work late at night and need a slice! And they always give a discount if you work at one of the clubs nearby.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DhM3SppqXRVjTcE6lTTF5A"
  },
  "eaUscwG45jtJ5iUPfrUgLg": {
    "date": "7/22/2013",
    "text": "Fugeddaboudit!!!!  This is the best slice of New York Pizza you can find outside of New York.  It's small and off the beaten path but the GREAT Pizza keeps me going back.  They have a lot of things to order other than pizza but I've only tried the pizza.  Once I find something I like, I stick with it.  Give it a try you'll be glad you did :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eS5JX75O7kVU5aanH61GBw"
  },
  "6bYB34-yEhzcYQ5FVDJBig": {
    "date": "8/7/2011",
    "text": "Love this place for lunch. The cheese pizza is a bit greasy but can be dabbed with some napkins. The website has a buy 2 slices get 1 free slice so for 6 bucks, you get a huge amount of pizza which it good for putting me into a pizza coma once I get back to work.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LUNBcaX9mTCjCE14VFSOCw"
  },
  "8bgDkBsgUj5R-0GLPtb1iQ": {
    "date": "10/8/2011",
    "text": "Joe's New York Pizza is great. The menu is really good and authentic. It is great if you go clubbing in scottsdale and then get hungry! The pizza and pasta dishes are my favorite!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bcmcnSWyDY5FephDIdZa5w"
  },
  "8jrFZwPGZAziutSE4BfBQA": {
    "date": "9/7/2012",
    "text": "Joes New York Pizza was great the last time we ordered. The pizza was hot and fresh and tasted incredible. We had hoped that this time would be similar. Unfortunately, we called up for delivery and were told that it would be 45 minutes for a Grandma Pizza, garlic bread and a Caesar salad. The food was delivered after 1 hour and 45 minutes. We called them multiple times and were told that it would be \"just a few minutes\". Finally on the third call we asked for a refund and were told that they couldn't do refunds unless the manager was there. Apparently the ONLY manager was on vacation for a week. I have NEVER heard of any restaurant with only one person who has the ability to provide refunds. They did issue a credit for a free pizza. We were also told that even if they did do a refund it would be for the pizza only. Apparently they don't do complete refunds, which makes 0 sense. When the pizza did arrive, it was cold and the box was smashed. The garlic bread was bland and cold. The Caesar salad was soggy, and you could tell they had packaged it 45 minutes ago. This place has promise, but I will only give them one more shot before I write them off. I hope that their management reads this, and changes are enacted.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "V2OZWJ97BCWkqM48VVz-hA"
  },
  "Xb9DlSBghO68QlpfOem2Wg": {
    "date": "1/1/2014",
    "text": "Joe's has excellent food. Previously being from New York I am always looking for good NY pizza and calzones. Their pizza, meatballs, and calzones are great! We have eaten their many times and even had delivery a few times. They are open really late so a 2am pizza can actually happen. It would be great if there was more parking. All in all, great food and we will definitely visit again and again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YnFBjpODgYD6Nrsji524jA"
  },
  "DyNdiX7pf4AOXX4auQLkeg": {
    "date": "3/27/2013",
    "text": "That was a complete waste of money.. The cheese steak was cut up roast beef lunch meat.. I ate one bite and wanted to vomit.. The fries were coated in oil with no flavor.. My boyfriend got an eggplant sandwich and ate 4 bites and threw it away.. Dont waste you money and dont wonder if you will be sick.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sEceBBqno_lPPGaUvfc9kg"
  },
  "9GzmPW1GAQpinPEa5GycRg": {
    "date": "11/1/2013",
    "text": "Great New York style pizzas...they have chicken and sausage rolls too... Rarely see that around here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QfJXkZpYFEy7UV_-95N_BQ"
  },
  "7AqQUU3BtCxbHRtd0eD2-A": {
    "date": "10/13/2011",
    "text": "Maybe the Best Pizza in the Scottsdale as of 2011.   My five star rating is based on multiple awesome pizza purchases.  The pizza is so good  ive never had anything else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1xpgBodZfRN-3eT1Rbnycg"
  },
  "IqbboZDQupBI2rrQ9fqjvQ": {
    "date": "9/11/2011",
    "text": "Expensive for some lousy NY-style pizza. Cost $35 for 2 larges! The pizza itself was greasy and fairly untasty. Better off with Barro's or hungry howie's.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TwSBnE1qnMGZKgq1vOOcJA"
  },
  "ZedYQ2u4qPsnxjMcd1tqzQ": {
    "date": "2/21/2018",
    "text": "Pretty good slices open super late. This is my go to pizza spot if I get the munchies at like 2 o'clock in the morning. The staff here is cool. Sometimes if you go there very late there's a bunch of drunks hanging around but they are just funny to watch. Been there done that, for now I'll just watch lol. I always get the pepperoni with the mushroom solid slice",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XVlcneLwzEvKoFU3-ahbGw"
  },
  "QXa7l5jka4UVhNQx9FzIqw": {
    "date": "9/3/2016",
    "text": "Went to Joe's Pizza the other evening and I have to say that I LOVE their sicilian pizza. Mmmmmm. The guy at the counter, Aaron, was smiling and helpful even though the place was extremely busy and crawling with embarrasingly intoxicated adults. I couldn't imagine dealing with that every night. . He managed to get me my food, help the line and keep a positive attitude. That's rare these days so I was definitely satisfied.   I will be back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "seOERGzIfXL_Tjy4yzk9YA"
  },
  "fwnPnYwSwS61uPAgyhhNFw": {
    "date": "6/12/2017",
    "text": "Joe's Pizza is always good when I come thru, which is about once every 2 -3 months but hey, It's pizza how can you not like it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9mZ9ACKd6ujaSoT54WKr1w"
  },
  "nykatWAJcpwrEyDbZEL_Kg": {
    "date": "2/28/2017",
    "text": "This is my favorite place for pizza slices. I am also a big fan of their Italian combo as well as their tuna fish sandwich. Pretty much everything on the menu has been outstanding. And the ranch is to die for. Oh and don't let me forget to mention about the cheesecake. One of the best cheesecake that I've ever had. The staff is friendly and at night they try to get you in and out and be as friendly as possible but sometimes things get a little crazy but hey they are feeding the drunk people. Who can ask for anything better fresh ingredients friendly service and free entertainment. Thank you Joeskeep up the good work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QOSct1zLeYv23b77_BMs8Q"
  },
  "uRLIkhhntF-PtULu2s3naA": {
    "date": "9/3/2016",
    "text": "Poor management and terrible staff. I paid and tipped them for nothing. They lost my order, and the guy with piercings got mad at me for it. I asked for a refund and they never gave me the full refund because they lost the receipt. This place is made for drunk people only.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "JHa6QhwsnQ3tBfoHwz9pJg"
  },
  "Ksg6fMYZIxknToQd50FMZw": {
    "date": "1/31/2018",
    "text": "Nothing really special with this pizza.  Ingredients were sparse each something as inexpensive as green peppers.  The cabresa salad was drenched in balsamic oil with less than ripe tomatoes.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-z7OrSW7-GPvs-8wCkpImA"
  },
  "oILp8bVYni2tIZTalis-SQ": {
    "date": "5/5/2016",
    "text": "Love Joe's! Always a great place to eat after a night in old town. And their pizza is great in my opinion. Very big pieces with lots of grease NY style.   Also have an excellenttttt Philly cheese steak. Seriously, it's won awards. Mac n cheese is also a pretty good item.   Only reason I have taken down 1 star is because they switched to some call center in Estonia or something. They never understand my order easily & I have to repeat it to make sure they got it right.   Tip: if the line is too long, call over the phone & order to go. Then walk in 5 minutes later & skip the whole line. (Assuming they get your order right)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cHCaqm7TuyQfG1tpSemRjA"
  },
  "VBpWfs8EltJ0hzQKyPl_Eg": {
    "date": "2/6/2018",
    "text": "Called Joe's (at 10:45am) and ordered a pizza slice, calzone and some soda for a worker and I. The manager told me that it would be 30 minutes (when looking on the map Joe's was a 6 minute walk from where we were working except we couldn't leave to go sit down there). At 11:49am we get a call from the driver asking where we were. Upon talking to him further we figured out his location (which was not close) and he said he would be there in 10 minutes. At 12:21pm I finally called Joe's and cancelled my order. As I hang up the delivery driver shows up and gives us the food. I told him I wasn't paying for it and he said he was sorry. We threw the food away and continued working. At 2:05pm we finished working and I called Joe's to make sure I was not getting charged and was informed that the Owner said since I accepted the food he was not refunding my money. This is a disgusting statement made by an owner and he/she should be ashamed of this type of practice. I suggest if you are looking for pizza to go somewhere where your business is actually appreciated. Clearly my business wasn't. If I could give zero stars I would.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4vtvIGvyeQLRh0OsaPyncg"
  },
  "mSz9up0Eq_cLnxAJcJORWg": {
    "date": "9/17/2015",
    "text": "Guys ... its NY style pizza .. If you gotta problem ... Git outta heeeeere! Its bread sauce cheese and toppings, new york style .. meaning just shut up and eat it and quit complaining! Joe's is a classic NY style pizza spot.   Stop by for a slice, grab a drink, quit bitching and Fuggedddhaboutit!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "J_YUW5WkPmf8UCnQyoSjkA"
  },
  "x8HUSmkz0hJcMm644aFa5w": {
    "date": "11/23/2016",
    "text": "I've been ordering every Friday for the last five years consistently. Looks like the original owners sold the place. Unfortunately the service has drastically changed as well as the menu. Now your phone order is taken to some answering service who has no clue what the heck is going on. Got our order wrong twice and the taste has certainly changed. The new owners are no New Yorkers my friend. They are clueless and clearly have not kept up the original flavor. I still love the delivery people as they are friendly but you can see they are also frustrated with new owners, i can see why. What do you think? Don't be scared, give an honest review. Some of the ones I read seem fabricated.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dYFuJTou16gTJIDl_I64AQ"
  },
  "j7yQu_E0E3HzDWIC_Mc-iQ": {
    "date": "6/15/2013",
    "text": "I really hesitate to say anything about pizza. I love pizza.   But I officially hate Joes. Last time I ordered here with my debit card, the next day my debit card number was stolen and used to buy prepaid phone cards.   I should have learned my lesson, but last week I was just craving pizza.   Now, I was checking my credit card statement, and I noticed that last week, they double charged my card once for the price of the pizza and again for the price plus what I tipped.   Unless you have cash, don't order unless you're ready for some shady stuff to occur.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "4gPnK4Q74fqPQ7p2eIt2wg"
  },
  "APZUYxrXLA7D8OiEypTXKg": {
    "date": "9/27/2015",
    "text": "Yikes! The worst pizza ever eaten.  This place used to be good, a few changes in ownership and this place is now horrible.  Pizza was not adequately cooked.  The toppings all slipped from the crust when picking up a piece.  They also gave free garlic rolls with the order. They were also undercooked & inedible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HT8fywuIwxjT3fcWpYGrtw"
  },
  "6aD70gZRxszWLmxzJ_nf2w": {
    "date": "9/8/2016",
    "text": "Pizza slices are $3.50 each which seems kind of steep to me. Pizza was OK. There's different options to chose from in the display case. I liked the fact they had big shakers of parmesan, oregano and chili flakes. Service was quick. I don't understand the whole tip jar thing though. I'm being served a slice of pizza from the display case to the register that I just paid $3.50 for not including tax.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qEX4Rz0nzYFlxK3cAvI7tQ"
  },
  "HIlQFT9MLxRS8xhLG-bH4Q": {
    "date": "3/11/2016",
    "text": "Took home the most delicious white pizza since living here in AZ. (Mozzarella & ricotta) Could have used a bit of chopped spinach in the ricotta but I'm used to the Bx pizzerias. Still pretty good for AZ. Had the same NYC feel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "14I6wyPnUOpeHhHv3ILwSg",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/14I6wyPnUOpeHhHv3ILwSg/o.jpg"
      }
    ],
    "user_id": "BfjSsx5oqWsiIMHjoUySNQ"
  },
  "sc8VylMjXZEbFr2Q91KPcg": {
    "date": "11/3/2013",
    "text": "I am only giving this place 3 stars because they deliver until 4am.  I recently visited Arizona from Hawaii for a work conference.   My flight from Hawaii got in at midnight, which got me to my hotel at around 2am, I was pretty hungry and with the time difference couldn't sleep, so I wanted food and couldn't find anything open.  The hotel recommended this place, so I called them. Sure enough, they were open. My cell phone had AWFUL reception, so I ended up ordering a whole pizza and some wings instead of a slice of pizza...but they DO take orders of pizza by the slice.  The food was delivered in a reasonable amount of time, and the pizza was meh. Oily, crust wasn't very good, I mean..really just a meh pizza.  The wings were pretty decent though, especially for a pizza place, so I was happy. I ended up throwing out most of the pizza as it was MASSIVE and wouldn't fit in the hotel fridge.  So pizza:  Quantity over quality. You will get a BIG pizza for a good price  On my last night there, I wanted food again, so I ordered some wings and this time gotten a chicken parm hero.   Delivery took a long time and they forgot my sandwich. They then came back with my sandwich and it was again, meh. Way under seasoned, and just not that good. Again, it was big, so quantity over quality.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "_LF2eG3ZHQeKH8KKmguRHA"
  },
  "u3FLqWU6gmkV_cuDFl2Bag": {
    "date": "8/15/2015",
    "text": "Just FYI to the employees, not everyone that comes here is drunk. I asked for 2 slices of pizza to go, which is extra. Got charged to go, but the pizza was put on dine in plates. Paid for ranch, but got none. When I told the guy that I paid for the pizza to be to go and for ranch, he just handed me the plate, said sorry, and that e water was free..thanks for my free tap water, however even their machine was broken so I couldn't even get my free tap water.   I'd go to Gus's pizza next door..they don't try to overcharge you for $2!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YwknePDCAeKC_3beXHPBeQ"
  },
  "EQjryb49HF39msEuTnZWGw": {
    "date": "4/12/2017",
    "text": "Dont order on the weekends and expect it to be flawless. I ordered at 12:00am, called at 2am to see where it is. I got put on hold and they left the line open so you could hear the mayhem that is their dining area. Woman shouting about where the hell her wings are and other customers asking for help and service with no response. I was left like that for 10 minutes. I put it on speaker at the party i was hosting so everyone there could laugh at the ridiculousness that was happening on the other end. Outrageous from a professional stand point and need strong leadership on the weekends to keep it a solid business",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KrGbGShQn8X7_mbIUBcZRw"
  },
  "2g3dmEigAF7T-RkT4-_aoQ": {
    "date": "9/4/2017",
    "text": "THESE PEOPLE ARE FREAKING RUDE ORDERED waited for 2 whole hours never received my order the guy on the phone is a dick DO NOT ORDER FROM HERE you will wait forever they answer and keep telling you the order is on it way and never show up deliver guy lies and says he came to your door ITS A WASTE TO ORDER TRY A BETTER PLACE",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HyR05TLcsB_I-_JUHoc5ow"
  },
  "zJifVul7uLidXAN4SSFqUA": {
    "date": "1/29/2017",
    "text": "The pizza is really good, but not the best. Definitely worth a try. Pass on the garlic knots, they're pretty bland and covered in raw chunks of garlic...unless you love oil and raw garlic, then go for it! The staff is really nice. The \"supreme\" style pizza is better than the pepperoni!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KOeLKOprnV3fEgIFdlPREA"
  },
  "gA-qNYSU4B7SO3zwTRGDQg": {
    "date": "12/27/2015",
    "text": "My family and I are in town for a golf tournament, and ordered delivery from Joe's. The person who answered the phone was not very knowledgeable about the menu and I am not sure if English was her first language. We had our food delivered and the order was all wrong except for the cheese steak which wasn't have bad. boneless wings no ranch or blue cheese, ordered meatball calzone or meat calzone and we got cheese calzone with cold marinara.    too bad Crust doesn't deliver.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oAQTi135dbKxKbnixnhsZw"
  },
  "887NRF07EqlgnKgsG81QGg": {
    "date": "6/27/2019",
    "text": "Very good pizza and the most excellent delivery guy!!!! Very friendly and definitely would order from them again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vugFipytB-L-H3H4MhQ4VA"
  },
  "03KomoV7SJMeOmsZATShoQ": {
    "date": "1/28/2018",
    "text": "Sorry but worst pizza ever I was starving and couldn't eat this pizza  Never again $25 bucks for the Sicilian pizza not worth it just go to little cesar's  Dough was bad everything else no flavor at all. Wish I can refund my pizza",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IMdKLsw2Cd17eccvH5bITg",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IMdKLsw2Cd17eccvH5bITg/o.jpg"
      },
      {
        "img_id": "ccB084DqZjjOXi4T1ZgPQg",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Couldn&amp;#39;t finish it worst pizza ever  No flavor",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ccB084DqZjjOXi4T1ZgPQg/o.jpg"
      }
    ],
    "user_id": "wPBS77GFGyFDLNg4xyIhhg"
  },
  "QLo_Mk2jAFsw9FOTqX5-yg": {
    "date": "11/19/2017",
    "text": "I've had a \"combo\" pizza after a couple of drinks but I'd like to say that it's pretty darn good. It's NY style pizza and better than across the street. One of the options was an everything vegetarian pizza and I asked if they can throw some pepperoni slices on it which they agreed to. It cost about $4 which is reasonable and with the taste... close enough to the north east slice ;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DJ8G-IzmeX_euX6Vp02DQg"
  },
  "lG-Zq55jNC5Gj9tbUPkoMg": {
    "date": "12/8/2018",
    "text": "Wanted NY pizza and my wife found this place on Yelp, so we decided to give them a try.   Ordered several different slices: veggie, pepperoni & mushrooms, and a deep dish sausage & pepperoni. We really enjoyed the thin crust pizza, just like what you get from NY.  I had to get a couple more slices of pepperoni & mushroom it was that good.  Don't know if this an Arizona thing but they offered ranch dressing to go with my pizza, I told them that was sacrilegious. Apparently they go through three large plastic tubs of individually portioned ranch dressing a night.  Really good customer service. Lots of pizza available so you don't have to wait to long. Great thing is they are open till 4 AM.   When in the area go and visit. This will definitely be a stop if we are ever in Scottsdale again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ms-IiyChTcVy3DTdR-MBjA"
  },
  "YJX7ACA55ypYyQz6SUtwiw": {
    "date": "11/5/2018",
    "text": "I love this place.  Good food, great prices and friendly staff members.  Went to Joe's last week due to an issue I had with Sprouts.  A couple of my team members had preordered lunch from Sprouts for our monthly team meeting, we received confirmation two days ahead of time.  Went to Sprouts and they had lost our order, not sure how, but they did.  We were in bind because Sprouts could not accommodate us, so we rushed to Joe's.  We explained what happened to Kevin (Joe's associate) and he was able to assist us and gave us a discount on our order.  He was able to make things happen in a short amount of time and he was able to save the day.  Great Customer Service Kevin!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FNEF_wsttvx-iefi7qYZHQ"
  },
  "fiOy8Jsb4LSsVNcLsxqoeQ": {
    "date": "5/16/2018",
    "text": "Well time has not made the chicken parmesan sandwich any better...in fact it reached its lowest point last night. It appeared as if a cook poured a shaker of salt into the sandwich and used some old cutlets to RIP me off of 10 bucks. Hey at least I got a free bag of chips right? If you must eat here you should be drunk and eat only 1 slice of pizza. Also the cooks are lazy because they never make sicilian pizza  assuming nobody eats this kind of pizza until after 8pm. Very odd behavior and a very disgusting chicken parmesan.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CznQMPHa4xGFD9o2MEQpBQ",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Boooo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CznQMPHa4xGFD9o2MEQpBQ/o.jpg"
      },
      {
        "img_id": "TqlA7XhkcGewppklZcbkBg",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. 2018 pepperoni slices",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TqlA7XhkcGewppklZcbkBg/o.jpg"
      }
    ],
    "user_id": "ELcQDlf69kb-ihJfxZyL0A"
  },
  "6mxhAELCQitKt2WoKysFwA": {
    "date": "8/24/2017",
    "text": "If you're in Old Town Scottsdale I highly suggest Joe's. It is perfect for a lunch run with their lunch special or an amazing late night snack.   I worked at an office building across the street and ate here quite a bit (more than I probably should have). Most of the times it was for their lunch special which is buy two slices and get a third free, I believe its normally around $6 which is a good deal especially in Old Town.   In terms of their actual pizza, I am a big fan of the bbq chicken.. I would dare to say that it's one of the best bbq pizzas out there! Of course, they have great selection and all but one of the pizzas are sure to amaze (sorry, but I'm not a fan of the buffalo).  None the less, Joe's is simply amazing and Joe is a pretty good guy himself (he's in everyday at lunch). In fact when I told him it was my last time at Joe's due to a move he thanked me for \"being part of the family\" and gave me pizza on the house (told you I went there a lot lol)!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8P5_VOIh6YtVK5rU6w6Eaw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8P5_VOIh6YtVK5rU6w6Eaw/o.jpg"
      }
    ],
    "user_id": "mFL__p62jDVqQWsbdAiRwQ"
  },
  "u5bIDEK5PYLmmIx4TXet2A": {
    "date": "10/13/2018",
    "text": "I am a big pizza lover and usually not picky when it comes to eating pizza. However, this pizza was by far the worst pizza I have ever eaten. I would highly NOT recommend it for you pizza lovers out there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7MGQOOaH36n8mqnf_Buf5Q"
  },
  "Ok2a705lRRXPx_I0f8_5kQ": {
    "date": "2/13/2018",
    "text": "Solid freakin slice of 'za to be had here!  Could do better on the beverage front, but they do what they do well enough to get away with it.  Open late for the drunks.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lh4oJuoNAoTy94HISypLjQ"
  },
  "-Lp1P4hE-gPMJSMf8cbUTQ": {
    "date": "11/11/2018",
    "text": "Been coming here/ordering delivery for well over a year. In the beginning, the pizza was SOLID. Drunk OR sober, it was phenomenal. As the months have gone by, quality declined to the point where I had a pizza delivered and something tasted.. off. Ended up throwing most of it away. I don't know if the ingredients were past their 'best by' date, but it was not good. Giving this place a break in favor of other pie palaces. Will return in the future to see if the pizza has improved. Until then, farewell Joe's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qo4xJYZ8NyEqBEmIlxVMuA"
  },
  "vc1QolFKMpVzuhA-oA3PqQ": {
    "date": "1/3/2018",
    "text": "Best late night pizza in old town. You can get by the slice or by the pie. Slices are HUGE. Best ranch dressing I've ever tried. What more to say? Go to Joe's!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "tPZMwjHZNAx_HuRzTpMXmA"
  },
  "8fZ-fXAORtIaP2-LVv7n_Q": {
    "date": "1/30/2018",
    "text": "Very particular about my pizza. Today was my first visit. The people are friendly, and down to earth. The restaurant was clean and comfortable. Most importantly the food was excellent. My wife got the meatball sub. She lived it. I got a couple of slices of pizza and some wings. The wings are meaty, and cooked perfectly. We will be back!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LXCqajY8PkssIRUGYT3zEw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LXCqajY8PkssIRUGYT3zEw/o.jpg"
      },
      {
        "img_id": "veqK4uvM5-jShtLIkSv-Rw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/veqK4uvM5-jShtLIkSv-Rw/o.jpg"
      }
    ],
    "user_id": "gmqfOtmTa9tcn1W5C-gB0Q"
  },
  "JFXTfH-ISvl_SYA7vOfy-A": {
    "date": "9/11/2018",
    "text": "This is not even close to NY pizza, far far stretch! Ordered a $25 veg pizza that was worth about $5...maybe. Definitely frozen pre-made dough, with zero flavor or pizazz. Toppings were quite sparse, and sauce was average.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WQYznWZrVpHaXn8RGSOlyg"
  },
  "ODnBa53A4L_H2pB8L3fk9A": {
    "date": "10/2/2018",
    "text": "This is our 3rd trip from Seattle to Scottsdale to see the Seahawks play in AZ.  Im so happy to have now found Joe's pizza, there are so many things we look forward to on this annual trip... I can now add to the top part of the list Joes pizza.  Fantastic pizza by the slice, delivery available and open late.  I can not imagine a trip to Scottsdale without at least one stop to Joes for pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xI9hD_z_O-pyGBvVafz72Q"
  },
  "6s-Odq0BoEAQIxzYhuRY1A": {
    "date": "1/22/2019",
    "text": "So Joe's is gooooood pizza. It's NY pizza so it's thin and greasy, but it's so good. The problem is their customer service and phones. I've wanted to order from here on several different occasions, only for the phone to ring and ring and ring with nobody to answer. On top of that, when you go into their shop, I've never really gotten even a halfway enthusiastic employee at the front. Bottom line, food is delish, people suck!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TKyuzxquVxpGXOy41s1g0w"
  },
  "e7G8l1CUJcB-q94ZccUZHA": {
    "date": "8/25/2018",
    "text": "Disgraces New York Pizza:Two stars equates to the quality of service/food you receive from this place. I ordered an 18\" Pepperoni Pizza at 1am. Order took 1 hour and 15 minutes to arrive. Pizza had no toppings and cheese only and was cold. I called back immediately after and the manager on duty  cops the attitude of \"What do you want me to do about it? \" I requested that he send me what I initially ordered and we will call it even. I offered to send him pictures. He said I could keep the Pizza and if I wanted to wait another 45 min for the replacement Pizza to arrive. No one ever showed or called. Keep it classy Joe.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aXG47slCe6bMuGJ143CqRg"
  },
  "K-qNcJfdlTOW9ttG3FwZnQ": {
    "date": "3/24/2019",
    "text": "I have had joes NY and the one in Santa Monica. I thought this was the same joes. I read the reviews and heard it had a new owner. It can't be the joe I know... we got a pizza, penne vodka, Stromboli and a side salad. It all was inedible. Everything tasted watered down and all the crust were really hard and disappointing. Sorry.. no go on this joe.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2kwvDrjc0uQDOgIrIxJkQ"
  },
  "22BoZui6O7KntpVa6W5aDQ": {
    "date": "1/5/2018",
    "text": "I got two vegetarian slices with mushrooms, green peppers, onions, and black olives. They were thin slices like I'd get at Joe's in the West village in NY. Not quite as delicious, but pretty good and enjoyable for NY style pizza in Arizona. I'll be back for another quick lunch for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L--bc4sNGRH01fOUT9rtGg"
  },
  "ms6LDKwkQcAT_X-4JphrFg": {
    "date": "12/9/2018",
    "text": "Seriously, this might be the worst pizza ever! Never , ok maybe once or twice I've had a frozen pizza that was so bad I couldn''t eat it. This reminded me of one of those. What was supposed to be a nice thin crust crispy pizza, came out of the box,  cooked and dried out on top, soggy and drippy underneath. ( I really think it was a frozen pizza) The crust tasted like one of those baking powder, quick rising bitter and mealy crusts like you see in the frozen food sections. Horrible on a good day. The toppings looked like they had been applied with a rolling pin, perhaps they were, or perhaps it was made ahead, and then taken out of a stack , seriously a sorry looking mess. We tried but were unsuccessful in eating more than one slice of this thing. The rest, went straight to the garbage, I'd have returned it, but what's the point. If this is the best they can do, I don't want another one. So, what's the point??  The point is, I've done the research so now you don't have to. There are plenty of other Pizza places in town, eat there!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wE7vURgyxAIZ97ZEOAetGw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. yep, it&amp;#39;;s joes box",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wE7vURgyxAIZ97ZEOAetGw/o.jpg"
      },
      {
        "img_id": "kg6gYaQQ-1cyYeIpBEoAtQ",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Soggy wet mess, inedible, the ingredients, hardly recognizable, the cheese? maybe it was once??",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kg6gYaQQ-1cyYeIpBEoAtQ/o.jpg"
      }
    ],
    "user_id": "94_0S4oh0lPtuDBchycgPQ"
  },
  "Y5cPRltsEyPEabP_tdR3gw": {
    "date": "11/29/2016",
    "text": "I hadn't been to this place in FOREVER (I'm a little old for this part of Scottsdale nowadays), but found myself imbibing at DJ's recently, and a friend wanted to stop in here sustenance. It was good. I had a slice of cheese and something else (Hawaiian maybe?), and they were both good. A little greasy (of course), but still yummy.   Given this place's location & hours it obviously caters to the late night drinking crowd, but I remember a LONG time ago, I would stop in here Fridays after work and pick up whole pies for my family and they were always very tasty.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "W5cwxNwGiZJd393PCDQEvA"
  },
  "lT4NFO2EEiD2DEleEdB1aw": {
    "date": "11/16/2016",
    "text": "We are visiting from California and we decided to have our food delivered. We placed our order online. Very easy process. I must say the delivery experience was outstanding! Totally on time, professional, food was delivered hot, awesome food! I wish we had this Restuarant in California! Great Job Joes!!!!  Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jrj-13I0d6Ve2Q_Zg5fAPw"
  },
  "N9qHX2LCE2kW7Q596WyaMQ": {
    "date": "10/12/2014",
    "text": "After a disappointing and failed attempt to find Mexican food in Scottsdale, my friend and I ended up ordering online from Joe's. It was probably one of the worst pepperoni pizzas I have ever eaten in my life. Cardboard \"deep dish\" crust, flavourless sauce, watery cheese - it tasted worse than frozen pizza. I would not order from here in the future.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ee95opWLnHPT_u38BY9WQ"
  },
  "efJN_10BTdb4H9ajZ13cLg": {
    "date": "1/9/2015",
    "text": "My ultimate favorite pizza spot, sober or not. The closest pizza to authentic NY pizza.... And they deliver! A plus!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KZQtyVJoW0r-lsFrcYM_mw"
  },
  "dZjnEoQJRv829r56D-c_rg": {
    "date": "9/18/2012",
    "text": "Ok, so I've only been there when I'm hammered.  So sue me.    When I have gone to Joe's, it is VERY late night as the various clubs near Shoeman/Scottsdale begin to wind down, and this place has a huge line out the door every time.  The pizza, which is sold by the HUGE slice, is simply acceptable - not special, not delectable, not even excellent.....just acceptable.  For me, pizza starts with a great cheese, and the cheese here just seems so....bashas-like and ordinary, without that quality mouthfeel you get from cheese at places like Street of New York.      Of course, when you're binging after six drinks, \"acceptable\" has a funny way of becoming \"I must have it right now.\"  So I'm sure I'll go there in the future, but my expectations will be well calibrated -- This is drinking food, placed smack dab in a location that caters directly to people that have been drinking.  Buzzed or not, that long line can sure be annoying.....",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8riySShDD_qy_3yfieHeQ"
  },
  "TnWQ3BX3DNuExLqRa9XVjw": {
    "date": "8/19/2015",
    "text": "My first time here and nothing but good vibes. Tucked in the corner of all of drunken old town, this place is a True gem. Great pizza by the slice and I love the crisp dough, flavorful sauce, not overly saturated with cheap cheese and baked to perfection. A definite great place to eat before or after the clubs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ySOWHay3yeaadfuXOuagMg"
  },
  "FKk6KAz5x5A7gdphcjH5Ow": {
    "date": "3/13/2013",
    "text": "My favorite Phoenix pizza joint! Wonderful service! The woman who generally answers the phone is so polite and friendly. On top of that, the delivery guys are always friendly too. The last time I ordered, I was pulling an all-nighter to finish a final and it was 2:30AM. Between the time I ordered and the delivery, it started pouring rain, and the delivery guy was 10 minutes later than they quoted me. I didn't even mention it, but he apologized anyway and was extremely thankful and friendly.   The pizza is SERIOUSLY good! I love thin crust, New York style pizza and this place truly gets the job done! Delivery is always fast and customer service is excellent. They're open late and they're always appreciative of your patronage.  After trying a gazillion pizza places in Phoenix/Scottsdale, I finally found the place and I will not order from anywhere else. If you normally order from Gus's, give Joe's a shot and I bet you won't go back.  TIP: Pizza is excellent, but if you're in the mood for something else, try the Penne and Broccoli with chicken. It's really good. Don't expect fancy Italian restaurant quality, but it's still a damn good meal.  TIP#2: The Garlic Knotts are SUPER Garlic-y. If you're not a fan of TONS of garlic, ask them to go light on it. I can't stand too much garlic, but my boyfriend loves it and is now addicted to these. Seriously - expect to be chewing on pieces of garlic. I'm not complaining though - they're still really good :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MAf1iOQu77g6m8EuJgx6zQ"
  },
  "EZOdJGEQpaMxDbjxs176-Q": {
    "date": "10/7/2015",
    "text": "I had ordered delivery because of my business near by and having my special needs daughter with me it takes a lot to get her in the car and back and forth so. I had ordered online to make sure my order was not messed up. Well I got my food, and they forgot my spinach on my pizza and they also did not have my salad dressing. When I had called to,let them know at 1st the lady on the phone told me there was NO spinach on the order, I had told her I am looking on my ONLINE receipt that tells me there is and was CHARGED for it. She muted the phone and made it right to offer me a free meal next time. Pretty good food but did not care to be told I did not order something on a pizza when CLEARLY it was stated on my ONLINE receipt. ?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_GnS89AlwVQZ0Gw74ZLgRA"
  },
  "o_FgokatlWcyu8JK8xY5aw": {
    "date": "8/5/2013",
    "text": "5 stars for New York style pizza 1 star for Sicilian  I have lived in Old Town for almost 2 years and have been on a mission to find good pizza.  I discovered Joe's a couple of months ago when a friend had ordered it, and I loved it!  It was the New York style pizza, and it was perfect for me-- just greasy enough, lots of cheese, not too much sauce.  The last 2 times I've ordered, I've eaten an entire 18' pizza with only one other person!    BUT...last night my bf and I made the mistake of ordering the Sicilian pizza.  He and I both loved the Sicilan pizza at a place called Jet's pizza prior to moving to Scottsdale, which doesn't have a Jet's.  The Sicilian at Joe's is nothing like Jet's, unfortunately.  It is all crust.  I like thick crust when it's good, but this was just dry, bland, and seriously at least an inch thick.  There was not much cheese or sauce, and, even if there had been, it would still have been overpowered by the crust.  I even tried dipping in ranch, and, still, all I got was crust.  What made it worse was that the Sicilian only came in one size-- 18 x 12!  So, we paid almost $30 for one pizza and just ended up throwing away most of it.    I will keep ordering from Joe's, but, from now on, I'll stick with the New York style pizza.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n4P8tLvD1ppd1m5SI242TQ"
  },
  "J2idFUvQDwPBwaZy0Pp_xA": {
    "date": "7/27/2014",
    "text": "DO NOT believe their website. Just ordered delivery from here. The order was not right, called to see if they would fix it, got the third degree about what we ordered, then heard the manager in the background claiming the deal we got did not exist. We were not concerned about money, or the \"deal\"  just wanted to get what we thought we paid for! Obviously customer service is not the priority and they are only concerned about the bottom line. Very disappointing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "-jYRn8gbBLb_6clxcd2arg"
  },
  "fyJ0LqhQKwk__mHIjuaQbw": {
    "date": "8/13/2015",
    "text": "I was in the scottsdale area for business over the past 10 days and ordered delivery from Joes 3 times. Each time the food arrived, hot, fresh and quickly. I would defiently recommend Joes as a great takeout option in the old town area. One time I even asked for them to customize my pizza (extra sauce, less cheese, add toppings and cut a certain way) they followed the direction and the pizza was delicious. The only thing I ordered last week that I wasn't a big fan of was the salad with salami, cheese and roasted peppers. The cheese and salami were mixed together and cut together so it was difficult to remove the tons of cheese they put on the salad. It didn't taste bad just not what I prefer. Pizza and fried snacks however were great. I'd recommend trying the eggplant on a pizza!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Hrgir0IYn4Yd8WqpIm80g"
  },
  "tIoKvvqElz7oK2rhp9KxQQ": {
    "date": "5/6/2012",
    "text": "Joe's New York is one of the best pizza joints open late night in Old Town. My favorite go-to slice is the delicious white pizza with spinach and tomato! Yummy yummy for my tummy! After 2 a.m. there is a line, but it is well worth the wait and the staff is pretty great at getting all the drunkies orders in and out in impressive speed. The thin crust style is amazing and consistent with each pie. One can purchase slices or whole pies to enjoy in the compact seating area big enough for about 20 or so patrons or one can opt to find a spot outside on the curb or the short, random wall next to the store. I've never been here before 1 A.M., but apparently they are open for lunch and offer a variety of different Italian comfort foods then.  Besides the entertaining hot messes after 2 A.M. Joe's also offers: an ATM Machine, tiny cups for water, fifty cent fee for using cards, and grease, lots and lots of grease! Stumble on over the next time you need some food to help curb your hangover!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "TBLdjYJMIDaM6dB23AenLw"
  },
  "Z0I7sRIcY8E4d99NCP_-AA": {
    "date": "5/3/2016",
    "text": "We just moved to Scottsdale and were looking to get a pizza. Staff was not friendly to begin with. We decided on a BBQ Chicken pizza. The worst pizza we've ever eaten. OMG, if we wouldn't have paid $21 for it, we would've tossed it to the trash. Couldn't taste any bbq sauce on it, it was just sweet like honey, the chicken tasted like it was boiled in hot water with no seasonings and the crust was chewy. I don't usually write reviews but it was so bad I feel I have to warn people. Spend your money somewhere else!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "usW3mfOWLMyaxCA-tSnukw"
  },
  "rJDUmBn4-l4oegE2m5XssQ": {
    "date": "1/4/2015",
    "text": "OMG. Hands down the BEST New York style pizza in the valley! I drive down from North Scottsdale just to get a slice from time to time. It tastes even more amazing after a night at the Maya. Wow, just wow. My mouth is salivating as I am writing this review!!!!! The sauce is garlicky (which I LOVE!) and it folds perfectly in your mouth. A little on the greasy side (your stomach may be mad at you later), but I don't care. Tastes so good going down it's worth it. Thanks Joe's for fulfilling my NY pizza cravings!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qSNUvp6l7kkKXdQH6KhngQ"
  },
  "UK5atVQQ3hnvGUIyPaAYEA": {
    "date": "9/21/2015",
    "text": "I've eaten at pizza shops all over the country, Joes is definitely on my top 5. Their subs are also amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QgtGeb2Bq7whaX9XNg0HzQ"
  },
  "wNlBBjHTrURNRtObnEVpwQ": {
    "date": "11/26/2013",
    "text": "YES YES! NY Pizza for sure! Upon entering I was greeted by a very nice straight forward lady. I made it known that i was visiting from NYC and i heard great things about this place and she said (very confidently) you heard right and you wont be dissapointed. Oh boy was she right! One bite and i was back in Manhattan! Too bad i been eating out of the other \"NY\" places around here this whole time :(.  So good! I wish you guys the best! So mad I only ordered 2 slices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0TRkYpJBj4TGRuapAr2BkQ"
  },
  "u8T2mOibbnfZMufLhzmzYA": {
    "date": "2/6/2010",
    "text": "Tried them for delivery tonight - and a good call it was, they were here in less than 20min.  Large 18\" Pepperoni Pizza with a 2-liter of Coke set me back $22 (not bad for the good stuff). Huge slices, thin crust, fresh parmesan cheese in little plastic cups, crushed red peppers, plenty of cheese and grease.  Overall a great break from the predictable taste of Domino's and Papa Johns.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ywAlepBJFvYgh4viU0Faaw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Joe&amp;#39;s Pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ywAlepBJFvYgh4viU0Faaw/o.jpg"
      }
    ],
    "user_id": "PeLGa5vUR8_mcsn-fn42Jg"
  },
  "M7iMCNx3DTo_FRrS9sC4xg": {
    "date": "8/3/2014",
    "text": "Called in to order @ 1:50 am just before the bars closed. Trying to beat the late night rush. I was told 45 min. Its now 3:32 am over and hour and a half later still no pizza. What could have made it take more than 2 times as long? My answer is not my problem.  I Canceled the order.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kMRxcmfIXJ6WstqoOPkZ1g"
  },
  "WuPZ8Bj3IlWQmIQCX4RMbg": {
    "date": "2/6/2015",
    "text": "Fast and tasty pizza.  Positives: you can order by the slice, they have a frequent miler card (3 slices for price of 2), and open late.  To me, the right amount of sauce and cheese ratio.  Negatives: long lines during clubbing nights.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5w53Cqr1lpK3kIhTjRyWmw"
  },
  "EiG4VUEw7m-T5Mgq5JrXzw": {
    "date": "4/11/2015",
    "text": "Pleasantly surprised. Legitimate NY Pizza in Arizona. Great crust, delicious sauce, tasty cheese and perfect texture. Great spot to frequent if you are a local, or if just visiting. I'm originally from NJ and know good pizza. Only reason not 5 stars is because their prices for a slice are slightly absurd ($4.00/slice). In the most expensive city in the world, in Times Square, pizza is $3 - $3.50 a slice..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HNwQ-7PP2DbHuN0YpMuIaA"
  },
  "xbXEQg1VHFjPXakqslsWrA": {
    "date": "8/12/2012",
    "text": "Stopped in here with two of my friends and we decided to share a slice before we went to one of the local clubs.  We wanted to avoid having a food baby, which is why we shared.  We had the pepperoni and jalapeno slice.  I'm not crazy about anything too spicy so I removed the slices of jalapenos....my mouth and my lips were still on fire!  Don't get me wrong, I still liked it, but just make sure you have something to drink with you if you order what I ordered.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QTNMJ8unxkk8XT4Tl4a68g"
  },
  "RrLa1uBSg99gTHrr4irWcQ": {
    "date": "2/27/2016",
    "text": "Best Pizza anywhere in Phoenix area. By the slice or the entire pizza. We enjoyed our 4 different slices so much, we ordered a plain pie to go. I have found Pizza Heaven in Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5yQuQnZqLwiUcwJH44sgBw"
  },
  "8uPGSCVZyRKJ3YQS8T7cdw": {
    "date": "12/6/2013",
    "text": "I am a fan of the gluten free pizza. We had it delivered and they were on time.  They do a really good job of this.   I only said O.K. for this review as I also order a mixed green salad. It said it had field greens.  Their other selections mention iceberg and anyone that appreciates good salads know that iceberg is cheap and worthless.   My salad was delivered with iceberg.  So I hope in any future order they get this right .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "17Z4JJAIdj6h8HQGxgMSQw"
  },
  "1rUI1c0Ff-VeZ5esXRm3nA": {
    "date": "10/13/2013",
    "text": "I work in Old Town Scottsdale and we order pizza from Joe's probably more than we really should.  I'm pretty sure no one truly needs that much pizza.  Joe's takes great care of us, however, which is why we keep ordering more and more pizza.  They have True NY style pizza, dripping with grease and deliciousness.  I don't ever want to know how many calories are in one of their pizzas!  If you're looking for a snooty upscale pizza place, this is not the place for you.  If you're looking for some pretty awesome pizza delivered on time, call Joe's!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zbahX7xiLbjWWM4_L43lhg"
  },
  "Zm6uR5DCo1fa0eydz4T_rQ": {
    "date": "4/1/2017",
    "text": "When I went there it was bomb, but when I had it delivered it wasn't that great at all way too expensive not quality pizza",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rrkouYolOmjcyxAvq-N6SA"
  },
  "IfaY-egeBBSEq1bS12Jurg": {
    "date": "3/7/2014",
    "text": "I'm a New Yorker and it's been hard finding a pizza place that is like home. While it isn't completely NY style pizza it's pretty close.  **update 7/23/16** don't bother ordering online from them... They say order online and save 20% but they don't honor that when you pickup the food. Lame.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kta6QqE36T7GU3qBJIKIXg"
  },
  "YOpJ1tZ4fVg5pG6MkeJ1UA": {
    "date": "6/8/2015",
    "text": "These people are shady. They say their delivery charge is 3.50 which I've never even been charged in the past. Myself and about 4 others usually order lunch here. We work right across the street. So what happened the last time we ordered? They hit each of us with about 9 dollars extra. I ordered a 9 dollar sandwich and was charged 16.50. How does that add up? And each of us? So your delivery guy got about 40 bucks for walking across the street? Screw you, I'll be talking to my bank. You not only lost about 50 bucks a day, but you're going to be losing out on the total. Idiots.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_MlgmkGqZIoyUBh_GCcPEg"
  },
  "J7Z4k2Ak25sXUwNatPZJXA": {
    "date": "2/24/2015",
    "text": "Ordered a pizza last night from these clowns. The pie was obviously pre made and then just tossed into an oven to be re heated. Crust was far from tasty at all. Nothin but crunch which indicates that it was pre made. The wings were well...mediocre. My main complaint is with the pizza however. I've had issues with joes in the past and they never made it right. I literally chose them as a last option; and that's what I'll recommend. Too bad they're willing to call themselves a NY pizza spot and sell a weak, horrible and awful product such as the one I paid $30 for. Oh, and let's not forget how rude the staff is at this place. Don't get crazy over the phone with me again joes; I happen to know where the joint is located. All in all; you're better off with a digiorno pizza from Walmart.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "4LsAt6ciOJe3EJOYOpqSxQ"
  },
  "9F2GAipApQbOqZkg56oGPA": {
    "date": "1/30/2017",
    "text": "I would have given their pizza 4 stars, but is was delivered WAY UNDER-COOKED. Why are they in such a hurry?! The pizza by the slice in the store is never undercooked.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D8bX6JoVEZoksfuvHqjYyA"
  },
  "3X42V1FQCYTNoNXXZUkYzA": {
    "date": "12/29/2015",
    "text": "Yum! Delicious. Just go. And enjoy! Enormous calzones, really great pizza, thin flavorful crust, tasty sauce. Spaghetti marinara so good, great Greek salad, I could go on and on. So good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ehKUgqj6rhzdhAsz9qgShw"
  },
  "BMLsq6siQNriEbmjMFOe4w": {
    "date": "9/3/2016",
    "text": "I should have read some of these reviews before placing an order with this place. My husband and I are visiting from out of state and decided we wanted late night pizza. We ordered our food at 10:00 and 50 minutes later we got a call from the place asking where the pizza was to be delivered. Five minutes later our delivery driver called us and told us he was in the parking lot and there was no parking available so we would have to go down and grab the pizza from him (if we wanted to do that we wouldn't have ordered pizza for delivery). When we went down no one was there, we called the guy back and he told us he was at the wrong building. We cancelled the order, they lack communication and I don't think they understand English much either. Frustrating, would have loved to give them a try but will not now nor will we recommend this place to anyone. Sucky service, lady on the phone was rude!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HbZKnorP914o0Vo5NxjsAA"
  },
  "SCXZFfCF5DeOEXSDffY4IA": {
    "date": "4/10/2013",
    "text": "This place sucks.  Ordered the simplest thing, an 18 inch with mushroom and pepperoni.  When calling to place the order, they asked cash or credit, and we said cash. After over an hour, this smug delivery guy shows up and asks for 21.50.  All I had were two 20s - and he only had 6 dollars in change!  He didn't even apologize or try to fix the problem, just gave me a smug look and took 34 dollars for a 21 dollar order!  Real classy.  And the pizza was cold, greasy, and generally quite awful.  Super stingy with toppings.    Avoid this place at all costs.  An absolute rip-off that makes a sucky pizza.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "k9qeMMyV_ovURm55wfbPUA"
  },
  "-PzTZgkEIiCN9mQsprF_wQ": {
    "date": "11/17/2014",
    "text": "I was really blown away by how bad this pizza experience was... It was room temp and basically a bucket of grease. Wow.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "fm3ZoNUZj18XckNuUPEE3Q"
  },
  "gAQgeJMDIcuW3-SrbV9lbQ": {
    "date": "6/1/2015",
    "text": "Solid slices. Ambiance is slight. Very reasonably priced. Staff is pretty friendly. Haven't tried any of the pasta or other dishes--I'm a little scared to",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GA3FcrYg6Co2DSvx-p8j7g"
  },
  "zxeA0nZQojYA4OjbjHmPTQ": {
    "date": "12/14/2016",
    "text": "I've made 3 attempts to buy pizza from Joe's and only one was successful.  It was good but my experiences have been bizarre to say the least. I heard that Joe's had really good New York style pizza and as an East Coast transplant, I'm always looking for good pizza. The first time I tried to get pizza was about a year ago. I called and asked if I could order a Sicilian pie to pick up. They took my order and I hung up. About 1/2 hour later my phone rings and the caller ID says the call is from Alaska. I almost didn't pick up but I did and it was Joe's calling back(Alaska - I thought they were from NY?? ok people move around - keep old cell phone numbers or maybe it was an employee - whatever) but they tell me that oops I can't have Sicilian pizza because they don't have any Sicilian dough. Wait what? This is a Pizzeria right? It's Saturday night right??? In downtown Scottsdale right??? Forget it.   My second order a few months later for plain take out pizza went fine and it was good. The reason I felt compelled to write this review is experience #3 which happened about a week ago. It was weirder than the first one. Decided to give Joe's another try for the Sicilian pizza. I called and someone answered but there were long silences and I was like \"Hellooo?\" \"anyone there??\" and I had a very hard time understanding the person who answered the phone. It was like they were training or speaking to someone else while talking to me. Another reviewer mentioned an answering service and while I think that is super strange for a pizza place, that's what it felt like. Anyway I asked for Sicilian and she said they don't have that. I said you don't have Sicilian pizza? But it's on the menu. She said they only have the specialty pizza with everything on it. I said that's it? Only one type of pizza and it has everything on it? Nothing else? She said yes. I hung up.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PaYMUbovP8I0poCSXqGNgA"
  },
  "ClAderOzwNWyR34tUVdHYA": {
    "date": "10/11/2015",
    "text": "Great staff and there aren't any places better for a slice and one more beer while partying in Old Town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fbyGwQ0PhImYB5AgNyfqNw"
  },
  "91qRgOKccrL-zBqSQNj-OA": {
    "date": "2/22/2013",
    "text": "My husband had been bugging me to check this place out with him... his new favorite pizza place. Why does he like it so? Well, it's the huge foldable greasy pizza slices of course. I also enjoyed the pizza, great flavors in the sauce and good toppings however I'm more of a crispy crust type of gal.  This place is good for a quick lunch. They have several pre-made pizza's to choose from behind the counter... pick out your slices and then they add them to their ovens to warm and crisp them up a bit. It's affordable as well and very much a mom & pop type of place so if you like to support locally owned businesses give this place a try.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ePfhvRM-deQgMduESHRWDg"
  },
  "UxYC4ke_8fL-Uxd-RHxsHg": {
    "date": "12/30/2015",
    "text": "This is the BEST pizza in AZ!   I lived in NYC for five years and when I returned home, I yearned to find pizza in Scottsdale/Phoenix as good as what I enjoyed while living in New York. There are many places that claim to be NY style pizza but Joe's New York Pizza is the real deal! Their cheese is absolutely delicious and all the toppings I tried so far knock it out of the park. Their crust is perfectly thin and crunchy in all the right places. A True giveaway that they know how to make pizza.   I've read a lot of reviews that are not that great - sometimes due to service or what have you. But trust me if you are looking for NY style pizza, this joint is the place. They also have garlic powder (a staple in NY pizzerias) available to sprinkle on your pizza, just ask them for it.   Thank you Joe's New York Pizza for answering my cravings for NY style pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qWz4hFV1fzrG4-jZQVZxQ"
  },
  "x2rAlh_j1AZ9BbCD-8plqg": {
    "date": "8/7/2016",
    "text": "Alright, well, tonight marks the third time I have ordered a pizza late night, and never received it from Joes. So, tonight, I placed an order online, and called to confirm. I was told it was on the way. This was around 230am. I was told it would take around 45 minutes (understandable) At about 350, i still have not received my pizza. I called again, and the woman on the phone told me they were closed, which is fine, then when I asked if it was going to receive my pizza I ordered an hour and a half ago, I was hung up on. I work late shifts, it's hard to get food late at night, and it's ridiculous that this seems to always happen here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uBrtD7usSO5omwgPtQ2PEw"
  },
  "pcdJeOUOxk0JtW7eP_mAEw": {
    "date": "12/6/2014",
    "text": "Apparently even if you are a board certified physician you get treated like an uneducated thug if you are a minority here.... Completely terrible service. Just because it's late and the majority of people are drunk is not an excuse to treat people like the S word....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5AvLvf-MJrv7b0t_pI2rIg"
  },
  "Ab0x8Zl8GPNi3qSIThOdyg": {
    "date": "7/6/2012",
    "text": "Best NY style pizza you can get in the area.  Whether it's late night, or delivery, you're going to get delicious pizza, crispy but not floppy crust, and a mouthful of gooey cheese that sits well, is flavorful and doesn't drip.  People write a lot about how it's too greasy, etc etc, if that turns you off, then just go to Crust or something!  I think people who enjoy Joe's know what they're getting and are big fans of it.    Get some!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "W2LyuwO6uevVUT7OCKL2dg"
  },
  "YCw0mTnVSgLu0vLarykWGg": {
    "date": "1/1/2019",
    "text": "LIARS. I called and placed a delivery order about hour after midnight on New Year's Eve.  Of course it's busy.  They said an hour and a half to deliver.  Fair enough. The young girl took my credit card number over the phone and confirmed payment in advance. They said the driver has my number, and will call me when he's close. About an hour and a half later, I started waiting  outside my hotel, in the cold, to assist the driver, who has my number. Two hours later, about 3:20 AM, I called Joe's Pizza. The same young girl said all the orders were canceled and the driver tried to call me. BS! My phone never rang. I waited two hours to be lied to, even after I paid them! Either deliver the pizza or don't take the order. And then don'tlie about it. Pretty rotten thing to do to someone. Not at all right.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "SB58JVJw75hN0qRcoFYqDg"
  },
  "EMDAp5yAx4HknWrxhedG3Q": {
    "date": "7/5/2019",
    "text": "Pizza was ok, could have had more flavor. Given, I just had a regular cheese slice, but it was kinda bland. Crispy slice (not what I expected for an NY slice) but bread wasnt bad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SEjDSxo8DK_LG8q9MhQf3A"
  },
  "I7k7EmE9IceGu3G134TJxA": {
    "date": "11/14/2017",
    "text": "Solid 4 star NY style pizza joint!   Pizza is good here but what really sets this place apart are the increadibly convenient hours! It's open from 9 am to 4 am. You read that right. THEY'RE OPEN 19 HOURS A DAY!!!    We all know what it's like to be out super late and getting hungry after a long night of Old Town Scottsdale fun. Well Joe's has you covered. Pizza, burgers and more all available basically all day and night.  Good foldable NY slices at very reasonable prices. Kind of hard to find the 1st time but well worth the effort. Parking garage in back has free public parking.  Sunday in Old Town during football season makes parking on the streets nearby tough.   Remember to use your yelp cash back benefit here. Those rewards add up quickly!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "F0Ze6yhbEzRZGsGom368Mw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Pies waiting for you!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/F0Ze6yhbEzRZGsGom368Mw/o.jpg"
      },
      {
        "img_id": "2s_2yCYwcyG1ch07pgtB3w",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Today&amp;#39;s choice was pepperoni jalapeno.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2s_2yCYwcyG1ch07pgtB3w/o.jpg"
      }
    ],
    "user_id": "hZFzo6HD06gtj4J7O2ki_Q"
  },
  "_F0hCv3Ze05ZbUDZDNgv4A": {
    "date": "8/24/2019",
    "text": "Called in an order 35 mins before their close and they said they can't make anymore.. I was ordering a whole pizza? Doesn't make sense.. bad customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-7Ph0p0vRszjQjyuU1P-_Q"
  },
  "R0Jhkd6pUwv54_KnghSWLg": {
    "date": "8/20/2019",
    "text": "Was excited to give Joe's New York Pizza try again. I had stopped going there because I felt the pizza had gone downhill. I gave it a try and was very disappointed. The only thing \"New YorK\" about this place is the sign. Pizza looked dry, was dry and had no taste and all. I believe customers would rather wait a few minutes for a fresh pizza with hot melting cheese and sauce to arrive then to re heat a slice that's been sitting out for a while and try to make the pizza oven bring it back to life. Come on Joe's, you can do better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yoT3Rqe6GLAt0X663r0twA"
  },
  "nFl9ArBsuVPFO4h06lw5zQ": {
    "date": "6/15/2019",
    "text": "Ordered delivery for the first time 2 nights ago. I was hesitant at first because the prices are high, but I figured it was large portions or just that dang good. Husband and I ordered spaghetti and meatballs. It was HORRIBLE, the sauce tasted like the can spaghetti O's sauce, noodles were mushy over cooked and salad was just lettuce out of bag. With those prices EVERYTHING SHOULD OF LOOKED AND TASTED HOMEADE",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gAyREbq0oaO2lgkHDwEKKg"
  },
  "Fs0tSBhgK8_4FI8T-zIwyQ": {
    "date": "7/2/2018",
    "text": "If you need a hug and someone to be kind and gentle to you, you should probably be in bed at 2am on a Saturday night so you're well rested for church Sunday morning.   Don't go to Joe's looking for folks to be kind, go for the late night slice(s) and the quick in and out experience.   Pizza is decent, prices are solid, and location, location, location... right next to the Uber pickup spot!!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O5_xBtoZA32GGIsbrujM7g"
  },
  "lSOIbrIgJPTlR9F5Sxe7UA": {
    "date": "5/2/2019",
    "text": "In my opinion, best New York style pizza in PHX that I've experienced so far !  It's like Crack.... Addictive",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ex8HQnYVPrjef1NIoWkXag"
  },
  "nXdKN6lPetJ9-Tc7OmZKng": {
    "date": "5/17/2019",
    "text": "Yo, fuck this place. $9.00 for 2 plain slices and a bottled water. It's not even that much in NY. And the nerve of you to call yourself NY pizza. I'm from NY. Not even close. NY pizza doesn't taste like ass",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2v0VfoZ15FfK2uKvY9s0Vg"
  },
  "QBS62x6z5efTBHAVWwNxsw": {
    "date": "8/5/2019",
    "text": "REALLY great pizza. The cheese literally melts in your mouth and they are NOT stingy with toppings. Two thumbs up for Joe's NY Pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CCZ2Cl7_2C-jDBoTSjeC6w"
  },
  "MxFfnV7IG72rCzSR6-DN-w": {
    "date": "4/6/2018",
    "text": "Great lunch specials! $6 for 3 slices! In and out within 5-10 minutes.   I've gotten about every type of pizza they offer at this point and I've always been satisfied. Pizza is large, thin, foldable and durable just like you'd expect from a NY pizza. Never overly greasy. Vegetables always have a crunch. Not to much in terms of premium or unconventional ingredients. Full pies are a little pricey but hey it's good pizza!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7YZ9-buN4RMh3ymKd70OCg"
  },
  "y9vFOJAfHs100szOvhoRAg": {
    "date": "5/18/2019",
    "text": "I ordered cheese pizza. It was so disgustingly soaked in grease. Pizza was red and oozed grease when poked. Maybe for a pepperoni but a cheese pizza - wtf? Called to get a refund and the manager told me \"there's nothing wrong with the pizza.\" So much for customer service. Not even worth taking it back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQQrKCDvf5QX3uYASsDVGg"
  },
  "2EOx4YS5CodDw7_ZzL8z5w": {
    "date": "8/21/2018",
    "text": "I'll like to start off by saying I'm not a huge fan of thin slices of pizza but this place is pretty good. I used to come here at least once or twice a week for their lunch special because it was such a great deal. 3 large slices of pizza for $6 is a steal. All the pizza there tastes great and is fresh. You get a filling lunch for a great price in a matter of 5 minutes. The staff is great and friendly. Definitely,  recommend if you are in the area for lunch or you are out late night leaving the bar and need some quick food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "b3NNHI6S7--eoNGCW1g5yw"
  },
  "lWQIPckWHeTuOnLxFXz3ng": {
    "date": "3/13/2019",
    "text": "Joe's, piece of shit pizza. Late night delivery needs to arrive before bedtime. This place fails. You will fall asleep before they come, guaranteed. That's that.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zg_NPBdIUfOOwOKpO12EGA"
  },
  "Fgq8G7HSupmEQtQpww3sIw": {
    "date": "12/14/2018",
    "text": "I love Joe's! I've been here late night, and during the day! They have really good New York style pizza! I always say hi to the crew! They're awesome, and they deal with a lot of stupid drunk people late night, which I couldn't deal with! Props to them! Love, love, love! Try Joe's out, and thank me later!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "27hyqoJVv66JN_Z8pduSBA"
  },
  "VhEJq_RZtvkXGwqcGnKuGQ": {
    "date": "2/11/2017",
    "text": "4 stars when I was drunk, but this place probably only deserves 3.   There was a girl fight outside this pizza shop when we were waiting in line LOL. Food AND entertainment? That's like the whole package. Jk, the pizza was aite. It came out luke warm and for $3.50 a slice, that's pretty pricey. But hey, it gets the job done after drinking all night.  White pizza and red pizza are both good- can't really go wrong with either. The line was out the door but it moved by pretty fast, probably cause they don't heat up the pizza slices for you. The tables are really dirty and there's trash everywhere but honestly who gives a fuck? It's 2am, you take care of your drunchies, and ktfo at home. Probably wouldn't come here on my own during the day tho.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "VF_ObN7lM_Bt00Gqv0eusg",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. They don&amp;#39;t clean the tables!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VF_ObN7lM_Bt00Gqv0eusg/o.jpg"
      },
      {
        "img_id": "_JEEALNp6-bLKBxLukPQzw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Slices",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_JEEALNp6-bLKBxLukPQzw/o.jpg"
      }
    ],
    "user_id": "jckP4KS3DFeOnsFx8PF5yg"
  },
  "ruGIMqXTnYVHkDytNJ73dA": {
    "date": "1/11/2019",
    "text": "Finding good wings in Old Town seems to be a tough one.  Tried this one, and it was so so.  Maybe Goodwood?  Maybe ATL Wings?  Sheesh.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Nlm1s_FQPVTrY06vcsfuXw"
  },
  "HBcZeN5p949CxbbSCEDgyQ": {
    "date": "1/24/2018",
    "text": "Crispy thin crust with flavor in the toppings that are extremely delicious. It's usually quick and easy to get a  couple of slices.  They also have whole pizzas and beverages galore. Indoor seating is nice when the weather is foul.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sLUI9Rj0arCj8-89rP2RNw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. COZY DELICIOUS COMFORT FOOD.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sLUI9Rj0arCj8-89rP2RNw/o.jpg"
      },
      {
        "img_id": "L-fSeWlxk83l2224rcgQMQ",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L-fSeWlxk83l2224rcgQMQ/o.jpg"
      }
    ],
    "user_id": "l_XTQGf0vN6D-8OvSL51Jw"
  },
  "I0NDKPLCm-UuKe_oYeOunQ": {
    "date": "4/2/2019",
    "text": "Love this place the lady at the front counter is crabby but the pizza is FANTASTICO to say the least!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj7da8JWruMJoE9okUZ7cQ"
  },
  "t8jihFd3RemlD3G9jlYKzw": {
    "date": "4/7/2019",
    "text": "stopped by at the last minute, needed a quick slice of pizza and ended up getting a whole pizza.  It seems to be a great place, pizza was good.  It was earlier in the evening and not that crowded so worked out well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TyUL4HW8Npyb3yvxmXfHkQ"
  },
  "3FociNA2HTxVEF7pef5z8A": {
    "date": "3/19/2016",
    "text": "Delicious New York pizza! 3.50 a slice and ready immediately. A few tables to sit down and eat at and its in the location where all the bars are at! Open til 4am every night!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V-YKfzkwUsXzMNh4CSaTtQ"
  },
  "D5EsDSehB0k9N9AfinjEMQ": {
    "date": "9/2/2016",
    "text": "Perfect NY style Pizza the way it should be. Cheesy, greasy, with a nice crispy crust. My new go-to pizza spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WHulNHKGd56zaMW873ulHA"
  },
  "9Y5rfsv-ggvNS-F-9kZlwg": {
    "date": "3/30/2016",
    "text": "Best Authentic NY Pizza! I love the plain ,pepperoni and white pizza with meatball and mushroom. You will not be disappointed at all! This place is the real deal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bixaftqcWwju2tfPePxwAg"
  },
  "DIYzHK8_ghYBruhv81MkIw": {
    "date": "9/13/2014",
    "text": "Pizza was greasy & good for a 2 AM order of pie. Unfortunately, they took an HOUR AND THIRTY MINUTES to deliver to my hotel room.   I'm sure I had called during primetime, I get they have drunkies to attend to.. But they told me I would only have to wait 45 minutes, and 90 minutes later I was practically asleep.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DpjWbLiA-7XE94lCDmj-Rw"
  },
  "407JprHvcgz3YHHNaGDWZw": {
    "date": "8/24/2017",
    "text": "ZERO stars!!  Horrible customer service. It was like I was bothering them to place an order. AND they never showed up even after I called again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rl6NgDCCIwj-Wb98lVJWRw"
  },
  "ppsRNQ61JEy81lXwWwBuXw": {
    "date": "11/1/2015",
    "text": "I ordered a 12 inch pizza which came out to be $14 and after taxes it was $17. Of course I didn't order enough to meet the minimum delivery requirement so I ordered wings. The wings were so greasy that I couldn't get the grease stain of my white countertop. After the entire order including tip, I spent around $30 (not worth it). This piece of cardboard wasn't worth more than $5. New York pizza slices are large and usually takes a large fold over in order to handle and eat. Joes pizza was like picking up a slice of microwaveable Totinos pizza. Hardly a New York style pizza. I guess this place is in a good area to feed the drunk Scottsdale masses but if you are sober then stay away.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "8VN3gzG7FjBZnbmvvMdc6w"
  },
  "BOPLTrDIkvuY9cXyckZ73w": {
    "date": "5/23/2014",
    "text": "The husband and I went here last night to split a slice after yoga (that makes sense, right?). There is nothing terribly special about this place, just a counter with pizzas where you can pick out a slice, despite this, it was tasty! The crust was thin and crispy, the cheese was melty and gooey, overall it was just a solid slice of New York style pizza. I won't be rushing over here to get a slice, but if I were in the neighborhood, I would stop in again.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "d_TBs6J3twMy9GChqUEXkg"
  },
  "5NJr05nG6O-I4v6DwbVG0w": {
    "date": "1/22/2012",
    "text": "This is THE best place for late night eats in the Old Town area of Scottsdale. Forget that phony cheesesteak place up the road. Joe's is where it's at! They are a True NY style thin crust pizza. Very delicious and many options for slices late at night as the bars are letting out. The lady that runs the place during those late night hours isn't the friendliest, but I wouldn't be either when I'm trying to get drunk assholes in and out as quickly as possible. Great pizza, good scene, great...pizza.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iWkMvsy3-16NNMBAhXa7sw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Angry pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iWkMvsy3-16NNMBAhXa7sw/o.jpg"
      }
    ],
    "user_id": "U7NLhaVfOJrHb9XLsZbJnQ"
  },
  "4k2uZnfww4VWV0ZDYErNlQ": {
    "date": "6/9/2016",
    "text": "Hubby and I were in the area just looking for a quick bite...great pizza!!!! The spinach and tomato is vey fresh. And best part, they were playing blink 182 and taking back Sunday",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OJwIW7UKTOwvST9DFmeaZw"
  },
  "GC3eDlvGz7ZAM0W3a6PA4g": {
    "date": "10/13/2013",
    "text": "The pizza is good, however the prices are,..hard to call acceptional.   The manager lady should consider an attitude adjustment. Absolutely unprofessional.   1 star..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "KykkzjLlAiaeUM31Az0dIA"
  },
  "-U6KtSczqwUROOMw2zo5IA": {
    "date": "8/28/2013",
    "text": "The Short: A mirage of legitimate New York pizza hanging around the middle of the dessert.   The Pros: - Affordable! - Open late (4 a.m.)! - Beer delivery! - Decent menu options. - Greasy pepperoni (for those that like that kind of thing).   The Cons: - Staff can be hit or miss (night staff much better than day). - Pizza is pretty bland beyond the scrum-diddly-umptious pepperoni grease.  - Uses McDonald's grade ingredients.  - Some items, such as garlic knots, have a tendency to be undercooked.   Best Item(s): - Pepperoni pizza. - Spaghetti w/ meat sauce.  Stay Away From: - Garlic knots. - All veggie pizzas. - The restroom! I now suffer from PTRSD (post-traumatic restroom stress disorder).   __________________________________________  The Story:   When reviewing a restaurant it's essential to consider the type of establishment it is trying to be. What is their overall game plan? What are they trying to sell you? For example, you wouldn't give Dicks Last Resort a negative grade for customer service. The staff treating you like the butt of an Archie Bunker joke is kind of their thing.  So with that in mind, I approached Joe's New York Pizza after a night of debauchery and loud music in Old Town Scottsdale. I ordered a pepperoni pizza and garlic knots, had a pleasant conversation with the staff, and walked back to my hotel to enjoy my post concert nourishment.   The inside of Joe's was pretty standard for a late night eatery. Everything looked like it was a heart attack waiting to happen and the surroundings weren't particularly clean or dirty. That offbeat middle point that only a place open at 2 a.m. is able to find.   Back in the hotel, I was astonished how amazing the pizza tasted. It was about 70 percent grease, but that grease was the most delicious substance I have ever had. I would have free-based it if such a thing were possible. The same could not be said about the garlic knots. They had the flavor of a week old pretzel pulled out of the mall dumpster. Two bites were enough.  The next morning I decided to give Joe's another visit. It was at this point I realized how much the loud music had affected my judgment the night before. The entire place was dirty (all of the tables needed whipped down and I'm fairly certain the Custer's Last Stand had just occurred in the bathroom). An eclectic mix of individuals, who matched the emotional level of a Nine Inch Nails crowd in the early '90s, replaced the once exuberant staff. The pizza grease still tasted like a solid brick of pepperoni, which is a good thing, but the cheese was beyond inedible. It was a night and day difference (get it).   I am very confident that the night staff was a sociable as I remember, but nothing else matched the enchantment of my first time there.   It makes sense though. Awards for being 'the best cheap place to eat' were hung on every wall in the dinning room and precisely define the restaurant. It's the McDonalds of late night pizza. The problem is, I can eat McDonald's fries anytime. I know they're the potato version of plastic surgery, but they still have a taste that almost anyone can enjoy. That's their one item. For Burger King it's the Whooper. Joe's doesn't have this. Their pizza hasn't hit that pinnacle yet. My guess, using a cheese that doesn't make me want to set my tongue on fire would fix the problem.   Joe's is likely satisfied with their place in the culinary world. Inebriated customers rarely complain and usually tip pretty well. I expect this place to stay three stars for a long loooong time.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "zznZTSALzMXf3cjggfNdBQ"
  },
  "P9XHNWr66lNIA9CIf3E8Nw": {
    "date": "9/3/2015",
    "text": "What do you want when you and your friends are too drunk to drive, yet are starting to get HANGRY? Pizza. None other than pizza. And when it's past 11PM and all traditional pizza joints are closed, you start to get desperate.   We found Joe's through Yelp, because as many of you know, finding delivery past a certain hour in the confines of PV/Scottsdale is near impossible. But hey, we were surprised when we found out that Joe's was open until 4AM and delivers!   Not much to say, other than we ordered a pepperoni pizza and some wings. The delivery time was around 30 minutes which is beyond fair and reasonable for a non-franchised place that does late night deliveries. The delivery man did have a relatively hard time finding our home, but after a few phone conversations and us venturing outside to lure him to the right house, we made the money-for-pizza exchange.   The pizza itself was good. Not the greatest pizza I've ever had in my life but by far not the worst. They gave us extra sides of sauces (for the wings) and some ranch which was an added bonus. Let's be real, when the late-night drunken hunger strikes again, we will absolutely order from Joe's.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "lX84alrS89AFMWcRtyu4Ow"
  },
  "-lAQVrylEmyQxysRGFOCDg": {
    "date": "10/11/2015",
    "text": "My husband has been a fan of Joe's in the past so we ordered a cheese pizza. It was awful! Even my kids couldn't eat it. It tasted like a reheated frozen pizza. The taste was awful and it was so hard to chew. We had to throw it away! We ordered a Greek salad which was ok but it had a huge tape ball attached to the bag! It was gross!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "mIQQkkOwiMG_qPEfj0JHGA"
  },
  "TbSgBZE0U73qo2UXii2Zng": {
    "date": "7/14/2016",
    "text": "We just had  lunch  with my friends. Great New Your style pizza,  like  always. We had  Italian sausage sub as well,with grill onions, grill peppers and cheese. Delicious! Very clean and service very friendly. Planing to go back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0GtyYmb-P0DlWTMDy8KNBQ"
  },
  "6sUkG3eCybMTZmei5nSOlg": {
    "date": "7/12/2016",
    "text": "I have taken ordered food several times from Joey's New York pizza in Scottsdale, the pizza is great the spaghetti and meatballs is fantastic even love the fact that you can get a delivery sent to you at two in the morning great place to eat just be careful it's extremely easy to over eat at Joey's New York pizza",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G9fNXJD-5jH2wG5oyF0eAA"
  },
  "SFxD6k-AyeyZ1TC1yx25QQ": {
    "date": "9/8/2013",
    "text": "For a late night drunk crowd, Joes deserves a shout out! Fast awesome service every Time after old town bars. Security on busy nights Excellent pizza Good prices  I love Joe's.   If you live in the area, I highly recommend at any hour!  Inside seating always accommodating even of line is intimidating.  I look forward to Joes pizza every time after a night out in Old Town Scottsdale.  Hot fresh slices!!!NY STYLE",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "qCzx039NVrJkWnZEqQ1JKA"
  },
  "CPaYobdlYBR6haZzDbROOw": {
    "date": "7/14/2016",
    "text": "I've always been impressed with their pizza. Much better than the other place down the street. All the workers are friendly and I love how you can see everything being made! I get nervous when you can't watch your food being prepped in the back. I've worked food service before and the stories are True.  Great pizza, good service what's not to like?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Q_mocpcbNV-7-a7t8Qdng"
  },
  "Txd5d6nJ16d4eiAJ-txH9g": {
    "date": "6/27/2012",
    "text": "While I disagree w/ Paul that this is THE best place for late night eats in Scootsdale( Im a long time Gus' fan) I will say that it is a GOOD place for late night eats if youre in that area. Our pizza was good, and thankfully, we got there just before the 2am rush.   We'd go again if we were w/ people that wanted to.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vPOkQJKahhR13LQ2ElSFGg"
  },
  "diD_Jcgh44pFiMJq5KwujQ": {
    "date": "4/12/2011",
    "text": "Found the joint on Yelp and stopped in for some lunch.  I was hungry, so I ordered:  2 Slices of Cheese Pizza <a href=\"http://www.yelp.com/biz_photos/5pMNyj77S1P3rrT69y1pkQ?select=DLRrNqxUOi4C-ZruqGljlA\">yelp.com/biz_photos/5pMN...</a> 1 Slice of Tomato Basil Pizza <a href=\"http://www.yelp.com/biz_photos/5pMNyj77S1P3rrT69y1pkQ?select=DK3o6jLbbW2Ot3ZSAxZ7lQ\">yelp.com/biz_photos/5pMN...</a>  It's touted as a New York Style Pizza joint and it is....the Pizza is thin crust and you must fold to eat!  Otherwise the Pizza bends down.... <a href=\"http://www.yelp.com/biz_photos/5pMNyj77S1P3rrT69y1pkQ?select=obcx6HaVezeOz9Duw6_sTw\">yelp.com/biz_photos/5pMN...</a>  I thought the Cheese Pizza slices were a solid 4 Stars.  They had a nice flavor to them and weren't greasy at all.  However, the Tomato Basil Pizza was not good....2 Stars at best.  The Tomatoes didn't have much flavor and tasted a little \"off\".....was not happy with that choice.  Total damage was around $8 and it included a bottle of Water.  Not bad for 3 Slices.  Next time, I order just Cheese slices.  Return Factor - 60%",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 13,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "DLRrNqxUOi4C-ZruqGljlA",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Cheese Pizza....nom!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DLRrNqxUOi4C-ZruqGljlA/o.jpg"
      },
      {
        "img_id": "DK3o6jLbbW2Ot3ZSAxZ7lQ",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Tomato Basil Pizza.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DK3o6jLbbW2Ot3ZSAxZ7lQ/o.jpg"
      },
      {
        "img_id": "VA3fp-mKLJYLnZDY-ebkHQ",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VA3fp-mKLJYLnZDY-ebkHQ/o.jpg"
      }
    ],
    "user_id": "QJI9OSEn6ujRCtrX06vs1w"
  },
  "TNhM6ZiZuhoFOH39ITVSHA": {
    "date": "9/5/2013",
    "text": "Ordered so much food to be delivered.  It was my sons birthday.  Cheese fries ....gross.  Chicken fingers no flavor.   Pan pizza .....so much dough and sick flavor....threw it away.  I don't think I would give it to a dog.    Chicken Caesar salad....yuck.  Sandwich....horrible.  Subway is much better.    Nothing good to say and spent over 60.00 feel burned.  I will not be returning...to bad because they are close to my home.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "X24LYNUi3yNty4Db9trvfA"
  },
  "aIzMbYxFRCAM-NSjolt2PA": {
    "date": "8/21/2019",
    "text": "Delicioso! inexpensive too! My first time here for lunch. Purchased 2 slices of pizza and 3rd piece was free. Slices are huge full of toppings and I could mix & match slices. The employees warmed up the slices in their oven before I was on my way...now that's thoughtful. I highly recommend and I'll be a returning customer",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K_4ej41KYTlXfaXSRW55VA"
  },
  "lfaPyOV7CbepwUyBK2LkdQ": {
    "date": "8/8/2019",
    "text": "I found this place to be an average slice of pizza. It wasn't bad by nothing really stood out about it. It's in a prime location as its surrounded by bars.   It's a typical walk up, pick a slice or 2, NY style pie. I had the pepperoni and a cheese slice. Crust was decent but the ends were a bit chewy and tough. The pepperoni was spicy and crispy as well as not too greasy.  This is a good place to stop by after drinks but I wouldn't make a trip out just to eat here as there are several pizza spots in the general area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XXFnfohWxcjd0jvPs2-rUQ"
  },
  "VKrSUuwUcT2dwnNv2THLqQ": {
    "date": "7/9/2019",
    "text": "Ok first off let me establish something here...I've never been to Joe's sober. I wander in here around 2:30 AM after the bars nearby close. The pizza is good but I'd probably say that about a grilled flip flop considering the physical and mental state I'm in when I eat here.  It's cheap, super quick service, and having lots of topping options makes my heart happy. I have a love hate relationship with the place cuz I've spent just as much money in the bars as I have here shoving my face with cheesy saucy goodness.   Keep it up Joe. There's a special place for you in heaven for sobering up the city and allowing me to go home with one last slice and eat your delicious pie as I fall asleep cuddled up in the fetal position in my bed. Thank you.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cOfyEq1Z0fjMyS0Iy5mVlw"
  },
  "Ufr_lNvWTBhSXDamWwfq4w": {
    "date": "9/21/2019",
    "text": "The best pizza after a night of drinking.  Fairly large, greasy, and hot.  Side of ranch makes this 10x better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wnJtKBTtmRh8mkTZF_UM_A"
  },
  "ASx5ELEkzZyfXNOfqIOZMA": {
    "date": "9/17/2019",
    "text": "Open late night. Liked the Stromboli.  Located at nic e location. If you are looking for late night quick service. I'll recommend this place!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gTXSxgRMULtJPEh3Tox3Ww"
  },
  "cPSjbYpuNVWObPl3erKswQ": {
    "date": "8/23/2019",
    "text": "Man you know this is the best late night pizza joint. It will soak up all the alcohol from partying all night in old Town and really is a sweet little spot. You will meet some funny characters in there if you are there after midnight",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UxkDZcYoIy8hFasx1_ulig"
  },
  "2lpNolqtfIEiQk5Y8cQWMw": {
    "date": "8/16/2019",
    "text": "I mean.... it wasn't terrible. Did remind me of home. But the pizza was BURNT. Would've been much better if not for the burned pizza. Ordered delivery so didn't have much customer service to speak of... but cmon guys... it's hard to burn a pizza....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "prCA-L0tB6oEtX_pPwCQFA",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. BURNED",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/prCA-L0tB6oEtX_pPwCQFA/o.jpg"
      },
      {
        "img_id": "VOVoLmPp2YNjySAQ220kZQ",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. BURNED",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VOVoLmPp2YNjySAQ220kZQ/o.jpg"
      }
    ],
    "user_id": "Nrcejy5lNQlAbNBKHyB9rA"
  },
  "z9d7SHTEYggBtWDh7-kntA": {
    "date": "5/8/2019",
    "text": "OK let's be clear here, there is absolutely nothing remotely NY Style about this pizza! And I mean nothing, the crust though flavorful, lacks that NYS foldable softness, and it also lacks that signature chewiness!  Now all of that being said, this isn't a bad slice of za! Though it looked as if it had been sitting all day, the ingredients were still tasty and fresh. However the temperature of my slice was not acceptable, it was fairly cold, but I was there at 3am so there's that! Would I go there again, yes it's one of the few late night food options in Old Town, and it served its purpose! In fact I would probably do exactly what I did on this night and that's get a slice from here and a slice from Gus's which is right next door!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s_JDz1gBlk8nDgwiFj9_cA"
  },
  "sVnyN1u7NtJ7piWIvZKOHQ": {
    "date": "3/23/2019",
    "text": "I used to live in Scottsdale by Joe's. And I used to eat there all the time. And I'm being honest I'm a pizza snob from jersey. This was at one time one of the few authentic pizza places in town if you wanted my style. A ton of places like to say they are east coast style when they never even tried pizza in NYC.   Clearly this place got a new owner. They should have changed the name when they decided to change the recipe. They now serve cracker with cheese.   It's actually even worse than gus. Which is also a terrible excuse for nystyle pizza. Seriously this is so terrible that it's not even going to be good if your drunk. Typical Arizona pizza that tastes like they ran the dough through a filling pin instead of hand tossing it. Watch I love Lucy your supposed to toss it in the air to get the crust texture right. Damn shame",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1LUpiwWkpT-1VNeDqR2Gag",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Two jalapeños per slice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1LUpiwWkpT-1VNeDqR2Gag/o.jpg"
      }
    ],
    "user_id": "uL1CZ6B1DV6Q8P5SpcOzSw"
  },
  "tXPJ8wqB7JYfgyiwKAea6w": {
    "date": "3/10/2019",
    "text": "I wish I could give them 0 star review. We ordered mozzarella cheese stick, the mozzarella tastes like gum. And the chicken stick..... was awful. The pizza sticks on the box, when I took it. The pizza ingredients just fell apart. This is worst pizza ever I had in my life.  It took like 1.5 hour+ to deliver to my place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gi4TzpER6wG-SXvE5a5rkg",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gi4TzpER6wG-SXvE5a5rkg/o.jpg"
      }
    ],
    "user_id": "dGt_eBRfW3mqYKCMybEHYQ"
  },
  "W38CUGNGDdr7_t75wyMtww": {
    "date": "11/16/2018",
    "text": "Late at night pizza is when I got here. 1,2,3 am in the morning this place hits the spot. I mean who doesn't like a late night slice or two?  I usually get the pepperoni and sausage or pepperoni and jalapeno slices. I like the thin sliced pizza and the flavor is good.   This place has some of the best ranch!! I love ranch on my pizza and they have good ranch.   I rated it 4 stars because the guys in the back are cool and always nice. They are quick and know how to deal with crowds whether nice or a little loose. The pizza I actually like and they also stay open super late.   It is a smaller place but they have outside seating which helps for the late night crowds. So if you have a huge group it might not be a good spot to go unless you take it with you. The prices are fairly reasonable too and not too cr  I will obviously be back and getting that ranch with the pizza.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 11,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "lTMHZxT3BPu4WtmGeIdFRQ",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lTMHZxT3BPu4WtmGeIdFRQ/o.jpg"
      },
      {
        "img_id": "fWe2JSBNmft1onFIvgX0Yw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fWe2JSBNmft1onFIvgX0Yw/o.jpg"
      },
      {
        "img_id": "1vQVJ5QLMOT9vrfe1mW05Q",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1vQVJ5QLMOT9vrfe1mW05Q/o.jpg"
      }
    ],
    "user_id": "LS0Cj5IiH28NnSChCLPSQw"
  },
  "Lo_Q2qJSDF1h8M2qvBTR_g": {
    "date": "5/15/2019",
    "text": "Had a pizza delivered to our hotel room 25 bucks for a big pizza is in a bad price if it tasted good but it was really bad  I mean I don't even think there was any cheese on the pizza if it wasn't one in the morning I would've called back for a refund  Told us it would take 45 minutes took about an hour and a half",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vWQRmv8kVibtchTSBR1LWA"
  },
  "qYl7mIiwNfH6qQr5XExa7g": {
    "date": "8/22/2019",
    "text": "Fresh, hot slices! Delicious pizza that reminded me of some of my Philadelphia favorites!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0-N357x16TxmFGqY8kv5kA"
  },
  "J1Up-vI_Qg0DFXF_t2of3w": {
    "date": "8/17/2019",
    "text": "The pizza is average. It's not bad for a quick meal but it's a little on the greasy side and lots of flop. The portions are big though, so you get good value for your buck.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5P6CWnSqg-JNGqz71Hpbtw"
  },
  "prH-6zG_8RC-l-h8Xtj7Hw": {
    "date": "3/4/2018",
    "text": "The pizza is okay, nothing to really write home about. The main reason to come to Joe's is you're 1) needing a quick/cheap lunch and work nearby or are 2) drunk. The staff is authentic to New York and by that I mean rude and condescending, but that has never stopped me from returning. The pizza is 3 stars, the price is 4 stars and the service is 2 stars, which provides the logic (when averaged) for my three star review.  Pro tip: come during lunch on a weekday, you get three slices for $6.50.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ukUq9BbDHs-iYtVpFag96Q",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Front.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ukUq9BbDHs-iYtVpFag96Q/o.jpg"
      }
    ],
    "user_id": "zcp389V72h0DKl69X72wKQ"
  },
  "mT47frizxOl4oVcZkgwPrA": {
    "date": "9/14/2018",
    "text": "So I ordered pizza for delivery because I heard this place was good, and it was the prices are a little high but the 18\" large pizzas were huge!! The white pizza and Hawaiian we're excellent and Kevin the guy who took the order was friendly and awesome!! I would recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "v4h3dT9P6Rp0H_pUBBSxUw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v4h3dT9P6Rp0H_pUBBSxUw/o.jpg"
      },
      {
        "img_id": "KQB3wbx_zIPw7ob5w834_Q",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KQB3wbx_zIPw7ob5w834_Q/o.jpg"
      }
    ],
    "user_id": "jmHLbG3W46FzJEyXbOh6KQ"
  },
  "avPwfJ_0-IFDRMRskb8YOA": {
    "date": "3/6/2019",
    "text": "A lot of the same reviews I am reading on here happened to me.  Ordered a pizza on a Saturday night, and was told it would take about 30 minutes to get there. They charged my card right away and delivered a cold and soggy pizza two hours later (after multiple phone calls with the same lady that charged my card) By that time everyone was asleep and no one ended up eating the pizza.   Politely called the next day and asked for a refund. Talked to Joe directly, who informed me that it could not be done.   Unless you're drunk enough in old town to eat shitty pizza, I would just steer clear of this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "wfTf4p0OoWZUp9FVR5tMaQ"
  },
  "W3Ad5knsDJ86VrqMpbZz_A": {
    "date": "2/5/2018",
    "text": "Man, so disappointed in what has become of Joe's Pizza. Maybe my memory isn't serving me well but, when I lived in Scottsdale a decade ago, this was a great slice and even reminded me of actual nyc style pizza.   In a recent visit last weekend I ordered a couple slices and was shocked to see how bad the quality has become. Flavorless pizza on a cheap dough and low quality ingredients. I gotta tell ya, I know this is a late night stop in old town but, you're better off stopping at a grocery store on the way home and grabbing a pizza from the frozen section.   It's a shame that \"NY\" is even a part of the name of this business because it couldn't be further from the truth.",
    "rating": 1,
    "rated": {
      "funny": 11,
      "useful": 24,
      "cool": 10
    },
    "photos": [],
    "user_id": "7IV3JXTXufasWNSkDEdrcQ"
  },
  "_HnL55rRIOAZoHFppVzDwA": {
    "date": "3/17/2019",
    "text": "Horrible Pizza.  Only the drunks coming out of the clubs go here.  Never again. It tasted like cardboard. Are you kidding me?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mZz5nZHG9hzzQVh3BXKGPA"
  },
  "w8qV8J8OsZxCSFV3p56rmw": {
    "date": "8/29/2019",
    "text": "Excellent Pizza!  Hot and Fast! Love the Pepperoni Pizza. House Salad was Excellent also. My Friend had the Philly Steak--- Excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1rdzOOHwYRsQkU4Bag2jtw"
  },
  "QjPACiX7wjIE5946a37-aA": {
    "date": "3/28/2016",
    "text": "Late night we ordered pepperoni Sicilian pizza and it was very good. My husband doesn't like a whole lot of crust but I don't even think he noticed since it was simply delicious. It took them about 30 minutes to deliver but after a certain time you can only order a 20 inch pizza which was obviously a bit much for just the two of us. I understand since they probably don't want to be running pizza slices all over Scottsdale for intoxicated individuals. All in all, very good pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "LrwvXGiGPAg7mEAppVW-dQ"
  },
  "tVDNOE1c0sYYMhV_JXq6Tw": {
    "date": "8/15/2015",
    "text": "So I stayed at the Doubletree resort and was looking for a pizza place that delivered and found this place. When it was delivered I wasn't that impressed with what it looked like but when I ate it I was highly impressed. The pizza was delicious and I was very happy. I don't live on this side of town but if I come back I will definitely come back to this pizza place. Absolutely delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z7bVH9Ewh2abFOJiA1A73Q"
  },
  "qShp4ICf-WYRQgWnfvjI9Q": {
    "date": "6/14/2015",
    "text": "Give it up for the pizza on the Horseshoe! It is a battle between Joe's and Gus'. Both good in my opinion.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1DsuFRjdW0gDA23Xswzoqg"
  },
  "_9R5nyHbiJooUn_g1tfDpg": {
    "date": "9/20/2014",
    "text": "Wow! Just moved here and ordered a pizza based on the photo's and reviews. It was better than I expected, normally delivery isn't that great.  I have lived back East and yes, they nailed it! I got a medium pizza with eggplant (done correctly), sausage, peppers, olives and garlic.  I found out the owners are from New Jersey and they managed to duplicate an East coast pizza in Arizona! Thanks for bringing back memories.  Best pizza in the valley!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "AHkR5wkS0T8S_LoZpnkjoA"
  },
  "5WnmX6cZb9qUFwyAOck_4w": {
    "date": "6/30/2014",
    "text": "When I was a kid, I absolutely hated pizza (and donuts, what).  However, somewhere within the last few years, that has completely changed and I will now crawl 3 blocks in the middle of summer, around Club Jersey Shore to get a slice of pizza here.   I've never been to New York but the level of friendless from the staff here is a good indication that this place is probably legit.    That being said, you can guess how great the pizza is if that doesn't deter me from shamelessly shoving two slices down my throat while still sweating from my walk to the restaurant.  Honestly, the pizza is amazing and it doesn't sit like a rock in your stomach after you inhale it (which you will, go for the pepperoni).  Plus, I'm serious about Club Jersey Shore, there were less neon shirts in the 90's than the club rats were wearing that gravitated towards this tribute to douchery.  Joe's New York Pizza: Dinner and a Show.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "p49hy3tbO8p_4Wj938o_cA"
  },
  "0umUpeKQR8cmWHdGrY1Yeg": {
    "date": "2/6/2015",
    "text": "Best pizza you'll find in Arizona. I'm from New York City and this pizza spot gets two thumbs up from me. The style is as close as you're going to get to NY pizza in AZ. The sicilian slices are amazing and really filling, make sure you ask them to make it fresh, it's worth the 10 minute wait. They have a nice selection of sodas, including my favorites root beer and cream soda. My boss and a coworker of mine told me about this place and I'm glad they did. The owner was really nice, I believe her name was Lori and I think she's from Brooklyn. She was so happy to see another New Yorker that she gave me and my girlfriend a couple of free slices along with some sodas. That was really cool of her. Actually the truth is we came here the night before and had a horrible experience. We were served old, bland tasting slices of pizza with no flavor or tomato sauce and the next day I ended up calling and asked to speak to the owner or manager and the lady who picked up said that that was her. I told her about my experience and she said that she was sorry about what happened and that she fired the worker who made those slices. she said he was on his way out anyway and probably messed up the slices on purpose out of spite, which does seem like something someone might do in that situation I guess. She told me to come in and she would show me how her pizza really tastes like. I decided to give the place a second chance and I'm really glad that I did. Everything we ordered she gave to us on the house and it tasted so much better the second time around. The pizza was fresh and had a good flavor to it. She said she wasn't in the previous night and that I would have never had a bad experience had she been there the first night I went. I think I believe her. She was so nice! If you've ever had a bad experience at this restaurant, speak with Lori. She will show just how good their food actually is. I like how they have two good sized televisions with whatever the best sports game at the moment is playing and hip hop music from new york playing in the backround. A chill spot, where you can eat good pizza and enjoy some beer as well. Most pizza restaurants with \"New York\" in their name in Arizona are just using the name as a gimmick and don't really sell NY pizza. This one actually does sell authentic NY pizza. The slices could use a little more salt and olive oil, but it's still pretty darn good. That would just make it perfect if they did that. I recommend this place to everyone. Thanks Lori for the awesome hospitality and the great food you serve at your restaurant. I dig this restaurant and will definently be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qHmL2HfdATYKB-GiEg3sAw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. I love the sicilian slices here. Ask them to make it fresh  It&amp;#39;s worth the 10 minute wait. Sooooo good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qHmL2HfdATYKB-GiEg3sAw/o.jpg"
      }
    ],
    "user_id": "aeuo-PdHqd4IQSoH-Kueyg"
  },
  "KG6HWD9Np4so1sUP5iGWFQ": {
    "date": "10/7/2017",
    "text": "Literal worst pizza place in Scottsdale. Delivery was 15 minutes late, bad customer service and most disgusting soggy pizza.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "efAZqx4tJPqczKaP-xkFqw"
  },
  "xcDoqQtk5XtBcgYAWV8UrQ": {
    "date": "7/7/2017",
    "text": "I honestly don't know what is better, the food or the service! The 1st time I stopped in the friendly young lady at the front counter not only actually listened to my question she gave me a recommendation, I followed her advice and had 1 of the best calzones I've had in years! On my next visit my son and I ended up getting pizza and we BOTH loved it! All I can say is I'll be sure to get back as soon and as often as possible, definitely a great meal at a fair price!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BqDRxqWyB3mMpJw9oax35Q"
  },
  "qapIVdsPEltZ3TEOrzq03Q": {
    "date": "6/27/2015",
    "text": "Ahhhh yes...Joe's.  It's the classic \"eat me because you're drunk and need a cheap meal\" pizza. Cheap and reliable...tasty AND greasy enough to do the job. If you've been gettin inebriated and twerking your heart out in Old Town...you've been to Joe's.   Not a bad spot for a quick lunch either...on your cheat day of course.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s1AbuVOlBXD0_QTyk0B3jw"
  },
  "WCbepxk_Nf4llKRsX0Bl0g": {
    "date": "2/2/2016",
    "text": "Thanks for messing up my order and charging me $30 for two crappy subs I didn't even order, and the only reason I didn't return the subs is because it was 1am and I just wanted to go home. Your staff is a train-wreck and it really showed when the pressure was put on them.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "fPn1we4lJucrtZ-9Gjjbcg"
  },
  "BQhZOd6p5wdWXQQj4j9xeg": {
    "date": "9/16/2016",
    "text": "OK they are making the Sicilian again but what happened to the meatball & mushroom????? The new owners Need some help do let them know and they will be back on top again!!just ask and they will make it for you! OH yeah don't forget the Chicken parm or the meatball parm and the Sicilian it only takes 10 minutes while your eating the regular slice@",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "56Pr0F2OhnF7nS38l1ezlQ"
  },
  "mZMUc9JjVWU0rGR89CwfAw": {
    "date": "9/11/2016",
    "text": "Decent pizza for sure - we were in town from NY and this hit the spot!  The place was friendly and we would recommend for your pizza fix.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jDsEHhNU4EdYK5qjUl94cQ"
  },
  "uAYSw57zBZ5Zr-J2SRk49A": {
    "date": "6/6/2016",
    "text": "Worst service ever pizza never arrived. Don't order here. Waited for more than one and half hour. The lady on the phone was so rude she even hang up the phone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KEzw-AGB_rPMrna0Qfaqog"
  },
  "w9nLEetKgRKEJPHRTaqBMQ": {
    "date": "12/28/2014",
    "text": "We arrived at Scottsdale resort and conference center after midnight starving after traveling cross country.  This place is open until 4am and delivered a nice large thin crust sausage pizza with extra cheese in about 30 min.  Considering that this is not NYC or Chicago, the pizza was very satisfying and reasonably priced.  Tasty thin crust pizza from a delivery place that opens very late to satisfy post midnight cravings.  Hit the spot.  Would order again. Not gourmet or artisanal pizza but very tasty and satisfying.  Much better than dominos or papa johns or similar chains.  Would give 3.5 stars for late night/early morning opening and delivery.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "45S7FvfWLJNbyuAVIQqAAg"
  },
  "6p3mNh3-PZjP5ZrNUQz5XA": {
    "date": "4/30/2016",
    "text": "This review comes a bit late but two Sunday's ago we ordered a large pizza at 9:45pm and were told it would arrive in about 45 minutes. A little over an hour later we called back to get an update and were told the pizza was still at the shop. It finally arrived TWO hours after ordering and was completely soggy and grease-soaked. I was honestly shocked they could even charge someone for such poor quality and service. Quite a disappointment as this is one of the few spots in Scottsdale that we actually liked ordering from.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OHK9t0Vb2oorOO7Id4Mx2w"
  },
  "cepvO_E3umRQbS7sXzcATg": {
    "date": "3/26/2016",
    "text": "After waiting 1.5 hrs we called to check on our order. They hadn't even made it yet! I asked if they would be delivering it for free and they offered a %25 discount. Cancelled order.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VYZuTE-Ypq_UDBE2bLjAAQ"
  },
  "DeOWHnCSnh-p1JbrSeAiLg": {
    "date": "8/27/2016",
    "text": "Pizza is alright, I've been ordering from this place for a bit over a year and it's good that they deliver less then the time they actually give you. It's a good place if you want pizza at 3:00 am after clubbing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rzWb62Ujrw8xwPkV0Yi37g"
  },
  "Em_uaAOc53y5kqxnzmV2Uw": {
    "date": "2/8/2016",
    "text": "Horrible customer service.  I came in to pick up a pizza; they'd made the wrong one, but that wasn't the issue.  When I asked that their mistake be reflected in the final price of the order (i.e., that they'd give me a discount for screwing up), I was brought a manager, who very coldly and rudely told me he would not give me any amount off at all.  I should not have had to argue with him about it.  I didn't even get an apology.    To boot, the pizza was quite subpar, very dry.  I used to like this place - the people who worked here were friendly, and the pizza was quite good.  A shame it's gone downhill.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aTTlmzuj_OqutR84pl8amQ"
  },
  "9HXQpBotP26aAeNz2xCXDw": {
    "date": "5/16/2016",
    "text": "Ordered delivery today. It was 20 min early and delicious and hot! I only got mozzarella sticks and a meatball sub but there were big meatballs, plenty of sauce and cheese. Fantastic! I've had the pizza here before as well and its thin and extremely tasty. It truly is like NY street pizza. Love it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OvYN86BmZyP87SaTO7mHkQ"
  },
  "iI9AHdaBx4Op3RWT1SIt2A": {
    "date": "9/16/2014",
    "text": "The best delivery ever!! Not only a pizza for after a night out and you're craving some, it is a great option for anytime.   Get the pepperoni thin crust and garlic bites!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YZ1fToD3X1x4aERvhNzm2Q"
  },
  "JmIbRvRuuB5BXS24p5eWeg": {
    "date": "5/24/2012",
    "text": "One of my favorite places, open until 4 am good food always on time and great staff... #1 with the Days Inn",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_C5srUvWG4iL6j-2n0lqYQ"
  },
  "H9Kuq3QQhkADBaGkG8pmUA": {
    "date": "10/21/2009",
    "text": "3.5 stars!  I'm all about instant gratification, especially with food. I had tussled with another Scottsdale business who insisted delivery could take up to 40 minutes...for a sandwich and went on to option B, Joe's NY Pizza. The woman who answered the phone was great, didn't put me on hold endlessly, answered my questions and told me I could get my lunch in less than 20 mins. Good news, because I was STARVING (as in hadn't eaten for 5 hours).   Joe's doesn't charge a minimum for delivery, another relief so I ordered the greek salad and 1 slice of pizza with spinach. Delivery was quick and friendly, and my food was just what I expected from a pizza place. My pizza was a big juicy slice (not as big as a real NY slice but those things are ENORMOUS) with plenty of chopped spinach, a nice red sauce and a light coating of cheese. Entirely foldable, entirely into my belly. YUM.   The greek salad was okay - good price for the size of the salad, small chopped onion and black olive, a decent sprinkle of feta cheese. The only downside was the iceberg lettuce. I wonder if Joe's would consider a $1.50 supplement charge to use mixed greens. Because I would happily pay extra for some red leaf/arugula/mesclun blend. But it was fine as cheap salads go and filled me up.   If I need quick cheap delivery for lunch again, I will definitely call Joe's.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "rzq5nqG2NG13o3ISxJSrsQ"
  },
  "DY8Ju9lPzLe30gB5NP2Cfg": {
    "date": "7/13/2008",
    "text": "I was sober when I ordered and ate this pizza. It seems like I might be in the minority of their customer base here.  I called up to order delivery and they were super nice. I ordered a small pie & a Caesar salad. Clogged arteries anyone? The nice chic on the phone finished taking my order and told me the pizza would be here in 45 minutes. Then it arrived in only 30 minutes! Thank you!  The pizza was decent. It was a little too greasy, and the crust was a little too thick for me, but it did the job. The Caesar was good, nothing special, but good.   I wouldn't eat here all the time, but if you need some decent pizza to soak up the alcohol in your system this is probably the going to do the trick.",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "iL_CR-WQnveqrff9LecqAQ"
  },
  "jclLoQLbDlDXZ_N_cKkW2A": {
    "date": "5/16/2009",
    "text": "I'm not sure what happened but this place went downhill fast!! Ordered a pizza last night with sausage, cheese and fresh basil.. the baked the fucking basil so it turned black and nasty.. the sausage tasted like it was on the verge of spoiling, very gamy!! Plus the older woman behind the counter was not pleasant at all.. where is the old man, I miss his surly service and his killer pies!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "p_azadim_uWFOXAhhKB3ag"
  },
  "HrEErheBSl_LgZ3FQuU3XQ": {
    "date": "4/21/2012",
    "text": "Best of Phoenix. They just get it. Crispy crust that stands up to gravity on one side, and is soft and chewy on the other. Melty mozz, and sauce that is not too sweet. Open late, and they even threatened to deliver all the way to North Phoenix on a slow night. Too bad for me there aren't any slow nights. Eat it.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "U-TB3j6X8DU6_YiCCnbuFw"
  },
  "ph-TIivgTf3SSycQbKi1CA": {
    "date": "6/29/2008",
    "text": "Joe's is awesome. It's best as a late night munch after a night of clubbing and drinking and scamming (or whatever you do in that area), but they also deliver during the day. I have eaten at Joe's many times late at night, but today we had it delivered and thought I should finally review it. A full fresh pie is a little different from ordering a reheated slice at the counter, right?  The pizza is good for NY style. Nice flavors and decent ingredients. You get a lot of pizza for the money... particularly if you pick it up yourself - but 20 bucks delivered for an 18 inch one topping (including tip) isn't bad.   They were pretty nice when I called in my order which can be a bit of a contrast to the experience you get when you show up in person at 2am, but how else would they be expected to handle a line of hungry drunk clubtards going out the door? I was told 30 minutes (which would've been nice), but it took closer to an hour. I've worked pizza delivery when I was a kid and that kind of thing is understandable. No big deal. Now, if it happens every time I order from them, I might start to get bummed.  The pizza here isn't quite 5 star to me, but it's close.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "oaaEXgQ3x51cXE3GTXrT1Q"
  },
  "sLX-qcJ2Wp1jc1OB_zf35w": {
    "date": "9/22/2009",
    "text": "I want some pizza. New York Style, thin crust. Because lets be honest, is there really any other kind? No, I don't want effing truffles on it...no micro-greens on a white pizza...no God Damn organically harvested arugula or duck confit by the whole wheat slice....today I just want a slice of Pizza.  Joe's New York Pizza.  Cheesy fold out tables? Yeah. NYC propaganda plastering the walls? Oh yeah. Do they serve yoohoo and snapple out of a coke fridge? Hells yeah...(do you have any idea how long its been since i've even SEEN a snapple?) The occasional fly? sure. The gray haired mafioso looking guy sitting outside in a suit reading the paper in 108 degree weather. Check.   Pizza's ready; Greasy? Perfectly! Check the bottom real quick, does it have that ever so telling little black char from where all the great pies before it left there charred remnants in that ovens bottom? Yeah...very nice. Smells great, sauce is flavorful. Moment of truth....does it fold? Yeah, crust snaps into place, slice perfectly folded in half...greasy pizza juice running down my hand, and yeah...this is the God Damn Pizza i've been craving.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "-e1MNYTaojMrCxHcaMWfkA"
  },
  "HW7t18Is67QLUv27ummblw": {
    "date": "12/7/2015",
    "text": "If I could give them no stars, I would.  I've ordered from this place before, and, other than a few mishaps, ud's been okay.  Tonight, though, I've been working in some projects, and u got hungry and decided to order, which ended up being a big mistake.  I ordered spaghetti with meat sauce and Coke.  The meal is supposed to come with a small salad and garlic bread.  On the online order site, there's a place for special directions.  As usual, I wrote for the driver to please call when here, to NOT knock because it sets the dogs off, and even thanked them.  The order was supposed take 45 minutes to an hour, but, about 25 minutes later, there's a knock at my door and, of course, it sets the dogs off, and while I'm trying to separate them, I get bitten, and good.  All I got from the delivery guy was a quick \"sorry\" and, can you please sign here, even as my hand was dripping blood.  I even tipped the guy.  Then, I call to tell a manager what happened, and find out there's not a manager there.  The woman takes my number, and says she'll have somebody call me.  So, after cleaning the wounds the besti can and dressing them, I figure I'll at least go ahead and eat.  Why not?  I paid for it, right?  Guess what?  No salad.  So, again, I called back, got a guy who I had a difficult time understanding, who now says he's the manager.  He kept asking me, \"What do you want me to do for you?\"  He asked if they should come back and get the order or if they should bring me a new order, never addressing the bites fully.  He tells me that he asked the delivery driver who, I might add, has the same accent, and he says he was sorry.  I asked him what he thought he should do for me, and he wouldn't answer.  I hung up.  I will never, ever order from here again, and post this story everywhere I can.  I'm also contacting a lawyer...  Why have the question about special directions, if nobody's going to read them.  I'm think g this is neglect...  And I'm calling a lawyer.  Pay attention next time, and provide a little customer service every-once-in-awhile..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yWKataPu7ruUQzx6dZFEig"
  },
  "JcVO7svHcZDnk0498lGOlw": {
    "date": "6/25/2012",
    "text": "It's decent.  We had thin crust.  I'm not sure if there were any other types of crust.  It's cheap at $3 a slice.  It's pretty small inside and usually there's a line out the door.  However, the line goes fast.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "za7XkZ1JglooEHMtJbSrnA"
  },
  "n9bibdEMcUWI6xH-Y-8Ntw": {
    "date": "12/20/2012",
    "text": "Not the best place. Sure, it's good for a quick bite for those who aren't too selective, but you can find much better pizza elsewhere. The pizza just isn't that impressive. Too greasy, and pretty bland, to be honest. It wasn't terrible, but I regretted ordering from this restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOf3OwlGHbj3gAP96rZ0RQ"
  },
  "dI0k_1u-pBaW8LfO5--V_A": {
    "date": "8/20/2007",
    "text": "You know the Soup Nazi, now meet Joe, the Pizza Nazi.    Dude, it was your choice to open a pizza joint in the middle of the second most pretentious city known to man and keep it open til the wee hours of the night, not mine.  Learn some tolerance.    Get drunk enough to ignore Joe before you get in there (which most people do without realizing it anyway) and stumble into Joe's after the bar.  Its open late and has the best pizza in town.    Thin, huge slices with all the regular fixin's...  Oh and garlic bread knots with ranch and marinara.  Its all ready to go so theres not a wait once you actually get in there...and what line there is outside usually moves pretty fast.    I have no idea what the prices are because I'm either too drunk to notice or the chach in front of me didnt realize that he just paid for mine.  You taking notes here?    Just remember to keep your orders to the point and be polite when you get to the front of the line....they may not let you use the bathroom (and you know you'll have to go) if you dont.  :)",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Df2qZ03Mjgl1NqprgWXcgA"
  },
  "p6WJeQ2y5UCuTjUJFN7M5Q": {
    "date": "2/27/2016",
    "text": "the pizza was good. it ended there. the owner was rude and disrespectful and called me and my friend a c*unt. Would NOT give someone like that my money",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-N3swKyvBF43Za6GbzwShQ"
  },
  "jz_2I9TlRRHyG8POWf3yWg": {
    "date": "11/8/2013",
    "text": "Check them out on Ch 5's Dirty Dining 11/7/13. You be the judge.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "z-tRwa4_MccIY6TqeXDyUg"
  },
  "KiEwN1J1ulGQddGnqapilA": {
    "date": "8/10/2009",
    "text": "I am so blessed to have this place near my house.  It's the first thing we ate while we were moving in and it's going to be in our lives for a long time to come.  First off, it's pretty expensive for pizza but it's worth it.  A large pie is huge and for a big guy like me, 2 slices is all I can eat.  A combo pizza will run you $20.  The sandwiches are cheap and delicious.  The wings are decent, but not great.  Maybe they taste better when you eat inside.  We always get delivery.  I love alot of things about NYC.  The 2 most important things (besides my sister) are pizza and bagels.  I am happy Joe's NY covers the pizza side.  Oh and they deliver LAAAAATE Thurs-Sun.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rBh0lVsx7BOehAhM5ga0UQ"
  },
  "yjuApK3lbwoYisIid7KbQQ": {
    "date": "12/12/2008",
    "text": "if I could give this place another 1/2 star I would.  Late night after the clubs it is definitely good.  Reminds me so much of the NJ shore in the summer time when the bars close and their is the late night pizza rush.  It is quite site.  It definitely has a NY pizza feel to it to with the look.  Pizza is quite tasty and after the bars it is just about perfect.  2am...  Bar is closed...   I will be coming for you NY Joe.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mrEoKZsYtSgMJsIuLr_oTg"
  },
  "NsuC1AO0mY3_NpnIv6oqcQ": {
    "date": "8/12/2009",
    "text": "Anyone who is familiar with the night scene in Scottsdale, has stumbled their way to this pizza joint at some place or another after the bars have let out. The pizza is greasy and tasty but definitely the cure to sober up and line the stomach with something solid after a 'rough' night.   The lady whom works there is a doll, very sweet and always in a great mood, despite having to deal with all the ridiculously sloppy drunk individuals there at the late hours.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "PRDGKuJaTKyABTUGRATJsQ"
  },
  "0tYHPVlU-mtFL6pFP_10hw": {
    "date": "3/18/2012",
    "text": "Best pizza in town, by far. Been crushing this pizza since day it opened. Eating in the way to go. Unfortunately the delivery guys always seem to forget the Parmesan cheese or some other side. If they could get that in check and you knew you where getting a hot pizza w/everything you ordered 5 stars!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ByG4gyyH-9vKHhJLOZKfw"
  },
  "hCLodldn1yKcrFpTflxcAQ": {
    "date": "4/20/2009",
    "text": "I feel like I should WUI (write under the influence) since that's when I usually eat at Joe's, but I'll spare you all the hassle of having to decipher my drunken stupor.   Joe's is my go-to-place while out in Old Town. My routine is to leave the club around 1am, but not w/o getting a stamp for re-entry, stop in for a slice before a line forms, then return to the club for last call.  They have serveral types of pizza available for re-heating. I like the basil and tomato with no sauce. It has just the right amount of cheese and the crust is slightly crispy yet chewy.   I should try it sober one day. Hopefully I'll enjoy it just as much!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OyLtK_Q2I4Jw0rtfFnLfhg"
  },
  "j_kYF2f_Sh3ydOgMTQGBkA": {
    "date": "1/23/2013",
    "text": "I LOVE IT, I LOVE IT, I LOVE IT!!!  I was born and raised in New York City and I know New York style pizza.  This place brings my taste buds home every time I eat there.  I have been going to Joe's for years and love the pizza there.    Sad to say I have never tried anything else from the menu.  I know they have sandwiches and pastas and stuff but when I find something I like, I stick with it.  If you want a slice of heaven....Then go to Joe's",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-DhCvWId_XNjvR5TbbHqIA"
  },
  "CzK_UHHo0B-q31efOJU-Ew": {
    "date": "4/9/2012",
    "text": "One of the BEST places to get real pizza & the Sicilian pizza is to die for.  What's missing? Real N.Y. Italian Ices & I don't mean gelato!,,,,,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aP-G8N_2eRKjhXzwEkbYEw"
  },
  "7QGbABOXLH_CJ9BIDcFcaw": {
    "date": "8/12/2016",
    "text": "Great pizza, perfect style. Crust was awesome. The driver/delivery guy was pleasant and kind  I just moved from California and very much enjoyed the food and experience. Thanks",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CyXYCv8L2EMCzJzFNPcSaA"
  },
  "ICkVie9azhGdbpZoN7gYzw": {
    "date": "7/22/2016",
    "text": "I can't give it any less than 5 stars because I've probably eaten here a hundred times. It's always good, consistent, fast, inexpensive, and comes with the right amount of grease like a real NY slice should. One time I let myself get a little crazy and tried the Hawaiian pizza (which normally I'd say is blasphemous and downright farce in a sense... I don't recall so it must have been good. The one big miss is that they're obviously Yankee fans, and I'm from the Mets camp.  Just kidding, anything other than the Cubs are OK in my book. Thank god this isn't a Chicago \"pizza\" joint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c-6BxVV8_LDt5-pWlH7SPQ"
  },
  "Uxs2DNpHk5Er63N_p3LwvQ": {
    "date": "3/21/2016",
    "text": "BEST PIZZA IN OLD TOWN Bar District!  Been coming here since the original owner Lori owed. I was initially sad to hear she was moving back to NYC and was curious what was gonna happen to the place.   The new owner's are amazing. They took my constructive criticism and made adjustments accordingly to get the pizza exactly how it was before! If you like a crispy bottom this is the place to go. None of the soggy bottom toppings falling off on first bite etc. Don't be fooled by Gus' Pizza down the way. This isn't a chain which in my opinion makes it better on its own. There's a line for a reason.... IT'S WORTH THE WAIT!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "bZ5cRgpXHI7rwbnDgzZMjA"
  },
  "uHGS9Tl71WrO7syWT7kgPg": {
    "date": "3/24/2017",
    "text": "ORDER DOMINOS PIZZA!!!!! Owner is a east coast douche with no customer service skills whatsoever. It took over a hour to deliver a pepperoni pizza. When I told him I was disappointed in the delivery time, he tried to lie. This business will fail soon and go belly up. I wish I could put a negative star.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nCiQ9VFIxdBMXAFzDvhg1w"
  },
  "iAZOTamHhXJNIZ3mXPZzBQ": {
    "date": "3/10/2016",
    "text": "I wish I could leave more stars.  I just can't.  I'm not sure if it's because I'm jaded from real NY or NJ pizza but this place is average at best.  I could live with average if I'm starving.  But the delivery is late EVERY single time.  And then my average pizza is simply cold, late average pizza.  And that's just not worth the $$ when your starving.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "pkJmTC0NbdWV00Sf1JUD_Q"
  },
  "3MdbSIj_Fi5KWXHisS64UQ": {
    "date": "10/15/2017",
    "text": "Really last resort for pizza delivery. The food is sometimes okay, but quality and service is really bad when they are busy. I've received one really good pizza, then another time one that doesn't taste great and makes me feel sick.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S0e7zMTvsSJjwzqlBIyTZg"
  },
  "3-_PxqFvz9V8qu0x10d9Ww": {
    "date": "3/27/2017",
    "text": "So, this place is within walking distance from my job. I come here often. i am not biased just because it is close... because i felt like trying their competitor basically next door and there pizza SUCKED! . I love that i can just walk into joe's and get a slice. The pizza is consistent always baked to a T and its really a bang for your buck especially during the lunch special. I strongly recommend coming here especially when your bar hopping! Or, if your just a local looking for a quick bite for lunch OR dinner. Please GO! you wont regret it!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zDneSCMltGVAO6ZG65G0hg"
  },
  "u3ZcWDmBa5zolCZX01hMSw": {
    "date": "4/19/2017",
    "text": "My favorite pizza place in the Phoenix Metro area. Open late and sooo delicious. If I'm going to eat pizza, I refuse to go anywhere else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mtzIK0Uc-fqcWUvjNnqHKg"
  },
  "t7PB5w65Ij7a_cj3padEcg": {
    "date": "10/8/2017",
    "text": "Ordered pizza last night. By the time it arrived (about 10 minutes late) it wasn't even remotely warm and it was super soggy. I have eaten here multiple times and it has never been a problem before. Glen was very kind and took care of the issue after my complaint.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "abhCi3Rs7eVD93jRxIA0rg"
  },
  "EszAJ5L_J9TovTMsWVUw9Q": {
    "date": "10/24/2017",
    "text": "It's the best pizza place in old town on weekend after clubbing good food good service clean place  Definitely I recommend it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BF868AbCS3qwNmL_EHowZQ"
  },
  "pD5fts_5Pi4n4eEHN2pRzQ": {
    "date": "7/24/2017",
    "text": "I ordered a bag of chips with my pizza.. when I got home I noticed the bag was not fully sealed. The chips were stale from being open. EW",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eCQlDWhF2TlGdvu4qtoc2Q"
  },
  "j5uKuEoCQBKEwPxZ7eKdEA": {
    "date": "1/23/2016",
    "text": "Used this local pizza place for delivery to our hotel.  The delivery was made within the time frame promised.  The quality of the food was good and the portions were generous in size.  The delivered right to our hotel door so we didn't have to go down late to the lobby.    The price was fair for what we ordered (3 stromboli, wings and cheese sticks).  Delivery person was professional and courteous.  If/when we are in Phoenix again and need pizza delivery in the Scottsdale area I would consider using them again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "ch548SKWM111sWXCaaiWkA"
  },
  "p4aXCMhf7DQ5T125SHPUww": {
    "date": "6/6/2017",
    "text": "$18 for a cheese pizza is a bit much for me. It wasn't even that good. The crust was thin, which isn't NY style pizza. Lastly, the people working were very rude. I wont go again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a0UOSlLYd5U1ivSwhuITeA"
  },
  "rve-Ii9LNNAAz5Iqa5O3HQ": {
    "date": "2/19/2018",
    "text": "I am not impressed and my food hasn't even arrived! My office put in an order a few days in advance and after the delivery was already late, I called to check in on where it was. The lady who picked up was NOT apologetic AT ALL and admitted that they hadn't even finished making our order yet. They should really plan accordingly, especially when orders are made in advance.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L9MeO-brUzyYd0YOQTDyrw"
  },
  "vC9IwVvqv-ksDJq_epbL-Q": {
    "date": "6/8/2017",
    "text": "I think their pizza is one of the best in the scottsdale area if your really looking for that thin crust. Great flavor good toppings however, I didn't really appreciate the price from going to 18$ for a large meatball pizza to 23$... never will understand the high price jump and there is really no valuable explanation for it so therefore my family and I won't be coming back for a very long time. Sorry",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TzuvXu6cDr8Qdryt323NOQ"
  },
  "tIqW_-XQt_0x4_nE_A93_A": {
    "date": "4/26/2015",
    "text": "Was hungry wanted a quick bite thought it looked ok on yelp. .regular slice was ok..the Sicilian was on point. I'm from Jersey and the dough was right....and that's the hardest part....light tasty  and good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RHlnx0StfZXugt_L_dFeDw",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Sicilian",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RHlnx0StfZXugt_L_dFeDw/o.jpg"
      },
      {
        "img_id": "8iWLcverbNBfiXszHMLKrQ",
        "caption": "Photo of Joe's New York Pizza - Scottsdale, AZ, United States. Pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8iWLcverbNBfiXszHMLKrQ/o.jpg"
      }
    ],
    "user_id": "cZmfoOnhbRtmFmDxpM8waA"
  },
  "FlFWdVBR_nS56_OX5YuuzQ": {
    "date": "10/22/2017",
    "text": "I'm from the East. This pizza is dry and tasteless, cheese taste is low quality. The dough tastes like bisquick base to cut cost. Sauce is watered down. What really floors me..... is they have the Gaul to ask for $3.50 a slice and it is no bigger than a slice of dominoes pizza maybe even smaller, you legit need 3 Slices to make 1 real slice. This place used to be good back 4-5 yrs ago, but they now are doing the public a disservice with a very poor quality product for a premium price. They should just close their doors. How do they sleep at night stealing from their customers. Please just go anywhere but here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8Pd_X9uCt898mjQR5ySWQ"
  },
  "vWHvUtbX9XGlsIXopxPW8w": {
    "date": "3/17/2016",
    "text": "I feel like I need to defend Joe's because of the many great times getting pizza from them.  I'm a New Yorker to the bone and this place looks like an NY Pizzeria that you get slices in or order a regular or pie with toppings. Like most places they have their pizza around $3 to $4 per slice which at this point is the going rate in most of the country.    Order slices of pizza here, they will put it in the oven and take it out when it's hot. Then you pay. It's pretty simple concept.  Yes they have salads and sandwiches which I have never had but understand their specialty is delicious pizza by the slice.  If you really want a salad you should go somewhere else.    I have gotten delivery once during the day and the pizza was great and quickly delivered.  But those of you ordering drunk food after midnight I just don't know what you expect. Where else around Old Town is open past the bars?  If you're mad about the price ask about it before you agree on ordering the food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "p_VVnG6qZfO2frGSIzURLA"
  },
  "pD50nsXAazNTGVNcjJOIjw": {
    "date": "3/23/2018",
    "text": "All negative reviews are True!!! I'd strongly suggest going somewhere else for pizza!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tj3wlO4913hoMufB52L1tw"
  },
  "UZWSesQdROpuyN-wXQWOug": {
    "date": "4/6/2017",
    "text": "Even when you're not intoxicated this pizza is amazing. I'm a ranch connoisseur and I give their ranch five stars",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yvZF15KH-qRwFZqe1jCrww"
  },
  "74_natilnDdDhFexRPV6XA": {
    "date": "11/16/2017",
    "text": "Visiting Scottsdale from Indianapolis, Indiana, and I was looking for some good pizza late at night. This restaurant is open until 4:00 a.m. and serves pizza by the slice. I got a slice of cheese pizza, and my husband got a slice of pepperoni and sausage pizza. We both loved the pizza and glad we tried it!  We will definitely return when we come back to Arizona!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OgaxsymED9T23aZobMNOoA"
  },
  "Jp0XL8BnxN1vVcQHTheREg": {
    "date": "2/3/2018",
    "text": "I have never ever had a pizza so bad. If I had defocated in a sock stuck it in the freezer and served it to my mother and grandmother I would have been less disgusted than I am with myself for having half a slice of this. I feel violated for just being here once. The choice between even considering eating here again and spending the rest of my life in a Serbian prison listening to Justin Bieber 24/7 you better believe Despacito will be on the decks before you can say \"Joes Ny Pizza is a disgrace to all culinary endeavours\".  I would like to add that I downloaded Yelp just to give this place a review",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EYf5Cd6W3N0E7NkdFGIHlw"
  },
  "0GnqYhaIthxDm-SpKROtcg": {
    "date": "2/3/2018",
    "text": "Worst service we've ever had. 2 fucking hours waiting for a pizza, called 3 times, and they delivered a cold pizza. Kept saying it was on its way. Don't order from here, ever.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C13lNzQz-Z4EGXp15fURgg"
  },
  "P0bxQuZJPJXyPy0WI4Bjcw": {
    "date": "8/16/2018",
    "text": "We were looking for a quick bite in the area before an event, and Joe's was our choice. The premade pizza was tasty. We had the Buffalo Spicy Chicken and the Pesto Chicken, and both were very good. We like the thin crust, both easy to eat and lighter. We plan to return on a future venue in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ov_s6bRum0PvUhP1CRugyg"
  },
  "qTx_VRJ1n4GtnECa0fq9Cw": {
    "date": "1/27/2018",
    "text": "This is my favorite pizza !!!  They have pizza with meatball slices.  How New York.  I can't buy a pie without eating the whole thing.  Which is why I have to do major situps!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jgRPAoVouwFaiGS9O3T-EA"
  },
  "OoY73CSl9yGyDUgvSHbQSQ": {
    "date": "3/12/2017",
    "text": "The pizza was really good with a nice thin crust.  They deliver and are open until 4am.  You can't really beat that!  Nice midnight snack.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K98-1Gxl_fLSXS2WyENJYQ"
  },
  "r1fGMGlmpMJA2BVePY3EJQ": {
    "date": "2/8/2018",
    "text": "Joe's is the best place to get pizza in Arizona. It always leaves me satisfied and smiling.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XvMGgosX2YlJPtPfUIclGg"
  },
  "6IEwNPFtmALMBHJaz3akyQ": {
    "date": "7/28/2016",
    "text": "I'm late to the party- as it's taken me forever to try this place. I've long heard that this is where all the Old Town drunks show up after a night of shenanigans, and try and soak up the booze with this pizza.   Joe's is a small spot, with lots of easy street parking. I popped in for lunch and they have numerous pizzas out for you to choose your slices from. Once you pick what you want they pop it in the oven for a quick reheat.   The staff is super friendly and seem relieved to have customers who are sober for a change. I cannot imagine the shit show that is Fri/Sat nights after the bars close. Yikes.   Moving on, the pizza was surprisingly good. Very fresh and you can taste the quality ingredients. I was pleasantly surprised with how good it was.   So when you need a quick lunch- check out Joe's. If you're there after getting hammered- pull yourself together and try and adult better. The staff there doesn't need your bullshit.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 6,
      "cool": 6
    },
    "photos": [],
    "user_id": "WJKocp9RE0KatUwh3_DkGg"
  },
  "Pv05GiMe9XGuNZqauRgDLA": {
    "date": "12/4/2017",
    "text": "Joe's New York Pizza its an awesome place!!! Every time I've gone there for a slice or a full pie, it's been a great experience! The staff has always been very welcoming, friendly and helpful with the menu choices!  Keep it up Joe's New York Pizza, you have a loyal costumer for as long as I eat  !!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sWjhhJwS0i2LaSu-43UuQw"
  },
  "YSfY1hzWq1wXM2GX0O8IsQ": {
    "date": "9/5/2016",
    "text": "Let me say it was late on a Saturday and didn't feel like paying for parking in the area so went back to the hotel and pulled up pizza places nearby that deliver ! Thankfully joes pulled up and ordered a calzone w mushroom and Mac n cheese! Where do I begin that the Taste of the cheese magnificent and the delivery time was in a half hour on a Saturday night! S thanks for making me choose best place to eat that delivers in old town !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "s76BDmBx_8kcxGFDiU6k_g"
  },
  "XNZwqt4C3vOfACQMaL699g": {
    "date": "5/9/2018",
    "text": "I ordered a pizza, online through Slice, Sunday, May 7 2018 at 1150 pm received a confirmation email with a 60 min delivery eta. I called at 1250 am and was hung up on. I called back at 0130 and was put on hold. They never picked up and after 15 minutes I hung up. I called back at 0230, by this time over 2 hours waiting. They confirmed my name and location, I'm literally 6 minutes down the road, but unfortunately I'm working overnights and can't leave the job, and they said it was out for delivery. I waited until 0345 and called back and asked for the manager. First he said he couldn't find my order, asked how I ordered it, I stated through slice, from their website, he then found my order confirmed my name and location, and then had the nerve to say the delivery driver called me and said I didn't answer. He asked what apartment number I was at. I informed the \"all knowing manager\" that I work at a hospital down the street and that I'm in the emergency department. There was notes attached to my order to \"please deliver to the emergency department\" name of the hospital and address were in the notes, which they confirmed several times. The manager then asked if I wanted the pizza, I asked will it be fresh, he said he could bring the same pizza back, really? A 4 hour old pizza, wow, I never received customer service like this before. I even lived in New York they don't treat you like this. I asked the manager for a refund, he said okay. I'm still waiting for a refund 3 days later. ugh, never again, don't do it, there are other pizza places closer lol",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TkA-vl8fFpuoWhaHWuz8EQ"
  },
  "pXpMh4n8OAShe2t8-XTtZQ": {
    "date": "1/27/2018",
    "text": "We wanted a quick and easy bite to eat. It turned out to be the complete opposite. It cost $18 for four slices of CHEESE pizza meanwhile it's $15.99 for AN ENTIRE PIZZA. (We found out after the fact). And the worst part was the entire staff sat there, looked at us, and laughed (knowing we were getting screwed).  I will never waste my time or money at this place again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hKxbjHbGAuLImzoWTsg-WA"
  },
  "Awl0-5WVGh2gYL-3F-TRzA": {
    "date": "10/27/2017",
    "text": "Ordered pasta with meatballs. Taste was so bland and crappy I couldn't finish it. Tasted like store bought.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oyMYJt5hmXAIg2z8qmDRCA"
  },
  "g8VBINFxYNHBL2kXRHU23g": {
    "date": "6/16/2018",
    "text": "Good pizza, but very pricey and they always mess up our order. We have stopped ordering due to the aggravation. Is nice that they are open very late.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g9LWd2h93-JQnDxfe0pxVw"
  },
  "4oD438REj_Q__9rnmEkShA": {
    "date": "1/10/2018",
    "text": "I really love the white pizza pie from here. I remember when I used to work the late shift at work and I would come home at around 3:00 a.m. in the morning there would be only 1 or 2 restaurants in the area that were open. I'd always be so happy to order delivery from Joes. Even during a night out Joes was always open afterward. Great business. Will return if I'm in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d1GOCEZ83rq3u5XiIvb9Pg"
  },
  "7OZ9cTA-J--suRaJ9CbF1g": {
    "date": "12/10/2017",
    "text": "Really I gave you a wrong address? We were regulars for the whole summer and you had my address in the computer.  Please spare me the bs. The lady on the phone was rude and refused to refund my money. I had to contact the bank.  As far as the lady who commented that she was in line and had to wait longer. You are full of crap. You were not on the phone with me so you have no clue what was said. And if you had to wait longer it was due to the morons working there because the phone call lasted 15 seconds.  This place I never liked but for some reason they did make a good calzone 50 percent of the time my wife liked but we found better calzone. The food sucks, The employees suck. And they would not know what NY pizza even if they were in little Italy!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Dj4lsLxKbOTGhy_AF2EUA"
  },
  "ttoXQGAnhRdJHp5KQ5V5_w": {
    "date": "11/4/2017",
    "text": "Used to stop in for lunch when I worked close by. Buy 2 slices, get one free! I've never had anything other than the pizza. Staff isn't the friendliest.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U3hz-BV-i4IszzXBpj1rlA"
  },
  "8RbL5pRq0rIGJJis6JIdlw": {
    "date": "7/23/2017",
    "text": "Called them late night for pizza delivery (that's why you have late night hours, right?). They quote me 1 hour for my pizza delivery. Pizza never shows up. I call the pizzeria to get the status of my delivery and they tell me it's still on the way. Over an hour passes and the pizza still isn't here. Call the pizzeria again but at this point they are closed so they don't pick up. Never got the food. Pretty disappointing! This is the second time this has happened so unfortunately I won't be calling Joe's again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lBBXPfjyPfgkUeQHoGPrAw"
  },
  "TuqJbxY_pmXBJ4_-2jTBnw": {
    "date": "6/5/2016",
    "text": "Great place to grab a cheap and huge slice of pizza after a night of drinking. Other wise this place is a complete mess due to all the drunks that come in after the bars close.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "L3IOpl6SO5nVkQOiT1-_hg"
  },
  "rVW99u7i-nbwcFkYKAdu1Q": {
    "date": "3/13/2016",
    "text": "Ever since joes has changed hands it's just gotten worse and worse. I work in the industry and have for a while, joes is always a staple. Not anymore! Went in there after working all day only to Be greeted by rude employees. We ordered our slices plus Philly cheesesteak fries (which they say they couldn't make when I've been getting those for a long time now.) and mozzarella sticks. They said they wouldn't make the fries and I explained how to charge me they finally succumb to my request. Next, the mozzarella sticks were mozzarella-less... Bit into three mozz sticks before I encounter one mozzarella stick that contain what was expected.   Bottom line--  Joes sucks now, spend your money else where. Bad customer service and subpar food.   In response to employees comment--  I asked for things that are on your menu. I asked for you to substitute fries for the bread on the Philly cheesesteak, all of those items are on your menu. I would understand if I was asking for things in which you did not have anymore, but you have both fries and Philly cheesesteaks on your menu. Also I didn't know that the three other only customers behind me (part of my group), counted as a busy time at Joe's.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 1
    },
    "photos": [],
    "user_id": "moLx0xwURfr5as9bPQLh7w"
  },
  "ZtyYUxXlb8g474AdIUDIHA": {
    "date": "8/17/2015",
    "text": "New owners new crazy prices 2 slices and 2 cans of coke $12 was in NYC last week 2 slices and a coke $5. The pizza tastes like crap all cheese and bread no sauce at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fu1-0kxFNgYSQmwTG8zLNw"
  },
  "c1SgckmICB_73CZLHIJD8g": {
    "date": "11/29/2012",
    "text": "Ordered a meatball sandwich with french fries for delivery; couldn't be more disappointed. The sandwich was soggy to the point the bread had disintegrated into mulch. Did they soak this thing in a bathtub for a few hours before delivering it? The fries tasted as though they'd been left to sit for much longer than they should have, and were also very soggy--my guess is that they sat in a pool of grease all night. I won't order from here again, and I recommend you don't either.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "YljNY6NytGrHCHX24N1NPA"
  },
  "sIvpY0ojz9ER9a1PUyF-EQ": {
    "date": "10/12/2013",
    "text": "The guy ordering take out was soooooo nice! The calzones are fantastic! And HUGE! If u order it take out ask for a lot of extra sauce! They only gave one little thing of marinara. The Greek salad is delicious too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FBcOnENI3HYUiq_CPdsRGg"
  },
  "lGWCJWBXoLW-1gg3qZbJqw": {
    "date": "8/17/2012",
    "text": "I actually don't remember being here, had I had too much to drink I wonder...?  I don't eat pizza, so I wasn't actually a paying customer here, but my friends seemed to enjoy themselves (or so I heard afterwards), and I will say this...it's in a super convenient location and has super convenient hours of operation!  I would totally stumble my way back here again. ;)",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "pm2Xtpl0zwp94Yaj5cT26g"
  },
  "y3JTHY4EDOoEUxU5-YnQtA": {
    "date": "8/1/2011",
    "text": "I should have stuck to my gut feeling and ordered pizza.  But...no, I decided why not see how their other food is. Bad idea.  We orderd: Philly Cheesesteak Calzone Garlic Knots French Fries  My cheese steak was practically empty. There was about 80% bread going on here. I had to add some of my own to make it more tasty! What little meat there was, wasn't horrible. The french fries were sad - I mean SAD. They were wet and limp with no flavor at all. The texture was just weird. The calzone was made with Mozzarella, Ricotta, onions, peppers and sausage...this could have been good if the dough was cooked more and it wasn't drowning in ricotta cheese.  The only think I truly enjoyed was the garlic knots. They were fantastic! Little pieces of garlic heaven. If you do not LOVE garlic I would stay away from these little buddies as they are covered in it. Yum!  Previously, we've eaten here late night and had delicious pizza. IF I ever return I will stick to the pizza.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FKM9AcoEv4f7EiKJsiaNog"
  },
  "BZ67RMI9F0qsyvJ7674OQw": {
    "date": "10/6/2011",
    "text": "Folks, NY pizza is supposed to be a little greasy. If you don't like it go to Dominoe's or whatever.  I was a Joe's regular when I worked in the area. After I found another job (far, far away) I didn't go back for ages. When I did, I was surprised that the owner remembered me! (and kind of flattered).  Anyway Joe's pizza is NY pizza. Thing crust, shiny, a little drippy. I had it yet again tonight after Papa John's informed me they no longer deliver to my zip code (85250). Then I remembered Joe's delivered and the day (but sadly, not ALDS Game 5 at this point) was saved.  Just what I wanted--pizza, Joe's fantastic garlic knots, and the best house chopped salad anywhere. Delivered, no charge.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91DQIN1ZLg2wPgjoDhI_ow"
  },
  "XA-FdKiddgvl4-DTUFkF4A": {
    "date": "1/21/2011",
    "text": "I have a couple friends that swear by this place, but a few others and I think it's just okay. It's not the cleanest, but then pizza places normally aren't.  The other day I got a Grilled Chicken Parmesan sandwich, but it was fairly tasteless with bland red sauce and cheese. The pizza is okay, but nothing to go out of the way for. I think I got spoiled with real Neapolitan pizza in Italy - no comparison. However, their Italian Combo sandwich may be their best offering.   I don't want to knock it for people who like NY pizza, but Joe's is low on my list.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xBwi_9KWfkV4TFId6TmZ0w"
  },
  "KiJYpVf0X-FWjkAID0F6wg": {
    "date": "11/9/2010",
    "text": "Joe's is not the best pizza, but it is really tasty and very reasonably priced.  I would say the same thing about their eggplant parm and chicken parm sandwiches.  Clearly these were frozen things deep fried on the spot on decent bread.  For $5 though I couldn't complain.  Bottom line:  If you want some good and cheap eats, come to Joe's.  If you are expecting knock out pizza or italian fare, go elsewhere, but be prepared to drop more dough.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Z-3tcM07Pyc4mOF2Rjt6Q"
  },
  "LYArqJbTpR4Au6Py8Rb16w": {
    "date": "9/7/2013",
    "text": "I've had the pizza at Joe's which is good, I enjoyed it.  But what I'll be coming back for is their Eggplant Parmigiana Hero!  OH MY GOSH it is the best!  I used to go to another restaurant to get this type of sandwich, but all of a sudden they stopped carrying it and said they never did, so it was something similar to a miracle that I found Joe's and they make it to absolute perfection!  And they deliver. that's always an extra bonus!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VTKKxBvaSrKrcevKNXDP3w"
  },
  "tRhDotYpk8Xt5U4UCuauoQ": {
    "date": "12/6/2012",
    "text": "Love it!! Only thing is just go in for a slice because delivery and tax ends up being so expensive.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Cjbey0IXGL3am4PkBwF8VQ"
  },
  "otX8zEP5mwdLpeW-ZwlYDg": {
    "date": "8/20/2013",
    "text": "This is the BEST pizza in the state!  Hands down! I am originally from New York and I have not found good pizza until I came here.  Even when my friends come with me.  They too agree that the pizza is fantastic.  This includes my friends that visit me from New York.  If you are looking for some good pizza, check out Joe's in Oldtown.  Glen",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7w6LED7cf5GKk7sFR7ORwA"
  },
  "wYVTV0WYx2ppcXRkjPbrsw": {
    "date": "1/31/2015",
    "text": "I absolutely hate giving1 star reviews however they just did not live up to their commitment whatsoever. Order placed, and never showed. I called and called and each time was told \"sorry, but we do not accept delivery orders this late\".  I completely respect that business practice; however then: (1) do not say you will deliver; (2) do not take my order; (3) do not act self righteous when I call 45 minutes later asking where my food is; and (4) try to fix the problem. Sorry to inconvenience you by attempting to order some food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qy8I1xjCM3-rk4LnlI1Y_g"
  },
  "fBv9pUBINaWx7kbla9obfQ": {
    "date": "9/6/2015",
    "text": "Staying at garden inn and ordered lunch.  Baked Zito and garlic knots. Food arrived quick and was better than Italian we had last night at fancy place tart we paid double.  Easy to go Joe's!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "degkhE1YTY9x3Vt2OMEZbw"
  },
  "AerWactPDMfoN57VLOGTcg": {
    "date": "9/29/2014",
    "text": "Looked good, but tasted gross. The crust is too buttery and not crispy or chewy. This is a failed attempt at a NY slice. I couldn't even finish my second slice. It just tasted bad.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xLcwDhFKONBP2F16lsaB_w"
  },
  "vfZ-SrMBGZm7tZhg8AJlZA": {
    "date": "7/1/2015",
    "text": "Let's see where shall I start? Well first of, finding a parking on weekends is very inconvenient. My husband ordered some garlic knots and wings which I didn't taste because of my diet.  Then finally on my cheat day I decided to give it a try. We went in there late night on a Tuesday. Getting off topic a bit their hours are very convenient. Anyways I went in there to order some food service was not bad as everyone seems to complain about. I was greeted and taken care of in a timely manner. So I ordered a chicken roll and my husband a calzone. Wait time for my food was about 12 min max. Not too bad but not great either. I finally got my food and as I anxiously bit into my food I did not get what I was expecting! Pretty plain Jane. Not much flavor to it. There was way too much dough and you can taste the flavorless chicken. Like it just tasted like boiled chicken on dough. I didn't finish it because it made me nauseous. The flavor was just too unpleasant. So in conclusion I will not be going back! Their food did not appeal to me and one taste of that chicken roll was enough! Oh and by the way I gave them 3 stars because place was nice and clean, nice staff, great hours and food was cheap.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lsy6AFZT25Pka3-6y4nMdw"
  },
  "IjVi2GuJYMZT0uPD9gbNHQ": {
    "date": "3/20/2012",
    "text": "Without a doubt this is the best pizza Scottsdale can offer! My husband and I always stop by after we go out or get it delivered - either way you'll get a perfect New York style slice. Plain cheese is my favorite.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HIM9cykyj38Tev4TjI4UBg"
  },
  "Ud8vr7uwTh96p5ijqvZIqg": {
    "date": "4/1/2010",
    "text": "I've been to Joe's about 50 times in 2008. It's better than most but so terribly inconsistent, even the slices. Which, by the way, they often kept out for too long, and is fucking gross.   As far as pizza slices, NYPD is better, and the Pizza by Napoli place on the NW side has got them both beat. Some of these reviews are from people who went there piss drunk and wouldn't know the difference between pizza or cardboard. The good pizza I had here, well it was great, so I'd give it 3 stars. But I wouldn't wait in line for more than 10 minutes here, even if I was starving.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2muqQ2k4gFIdw_GRtojoJQ"
  },
  "nu9KtPV4YjRBU32h2St7bg": {
    "date": "3/25/2013",
    "text": "Great Pizza.  As a New Yorker who has tried many places over the years that CLAIM to be real New York Pizza, this place is True New York Pizza.  You know a place is successful when another pizza place ( Gus's pizza ) moves in across the street trying to ride Joes coat tails..   As a foodie, I know Joes uses the high quality cheese, that is one thing that I have noticed many places fail on using with New York Pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NpBS1sQx-0_vEW53VMWVsA"
  },
  "8IxIkPOYfdYcV9Z99FOX6g": {
    "date": "5/29/2013",
    "text": "Wow, this pizza was amazing. I was in town (from NY) and needed something for myself and my girlfriend to eat late at night. Man, this pizza was spot on NY style. The best pizza I have had outside of NY. If you are hungry at any time of day, go here. Try the Hawaiian pizza because that was unbelievable!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ekAOW9YipmhepDxXNiUPtQ"
  },
  "_E7LqGlJm9-3RY6HbmjCdg": {
    "date": "2/5/2015",
    "text": "I use to live in new York city for 7 years and Iam always looking for great tasting pizza in Arizona. This pizza place was recommended to me. Being a pizza critic I was a lil disappointed on our first visit. The next day my boyfriend called and spoke to the manager. Lisa was the nicest person she invited us back for a better experience and enjoy better tasting free on the house pizza. I guess it turns out the guy making pizza the night before purposely made crappy slices because it last night working there and the owner was out. The next visit we had much better tasting pizza we enjoyed 2 regular cheese slices and 2 Sicilian slices with free drinks, this was definitely better than the 1st visit. I would say its close to new york tasting pizza but the sauce still needs more salt or flavors and maybe olive oil or butter on the dough. With that it would be perfect!  Well thank you to the owner she made us very happy and we will be definitely going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kHXGAlH6h6jY52mn6SSBDA"
  },
  "YWMVrdnBA_6uZ5eshRGWkQ": {
    "date": "7/20/2011",
    "text": "I will never again use this pizza place again in my life. I work at a nearby business and I decided to try them, Lo and behold they always charged me more than what the specified amount was. This was not an isolated incident either this happened multiple times. Always ask for a receipt if you decided to eat here other wise they will take advantage of you.  DO NOT GO HERE THEY ARE THIEF'S,",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4iW2h7DWeDW_DLEUzLkzUA"
  },
  "gnRhG69utkIdJQzDNKd3UQ": {
    "date": "7/15/2009",
    "text": "where is the love? something was missing with my last visit to Joe's New York Pizza.......where is Joe?!?! i admit it has been at least a year since i have been in there last.( i got hooked on the other side of the street with best of Italy pizza) i couldn't get enough people to agree on one type of pie so i got a few slices.  They were big slices and the crust was thin, they might have had a chance if they were not \"marinating\" in the window for an hour.  i like to load up on parm and crushed red pepper after I'm through with condiments it all tastes the same but nothing i can do can hide far from fresh product.  if you find yourself on that side of town and need late night food check out Best of italy or Philly Sandwich(24hrs!!!wtf) on 5th ave and scottsdale",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2PrU5Tjmm3MWoY6CX3cNFw"
  },
  "9NTv_ZFplYCGin8wcBBOpA": {
    "date": "3/2/2009",
    "text": "Great late night pizza. The line is always out the door, but the pizza is worth the wait and fairly inexpensive. You will definitely be entertained while you wait in line with all the drunk people leaving the clubs making a fool of themselves, and you can see what the person really looks like you were grinding with in the club!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lGC2ztwMSjTl5jRNG6IHWg"
  },
  "ye2KTLKF2i_oGqq4UpYTJQ": {
    "date": "2/13/2012",
    "text": "The pizza was OK. Middle of the road for New York pizza",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IP52gOfkJesWsQYHJ-Gfxg"
  },
  "LJrTY3CCUHX_9cCPazVIiA": {
    "date": "4/5/2010",
    "text": "Fantastic, Wonderful, Awesome, I can't believe it.  Are you kidding me?  NY Pizza in AZ?    YES, IT IS TRUE !!!!!   Not only was the lady on the phone extremely nice but she chatted with me about NY and that was cool.  OK, now for the Pizza...  Pizza = Fantastic, just like back in Brooklyn. Delivery = Holy Crap, I barely had time to change the channels and the guy was at the door.  This guy (born and raised in NY) gives this Pizza 2 Thumbs UP!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hoSqKAQqS8AFkaH8NDD-pQ"
  },
  "kBlop2gO672py5J6pGLMrQ": {
    "date": "3/9/2010",
    "text": "I really had my doubts about this place because it seemed a lot like gus's or tessio's but it in no way compared. I found it to be probably one of my favorite pizza's  in the valley. I definitely think it's worth a taste.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IQXxo1jj6Ij6VvFgTQ1kRA"
  },
  "SYPf_rUmIAogzROUduNrew": {
    "date": "1/20/2009",
    "text": "Really surprised! I'm not one to like Marinara sauce, but, their Marinara and everything else is second to none! I highly recommend the Calzone or Stromboli.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AAkQqkvTUxuBFB-7l3FpWg"
  },
  "qSk-74GWDIhY67RJHtlRIA": {
    "date": "5/19/2011",
    "text": "Very laid back. The pizza is delicious and the owner is very nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qbmMV_jmGTsDcjYaE0d_VQ"
  },
  "FfBnDi6shNHSMvGQGXctqA": {
    "date": "1/23/2007",
    "text": "Joe's Pizza is delicious. But Joe is mean. And scary. His pizza joint is right across the street from a nightclub, so he can't expect his customers to be meek little mice that eat their pie in silence, right? WRONG! I came in with what one might describe as a rowdy group of girls on an early evening and Joe immediately started yelling at us to be quiet. We became a little annoyed and may have mentioned the fact that he can't really expect his patrons not to laugh or talk loudly and he promptly kicked us out. That's right, I have been kicked out of Joe's Pizza. But I'd still go back, it's good stuff.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "sYQyXDjGaJj7wfaqz5u8KQ"
  },
  "fM9LpYpfZEKPveY5J0aBWA": {
    "date": "4/2/2008",
    "text": "Awesome east coast style pizza!!  We always make sure we have Joe's when we travel to Scottsdale. Takes me back to the pizza I grew up on in New Jersey and Pennsylvania.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "sXfUHgqr41KTCjU29-FbHQ"
  }
}