{
  "zp2RBwLmg8s6D9jiH_5cbA": {
    "date": "6/9/2017",
    "text": "It was my first time here, and I had an awesome experience. The bartender, Bratt, was really nice and courteous. He had a lot of energy and was genuinely nice. I had their mac n' cheese and it was delicious! Also, I had a happy hour beer for $4!  The place has two levels, where the bottom level is where people socialize and the upstairs is where people work. I LOVED that there were plenty of plugs for my laptop! It's a big plus when I'm looking for a coffee shop to work at.  I would recommend to friends :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PhRmc-Uolw_4rP32GkC-XA"
  },
  "VWEMhUGGsLNlKn_ZQYswLQ": {
    "date": "1/12/2018",
    "text": "Quick drop in for a cap. Great decor but vibe a bit dark for my early morning kickoff. Cap was good!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZBzk54ElTdGh-C4reDnqcg"
  },
  "Jej2P3Qdk0IjtOUlTzk9ug": {
    "date": "8/11/2018",
    "text": "It took 30 minutes to get avocado toast on stale bread when there were 3 employees and 3 customers. After 15 minutes we asked where our food was and commented that there was no one cooking in the kitchen. \"Oh we will go get him\". The tables were dirty. Over this place... so much potential wasted.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CU4rKHABAcCPi7kiwiHsWA"
  },
  "QeiMlPmGhdQAFvtw3B8chA": {
    "date": "3/28/2018",
    "text": "Phoenix's best kept secret! The Grand is probably the coolest coffee shop in Arizona, that I've ever been to. This place even has a hidden speakeasy on Saturday nights! Once you walk into The Grand you will see why this place is so awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z5tlmIlx6pvMpFdWe1IJyg"
  },
  "XMFMjUDeQiGCqo8GmRPVlA": {
    "date": "6/27/2018",
    "text": "Been coming here for the past couple of months and never got a chance to write a review so here it goes. (Btw i usually dont do this)  I come here any time from like 6pm-2am when is not so hot outside!  Ill start with the food and drinks. I ALWAYS get the mac n cheese and when im feeling wild, i try the mac of the day! The mac n cheese is a must try! They have a large selection of beverages but i stick with Lemonade. Lemonade and Mac is my go to when i come here.  Second but most important is their customer service! which most restaurants lack on. They have the friendliest employees! always smiling always in a good mood and they always make you feel like youve known them for years!!!  The only bad thing about this place is that its pretty hot at times idk if the ac doesnt work but it can get a bit warm in there specially around this time a year. But the night employees make you forget about the heat with friendly conversations and good attitude.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0UJBGU_aqQ94T3tPqmtW-Q"
  },
  "cspbbdbUZj_Asm5d3cRTJA": {
    "date": "4/7/2018",
    "text": "You know a place is great when they serve you a proper rare burger (If you ask for a rare burger, which I did) the only hitch is, it takes SO LONG for you to get any food or drinks. If you're willing to spend a LOT of time waiting and chatting with your friends then this place is great, but if you're hungry and you need food and drinks ASAP this is NOT the place for you. I hope service gets better because that burger was so great. If I have a ton of time on my hands I wouldn't mind waiting for it again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PZbAOEq8HQynznrmgQ6FoQ"
  },
  "FAPmp9u0gjsJNgtU2-VK6A": {
    "date": "4/4/2018",
    "text": "I would literally die for The Grand's fries and aioli sauce. The food and drinks are really good and the atmosphere is awesome! The live music is always so much fun.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-kAAVVNVnpeC-jCzfUhLzw"
  },
  "lfL9nFEAlEVeKRNNdPD9Zg": {
    "date": "3/13/2018",
    "text": "Great atmosphere, good coffee.   As a college student 24 hour coffee is a necessity. The Grand fulfills just that, as well as being a great environment to study or lounge with friends. The live DJ or band is a major plus! Usually, there is someone different performing every time I go. I haven't tried the food yet, but I will be sure to add the fifth star if all turns out good.  My experience at The Grand is always a good one, and I always recommend it to friends who love a vintage style coffee shop.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p1mewvjbJ3Y_navKc18nTw"
  },
  "L3sW0r-C9ivdEyfKaVc7UQ": {
    "date": "8/22/2017",
    "text": "Recently came in a few times.  Very excited and impressed with all the renovations.  Equally sad to know that Amsterdam is gone for good-what a great time that place was.  The first time the barista didn't know what Nutella was. -a fine ingredient for a new twist on a cafe mocha.  The second time the frapuccino was amazing.  The third time the cappuccino was terrible.  And served in a 12oz glass made with 4 shots (seriously?)    I also noticed Paella on the menu,  Odd for a coffee shop.   How about making better deserts,   or way better pastries and muffins? Or better yet,  add Pizza or Cornish Pasties to the menu!  And as a lover of finely crafted cocktails, is it True that the speakeasy section is only open 4 hours a week?   Seems like a silly waste of space.    Above all,  I wish you could bring back Amsterdam!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uwaTwcRP3xu5WPbAenElnA"
  },
  "ibi7b05fJmlyeeeGTLnMCQ": {
    "date": "7/2/2018",
    "text": "The customer service was great, came in here to study and Alyssa and Faith took care of my order. The cafe and environment is amazing I would def recommend to anyone specially students trying to study.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "00kuTwsytoDPaTzsfRAVEg"
  },
  "WnDmLnxR_39aF-ZInUQyMw": {
    "date": "3/5/2018",
    "text": "Absolutely LOVED the Grand! What a cute spot right in Phoenix. Had a great glass of wine and ordered the tacos and hummus (YUM). We sat outdoors and loved the ambiance!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AUgOhD6HWLp6A0NLPfEpAw"
  },
  "k1a-B8b58GMMQQ_VEOpJtQ": {
    "date": "11/16/2016",
    "text": "I've been coming here for a few months now to study.  The place is divided into a variety of spaces that can create a different environment... Tables and couches along with a variety of lighting fixtures create a coffee shop feel.  Althogh it is neither a coffee shop nor a bar.. its both..This place is great for a casual coffee meet up, grab a drink at the bar, or go upstairs to read... If you are not a total coffee snob, the drinks will do you just fine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nF9XDBgQfYgPNvwNcb_mrw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nF9XDBgQfYgPNvwNcb_mrw/o.jpg"
      },
      {
        "img_id": "6Sg4K8izxoCN-um8wKwbCA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Large table with outlets upstairs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6Sg4K8izxoCN-um8wKwbCA/o.jpg"
      }
    ],
    "user_id": "XK1YnnYOLLaD9bKnv63YUQ"
  },
  "uAdU2i0alrvsFLjMa9tBkg": {
    "date": "8/29/2018",
    "text": "The place used to be great -- good menu and nice people. Now the menu only has five items, the management is rude, some big tables (which were great for a big group of people working) became \"no laptop\" zones. The air conditioning vents sound like they are about to explode with smoke/dust coming out of them, making all the tables upstairs violently shake. And they definitely don't have enough outlets. So, if you are planning on having a work-day at a nice coffee place, this place isn't it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JtTOrCnr8y373toXvoroJg"
  },
  "UJCHVx832ZYucia_uGhktg": {
    "date": "2/5/2018",
    "text": "Went here for the first time this morning and absolutely loved it, ever since Jobot moved and cut their hours I have been on the search for a  new 24/7 coffee joint for those late night cravings and im shocked I didn't find this place sooner! The ambiance is nice at 3am but just judging from the sheer amount of seating I can't imagine I would ever want to come here around busy times, just like lux I imagine it gets quite crowded so do yourself a favor and come at an odd hour, enjoy the weirdness of being one of the few people out in the world and have a cup of joe in peace only a 24/7 coffee house can bring. Oh and, breakfast all day, every day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PIxyGQONpR0WVpHHyvb0hw"
  },
  "gpibURdrUHRXznfmMIsrnw": {
    "date": "11/4/2017",
    "text": "No...just no. S L O W service! Seriously, over a 10 minuit wait for drip coffee. Then...they tried to give me used cream they served to another customer! Even with those big ass 80's glasses nobody working there could see their place sucked. I threw my coffee in the garbage and left. Would rather go to Circle K!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OXi3OX-z8fAklsVasX4iFA"
  },
  "4GuFhcIR3vuptyAutBjnow": {
    "date": "7/26/2017",
    "text": "Came here for breakfast. Great food especially for the cheap price and great ice chai. A bit confusing that you have to order from the counter then get service to your table. We sat at the open bar outside. There is plenty of shade when it is sunny out. Decor indoors is also nice. It reminds me slightly of the types of restraunts/bars in downtown in Europe. Still need to come back for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KZ_NuTyQH3bD6F9LAVgpQw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KZ_NuTyQH3bD6F9LAVgpQw/o.jpg"
      },
      {
        "img_id": "hbGfkrdnN466-wHC9hzDLA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Scrambled eggs and breakfast sandwich, both very good",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hbGfkrdnN466-wHC9hzDLA/o.jpg"
      }
    ],
    "user_id": "TLHNp6NUzx-sk6shLQ5oHw"
  },
  "vFHqBtzgnF0i32W6chB6rg": {
    "date": "12/10/2016",
    "text": "Updating my review to reflect the fact that I have been back and really enjoy Grand Central Coffee as a chill and beautiful spot to hang out and get work done. I am still hoping they get busier, but you can't find a nicer coffee shop in the downtown area.  Good coffee, great space, friendly people... Come one, come all! Fill this place up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hiRPU_z-TvEljVkAxmPizg"
  },
  "crCyV5ug5z8XEsxDCaWR8w": {
    "date": "8/15/2018",
    "text": "Really good service! The barista was really nice and patient, answered our questions and helped us out through the ordering process! Beautiful space!Definitely coming back for another sip!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QDCdbEgVatlgnQ5YlonCfA"
  },
  "HdbzWDfTcz4NGk0gQ9UcRw": {
    "date": "4/8/2017",
    "text": "Old gay bars make the best coffee shops! We did the decorating for the rest of you! Great menu booze and coffee. The menu is a available all day despite what the print out say.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "646s0MPBBgJwpVqwm81t8A",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/646s0MPBBgJwpVqwm81t8A/o.jpg"
      },
      {
        "img_id": "BbknUkd9GB-8DwxvhyJICw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BbknUkd9GB-8DwxvhyJICw/o.jpg"
      },
      {
        "img_id": "K43PlqcI8fsz7FcN5oE7Bg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K43PlqcI8fsz7FcN5oE7Bg/o.jpg"
      }
    ],
    "user_id": "bBG4hqsSnR3nxzSM4Mx5IA"
  },
  "-3HuuHlnyhSSmnS67hH9vQ": {
    "date": "4/7/2017",
    "text": "Fantastic spot! The live music put a pep in everyone's step. Excellent food with delicious vegetarian options. (For fellow vegans/vegetarians - they have soy milk and almond milk.) Love the Punch Card - great touch. Service was extremely friendly. And the desserts encourage me to run an extra mile every day just so I can eat here as much as I want. They are SO good. Overall, awesome spot for both day and night (which is no easy feat - bravo!).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D-r7iesYZa7uFdL6dTYMIw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Love the Punch Card!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D-r7iesYZa7uFdL6dTYMIw/o.jpg"
      }
    ],
    "user_id": "yfQRz5HAav2RG62YdYfb5w"
  },
  "ZQd9POUE6jSdxMmjTTaxBA": {
    "date": "10/25/2018",
    "text": "Such a cool spot! Good drink selection and lots of nooks to sit at. Cool lighting everywhere, great for a date night or grabbing a coffee and doing work. It's my new favorite chill spot in Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NiGSM3ZhBZ1vitYfQMb0Fg"
  },
  "Yxg1Nc4IW7uRniof1J-ZeA": {
    "date": "8/16/2017",
    "text": "We came in last Saturday with a large group for my husband's bday and had a great experience. We sat at a large table and ordered our drinks from the bar. The bartendress was very helpful and friendly. Some of our guests ordered avocado fries, which were awesome! Others ordered fries, which were also tasty. I look forward to coming back for more drinks and food in a future visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "phP2irG-6l-A0T2vShxxvw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/phP2irG-6l-A0T2vShxxvw/o.jpg"
      },
      {
        "img_id": "o9YJSOLB_7TsU-Zs9HHU0Q",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o9YJSOLB_7TsU-Zs9HHU0Q/o.jpg"
      }
    ],
    "user_id": "gOYgSEbE-Z7cqGsgGW3LBg"
  },
  "2Qj1wjjpGQuMQ0YTMyFjvg": {
    "date": "12/18/2018",
    "text": "The speakeasy it's amazing. The Ambiance is incredible and can't be beat. Nicholas is an amazing host there's none better in Arizona. This is a must-see establishment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cr6m5FAenVoPpFH7GIiXuA"
  },
  "8-RQGWpAaXapKCH2iqRIVA": {
    "date": "4/13/2018",
    "text": "Not my favorite coffee in the downtown area, but The Grand has pretty good caffeine and breakfast options in a very nice space, both inside and outside. This is where I would come in the mornings to write a novel if I ever get around to it, or for cocktails at night. Open 24-7, the Grand has something for everyone in a cool location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OQBMu7x0V4Oz3iFv3x0i5Q"
  },
  "DoSHHXZXVmtGm1SoaANHcw": {
    "date": "8/28/2017",
    "text": "Interesting decor. The iced dirty chai tea latte tasted great and helped me survive the long day. The avocado toasts were huge portion (=good price).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "USG1wkzku03asNV8TQZetw"
  },
  "CPM9lAeh5wOYC5mzoR25_Q": {
    "date": "5/11/2019",
    "text": "The barista (Stephanie) was extremely rude and more focused on talking to other coworkers rather than the customers. My drink was messed up (a peach green tea, how do you mess that up???) anyways this is the last time I will ever come back to the Grand!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XzXBzdwel6LlKXLnMNBiQg"
  },
  "xDKfX9IeJRxPIqjAdFOtEw": {
    "date": "11/14/2018",
    "text": "The Grand is my main study spot. I get tons of work done here. I've been coming here for a year now and there are some frustrations. The WiFi isn't reliable. You have to get there early to have less of a struggle to log in. Which is odd because a year ago I never had an issue. I typically study outside during the winter months I try to get a seat inside. The lighting is terrible. Very dim lighting on the 2nd floor which is dangerous because the 2nd floor has steps that you can't see.  I can live with dim lighting,  but what has been keeping me away from the Grand has been the WiFi. There have been several times that I come in, order my coffee, sit down and the WiFi doesn't want to work. I don't expect the staff to be IT specialists but I really wish they would fix this issue. I love this place and would like to return as often as I used to. I LOVE studying on the patio, but I can't afford to keep leaving because no WiFi.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cHU5Z4ChZO_M7BKhdOv-vg"
  },
  "_snaHq3q0Q_0Obn2zA0beg": {
    "date": "1/27/2018",
    "text": "My first time at The Grand will likely be my last. Ordered $20 worth of food and drinks to have a Saturday afternoon of homework, only to find out minutes later that their WiFi is awful and doesn't work. I tried connecting forever, and then asked a worker to explain what was going on. He explained that when there are a lot of people at the shop (there were MAYBE 20?) WiFi just messes up and doesn't connect. So... a coffee shop with no WiFi. Nice! Never going there again. Regret that I ordered food before knowing this.   I came to Lux immediately after and what do you know! WiFi is amazing with ten times the amount of people. Don't bother with this place if you're attempting to do computer work. Nice lunch and breakfast? Sure. Homework/work? Nope.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "KJKdRyhGdK4rfDlbhftH_w"
  },
  "ng7uzVmgsXEZ1uLtCEwEbw": {
    "date": "4/23/2018",
    "text": "Not a good place for dining, also not 24 hours. We arrived at 1240am-Ish, and a gentlemen came over as we were looking at menu. He stated \"the kitchen is closed guys I'm really sorry.\" Which was not impolite. However, a hello or some type of greeting would have been appropriate. We were not offered a drink or anything, the conversation went no further. Other customers had drinks. I don't know if we were just not welcome, or nothing was available.  The stars are for the ambiance. It was really cool! We walked through several rooms to get to the counter, and it would deficiently be a cool place to eat.  Unfortunately we will not be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7DqeBTqaOVv_LSA99a-7wg"
  },
  "dUhdNWr0D6c7E6fayc-_Gw": {
    "date": "3/9/2018",
    "text": "I love this place! Great spot to stop for an awesome coffee or tea in the mornings and a fun place at night for drinks. The atmosphere is awesome, super grand (haha) decor, kind of a dark, old timey vibe.   They always have an awesome selection of beers, the mix drinks are super tasty, and they also have a lot of cool things going on with their non alcoholic drinks. The lavender white mocha is delish and I love love loved the rose lemonade, tho it can be a bit too sweet for my taste depending on who's making it.   4 stars rather than 5 because I've come here several times to do some studying and their WiFi never works for me. I guess some people have no trouble but for some reason I'm never able to connect, when I asked they said that just happens for some people and oh well basically.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L4eKF2DeFJ1tCAmEHxFjug"
  },
  "zKvbSsRyoOaKCWP0p6sl9g": {
    "date": "11/18/2018",
    "text": "I got their mac and cheese burger and it was AMAZING. I wasn't too impressed with their service, but they weren't rude or anything. I have nothing bad to say about their food though, I'm gonna have to go back and try some other things on their menu",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnuktFMD3PJgelrTvJvOQg"
  },
  "q_VDDseFsNZos8V0m1msZQ": {
    "date": "4/4/2018",
    "text": "Disappointing as a lunch place. Two of us ordered the strawberry spinach salad and it came out with just strawberries on a bed of spinach with a very small side of dressing. Where was the cheese?   It also took way too long to prepare 3 salads and a sandwich. Fries had no salt. The soda lines at the bar need cleaning. The coke came out tasting fruity.  The care in preparing food was just subpar.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "48x6CNutt_c9Awf5Uybv5g"
  },
  "AvhjZHX9V1m42VFVUZ3J6w": {
    "date": "2/5/2018",
    "text": "I came to Phoenix for a nursing conference and my friend and I decided to go out and explore. We were hungry and decided to stop here since the place looked pretty cool.   We ordered our food, some tacos, and we were told our food would come out in a few. Well, time kept passing by and our food was nowhere to be found. When we went to the front to ask them about our food, they said they forgot to put in the order or something like that. They apologized and said that the tacos they had made were for some managers. Okay... awesome.... what about your customers? It literally took them an hour to bring us our food.  My friend wanted to leave after they told us they forgot about us, but we decided to stay because we were starving.  I know sometimes people can forget things, but when your customers are hungry and have waited for an hour, do not say your managers get served before us. Just don't.   Overall, the quinoa taco was actually pretty good.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ZHglzlM66zy8OxQ1ZNFAA"
  },
  "xObsx-J1tW941oIclkbbTA": {
    "date": "9/3/2018",
    "text": "So, my heart was broken a couple months ago when I came back here *specifically* for their delicious mac and cheese. I was told they no longer have it on the menu. In fact, the menu seemed drastically cut down, and the selection is just okay. Nothing really stands out anymore. Additionally, the floor servers (?) used to run your food to you, but now you pick up your own food from the kitchen counter. Not a bad thing, just a very noticeable difference. Finally, the AC upstairs is basically non-existent, so it's damn hot. Still love to hang here, but pretty disappointed about the changes. For that, I take back a star.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vJB7B9RCMmx3PGpyILGtnA"
  },
  "YDxM_kaR3sw6adX4-_bqcQ": {
    "date": "4/26/2019",
    "text": "Perfect for studying downtown, good coffee, and good music! Sometimes they have people playing music live outside which is fun to just go and listen with some friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tg04E08pukHon8Fo7WfhgQ"
  },
  "l7HnRS40jEXLQpf_z84X4Q": {
    "date": "4/25/2017",
    "text": "There are two things which Downtown Phoenix arguably has too much of.  Pizza and coffee.  There's a restaurant serving pizza around every corner and there's a coffee house around every corner (remarkably, not one of which is a Starbucks).  Let's face it, we all know pizza has no ceiling in America.  But increasingly it seems like the corner coffee house doesn't either.  To be fair, there's plenty about The Grand that differs from the numerous coffee houses in Downtown.  In fact much of what you find here is radically different.  I actually came here to meet up with a local organization for a Facebook event, but took a little time to peruse as this was my first visit.  The Grand occupies one space in what (until recently) was a row of nightclubs along Central Avenue just south of McKinley.  Amsterdam nightclub occupied this space for years with a couple of other nightclubs next door (both of which are still open).  Now this space is Downtown's newest 24/7/365 coffee house.  With relatively few 24/7 businesses Downtown, this is a welcome sight.  The space is enormous (at least 10,000 square feet) including a sizable outdoor patio on the north side of the building.  The Amsterdam space could pack in hundreds and so The Grand can at times feel pretty cavernous with a lot of unutilized or underutilized spaces.  According to the owners the inspiration behind the interior was that of Grand Central Station, with various time pieces and a menu board substituting for a train schedule.  That qualifies as different I'd say.  Up until recently the menu was pretty limited to coffee, booze, and baked goods.  Of late they've been slowly rolling out an all day food menu covering breakfast foods all the way through late night munchies.  I will say however that they're still a little disorganized on the food front.  Between the food menu, coffee menu, baked goods, and booze list, I feel like The Grand probably should change their business model to that of a full scale restaurant rather than a coffee house.  When I got in line up front to order my food, there was no menu to look at other than the one (and only) menu at the register.  There was a couple of folks in front of me and each (understandably) took well over a minute to look through everything and put down their order.  For a place as large as The Grand, it would be wise of them to instead just have hostesses find them a table and use waiters and waitresses to take people's orders.  Hob Nobs has struggled with a similar problem and it was partly responsible for a bad experience I had there.  After looking over the full menu, I went with their house made burger named (appropriately enough) The Grand Burger.  Also got a glass of New Belgium Blue Paddle Pils.  Total cost including tax came to $15.  The specs on the burger: ground short rib, white cheddar, a bacon-shallot gastrique, arugula, garlic aioli, and tomato with a brioche bun.  I was a big fan of the gastrique and the bun was toasted perfectly.  Tasty burger, though for $10 I was kind of disappointed it didn't come with a side.  At this juncture it seems like they're still feeling out the food phase of this place.  They're completely good to go as far as their coffee and the booze selection at the bar is pretty impressive (including more than 20 beers on tap, a dozen wines by the glass, and a fair number of cocktails to choose from).  But as I mentioned earlier it seems now as though The Grand is a full scale restaurant masquerading as a coffee house.  I get wanting to maintain that coffee house feel, but there's nothing wrong with just being a good go-to 24/7 restaurant.  With time, hopefully they'll get the logistics fine tuned.  I'll give The Grand credit for taking a big gamble with a 24/7 business that seems truly unafraid to take risks with their food and drink menu.  I hope the gamble pays off.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wp-bWxweAUqpMG1-uLgjSg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. The Grand Burger.  Pretty impressed with the burger, but even at $10 it didn&amp;#39;t come with a side",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wp-bWxweAUqpMG1-uLgjSg/o.jpg"
      },
      {
        "img_id": "JsZL45viCXVpWSJ3OW3qzQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. The tap list for the evening.  Pretty decent selection",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JsZL45viCXVpWSJ3OW3qzQ/o.jpg"
      },
      {
        "img_id": "BiigXOk9IqB_wZAjRligwA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Menu (page 2)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BiigXOk9IqB_wZAjRligwA/o.jpg"
      }
    ],
    "user_id": "WMMI5Q4Rmm1Rqdu0jOvyhQ"
  },
  "9rpCJYM62IZ5bI6GndlfaA": {
    "date": "3/21/2017",
    "text": "I absolutely fell in love with this place. Back in the day I would come to this place when it was called Amsterdam's they had a piano in the day and at night dance music.. it catered to the gay community but very gay friendly  :-)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "UydOKEaVfN6yqqO-qE50xg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Avocado fries! Delicious and refreshing! And unfortunately I&amp;#39;m a wimp the dipping sauce was too spicy for me :-)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UydOKEaVfN6yqqO-qE50xg/o.jpg"
      },
      {
        "img_id": "VjD4qRU_lKYw14-k-rQHig",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Never too early for a delicious bloody Mary",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VjD4qRU_lKYw14-k-rQHig/o.jpg"
      },
      {
        "img_id": "hsCHOqBIsd0FAxy-wzZpxg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Cappuccino by Johnny :)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hsCHOqBIsd0FAxy-wzZpxg/o.jpg"
      }
    ],
    "user_id": "V74paj6Zok4DvGnciFEZMg"
  },
  "CdqfPmDi_5d4xuwA5q6Z5Q": {
    "date": "12/30/2017",
    "text": "The Grand checks so many boxes for a downtown food/drink establishment, especially in Phoenix. The location on Central is amazing walking / biking / light rail territory. It stakes a big claim across from the very busy Phoenix Public Market and its Saturday farmer's market. The building is so beautiful inside and out. So much to explore, and is great if you want to read or work, and just as good if you want a night out on a gorgeous patio, or in an intimate sitting area upstairs. The food and drink selection is great, delicious, and priced very well. I have come here several times for a myriad of reasons.  However, just out of my concern for wanting to preserve good things when they come through Phoenix, ESPECIALLY a decent restaurant, Cafe and bar like The Grand: the service is always at least, a shit show. It's clear that there is a poor communication among it's many moving parts. I can't imagine how cumbersome that must be to navigate if the aim is to provide at least par service. Food always comes out at different times for every guest, even on the same ticket. Drip coffee once took us 30 minutes to receive. Staff tends to avoid eye contact, or any contact during this time, instead of some reassurance or communication that everything will be coming at some point.  So why do we go back if the service is a huge question mark? The food, drink, and atmosphere are really excellent. The menu is well designed. I just want to try and stick it out and hope the kinks work themselves out for a place with SUCH promise. Some evening and bartending staff are exceptionally attentive, so that's nice to see. It's unfortunate that all anyone has to say about the Grand is that service and communication are a giant question mark on any given day. I wish this place well and bid it adieu.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "EYZ3jFbIcKcL5wHR344NmA"
  },
  "4rseqkJ80wxd3phyI7gKQA": {
    "date": "8/6/2017",
    "text": "Nice spot to chill but they kept running out of everything. Saturday they were out of stuff to make paella and Sunday they ran out of chorizo and couldn't give me a lemon in my water because they were running low    When I did get chorizo it was super tasty with the biscuit and gravy. The hibiscus drink was also strong and delicious (totally recommend). Night time playlist was also the bomb.... place kind of picks up at night.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_4nl1_JNiWj8PU2auSOrqA"
  },
  "Wz1Jk8u1Tqeu8KAcjxr_fg": {
    "date": "1/2/2018",
    "text": "Service and atmosphere = 4 stars. Super cool joint, steampunk vibe if you will. The espresso machine was broken, what?!?! The silverware was a nightmare, we literally dug through to find something usable and still wiped it down....maybe their dishwasher was broken but show some pride people!!! We shared a couple things, burger...cauliflower bites...nothing to yelp home about unfortunately. I ended up with a hot tea, it was delicious, they have a large choice of brewed tea. This spot has some enormous potential and a great staff but needs some serious management.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3Y7KI-jzy8rMgzAxGgfNDQ"
  },
  "tL3DYz2bfR__R6zZ4dmO9A": {
    "date": "7/21/2016",
    "text": "Went by to check it out and super friendly staff, great looking place.  Beautiful addition to downtown Phoenix, lots of small places to hang out, play games, beautiful patio!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3STxnuyC2Zhxs4xeeN7Qgg"
  },
  "n1AoBlUPwA_WSt_zVz5j5w": {
    "date": "7/17/2017",
    "text": "This place is exquisite! The atmosphere is wonderful for people who need a place to study and for people who want to enjoy a cocktail with friends. With that, the service is incredible! My favorite server, Tori, is incredibly accommodating and kind. Along with the atmosphere, people like her are the reason this place is so great! I would recommend this place to anyone. If you go for drinks, try the \"Strange Brew\". Keep being awesome!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "herhwGnDPrK-G2fr3LuQYg"
  },
  "ACXzka0w-KWN4UHms62YcQ": {
    "date": "5/12/2017",
    "text": "It would be helpful if service was provided. After sitting for 20 minutes and a slow night we got up and walked out. Nobody could be bothered apparently. Cool place...needs much better service",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xK4kmUoLNe7U9ueYbM8gsQ"
  },
  "TNqTutFbCbfCy05jDZJhuQ": {
    "date": "6/6/2017",
    "text": "Literally spent all day here. Very interesting atmosphere, a retro steampunk wonder... you get stuck and don't want to leave! The coffee was great. The food was mostly good. I got the ham and cheese, which was yummy. I had the house mac later, big mistake. It tasted like noodles and milk, there were other yummy looking things on the menu so I won't hold that against them (i have this thing about mac and cheese... it's complicated). My friend got fish that came in naan which she loved. Anywho, I had always hoped to find an awesome place like this here in Phoenix. A bar, resto, and coffeeshop all rolled into one, complete with a not-so-hidden speakeasy and connected to a full on nightclub that goes into the wee hours. Did I mention they also have a community stage? The staff is super cool too! The GM, John, is an absolute gem! He took us up to check out the speakeasy since it was open to the public that night. Once inside we were introduced to Nicholas, the bartender. He was fabulous! Funny, friendly, and makes a damned good drink. I can't wait to go back and explore The Grand a bit more. I feel like there was still so much I missed out on.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aAS9r1piyBEwkjSiRPR1HQ"
  },
  "8P7n9fs19gzXQHtWx5uqfA": {
    "date": "7/25/2017",
    "text": "Love The Grand!  There is a great vibe here!  Cozy yet practical. Large tables to spread out at with chargers in the middle of the tables. The staff was friendly and the food is great. The Grand really makes the concept of coffee shop/bar work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z-8SBiWb_enWgRczjRRpeA"
  },
  "HqJqNEJmfZQY5JkRRVa12A": {
    "date": "7/24/2016",
    "text": "Awesome place for the neighborhood.  Always nice when you can get a coffee or a beer or wine.  Great beer on tap. Friendly staff.  Remodel they did looks great.  Love the vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DTs7-oWGPJX4WeXxDk5hmg"
  },
  "ui_ujnw1X7clrfYdAx6LUA": {
    "date": "7/16/2017",
    "text": "Great spot for just about anything! Study session, Sunday brunch, late late night bite/night cap. Ruben was so peachy and lovely! Glad Phoenix is bringing this type of vibe to the city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cXFHaUI46skSXNvzt1HF8g"
  },
  "kjLK3PYi2KKZ4dBLq8_Evg": {
    "date": "7/2/2017",
    "text": "This is an excellent stop in downtown Phoenix. Every server we met was chipper. The menu has a lot of variety and includes dishes with interesting add ins, like matcha in the waffles. We came at 11 am on a Sunday and had no wait for brunch. The lattes were tremendously excellent. Between us all, we tried the matcha waffles, the avocado toast, and biscuits and gravy. All dishes were top notch. The place has great ambiance, too, and is excellent for a family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OjIK4lVngc3dzhTs-eiaUg"
  },
  "E0bvnELLMU5imhbPMzKwsw": {
    "date": "2/12/2017",
    "text": "Totally a hidden gem down town that I'm almost hesitant to tell everybody about because I LOVE having this be like my own secret place of amazingness! If you believe in magic and are a non-muggle, then you'll love this place because it's a renovated train station that used to offer direct connection to Hogwarts. If you love history, then you'll love this place because almost every piece of furniture and decor in this place has a story waiting to be told. If you're a hipster or a college kid or an aspiring writer or a business person then you'll love this place because it's got a great vibe and atmosphere coupled with tons of little nooks and areas that are great for you to work at. They've got coffee, tea, and pastries to help you start your day or carry you through the afternoon, and then they've got a full bar and beers on tap to help you celebrate having made it through the day. The outdoor area is gorgeous, and I totally love the fountain that they have out there, and then for the ONE COLD DAY in Phoenix a year, they've got plenty of heaters outside to keep you warm. It's only a matter of time before this becomes the next \"in\" thing in Phoenix. I come here all of the time to work on a book that I'm writing and to enjoy a pastry and some chai tea. DEFINITELY check this place out- I'm sure you'll love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UDg-UgAOmhxE1Wl-JqvKmA"
  },
  "0yznVYMnp7ex3RJjDIHe1w": {
    "date": "7/14/2017",
    "text": "Fun place to stop in after work. Mac n cheese was enjoyed by multiple people at the table. Prices were good and we will be back to try their drink menu next. Parking can be challenging but it is worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZWBEeLWKs8V63TtUbD3e9Q"
  },
  "q0c00iNLG_w1QhobRNERxQ": {
    "date": "7/2/2017",
    "text": "I really wanted to love this place. Really cool vibe and good coffee. Just don't order food. We waited forever to get our meal only to find out they ran out of what we ordered. The wait staff was friendly but that doesn't make up for poor service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z_5RhugaOxseW2jSGusy8Q"
  },
  "p2sO-K19ehsUdWsqkGdKMQ": {
    "date": "7/1/2017",
    "text": "Just tried this place out for the first time today. Had breakfast and coffee... it was great, the team working there was amazing. They have a full bar inside and also serve all meals. I had no idea this was all inside but I am in love with it. Can't wait to visit them again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XRJVbZ3YwZEZWnAOpetKpQ"
  },
  "h-D5fYosZ_RdclDRI6VRyA": {
    "date": "11/6/2017",
    "text": "Beautiful inside and outside with a very relaxing patio, but it's clear that's where all the money went. Food was barely decent: I had the BLAT and the egg white was runny (undercooked) while the rest of the sandwich was just so-so.  My mom's scramble lacked flavor or character. The self-serve water was clearly from the tap and tasted moldy. Coffee was not anything special, which is immediately a bad thing for a coffee house. Overall, an average person could have cooked a better meal given the ingredients available. Service was lackluster in a disaffected hipster way.  The patio was in need of sweeping and table wiping (there was a cigarette butt on the table and another one under a separate table as well as other bits of trash, for example).  I would totally eat out on their patio again, if I could bring my own food and drinks and a rag to wipe off the table beforehand and didn't need anything from the staff.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dL-GREYbV6YMzLIeeWIQfg"
  },
  "hg_GdvR0GX_S1NiF546XZA": {
    "date": "8/1/2017",
    "text": "Really cool atmosphere great selection of beers and wine. Ordered the avocado fries and overall they were good however the sauce they came with was too hot. Got ranch instead which I feel didn't compliment them very well..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hq2VZ9_E8FU9DCZc1NukUw"
  },
  "hkJG_aEAJgbpr0xQ4-OnMA": {
    "date": "3/12/2017",
    "text": "Sorry. I missed the good service that others mentioned, even though I was seated in front of a service staff meeting. For my snack of avocado fries and beer, I received neither a napkin, utensils, water or a follow-up. The avocado fries presentation --a handful of slices of battered, deep fried avocado on a large bare white plate and a plastic ramekin for the condiment--made the $7 dish look especially cheap. The server also failed to offer amends when the service shortcomings were pointed out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TGjSxqGOBl4BiE966PmxAw"
  },
  "zYcOHElOx9_v6YIkMKvbAg": {
    "date": "5/29/2017",
    "text": "I've been to most of the cafes in the Phoenix downtown area, and this place has got to be one of the best in town! The vibe is very old-town with a hint of industrial decor. This place doesn't have very much lighting, but the atmosphere in general is very relaxed and great for chilling our or studying (on a computer). It's even open 24 hours! I'll definitely come here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "489jkxpJWXKlT8gMPRIQBQ"
  },
  "cwnrXcpMGrmoq1Jt2hjMsg": {
    "date": "5/19/2017",
    "text": "Absolutely great place. What a great transformation from what this place used to be. The counter service is quick and efficient. Custoner service is great. The food options are good and the late night menu offerings are good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hC1HJhtQH59sjltCWQ5Yeg"
  },
  "7JlBRU0nhyKg7ZYv5PrAVw": {
    "date": "9/15/2016",
    "text": "a friend of mine and a group of her friends who were LGBT refused service because of their sexual identity. This friend who just an ordenary person and a good person too and not offensive about their sexuality but still , this type of behavior by any establishment should not be tolerated",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wgFUTpuKIJapbPJzCQ4lyQ"
  },
  "oWWYqBDBZ7IZXq9crsL8cw": {
    "date": "5/3/2017",
    "text": "This place reminds me of all the books I used to read as a kid, except this time I'm actually in them while still being served great coffee, great food, and an awesome playlist. As a college student I'm definitely coming back, not just because it's 24/7, but because they offer a discount. After my second visit, it's become my favorite place, I hope anyone reading this gives them a try as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N4nl2pWQ7Pm8MdN7X0xkFA"
  },
  "7IqTX7-bV2GIz_DTSBlkXA": {
    "date": "8/14/2016",
    "text": "I just want to say how impressed I was with this place. Loved the unique and nostalgic decor and just want to say how friendly and polite the barista was. I noted a prior posting someone had commented on poor service and the owner took it upon himself to make changes. Congrats to the owner and staff for understanding the importance of good customer service and that teamwork will bring in more happy customers and then it becomes a win-win situation for all",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cXR7PnThzRyDU6SoDcIyGA"
  },
  "pCOYN6ZpIWpUCv5DFcZnOQ": {
    "date": "9/8/2016",
    "text": "A decent coffee place downtown. Their latte had good flavor, but the cold brew was very bitter. Plenty of space to grab a spot to work by yourself or with a group. The music they were playing did not really suit me. It was a sleepy trance-like music that defeats the purpose of why I'm getting coffee in the first place. They do serve alcohol which makes it a good place to hangout, but I would not go out of my way to come here for coffee.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TLEgiGIVraPHvqK455hJGg"
  },
  "o81RrlrK90ZsuAdZbTApKw": {
    "date": "5/17/2017",
    "text": "Grand Central really embodies an urban vibe and as a student downtown, it's one of my favorite places to go to get off campus to study and grab a coffee with friends. I've been coming here regularly since it first opened and it's been really fun to watch it evolve over the past year or so from a hidden gem into a very popular place for what seems like a mixed crowd of both locals and people visiting. While everything I've tried has been good, their prickly pear lemonade and white chocolate lattes are my favorite. Everything on their food menu is beyond delicious- especially their mac and cheese, which they mix up toppings everyday!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K_DfDE2IFuXPX3-g3Evruw"
  },
  "CYzvQxs9vVC5dOkVE4eQuw": {
    "date": "7/17/2018",
    "text": "Soooo sad. First time I came here it was after a concert at Crescent Ballroom and I Googled 24hour food, and The Grand showed up. It was minutes from Crescent Ballroom, which was so convenient. This place is beautiful! Big patio, quaint bar, cute upstairs area and they served restaurant quality food 24 hours a day. It was 2am and the food was incredible! I had a delicious, quality burger and Mac N Cheese. Also, they had a coffee bar with pastries and donuts. I gave this place a 5 stars for my first experience. However, a group of my friends and I came back to this place a second time at 1am and they no longer served food late night. In addition, they took the Mac N Cheese off the menu, which is a staple. We ended up leaving and going down to The Welcome Diner who serve until 2am! Had an amazing experience there, the food was sooo delicious and I loved the vibe! Definitely a spot to go to if you need late night food. Hopefully they bring the food back late night at The Grand. I've never heard of any other quality restaurant staying open 24 hours and felt that it really made them stand out. My group of 8 friends were really disappointed with the experience after I had talked it up. Unfortunately, we won't be returning unless they bring back late night food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R4u1JL_sJdyjBUetFMNJFg"
  },
  "2gdwL-I8-Jd0PPeAtbnOdg": {
    "date": "7/29/2016",
    "text": "The jury is still out on this place. They didn't have drip coffee because they \"only sell two cups a day\" according to the barista. Sure it's the middle of summer, but I see this as a marketing/quality issue. I tried a muffin and it was stale and bland, I honestly can't tell what kind of muffin it was. There is entire campus a block south of this place and customers will walk here if they have a quality product. Service was okay, no complaints but I wasn't particularly impressed. With so many great choices nearby they have a lot of work to do. On the plus side the interior is great and patio looks promising. I'll be back in a month to see how it progresses.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "07Ip3hIWLzCkz9F7Vau6Tg"
  },
  "_r0pAQgDc4KJ1pNH3KFZqQ": {
    "date": "7/23/2016",
    "text": "Starbucks has better coffee... Not much of an ambience of a old train station. Interior design theme conflicts with their menu. Looks more like a ghostbusters coffee stop. Suited for Halloween. Dine-in coffee served in disposable cups.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "AFE2uzfnRghEyM98xZUANA"
  },
  "HE8y2VRH731revPJXPkzEw": {
    "date": "11/13/2016",
    "text": "This place has some amazing architecture! I love this place and was able to try out quite a few teas that they had and they were spectacular! I was told there is also a club connected to this place and they also serve beer at the coffee bar! I would definitely recommend this place for studying, relaxing and lounging with friends, or just finding a place for great Coffee & Tea!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MOJBcjCHW-Kzbh53EscFBg"
  },
  "UBAQ2idzBJEtkDgVzO5uMg": {
    "date": "11/15/2017",
    "text": "The food is pretty good but the customer service needs some serious improvement. The cashier literally tossed my receipt at me. A guy in front of me got coffee and got a lid on it but when I got mines she didn't put a lid on it or asked if I wanted creamer but instead she was busy talking to one of her friends that was visiting her at work. The workers just kept talking and not even paying attention to the customers. I work in the food industry and this is the worst customer service I've ever experienced.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BMg-aPcRe6MmVZj_UzChzQ"
  },
  "DZYBKiz4repLJ-ez1mvdhw": {
    "date": "7/23/2016",
    "text": "this place has a great atmosphere, location and vibe. i truly love the feel inside and the patio areas (when it cools down). excellent architectural and interior design. the happy hour time slot is great. great beer.  i originally gave 3 stars but i am now changing to 5 stars.  original -i visited at 8:00pm and wanted a decaf coffee. they do not have decaf! grand central coffee is a coffee house. it is located in the usa not argentina. why no decaf?  revised - i returned, with my lady, for happy hour 2 days later and was greeted by charlie, general manager. super friendly and inviting. he asked if this was our first time in. the opportunity arose for me to explain about the decaf. without even skipping a beat, he said decaf would available tuesday morning. wow!!!!!  original - the choice of scotch is limited to two. revised - soooo, i told charlie about the choice of scotch. turns out there are several dance rooms each with their own large bar. he took us for a guided tour and there are many choices to pick from. wow!!!  my lady was thrilled to see all the dance rooms and simply asked if they had a disco night. charlie responded by saying that was great idea and would plan one!!! wow!!!  original - no food other then pastries. yes, i was told the kitchen is 6 weeks from opening.  revised - well, it is 3 weeks out not 6.   original - the staff was not that welcoming. i felt they were not happy with their jobs. no smiles. revised - charlie had others complain and the staff have been replaced.   ok, the first visit did not \"wow\" me. i am so glad i returned. especially running across charlie. and, the new bar tender robert was extremely friendly and accommodating.  ok........i have been \"wowed\"  i now hear the call to return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "z8DZjgRKBeVehxHXDd0GcA"
  },
  "g-IzrF1d_hDAdAmOVj4ltw": {
    "date": "2/19/2017",
    "text": "This is a great spot in CenPhoen. The bartender displayed manic tendencies. And I quote \"I'm just dramatic tonight\". There may have been some murders here, but overall but a great spot. Free shots on your birthday. They hate people from Ohio, but Ohio is a pretty miserable place to begin with so I can't argue. Botton line, good beer good coffee, and a dece vibe. And please don't fire the bartender because of this review.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txycoa3DyzeuY0rI1Uk-wg"
  },
  "I4xuZQT-9TbBF3FWHCrbkg": {
    "date": "1/4/2017",
    "text": "First time visiting - fantastic setup and cool vibes. The brownies are delicious and the bartendista Bernadette makes a really good latte. I was also lucky enough to meet The Tanner from Grand Central on my first visit. All members of the staff are welcoming and extremely personable. I would recommend Grand Central to anyone looking for a cool coffee spot downtown.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dlDIgtXWi9M3D3WXeQ0-tw"
  },
  "aY4CVdpwHkRv6_Ja3_eBGA": {
    "date": "7/14/2016",
    "text": "Come see Ryan Gosling working behind the bar!! great service here at The Grand Central Coffee Company !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kEA4kEeI7RakrbwjlP0WZA"
  },
  "opa4x8xUZ0EzoDVn3O68DA": {
    "date": "6/22/2018",
    "text": "coffee was good but im most impressed by the fact that my cup stayed put in my cup holder despite crashing my car. overall would rate this place a 5/5",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NQwWfZE95D0Nbokgxo8dVw"
  },
  "PXlxyYBoIOju27M-eDzvuA": {
    "date": "12/14/2016",
    "text": "I like to try new places around phoenix so I decided to come here today. I was promptly greeted by Bernadette and she was so friendly. I wanted to start with a coffee and then the pastries were just looking at me so I got one of those too and she quickly offered to heat it up which honestly made it so amazing. The coffee was fantastic and I got to finish my reading so maybe to reward myself I would grab a cocktail. This place was cool and had their own delicious signature cocktails! It was made to perfection. I'm going to definitely be coming back here and bring friends the place has such a cool environment! Thank you again Bernadette!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WGNiFX1KAjSjzMILY28UWQ"
  },
  "QPcbJM86Qcnk9ARuXpjgzA": {
    "date": "9/2/2016",
    "text": "Love this place. Looking forward to performing there on the 25th of this month for the first Community Alive gathering.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LVZod_maTwG3r00tUoIYFA"
  },
  "222YhgpUR7wKBaJx1gnWCA": {
    "date": "8/14/2016",
    "text": "The atmosphere is on point and the coffee is great! Can't wait till they have their full menu up and running!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mUWKYaDcrtj7mPIERuI7-w"
  },
  "COoRObvtf3SUfWtD9CZjCg": {
    "date": "4/3/2017",
    "text": "Really disappointed, was down at the March Madness, found This little gem of a place to relax, at 6:30 pm has a great menu , the place was not half full, went up to the counter to place our order to sit on their great looking patio! The girl tells us she is sorry they aren't taking anymore orders for the night there's only 1 chef working and he is backed up???? What? Are you kidding me? We just laughed, would of loved too try a new place a 4 star atmosphere 0 star for customer service an unable to rate food Boo!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gg0IQm9lmV3Y4PO4Basivw"
  },
  "4FN2_ldHPjaG_VXUQlJiFQ": {
    "date": "1/7/2017",
    "text": "Great setting and pretty decent espresso. Would recommend they serve with sparkling water given the type of establishment and quality of bean.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "50r_tZ-ku5zkXAieQOaMOw"
  },
  "j9XrgCPzyufBnhBkAToUyw": {
    "date": "10/17/2017",
    "text": "Downtown for some business around lunchtime we saw this attactive spot with really good music playing on the sound system outside.  The decor very interesting and the menu looked good.   First sign of trouble is that ordering must be done at the counter, right at the register so if you don't know immediately what you want, it's awkward to block the counter while deciding.  The paper menus are dirty and wrinkled with fingerprints and food stains on them.   After ordering, we were told that we must stand and wait there for our beverage order because, even though we were given a table number, they only deliver food to the table, not beverages.  Ummm,  okay. We ordered the mac and cheese of the day and two Yardbird sandwiches.   When the food was brought, the server apologized for the long delay and we were dissapointed that the orders were not as described.  The mac and cheese was a small portion for $9.00 and was missing the critical ingredient of bacon that was supposed to be in it.   The sandwiches were missing listed ingredients, the chicken on my sandwich was dry and chewy, there was no sauce of any kind and the cook had opted to add raw jalapenos to the sandwiches which were not supposed to be there.  Big Change. They did refund us the $ for the mac and cheese but the whole experience was unpleasant.  I would return to have a beverage and enjoy the decor but I would not order food there again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lkb0yglsDER5kMmj_Acqxw"
  },
  "hJVXfOEBHZj9OSGPt74h7A": {
    "date": "6/19/2017",
    "text": "Buyer beware!   Happy hour menu $5 wine bogus ... charged $8 per glass. Waitress response was that the system was updated and that's what it rings up as and there's nothing she can do about it.  We pointed out that the menu says $5 and got nowhere.  Asked to speak to the manager ... not there of course.  This all would've been much more palatable if the waitress was sympathetic in any way or had provided decent service over the two hours we were there.  She couldn't be bothered ...  too busy runnng her fingers through her hair every 5 seconds!   (grossed me out!)   Amyway, make sure you ask before ordering if you are expecting happy hour pricing.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OV-5frxOaJxgYo_ImB5mgw"
  },
  "Qsa4XgaS4bGBmefGjhm_6A": {
    "date": "7/15/2016",
    "text": "Excellent range of craft beer on tap! Super cool atmosphere! Once kitchen is up and running will be a great new downtown spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VM-IF_BqeDOOoKNT7YDg4Q"
  },
  "G7V1VV2v758F1HNkcyuJIA": {
    "date": "4/2/2019",
    "text": "Open 24 hours, revives the old feel of Amsterdam (prior Bar it used to be) but gives it the current feel to appeal to everyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TLtefwhe7EgCPbpyJsTeMg"
  },
  "7z61aQSPh8-zFkYAWNDo0w": {
    "date": "7/22/2018",
    "text": "Great little spot downtown.  We had already eaten so didn't order food but it's a very charming place to visit and have a mimosa!  Should I find myself back in Phoenix I'll definitely come back to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3CcUI1joSGsNGWpb2pmKJQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3CcUI1joSGsNGWpb2pmKJQ/o.jpg"
      }
    ],
    "user_id": "YzckMAdpT00nnHutGtTWEQ"
  },
  "KnU-v6Y-E18mxaA2hE00XA": {
    "date": "2/17/2019",
    "text": "I loved this place. It was so unique and everyone was friendly. We went looking for Sanctum (which is a bar upstairs and was closed by the time we arrived) and ended up here instead. They serve alcohol, coffee, food and baked goods. The food was just eh, but the croinut was amazing. I ended up getting another because it was so good. I keep dreaming about it and will go back just for that sometime soon. Definitely recommend this spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9sj8k5kvgUj7SBjqLXZiQg"
  },
  "trigKPJX1FbWelGrewHeFg": {
    "date": "7/10/2018",
    "text": "This place was so awesome! We were in town visiting and stopped by here to have lunch and chill for a few hours before the long drive back to LA. We had a mac & cheese burger and buffalo chicken sandwich, which were both delicious and hit the spot. They also had a great beer list. We decided to grab a coffee too to prep for the drive and ordered the iced lavender white mocha in their biggest size. What we got was practically a jug of the most delicious iced coffee drink I've ever had. The ambiance of the place was great too. Seriously amazing, would highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OJEXhYnLsTGrA_9svXs18A"
  },
  "fQMDMJ39y76cK-g-n1g0dg": {
    "date": "11/12/2017",
    "text": "I was blown away by the grand. Wow! One of the coolest places in downtown Phoenix this gem has It all- food, coffee, beer. I ordered a beer. The beer menu was full of unique craft beers. The bartender was cool and let me try like 5. Ended up getting the maple porter which hit the spot. There is indoor and outdoor seating. There are people partying and people studying. I'll be back 4 sure",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gq1Ar9SSorSDWBKYFfU-Aw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gq1Ar9SSorSDWBKYFfU-Aw/o.jpg"
      }
    ],
    "user_id": "ssY5madTrd_ZAiV8av9kug"
  },
  "ajEItGNBJuPAVU7TbtIeLA": {
    "date": "5/19/2019",
    "text": "Truly appalling service.  Sat at bar Sunday am with thought - hope - of having coffee, breakfast and maybe a brunch cocktail or two.  Waitress takes order and gets us coffees and pastries and leaves never to return.  My wife tracks down utensils and napkins - all why two guys\"working\" the bar, who ignore us without a hint of recognition, have a nice chat.  Breakfast never comes - we eventually discover it sitting on the kitchen counter. Cold eggs and bacon really hit the spot.  5 more minutes pass with the uneaten plates before us when waitress cluelessly asks \"how is it?\"  Girl apologizes - explaining they got \"swamped.\"  Frankly, she was working the coffee machine but that's no excuse to ignore customers from whom you took an order.  The bar guys, after 45 mins of accomplishing nothing benefiting their employer, then turn around and for first time say \"Can I help you?\" Apparently that's the appropriate way to greet previously ignored customers. Owner - I'd consider some personnel changes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cHu-gKYagqsuMYLgEBmYyA"
  },
  "tgfoR5pLYDrOXAkO6dTGOw": {
    "date": "11/10/2017",
    "text": "I've been here a handful of times and this place is always busy, which is a great thing but this time I was very very disappointed. I waited over 40 minutes for just the regular Mac & Cheese. When I finally asked the staff when mine would be ready they said \"it's right over there, I'll bring it to you\".... so when I finally got my food, it was luke warm at best AND some of the noodles were either over cooked or not cooked?? I couldn't tell which one other than they were crunchy. So I'm going to assume not cooked properly.   The only reason I sucked it up and ate what I could without complaining to the staff was it was Friday and it appears there were only two floor staff... TWO. That is absolutely ridiculous for a Friday and a day where most people have it off to observe Veterans Day. I felt bad complaining when I could see that they were doing what they could with the limited help that they had. Shame on management for not staffing more people and shame on the kitchen staff for serving undercooked noodles...won't be coming back.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GP_gJRKN6si02SkUAbKSQw"
  },
  "raO2wyeD7NkSY0q4AGBGzw": {
    "date": "2/12/2019",
    "text": "Just drove in from Orange County and needed a bite. Stopped in and are glad we did. Very nice interior design and the food is delicious. Very nice employees and the prices are acceptable. Would definitely recommend this place to everyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cT_3N77k2cAS0LTMhKqEOg"
  },
  "CeOIT7HOMhL40l6SCXJhdA": {
    "date": "10/29/2017",
    "text": "No greeting. Asked about non alcoholic drinks, was kinda rushed. I then asked what sizes they had and got a reply of \"yeah\".... oh okay? Then me and my friend ordered the same thing the zombie with the Mac and cheese, both were different in every way shape and form... look at the pictures.   What a weird place. Service was crap, food was meh, drink was just okay",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qsc0oZ8UvaAGkDb8FI9fHA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qsc0oZ8UvaAGkDb8FI9fHA/o.jpg"
      },
      {
        "img_id": "MoDTpW7cRTXwz0KLD0Gsvw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MoDTpW7cRTXwz0KLD0Gsvw/o.jpg"
      }
    ],
    "user_id": "j0fPDfn0_Eev8OAZvRTlkA"
  },
  "wFItbP9hdq_IfNVe4pOaEw": {
    "date": "11/30/2018",
    "text": "I came here for lunch. The decor and music were not to my taste, but some people might like them. The atmosphere is probably better for nighttime - it feels dark and slightly dingy, not a good cafe vibe. All of the tables could have used a wipe down. I had a medium iced latte which was huge (24 oz?) and quite good. The food was disappointing. The BLAST sandwich (BLT with avocado and Swiss) was not made with quality ingredients. The \"swiss\" tasted like processed American cheese and stuck to the roof of my mouth. Avocado was a smooth premade spread and tasted like mayo. Bacon was precooked and dry. The beer-battered fries were served crispy and hot, but tasted exactly like regular fries. Would not make it a point to return.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xCVB2JqjrDsiHyFckMACrg"
  },
  "lJd_AYIHt1O34JBSOfSidQ": {
    "date": "9/23/2016",
    "text": "The Grand Coffee House. Coffee \"joints\" seem to be springing up all over. Some are good; some are just so-so. The Grand is certainly in its infancy stage but, if the coffee is any indication of what the final will be, they may just have a winner.   The Coffee House and Front Bar take up just a small portion of this large building. There is also a large patio with a window to the bar.  I attended an event here that included a complete tour of the large party rooms. There are three (at least that I saw). Excellent opportunities for large company or family holiday events.  The interior design decorations are large scale and one-of-a kind. Collected by the owner from NY to AZ. My assessment of the design would be \"large-scale eclectic.\" Antiques, modern, country, old world . . . a little of everything. But it all seems to fit and is very welcoming. He definitely has an eye for the unusual . . . and, yet, it seems homey and very comfortable. And, most of all . . . FUN!  The event I attended had food prepared by their chef. It was excellent. And the alcohol drinks on their menu board sounded fun. Just like the rest of The Grand Coffee House. Definitely worth a try. Watch for the Grand Opening coming soon!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "l3IpskzodX91i_7SUldzrQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Sept 2016",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l3IpskzodX91i_7SUldzrQ/o.jpg"
      },
      {
        "img_id": "8vRuk2zaQKnhSms6kwiLsQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Sept 2016",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8vRuk2zaQKnhSms6kwiLsQ/o.jpg"
      },
      {
        "img_id": "3TWQ_LrELREEKruVna3Y0g",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Sept 2016",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3TWQ_LrELREEKruVna3Y0g/o.jpg"
      }
    ],
    "user_id": "PcPminF0bIUsKjUh9e4DMQ"
  },
  "dkVL6iloc7Nb8JFWB2LDbg": {
    "date": "1/24/2019",
    "text": "There is not heat (36 degrees this AM and to top of off the internet does not work. At least the barista was great and had a good sense of humor about it as you get the sense that even she has given up on this place. This place will not longer get my business",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tmcAdH2bY5li4NgSJCSbg"
  },
  "wwM32P3iMpo5Citglzj78A": {
    "date": "9/16/2018",
    "text": "Pretty fed up with this place. The WIFI NEVER works and it doesn't seem like anyone cares to fix it nor is there anyone around who can fix it. Interestingly enough, the WIFI is never down to accept payments on the iPad system. The temperature is always off upstairs. It is sweltering and uncomfortable. The food is mediocre at best. I'd forgive all of it if the WIFI actually worked.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "AEQpkY089QMaP5ECx7qYRw"
  },
  "z3yDSkLT2N8csN4wZpxIWg": {
    "date": "2/3/2019",
    "text": "Giving this place three stars for a few reasons. Honestly, I don't go to coffee shops for the coffee too much- I go for the atmosphere. The atmosphere is what gives it a higher(ish) ranking. Good music, friendly employees, lots of table space to do work/paint/draw/ whatever hobby of yours you can do on a table. The thing that knocked it down is the price of drinks and food and the fact that you have to pay for the WiFi with an overpriced and honestly not that great almond milk chai. With that being said, I've heard the coffee is decent and if coffee places are your go to place to do work, this is a pretty good place to go. And apparently there's a room upstairs dedicated to like \"finding yourself\" or something and that spooks me just a little bit but go try it out if that sounds like your thing",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U9DJxrZdU3GXdM_GyfKphQ"
  },
  "H7V1Foc4_sex2kwu7zZwFA": {
    "date": "4/18/2018",
    "text": "How does this place have only 3 and a half stars? Crazy good food, open all day, great ambience, what's not to like??  My girlfriend and I went here for the first time the other day and both ordered the Grand Burger cooked medium. They came out undercooked; it's all good, it happens. I hate having to bring food back, but Tori and Robby gave excellent customer service and got us some new burgers which were amazing. It was their welcoming and sincere attitude that really made all the difference in the world.   Also, the inside of this place is so cool! It has an upper speakeasy area up a staircase, and an outdoor area with a water fountain and a stage for live music. Such an awesome place. We will be coming here often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hW2iEOhcxqIukzeEtlVfAw"
  },
  "TCC5SoD25vlZaKt8tBkYSQ": {
    "date": "2/2/2019",
    "text": "This is a great place for your entire squad. They have live bands all the time. You can get coffee or a beer. The food is incredible. The design of the place is really interesting also. It's the perfect place for a date.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QZqrHXBCa1aNeDDyKwYSzw"
  },
  "OgBCyto390Op6T_dc0XZJg": {
    "date": "7/29/2016",
    "text": "Excellent. Excellent. Excellent.  Not like we need another coffee shop in the hood, but this maybe our nicest/best yet!   The place used to be a nightclub and now it's a beautiful HUGE coffee shop with hard liquor and wine, and plenty of couches and tables (two levels!!)  I had a caramel Latte and it was Excellent. Excellent. Excellent.  And they have beautiful outdoor patio and parking on the north side of the building. Just awesome!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "9iJ9CUo_Es5kMe0D-MsBhQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Inside",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9iJ9CUo_Es5kMe0D-MsBhQ/o.jpg"
      },
      {
        "img_id": "_lpeFiF0i41OXukH6nvwdg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Inside",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_lpeFiF0i41OXukH6nvwdg/o.jpg"
      },
      {
        "img_id": "Q6Mv3xZSjhakZiBw6pzTUA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q6Mv3xZSjhakZiBw6pzTUA/o.jpg"
      }
    ],
    "user_id": "U2sN2-HGvh27FyXKFlvkBg"
  },
  "BJgmdJQyze_qxseUe2gdSA": {
    "date": "3/27/2018",
    "text": "If I could give different ratings for different aspects, it would be this:  ***** (5 stars) for the space. Whether you're looking for a quiet nook to study with a latte, or happy hour drinks on the patio, the space is divine. Interior decked to resemble the inside of a train station, it's gorgeous & worth exploring. Special mention: the steampunked bike rack.  *** (3 stars) for cocktails, coffee, bartending staff and value (you are paying for location & ambience).  * (1 star) for food & food service (and that's being generous). Over-cooked burgers unappetizingly presented with wilted lettuce, house special bacon & chive mac and cheese that arrived with NO bacon, child's chicken tenders so over-cooked & dried out they were inedible. And the server seemed annoyed at every question (where can I find silverware?) or request (does this have bacon in it? Can I get bacon in it?), and getting the simplest things wrong (can I get a box? and being handed a bag).   I'd consider future cocktails on the patio - but I value my digestive system, so that's a hard pass on ordering food.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AiMqBqOlw6SFtfSeaIucLg"
  },
  "hAKiLppgon0eLoiUiCfXnQ": {
    "date": "3/2/2018",
    "text": "Man I don't know how I missed adding my review when we came a while back, but here goes., I was so excited to check this place out! I am a lover of my coffee and to hear this place was open 24 hours I was so excited! I was definitely impressed the second my eyes came upon such a grand entrance. Pun intended. Beautiful gates, waterfall and outdoor seating. Once inside yet again I was impressed. So much to see that my eyes didn't know where to check out first. Even the water that sits free for anyone needing to hydrate was beautiful. That however is where everything went downhill. I ordered a few different coffees both hot and iced, a tea, a banana bread , and two boxes waters. The iced coffee was bland, the hot coffee wasn't very hot, and the bread was hard as a rock. I was bummed. Service was just as bad. The employees were more interested in each other than helping take our order. The place was  pretty empty as is was early in the morning so that was sad. I even came back a second time to see if my experience would be any better and I was yet again hit with coffee that was just plain awful. Bummer.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "bLyuwDtKNO-ws3Gngfn6Vw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bLyuwDtKNO-ws3Gngfn6Vw/o.jpg"
      },
      {
        "img_id": "xKPGw4FBlboXvs8Srlv5gQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xKPGw4FBlboXvs8Srlv5gQ/o.jpg"
      },
      {
        "img_id": "4cOmkP3vPzOCXitXThmWhA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4cOmkP3vPzOCXitXThmWhA/o.jpg"
      }
    ],
    "user_id": "QbDJB-4XAxn3BGwi6Rrzjw"
  },
  "1Fb9Z468TZz7lkRoM1CNvg": {
    "date": "2/24/2018",
    "text": "I'm saving the extra star here until I try the cocktails and food here. This spot is ridiculous it's eye candy for sure the train station arsty industrial vibe is awesome. Seeing the place is worth a visit. This place has the best coffee drink I've ever tasted in my life no joke. White Chocolate Lavender latte BOOM. That's all you need honestly lol. Such different flavors so creamy and herbal and just a perfect combination i got it with soy milk so it was even better. But that drink and the atmosphere here is worth 4 stars. The bar looks cool and so did the food, which I will try later. Also the fact that sanctum their hidden speakeasy-ish bar is here means that's their cocktail program has to be good, I'll try that too. I had fun and was like a kid looking around constantly to see what art or decor I could see and take in. Great place I love it. Check it out and get that lavender latter.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "yvGpukuI11XjMWvNiHiwEw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. View outside",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yvGpukuI11XjMWvNiHiwEw/o.jpg"
      },
      {
        "img_id": "WL6nE8vFOS8kY1LvxgLd1w",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Menus above the bar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WL6nE8vFOS8kY1LvxgLd1w/o.jpg"
      },
      {
        "img_id": "FUNSd31wLpVGhV1JN5uWBA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Love the rustic art",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FUNSd31wLpVGhV1JN5uWBA/o.jpg"
      }
    ],
    "user_id": "S_a_QqPbnNHtexHFpPd5EQ"
  },
  "a83XYi_Tml0qvU0zVqmrPQ": {
    "date": "8/23/2016",
    "text": "This coffee shop is very spacious!! There are so many different places to choose from -- from rustic chairs, to comfy sofas. You can lounge inside on the ground level, or upstairs, or you can choose to sit outside on the balcony, or outside under fairy lights. Either way, the views are spectacular and are lovely to take in. A couple of people were lying down on couches and others were studying and doing homework, while others were chatting. It is a chilled vibe, and I  really enjoyed the atmosphere. (So much so that I spent 4 hours with my friends here!)  The coffee itself is more expensive than Starbucks, and is not nearly as strong, but the drinks are good. I had a Caramel Latte and it was sweet enough to be enjoyable without feeling like I was going to get diabetes. My friends had a cold brew (which was not as strong as they would have preferred, but still good) and a Mocha Latte (which was good but tasted more like chocolate than coffee). The only complaint we had was that there was a ridiculous amount of ice used.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SLbT2szt7NJH5sKr95Yr5A"
  },
  "YkzqDBAWClYl8hA79pVaoA": {
    "date": "5/27/2018",
    "text": "Do not get the caramel apple martini!! Boyfriend got an IPA, his was alright. The environment was cute and large... the bar area was full and it took awhile to get drinks and servers mindlessly walked around several times with no regard for helping us newcomers. Not sure we'll be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "imbuRgvFjIMbI9gvG0I2SQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/imbuRgvFjIMbI9gvG0I2SQ/o.jpg"
      }
    ],
    "user_id": "WBJ2jZgo9E2puaUGEvA6og"
  },
  "RWDHwMXMFrbpgpreGnIkUA": {
    "date": "10/9/2017",
    "text": "Found this place this morning when out for a morning walk while in town for a conference. Absolutely loved it! First of all it was the only coffee shop open before 7am - why no one in Phoenix needs coffee before 7am on a Monday I don't know.   We had amazing breakfast sandwiches, the aioli made it. Great lattes and tea selection. Didn't try it but completely intrigued by their Fruitty Pebbles latte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lp6rfSWl4fC2BPirbb_vPA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lp6rfSWl4fC2BPirbb_vPA/o.jpg"
      },
      {
        "img_id": "8XhuhFf2vJ_mwoVjZdADqg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8XhuhFf2vJ_mwoVjZdADqg/o.jpg"
      }
    ],
    "user_id": "tDWbG11T1D8NXgsAJnXEjA"
  },
  "dL6O1bRDjbw3h9ENv_m-FA": {
    "date": "10/30/2017",
    "text": "ADORE THIS PLACE!!!! The go-to spot. 24 hours?? And amazing vegan options! I mean, the cauliflower wings are to die for. And sometimes there's live music! And downtown is where it's at. It's the heart of the fun parts of Phoenix. If you're new to Phoenix come here!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zBjnWLwsv9WUZb2Jslu_Gg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zBjnWLwsv9WUZb2Jslu_Gg/o.jpg"
      },
      {
        "img_id": "GLD13IkXU2H40YrBju6x3Q",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GLD13IkXU2H40YrBju6x3Q/o.jpg"
      },
      {
        "img_id": "K5BnGkNmZwrcuIjLa4z7Dw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K5BnGkNmZwrcuIjLa4z7Dw/o.jpg"
      }
    ],
    "user_id": "e7vGXrFcxl8JKWcE1ps2oA"
  },
  "O54qUhcelNvAPDsi2bta7g": {
    "date": "2/11/2018",
    "text": "Being vegetarian I was so excited to try the Cauliflower sandwich. Unfortunately it tasted like straight vinegar, it was awful. My boyfriends burger was burnt as well. When the bartender asked us for fries it was actually $2.50 EACH. At most places fries on the side are complimentary with a dish, and he didn't let us know it would be extra. Service was great and the drink menu was amazing, that's the ONLY reason I gave this place two stars.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qbn4Weie4hiMZv-A3htg-A"
  },
  "7MbQJ0ElF8wcyztC0kh3YA": {
    "date": "4/4/2018",
    "text": "How does this only have four stars? It's a little pricey perhaps but hands down the best coffee shop I have been to in any city. Friendly service, tasty coffee, super fast wifi, hearty food, and the most amazing scenery/sitting spaces. I'm thinking about moving in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5gl1TD3iMWzXVf_aJ56l_w"
  },
  "zIWPXjcw7CatCYd7VCHfqg": {
    "date": "3/7/2018",
    "text": "I really want to rate this place higher and am tempted to do so just because they're open 24 hours and our city needs those spots badly. However, the service has consistently been subpar. Several times, the ladies working the counter have attitudes and are rude. One time in particular, one of the gals did not want to help us and then gave us an attitude for asking questions about the menu. Come to find out, she wanted to hang out with her bf in the corner (who also worked there) and eat food. On a separate occasion, one of the ladies working the counter was rude because we didn't yet know where we were sitting before ordering. Sorry, but not everyone figures this out before ordering and if that's an expectation, perhaps post it. Don't take that stuff out on the customer, that's your bad homie. Sometimes the music is good and sometimes it's super bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s95vx3xjemGYd5qdZgRX4w"
  },
  "jOjKGE_tIkOrEItEppUgmw": {
    "date": "4/29/2017",
    "text": "A friend and I were going to try this place out for breakfast this morning. We stopped in and didn't make it past the main bar as the barista/bartender was incredibly rude. Having never been in before we had a couple questions about if the place was open seating, where the menu was at, etc. the employee acted like he couldn't be bothered even though he was not doing anything at the time since it was fairly quite with little crowd there.   Complete turnoff when you go to a new place trying to give them hard earned money and a staff member acts like they could give a damn.   I will probably go back eventually as the space and menu looked ideal, however not for a bit.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "o26A4xEV5ug8SE6fzaLTPA"
  },
  "KJKaSUkpblZs8TpkZCRLQQ": {
    "date": "11/3/2016",
    "text": "This place has quickly become one of my favorite study spots. The staff is great and incredibly accommodating. There's a world of couches and tables available for seating Wong with beautiful outdoor patios as well. While you sometimes have to search for an available outlet, the large space allows for intimacy amongst a sea of people (if you're there when it's busy). The coffee is pretty good and the pastries look delicious. I highly recommend this place for all students.   Just map quest it first so you can find the free parking.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bbsGJg6ZRdYX2p96LkmXiQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Lovely two story coffee shop.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bbsGJg6ZRdYX2p96LkmXiQ/o.jpg"
      }
    ],
    "user_id": "Sbo5x3XNgNxNZt_m8hA9Sg"
  },
  "n2ciQvm325lVo5s5ZoWR0g": {
    "date": "2/25/2017",
    "text": "Studying in the Grand Central Coffee Company feels like you're having a cup of coffee and reading a book in an old mysterious mansion.  There are various rooms and balconies to explore, some of which are hidden away in unexpected areas.  There's even a huge ballroom where it feels like you're in a castle in Transylvania.  The florescent bar menu (they serve both alcohol and caffeine) is clever and fun, and my iced mocha was perfect - not too sweet, and comparatively priced with other coffee houses in town.  The large size of the place makes it so you can be close to the action (aka the bar) if you'd like, or you can have a quiet corner all to yourself.  I can't wait to come back and explore some more!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "MwWO6axFPTCXqN0DAfUhIQ"
  },
  "EzXc3GxC0_CQHuxmTB1J5A": {
    "date": "4/29/2017",
    "text": "Very cool spot you have to check it out.  I will come back for certain.  A plus service and unique atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ZAABeukrHJTIwzSbkbZcTg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZAABeukrHJTIwzSbkbZcTg/o.jpg"
      }
    ],
    "user_id": "Up6aF-PfEuqhQXH3_cApoA"
  },
  "KucdH8zf-7FDEK3pneJe-A": {
    "date": "3/11/2018",
    "text": "Really awesome ambiance and decor but 2 out of 2 Sunday's they were out of champagne. The food was subpar.  Good place for drinks and beer but wouldn't recommend for brunch or Sunday funday.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lo-tg983r20Dp7w4hqOkHQ"
  },
  "ItE5-vNAI1Cpdupt16vBOw": {
    "date": "6/26/2017",
    "text": "I docked a star purely cause the A/C was out on one of the hottest days of the year   But that being said.. What !? this place is open 24 hours! And has great food and a pretty decent beer selection! The avocado fries were tasty. I think they are coated in a rice flour and then lightly fried. Served with a super spicy chipotle aioli. The kale and blue salad is a great vegan option ( I'm not vegan, next time I would add meat or cheese). The salad was lightly dressed and the right amount of all ingredients that were present.   The really exciting part of this place is the atmosphere. It's HUGE with all kinds of different seating areas. Awesome patio. It's decorated in a very steam punk sort of way.   I think if you haven't checked this place out you should definitely give it a go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KKSsCxe_mbEXO-yLdaGvDA"
  },
  "IZXqtrTYhiPF6SfcV3i-Lg": {
    "date": "7/9/2017",
    "text": "Love the ambiance of this place for just about anything! So comfortable and very personable staff. Feels like a library and a pub meshed into one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yYaMp0wJ48wpCqKwmaiwWw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Fried chicken sandwich!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yYaMp0wJ48wpCqKwmaiwWw/o.jpg"
      }
    ],
    "user_id": "QIR5KJB8BsoW9wKsB7XTDg"
  },
  "MTrSG64hAUeZniq2Bll2PA": {
    "date": "4/24/2018",
    "text": "Have been here a number of times and was always pretty happy. On 4/23 around 1130, went in it was very slow but the girl working the register and the female bartender were both really rude, like they were annoyed that we even came in. Tried ordering a beer but somehow they were \"out\" of the first 4 beers i tried to order. Hopefully things improve.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BFXhokjMje-MPS53TNww5g"
  },
  "gDKX99iKG4xlZTfpEFXW6A": {
    "date": "3/9/2017",
    "text": "I'm happy. I went to Grand Central in Phoenix tonight, because I'm a night owl and Yelp says they're open 'til midnight. It's now 12:40am. They're not showing any signs of trying to get us to leave -- music's still on, dates are still gazing into each others' eyes, barristas are still buzzing around at the bar, lights are still low. I don't know what's going on, but I'm staying.  Also, the curry cauliflower is luscious. Very much enjoyed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JSMdE8_IZss8TBaGNoLBnw"
  },
  "zJiEELrsNKwEnIdUJY0VBw": {
    "date": "4/15/2018",
    "text": "They clearly do not understand their menu. Came here for brunch ordered scotch coffee and breakfast sandwhich...coffee came with out the Bailey's that it clearly had on the menu..sandwich came without chives In eggs and out way before my husband's meal...clearly catering to the hipsters who only want to drink and stare at their Apple computer...good luck!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9RZSq0aVuLLD6jvIh2TzqQ"
  },
  "qdjZ1Lvv6O5c3SvFNe5PUA": {
    "date": "1/29/2018",
    "text": "Service was excellent, food was on par for 24 hour restaurant, and they're dog friendly! Only complaint is the type of music being played. Felt like being in a club rather than a coffee shop, but many other people around us managed to be productive on their laptops despite the ambiance.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zAIWkY4Ll6cjWUKq-LoEWg"
  },
  "LGnD8yl3McfjmcbJUNhi5g": {
    "date": "12/30/2017",
    "text": "Beautiful place terrible experience with a manger who spoke to us as if we were bothering him and he lacked any customer service experience, had no regard to what happened and just walked away from us with a horrible attitude.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uBJ0RNk7F0CW3L8CTl0eAA"
  },
  "voaYD61uYjG23Bhc6Pvepw": {
    "date": "3/3/2017",
    "text": "Spacious with lots of couches, tables and good wifi. Excellent matcha green tea lattes too!   Cool space and nice character with really good service. The only downfall? On Friday nights it can get busy so the private lot will fill up...had to circle a few times before a spot opened up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ne4nMZL2Pi3alL25_xS_SA"
  },
  "IoFyolIy0lD7zgPThu_qyg": {
    "date": "9/16/2018",
    "text": "I used to LOVE this place. It was my friends and I's go-to spot for just about anything. We used to stop by quickly for a coffee break, or come in the evening for food and drinks. It used to be spectacular and really have a lot of delicious options!  HOWEVER, it seems recently everything has changed. They have slashed their menu and taken a lot of favorite items off. We used to SWEAR by the mac & cheese, which was definitely the fan favorite of my entire 15+ group of friends and work colleagues, but they've taken it away :( So, last time we went, we just got french fries. The girl at the counter gave me 2 different order cards, which made finding my food confusing, and I ended up waiting 30+ minutes for french fries. I continually went downstairs to check and had to ask after a while, since they weren't busy at all. The staff overall seems to have changed and they aren't the most helpful or friendly.   This used to have a great ambiance, with great music, employees, food, and drinks. Now, it seems to have lost every aspect that used to make this place different and great! Music is subpar, employees have been rude, almost all food items are gone, and our typical drink orders have been mediocre at best lately.  Honestly, I think our group will start meeting elsewhere, as we've tried going back probably 5+ times and each time has been met with complete disappointment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "r9VqvaLEtpcqsGu5XS0Olg"
  },
  "hlvILltYLELne9AVH8P_Lw": {
    "date": "8/27/2018",
    "text": "Alight, It's good to be back y'all! After much consideration I'm excited to come out of hiding and open up the format for these reviews. The object is to bring you a wider variety of burritos based off of size, price, and ingredients used by using a 5  scale. So without further ado, here is the breakdown for the breakfast burrito at @thegrandaz :  As you can see this burrito is bursting at the seams with freshly scrambled egg, but the True hero here is the corncob smoked bacon! The bacon was thicc -that's right with two \"C's\"- packed full of flavor and laced throughout every bite. The red skin potatoes offered quite a bit of mouthfeel but could have used a little love in the form of seasoning. The tortilla was fresh and grilled on a flat top to melt the cheddar cheese and seal all the yummies in.  Overall, if you're looking for a breakfast burrito that tastes truly homemade, then head down to @thegrandaz in downtown Phoenix to pick up this little darlin for $8.50  I give it /5",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IplV3JZqs9ZFIwhdGt49ig",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IplV3JZqs9ZFIwhdGt49ig/o.jpg"
      }
    ],
    "user_id": "pxgodAQoe5DWnGT-y4O4fw"
  },
  "VNEf3gBZM1hUxlaj9ABZpg": {
    "date": "5/17/2019",
    "text": "This is such a cool place to relax, enjoy good food, and talk. The staff was all very friendly and engaging. The atmosphere was fun with really fun decor. Music was perfect volume where you could enjoy it but also enjoy easy conversation with friends. This was our first visit and we love it and we'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XlmG0Xcd5jeiOQEjqYokIw"
  },
  "elTikzQH86cnQrT3QUzj0w": {
    "date": "4/25/2019",
    "text": "This is the perfect study spot in all of Downtown. First, it's open 24 HOURS A DAY! They have dozens of tables and study books, as well as 3 different outdoor seating areas. The baristas and bartenders are all very friendly and you keep even catch them jamming along to the music.  Their drinks, both alcoholic and non-alcoholic, are made with care and they were able to make me something special based on my vague wishes. They can take a bit of time but that's only because the way they staff the bar and counter.  The food isn't anything monumental but it's good, made with quality ingredients, and what more can you expect when you're studying your ass off with both coffee and alcohol available. I would maybe like to see more options though? Let's add in some brisket tacos or mozzarella sticks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "msF3W6xo9rHzMan-EyajAQ"
  },
  "fw52ovCy65C1XnZg4zvZuw": {
    "date": "7/24/2017",
    "text": "I've been to The Grand about a dozen times and I have to say that it's one of my favorite coffee shops in the Phoenix metro area. I like to get work done at cafes/coffee shops. This place has LOTS of seating area indoors, outdoors, AND upstairs. There's a good amount of outlets all over the place for your electronics. They are open 24/7 and since I'm a night owl, the time I've spent here is mostly late nights. The indoors is mostly pretty dark, but there are patio areas outside so if you are working here at night, it can be nice outdoors (yes, even in this AZ heat).  I usually order the iced mocha latte with soy. I've never tried any of the food items here, so I can't speak for those. There is a parking lot east of the coffee shop, but it's pretty small. My backup parking spot is across the street by the Phoenix Public Market, which is not a far walk at all.   Recommend this place. Love it. I will keep coming back as long as I live in Phoenix!  P.S. Make sure to check their website or social media accounts. Some nights, they have different types of events going on so if you're coming here to get some work done, it might be good to check out what they have scheduled first (if any).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WPQMs0Pm01VnnVvrtm1V9g",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. The breakfast sandwich &amp;amp; herb potatoes. Part of their 3-day brunch menu!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WPQMs0Pm01VnnVvrtm1V9g/o.jpg"
      },
      {
        "img_id": "oA5efx2lQ67v_F0iJ2U5gQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Side patio",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oA5efx2lQ67v_F0iJ2U5gQ/o.jpg"
      },
      {
        "img_id": "2tDlsEDMOopzeyDb3lZDnA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Front entrance",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2tDlsEDMOopzeyDb3lZDnA/o.jpg"
      }
    ],
    "user_id": "1mwLPy_kpeZsB-fHm02cMQ"
  },
  "efD36WYK0Qqm5URWU4Nonw": {
    "date": "4/5/2018",
    "text": "Service was good! Can't complain about anything; their iced chai drink was good and so was their three tacos entree. The vibe and decor was very nice..loved how it's open 24/7 and on Easter weekend. Nice place to study, eat or just chill at.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "X3tFHXRbx_AM2wS0x1KpEQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X3tFHXRbx_AM2wS0x1KpEQ/o.jpg"
      }
    ],
    "user_id": "-XxiuQu_N0eU25RG8z8Tmw"
  },
  "GmEf-X7WPfffTVF6GiTLdQ": {
    "date": "5/11/2019",
    "text": "Stephany, Kyle, cierra, the only people you need to ask for.. amazing place!! 10 out of 10 and of course an awesome staff!!!! Come here! You won't be disappointed",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uQiUJBtdMOGAttXn2u5XCA"
  },
  "HoZohyUL1AxZPjx_iBdZIA": {
    "date": "4/10/2018",
    "text": "We ordered only drinks here as we needed something to drink while exploring downtown. We got the cold brew with almond milk, lavender white mocha iced, and the elderflower lemonade. The cold brew and lemonade were made right after we paid, but the white mocha took forever to make. The rest of us were sitting outside and I remember going back inside looking for my sister because she hadn't come out yet. When I went inside I saw that her cup was still on the bar off to the side and we had to ask the worker about the drink, and they apologized for forgetting the drink. The drinks were okay, but for the price, I would have rather gone somewhere else, but since we were visiting Arizona for the first time we wanted to try it since the reviews were good. We didn't get any food, so maybe the food here is better than the drinks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fuAnPgYk_PTWsa8v3ZFaBQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Cold brew with almond milk and elderflower lemonade",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fuAnPgYk_PTWsa8v3ZFaBQ/o.jpg"
      }
    ],
    "user_id": "Te9XTf18LajVAqr94sqUhA"
  },
  "HZ_9zj82qiE0Dzl8lKuKkg": {
    "date": "10/10/2018",
    "text": "I came here for the first time because my friend Chris mentioned it. I was blown away by the aesthetic and the culture. Every had character and the staff was very pleasant and respectful. There was a lot of space to eat and work. The food was incredible!!! And coffee. If you want a place to work or just chill I highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k0Fodp15WvvonDWsbfQxjA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k0Fodp15WvvonDWsbfQxjA/o.jpg"
      },
      {
        "img_id": "eQUefDJdqlXdRElvZawnwQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eQUefDJdqlXdRElvZawnwQ/o.jpg"
      },
      {
        "img_id": "poQMk8dRKj4Kj1lKidKKnQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/poQMk8dRKj4Kj1lKidKKnQ/o.jpg"
      }
    ],
    "user_id": "75B5WqTB0bvykiwe7r7CJw"
  },
  "0yUodW68-k1CfKq6o00JyA": {
    "date": "5/25/2018",
    "text": "This place is amazing. I live at Cityscape and have been looking for a place with a great atmosphere, conducive to studying, and where I can grab a bite or a drink. The Grand NAILS it. They have an upstairs area that is quiet for studying, and the downstairs is great for hanging out. It's also not borderline refrigerated like most places in Arizona.   Menu is solid and prices are fair. My fav. is the Arnold Palmer with Prickly Pear tea, but plenty to choose from. Nothing to complain about here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ECxbiJ6RWZCUYfgZ3G76Aw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ECxbiJ6RWZCUYfgZ3G76Aw/o.jpg"
      }
    ],
    "user_id": "b9cJ76lu_WmEum0MRaBrng"
  },
  "QtStBDUxbgoJpM42Gd7lTg": {
    "date": "2/18/2019",
    "text": "This was my first time at this beautiful place and I was enjoying it but sadly I was attended by two rude young girls who instead of attending me where talking among each other and rushing me to order , they kept charging me when I wasn't even done ordering. This has been a very terrible experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4_RZfoM6l7jVTiCZqv44SA"
  },
  "jYv6WInUZ4FR2_7Wel-9MQ": {
    "date": "2/13/2018",
    "text": "My Fiance and I decided to go on a bike ride around downtown Friday night. We were a little hungry so we made a stop in to have lunch on the patio. The Patio is very chill but very dark with a bar that accessible inside and out. After looking over the menu we decided to order the Tacos. I ordered 3 avocado and my fiance ordered 3 Asada.   As we received our tacos the plate was hot but not so much our food. The tacos were lukewarm on both of our plates. When I began to eat my tacos I was not impressed with my avocado tacos neither was fiance with his asada. I wish the tacos were as good as the price. If in the area I will definatly make another stop in to have a coffee or a beer because I did like the vibe of the place. I'm not to sure if I would try the food again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rPzAgUcdr3gIvyzTOCTwOQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rPzAgUcdr3gIvyzTOCTwOQ/o.jpg"
      }
    ],
    "user_id": "iCQKx9z2lHlDlZe0hOSqFA"
  },
  "zQ5oRQ06w4ZA9dwKwPDM6g": {
    "date": "11/28/2018",
    "text": "I was really eager to come here! Although the aesthetic of this place is great, the coffee and food are not up to par. I am a college student and came to do homework and to my findings there was rarely any outlets. I feel for a cafe there should be outlets for anyone using a laptop or electronic. Also when ordering the staff was not helpful. I told her it was my first time here and I would order when ready. Although she was patient she did not have an attitude that would make me want to come back. Customer service upholds a reputation of any business for that reason of many I won't come back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iAwov1xwfcPOgNGtY_3L5A",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iAwov1xwfcPOgNGtY_3L5A/o.jpg"
      },
      {
        "img_id": "pLqc8sLwVfZvK66FF3AznA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pLqc8sLwVfZvK66FF3AznA/o.jpg"
      }
    ],
    "user_id": "Z7z78byjCmUXQOLbukXrGg"
  },
  "EvZGvWZEV_7iORpgh44mpg": {
    "date": "7/18/2019",
    "text": "I  have just returned home after my first visit to the Grand. What a disappointment.  Their website says its 24 hr. , 7 days a week, 365. What it doesn't tell you is the kitchen closes at midnight on weekdays and 2am on weekends.  Plus, their espresso is made with burnt beans.  Their pastries would have been great had they not been slightly stale and nuked to rewarm them. Some of their staff are great and others just going through the motions. Shout out to Hollywood for his attention. Plus it is dark and funky but if you want to read or use their wifi there is no place with enough light. I won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nCAsETGAtk6TsjCSICBC2g"
  },
  "1V6g6APcAndU2U0MOsnUCA": {
    "date": "6/6/2019",
    "text": "Jonathan was SO great!!!! This was my first time here so I didn't know what kind of drinks and stuff they had, but he was quick and friendly to answer all my questions!!!! He convinced me to get the 32oz of my latte, and it was worth it! I don't live too far from here so I will definitely be back!!!! I cannot stress this enough.... Jonathan was the BEST!!!!!! My amazing interaction with him is what prompted me to write this!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KItROel7ZHX4mOlWHPYyug"
  },
  "yOo-2eoJ9-lvVHlXXNBaqA": {
    "date": "3/30/2019",
    "text": "We went here for drinks while we were making our rounds for New Bar Friday.  Out of the 4 bars we visited, this was our least favorite. The cocktail menu had no standouts and really poor counter-only service (We were ignored so long that we contemplated leaving). They also have a speak easy upstairs, that we were told had a 25 minute wait and a two drink minimum, with \"high-end\" $20 drinks.  Yeah... I don't get it. There was a \"band\" tooling around on stage until 11PM, that was really a barefoot girl and her guitar singing songs she didn't rehearse on-stage, sometimes with a guy and sometimes just her.  Overall, it was a below average bar, but perhaps you'll have better luck trying it out for coffee during the day.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i3K3EfRgi86HRYa_57LksQ"
  },
  "a2RFAsGawc2z40SkiVMB-w": {
    "date": "3/23/2019",
    "text": "Nice atmosphere. Reminder me of what a cool union station would be. There is also a secret speakeasy named Sanctum, upstairs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BwNsmJl1cDMtnICJZeHKyg"
  },
  "NbCPXlOkh2BXmIG-8UMdhg": {
    "date": "1/10/2018",
    "text": "The Grand is a nice, elegant cafe. The drinks are amazing (white lavender latte, anyone?) and there's a nice rotating selection of monthly specials (both coffee drinks and alcoholic beverages). The food and pastries are pretty tasty, with fun offerings like avocado toast, different types of mac and cheese, all sorts of soups and sandwiches. The wifi is pretty fast and it's a nice place to work or study upstairs; spacious tables, outlets, etc.), especially if you like reggae (not too loud) playing in the background. And you can't beat the hours.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4_Qs5oACFDdPM9JphWqEgg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. If you take your drink outside, you can enjoy it in view of this beautiful fountain.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4_Qs5oACFDdPM9JphWqEgg/o.jpg"
      }
    ],
    "user_id": "k8BKkY2r6dkEv_2KZWhslA"
  },
  "UrAXarjKdyIE8v6J7xIA0A": {
    "date": "11/9/2017",
    "text": "Conveniently located near the light rail, this coffee house is open 24 hours which is perfect for those night owls who study at ASU.  My friend Clint and I decided to come here after the free day at PHX Art Museum. I love the vibe here much better than the old gay bar that used to occupy this place. Great lavender teas, and fantastic servers. They do have a small but well-executed selection of food, and yes they do have libations. I love that it's next door to a live band venue so that you can hear the musicians play at night. Good luck finding parking space here though, but the positive is it's very close to the light rail.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "IR_hUgjZjc_lp09Xb7aNyw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IR_hUgjZjc_lp09Xb7aNyw/o.jpg"
      },
      {
        "img_id": "Kz6sUN8kBl4pBNVQhZUkBg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Lavender Tea",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Kz6sUN8kBl4pBNVQhZUkBg/o.jpg"
      }
    ],
    "user_id": "nXMMoDzXRByQiWH9cf-FAQ"
  },
  "KfA6QTj_yrS8ZTyf0xt_8A": {
    "date": "12/28/2016",
    "text": "What a unique venue! I may have visited Amsterdam in the past which is what this coffee shop used to be, but regardless, the atmosphere is a trip! I love the steam punk-train station vibe going on here (as another reviewer described). I agree with that description!   I was hesitant to review because I didn't actually have coffee here. I had a Smoke and Cigars cocktail. Don't judge me since I had this on a Monday night but holidays are rough!! It kicked my butt! It was probably one of the strongest scotch drinks I've ever imbibed. I'm fairly certain if I had been fighting a cold the alcohol in it would've surely killed those germs. I'm thinking next time of sticking to an Old Fashioned, my usual.   Back to the atmosphere, there are 2 stories of areas to sit and enjoy coffee, or a cocktail in my case! There is a large outdoor area too so this place is great for large groups. I guess several literary groups meet here once a week or so!   Parking is on the north side but you have to come from south to get to the parking area and stay in the super left lane on the left side of the tram tracks to get there so it is slightly confusing, but at least the parking area is free once you do find it. One way streets make coming here a little more adventurous.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "26deIO0lgkImamr4bJMGvQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/26deIO0lgkImamr4bJMGvQ/o.jpg"
      },
      {
        "img_id": "9ftpwubLvsbRPe_ifL7Wng",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9ftpwubLvsbRPe_ifL7Wng/o.jpg"
      },
      {
        "img_id": "srZRHgP49FrDtPM9FG_3xg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/srZRHgP49FrDtPM9FG_3xg/o.jpg"
      }
    ],
    "user_id": "eAJ3Ip0vh-zuk_BmcmchYA"
  },
  "aR5ffJNLCwvtZChTUtVm2A": {
    "date": "9/2/2017",
    "text": "Wasn't the best experience. The Custormer service was terrible and the food was over priced for the quality.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P-64ylcLYUlWnUuz1EMPbA"
  },
  "vRMMZHtaLlz9hjyYGeLjeg": {
    "date": "2/9/2017",
    "text": "I absolutely love this place! I have been here a few times and it's always been a great experience! Today, however, was even greater, it was the BEST! Maya was a GEM! She went above and beyond as I was getting some goods for my friend. She was so nice, super attentive, and she truly loves her job, you can just tell. This coffee shop should be so grateful to have such an awesome barista.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "l_ZWV8uvBVBKCvMNt7NtkQ"
  },
  "nZYpM4B01Wy2QyDXbZWzEg": {
    "date": "7/13/2017",
    "text": "Very cool coffee place with the total ambiance of the old train depot. Someone has put a lot of thought into small details. I was a bit disappointed with the breakfast omelette. It just was bland and no garnish offered. Salsa would have softened and added to the overall taste.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MUx7VN2bErPt7y6cLaWPnQ"
  },
  "TEZmCjDjEeqQuuMYCXJ9kg": {
    "date": "12/14/2016",
    "text": "This is going to be the worst review I've ever written. I've been coming to this cafe now for over a month at least 3 times a week. Over the course of the past 2 weeks I've had to wait over 5 min or so for someone to take my order let alone acknowledge me. There's only really 2 people there that actually remember me which is sad. Seeing that their never really that busy when I'm there. So today as I sit in my normal spot without even have ordered. I watch from a distance as the only girl serving people is still engaged in a conversation that has lasted over 10 min. That's 15 min. That I a paying customer still hasn't been acknowledged. Not only is she not aware of her surroundings she's taken the liberty to use a cooler as a chair at the window bar. If I was the owner of this establishment I would fire her on that accord alone. I don't pay you to sit! Lol..it also seems like if I was to border alcohol I would get immediate service. Seeing that's the only clientele she's engaging with. So as I walk out now unserved to another business that's willing to except my hard earned cash. I challenge Charlie the owner to rectify the situation or I will assume that my business or anyone else that cares business is not needed for your establishment...it suxks because I really do like this place too..  Signed Chef...",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "GfDRqZ3eBExIieuMYiBtEg"
  },
  "jgXw8CDff3UzrmBq8yJk4A": {
    "date": "8/12/2017",
    "text": "Coffee and food here are ridiculously good . Ambiance is exactly where it needs to be and everyone here seems to enjoy their job . You wanna vibey place with good energy to match ... Come here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "blGFedMfWdnoHEKxXXlp1Q"
  },
  "4jWGhuEIApr5mMccza-jlQ": {
    "date": "2/6/2017",
    "text": "I have never had to wait 20 minutes for an americano before. It's just espresso and water?! How long does that take?! Amazing. If you don't have 20 minutes to wait for 1 drink, avoid this place at all costs. Also it wasn't even busy.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fuux6Nm20Y4hYggYB7BeAQ"
  },
  "ePuUs1APqkfB9P-OIzipQQ": {
    "date": "3/15/2018",
    "text": "Well a friend and I decided to check this place out last night. We went in around 8pm, but never got served. We took two seats at the bar and patiently waited for 10 minutes. A bartender dropped a beer list in front of us and then didn't speak to us again. She served everyone around us but purposely kept skipping us. We weren't really sure why. She seemed to be in a very bad mood. Ultimately we ended up leaving because she definitely wasn't going to speak to us. We were disappointed, their cocktail list looked interesting.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "npPKoGvghbYtIQQjp4NLcg"
  },
  "fsrVCjKbXk5VOHtkArZffA": {
    "date": "8/30/2017",
    "text": "This place looks gorgeous but our experience was super disappointing. The boy behind the counter was cold and rude and the drinks he made were weak. I got the breakfast sandwich  and the bacon was chewy and while the eggs were fluffy, they were unseasoned and boring. No water was offered even though it's over 100 degrees outside. Brioche bread was great and the atmosphere looks cool, but that's all this place has going for it. Save your money and skip this spot",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B571EoMnpAOWaLTnvs3sHw"
  },
  "90WU1m-82p1bi4pk5Tzsdg": {
    "date": "4/6/2017",
    "text": "I showed up and was expecting this place just to be a coffee house, but when I walked it there was a kitchen, open bar, and a study if I was attending ASU I come here almost everyday to study. It's a nice open environment. You could definitely make friends and meet new people or have a drink or something to eat. It's chill and I like the vibes here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SHaEzyoo6JyryscEi7NMRw"
  },
  "K3qkgbE5kdJxYeYIJ17bMg": {
    "date": "10/14/2017",
    "text": "Website says late night menu is 10pm-5am. I go in at 1:30am and guy working behind the counter says kitchen is closed. So we asked about the \"ghost soda\" which is apparently their drink special and the guy behind the counter says \"I don't know what that is\" either the management is poor or this employee is lazy. Regardless I won't be coming back because of that awkward encounter.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gmUbWlC87uoxaZl3SZsmgQ"
  },
  "L-FsM1GU9kSepuyRRXS9-g": {
    "date": "6/24/2017",
    "text": "This place is just ok. Decent happy hour deals for $5 drafts and wine but when they billed us we did not have the happy hour deal included. After 20 minutes they finally fixed it and were not very friendly about it. Food was ok but nothing special for the price. Overall we probably won't go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dQg0hy73E8HlmFZnt65_VA"
  },
  "Kt2gvPv5kH7munYbFO0FFw": {
    "date": "3/15/2017",
    "text": "Such a cool vibe! I am a big fan of the yummy, dessert type coffee drinks and would've given 5 stars if there was more choices in that category. I can't wait to come back though!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FJyQnd6qIN8uqUdp5yzx7g"
  },
  "a6XPfiSLyHnKdX7hUFe6UQ": {
    "date": "3/4/2017",
    "text": "A top shelf coffee house. The decor is incredible. Like an old train station with lots of antique light fixtures and furniture. Solid menu and excellent coffee. Would have been a higher review if service was better. Took forever to get our coffee. Barista was not very friendly. Coffee came out like warm. Work on that peeps because your place is really beautiful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VBbXGIthY1fRSrgjggGcnA"
  },
  "NSwBSO9Dpx2o2rNuM0oWIQ": {
    "date": "8/31/2017",
    "text": "Love the atmosphere during the day to study. At night this is a great spot to stop for a drink. Their beer selection is always awesome.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n2qIkUMY98JE1Sfog5nbQg"
  },
  "4Ii6wTrO5I83O8IV8ZjwCw": {
    "date": "4/16/2017",
    "text": "Love this place.  I'm an introvert, so I prefer when it's quiet.  I've been here 3 times now.  Service is incredible.  And they recently opened the kitchen.  Bottom line: get the short rib eggs benedict.  The head chef Jacquelynn is phenomenal.  I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U1DOCWZUX5BIstDtoGH6ww",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U1DOCWZUX5BIstDtoGH6ww/o.jpg"
      },
      {
        "img_id": "CKYYHkKRKBbgBHhMtw1kYA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CKYYHkKRKBbgBHhMtw1kYA/o.jpg"
      },
      {
        "img_id": "hgbv72OKgeATSpE0LSz4uA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hgbv72OKgeATSpE0LSz4uA/o.jpg"
      }
    ],
    "user_id": "PaYHG4FkH4-tUX_wfYEbcg"
  },
  "RrJYPQLUDQTNJXLb51OZqw": {
    "date": "4/14/2017",
    "text": "Always open, serves coffee, adult dranx, and serves munchies? Coconut beer, antique decor, a sick patio.... Cheers y'all",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TNs9mUaIOYaXydaRKo1nlw"
  },
  "zHbyX370RQYuMAhpQ3uyHg": {
    "date": "4/12/2017",
    "text": "I love this place. I've been here many times over the last 6months. The vibe is relaxing and calm. The people that work here really engage you in. I work from here and I've never been disappointed The food is great the coffee and all its alternatives are amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JM9G-vPctaG3_li7y4bZxg"
  },
  "T3sWQqjpqu6y1CRNe84uLA": {
    "date": "5/3/2017",
    "text": "Literally best place ever. Whether it's spending my time here catching up with friends or doing homework it's a great place to be at. The background music is perfect and just gets you in a good mood regardless of what you are doing. The drinks are also really good, from their chamomile tea to chocolate chai to cocktails . Great atmosphere from the staff and everyone else here. Overall really amazing place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qHhUyzuD3xhkOqoxlwNUew"
  },
  "x9CNMhhiYOlngYknZcTFDg": {
    "date": "7/9/2017",
    "text": "What happened Grand???? You had these comfortable chairs and awesome couches, a fireplace... Went back and all of it was gone! All that's left after hard chairs and tables..... Sucks...I hope this is temporary! But, I will say I had a great mocha here, finally.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EkVyYfWcWT__l6SDMtgwQg"
  },
  "l-xeZ1tL4dtfFz9YqfeIyQ": {
    "date": "7/31/2016",
    "text": "Wow - such a cool new place in downtown Phoenix!  We stopped in last weekend for a drink and really enjoyed ourselves - great atmosphere and decor, friendly bartenders and a nice drink menu.  I enjoyed an organic cider that I had never tried before - bonus!  They told me about another cider that was on target to go on tap next and it sounded delicious too.  We'll definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "cMEtAiW60I5wE_vLfTxoJQ"
  },
  "m3rebtxiFVEesuS552y8Rg": {
    "date": "10/1/2017",
    "text": "Awesome setup for a coffee spot also great for studying, good vibe and coffees are good. Service was also really good didn't have a chance to try any of the beers or spirits but so far it was a great experience during my visit to AZ.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K0UfGj7ZM6uLxU7rErcfiA"
  },
  "scmM9hHnMCnCurYArSiGVQ": {
    "date": "9/9/2017",
    "text": "I lalalalove this spot. The decor is top notch, the staff is super friendly and the people here are very diverse and cool. The coffee is pretty good and everything I have had for food here has been great as well. The outdoor patio seating is adorable and the indoor seating features a variety of spots just for whatever occasion you are at a coffee shop for. They have a full service bar if that is what you are looking. There is seating for large groups, individuals, and couples. Upstairs and outside is slightly quieter if that is what you are looking for. Definitely come check out this place for great love music and chill DJ music as well depending on when you are here. I will be here often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N4R4O81XtjruC2zitZV_Aw"
  },
  "6xFuI3mIAnXiQMq1fHFXpA": {
    "date": "3/29/2018",
    "text": "Plenty of seating and very interesting decorations. I went mid-day looking for a place to study quietly, and that was exactly what I got. Being the tea-girl that I am, there was a moderate list to choose from and the iced rose tea I chose was delicious. The only reason I didn't give a 5/5 rating might have been partly because of me, but I had to drive around the block a couple of times to find the entrance on the other side of the light rail. However, once I found it there was a good amount of parking and I continued to enjoy the rest of my afternoon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nssqn4u2C4Qv1kU6uj8H9Q"
  },
  "UZcLe8ubbUfv3RxwzEeNcg": {
    "date": "2/15/2017",
    "text": "So The Grand has been open since July of 2016. But I feel that not many people know about it. It's same set up like LUX but twice as big. It's 2 store club that was transformed into a coffee shop/bar/food spot.The lattes are so good here!! Also there building a stage outside for live performance that will be going on Friday nights. Such a chill spot with so many couches and tables to sit at with power outlets to do your work. People here are super chill and quite. The barista here is a previous employee from jobot so he's got all the skill needed to put manic in your cup. Check it out, don't play your self.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "9mkaaU4tx5J-029axdvGXg"
  },
  "FFpykXhuDtHiETkBFGfSZg": {
    "date": "4/9/2017",
    "text": "Great atmosphere, great service, lousy coffee. Decaf was lukewarm/almost cold and tasted like instant. Latte was lukewarm as well. We both had the overnight oats and it was okay but a gut bomb.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Aam-l_vsclij5IuPFh90w"
  },
  "e-kAXtxkRB7fKTzbmnIeXw": {
    "date": "6/10/2017",
    "text": "Came in at 2:30AM, told me that the kitchen is closed. Not truly 24/7 is it? I dont recomend this sad excuse of a restaurant.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "d5-_loBSM81yS4RaU72bug"
  },
  "AzIUxDTBW0bUoekIO6x-fw": {
    "date": "4/23/2017",
    "text": "Late night on a Saturday. Oh, it's actually early morning. It's 1 in the AM to be exactly. I got a Moscow mule and a cauliflower burger. For some reason, they don't taste as great at this hour. But it's great to have this place at this hour. This 24-hour concept might work. It's not NYC but it can be someday.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Rnwsdjuac1Grtp14GVPWxg"
  },
  "mDTrX9Old8rWf655sbCJFQ": {
    "date": "12/11/2016",
    "text": "This place is totally a fusion of retro and modern design. It's very easy to get lost in the nostalgic history of this coffee fusion house. The interior is decadent and scrumptious. The manager, Bernadette, was amazing and full of information. Saw this place from across the St and was drawn in by its beautiful facade and design. The coffee was PERFECT and the pastry selection made it very hard to choose only one (so I chose two, a slice of quiche and a zesty lemon vanilla cupcake!) There was a live music show in the ballroom and it was amazing. This is a must try venue. I was totally happy with this place and will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WmGLqkigFo-KKYb6FqsfPQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WmGLqkigFo-KKYb6FqsfPQ/o.jpg"
      }
    ],
    "user_id": "G5CXpXjb4SuDJDtxSCBKUA"
  },
  "sA1fYbjZnfQCbn2KsXpRYQ": {
    "date": "4/10/2018",
    "text": "It's always a great time at the grand! Excellent food as well as excellent drinks, all the staff is super friendly but both Zoe and Cierra go above and beyond and always make the night the best it could be. They are the reason we keep coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xALX0IDIdOY5tci7lnkt2w"
  },
  "yLTsIZAj9E9z-xeJZqxDyw": {
    "date": "9/10/2017",
    "text": "Kyle is a solid bartender, very attentive, and can keep a good conversation going! I really enjoyed the ambiance of the building inside and out. Considerably wide selection of coffee, beer, food and even teas! Very inviting place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-6Ns2aQfX1kYoLK8a7N2SA"
  },
  "-AIadS5d4uGB8wZEfVHhLA": {
    "date": "8/5/2017",
    "text": "Very cool place, tons of potential. Our visit today had some highs and lows. We stopped in after a visit to the public market across the street. Their brunch menu starts at 10am and you order food and drinks at the counter. There is no clear line and they probably need more people available to take orders. We got the breakfast sandwich and the BLAT sandwich, house fries, and a peanut butter cookie. I also had some cold brew coffee. The breakfast sandwich was Super yummy; seriously order it! The BLAT came out with out the fried egg, which is a critical part of the sandwich, but they were more than willing to fix it. House fries with aioli were very good. BLAT sandwich was disappointing. My peanut butter cookie was also disappointing: dry and a little overdone (brownish black on bottom). Customer service is friendly and accommodating, it just seems like they need to iron out a few kinks in how they do things in order to speed up service and make it more efficient. Atmosphere is great! Big open space, friendly people. Will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NYagdc8r0NvNdA-wwJIJBw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Very cool decor and atmosphere!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NYagdc8r0NvNdA-wwJIJBw/o.jpg"
      },
      {
        "img_id": "CNUq-22w_qZRsxBKZCYjRQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Cold brew is good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CNUq-22w_qZRsxBKZCYjRQ/o.jpg"
      },
      {
        "img_id": "BuBTREclanUvfvQkGoNMWg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Left -1/2 BLAT (pictured w/o the egg they forgot),mediocre. Right -is the breakfast sandwich, delicious, a must get!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BuBTREclanUvfvQkGoNMWg/o.jpg"
      }
    ],
    "user_id": "wUEWWeqNytUKLqwgTdxe7Q"
  },
  "ddAYWAOmVJflcqJGmw7C-w": {
    "date": "10/28/2017",
    "text": "So the food here is five star, the service however is what ruins the experience. That airhead Julian is the worst and talks about the customers as if no one can hear him. When you sit at the bar there is never anyone there to greet you and if someone is they ignore you or stay over by the espresso machines and chat. Maybe both management and the owners either don't care about the costumer service experience or are airheads...like Julian.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oAhj9km2tDp-_1x4eCjzGQ"
  },
  "6-CahxT-JecdbgLdbn68bw": {
    "date": "10/22/2017",
    "text": "Love the atmosphere of Grand. Friendly. Laid back staff. Love going here.  Without a doubt the best 24hr cafe in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v71NOwceU_0oT45fI9sHhQ"
  },
  "rhinYkjYmBuip4eYZMmIWw": {
    "date": "7/8/2017",
    "text": "Great, new spot for 24 hour coffee and bites. Couldn't be happier that not only is there an option that is both open on the weekend and nights, but it's also GOOD! Had one of their huge brownies. Awesome. Had two different types of iced coffee. Awesome. Would definitely recommend this place. Looking forward to coming back and trying everything on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vGTHkEgPKYCfVesl28VMHg"
  },
  "HOII75E_s26jrrYlnNVRBA": {
    "date": "8/12/2017",
    "text": "Very cool spot! Love the atmosphere and that there is a full bar in addition to the coffee bar. Can't wait to take my dogs to their enormous patio when it gets cooler out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "01reZUm6wMB1Y7xJ4QRPiw"
  },
  "urZequikZOGKalJwqZ6WHw": {
    "date": "5/20/2017",
    "text": "I've been to The Grand on a few occasions and everytime it's been a great experience. It's a fantastic environment if you're looking for a place to park and get some work accomplished. It's also a perfect spot to have some bites and be social. The drinks are reasonably priced as is the food. I highly recommend their \"Grand Burger\". The avacado fries are also good, however be prepared as they have a little heat to them.  The staff is extremely friendly and inviting. In particular the bartender, Zoey, was helpful in providing menu suggestions that matched my tastes.  She also makes a really great Moscow Mule.  If you're looking for a place that has a lot to offer The Grand exceeds that endeavor. Outdoor seating, indoor lounging, great coffee, full bar, delicious menu, chill vibe, awesome staff. I love coming downtown for the soul purpose of visiting this business. They're open 24 hours now as well so you can literally check this place out anytime. 5/5",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8a1BlB07vOCR3RIruuzAEQ"
  },
  "PsBRee7XUlFXmWMgwWJTXg": {
    "date": "7/3/2017",
    "text": "Came here after a d-backs game...all the other bars gave off a club vibe so we were glad we found this place. Their beers were on the warm side...which sucks on a triple-digit hot day. The fries and mac n cheese were good though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jD2Pz93GXX-mvxC0CCX5XQ"
  },
  "oqBkQkOzwKcMS8-qmrcuQw": {
    "date": "4/10/2018",
    "text": "Gr8. I love it here. However can y'all plz get an air conditioner? It is perpetually hot, I don't know how u employees do it. Anyway, rlly a fan of this place tho 10/10 chai",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u33hHWuHvbtn8zGrgghlug"
  },
  "eBaqAEpl6rH7Gw03NUdZjw": {
    "date": "4/9/2017",
    "text": "Good coffee.  Scramble cold, very over done eggs, toast was the heal of the loaf served without butter or jam.  $1 for coffee refill.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2UFOf-ppKw8U2yh32TaA_A"
  },
  "C_H6S_59lCAv8Jwez_lgmg": {
    "date": "4/23/2018",
    "text": "I used to love this place so much, but with the new management, the staff seems frazzled and overworked. I'm still sitting here, 50 minutes later, waiting for three tacos. The WiFi is not working properly. I normally would never complain, but it's been 50(!!!) minutes for THREE tacos. And I think I see them sitting in the window.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-KRAtQAvWaR9nBGuzyatug"
  },
  "8vAZxiec4vUFIM0-YU7knA": {
    "date": "4/8/2018",
    "text": "My newest Downtown Phoenix love. From the outdoor patio to the beautiful interior to the diverse menu and coffee drinks, The Grand offers me everything I would want from a casual study/lunch/dinner/hangout spot. The menu might seem a little pricey for what The Grand offers, but let me assure you:  the portion sizes make it worth the $$. I ordered $3 french fries and felt like I had fries for days. Also the staff has been so good to me. I would continue coming back just to interact with the friendly baristas and wait staff.   What really makes The Grand my favorite place though is the upstairs study lounge. The tables are wonderfully equipped with plenty of outlets and desk lamps, comfortable seating and your food is delivered right to your work space. How can it get any better? Where there is reliable wifi, plenty of coffee, and the ease of ordering a full meal, that is definitely an ideal workspace for me. Did I mention The Grand is 24 hours? I really wouldn't mind pulling an all-nighter here.   Some downfalls would be the weekend brunch menu ~ that is all they will serve during the weekends, so don't expect to get your favorite sandwich and fries combo on a Sunday. Also parking can be a hassle, but they do have their own parking lot!! It just fills up fast if you come on a busy day, keep this in mind!!  Great place, great location. Way to win my heart, The Grand.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Pz7IeYZ95BaqoV9UZTTedw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Pz7IeYZ95BaqoV9UZTTedw/o.jpg"
      }
    ],
    "user_id": "zk7Dtbl8PmuTIfLPYn6daw"
  },
  "kPwtOuGiJ6BiQAZAaOTe2w": {
    "date": "5/8/2019",
    "text": "This place is great! The atmosphere is amazing and was taken back at the friendliness and welcoming environment they curate. I had the closest thing they had to a Carmel frappuccino and it wasn't the best but good enough.  The environment would make me come back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lUFDOm2trgdDMI9rfaUWAg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. The back patio",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lUFDOm2trgdDMI9rfaUWAg/o.jpg"
      },
      {
        "img_id": "Hga7Pkw4rzCWNH2dnT7ARw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Open 24hrs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Hga7Pkw4rzCWNH2dnT7ARw/o.jpg"
      },
      {
        "img_id": "FARzROnw3x9XyBQlKGeL4Q",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Downtown Phoenix",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FARzROnw3x9XyBQlKGeL4Q/o.jpg"
      }
    ],
    "user_id": "j4ouGADJ-kLSA-wlAxTyZg"
  },
  "MaDMSM1KOWugTOvSN-lJeg": {
    "date": "8/29/2018",
    "text": "I'll start by saying I have always loved this building, am a huge supporter of local businesses, and rarely leave negative reviews unless something is totally over the top.  When we need a change of scenery from our office, we'll work from various coffee shops (Jobot, Lux & The Grand have been our top 3). It's typically 3-5 of us, and we spend $$$.  Well apparently The Grand is under new management (ownership?) and it sucks! After purchasing a coffee drink & donut for $9, I was greeted with new signs about \"laptop-free zones - please study upstairs\" and \"this table reserved for paying customers\" (duh) and new signs on the large COMMUNITY tables saying they're reserved for parties of 6 or more.   So we (begrudgingly) went to a table upstairs. Something is very obviously wrong with their HVAC unit/AC, as it sounded like we were working on a train, our table was literally shaking, and at one point it got so loud and clanky that I seriously thought something might explode or catch on fire, with debris and/or smoke coming out of the vent over us when it finally stopped.  So the 3 of us took our expensive coffee drinks and went downstairs, sitting at the large community table we often sat at pre unfriendly signs, and near a power source. At this point there were maybe 6 people tops hanging out downstairs, with numerous empty tables.  Then Mr. extremely rude, striped shirt Manager walks up to us and asks \"Are you expecting more people? Did you read the sign? These tables are reserved for parties of 6 or more people.\"  I told him we weren't moving because there weren't any parties of 6 to be seen anywhere, he should worry about his about to explode AC unit, that I think the signs and new community table rules are ridiculous, and that he should pass my thoughts on to the owner while I finished my $9 donut & coffee.  So dear owner, you are located a block away from an urban university campus. The area is also full of professionals such as myself who have plenty of expendable income, large networks, and may not want to \"study upstairs.\" This is both ridiculous and insulting when I'm buying your mediocre $5 coffee. This WAS a community and feeling like your new manager is babysitting me (as a 40 something woman business owner) is unacceptable.  We will be taking our business to the friendly establishments where we feel appreciated (or at minimum not harassed) moving forward.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YS_QSCLy0GiGuKgunjREbg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YS_QSCLy0GiGuKgunjREbg/o.jpg"
      },
      {
        "img_id": "afQoi0kHIPrjMU2QOPYHDw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/afQoi0kHIPrjMU2QOPYHDw/o.jpg"
      }
    ],
    "user_id": "vSQt3TOhI4XJW6eB4PRM9Q"
  },
  "3TnztADET7c_IQAOnbqPMQ": {
    "date": "8/29/2019",
    "text": "Coffee was decent. Food was absolutely awful. Extremely disappointing experience. Spend your money somewhere else downtown.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hQ4E5Do650x1OypMDZer4Q"
  },
  "X8h2cRZwD5x0UHqWGulnsw": {
    "date": "4/12/2019",
    "text": "What a surprise?!! I fully expected this 24 hour joint to be sleepy. There was a great menu, terrific cocktails and efficient service...and the food was actually quite good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HZ9ep6UdCW0TmTTAfjzYxg"
  },
  "zMI7enh2H9vJg2vWgzvucw": {
    "date": "2/25/2019",
    "text": "It has been mentioned in previous reviews, the two girls who work in the front- barista and bartender need to either be coached or fired. Horrible attitudes and snarls in their faces. Been here multiple times and always notice them. Bartender never smiles and looks absolutely bothered by your presence. Batista switched our drink orders and blamed us for it. Whoever owns this place needs to hire people who understand customer service and smiling.  Drinks were above average, breakfast sandwiches not great. I recommend taco Tuesday if anything.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xya11Vm6f1CmJmR308Cbjw"
  },
  "qK72NW6wLYrg1Xb3NyuRYA": {
    "date": "7/21/2019",
    "text": "I really like this spot! The avocado toast is really good. It's very spacey and has a lot of room and seating for customers. This was definitely my #1 place to study and meet with groups during graduate school. It is an expensive coffeeshop, but the drinks are HUGE for the price that you pay, so it makes it very worth it. The vibe is cute and chill. It's a little far of a drive for me now that I live in Scottsdale and work in Scottsdale, but it is still worth the drive if I want to hang out in DT Phoenix for a bit! :) I definitely recommend this coffee shop. One of my favorites in DT PHX.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BNryeq7OS8EOwMICLRr3AQ"
  },
  "DJuJQAxrIzdgFmwZodhp1A": {
    "date": "3/10/2019",
    "text": "This place is awesome! Lots of great details throughout the establishment.  Drinks are wonderful - but pricey, be prepared to spend a little more for them, but worth it.  Very cool vibe and perfect for a downtown feel.  The night club next door gets packed on the weekends, so parking can be difficult. Uber or get a ride so you can enjoy drinks and not worry about parking and drink your drinks! We can back in the morning for breakfast/lunch and it was beautiful! Open 24 hours - stop serving drinks food from 2am--6am (the staff did seem a bit tired on Sunday but who could blame them?!?)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SNncZ0FCON2dni60sKtqcg"
  },
  "SxL3SqhRffCExLZa5G3Z6Q": {
    "date": "8/29/2019",
    "text": "The Grand is a cool spot, have only been a handful of times though, however the second to the last visit, I ordered a beer and the bartender gave it to another customer, while my last trip I was given another customer's credit card when closing my tab and the bartender response was \"I really should start reading the name on these\", little alarming...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Up0xVE5Mnjk6yfpeuJ4e1A"
  },
  "loJAindzuNxtYGsGIT_Hvg": {
    "date": "2/17/2019",
    "text": "Not busy restaurant- Sunday morning ordered food and thirty minutes later the order was nowhere to be found. Rude bartender who was apparently unwilling to make any recommendations on brunch. He proceeded to take his break with no indicator of my food. Maybe a communication breakdown.   Coffee was excellent and the barista was nice. That's the star.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDW6xrgJL_kyEh4-sQvXhA"
  },
  "gBh6_NtxdiRh3Y9s_KgAMw": {
    "date": "6/30/2019",
    "text": "Interesting place! Part bar, part coffee shop, part restaurant, part convenience store. They offer a little bit of everything. We went around 7PM on a Friday (in July) and there was hardly anyone there! Seemed to be mostly students studying, etc. It is pretty dimly lit but the menu boards were lit by black lights which was pretty cool. Very rustic, architecture was unique. Great place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EwnWBg9EumkRd9MMy0sfhw"
  },
  "uKGGc578NT_HIz-evXDFbQ": {
    "date": "3/1/2018",
    "text": "I've made it my mission to check out all the coffee shops that serve adult beverages as well. This place came up on my search. So of course I checked it out. It also helped that many of my elite friends had given it a rave review. They weren't lying. This place was awesome.  I've been to three other coffee shop/bars in town and this one might be my favorite so far. I loved the vintage decore, there was plenty of seating (inside and out), it has two stories and a nice craft beer list. Oh and a happy hour. My pint was only $5.   This might be a stretch but it's kinda like the Disneyland of coffee shops. Not so much as bright and colorful, but tons of cool things to lool at. So hopefully you're not easily distracted.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "crXjvplNncGTydTY2U7z0Q",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/crXjvplNncGTydTY2U7z0Q/o.jpg"
      },
      {
        "img_id": "1bF8rStn7ztj49gKRRm-ug",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1bF8rStn7ztj49gKRRm-ug/o.jpg"
      },
      {
        "img_id": "670PXlG7-ey_FhLQDX8PNA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/670PXlG7-ey_FhLQDX8PNA/o.jpg"
      }
    ],
    "user_id": "dYRJDUwkWcZJIqBI-Q5rAg"
  },
  "NieueuXIlpY6G4YlYime5A": {
    "date": "7/26/2018",
    "text": "The Grand is the place to go if you want to have all the experiences in one. The place is beautiful and inspires you to get working on that project or dive in to your favorite book. Want to grab a bite while studying? Check out their extensive menu, I recommend the cauliflower buffalo bites! In the mood for a drink? they have a full bar and a large selection of beers on tap. Need your caffeine fix? Fear no more, full coffee and pastries bar. Also, did I mention is open 24 hours!?  The upstairs area is perfect for studying/working without the distraction of people walking by. Definitely a regular spot for me in Downtown Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XJNY_hMIYM_DWyh-AgJA3A"
  },
  "WDogjNVtYfXyvGzb5p_etg": {
    "date": "5/14/2019",
    "text": "I do enjoy the coffee and the general atmosphere but this place has two MAJOR problems: 1 internet is finicky. Sometimes you can't connect or it will drop you when there are a lot of students there. 2 the music. The music is controlled by whatever barista is there and if the barista wants to treat it like a karaoke bar, no one is getting in their way. I come here to study with a mocha and sometimes some food but whenever they jam the music like it's a clubhouse... at 8 in the morning, I can't get anything done. In conclusion, sometimes it's perfect, other times, it's a nightmare and The Grand has no intention of changing that.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NWxYEn9IMfF6uZLEsvfXyw"
  },
  "lsJQUSVA2WeHeilFoGftxA": {
    "date": "1/20/2019",
    "text": "The good:  Cool building, location, coffee isn't bad  The bad:  Sadly it is a long list. Parking can be a challenge, the WiFi won't work if there are a busy because they haven't figured out the concept of making their DHCP server hand out more than 255 addresses, something even a novice IT person could solve in about 1 minute.    The place is always cold, when I was here last the temp was 64 degrees.    Bathrooms are not clean, and the last two times I've been here the soap was empty both times.   Food is average quality, but the fries are great.    It's sad, this place could be so much better by fixing the HVAC and turning up the heat a bit, actually fixing your wifi correctly, it's seriously one simple setting in your router.    Clean your bathrooms, empty the trash, put soap in the dispensers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F3am6woZ-Ez2jXUHJvCSgg"
  },
  "XMapExe6OUImirkR2U7vvg": {
    "date": "6/13/2018",
    "text": "We popped in for lunch after the place across the street had issues with their registers. The sparse interior is spacious and breezy. The Grand is an order at the counter place and the service is probably best described as \"hipster.\" I ordered the Buffalo cauliflower and fries. I was pretty happy with my sandwich. It was spicy and \"meaty.\" The blue cheese cut the spice well. I didn't feel like the cucumber went with the other flavors. I would have liked a side of fries, but wasn't offered any (only realizing it was an option after watching others get their food) and ended up going back up to order a huge $5 basket.  My friend got the avocado toast and a white chocolate mocha. She was a bit disappointed with the toast--the avocado was brown. The Grand seems like a good place to work and grab a light bite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sC1zh2QPFcvTBXYnLAtX8w"
  },
  "Ydhm6XLcUdnw7th_wHgNkA": {
    "date": "6/18/2019",
    "text": "Stumbled upon The Grand, from the outside it doesnt seem like it would be a coffeehouse (I went pretty late at night) It's kinda dark, mysterious, but yet welcoming. The inside is so cool! It has a very vintage underground feel to it and I'm all about it. I ordered an iced dirty almond milk chai. The gentleman that took our order also is the one making the drinks, it took quite a bit waiting in line and waiting for our drink, but it's one guy handling it all so I understood. The drink was good, but I would haven't ordered it if I known ahead of time it was gonna be the powdered chai that one would get at Costco. I would definitely go back and recommend, but I would try a different drink.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CXm-MeN2wYyUnf4mTjx67Q",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CXm-MeN2wYyUnf4mTjx67Q/o.jpg"
      }
    ],
    "user_id": "AEH9gThvRqZkcd_d71-AWA"
  },
  "6d0ShwZ-j3Cz7XnY-5sQ2w": {
    "date": "4/5/2019",
    "text": "The Grand went above and beyond for me! I can't thank the manager, Chris, and the barista/bartender, Ruben, enough. This place used to be a club called Amsterdam. I met my girlfriend there 9 years ago. I decided to take her to The Grand to propose to her. Chris and Ruben helped me pull off one adorable surprise proposal. They played specific music for me that I requested ahead of time. They made a special \"marry me\" latte and delivered it to our table. They were more than willing to coordinate with me and having their help truly meant a lot to me. Ruben seemed completely ecstatic about being a part of the proposal and even surprised us with some champagne afterwards to celebrate. He made us feel more like his friends rather than customers. Amsterdam has always been a special place to us and now The Grand will forever be a special part of our story.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Gn_77o-BngkJWGcTUaZvgg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Ruben, the barista, made a special latte at my request and it came out absolutely beautiful!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Gn_77o-BngkJWGcTUaZvgg/o.jpg"
      }
    ],
    "user_id": "DYEfkN3nXhSqby3X5b7IFQ"
  },
  "dXHqCYrdtNB2m0rxitfuww": {
    "date": "9/20/2018",
    "text": "I used to love The Grand. Granted, I never thought it was the best coffee shop but it always did the job (despite the WiFi being non-existent half the time I came in).  Once classes were out for the summer I didn't come as regularly because I didn't need to study. Also, it's unbearable to be in The Grand during the summer because of the lack of air -- how can you not have a/c in Arizona?  I came in for the first time since summer last week and was met with a menu half the size, prices marked up a bit and no hummus platter. I LOVED the hummus platter and I would get it every time I came in because it was their ONLY vegan option. Their fries aren't even vegan.  I ordered the avocado toast ($8.50... come on) and asked for tomato instead of egg. I don't think they make their bread in house but they should stop ordering it. I couldn't finish the toast (sadly, since I paid too much for it) because it tasted rotten.  Now let's get to today. I ordered an Arnold Palmer with black tea. Repeated my order 3 times when asked what I ordered and still got the wrong drink. I won't even bother asking for a new drink since the girl taking my order was rude and short with me. I tried asking her if there were any vegan options and she just brushed me off saying some $10+ burger was the only thing. The lack of vegan options and customer services (+ no a/c) makes me never want to come back.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "1uB4E0zbR6tycd4KDw65Xw"
  },
  "PbuY1Y0W2f9pJFEDUB0lIA": {
    "date": "5/25/2019",
    "text": "The ambiance of this place is amazing. I absolutely feel so relaxed here. Friendly and attentive staff, great drinks, and I loved bring my friends here. Will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_DtMPpAFZnIFfPXBfSKEEg"
  },
  "LQuTYKoaQLgp6WXi4XeuAg": {
    "date": "12/13/2017",
    "text": "This is my favorite spot in Phoenix. Great ambiance, great drinks, great entertainment. The Grand should honestly be the #1 spot downtown.  Seriously, get the food situation figured out. The food here is pretty darned good, but almost every time I've ordered it takes almost an hour to get simple dishes, to the point where I rarely get food anymore. Every time I talk to regulars this is their #1 complaint, which is echoed by the other yelp reviews.   Definitely come here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RJIy7-Ci4vtthTH3mPrR4A"
  },
  "Ff_ja_2m7jdEaRxruonMyg": {
    "date": "7/15/2017",
    "text": "Last year I wrote a wonderful review of this place. I am retracting most of it now. Thinking it would be wonderful for my Niece Jasmine's baby shower, I tried to contact them by e mail for over 2 months before I went in person and talked to the ratty haired blond in charge of events. I wanted to have a Gold Coast Theme Gentlemen's area for the father and his party and then a separate area for the mother and hers reminiscent of the 1900s New York Society events. Well I was told NO and given the brush off like I wasn't even welcomed.  Well, I made other accommodations and as a result I would never recommend this place again. There are so many there alternatives that rude treatment like I experienced is never ok. The staff there was disgraceful! If I could give it less than one star I would.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cMYn57DxPUbULm9HJ5Mlhw"
  },
  "yh-HWAGFha53Je_8zCKb6w": {
    "date": "12/5/2017",
    "text": "Great beer! Loud staff arguing with each other when it's quiet or whatever...? Don't people in the service industry know it's kind of disrespectful? First time back here in 6 months. New staff, different vibe.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WZP3VvatwHHlG4DlpXbsTQ"
  },
  "smZm5k8CEcKLsbRJf5hOhg": {
    "date": "7/9/2016",
    "text": "Cool new spot in DTPHX! They're still getting up and going, but the atmosphere and service is already great!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Yrf7sQ7OvyZnmk4lrXKMSw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Yrf7sQ7OvyZnmk4lrXKMSw/o.jpg"
      },
      {
        "img_id": "7M2I129TPii_FNiteMaITQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7M2I129TPii_FNiteMaITQ/o.jpg"
      },
      {
        "img_id": "fDALaK9R7lOx1iHKshGlAw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fDALaK9R7lOx1iHKshGlAw/o.jpg"
      }
    ],
    "user_id": "fN4p_6jFo-aBCFcSRzuCUQ"
  },
  "rAJhjqVWz8B1HqI0HMzrVQ": {
    "date": "7/16/2017",
    "text": "Ruben was an exquisite bartender! He is extremely knowledgeable and made our night so much more fun than we expected! The avo fries are bomb but the highlight was definitely Ruben and his incredible cocktails!!! We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uov36k_9egXAmDfFMPodAg"
  },
  "lSwOJnjbADpyAS0ThCUwCA": {
    "date": "4/14/2018",
    "text": "Made the unfortunate mistake of going here this afternoon. Ridiculously SLOW service, subpar drinks, and forced tipping. Don't bother wasting your time here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HsfilEwH5Fm9c0LQgXVz5A"
  },
  "uvxhgRBBGbRZFS2Gf17WRA": {
    "date": "7/24/2017",
    "text": "4 stars for the latte and a brownie. Both were pretty good.  5 stars for the atmosphere, this place is dope! There's levels to this place.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cdl86D-ILiX4Tylg8Gdaqg"
  },
  "gT9fdRRDVC8jHlGIQFNsXA": {
    "date": "6/16/2018",
    "text": "Super cute place but the food really sucks. Havent eaten anything there that tasted good and the food comes out cold. But it's a good atmosphere to study or have a beer at, just wish the food wasn't so bad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uYrN8965sRiqAhJf_usMwg"
  },
  "UnfMUveSNK0LfufuzWVrqw": {
    "date": "8/18/2016",
    "text": "Design, decor and feel are excellent...Cold brew is not.  Bitter and tastes like it needs more time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TLcLpLCDIZClGAavWjzYeg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Cool bar and espresso bar setup..... Kailua please",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TLcLpLCDIZClGAavWjzYeg/o.jpg"
      },
      {
        "img_id": "LiKSV_4bjg1BKtCPb_DbXQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Train theme is super cool",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LiKSV_4bjg1BKtCPb_DbXQ/o.jpg"
      }
    ],
    "user_id": "TfneGP7-z9ZMQ3ayLVtO7w"
  },
  "VbByKu8Ux1pJhkvKBKTKWQ": {
    "date": "7/23/2016",
    "text": "Looked forward to coming with the the exciting write up and good reviews I saw here earlier.. I had a cold brew and a cappucino, both were terrible. The barista seems inexperienced, even checking with us if it was a small or medium cup that he was holding (?!)   I definitely wouldn't be coming back again, their coffee is terrible, especially for a coffee company!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "weSpPOejrEimMVCcP89ciA"
  },
  "IlbdmLBtZkYQbDwzL6CVDg": {
    "date": "7/11/2016",
    "text": "This is going to be a great place.  It's still ramping up, but I stopped by for a coffee this afternoon and was served a perfect macchiato.  Well done!     I'm very encouraged by the investment into this location, and I really hope the owners do well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2ISc9Mdgwj0DngVvSzaGxw"
  },
  "Baj8cJ_1RLgFcGjf23Zykg": {
    "date": "9/9/2017",
    "text": "Hey-o rebuttal review any one? This'll probably be one of my first \"serious reviews\" so I'm making it a plan to counter a bad review to compensate for lack of Jest. (Guess which one?) LET'S GO! Just left Grand. As always, the baristas are great, the service is prompt and the employees never hesitate to check on how things are going. Ordered myself the usual (never disappointing) iced chai along side (you guessed it) AVOCADO TOAST.  The zest to the avocado was tasty and felt like a real pallet cleanser. Couldn't find it in myself to complain about rising avocado prices, being as though that's an actual issue, especially for businesses like the grand. Everyone's gotta profit. I don't mind. I just want the cado. Didn't bring my kid (mostly because I'm 19 and don't own one) but even if I did own a child, I'd make it a point to teach it how to drink water without making a mess AMIRITE LADIES? Any-who, sat at the big round table upstairs. It's great for students like myself, equipped with charging ports for laptop and phone! It IS Pretty wobbly but I'm more of a problem solver and just pulled the ol \"righty tighty\" on it and adjusted the wobble. I'd like to point out that Grand does an amazing job of being versatile and diverse enough to serve all walks of life. They seem to be opening up a cool new portion downstairs for sorbet, have an upstairs for studying and the outside seating is amazing scene for a night at the bar. (Or I'd assume. What do I know? I'm 19) If diversity isn't enough to sway you on over, take note that Grand continues to be one of the largest/ more spacious coffee/bar joints I've been to in the metro area. That goes a long way with me. :) thanks Grand, for the kick ass service and the kick ass Cado.   Xoxo- Aysia (I miss us. Call me some time?)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QthVatylT4U8BAQh92Y1_A"
  },
  "O6PtmWM3rsX2ED5X2H1Uqw": {
    "date": "5/16/2018",
    "text": "Oh man, this place is not very good with allergies/dietary restrictions. Ordered the Buffalo Cauliflower after describing that I can't eat dairy products. I was assured it would be okay, but it was served with bleu cheese dressing on a brioche bun, which I can't eat. I sent it back and got avocado toast with the egg removed. However, the bread had butter on it. I already felt like such an annoyance I just stopped eating (luckily didn't experience any health problems) and left. To top it off, the Bell's Two-Hearted IPA I ordered was sour and clearly something was up with it. I gave 2 stars instead of 1 because others who don't have health restrictions might have an easier time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w7ev4rUIc_oPo8JPyl7PWQ"
  },
  "TAFhjyxiQBEGeb5BxE18xQ": {
    "date": "10/22/2017",
    "text": "Super interesting decor and good food ... BUT .. super SLOW service. Do not come here if you're in a hurry",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HQwnvPYoLmxIapRAhRD9aw"
  },
  "GvRJMf9PWEMZEsyiTofo2Q": {
    "date": "7/22/2016",
    "text": "Good coffee, GREAT atmosphere. Tons of space, nice employees, great seating options. Seriously: a great hangout or study location. I'm not a coffee snob, I'll leave that review to those who know the trade. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WElMDWWiksll-ytSOlTpqA"
  },
  "VFYy1hwPqniImV0Ma95rKw": {
    "date": "1/17/2018",
    "text": "Come in at and for the second time in a row their WiFi was down and was told there was nothing they could do. To just wait for it to came back on. What kind of coffee shop is that?",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nKoaBUk5OmRUf7UFPeymAw"
  },
  "MGLeKtPWHhCDdHmm2A5doQ": {
    "date": "5/10/2018",
    "text": "Wonderful cafe and bar! Very eclectic vibe yet completely relaxed for studying or hanging out with friends. The outdoor and second story seating are very appreciated. My go-to is the lavender latte - it's refreshingly delightful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PVaLb_-5Ods2OgJt_PmOoQ"
  },
  "dMeB-eixTeHagR5PO1DtPg": {
    "date": "7/23/2017",
    "text": "Love this place. I love that it's open 24 hours and their food is decent and they have a lot of selection for alcohol and coffee. It's awesome for writing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O8lont4VVaE-cK4IGxAfsg"
  },
  "SJQ3BoSchX0hZdp0lxd-MQ": {
    "date": "6/16/2017",
    "text": "I had heard about this place from a classmate.   One day I finally caved and tried it out.  I find that I cannot study very well at home so I am always looking for places to get my study groove on.  Number 1 positive - it's open 24 hours!!  I can come anytime and it's here.  They have a reverse happy hour and a mini menu for late night sessions.  There is so much space around it's ridiculous and you can spread out as you need to.  They also have plenty of places to charge up, upstairs as well as down.  I have mostly come at night since my hours are off and the crew I've encountered have been super friendly and accommodating.  The only reason not for 5 stars is it can be sorry of dark in the joint.  I don't know how it looks during the day and they do have lamps but it does get a small feel of romantic setting.  Also they play music super loud all night.  That won't stop me from coming though, I can bring headphones to down out the sound and enjoy the space.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vD7SJdmW3Qa2hawjpZUrPg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vD7SJdmW3Qa2hawjpZUrPg/o.jpg"
      },
      {
        "img_id": "3v8klmJUqXvdA-eKWDY0rQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3v8klmJUqXvdA-eKWDY0rQ/o.jpg"
      }
    ],
    "user_id": "1R6D0HVeg--AXRwbW3wo_A"
  },
  "DIfhqgls89mOXMKhtWhT3A": {
    "date": "10/4/2017",
    "text": "Perfect place to study or work. Friendly team, good coffee and food, open 24hrs, tons of room. Whether you're writing a paper or coding your next masterpiece, this is the spot. If the parking lot is full, there's usually spots open across the street. Meters are free after 8pm.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zIY3bQXNfHhYlnoEhsYuqw"
  },
  "rtA2bURMP0ljGb1-1CAdVA": {
    "date": "9/2/2019",
    "text": "Always the best service when I come here. The staff is suuuuper dope and I love the vegan options they have. I ordered the vegan breakfast burrito that has Just Egg, potatoes, vegan cheddar, and soyrizo.... BOMB AF! This was definitely worth the price. They have a selection of alcoholic and non alcoholic beverages along with many artisan coffee and tea selections (with many vegan friendly alternatives). This place also has a market place and is open 24/7. SAY WHAAAAAAT!?!?!   Perfect spot for meeting friends, and winding up or winding down. I'll be back again soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9XZWel27f2_Nxy3ADFrOTw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Vegan Breakfast Burrito",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9XZWel27f2_Nxy3ADFrOTw/o.jpg"
      },
      {
        "img_id": "Gui_FkvRf9asohLZW416fA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Oat milk matcha latte",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gui_FkvRf9asohLZW416fA/o.jpg"
      }
    ],
    "user_id": "8zvpTtzxXIJkPiQ7zHWAaw"
  },
  "FpceJR5uQ7f1PhctHzNN8g": {
    "date": "8/29/2019",
    "text": "Do yourself a favor and don't come here. I asked for a veggie burger to go, with avocado. I got my food on a plate and had to box it up myself.  Now mind you their paper machine was down, so I get it they either had to verbalize it or write it down.  So I box up my own food and start walking back to the hotel, I wanted to see if they had remembered my avocado and they hadn't put in there, and it was a meat patty not a veggie patty. I walked right the fuck back, and yes the young man offered to remake it, but how do you get so many things wrong? I simply got my money back and went on my way! Go ahead and go somewhere else!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eh5Ihci_poCf03AQ_5i-Ig"
  },
  "ndAu62C3dUyrWcWHYY8Itg": {
    "date": "8/7/2019",
    "text": "Great place to grab coffee & get some work done. Whether you're studying or working remotely, this space is perfect (also it's open 24/7)  The biggest draw for me is that their sizes are HUGE, which is perfect for a caffeine addict like myself. They always have interesting/tasty drink specials for those who are a little more adventurous.   & all this coming from a former patron of Amsterdam/Bar On Central!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wwy6SXC1adovFkGv9vrBvw"
  },
  "IcxD6XW-Uocev6zJL2gxyw": {
    "date": "6/28/2019",
    "text": "How can you not love black light lit menus? Or a spooky cafe? What about a rustic, regal, yet gothic mansion of a study space? This is: The Grand!  The coffee, bar, and general store are excellent, staffed with lovely and friendly people that genuinely like working here! Always a good sign. For coffee, I've had a \"Butterscotch Latte\", and \"Lavender White Mocha\", and both were excellent! Breanne (bre-an) was the barista and she is very sweet and patient. I was told the baked goods come from a local bakery, Barb's Bakery. I'm always happy when local businesses support each other.  The general store is cool too. They told me the owner brings in really neat items, I for instance saw marble candle holders which were as grand as well, The Grand! haha and I snagged them! Excellently priced as well.   I've always loved The Grand for its atmosphere and drinks and especially its speakeasy \"Sanctum\" where you can enjoy The Grand's live music from above on Friday and Saturday nights. I only recently came back to try the food and it was not as great as its bar scene unfortunately. I had \"The Grand Burger\" but the bacon was not cooked all the way. I also had the \"Caramel Apple Waffle\" but it tasted cheap, I was hoping for a much richer batter like Matt's Big Breakfast's (across the street) Belgian Waffle.   All in all, I'll be back for the coffee, and drinks on the weekend, but I don't think I'll be eating the food anytime soon. Maybe I'll try something from the baked goods case near the baristas but probably won't venture beyond that.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "FBCkwfEjU9EBlgGMj2braw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. It&amp;#39;s open 24/7! You can see the Westward Ho from here.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FBCkwfEjU9EBlgGMj2braw/o.jpg"
      },
      {
        "img_id": "sAEWTroDznTuo9xcW5gbMw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. The Grand Entrance. Pun much intended.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sAEWTroDznTuo9xcW5gbMw/o.jpg"
      },
      {
        "img_id": "nQtMxi8aQtpmlkMOhuuo5w",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Patio entrance.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nQtMxi8aQtpmlkMOhuuo5w/o.jpg"
      }
    ],
    "user_id": "W4ZuWztx47aiksyYPUMYDw"
  },
  "eTE8mj7sLiz-24XW97agsw": {
    "date": "7/24/2019",
    "text": "Excellent place to study or meet friends for coffee.  I ordered a medium sized soy latte.  The cup was very large - yay - and very reasonable.  Flavorful latte! Kudos for having items from local vegan bakeries!   Service was excellent.   Ambiance was excellent.  I will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MXIHZkIOuacXlQ2uHXNESg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Delicious, vegan, and locally made",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MXIHZkIOuacXlQ2uHXNESg/o.jpg"
      },
      {
        "img_id": "n9E-nkS2Y40sKazHbQzN_w",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Delicious vegan treat from a local bakery.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n9E-nkS2Y40sKazHbQzN_w/o.jpg"
      },
      {
        "img_id": "o37s5AaHQg2VOVq5Arlk4A",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Medium sized iced soy latte.  Delicious and economical for the size.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o37s5AaHQg2VOVq5Arlk4A/o.jpg"
      }
    ],
    "user_id": "FNLMGTCHFXD4k6ov6rivuQ"
  },
  "cJnXouavhc_3jgz0hs9tMA": {
    "date": "5/11/2019",
    "text": "This is one of the best places downtown to grab a coffee and study. The food is good, the atmosphere is good and the service has always been great. On a nice day, their patio is perfect, and has window seating that fronts up against the inside bar.   Did I mention they have cronuts?! Soo good!   The secret doors that lead to backdoor bars and dance clubs are for a separate future review but add to a cool vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dQ28vPZAFACjCEjfjwfyhg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dQ28vPZAFACjCEjfjwfyhg/o.jpg"
      },
      {
        "img_id": "ShOYC3n2E0Ru3jaxtTy9cA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Upstairs study area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ShOYC3n2E0Ru3jaxtTy9cA/o.jpg"
      },
      {
        "img_id": "5Jz-P5EZt1ZIjDpGxnfZ6g",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Upstairs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5Jz-P5EZt1ZIjDpGxnfZ6g/o.jpg"
      }
    ],
    "user_id": "p1RENV6AxtXJuPGnx4YhjQ"
  },
  "CM0-luorgbfppVLc4IdgVQ": {
    "date": "7/11/2019",
    "text": "This place is definitely different; it has come a long way. The last time I was on the property, it was the gay bar Amsterdam. My, how things have changed over the years, in a good way. It has a hipster, steampunk, study/work area, coffee vibe. That is the only way I can explain it. It is 2 stories and is very open and spacious. They kept the chandeliers from the bar before it, which I love! The coffee and bar area are down in front as soon as you walk in. They then have a ton of different tables on the first floor with plenty of space to work or study; a small kitchen tucked into the back and a small area in the very back that has bottles of different drinks for sale. In the center is a staircase that leads to upstairs. This area is fun. There are a lot of different tables, couches, and chairs for you to relax and read, study or work. I really enjoyed the concept since it is right by ASU, so it gives students an air-conditioned place to study or work.  I had a business meeting here, and it was a great mix for everyone. They have a small menu of food, so we were able to snack, coffee of course for everyone and alcohol for after the meeting. We were here for about 3 hours, and it flew by. We had enough privacy to have our meeting and enough options to mingle, catch-up and get some work done. If I am down in the Phoenix area again or need to plan another meeting out there, I think this is now my go-to spot. Only downfall, small parking lot and you have to drive around the block to get to the parking area. Do not do what I did. It is a one-way street! (insert face into palm) I have had bad luck with that intersection haha! I wish I would have found this place sooner.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "7SN81BGKQSWcH-y1oh1k5Q"
  },
  "2HUwXOL160RcxtLXxZuI_A": {
    "date": "9/1/2019",
    "text": "I was searching for a good place to study and stumbled up on this gem. The food is immaculate... shout out to the kitchen staff James and Deandre for their outstanding service, good job guys. To top it off, my laptop was dead and I couldn't find a table with an outlet, but this angel, Leah, found me a nice and cozy table upstairs with not one, but several outlets... lol .... thanks Leah",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "akF7INodc1bgLKIhO_Dabg"
  },
  "a2hSbyQ2a1X9YQPU49NWbQ": {
    "date": "9/1/2019",
    "text": "Absolutely INCREDIBLE experience. Phenomenal atmosphere, service, and food. I ordered the Buffalo Cauliflower, and it was out of this world. One of the chefs, DeAndre, came to check on us and our meal. Great service, delicious food, what more could you need? Would recommend this to anyone, and definitely coming back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KmRKbaXOZs8r-4Tcy-XZog",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KmRKbaXOZs8r-4Tcy-XZog/o.jpg"
      }
    ],
    "user_id": "9pOv3gbqGeNdhGOw-TaI0Q"
  },
  "aFODp9pUhPGAMzjTzTXFhw": {
    "date": "9/1/2019",
    "text": "Phenomenal experience dining at The Grand. The service staff was incredibly friendly and provided a warm atmosphere. I ordered the Mac n' cheese burger with sweet potato fries and I had no negatives to say about my food. The sweet potato fries especially were the best I ever had, a pleasant light crisp on the outside with an inside that had the consistency of mashed potatoes. I had the pleasure of meeting D'Andre who was the chef and made me feel like I was eating food he was passionate about, and no qualms about it he should be proud of his work.   I'm coming again when I'm downtown next time for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9n5Fwycl0RSn6TNz09aaBw"
  },
  "AYyW6xh-esI7sS1Gq97tFA": {
    "date": "6/8/2019",
    "text": "What a neat place to hang out!!  Stopped in to check out the speakeasy \"Sanctum\" and decided not to go inside since there was a $20 cover charge.   Instead I grabbed a drink at the bar inside The Grand and just soaked-up the live music.  Inside there is a balcony which is perfect for sitting and watching the eclectic patrons come and go.   This isn't really a jumping night-life spot but a perfect place to just sit and relax, it's a definite place to check out!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GfdCShDQltDOJYVkmrAxZA"
  },
  "vXmbHu-xy9ZEGPR8vqIaxQ": {
    "date": "8/26/2019",
    "text": "Very neat place. I love the atmosphere and architecture. The servers were friendly. They have vegetarian options and the cauliflower pineapple teriyaki was amazing! The drinks were pretty and tasted great! I will have to visit again sometime.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tC5C0dtPKBGdGIO_nwnEdg"
  },
  "mFa_med2EOH8KTCSZtF-5Q": {
    "date": "5/28/2019",
    "text": "Went from an awful service experience down the road so when we stepped into this place for a beer we were so relieved to find really lovely and just really warm and friendly bartenders and baristas. Every employee we came in contact with was absolutely lovely and seemed like they actually enjoyed people and their job.   Their draft beer selection is awesome (especially for IPA lovers) and the patio is so cozy and shaded and spacious. We had our 2 year old with us and the guy who rang up her creamsicle asked if he could make her a chocolate milk on the house. It was just an overall really lovely experience and we can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tN3CxjSFgevrrv098r2ijA"
  },
  "IhXlLVjfJRBd1wn67znBWg": {
    "date": "4/29/2019",
    "text": "I was so bummed that the food here was not good. I ordered the mac and cheese burger with the veggie patty (so did my 2 friends, who were also disappointed). There was no seasoning on the burger what so ever and the onion rings were not cooked all the way. I did like their coffee and pastries but I'm almost certain they buy them from an outside vendor. Such a bummer for such a cute place, they really need to step it up when it comes to the food if they're going to want to keep this place around. If I'm paying $15 for a burger, at the very least I expect it to have some seasoning on it.   Also, the two girls working the kitchen were rude and non-attentive to most guests I saw them interacting with.  Save your money and go to PHX Wilderness or Angels Trumpet Ale House, they for sure will not let you down.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "xasqKd7MOPJF5i5vG_d7Lw"
  },
  "kGNFfAFtg1tviAqH96sXRA": {
    "date": "6/19/2018",
    "text": "The Grand deserves all the stars out there, because it is just what it's name says...it's pretty darn GRAND.  I am so thankful I was introduced to this place. A 24/7 coffeeshop/eatery/outdoor patio/study atmosphere/hangout/bar place! Seriously, what can get better than that?  Ambience-   Inside: I'm the type of person who likes a little background noise while studying so this place was my ideal arena. I came here on a Sunday afternoon for a good two hours, ordered a flat white and sat at a table and peacefully studied for the GRE. There's an upstairs with more privacy and enclosed areas with lighting and smaller tables for one person. The downstairs has larger tables for group hangouts/group study.   Outside: You can sit at the large wood bench-type seating at the outside patio that is SHADED and beautifully surrounded by plants and trees! I always love to see the anomaly of greenery in AZ (although I do love the desert vibes as well). There are also small tables and chairs to sit at outside.   Food/Drinks-  The food menu is diverse ranging from burgers, mac and cheese, salads, and soup. The coffee menu is pretty unique but at the same time standard with your cold brew, latte, etc.  Alcohol Bar: They have a decent sized bar right when you walk in and I noticed on the Sunday that I was there that couples and groups of friends came in to grab a drink at the bar and leave soon after to continue day-drinking. I mentally took a note of doing that with a group of girl-friends one day, too. Great idea! ALSO, their drink menu is super fun, they have strawberry basil margaritas!? say YUM.  HIGHLY RECOMMEND: I'm excited to go back to this place at night for a night-cap, but also to study some more and order food. I think this is the perfect place for people who are hiring to take their interviewees here if you are giving more of an informal interview. You can grab either/both coffee/food/drinks and sit down in a more private table upstairs or if you need a little bit of noise, sit downstairs!  Pics on Instagram: @deeps.eats",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "FarPmshtbUI9o9bAXplCIA"
  },
  "X3IZbJ1PABfb0LCcv3IeLg": {
    "date": "12/13/2018",
    "text": "I stumbled across The Grand on my recent desert sojourn, and I am frankly shocked by the number of negative reviews on here. If I lived in Phoenix, I would patronize the The Grand daily.   The coffee is some of the best I have ever had; it evoked the memory of the high quality cafe con leche I used to get when I lived in Spain. To use an analogy, The Grand's coffee is to Starbucks coffee, as Starbucks coffee is to gas station coffee.   The food is good too. I had an opportunity to sample both the breakfast sandwich, with their house aioli, and the Grand's take on the BLT (the BLAST). I recommend both unequivocally.    Good coffee and good food make a good cafe. What makes The Grand great is its combination with beer. Such a place like this does not exist in the national capital region (if it did, I hope that I would've found it by now). The Grand actually has good craft beer (I'm specifically thinking of Wren House Brewing, which I was unable to find anywhere else while I was in the desert).   As for my fellow Yelpers' complaints about the internet, there did not appear to be any issues when I was there. Plenty of people were whittling the day away on their laptops.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dDtOXJKR_BCbTNB052bJPA"
  },
  "mKuac9ZLt505KRC49snLnA": {
    "date": "11/16/2018",
    "text": "First time I came for an early dinner. My first impression was that it was pretty dark inside, but the place is gorgeous and has a classic speakeasy feel to it, even in cafe forms.  As always, I got my chai latte, here with almond milk and almond syrup. I enjoyed good flavor, just the right amount of foam and the perfect temperature. Weirdly, though, they gave me a disposable cup when I didn't order to go. Save a tree, Grand staff! This was so good I've already returned for it once. Staff are friendly in the mornings and the donuts are delicious, especially warmed up.  Outside of breakfast, my order of avocado toast was sadly disappointing. It felt like there was no seasoning at all. You can make an amazingly flavorful toast with just smashed avocado, a sliced boiled egg, and some greens, but you have to involve at least salt and pepper.  Finally went for a drink last night and I was disappointed again. It was still early on a Friday night and they weren't busy by any means. The cocktail menu looks great, but I spent $15 on a drink that mostly tasted like soda water. Looks like this place is relegated to being a breakfast stop only.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "aR1C6NjVUnRGUT9PAi7k2g",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aR1C6NjVUnRGUT9PAi7k2g/o.jpg"
      }
    ],
    "user_id": "XGcDRNkgS3-DkDL9wYUfQQ"
  },
  "Il2gOV-Q5o7S2yx8IBgPsg": {
    "date": "1/25/2019",
    "text": "My vanilla latte was delicious. The study nooks abound here! You can study outside or on the top or bottom floors. The lighting is a bit dim but I think that's for the vibe. There's food and drink for everyone here and it's open 24/7!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x3FOJmXsN3zXGFtgnqWK7g",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Vanilla latté",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x3FOJmXsN3zXGFtgnqWK7g/o.jpg"
      }
    ],
    "user_id": "RdUQbdk5KpZMCBwvrkeDbA"
  },
  "vVva6luNnaVT3jltKjR_Ug": {
    "date": "10/28/2018",
    "text": "I'm not going to bother reading what negative reviews could possibly exist for this place. It needs all the support it can get.   Phoenix finally has a GOOD 24/7 coffee shop that serves excellent-quality food (recommend the grand burger or impossible burger and sweet potato fries).  It is also styled like a 20's speakeasy with wrought iron, wood, repurposed gears, has a ginormous patio, two floors of seating indoors and outdoors, and is one of the few places downtown with good parking.   protip: learn how to enter the parking lot from the back after your first time there.   top tier pastries and baked goods, the donuts rock (get it warm)  fantastic teas and great coffees and espresso drinks  the baristas and bartenders are genuinely friendly   the WiFi can be temperamental the further you get from the router like normal   Mac and cheese of the moment - a chef special take on their already incredible homemade mac and cheese   skip weekend nights if you want to study or work - it shares walls with a goth club called sanctum. they also sometimes have live music on the grand patio for weekend nights.   full bar featuring absinthe! why is every review not 5 stars? I'm not even done.  on top of all of this, there is, for some reason, a fully functioning market / store in the corner with its own entrance, menu, and sundries. they sell cereal, snacks, and lunch time stuff.   being inside this place doesn't magically not make you in downtown Phoenix - use common sense at night and take the normal precautions for being in urban areas at night.   their menu is 24/7. I should have both lead and ended with that.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Ntw11MeHxYmW-U1LlUchoQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ntw11MeHxYmW-U1LlUchoQ/o.jpg"
      }
    ],
    "user_id": "LhV7Uxe6cvOBU4OBh6PPdg"
  },
  "rAA_GE45Hgaq5ssGvdHfuA": {
    "date": "8/18/2019",
    "text": "This place is THE best coffee place I've been to. They're very welcoming and friendly. They have an upstairs platform so students and work quietly. It's open 24 hours and the food there is AMAZING. I went here with my family once and my brother got a burger and he said Hands down one of the best burgers he's had. If you're looking for a place to study and eat some amazing food this is the place to go, and the food is worth the price. Definitely go if you're looking for a nice place to study all night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kltta5wmn1xT5-ESKYsFRw"
  },
  "ZbWWi8lIf9b1S-3w09Fb0w": {
    "date": "12/28/2017",
    "text": "I definitely love the atmosphere, excellent drink choices and now food. If it were permissible I pretty sure I would live here. By far my favorite place to get specialized beverages. Their Scotch and Cigars cocktail is exquisite. Seating it plentiful, my only one complaint is ever since the opening of the kitchen it has become a little too hot to sit inside during the summer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o_xB5gaDjRForCTu5-wZtQ"
  },
  "Pmkcn9t6OzLbBa4DW8aGIw": {
    "date": "2/24/2017",
    "text": "I only tried a soy chai tea. It was more than generous fill for the cup. It's sweetness is perfect, not too much and not too little. I did not like it tho since it smelled liked a cough syrup. I did not like how loud the music is since I went there for studying. Even though I wore a Bluetooth earbuds, but still heard the noise. Around 3, it was the time that kids got out of school and there was more noise beside the music. I couldn't finish my project and had to change the place.   The decorations and the sittings are varied and an all comfortable levels. The restrooms are nice and clean. There are a parking lot behind the location and meter ones around it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B0MYSwBI9mDAkEu_Z-yh7g"
  },
  "fy1rWhuP38yUz0cS_VNTeg": {
    "date": "11/4/2017",
    "text": "I hesitate to even give this place a single star. We tried to sit outside and they told us they only serve inside. We sat inside for 10 minutes and eventually realized we had to go to a counter to order. When we went to the counter the woman there literally had no idea what was in any sort of dish, even the side salad. She couldn't give recommendations and ordering took literally 15 minutes because any simple question we had she couldn't answer. The service here was extremely subpar. We were the only group of 3 orders in the restaurant and it took 20 minutes to deliver very subpar food. I will never come back here.... or if I'm forced to again I will not order due to the horrendous service and wait time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qujiEex1KTkcGZupI82PGA"
  },
  "8GKbgIfjw_IL8yTxz8xWzw": {
    "date": "11/28/2017",
    "text": "I WANT to like this place. Location, vibe, great patio, good beer selection. but i CANNOT get past the service and general malaise of the staff. It's almost like you are disturbing the work with the inconvenience of ordering something. which SUCKS, because the food is really good! My guess is that it is a perfect millennial hang out, (which I clearly am not a member of) low ability to interact, severe entitlement, and you can stay for hours without being bothered. I dunno, given the competition for coffee shops downtown, a few minutes of training would go a long way to putting this place on my rotation. DO BETTER!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j2ASdNOYY4SdXbE3KpkAKQ"
  },
  "NhpCIAVIOdZxFzWIM2C2MA": {
    "date": "8/4/2018",
    "text": "The service is horrible! The girl with the grey Zombie hair is rude and her BRF needs to be surgically removed. The burgers are great! Nice atmosphere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u88_GEU2BktCRmj9jKVFdg"
  },
  "PA6d-0PJmuBI7cuZK7pjoA": {
    "date": "8/3/2018",
    "text": "I'm giving this two stars because the food here was not very good. I got the grand burger which was not so bad, but I ordered fries and they were disappointing. They were so hard and I felt like they were stale. I also got a strawberry lemonade which was way too sour and sweet. The place itself though was very pleasing but the food was not.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vpdyuGVNDtJmhh7Rdfmojg"
  },
  "9cHNtXuRCLHMZ3UWD-fEYw": {
    "date": "11/2/2017",
    "text": "I visited my family in the area about 2 mons ago n the food we had was amazing!! Fresh produce, meat etc. It seemed like the meal was made just for us, on the spot! I was so impressed! I recently came back to your establishment within the last week, expecting the same freshness n brightness with the food, but to be honest, I was much less than impressed! Seemed like frozen vegetables left out to thaw and water logged. Same for the meat! I honestly felt embarrassed bragging to my friends and family in the area how amazing the food was at this restaurant for them to tell me, it seemed like fast food quality... not sure what changes you have made but please go back to ur summer time quality!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "FlfX7FkirzqsQKBVesI_Rw"
  },
  "4A2YpjfI_koqpQx2TaomEA": {
    "date": "7/31/2018",
    "text": "My friend and I walked in here and immediately felt so welcomed by Zoe and Alyssa, the bartender and barista! They were so sweet, attentive and personable and made us delicious drinks. The customer service was wonderful and we'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MK8Y0txEl4KbPBr1gMZPQw"
  },
  "JK5bgD3rQs3BHNqKYBFrJQ": {
    "date": "7/31/2018",
    "text": "I usually love coming here , the coffee combos are the best.! But lately the coffee baristas have been having bad attitudes and seem stuck up. . It makes me very uncomfortable and ruins my visits. Sucks because I really enjoy coming  here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b9gQuB60RcMVkryRRNi_Gw"
  },
  "eXDRMorbj5Q2nBr3qCbk1Q": {
    "date": "4/24/2018",
    "text": "I've been to the grand about 4 times. The first time I went there I was intrigued by how different it looked than any other place I've stopped to grab a snack. I try not to write a bad reviews on places because I know sometimes days go bad. However, all four times i have came the customer service hasn't been the best. I also haven't had very good experience with their food my burger was pretty much burnt, as well as my order was forgotten. I waited while my family received their food. Might be a good place for drinks but not if you want good customer service....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wZSqZxTtVmzT3iOIB9efcw"
  },
  "5YNwaeJq4JIL6gj6AmYy3w": {
    "date": "8/15/2016",
    "text": "Had to see this place in person upon reading an article about its' new opening and I was not disappointed, though it was late so I did not try out the coffee I give the atmosphere and staff 5 stars, very cool place, I will be returning to  try the coffee upon my return to Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AxzP6_WhMKpgAftedC5s-g",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AxzP6_WhMKpgAftedC5s-g/o.jpg"
      }
    ],
    "user_id": "xep-k9EVaVebXxsGLpeX2A"
  },
  "bLu0wuIgyxVCxhaWkPm3Vw": {
    "date": "12/12/2017",
    "text": "I love the simplicity of this place. The fact that it is open all hours is a plus.  A great place to stop for a bite or just hangout with friends. The food is really good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ieAT-Zqnl4QNTGRUXBYamA"
  },
  "Lm0wWD7QFNaJM2E4r05Oyg": {
    "date": "1/29/2017",
    "text": "This place is a great place to study!  It's spacious, and relaxing!  Their interior design is cool too, feels like you are in a coffee shop in NYC.   I've hung out at the bar with a friend as well... there is not much of a variety of drafts but the bar tender was very friendly and offered us the many other varieties of mix drinks they had to offer .  I definitely recommend this place for meetings , studying time, or just catch up with a friend .   The location is pretty tricky to find.. the \"light rail\" separates the location, and \"the one way\" ,  tricks me into going to del Soto coffee shop down the street instead ...  I recommended giving this place a shot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U4NbXMsOxscCS_hH4x-lnA"
  },
  "hDaHBhha3WI0uZIY_84Iog": {
    "date": "6/2/2017",
    "text": "One of the best coffee shops I've been to, and I've been to many!  First and most important to me, this coffee shop is *huge* and has amazing support for remote workers. Large tables, plenty of power outlets (and I mean plenty!), and too many nooks and crannies to hide yourself in to count.  The menu is fantastic any time of day. You can get a scotch & cigar and 4am in the morning -what a treat! I recommend trying the \"Mac of The Day,\" which is a different take on macaroni each day. (Some have included: pot pie macaroni, buffalo chicken, etc)  I really enjoy the bar options as well. Plenty on tap and specialty drinks. It's the only place I've been able to find a good lambic/sour beer (coming from Chicago where they are plentiful, I've been sad!)  Service is a little slow times, but that's to be expected with the large interest in this place.  Check out some of the pictures too. This place is BEAUTIFUL, both outdoors and inside. 10/10, if I had a coffee shop, this is exactly what it would be.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mHoLs9QKfUdmbZ93hNksJw"
  },
  "EGWQvfFIqMMSpLgmFurYyA": {
    "date": "7/10/2016",
    "text": "I stopped into this new coffee shop today after reading about it on AZ Central. I was excited to see what they did with the old Amsterdam bar.. When I arrived, I found it a little difficult to park because it's located on a one way street ...so for everyone trying to park, make sure that you go South one street to pierce and then turn into the small road to the left side of the light rail so that you can turn into their parking lot. The place has very cute decor, with clocks showing the time  in different parts of the world(you know, grand central themed). They have a loft area upstairs and ample seating downstairs (the perfect place to hang out and study or chat with friends). The staff were all friendly and helpful. They source their coffee from infusion coffee and tea in Tempe and get their chai from David Rio. Essentially the drinks here are like the drinks at infusion Coffee and Tea (aka delish), but far closer to my house (even better). They also have a full bar and many beer taps (a variety of local and nonlocal craft brews at a decent price point). Their happy hour right now is from 11 to 7...most excellent. I know I will be making many return trips to Grand Central and recommend you do the same!",
    "rating": 4,
    "rated": {
      "funny": 11,
      "useful": 21,
      "cool": 19
    },
    "photos": [
      {
        "img_id": "MVXKfaoGkfOWtrP2_XEepw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Beer list",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MVXKfaoGkfOWtrP2_XEepw/o.jpg"
      }
    ],
    "user_id": "d_TBs6J3twMy9GChqUEXkg"
  },
  "C36AlQ6NfLwKYseGbH5Ing": {
    "date": "7/17/2016",
    "text": "Went there for the first time. The barista at the register didn't acknowledge us. Stood there for a while before we were helped by someone else. Definitely didn't feel welcomed.   Besides the service from this particular barista, the place has a cool vibe, and good coffee (caramel latte).",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "uF7PEAjR1PUiU-z5EFsMTA"
  },
  "50UyjhP9Xt2YTOqE9KCuzg": {
    "date": "7/12/2016",
    "text": "Okay. So first off the we have a coffee shop downtown with an amazing floor plan of space and seating. Open till midnight during the week, weekends they go untill 2am they have amazing coffee not to mention a full bar with over 23 amazing beers on draft! Honestly please come check them out located in the heart of downtown with a awesome atmosphere and good vibes. Cheers",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2MZZzyVA4ewyKf0dpO2cAg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2MZZzyVA4ewyKf0dpO2cAg/o.jpg"
      }
    ],
    "user_id": "v2Sli_rK_kya8jRJ-uJxKQ"
  },
  "kwgF0xyYXZIW9AP6jYqsVA": {
    "date": "1/6/2017",
    "text": "Great location, vibe, staff, beer and coffee choices, live music and much more. Expand the food menu for five stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0TvQYVDe6GzydXK1mSS49w",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. The beers available constantly change, so come back often",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0TvQYVDe6GzydXK1mSS49w/o.jpg"
      }
    ],
    "user_id": "2B0lIKcwST4ynwoHmGOTRA"
  },
  "095VY0Mk6U5GJp1ILRNa9A": {
    "date": "1/1/2017",
    "text": "Unique setting.  One-of-a-kind coffee shop right in the heart of downtown Phoenix. Really good coffee and tea selection, pastries, and a million little nooks and crannies for you to explore. Worth a look.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xyPPThpdp4u8MWQsgNhiNw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xyPPThpdp4u8MWQsgNhiNw/o.jpg"
      }
    ],
    "user_id": "TnRcGRybKUR5phkN7Es3jQ"
  },
  "kbvTy04p_37bmBqjqz_73w": {
    "date": "12/19/2017",
    "text": "The Po Boys & dope vibe gives this place a 5 in my book!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C_X822czAgmoKKEQL_ISNw"
  },
  "M8KBH1zYiI2405dwkJTS8g": {
    "date": "4/5/2018",
    "text": "Yikes. Really wanted to like a 24/7 2-story coffee house. Ordered a very small breakfast sandwich for about $8. Was listed as having egg, white cheddar, aioli, chives, on a buttermilk bun. It came with regular cheddar and bacon. I told a barista I think I got the wrong sandwich, as it didn't list bacon and the sandwich I received didn't have chives or white cheddar. She had me go grab a menu and show her what was wrong. Umm, okay. So she offered to remake it. Round 2 all I got was eggs on a bun. No chives, no white cheddar, no aioli. I didn't have time to wait for them to screw up a third time, so I left. I'd understand if you messed up a complicated order with a lot of customizations, but how can you not handle the standard items on your menu?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0jd90CYCln0Rsz6qIWNp5w"
  },
  "i2p1DXykUysZgheFWXrDAw": {
    "date": "9/20/2018",
    "text": "I hate leaving bad reviews but a friend and I have a big exam tomorrow so we came here to study and I paid $5 for a coffee that wasn't that great, and the WiFi doesn't even work. Not to mention there's absolutely no lighting in here. Maybe it's not a place to study, but if that's what you're looking for you're not going to find it here. Very disappointing.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "PSG-c8dVeZTJ_6P90caaQA"
  },
  "te5P3N_4AMVZRo2N9yCRtA": {
    "date": "11/15/2016",
    "text": "Is it the nostalgia of Amsterdam's that creates my love for this place? Perhaps. I do like walking in and looking at the former dancefloor and picturing my younger self getting my groove on (but I digress).  The beer section is amazing (happy hour from 11-7!!) and the coffee is almost as good. They have spared no time or money in redeveloping the old spot in to a new place to hang out. The decor is like a steampunk train station and the seating area is open and offers a few different levels along with a large outdoor patio.  This is a great spot to relax with friends and I would have spent a lot of time studying here when I was in school. If you happen to find yourself downtown check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sTcYq6goD1Fa2WS9MSkSvQ"
  },
  "F53djhgcFYwgostiS1URhw": {
    "date": "8/21/2018",
    "text": "I love their coffee and come here quite often actually! The thing that makes this place for me honestly is a worker named Hannah. She is so kind and easy going and did her job extremely well! Whenever I go in I always hope to see her because she's my favorite employee.  Side note: Lavender coffee is shit... didn't know it was a thing until recently.. but who decided that should be a thing? Because it shouldn't be.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YNlLOUqjhpoG9vJEXGrrbw"
  },
  "q96dJX3R4G36gUQcn_6Jog": {
    "date": "8/2/2018",
    "text": "The Grand is... grand! It's a 24 hour coffee shop that doubles as a bar/restaurant. It can be a teeny bit pricey on the food and coffee side, but the drinks are great and usually worth the money. The actual building is huge, plus there is a big outdoor patio with several different sized tables and seating areas. The Grand also usually has a pretty good soundtrack going on, and the place genuinely just looks very cool. Perfect for a first date, coffee and study session, or just to hang out and catch up with friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CbqyZh3ShaHGcegfFsvh_g"
  },
  "Q-P6EgtEv4nmstP4KevRDA": {
    "date": "12/17/2017",
    "text": "This is a very cute and urban place to hang out, grab a quick coffee or lunch, and study. My roommate told me about it and my boyfriend and I went to study there and we love it. It's a very good place to go when you don't want to stay on campus to do work. We used to go to Starbucks as well but it's always so cold and a lot of people got here and there's limited outlets and this place is sort of made for studying and such. I completely love it! The prices are a little crazy, but the food is pretty good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S4NUyDC9yiRiRNJDp-JjkA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S4NUyDC9yiRiRNJDp-JjkA/o.jpg"
      }
    ],
    "user_id": "PRLMnml2f2ypJYAyrHGagw"
  },
  "xAUtr5BEO6XxrUM8zaOw2Q": {
    "date": "3/4/2018",
    "text": "I like this place, the staff is friendly and welcoming. The menu is very varied and offers everything from a full bar to espresso drinks, salads and sandwiches. I had a capuccino and it was perfectly made. There is plenty of seating on two levels and also outside. It is really cool that they are open 24 hours!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "YfvMjY-G6y86Ov2tS5Txww"
  },
  "r4p4pPsXuSCgXJMeKdY9oA": {
    "date": "4/3/2018",
    "text": "What a gem. 24/7 coffee shop, bakery, craft bar, and restaurant.  Great place to work, study or just hang out. There's a good amount of outlets all over the place for your electronics. WIFI is pretty quick too.  Eclectic atmosphere - artsy train station with an industrial vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ugc64d8nCtvCkQtOHDKeMg"
  },
  "GrFud_hDSjZOSEZwyG4-JA": {
    "date": "7/4/2018",
    "text": "This is the combo coffee shop/bar/retail beer store that Downtown Phoenix has been waiting for. Open 24/7, the staff is always friendly and attentive, and the beer and wine selection is massive. The coffee is pretty good too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UYc-BIJf_RgqQcWZVKd3dQ"
  },
  "Gs_ii8bYfbJtfdaWv3k0Tg": {
    "date": "7/11/2016",
    "text": "Only two weeks old and True to its name, the Grand Central Coffee Company is reminiscent of an old train station, exuding a vintage flair and charm. With home brewed lattes made in-house and all craft beers on happy hour from 11am-7pm, this new venue is sure to be a hit downtown. Located across the street from the Phoenix Public Market, the converted coffeehouse still has parts of its old heritage, a nightclub, transitioning in the making. With two floors, two outdoor bars (work in progress), and a kitchen remodel, you can still stroll up and down the staircase exploring what's to be, as the large venue is not completely finished. In the meantime, revel in its mystique with a delicious sip and ample comfy couches before the crowds come.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "9bIGqAmwD793QoCYUCXmUg",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Outdoor entrance",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9bIGqAmwD793QoCYUCXmUg/o.jpg"
      },
      {
        "img_id": "0C-aGMPS7QIcVSD2fRYupw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Banner outside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0C-aGMPS7QIcVSD2fRYupw/o.jpg"
      },
      {
        "img_id": "nZ0e2cJvp-5-pWwm-GLSlw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Cool painting",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nZ0e2cJvp-5-pWwm-GLSlw/o.jpg"
      }
    ],
    "user_id": "4ECIXWllFTxtJaj1cKOZWw"
  },
  "nEbWD118eftwFVigCy3KCQ": {
    "date": "7/24/2017",
    "text": "What a fantastic place! A friend suggested that we come here for drinks after work and I was very impressed with the experience. The Grand is a steampunkis/speakeasy-like/intimate bar with a vast array of drinks and great music. My friend also let me know that there is live music. We saw that there was very nice and cooled outdoor seating which I will definitely be trying soon! The bar staff was also very helpful, friendly and knew what they were doing as far as making very unique and tasty drinks. The Grand is also open 24 hours! Great for people who are looking to do some homework or get out of the house! I will be coming back soon for sure.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "LGABwF9U75AZiczeoAkcTQ"
  },
  "_5Wy-NWdCX2goYC-gmGmWQ": {
    "date": "6/11/2018",
    "text": "First time here and I got the Chai latte and oh my goshhh. It was so good!!!! The atmosphere is so unique and I loved it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0wf-JLmwHvOpASCDS8uTbw"
  },
  "FkpnjpZQm5ROSoV1ZIvI-Q": {
    "date": "10/30/2017",
    "text": "My fiance and i went in late around 1am for his birthday dinner, the staff was so nice and the food was delicious. Definately going back...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R7gqcHAiI481ioz5-Ig9aQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Beautiful location",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/R7gqcHAiI481ioz5-Ig9aQ/o.jpg"
      },
      {
        "img_id": "ar4mIbcVQKvJGIU8lJdsfw",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ar4mIbcVQKvJGIU8lJdsfw/o.jpg"
      }
    ],
    "user_id": "L1zbkHTPF-r-EEOjUAa_nw"
  },
  "V2Z0MmAyX4BR9Gi4Yxj1SA": {
    "date": "3/22/2018",
    "text": "This place has the worst possible service ever!  Food was marginal at best. I can't understand the 4 stars.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nfGfYEfUGjdvUnIYj87V7Q"
  },
  "iirKSqGvsPzRDEZcaUIK_w": {
    "date": "5/25/2017",
    "text": "Nice indoor and outdoor seating, however service is not provided. My friend and I didn't get menus or didn't even asked for drinks. The Grand Scramble then, the biggest disappointment: very bland dish with no flavor. My friend had the Market Scramble and it was the same. Perhaps other dishes are better, but I wouldn't rush to go back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "HJfuzbFTwREQJ13sUUzHWA"
  },
  "b2T_f7R3bVm4s7LERHR6AQ": {
    "date": "4/9/2018",
    "text": "The atmosphere of this place is quaint, cozy and and a great place to study. I love all the different retro furniture and the vibe. Definitely have great food, coffee has been better elsewhere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7gYPCrColfebs1XpgCddLQ"
  },
  "hKpov-B1WYBED_9WKBcZ-A": {
    "date": "4/26/2018",
    "text": "Hats off to Zoey! She found a bag I'd left at The Grand and put it in safekeeping for me as I rushed back from Flagstaff when I discovered my mistake. FYI we had breakfast at The Grand in Phoenix and arrived in Flagstaff that evening. I called the restaurant when I discovered it was gone and miraculously my bag was STILL by the table we used!!  I'm still in shock that it was there! And it was filled with a computer and privacy sensitive items. By the way, our breakfast was fabulous!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BNGpr0MokgblzIgMgkvN3Q"
  },
  "iv_kpozdbBpMsjASiIbkzA": {
    "date": "10/20/2017",
    "text": "I had never been here and I'm so impressed!! It is soooo comfortable! There are many many places to sit alone, in a group, date etc. They even have a market inside where you can purchase things kind of like a grocery. It reminds me of Dean and DeLuca in NY! The wooden tables are so nice and not to mention, the service is great!!! Brett was AMAZING and recommended the yummiest iced coffee and Avocado Toast! And it's open 24hrs!!! Will definitely be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DLnGh7AkHGBVEmK3c7yRjQ",
        "caption": "Photo of The Grand - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DLnGh7AkHGBVEmK3c7yRjQ/o.jpg"
      }
    ],
    "user_id": "lEb615qWUmydMPSmM64lmA"
  },
  "clYyIeM43PzMAPA2Mzhaug": {
    "date": "4/20/2018",
    "text": "The quality of the food has diminished in recent months.  Seems like they went from great flavored fresh/farm-to-table food to frozen bland food. I won't be spending my good earned dollars there anymore.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VSz74t-slqxMp3g5U-fR7Q"
  },
  "G52TBhnz08j0fR_yksWTsg": {
    "date": "3/31/2018",
    "text": "Somehow this spot succeeds in bringing together steampunk cafe and jungle patio into an awesome outcome and a welcoming spot. Plan to be back very soon for another delicious matcha latte, or a French 75 (a cocktail that should be on every menu of any self-respecting speakeasy).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FdEqUcFgNtDPr32wMXJ2HA"
  },
  "ezEbTCX6KLDFlapLAS-UlA": {
    "date": "1/11/2017",
    "text": "This has the potential to be the coolest coffee spot in town. And while its spacious, two-story layout is so expansive that it's underutilized, Grand Central is stylish, comfortable, and most importantly...  ...my new favorite day-drinking spot in the valley.  It feels like a bar more than a place to indulge in caffeine! Don't get me wrong, the coffee I've had has been decent. It's just that first you'll notice a giant chalkboard of rare drafts above a bar with plenty of seating--indoor when you want a quiet place to feel classy, and outside when you want to light up, bring your dog, or have a large, raucous group. A nice roast may be an afterthought.   As of right now, it may be a bit unfinished. There's not much of a menu (outside of the beer), and the patio could use a bit of upkeep. But it's such a vast and relaxing atmosphere I can't wait to come back.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 12,
      "cool": 11
    },
    "photos": [],
    "user_id": "YpGt3hdq5adPlEFn9fQ2Zw"
  },
  "fw-yC5b8jJdWgyrF8gvAcw": {
    "date": "4/1/2018",
    "text": "Eclectic atmosphere and DJ for Sunday brunch is a can't miss. Handmade drinks, fast service, and gorgeous outside seating make this a must hit weekend venue.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "creSwsoEpbKICZ-VHQuMVA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Mimosa and a Painkiller",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/creSwsoEpbKICZ-VHQuMVA/o.jpg"
      }
    ],
    "user_id": "girImK3VA_owoSclUxVH9g"
  },
  "dWp1TrDrW6AIapfzgqABfA": {
    "date": "7/4/2018",
    "text": "Carlos H. Has the most amazing customer service skills out there. He genuinely knows how to make the customer  feel welcomed and happy. Please reward him",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_dgQM8Uyky4vZvwnc7jNsg"
  },
  "tNmO2WiGb-E2zqFv6bhPqQ": {
    "date": "4/4/2019",
    "text": "Really good place... when their WiFi actually works (hardly ever). I've come to The Grand three times. Two of the three times there WiFi has not worked. When asking about the Internet, all the grands response is that the internet is down. They need better internet!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-8HCwcQNDoW2p9UWBiVbTQ"
  },
  "BaLBdGVahJYhMZgMB07SUg": {
    "date": "7/27/2018",
    "text": "Tonight for dinner went to The Grand. Went because they serve the Impossible Burger from Impossible Foods. I ordered two Impossible Burgers; both topped with vegan cheese, one with sweet potato fries, and another with regular fries. I also ordered the Buffalo Bites. The Grand is not what I would consider \"vegan aware\". It seems they are getting aligned with the vegan trend and good on them! The food was well prepared and delicious. The fries were wonderfully long and cooked perfectly. I'm not quite certain the buns were not coated in butter to toast them. Ambiance is industrial dark. The counters are beaten copper topped, and tables of dark wood and a metal gear covered with glass. It seems to be used by the community as a quiet spot, with little nooks to sit, enjoy music, and work on one's computer. There's also a \"general store\". I will be going back for more vegan food and ask that its prepared all vegan. I give them 4 stars for being unique, going vegan, and having great chefs!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wlc3ueOUwo5e3NFqeVWeDw"
  },
  "qPPMHF1r-GlaEQk7teX_PA": {
    "date": "6/2/2017",
    "text": "This place is great for a casual breakfast or lunch. Plenty of space to hang out with friends or having a business meeting. Low noise, good food & coffee, and decent prices.  I had the breakfast bowl - it was delicious. Just wish there was more of it.  Only thing that could make this 5 stars would be for larger portions. The prices aren't bad, but the amount of food you get for the price isn't great. I was still hungry after spending $9 on breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cwueZl7VqnEiuY-c8CWaLQ"
  },
  "7QP8niCguHr-Tw0OBCF7tg": {
    "date": "8/6/2018",
    "text": "I was super excited to try this place as it's right down the street from me. From the outset the places looks great with a very fun and open atmosphere. The staff was young and attractive but relatively inattentive, but you know - millennials. Nonetheless, the HUGE turn off was $8 for a run of the mill craft beer?!?! When will it end? Even in downtown most places are $6 and $7 already ticks me off, so $8 is outrageous. When 1 beer costs as much as lunch there is a problem. Sorry, but because of that I won't be returning.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "spQBsvrlBFuXBzv46QJgVQ"
  },
  "VIhvzy9M8fisOawvnWTobQ": {
    "date": "11/4/2017",
    "text": "I've heard so much about this place and thankful that I stopped in to give it a try before an evening at the Phoenix Symphony. I love the atmosphere. I had only been to Amsterdam a few times and this is definitely more my style. I tried the Roasted Fries and Mac & Cheese - absolutely delicious. I had a tasty cup of coffee to go along with my meal. Overall, a great meal/snack to hold me over.  I look forward to return when I have more time and with my Partner. Great service! This is such a great addition to downtown Phoenix. Cheers***",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "RUn2C1UgxiY1enPzYG5OyQ"
  },
  "tmiJ1AC1m3RexUr5AeaPbw": {
    "date": "1/9/2017",
    "text": "Pretty good coffee, although I've certainly had better (they use Infusion beans, which are top tier, but they lack the masterful baristas).   Meeting the \"good coffee\" criterion, the real thing that pushes them from good to 4 stars is the patio and the hours--a good coffee spot with a chill outdoor patio that's open until midnight? Not bad, not bad at all.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3MRfdDj65Y5tku59cy7GLA"
  },
  "eteQMIfyMyg16lGM1dxd8A": {
    "date": "10/29/2017",
    "text": "If you find yourself in downtown Phoenix, you have to check this place out! Coffee, full kitchen and bar, gelato, and open 24/7! They always have weekly specials on drinks and food and this place is SWEET on the inside! It has a hogwarts feel and is two stories with a huge outside patio so it's always easy to find a seat!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "FkQLkMUZilGa0mv1rS0gAA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Cauliflower buffalo bites",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FkQLkMUZilGa0mv1rS0gAA/o.jpg"
      }
    ],
    "user_id": "WjPLEr26Y0nW_ZtCEymnDw"
  },
  "aDmnLJSMWFvMHcsqZlg4ig": {
    "date": "7/29/2018",
    "text": "Their lavender mocha iced coffee is good with a unique little twist with the lavender. I went another night and had a drink at the bar. The waitress was super friendly, immediately gave me a sample of their raspberry hard cider (I wasn't fond of it) she recommended another hard cider a peach flavored one Ace and it was great! The atmosphere was fun and chill. I will definitely be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QqQOuF5oTiQPCtsQPY1kBA"
  },
  "vzz_RvFkt95kcNYaS7msDw": {
    "date": "5/12/2018",
    "text": "This place is beautiful, I love the ambiance and everything to do with it. Teas were great! I am in the lookout for great coffee places to work and I LOVE the fact that it is 24/7, I also love the fact of how clean it is. I guess the only thing I don't like is that I was really having problems with the WiFi connection. Which is pretty sad because I really enjoyed this place, but I really need WiFi for work. So I'll likely go back for them ambiance to read a book or socialize, but not on a regular place to work like I was hoping to find. Check out the outside sitting it is beautiful!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uBMyFHU8h7COmmQbtFhe8Q"
  },
  "7djp72_clTuxPyQFdKS8tQ": {
    "date": "10/22/2016",
    "text": "New favorite coffee shop alert.  Good tea/coffee Friendly staff Will be open 24/7 Opening full kitchen Serves wine/beer Spacious indoor and outdoor areas ASU student discount  Great atmosphere   Grand Central is relatively new to the Roosevelt Row and has its work cut out for it since there are many shops in the area. However, Grand Central offers a better experience in my opinion. Coffee shops can be cramped or crowded but this is not the case with this new gem. There is are upstairs/downstairs/patio areas and a decent sized bar.   The decor is modeled after (you guessed it) an old school train station. The owner has obviously dedicated a lot of time, money, and effort to convert this space. Stop by and check it for yourself.   Getting to it can be tricky since it is positioned on the west side of Central. Be sure to be in the furtherest left lane on Central to get to it or you'll be blocked by the lightrail. Don't let the extra maneuvering stop you from visiting!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8HQHrpZ6PPiRIDk0HNBB8w",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Grand Central",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8HQHrpZ6PPiRIDk0HNBB8w/o.jpg"
      },
      {
        "img_id": "dAHS_Iu0WzkLUZL_mBHCZA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Grand Central",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dAHS_Iu0WzkLUZL_mBHCZA/o.jpg"
      },
      {
        "img_id": "0KVEtXMSJqRw-XdjidcHIA",
        "caption": "Photo of The Grand - Phoenix, AZ, United States. Staircase at Grand Central",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0KVEtXMSJqRw-XdjidcHIA/o.jpg"
      }
    ],
    "user_id": "lvkI9guXBhuGmiodzKjJ-g"
  },
  "O4n6Kqo4mP94wms4FYACUg": {
    "date": "7/13/2018",
    "text": "Decent coffee & great teas. I am a coffee lover and here the teas are a lot better than the coffee. I love the fact that it's open 24/7 so that's a plus!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2gCdrGP1PkGcuA1TUwBnNA"
  },
  "NFl41rAt4n3RAjTnHeX7Hw": {
    "date": "7/31/2018",
    "text": "I love, love, love that this place is open 24/7.  The food is pretty good and the coffee is decent. It doesn't seem like the people behind the bar actually know how to make cocktails which is a bit of a bummer. Also I feel like the staff are hit-or-miss; Sometimes they're very friendly and sometimes they look at you like you're bothering them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UXLtzLl1wz94k43vUKnOVQ"
  },
  "HxQgjwQVeP5jrnjnsaJSXw": {
    "date": "10/28/2018",
    "text": "The Grand burger was excellent. The sweet potato fries were overcooked. The staff was friendly. My only complaint (& it's huge) is that they decided to mop the floor at 12:30 in the afternoon. So my burger ended up tasting like citrus cleaning supplies. Is there not a down time that you can clean?",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "b3qVDTyHhhsw40yU-pZ4-w"
  },
  "zvJjEZUAi0_YiZu4iVEY6w": {
    "date": "5/18/2018",
    "text": "Girl bartender with tattoos and big feather eyelashes kicked me out in 100 degree weather today. Btw did purchase tea from there. No manager in site I'm a regular there and always get the worst attitude and service during the day. Night people get 5 stars honestly they are the best! Btw I made a yelp just to post this",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NbsGZu-Nc2mCKFUqZGEtqg"
  },
  "1gcasv4tmYvVducZxbrDMw": {
    "date": "8/24/2017",
    "text": "Looks like I rated this place too soon the first time, because difference in my second date at The Grand led to disappointing indifference.   Like a junkie, I tried to chase that first high by ordering the same: Kale Cauliflower Curry, and house fries.   The server brought both dishes at the same time. One glimpse at the lack of fries told me I would be left alone to sweat through my withdrawals.   The kale and cauliflower bowl held up, but I definitely tasted a downgrade. That's what made me look into the kitchen. Ohhh, different chef.   How dare he send out a dish of fries that was kids' portion. No, actually kid's portions are larger than what I got - it was more like a toddler's portion. The server hesitated to return the fries to the kitchen and I seriously thought he was going to justify the amount.   That's when I got a bit snippy and pushed to have them taken off the table. I could see feelings hurt behind his eyes so I assured my anger wasn't directed at him and he took the dish back.   More fries arrived a few minutes later, but it wasn't the delightfully seasoned heap that I received on the first visit. These lacked the seasoning and appeal. These fries were sad. Yes, SAD. That's what I told the server.   When I ate through a few on top, I found bits of something resembling fried meat (maybe bacon).   So to this cook, on that night -- in the annoying tone of D Trump -- \"You're Fired.\"",
    "rating": 2,
    "rated": {
      "funny": 11,
      "useful": 13,
      "cool": 13
    },
    "photos": [],
    "user_id": "X5T45QxyLjnuXohkvE3Rfw"
  },
  "jOiCD2hGYr19JMyAPG0HVQ": {
    "date": "5/14/2018",
    "text": "The grand is a good place to chill or study. Good vibe, laid back environment, and kind staff. Small parking lot that may be hard to find a spot during the night time. The onion rings and fries are always a solid pick; large quantity and always tasty. Plus there is a 10% discount for students!  So why 2 stars?   I ordered the Caprese di Pollo sandwich and it was awful. The chicken was way over-cooked and tasted like a rock/complete rubber. The bread completely fell apart the minute I picked it up. The only taste was the overpowering amount of basil. It's pretty hard to butcher a sandwich but somehow the Grand did just that. Though I'll be back for the Grand due to their nice atmosphere and good snacks, I won't be ordering any main menu items like sandwiches or burgers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "piOd24X-WWC0vIENdUp85A"
  },
  "aWdQDuikID2hxwuAYkUQGg": {
    "date": "2/15/2018",
    "text": "They made a mistake with my bill and made up for it in a big way a few days later. We enjoyed our first stop here but a problem with the processed payment caused me and girlfriend to have an ill feeling about this place. However, they made up for it and explained what happened (a simple mistake).   I recommend checking this place out for sure, great decor, great drinks, and great food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LQaRxWcbdWu33TDPiho9HQ"
  },
  "jARu8ySzCBiMxx3a6mmQeA": {
    "date": "11/4/2017",
    "text": "So you don't have to be Einstein to figure out that you order food up at the bar\\counter,  they give you a number and bring it to your table. So don't go in and sit down then get mad when no one shows up to wait on you and smear them all over Yelp. Sheesh. Went in after 8 on a First Friday, they had what seemed a limited menu so I ordered a chicken Caprese sandwich. It was well built and tasty. Not excited that fries or a side are not included. I ordered the fries, and they weren't ideal. Soggy.  Love the decor and the large space, a variety of areas to sit to fit every mood: the bar, patio, sidewalk, quiet table, etc. I think that's what really makes the place, plus the fact it's open 24/7! Noticed the fryer really stinks up the place though, after sitting inside and eating, our clothes smelled like old fry oil.  Maybe we were just too close to the open kitchen this night. Don't worry, we'll be back to check it out again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XvZ0XThCA5XQeFvS8xYBlA"
  },
  "MMVXoaypHRTeeK8rpC0KLA": {
    "date": "11/2/2016",
    "text": "Great space and friendly staff.....no problem with the drinks (usually), but I never seem to have luck with any of the pastry they sell.......it always seems to be stale!!   They would be able to build a better business if they disposed or donated the pastry at the end of the day and start over with fresh pastry the next morning.  I think the cupcake I had today had to have been 3-4 days old.......dry and disgusting!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VK0BAk8NN3OPeSrb7cPaEA"
  },
  "FharEwh86oxW_24dfPz8Ew": {
    "date": "10/10/2016",
    "text": "Really cool coffee shop and bar.  For those trying to describe the decor it's steampunk with a bit of Gothic thrown in.  Really interesting and we'll done.  Service was great and friendly.  Not too busy yet but hopefully that changes.  Definitely check it out for something a little more interesting.  The music is basically trip hop.  Low key and chilled out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ODBkHeSDn2u9zDfqy0YhCg"
  },
  "9CTZ4TzDMzCtzyKKNlqSuA": {
    "date": "3/2/2017",
    "text": "I just came here for the first time tonight with my friends from college and they've been here a few times before I have. I am a full time student and I also work 30 hours a week so today was the first time I was free to come and join them. I still had some of my subway sandwich so I started eating it while I was drinking my coffee. 3 of my friends were still ordering while I was at a table with my other friend that hasn't been here before yet wither. The chef (BALD GUY) came up to me and my friend and yelled, \"there is no outside food or drink allowed.\" I immediately apologized and said that I didn't know it wasn't allowed. Then he said, \"you guys were here last week.\" After that I got upset because of the way he was talking to me and my friend but also because he assumed I was here with them last week when it was only my first time here. He could've asked me nicely to put my food away but decided to be rude and abrupt to me. Very bad first impression and I am never coming here again. This place deserves no stars at all but I had to put one. Bad customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5JLdyeowWmtQNEjyyroOg"
  }
}