{
  "f4YarLytAMJk2GHTINCtmg": {
    "date": "8/15/2014",
    "text": "Soooo damn tasty! Simple menu of chicken and carne. Beans are good, onions are awesome salsa is the shit. Love this place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WeiQI7KQAs6ITT-UDREsFw"
  },
  "_063yACgat-DVSJ7FrIGFw": {
    "date": "1/24/2012",
    "text": "Beef or Chicken. Corn or Flour. Beans, Onions and home-made salsa. Nothing compares to it, and nothing beats it. The chicken is  flavorful, but, I wish I knew what they put on the steak for seasoning, because it happens to be my favorite..  Don't go around 12pm-1pm during the week, they have busy lunch crowds from Chase across the street and lots of local government workers as well.  Be prepared to wait 10 to 15 minutes for the food to be delivered to the table, as it is cooking over a wood fire in the kitchen, YES wood fired meat products!!!  If its broken, don't fix it. If you are looking for something more than what they have to offer, walk out the door, there are plenty of options in and around El Pollo Loco. I like the fact they only take cash or checks. This option does put people off, but hey, at least they aren't beholden to any credit company.   Now if they only offered bottled Coke.. But HQ next door has them, so no worries.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XrUYUXCeDRMgnHPdCxnO6A"
  },
  "hly0TQhjtpqougOSraIzEA": {
    "date": "4/3/2015",
    "text": "Pollo Supremo leaves you with a wholesome feeling after you eat there.  It is money well spent!  I am vegetarian and usually get rice, beans, tortillas, pickled onion and salsa and it comes out to $4.  My husband gets the quarter chicken and eats it at least twice a week.  Their menu is simple, dishes are delicious and prices are affordable.  You cannot go wrong with Pollo Supremo!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WdY2KQoPVVyoZUHM_cWzSA"
  },
  "O2DqwzZY47MBMy2ZnxRyyA": {
    "date": "7/29/2012",
    "text": "The chicken is killer!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jd0Wp6PktCAFmrFzpToAlQ"
  },
  "RcHF07t5hAH6YLERSjpgPA": {
    "date": "5/7/2016",
    "text": "Great authentic Mexican food in a hole in the wall space near ASU and downtown Tempe. Seems to be a mom and pop operation.  Fresh ingredients and well seasoned grilled chicken and beef. Home made tortillas and delicious pinto beans.  Cheap, yummy, and tastier than any fast food in the area. So happy to find this place.  Short on atmosphere but delicious food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-sJR1DaA9Zs3iQ9bX72Cag"
  },
  "LDQt46gs8vJJWa4xlPcFsA": {
    "date": "3/6/2015",
    "text": "Super tasty served by a friendly staff. Great for lunch, especially when you're in a rush.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rmSBGaR4Hk2Ya_Dc3alMmg"
  },
  "wcjFnNLFhabI86XBllpl9A": {
    "date": "4/17/2014",
    "text": "They do chicken and tri tip. Chicken is hella dry and salty, but the tri tip is bomb!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AKIaMyrysZwHeYSG4MCW8g"
  },
  "2rSyalW4OsSa1FmVH1MeKA": {
    "date": "11/30/2014",
    "text": "This is one of my go to spots whenever I find myself in Tempe. Admittedly the very first time I tried it I was like this is great but not as wonderful as it was pumped up to be, however I gave it another shot and have been going here ever since. Both of the meat options are delicious, but I prefer the scrumptious pink skinned grilled chicken the very most. Usually I get a small order of both meats and mix them together in a taco/burrito fashion. The decor is basic, but the food is bomb. The workers are humble and friendly and the food makes great leftovers too, what more could you ask for?! :D",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kADKDJ2uB6ggMCirlS79eA"
  },
  "GsZRfhEe69yUYiTiDdrsqA": {
    "date": "8/14/2013",
    "text": "The chicken is very good and different from the norm.. The beans always seem to be very salty thou. But, excellent chicken and taste good. Don't care for the onions they give you with meal. But as always good eats on the chicken,ha !!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yUydNlDoBc-rhfAQJEsAvA",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Whole chicken ordered- check out one of my pieces of eight. Check your order.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yUydNlDoBc-rhfAQJEsAvA/o.jpg"
      }
    ],
    "user_id": "FvUZuilVX2vmzErQzYmaKA"
  },
  "cYMCSR5b3wWX_9ZgqCyF3Q": {
    "date": "6/26/2014",
    "text": "Absolutely delicious and so simple. Been coming the el pollo for years now. It's always been delicious. I love their chicken. That's the best thing they've got on the menu in my opinion. Give his place a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wbC0MU6MHMhS880bd_kI1w"
  },
  "4x0op-z7Hb9NMsF5igXzxQ": {
    "date": "5/12/2016",
    "text": "This place is absolutely delicious and very authentic. It's not the most beautiful place but the food is great and that's what it's all about. Prices are reasonable and portions are large. The chicken delucious and a bit smokey. Don't let the less than polished interior scare you away, and remember you can always get it to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G-Eg4WO2K_PelqvpcSh87Q"
  },
  "3dvxqqIJk-3GpLaXwrLG0g": {
    "date": "11/5/2013",
    "text": "Simple menu but they excel at what they serve.  Homemade tortillas and beans are the perfect compliment to the perfectly seasoned meat.  So delicious that I can forgive that they don't have free refills and only take cash!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lDFxxSiZxc2JHHIkEQrWpw"
  },
  "cwA3ZrAE1wOvA-5k-yPmQA": {
    "date": "2/26/2014",
    "text": "This is my FAVORITE place! I have been going to El Pollo for 15 years, it's family owned with authentic Mexican food. They have the BEST salsa in the world, their tortillas are handmade and from scratch every day. The only have Chicken and Beef and you can't go wrong with either and if you can't decided they have an option for half and half. They only take cash, but there is a Circle K next door that you can get cash out. Also",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "l6DUgYEIx5Mzr3vpyT6gQw"
  },
  "_8E-f9WWJmQo756wQsYa-g": {
    "date": "8/7/2014",
    "text": "I've been coming here since 1998 and it's still the same friendly staff. I'd come more often if Peoria want so far away. .. I come anytime I am even remotely nearby!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AZnMvzIwk-OHI8TkFgAlbQ"
  },
  "fNJ08Kip2nr-9i6Lr6e1sg": {
    "date": "3/27/2011",
    "text": "Mexican barbecue, as good as it gets!  Two stories, one funny, one stupid:  Tempe Urban Legend: At one point El Pollo Supremo had a fire. The staff of East Side Records (RIP) had to evacuate as well as they shared a wall. As the firefighters arrived, one turned to the other and exclaimed, \"We have to save this place! Their chicken is awesome!\" Don't you want to eat at a place that the Fire Department is desperate to save?  As I was standing around bullshitting outside a friends shop in Tempe one day, a girl in her early twenties was hanging out as well. The smell of the grills at El Pollo wafted over and she asked, \"What is that place? Smells good!\" \"El Pollo Supremo\" I said, \"Mexican Barbecue.\" \"Oh I hate Mexican food!\" she said...too dumb to listen to her own nose!   Tip: Don't ever let racism get in the way of eating at a place that your own nose tells you is good!  My favorite part about El Pollo Supremo is that they have chicken or beef. No substitutions is up on the menu, I am not sure what you'd substitute though as there is also a half chicken half beef option. Tortillas, red onions (eerily red), beans and salsa come with your chicken and beef.  Get some Horchata, do it right!",
    "rating": 5,
    "rated": {
      "funny": 10,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "__coGeYC9iki1e9MVyOvew"
  },
  "ihM6Z-DkKtxiU7HzRyk8IA": {
    "date": "8/30/2014",
    "text": "All in all an meh experience. The chicken was tasty and moist, but not really as flavorful as I would like.. The beef was just okay. I agree with everyone who says that the onions are way too salty. The beans are pretty bad actually, as is the salsa. It's worth it if you want to just come and pick up a chicken...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jdqGSOpixmKPOsbxTrvRvA"
  },
  "7zO-T8BsLnRKiHPIDQTa0A": {
    "date": "4/21/2011",
    "text": "This place has been here for YEARS... my first time was at least in 2000.  1/4 grilled beef + extra flour tortilla is less than $6.    I find the chicken dry and sometimes the steak might be over cooked... immediately move those slices into the salsa fresca and let them marinate, as you build your tortilla like tacos one by one.  So good!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "Mz3ZAFChRgBMgaaB5sJU_Q"
  },
  "HABDq6v66SUCT5-9IbP-eg": {
    "date": "8/4/2013",
    "text": "I don't care that this place only takes cash. I don't care that the inside doesn't look fancy. I don't care that the menu doesn't have that many options. In my opinion, this is the best Mexican food in all of Arizona maybe even in all of the USA. I grew up on this food. I have been coming here since age 6. I always get the flour tortillas and put the beans, rice, chicken and salsa in them to make a burrito. The taste is heavenly. I have been to many places in Mexico and I have never found anything quite like their amazing chicken and salsa anywhere else. I moved to Miami and the only thing I miss about Phoenix is this place. I fly back just for El Pollo Supremo.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JuXfw9zY1UFJzxVYTLa6GA"
  },
  "8us1-jis_uh6e7wlvf7zhw": {
    "date": "10/25/2013",
    "text": "First timer here, and didn't know that the beef took longer than the chicken to prep. I ordered the combo plate which was 1/4 lb. of beef and 1/4 of a chicken.  I waited about 15 min. while 4 other customers ordered after me and left with their food before me.  Soo, I left, somewhat upset (mainly cause I was hungraay).  I took a peak at my food while I was at a stoplight and it didn't seem like a lot of food either.  I was prepared to give this place a bad review now.  But I finally got to sit an eat my lunch and, that shut me up quick.  The flavors were really good, the onions, beans, fresh salsa, and 3 four tortillas that were included were perfect with the grilled meats, and everything was a perfect portion for a filling lunch.  The prices are higher than the original picture of the menu posted here, but that was 4 years ago.  It's still a good value for the amount of food and the quality as well.  I will be returning for sure.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hoD3kfMTSuJxnHek88bR4Q",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Combo Plate - Oct 2013 $7.99",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hoD3kfMTSuJxnHek88bR4Q/o.jpg"
      },
      {
        "img_id": "-e4g1DPcf1ES1iLJ7mhwRQ",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Menu - October 2013",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-e4g1DPcf1ES1iLJ7mhwRQ/o.jpg"
      }
    ],
    "user_id": "rMSsALTxIEWic3i23DG8dQ"
  },
  "Dmd63qK7cgrt1fG2eO0Jtw": {
    "date": "1/1/2014",
    "text": "El Pollo Supremeo, Los Pollos Hermanos; Arizona, New Mexico, close enough right??  Got the combo plate and was a big fan, go visit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rhckKlErcgXF9TsWOa929A"
  },
  "qIUZCjuyVe-k4wtf6ebyEQ": {
    "date": "10/2/2017",
    "text": "Holy shizz. If you are looking for some wholesome eats, go to El Pollo Supremo. Don't be deceived by the inside of this restaurant or the fact that they serve two main things. This place is a GEM! Will be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hWYT_PPFXHE25XwvoYKN6A"
  },
  "4OIWXLBz8bBSLJOip52vEg": {
    "date": "6/11/2017",
    "text": "I've been going to this place for more years than I'd like to admit let's just say I wasn't legally allowed to drink then and yesterday a 5 year old asked me if I was a grandma. Uh, I don't even have kids but I suppose technically possible. Anyway... Cash only and whenever I have cash in my wallet I'm like oh yeah. Or I just get cash because, yeah, it's not that hard to do. Delicious food. Really delicious. Partial to the half beef, but the chicken is delicious too. The flour tortillas and marinated red onions are the perfect compliments to the meat, as are the fresh salsa and whole pintos. Seriously. Eat here. Bring cash and a friend, or a stinking kid who reminds you you're old as hell. You won't be sorry about the food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DCwQNY0Aj2Zip9vf2M9z3Q"
  },
  "oirw9bpoiRKHUzaWVywrvA": {
    "date": "12/23/2016",
    "text": "Well I guess if you want to order for pickup you are SOL. Lady picked up the phone said hold on and came back on and said \"what you want?\" I started to tell her what I would like and she said \"NO\", and hung up on me. Guess my money's no bueno here.  If the customer service is lacking I'm not going to risk if they care about how my food is being prepared. On to the next place who wants customers. Hasta LA vista pollo.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vz9K3kHq990nBJ5SdP0vzA"
  },
  "pzOTi2bEKbfJB11DqNRGMg": {
    "date": "6/22/2017",
    "text": "Best food, get the combo plate. Meat, salsa, and chicken flavor like no other",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGpLWmohBLcW2iiJlIQM2w"
  },
  "ZryyHU1PdNFMqEy2JQ38Yg": {
    "date": "9/21/2017",
    "text": "Always love this spot. Good service, good time, well cooked and seasoned food. Convenient spot",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ahFie4_jQuXfEXu-R0HKMQ"
  },
  "QeKnaAwZU79vHN5S9u6bdA": {
    "date": "2/1/2016",
    "text": "This is a hidden gem in Tempe. Need lunch, go here now!   Imagine Pollo Loco was a small much more authentic family-owned restaurant. That's El Pollo Supremo, or as we call it \"Red Chicken.\" Yes the chicken is bright red! Not spicy in a hot way, but just extremely flavorful. You can smell their grill from a block away.  Menu is simple. Chicken or beef, OR both. Both are great. I usually roll with a 2 piece chicken meal (comes with beans, onions and salsa). I throw in a grilled jalapeno as well. That's plenty of food for me and comes out to just over $5. Best bang for your buck in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dKfdIVScXWruwUFi_DG0aw"
  },
  "JgzLXu4y7NLlFwIu8KFtHA": {
    "date": "4/8/2016",
    "text": "Minimalistic food heaven. Beef and chicken are both very delicious.   The Good:  - Food is amazing.  - Portions are big. - Reasonably priced.  The Bad:   - Plastic utensils. Can be very unpleasant at times.  - Cash only. So beware!  If you love mesquite grilled simple food El Pollo Supremo is as good as it gets for the price range.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZXdfI6PWgKiugUs1INUqvw"
  },
  "P7d4SZRsALW1yUPO70TvHA": {
    "date": "1/18/2016",
    "text": "The wife and I decided to try this place today. Here's what you should know. If you have expectations for and extensive menu or only desire the same fare you can get at most other restaurants then don't go here. If your mind (and palette) are open to new experiences and just damn good food then come visit this place. It's worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OVzQWjhuIoI6Mv2z3HRcrg"
  },
  "YfjuyqpS2jysO_2zUxUQLg": {
    "date": "5/27/2016",
    "text": "I was in the mood for tacos on a Sunday and my regular taco spot was closed.  Yes there were two open taco places between my apartment and el Pollo Supremo but they are for when I'm being lazy and want tacos, not when I want good tacos.  So I put tacos into Yelp and el Pollo Supremo was the closest place that came up that I hadn't been to before.  So I drive over, step inside, and get smacked with the realization that Yelp lied to me.  I had a choice to make, eat here or go find tacos.  Tacos would have to wait another day.    In some ways I'm glad that Yelp lied to me.  I probably never would have even stopped in this plaza let alone this restaurant.  The food was great for what it was.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T6KddC2hbdYiN2hWh3Bzww"
  },
  "7S5133RIPn5S282juKbD7w": {
    "date": "11/8/2013",
    "text": "Real simple, chicken or beef or both and how much 14, 1/2 or whole pound or bird. I've never left with a bad experience and never left hungry. The pickled red onions are the best part of the meal!  the great thing is if you want authentic Mexican food here it is, if you are an uninetiated gringo this is a great place to start.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z1AKomwTahoO7zXcKpn90g",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z1AKomwTahoO7zXcKpn90g/o.jpg"
      }
    ],
    "user_id": "SFMK3qRpvqhL17v0OzNM_w"
  },
  "SBksj0rMnlwr98tYLAytdA": {
    "date": "8/1/2017",
    "text": "There are only two choices on the Menu... Chicken or TirTip ... I've tried both, but I can't get enough of the chicken... It reminds me of the best Charbroiled chicken shack I always go to in Rocky Point... Amazing and you can't beat the price!   Bring Cash... They don't take plastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fKRSmv-8-iVj4YisOXDeXA"
  },
  "mss0SnAtIvgIMGSJHEiUvQ": {
    "date": "6/17/2013",
    "text": "Well yesterday i was a total chicken junkie. I wanted more after I devoured 4 pieces. Seriously the best grilled chicken I think I have ever had. Yes, i had major munchies but this is beside the point. It was seriously beyond satisfying and I need more in my system this week. Beautiful red skin and delicious juicy interior. I'm freaking hooked.  You get two choices people, just TWO. If you can only have two options on your menu, you know it has to be freaking fantastic and it is. They have perfected the grilled bird and I am so grateful I stopped in.  Beans, tortilla, salsa, chicken...this girl couldn't have asked for more.   Sometimes less is truly more.  Seriously BOMB!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "LWinqJdSeptUcP2jPvryhw"
  },
  "bo6tuH5tfmL5vWSdSPpnxA": {
    "date": "10/13/2015",
    "text": "This spot is a favorite amongst valley poker players, as the owner Jose happens to be a fellow enthusiast.  I finally got to try it out on the recommendation of other regulars at the card table and I can tell you without a doubt this deceptively small and unassuming diner has the best chicken you're likely to eat in all the East Valley. Give them a try, I've heard comparisons to El Pollo Loco, and that is frankly an insult to this, the True mom n' pop chicken diner.  Inexpensive, well plated, well priced and you won't leave hungry. These guys are well worth a visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "j7VP95flipjGtrM5GQrqYQ"
  },
  "TajtzR1SvO7w6KLouXHgEw": {
    "date": "2/26/2017",
    "text": "We were craving chicken. Didn't want greasy fried chicken or a meal from an expensive fast food restaurant. This restaurant hit the bill. Good clean, fresh food. Chicken breast was a bit dry, but not a deal breaker. I paired it with the salsa and onions. Remember cash only.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BcLWOUIV2XsrEgpIWcMO_A"
  },
  "NP5Cbbk4_NVq5NZgyorfdw": {
    "date": "5/30/2015",
    "text": "It had been a while since I was here.  Used to go all the time when I lived in the neighborhood, but I'm quite a ways away now.  Still, my wife and I got the urge to stop by.  With everything that has changed in Tempe over the years (I miss Eastside Records being next door to this place), it's nice to see some things haven't changed.  The price may be slightly more than it was, but you can still get a great meal for under $10.00 or, in our case, just getting and sharing teh whole chicken for $12.99 (it will make two meals for two people easily).    The choice?  Grilled marinated chicken or steak (or a combo plate of both) with corn or flour tortillas and beans, salsa and marinated onions on the side.  And, to note, these are whole beans, not the typical refried you get at most places. It's simple and delicious, and you don't feel like you just consumed a lump of grease and cheese after you're finished eating.    Yes, they still only take cash or check, but typically regulars know this and make sure they have money on hand before going in.  Also, I'm sure everyone who has eaten here has finished off the rest of their condiments by just mixing the beans, onions and salsa all into one cup.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vCyaUjhUzN-kUpU-ibc60A"
  },
  "rejmQxZ79vu0rDP3jDvrXw": {
    "date": "2/19/2013",
    "text": "Ordered the grilled half chicken and carne asada plates. They come with salsa, corn or flour tortillas, beans, and pickled onions! Reminded me a bit of El Pollo Loco. My favorite was the grilled chicken. I love how they marinated it. It was full of flavor and it was absolutely delicious. The carne asada was good too and full of flavor! My boyfriend enjoyed it very much! Definitely 1,000 times better than El Pollo Loco. The lady who took our order was extremely nice and sweet. Seems like she recognizes a lot of her customers by names. Shows that she really cares about her customers.   Cash Only and free refills when you buy a drink! :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "RXP1F65jGiUx5L50Ib1d1g",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RXP1F65jGiUx5L50Ib1d1g/o.jpg"
      },
      {
        "img_id": "oAY2Egy7YCK0My9QZDjkWA",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oAY2Egy7YCK0My9QZDjkWA/o.jpg"
      },
      {
        "img_id": "qcPURj2CJswfrlViFRtLfQ",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qcPURj2CJswfrlViFRtLfQ/o.jpg"
      }
    ],
    "user_id": "gFqh9xJdrdPX5JSl7iZ0PQ"
  },
  "qzpN8KQr713QF7CUbDMXqw": {
    "date": "8/23/2016",
    "text": "If there is such a place as chicken Nirvana I have just discovered it at El Pollo Supremo. Your dining choices are chicken or beef either which are excellent they are served with beans spicy salsa and pickled onions all of which only adds to the incredible experience of other entree you choose. This is a cash-only establishment so bring $20 and a date and prepare for a feast that will blow your socks off. My personal recommendation is the chicken which will come out slightly spicy perfectly crispy and ready to make you swear off all other chicken restaurants all together. It's not fancy it's not expensive it's just amazingly good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "APIUJS8icFPV30zlprhp6Q"
  },
  "p7nNyxBMw8XIjGwDAwMeEg": {
    "date": "5/16/2015",
    "text": "Hidden location, but when discovered you are guaranteed to return. Taste of Mexico in Tempe, AZ.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FcP6HiODmAd2wHSp4L4heA"
  },
  "GU7AMRIanwqh0AsyvzmqCA": {
    "date": "11/16/2015",
    "text": "Love this place! Great chicken. Flavorful, tender and grilled over mesquite coals. 1/2 chicken dinner with some chilis asado on the side = lunch perfection.   Similar but significantly superior to the Loco chain option.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6WABh8TsT5JhMSv2D7xO7A"
  },
  "szoK1tnFrYFlk3qoyaR7Eg": {
    "date": "12/21/2015",
    "text": "Chicken and/or beef. That's it. I like their beef.  I am still in complete wonder as to why people complain about what an establishment does not have on their menu. Well why can't every joint have sparkling, mineral, mountain-top water in them? Because you can't light one up if it is wet and I don't smoke. Here is what El Pollo Supremo has and it's pretty good:  I've ordered the combo plate the most often and it comes with a very generous amount of a 1/4lb portion of sliced steak that has been char-grilled. The beef has always been very tender, juicy, never overly seasoned. This almost gives this place a 5/5 alone. The 1/4 chicken is usually a leg and a thigh and is char-grilled as well. Maybe I'm just unlucky but the chicken has been consistently on the dry side. A side of really wet beans that don't seem to be cooked along with anything. A side of pickled onions adds good flavor to the beef and chicken. And a little puddle of pureed, somewhat-flavorless tomatoes that's really runny. It comes with 3 tasty tortillas that seem to be homemade; they're all a bit uneven and sometimes parts are burned.  There's no chips n guac (nor peas), no queso of any sort, rice (which is fluffy, light) is extra, and they take cash only. The booth seating is a little on the tight side and the whole place probably couldn't hold more than 24 people but the tables are always clean. The ladies at the front counter are always very friendly. They can get really busy around lunchtime during the week.  The 1/2 beef has been the best value and it really knocks the socks off many restaurants' steak fajitas.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H0or19jTnvDTtl3l9oKE6Q"
  },
  "dwrR7HTUEIbP7nTIs7Km4A": {
    "date": "3/10/2018",
    "text": "You can feel the love in everything you eat. Authentic and wonderful. This is soul-healing food. The tortillas are amazing. The beef and chicken are seasoned excellently and cooked to a delicious level. Very reasonably priced and lovely. Humble presentation but you know that all the best Mexican restaurants are. Try the combo plate!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h7lhXhD1Flo3XkadYaM2ZA"
  },
  "wFUo3CK7tCIs72Ovlcgc5g": {
    "date": "11/25/2015",
    "text": "Definitely a hole in the wall. Small menu (beef or chicken) No chips and guac, which is my fave for taco accompaniment.  Combo platter is huge. Mix of beef and chicken, side of tortilla, beans, salsa, onions. They gave a fork, but no knife. The beef came in bite sized pieces, but chicken was still on the bone. Made a mess.  Friendly staff, clean tables.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_OJmEeUGwdSAYKplzgRy1g",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Combo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_OJmEeUGwdSAYKplzgRy1g/o.jpg"
      }
    ],
    "user_id": "iNtwWaTR5lh0fG45zwrxqQ"
  },
  "9lQpuLcD2eTmN9zZ7c3Opw": {
    "date": "7/1/2015",
    "text": "3.5 Stars  I started doing low carb again this week.  When I lived in San Diego, the only thing that kept me on my low carb diet were some Mexican style grilled chicken places (El Pollo Grill, Pollo Don Pepe, El Pollo Loco etc).  Whenever I wanted to go out to eat, I would hit these places up and enjoy a carb free meal for the most part.  I had El Pollo Supremo bookmarked for awhile now and decided that today would be the day I tried them out.  It's a bit of a trek from Surprise, but would it be worth it?  You shall soon find out!  I drove down University and pulled into the parking lot.  It was pretty full but I did find a spot to park.  I walked in and scoped out the menu for a bit.  I decided to go with the 4 piece chicken meal.  My total was just under $8.00.  While I was at the register, you have an open view back into the kitchen where they are grilling the chicken.  I could see tons and tons of red yardbirds just patiently waiting to be finished.  I was pretty excited to try it out.  I took a seat (seating is limited...maybe five 4 person booths and then two 2 person tables) at a small table..a little bit tight for a large man like myself, but I was ok.  You order and pay at the counter and then one of the ladies brings out your plate.  I was sitting there for about 7 or 8 minutes and a lady came out and asked me what I had ordered.  I told her the 4 piece chicken meal and she went to the back.  A minute or so later, she brought out my plate.  It looked fantastic.  Here is how it tasted.............  4 Piece Chicken Meal-  This plate of food came out and it smelled and looked great.  It had a split breast, a wing, a leg and a thigh as well as some beans, salsa, pickled onions and a tin foil wrapped package of tortillas (I tried half a tortilla for quality control even though I probably shouldn't have for my low carb sake...anyways...the tortillas are excellent!).  The first thing I noticed was that the chicken pieces were pretty small :-(.  Not cornish gamehen small, but still pretty small compared to other places I have been.  I took a bite of the breast first.  It was delicious!  The skin was nice and crispy, the meat was piping hot and the perfect consistency between juicy and dry.  The taste was awesome but it didn't even really fill me up because the pieces were so small!  The breast was the best piece.  The leg was like 2 bites, same with the wing.  The thigh barely had any meat on it.   I could have easily eaten a whole chicken.  Salsa was tasty...a little watery but still good.  Onions were great!  Beans..didn't touch.  Overall, I was glad I came. Service was friendly and it seems like they do a bustling business. The chicken does taste awesome!  The portion was pretty skimp though and I'm not sure I am driving 45 minutes from Surprise to come here often.   With that said, if I am in Tempe and need a place to eat, I would definitely come back and maybe even check out their carne asada, too!",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "rSkbHPNjRFhXg3xjj3O1EQ",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. 4 piece chicken meal.  Great taste but a bit skimp.  Good for AZ standards but my spots in CA have much more value for the $$.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rSkbHPNjRFhXg3xjj3O1EQ/o.jpg"
      }
    ],
    "user_id": "6jz_Yr6_AP2WWLbj9gGDpA"
  },
  "fbsMB1HyNLm8RHNG2-DX4w": {
    "date": "11/25/2017",
    "text": "I've bee. Away for a year, and have craved this taste ever since I left. Sooo happy to be back for a visit & enjoy this homestyle Mexican food !!! Doesn't matter I you have the beef, or the chicken accompanied by the homemade tortillas..you will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tfaCWGXz_N80x5Z0ikwjGA"
  },
  "cleVFkPCSg_algweXxM5nw": {
    "date": "12/8/2016",
    "text": "This is a quick and simple chicken and tri tip joint.  Menu really only has those two options, just in varying sizes.  The chicken was pretty tasty, but I think I enjoyed the tri-tip more.  The meals with beans, salsa, pickled onions and tortillas.   Good price for the amount of food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEaoCr_rWMBtGylXCrsqtA"
  },
  "tXMTVLSeFZkFDSI6dBRlTA": {
    "date": "5/7/2017",
    "text": "Only reason I can't give 5 stars is they don't take credit. Luckily I had cash. The chicken was amazing and defiantly worth paying cash.   My only disappointment was they don't take anything credit wise which is rare in this day of age. I don't like carrying cash. But enough about that food if you have cash is defiantly with the stop for a hole in the wall.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1nTCrQsp5I-Qev6d5Mwt8Q"
  },
  "9S50N2DY6NY0w6Wo-JQhKA": {
    "date": "8/24/2016",
    "text": "First time  here and definitely will come back. Food was great  and inexpensive to. Restaurant was kind of on the small side, and minimal parking during lunch hours. But not bad considering your right next to ASU.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X3xXlaW6ikEBs9gzv8h_Ow",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X3xXlaW6ikEBs9gzv8h_Ow/o.jpg"
      },
      {
        "img_id": "uzQXKIdBJdy6Adx_pKkxpA",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uzQXKIdBJdy6Adx_pKkxpA/o.jpg"
      }
    ],
    "user_id": "cB5SeltUrXLE_NhnT09Hzw"
  },
  "dl_Ln2pXPrXgV1OIi83f7g": {
    "date": "3/13/2017",
    "text": "Great place!  The chicken is amazing. The only place like it that i know of is Lucas in rocky point.  Great tortillas!  They have the orange drink that tastes like a orange cream popsicle. They are cash only which is the only downside to giving this place a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ISc-Eo7CzDQl-e4pbJctQ"
  },
  "v55wunFY9Uslmf7ErfETDQ": {
    "date": "8/22/2017",
    "text": "This place has some amazing food for an amazing price!   Only 3 options really though, Chicken, beef or Chicken & Beef.  Be sure to order a side of rice and sour cream ( I always order extra tortillas they're so delicious.)  ****Cash Only*****",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-SzBIznfeLUwKu30CO9PTg"
  },
  "z3lp5k1JPy6uhVEQnnjy_A": {
    "date": "4/4/2017",
    "text": "You can skip this place and be the better for it . The woman there was less than friendly, my meal was not good. My friends meal had beef, that was tasty and that is the one star. The salsa was awful ( they don't serve chips as we were so abruptly informed) Needs a serious decor update and I'm not a health inspector but...,,,,,,",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d11prM2eiK2nBtAFIDUHCA"
  },
  "kkFIrTGYRSYH1KvKlhGfvQ": {
    "date": "11/14/2017",
    "text": "The food is normally good here but the service is TERRIBLE. I ordered my food and expected to wait. What I didn't expect was to be served after two people who ordered the same thing I did 10 minutes after me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iN-1fI2NCXUV1NrcGg5m9A"
  },
  "txNoJtxPgTe0INOjLrcaZA": {
    "date": "6/3/2018",
    "text": "Great flavor and conveniently located in Tempe.  I've been going to this place for years - as good as always",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2GxLWDlGFyfv44PUDNboJQ"
  },
  "HciY_7TnW8M0_MV8XRi7ag": {
    "date": "11/10/2014",
    "text": "I'm tellin' ya, if the Internet and Yelp existed in the 80's, they would have retired me as The Duke, 'cause I was here at least 3 days a week when I went to ASU.  20+ years later, they haven't changed the recipes: tortillas are tasty and served hot, chicken is juicy and tasty and comes right off the grill, beans/onions are yummy sides, and the salsa is my favorite of all time/anywhere!! I repeat, best salsa EVER!  Cheers! RS",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "GxGNAXumenO5lpzjYe3aLQ"
  },
  "aiMc_f0DfeExLZftsd9MCw": {
    "date": "11/9/2017",
    "text": "If you're in the mood for mesquite grilled chicken (pollo asado) or steak (carne asada), then this is your place! I was so impressed with the flavor and tenderness of the meat. I highly recommend it. Just note that they only accept cash.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fwjofMuVapoOEbV1mEMR8Q"
  },
  "lkruzOwRgbwZemVqWFdADQ": {
    "date": "7/10/2016",
    "text": "My girl told me she's been coming here since she was a little girl and that I had to try their Chicken. So before heading back to California we stopped by here for some of the best Chicken I've ever had!! Red, tender and full of flavor!! Nothing like a hole in the wall Mexican spot! This place is a gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sHOxQpXNYGF2YHkSeLKKEA"
  },
  "81s8qdbWjtG6CBQ1TFRfbw": {
    "date": "6/8/2014",
    "text": "This is one of my favorite Mom and Pop hole in the wall places in Tempe. Some friends told me about this joint and so I decided to come by and see what was smoking. Nice!  Very simple inside with some booths to sit at and a counter to order your food. Their menu offers Mesquite Grilled Chicken and some delicious Carne Asada Beef. They also have several yummy sides that you can order as well.  There are no fancy this or that items here like some other restaurants. Just very tasty food that is cooked with tender love and care. You can see it in the customer's faces as they arrive for a repeat visit.  Usually order the Combo Plate with a side of Beans and several Jalapenos to get my juices flowing. They make the Salsa in house and it combines nicely with the warm tortillas and the beef and chicken. Saw several people buying whole and half chickens and getting them to go.  Place can get pretty busy during peak lunch time hours and it is very close to the ASU campus. You may even see some short shorts during your visit. Or what they called hot pants now? GO SUN DEVILS!  4 STARS",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 10,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "-mxETM-dzmiWZH7vd9-U9A",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Carne Asada and Chicken Combo plate.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-mxETM-dzmiWZH7vd9-U9A/o.jpg"
      }
    ],
    "user_id": "oUst55rUuv2nKEQ0FgJ5GQ"
  },
  "8k5GyTMLg0Et-kl7t0x9GA": {
    "date": "4/23/2016",
    "text": "This place is simple and delicious.  A True hole-in-the-wall, El Pollo Supremo offers fresh, hot chicken and beef by the quarter-lb. The food is cheap and you get a whole lot of it. You can even see the cooks in the back grilling mounds of tri-tip and loads of chicken from the counter. The sides to pair with your meat and tortillas are plentiful and flavor, and the food here just tastes authentically mesquite.  I do really wish that I could use real utensils here, but unfortunately you only receive plastic. The fact that this place is cash-only is unsurprising, as it seems that all these people really care about is making good food and lots of it. As you can imagine, this place's atmosphere is a bit of an afterthought.  In spite of the negatives, I'll definitely be returning. Anywhere this cheap and tasty is worth going back to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wn3Ab-Ep9BnZns7nLntqAA"
  },
  "GgGUbBOUzZwjv18KbVaJ1Q": {
    "date": "6/21/2016",
    "text": "I'm a local. Been going here for years. We just call it \"red chicken\". Love this little place! Everything is delicious and cheap.  Cash only!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RTjmEJ-SgqVQwXoUH6BoTQ"
  },
  "gOmU4iRggYCvft6zO6Ycrw": {
    "date": "4/26/2012",
    "text": "This chicken continues to be absolutely fantastic. Juicy chicken, crispy skin, excellent beans and marinated onions... Ahhh I love it all.   It's also nice that you only have two choices; beef or chicken. Somedays I don't want to waste my brain power deciding between 101 different items.   They still only take cash. And they are still my favorite quick lunch in Tempe.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "sTcYq6goD1Fa2WS9MSkSvQ"
  },
  "nWwf9EuKuz8z97y_GNxPsw": {
    "date": "8/16/2017",
    "text": "If your ever in downtown Tempe by the ASU campus then this is definitely your go to spot for the best Mexican style chicken you might ever have. Everything is slow smoked over an open pit grill and they use actual mesquite wood. Salsa is on point and the tortillas are fresh. I've had lots of this kind of chicken all over Phoenix and they are just a slight cut above the rest. Their seasonings and spices are perfect. The tri-tip steak is really good as well. Super simple menu and affordable prices. A whole chicken meal with beans tortillas salsa marinated onions is around $12 and feeds 3-4 people. Try getting that at KFC.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MrojOy2sGBTMNZie3FS4dQ"
  },
  "SCsgTWYz0nLhdejjAf8qaw": {
    "date": "3/25/2017",
    "text": "My bro and I have found this place by chance. The smell from the restaurant street were delicious and we couldn't wait to taste it! The best beef and chicken you'll find in Phoenix! And it's only 15 minutes away from the airport! For sure, I will recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0PuqtzeOf51r-gPtaYM5Bg"
  },
  "7ZXs0QKXZmWDZfi2f9Vk-w": {
    "date": "11/2/2013",
    "text": "Having been binging on Breaking Bad lately, I set off in search of a good chicken joint.  It's a tiny hole in the wall, so don't expect to eat here, but the prices are reasonable and you get a decent amount of food. I ordered the combo, which comes with grilled chicken, fajita beef, tortillas (corn or flour), beans, and pickled onions. Muy sabroso! I mopped up every bit with my tortillas, and finished my lunch stuffed and much satisfied.  Believe the hype, you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YJCfxHfeoNoemyGhm6-Apg"
  },
  "npBNQ4MnAZYThjb0gXK-rw": {
    "date": "9/24/2012",
    "text": "Pollo Supremo is so supremo!  Their food is simple, inexpensive, cooked traditionally, and very unique.  I almost always order 1/4 chicken and sort of developed a ritual way of eating it: I take my fork and strip the bits of chicken from the bones. I take my onions and spread them into the chicken pieces.  (If the pieces are too big, I break them apart with my hands.) **Wash your hands first before eating, its more fun to use your hands!** Finally I take my tortillas, tear off little strips, and use them to make little bites.  You can take your fork and top of off with some of that delicious salsa.  Each bite has all these flavors, and its really delicious.  The restaurant itself is very small and plain, and almost a tad dingy if you ask me, but not dirty. Its not a place to take someone on a first date, but its a fun and cheap place to go to on a regular basis for some food you'll always crave, and will never change!  P.S. - If you forgot cash, just go to the Circle K right across Ash, and get a drink + cash back. Easiest solution. Oh, and once you become a regular of Pollo Supremo, check out Cartel Coffee (right behind them) - the best coffee spot in Tempe. :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "3rYi9SqVbEpn7DxA7bW3Kw"
  },
  "eRB7FUoGyF8jNwRgLFo09w": {
    "date": "10/14/2012",
    "text": "El Pollo Supremo is a pint-sized version of \"El Pollo Loco\" with fewer food choices and the inability to accept credit/debit cards. Ultimately, whether you choose the corporate fast food giant or this little hole-in-the-wall, the food, the taste and the price are all about the same.  All in all, the food here is just \"ok\".  In Southern California, I grew up eating this style of food regularly and El Pollo Supremo, while offering a familiarity I appreciate with its simple beans-meat-tortilla approach, is absolutely nothing special.    I've had both the Chicken (pollo asado) and Beef (carne asada) dishes here.  Occasionally, the chicken arrives overcooked and dry.  The steak has been consistently pleasant and is quite tasty, moreso on its own than when mixed with the other ingredients.  The beans are always plain and the watery salsa certainly isn't anything to write home about, but it all works in that way that simple, decent \"comfort\" food should.    As for price, it's certainly not as \"cheap\" as some make it seem, but it won't break the bank, either.  Figure $10-$12 per person and everyone's belly will leave happy.  The best value is to grab a few friends and split a couple items.  If you've got a picky date, this is the perfect place to take them, because they'll only have to make one decision...chicken or beef!  Please note that there is really nothing \"wrong\" with El Pollo Supremo.  However, there is nothing particularly outstanding about it, either.    The 5-star and \"100%\" ratings across the internet review boards are certainly more than it deserves.  People in Phoenix seem to have a skewed idea of what \"good\" Mexican food is and have a habit of glorifying mediocrity whenever possible.  This place received a \"Best of Phoenix\" award for 2011...that just proves my point!  Since we're just tossing acclamations out there, I'll give El Pollo Supremo the \"Best of Mediocre\" for 2012.  Now on to the next joint...",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "qrqmuWzML9drT74Y05XqTg"
  },
  "5mj0N2Rto4QJfO7NrVlPKw": {
    "date": "8/9/2011",
    "text": "Like the beef more than.the chicken... Everybody calls this place the pink chicken because the chicken really looks pink.  The food is great.  I don't think that they do substitutions because they charged me the regular price when I asked if i could get rice instead of beans with my meal.  I usually order the combo meal but thought I'd give the all beef a shot.  I love their tortillas and their pico de gallo is just the right amount of spicy for me.  The only thing annoying about this place is that they don't take credit cards.  I have to make a special trip just to the atm before i come here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eywySm05H0XalHMI0B-BPQ",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eywySm05H0XalHMI0B-BPQ/o.jpg"
      }
    ],
    "user_id": "KDy_d2_7A89KSCZ4Vx6rTQ"
  },
  "r-itnbIHRkVIVRWS-fPz-Q": {
    "date": "6/22/2015",
    "text": "Food is always good here. The service however...depends on the day(I'm sometimes afraid of the mean-faced lady at the register).  It's definitely a hole-in-the-wall place, so don't expect super cleanliness.  But the yummy chicken helps me forget about the less than clean atmosphere for at least 30 minutes.  I also don't like that they raised the prices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S59zqz6YVIKGnRxsu8mHIQ"
  },
  "HLXjtGtX8dtHNB_dhK7xQg": {
    "date": "3/13/2013",
    "text": "Family run small business in Tempe. Everything was tasty but not terribly exciting. Very limited options. Seems authentic.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EIg7WQrnhJL8FqBUtz4sVg",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EIg7WQrnhJL8FqBUtz4sVg/o.jpg"
      },
      {
        "img_id": "l9lRlDPuMD3Pu4F6nD2hVg",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l9lRlDPuMD3Pu4F6nD2hVg/o.jpg"
      },
      {
        "img_id": "B7xDqSHRJc5bcWgRqc7VWw",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B7xDqSHRJc5bcWgRqc7VWw/o.jpg"
      }
    ],
    "user_id": "M4t5DsLgxStKLEFTIOlvsg"
  },
  "TNVzMTmJ31xiUvOReW2hxA": {
    "date": "11/4/2015",
    "text": "Oh my gosh!!! This is the best chicken in the universe! No other chicken place comes close to  being this good! Service is wonderful too. My sister's husband wanted El Pollo Loco. He can't get it where they live. She was afraid to bring him Supremo instead of  Loco, so she took him both. Guess which one he picked as his new favorite? Yup, Supremo won hands down! I can't wait to go back. It was so delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M7lL9YjxTBgEwuLr2iIr6g"
  },
  "FhQUg75RKQNxEUGo50duiw": {
    "date": "1/27/2015",
    "text": "This place is so great! The chicken and sirloin was cooked to order. The pickled onions make the meal. The salsa is fresh and spicy. The staff is friendly. They only accept cash.  This place is a great low carb option.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "55e_HUm0WQ64rT0kIixiXA"
  },
  "dRGirjjV4ytY5h_2jgmSZQ": {
    "date": "10/1/2016",
    "text": "I love this place , ive been coming here for literally over 20 years and they havent changed .. The chicken is my favorite out of any restaurant , i would love to know what they marinate it in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JAjclN6WaO4zVACNyz3euw"
  },
  "sghFC6IewzBER7gVAkWs5w": {
    "date": "5/22/2012",
    "text": "Bring cash, they don't take credit cards.   Super simple chicken, beans, salsa, marinated onions...put it all together in a warm tortilla and you have one happy mouth.   I used to go here a lot when I worked in Tempe. It was always good then and that was 10 years ago. I went again recently with my husband and it was just as I remembered it.   Cheap and delicious...if you are in the neighborhood give it a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yXgIX_pNm7UCzSpppPv_Jw"
  },
  "-lFseEkog-cU4h_bSrZi5g": {
    "date": "5/12/2015",
    "text": "Well I'm not from AZ but this place is a hole in the wall and the chicken is okay the only thing that makes it good is that is bbq chicken has no oil added.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tDc_EUFpS2C3vWDP5yho4Q"
  },
  "wYrp6Eo2EKYyTYKfINS-Yw": {
    "date": "4/26/2015",
    "text": "Delicious! Simple ingredients, steaming hot goodness. Shared the combo, enough food to split with two people. Got take out, not really a dine-in place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_veLWTqAET_bu1ezoVn5Jg"
  },
  "Y5SNcDUSVi7ui_FFvbWytg": {
    "date": "9/10/2016",
    "text": "This is the best grilled chicken I've had. This is the way grilled chicken is supposed to be; charcoal grilled. I came from Dallas for business and this was our lunch spot almost every day. I love this chicken, one of the main reasons I want to back to Tempe. Here in Dallas we do not have grilled chicken nearly as good as the one at Pollo Supremo. Everything from the chicken to the salsa was perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A2-mh8kSgIsClR9ewvLpmg"
  },
  "Mu5pc6eBwA5_i1UA9kloKw": {
    "date": "4/26/2012",
    "text": "Yumm! That definitely hit the spot.  I was a bit confused by their menu, but it's pretty simple. There's not that much to choose from, but everything on there is G O O D!!  I had the combo and 1 dollar soda (free refills). This is a moms and pops shop. I love it!! It totally deserves a 5 star. C'mon ppl!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qpIaco4wXnHqG9oVNh8XRA"
  },
  "QyRYvjmUuKxgB8ay7QwaqQ": {
    "date": "9/5/2016",
    "text": "I hadn't been to here in a couple of decades or more since I used to work in the area.  I found myself in the area recently and decided to give it a try to see if it was as good as I remembered.  I swear, this place and the food hasn't changed a bit during that whole time.... which is a GOOD thing.  Chicken, beans, salsa.... all exactly like I remembered.  Delicious marinated and grilled chicken and one of the very few chicken joints where I actually like the chicken thighs and the skin!  And like in the past, they still had those pickled red onions that I always get extra of.  The real deal, much better than similar places like El Pollo Loco.  Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UBu0k6si4XQz1OWCUTh3GA"
  },
  "ZzwDDNp-CpkiHBO0D94Cig": {
    "date": "2/2/2010",
    "text": "Just finished up scarfing down some chicken from here. I discovered(thank you yelp) this place about a month ago. Every so often I decide that I want to swap out the chicken I usually have with something new and exciting and this does it for me.  I've had the pleasure of trying both the steak and chicken. I've also nabbed a taste of the standard sides.  The menu is very simple chicken/beef/combo offered in 1/4 1/2 or whole. All meals come with beans, marinaded onions, house made salsa, warm corn or flour tortillas. They do offer rice and a few other al a carte sides.  The gentlemen manning the grill deserves an award for the magic he performs daily.   Chicken: Very Mexican influenced marinade. Heavy on the garlic, black pepper, and citrus. Pair that with the smokiness you get from charbroiling something over a real fire and its as good as your imagining it. They also add an unnatural bright red dye to it. Not sure exactly why they do this but whatever its.. umm.. festive?  Steak: Delicious grilled carne asada just as it should be. The beef has just enough fat to keep it moist without being greasy.  Salsa: I don't love it but only because I don't like fresh tomatoes. They puree fresh tomatoes to create the salsa. Everyone who has tried it loves it. Just not something I ever like anywhere.  Beans: Whole pinto beans. Hard to say if they are home made or canned. I would guess they are probably canned but still good and not overly salty.  Flour Tortillas: Warm, soft, mmmmm.  Onions: They are pickled/marinaded which takes away some of the sharpness of the raw onion. Great addition to your hand made burritos.  If you find yourself in the area and are hungry do yourself a favor and grab a quick meal here. Don't forget cash because they don't accept plastic.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "3JuXRUJ5tPHU3xy3kdh2lg",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3JuXRUJ5tPHU3xy3kdh2lg/o.jpg"
      }
    ],
    "user_id": "9kqUhQoYxdPoHiSlIPwNzw"
  },
  "e-pb68JDToZf7rmz7LaGjA": {
    "date": "7/22/2014",
    "text": "I came here hoping for some good pollo, which I have not had since I lived in pilsen (chicago).  the chicken here tends to be dry (although I usually come in around closing), but I don't even care.  it's all about the beef and the beef is the bomb.  don't miss the pickled onions either",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i--JQWby5RfURcpxTqaDhw"
  },
  "wNny2tqxFodCNA6uay0Low": {
    "date": "8/17/2016",
    "text": "First time today. Chicken beans and rice were delicious. Super friendly and fast. So happy I found this after reading about it online",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k23Jp-ROh4ERUNGiMSa0zg"
  },
  "Rjqfk9_As4k6z5AuRw7bRA": {
    "date": "7/7/2016",
    "text": "One of the best deals and delicious beef and chicken combinations out there. It is a whole in the wall and just a gem. I will totally cater with a tray of this stuff, but may end up hoarding it to myself.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6_6XIVpehlOTyvYyg0wlnQ"
  },
  "qAD2HbGA7mRH3otVRME_wA": {
    "date": "3/29/2018",
    "text": "Make a stop here and grab the carne asada plate. You will not regret it. Bring cash as they do not accept credit cards. Period.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UM_2WHyZR4DJjp_CbITZFg"
  },
  "ZYTGPagEIdzPBYXyTs6hGw": {
    "date": "1/16/2018",
    "text": "This is a hole in the wall restaurant that has some really great grilled chicken. I bought the 2 piece chicken with beans and onions. The chicken was delicious!!!! The beans were okay. It is cash only, but definitely worth the visit. Great grilled chicken. My new go to!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RHungSCVKkphPd6uiwBBYg",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RHungSCVKkphPd6uiwBBYg/o.jpg"
      }
    ],
    "user_id": "zMHHaALSAwIoC2VPiXGpzw"
  },
  "TIO73E5jftKV5LrOYdJ1ig": {
    "date": "8/9/2017",
    "text": "The food here is so good! I got the combo plate which comes with both chicken and beef. They were both very well cooked (not over, not under) and very well seasoned! I was really impressed.   I will definitely be going back for more! Make sure you bring cash because they don't take cards.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "d8CqhvbLdzLWZbNF9XcE2g"
  },
  "lq9DRR15yrIai1r3xjr47Q": {
    "date": "7/18/2016",
    "text": "My friends and I call this place Pink Chicken - not in a gross way.  They season the chicken and the color changes to a pinkish red.  Its unreal delicious.  I have been coming here since college (a long time) and the quality or flavor has never wavered.  I alway get the half chicken so I can have left overs.  The meal comes with choice of chicken or beef - warm tortillas - beans - pickled onions (so good) - salsa.  I always ask for more onions, grilled jalapeno and a small side of rice.  You combine all of this in the tortilla and you have pink chicken magic. You will not regret coming here!    TIP - ITS CASH ONLY (or check).",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uJRjAr_enSVto6E46kK0Ww",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. 1/2 chicken to go",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uJRjAr_enSVto6E46kK0Ww/o.jpg"
      }
    ],
    "user_id": "SRN-V8i46gxA3kHXsRD8OQ"
  },
  "QmmaJPRnFqPFwcZpFMElmg": {
    "date": "6/5/2018",
    "text": "Just happened upon this place because of the recommendations on yelp and glad I was hungry !   The chicken is so delicious and authentic and the couple who work together are so friendly and nice ! Totally authentic and nice and spicy and flavorful $5 went a long way!  Wish they had something like this little place back in Atlanta !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mZK0eWBaqBYO_o7a0fi8nA"
  },
  "g6HpNriwcpCx2biChuty2A": {
    "date": "1/11/2018",
    "text": "Best mesquite grilled chicken in the Valley!  Loyal customer for 28 years. Family owned, no frills, and oh... did I mention the beans? Amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QhfM8PGgA8UCffNhtOHhTw"
  },
  "X9ryWw-yjvTITqUsPSwsAQ": {
    "date": "10/5/2016",
    "text": "I've lived in Arizona since 1985 and even came to ASU. I can't believe I've only visited this place once!! Yes, I said it, ONCE! I ordered half of a chicken to go. It came with a side of beans, salsa, and warm and flaky tortillas. The moment I walked through the door my hubby was ripping the bag out of my hands to get a bite of their delicious, juicy, seasoned chicken. We have been so impressed with our little takeout order that my hubby keeps asking me when I will be stopping by to grab some more.  I will definitely be coming back to El Pollo Supremo. We enjoy hosting game nights at our house and this will definitely be a crowd-pleaser.  Gracias El Pollo Supremo. Todo a estado fantastico!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vnWKs2dgqDuR_yNI5qJG5g"
  },
  "ceovas4-GB2mXEC_CMyGgQ": {
    "date": "5/8/2018",
    "text": "WOW YESSSSSSSSS. I am so happy my job is again close by. It was my first stop back in the vicinity. A MUST",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "St4sjViiaqsE5-sHg_-VOg"
  },
  "kdeKFWx3TvNhDBG2ah-jmA": {
    "date": "9/16/2015",
    "text": "This grilled chicken joint is by far one of the best ones I've ever been to! My mouth is watering just as I write this review...   The chicken is full of amazing flavor and it is accompanied with salsa, beans, choice of corn or flour tortillas, and pickled onions. There are also other different sides, (potato salad, macaroni, rice) and they have grilled jalapenos! Yum!  The employees are always friendly and the chicken is always on point! This ole in the wall is restaurant is a definitely must!  Oh and it's CASH ONLY! The store next door does have an atm (small fee)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zXBH5QYe1WJCvQdkYBs9JQ"
  },
  "TCQLzkaXlAjBXmRij34qaw": {
    "date": "9/28/2017",
    "text": "Staff was very nice. Our food was and hot and fresh when arrived. Delicious as Well! I would defiently order again if I lived closer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CevsFLkTlyPXuFotFqAjDg",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CevsFLkTlyPXuFotFqAjDg/o.jpg"
      },
      {
        "img_id": "zdvr5wllnc-HFoAz8YDkhA",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zdvr5wllnc-HFoAz8YDkhA/o.jpg"
      },
      {
        "img_id": "dR9-dKc7YilOPOwvNZuqZQ",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dR9-dKc7YilOPOwvNZuqZQ/o.jpg"
      }
    ],
    "user_id": "uxhZAp1TeMJc5UbatN0LNg"
  },
  "2cMC5Xyyh15AX589ebz2aw": {
    "date": "9/27/2017",
    "text": "Perfect! Steak & chicken combo to go! Rice and beans & flour tortillas :) very satisfied with my food tonight! Service was great I appreciate the cook making sure my steak was cooked right!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pniu9BceAMdkFJ-1kus2Qg",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. YUM!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pniu9BceAMdkFJ-1kus2Qg/o.jpg"
      }
    ],
    "user_id": "TPdZVNC91OGxrnQCB_Pjdw"
  },
  "CM0rvWQsXJKPyejX9cqfQg": {
    "date": "11/19/2018",
    "text": "Absolutely amazing place! Such a cute little hole-in-the-wall spot and the menu is super simple but the food is outstanding. The food totally reminds me of my childhood. The owners are super nice as well! Would recommend to anyone who loves Mexican food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bbWT-KNCl_U32nMzcUw2iw"
  },
  "FiBvX7-mJ23qprPjsI-MwQ": {
    "date": "8/6/2014",
    "text": "A good place to go!  I have found they have good food and good service.    Grilled chicken or beef - that's it!  Plates come with beans, salsa and tasty tortillas!  Rice is available for an extra charge.  I would recommend that you give this place a try because I think you will enjoy it.  When you go in - tell them that Chris from Yelp recommended you go there.  They will have no idea who the hell I am but it might provide some interesting entertainment and a good laugh or two!  Enjoy!",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Tsk7LgyqWSwQSumLjNc98A",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Beef",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Tsk7LgyqWSwQSumLjNc98A/o.jpg"
      },
      {
        "img_id": "AuAbsanKMnGlDVWQbKgkrQ",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AuAbsanKMnGlDVWQbKgkrQ/o.jpg"
      },
      {
        "img_id": "ezJakxHoUpBq2DvrCQzIsQ",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ezJakxHoUpBq2DvrCQzIsQ/o.jpg"
      }
    ],
    "user_id": "1l_O3VEl9TV_JjKAzzyz0Q"
  },
  "n3gSTYmmehFxiTunTlTsKg": {
    "date": "1/6/2018",
    "text": "Oh hell ya playa I eat here like once a week. The inside of the joint nothin too crazy but you wanna know what's crazy?  THAT MUFFUKIN CHICKEN!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BKiJK6elXpyHvQnaUr-HfA"
  },
  "7AcSoL4UOeHzNY7uIYaDow": {
    "date": "5/19/2018",
    "text": "Been coming here for 10+ years, chicken always on point. Tried the carne asada today for the first time and was impressed with flavor and juiciness. Will do a combo plate every time now.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Ud_WCM-IIaV3lLz7fSWTg"
  },
  "5ud2XvuANEOANbJOcNzkqw": {
    "date": "3/21/2017",
    "text": "It could be a lot better, but with no competition around, they dont have to be.   The chicken is basic charbroiled, some times overcooked & dry, averagely seasoned, and portions are ok.   Sirloin is adequate, plays it safe with the amount of marinade & spice. But at least its decently quality & tender meat.   Beans are average beans & they fill their role as a side item just fine.  The salsa is terrible mashed tomatoes.   Service is lacking, slow, and cash only is annoying.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ODZxY8BgOKkwJropDUqzBw"
  },
  "XZXwtnTcy8w6a40QH7-fAg": {
    "date": "4/17/2018",
    "text": "Omg!! I absolutely love this place and have been eating here since I was 14 years old! Everytime I come in, my chicken is charbroiled so perfectly!! The tortillas are always fresh with tasty beans and the marinated onions are my absolute favorite!! If you're in the mood for some delicious food, they will not disappoint!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eah4FXg66KM5RgURRJhBSg"
  },
  "W_ZFmwd_4Ucy7jfxEq4NVg": {
    "date": "1/31/2018",
    "text": "I haven't been here for at least 10 years when a friend told me about it. I probably would have never tried it but I'm glad I did. Came back for the first time in years. Looks the same and tastes the same. We got the combo platters the meat is really good and I LOVE the salsa.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kdYiAc_QL2HItwXEAeZofg"
  },
  "EmVlq7elQC_VxS1KEotSOA": {
    "date": "7/21/2017",
    "text": "This is absolutely my favorite grilled chicken place. It is just delicious. The  onions are out of this world the beans ,rice, started jalapeno. is just wonderful and it's very reasonably priced and the employees are just fabulous. It's  just a wonderful place. It's cash only, but there is an ATM next door.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPGWGwZT_iGJTRXbD7nbDw"
  },
  "qahgskTqkHxn_VaniCjIwA": {
    "date": "7/26/2018",
    "text": "Devoted customer x 10 years. Love all their food. Cash only. Always surprised they don't have a line up outside the door. Their chicken is better then popular El Pollo Lucas in Puerto penasco",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qtD07rN0iL9E0pjOvLwAMQ"
  },
  "jp4x4JNRSN4pSr0nfAgRWw": {
    "date": "10/18/2012",
    "text": "Get the combo, SO tasty.  I liked the beef better than the chicken.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tt7kNfvrexc0x2rK1RcJRA"
  },
  "9t13gxLKHD3DKQX5RlpPOg": {
    "date": "3/2/2007",
    "text": "a lot of people LOVE this place, but the few times i've been here, it didn't not sit well with me. i think i'm turned off that the chicken is pink. pink? i know, it's the marinating process or something, but i can't get over it, it's not natural. it's juicy and quick, like fast food, but a little better.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "HhVNG_1NOEyxfxudd6TSCg"
  },
  "hvGkN1gnpUWb-XJLbDB3ng": {
    "date": "6/3/2013",
    "text": "The best meat around!  I have heard the chiicken is very good, but I can't get myself to order anything but the beef.  It is so so so so good.  remember to bring cash as they don't take credit and there is nothing worse then getting in there and smelling how delicous the food is and then having to leave to get cash :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DG3H1OX5siM46uyGRB8xqA"
  },
  "RbHUXHjOTizbQXbocMo5sQ": {
    "date": "10/28/2010",
    "text": "YUMMY!  Had both chicken and beef and YUUUUMMMMEEEE!  I'll pay attention to the saltiness I never noticed that, but from what I know I could eat at this place everyday and never get tired of it... And it's not 15 bucks for a meal!  You can get the 2 peice chicken combo for 5 bucks7 bucks for beef... water, bing bang boom you got yourself a nutritious meal, for cheap!!  HIGHLY RECOMMENDED!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WiEibCkHcGAtMt8hT6gzlw"
  },
  "IrZ2XnvhK44NOTWDO7b2_g": {
    "date": "2/5/2013",
    "text": "Crazy deliciousness, super uber supremo, perhaps take the deliciousness outside if you don't want that particular type of authentic experience.  :)  An institution in Tempe, well deserved.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hNWFMj9zKoFcs8rLwbiRaw"
  },
  "5mpVtRknKyRE0DUya3FPnw": {
    "date": "5/3/2010",
    "text": "Ate here after a few days hiking in the Grand Canyon. We were staying in a fleabag motel near enough to the airport, and decided the Denney's in the parking lot wasn't worth the sceptic risk or the moral ambiguity.  As for El Pollo Supremo---the pollo was indeed supremo. The frijoles were also top notch. Never had this kind of salsa---looked more like applesauce. But it tasted good too as did the scorching hot corn tortillas. We cleaned our plates.   The only complaint, aside from the boxed horchata, was the definition of 1/4 chicken. One of the \"two\" pieces was like the wing of some poor songbird. But it was toothsome all the same. And I really don't need to eat a 1/4 chicken to meet my basic nutritional needs now do I?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rMBDNB6vnwnsdHqtFatSJQ"
  },
  "M7sVf8olxoxi1DnUvTk5Xg": {
    "date": "7/9/2012",
    "text": "Don't know why it got such good reviews.  It was just ok.  Chicken was dry.  It was cheap though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "smDsFBTI03DRk8u6kbc9-Q"
  },
  "AZOlZmO-vRMw6cb2G5UwOA": {
    "date": "9/16/2009",
    "text": "Got here 30 minutes before closing on a Friday night. Lots of food for not much money and very tasty stuff. The interior is not that great and it feels a bit like a dive, but a dive with very tasty food. Maybe a bit greasy but their chicken is unlike what you get at any other Mexican restaurant I have been to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H5nZj2CKTep0LOnleduhpg"
  },
  "lYymBI8eKKzQ8kunmy0pSg": {
    "date": "5/6/2010",
    "text": "i work in tempe, and this is one of my fave lunch spots! i usually get the combo with white meat.  i think usually they usually put whatever meat is closest, but you can ask for white meat, and they don't charge extra. for 8$ i get a ton of food!  a lot of beef, a large piece of chicken, beans, salsa, tortillas and pickled onions.  the chicken is super flavorful!  i LOVE the pickled onions.  they provide a nice addition to the chicken and beef. my only complaints... cash only!  i never carry it as almost everyone takes CC now.  I don't go here as much as i would for that reason alone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZXz6LmgNbueGlx5jjzTgFw"
  },
  "froEIkUjDZ7VS2Q9nNi8LQ": {
    "date": "9/3/2010",
    "text": "Not sure how yelp works, but I already posted a favorable review for this place, but it has disappeared!!!  El Pollo Supremo is one is favorite places to eat.  The menu is simple, but what they do with what they offer is unbelievable.  The chicken is outstandiing, the beef succulent, and the side perfect.  Bring cash, and enjoy what hey have to offer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zQja95J54KvlWSGLe4jW7A"
  },
  "V4b-P4Cn7lBCS9FhTxkUHg": {
    "date": "7/4/2009",
    "text": "To my homesick Indianz from Arizona, if you want home cooked food (beef, beans, tortillas) this is THE PLACE.  Tri-tip grilled on actual mesquite, tortillas that taste as close to homemade as possible, and they will actually grill jalapenos for you.  And the beans, oh the beans, just like Moms.  Eat here, you will be happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qg70YmosCoEeBZ0QOC6qRA"
  },
  "T3NZTHBuS2x2bXaxSSbt1w": {
    "date": "1/28/2010",
    "text": "All dishes had excellent flavor and were plentiful!  Had both the beef and the chicken, couldn't say which was my favorite.  I will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-sjZN0S7O0yN0wsvrL_slQ"
  },
  "AMWugbnSfWLlrlI9OSXj-w": {
    "date": "1/25/2012",
    "text": "I have driven past this past this place 100's of times. I never thought to stop in here until I read about it on yelp. I ordered the combo (beef and chix) although I'm usually not a fan of beef at these places cause its usually chewy. Well, the chix was delicious. For me, just below the too salty threshold, which is perfect. The same can be said for the beef. And I was impressed with the chew on the beef, it had a nice give too it and was delicious. And the grizzle, yum. Getting back to the salt factor, it winds up being perfectly balanced when you put it into the taco with the onions and salsa. Very impressed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UxFLiEYuFAotJA7vMxwPlA"
  },
  "C3I-MhYvfsnSIRlA9wUUgA": {
    "date": "6/25/2010",
    "text": "I fell in love with this place when I lived in Tempe in the 80s.  It still remains on my favorites list.  I now live in Gilbert but any time I'm in the Tempe area I make the trip to El Pollo Supremo for their charbroiled chicken, tortillas, beans, homemade salsa and marinated onions.  It's absolutely delicious and you can't beat the price.  I'm grateful this place has lasted through the corporate developments that have impacted every core of downtown Tempe.   Don't go looking for ambience.  This place is only about the food.  Pure and simple and awesome.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KYWL_lR-faUoRf_BFeRAmQ"
  },
  "Z7VWIn-nIo50UwkekQj2XA": {
    "date": "6/30/2010",
    "text": "By far one of my favorite places in the world.   Just a little cash only hole-in-the-wall cranking out a plate of tri-tip and tortillas so awesome I'm drooling as I type.   The beef = great!   The tortillas = great! (even tho they're not homemade)  The beans = great!   Everything else great!  You should go. Go Now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HqU6eAslk66Gc-mZQxrHaQ"
  },
  "7bZmGRshrGlJBsvhiX6wVw": {
    "date": "5/15/2012",
    "text": "Love this place! Great food and great prices. 1/4 chicken is more than enough food for one, choose between corn or flour tortillas and I always get a side of sour cream.  Staff isn't the friendliest, but easily overlooked by the quality of food. Don't forget to bring cash.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nc_7kwNduOPyDSeVlPvsSw"
  },
  "zE8tx-I74lG_zgZzz0i8bA": {
    "date": "4/11/2010",
    "text": "Nice simple Mexican food at a great price, love the charbroiled steak and the beans so flavorful with out a lot of stuff added. Called my order in but when I walked inside the smell was so good I had to tell them to make mine to eat in. Next time I will try the combo cause the beef was so tasty I know that charbroiled chicken will be just a good if not better. Just remember CASH ONLY you can eat for as little as $5 but bring $10 and you can get anything you want.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mkRI07cv5f1gObpkSiPwZA"
  },
  "wLi9u2IXWXjwYnyC3UIrUg": {
    "date": "11/4/2014",
    "text": "Nice place to eat and read (at least for me). Big plate of good food for not much money. Cash only.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fum6Ue8W19pXVR6SpEeRIg"
  },
  "Bzl53IW0f3Tg-EilxhCKgA": {
    "date": "6/2/2011",
    "text": "i was in tempe for a weekend ice hockey tourney ( i was one of the hockey huggers) and after one of the games ended, everyone was trying to decide where to go to eat.   SunnyD (he went to ASU so he was into the local flavor) insisted that we come here. I was a bit unsure as  everyone was throwing out suggestions like, hamburgers or italian but he stood staunch in his belief that i would love it.  So, we went solo.  Hmmm...things to note:  It's not fancy. It's next to a smoke \"accessory\" store  When we got there, it was a little after the lunch rush and way before dinner time.  it wasn't packed (actually, i think during the time we were there, there  was one guy who was eating, a few people who came in to pick up their to-go orders and maybe a couple or two who were coming in as we were leaving)  It's pretty low-key. There's a menu. It states exactly what they've got (chicken or steak, i think were the only options) you get beans, marinated onions and salsa with every order along with your choice of flour/corn tortillas. I got the 1/4 chicken w/ flour, SunnyD got the 1/2 w/corn.  HOLY MOLY!  once the order arrived at my table, I noticed two things. 1. i don't usually like onions but i love pickled/marinated onions (and that's what they give you, the slightly vinegary yumminess takes the bite out of onions so they are just perfect without having an oniony smell!) 2. they char the skin on the chicken just perfect so there's no layer of fat and it's just all crispy skin goodness with a juicy marinated to the bone goodness when it comes to the meat.  i ate everything. i literally tried to get as much meat off the bones as I could. I like beans but hello....the chicken....was....heavenly. i could have eaten about another 1/4 (let's be honest, another 1/2 chicken easily)  SunnyD made good on his chicken and ate the whole thing too. I think the next time, we can def. go with a whole chicken and maybe another 1/2.   It's so good that if SunnyD were to ever ask me to drive out to Tempe from OC to just dine on that chicken again, i would gas up and hit the road.    So bottom line. It's kind of like el pollo loco (but sooooo much better) but more authentic, in a more hole in the wally place that does chicken the way it's supposed to be done. Cash only and plastic utensils (so make sure your fingers work, so you can pull the meat off the bones) I might have to check out the steak on my next visit but I don't really want to spare the room.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "BAjT1Sba7Wr42lMMGj5kbQ"
  },
  "z2alUrej5yQ_X20ORg9mjQ": {
    "date": "3/2/2010",
    "text": "Why is their red chicken so good? Why is it red? Both my girlfriend and I cook and neither of us can imagine.   This is a rediculously delish barbeque place. Don't let the name confuse you. It really is more of a grilled food place then a Mexican restaurant. Their menu is very simple. You basically have a choice between 1. chicken, 2. beef, or 3. beef and chicken. I recommend getting number 3. It's under 7 dollars and comes w/ beans and tortillas (corn or flour).  The biggest problem with this place is that they only take cash. Bring cash or go to the Circle K across the street and use the ATM.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nKiY1Jc1O3SKym71qmLV5w"
  },
  "0v22UgR9DuqqLa5koffj_w": {
    "date": "11/14/2012",
    "text": "This place is weird, and not what I expected by the reviews on here. You order some tacos, and they give you the cooked stuff to make them yourself. Nothing prepped, chicken still on the bone. Delicious food though, just weird...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pSlGLGvZbeTtjgTf_31P2g"
  },
  "4mnNUlTyTy6YWH40lrWl8w": {
    "date": "8/25/2012",
    "text": "Chicken was fabulous, beef was good but not quite as tasty as the chicken. Salsa was fresh, onions were surprisingly different and delicious, and beans were solid. Cheap and tasty = win!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ag5kMEahP6TubQyWSjmlhg"
  },
  "WRHQ0UjBO8P8N-3s0-O86Q": {
    "date": "12/7/2009",
    "text": "I have been going to this place for a few years now. The food is great it is grilled with light seasoning and goes perfectly with warm flour tortillas. You might want to avoid going at lunch time because they are super busy and it is hard to get a seat.  If you work in the area call ahead and pick it up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R8EPNABV3Xwhv2iCPMPxkw"
  },
  "9EvV8-iLWIaRPjDeJPhWbQ": {
    "date": "8/19/2011",
    "text": "Great Food! Really enjoyed the \"Combo\".  This is kinda take-out style, but does have tables.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gD6cHcylbcWvSafBWhFB1w"
  },
  "EmfJwqRDzqztBprtLWg6pw": {
    "date": "6/16/2012",
    "text": "I had always driven past here on my way home since it is right down the street from my house and the smell is incredible so I had to stop one night to try it. I am so glad I made the stop, the best chicken ever with tortillas to make your own creations. CASH ONLY THOUGH SO BE PREPARED!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yV8UoOwWC6HpzgqipElwyA"
  },
  "azAinbLkBwhN2qUW3DyBvg": {
    "date": "6/23/2011",
    "text": "hands down best grilled chicken place in the phoenix area.  Only takes cash so be sure to bring some.  Their Carne is awesome as well.  If its your first time there try both meats.  Menu options are limited but hey who needs more?  I'm glad not that many people know about this hole in the wall place or there very much could be a line out the door for their yummy chicken!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ofznDNjZ6tdINXfWF3vTA"
  },
  "46YwqlpDBD9xeWbQesHiJw": {
    "date": "4/19/2011",
    "text": "Seriously good, authentic food. You can't go wrong with the chicken or the steak. Please go (and ignore the decor). CASH ONLY!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cZp3K1n6zQbGlgPqP4X-6w"
  },
  "1GLNhresaATuAcQKQ6G5eQ": {
    "date": "5/10/2011",
    "text": "A solid three stars. I was hoping for an american clone of my favorite chicken place in Rocky Point and sadly, this didn't compare. Not even close. However, that Rocky Point chicken is the greatest thing to ever touch my tastebuds and thus leaves very big shoes to fill. The chicken at El Pollo Supremo was a little dry and I really wish there was an option to just get chicken breast instead of the 1/4 chicken that I ordered that was all dark meat. The tortillas served on the side were nice and fresh and I loved the pickled onions. For the price I'm not sure you can find a better lunch. Oh, and David Spade was at the table next to me so I guess what's good enough for celebrities is good enough for me ;)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WgGelmNHNLQOttARs07Uzw"
  },
  "IixzmAOcaK78pamcKTr4sQ": {
    "date": "7/29/2011",
    "text": "Most affordable and delicious Tempe restaurant! The chicken is incredible. CASH ONLY",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AElq-xdI0bhtnSBBhwpoPw"
  },
  "os881Yc8qOn5VStO3Sqg4w": {
    "date": "5/19/2013",
    "text": "I have been going to this restaurant over the years off and on since 1992 when I first discovered it as a student at ASU. While some may criticize and say the chicken and carne asada did not blow them away, I would have to say this place has never let me down and it has always consistently been good always with the same level of service and quality of food I have been experiencing since my first visit 21 years ago.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oD-pyPxE7my4JDMMCTyqpA"
  },
  "br95hVvAe6W8Ahi6Lt9jnA": {
    "date": "8/9/2010",
    "text": "I felt like I was standing by my old bus stop in Nayarit eating my favorite \"street chicken\".  The chicken was delicious- and the tortillas were great. The beans were good, although a touch too salty. I thought the salsa was a complete miss. No flavor. Maybe it was an off day. The marinade is what makes this place worth going back for, even if they make me stop at the ATM first !",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Cif8hWP5WBcpImvIa0bqlg"
  },
  "ogyN4Bd0HtGvtqwYvIEQxA": {
    "date": "2/25/2011",
    "text": "This place seems like a hole in wall but the food is very good and modest. They have chicken or steak. This chicken is red on the outside and the flavor is great. You can get plates or meals. You get tortillas, some plain salsa, cabbage that is very good, and your meat. I've only been here a few times but if you want something casual and feel like something yummy you can eat with your hands I would recommend it. The prices are very reasonable. You can eat here or take it to go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-T_cG-7YFFvD3Cdu3v4ZYA"
  },
  "xdCkzNSx3CHlHLViKhMG5g": {
    "date": "5/9/2012",
    "text": "Lots of good recommendations but my shadow will not be cast on their door again. I ordered the combo which comes with 2 pcs of chicken and some beef tips, beans, salsa, onions and tortillas. ($9.00+) The 2 pieces of chicken were half of a hacked up back and 2/3 of a wing, THE TIP AND THE MIDDLE, NOT EVEN THE MEATY PART. There couldn't have been more than 3 ounces of chicken and it was drier than the Sahara. I was unable to get a bite down without a drink. The beef had good flavor but super dry also. The beans were standard fare and the salsa tasted like it was from a can. Overall, I felt ripped off",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mv_mb0bJ5-HYgqSMVOPxNg"
  },
  "uKk5_Iwz9A7Sbd8a1Te8Ng": {
    "date": "7/9/2010",
    "text": "I haaaate being the guy that gives a 2 star review for something people are crazy about.  I've been actively wanting to try El Pollo Supremo for about 2 months now, and finally got around to it this afternoon, and was quite let down.  First, I was a bit taken aback by the price.. Nearly $12 for a quartered chicken, and nearly $15 (yes.. Fifteen!) for around 12 oz of carne asada (each come with boring beans and some 3rd party tortillas. Also.. salsa that could be jarred by Gerber)..  Once I got home with the goods, and saw the portion sizes, my skepticism grew stronger, and for good reason....  SALTY. Incredibly salty. Toxic saltiness. I'm not a wuss either.. if something has unhealthy levels of anything in it, I'm usually a huge fan. This was not enjoyable. Then came the Carne Asada.. far less salty than the chicken, but still pretty intense... it was OK. I've had worse carne asada.. but I've also had way better. It really needed some good fresh pico de gallo to kinda crisp up the otherwise gummy meat... This is the first time I feel that yelp has steered me wrong... not bad, considering how many WIN places I've found otherwise :) ****Also- looking at the picture of the menu, their combo prices seem to be a MUCH better value than just purchasing full chickens, or full orders of Carne asada!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uufubBI9EcKwFW7x_o9j8w"
  },
  "9QjT5NSR1FwymBi81mReoQ": {
    "date": "6/7/2012",
    "text": "I love this olace. The food is fantastic & fresh. Laura, the owner is such a sweet person. She makes you feel welcome the second you walk in the door. If you are even a semi regular, she will remember what you get!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rgYDcN8_xwjzQ8mKBjGdLA"
  },
  "h_EmbNT590fYDUVJrOPStw": {
    "date": "4/2/2019",
    "text": "Staple in the hood. Allways good for a quick filling meal. Bring cash. Simple menu. Chicken or beef.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EVWH7Qpv4hbqLgZyKlQi3w"
  },
  "lEwLn7AOYILUUNpeZs2gmw": {
    "date": "2/17/2019",
    "text": "In town for a relaxing birthday weekend. This place came recommended by the bell man in our hotel. He said if you like authentic Mexican food, try this place. As most yelpers do, I came here first. I was prepared with cash only and knew the menu was super limited. I ordered the combo plate and a small soda. Not bad for $11. It came with a 1/4 chicken and 1/4 carne asada, salsa, pickled onions, your choice of 3 tortillas (flour is what the cashier recommended) and pinto beans. Baby let me tell you the flavors that are packed into that plate... AMAZING!! It was delicious! I don't usually eat onions, but I tried the pickled onions towards the end of my meal and was upset that I hadn't been eating them the whole time. We actually came back before we left to get some to take back home. That's how good it was...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v3axSrTu4EUdwjD2hNCsIA"
  },
  "U1JB3tGbDAkGm0SXxNsqlA": {
    "date": "1/17/2019",
    "text": "Look no further!!! This is the place for some legit pollo! They grill it right there. I ordered a take out combo platter and you can just smell the grill when you open your styrofoam box! So good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLcpKn6VK-4LKZnc0IlyKA"
  },
  "xt9HxB5DQ_dS4hYNGraM_g": {
    "date": "2/21/2019",
    "text": "Ordered the combo. Good flavor. Personally liked the chicken more than the steak. Good amount of food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KFRTdY48WuddspvfsH-DdQ"
  },
  "vtepx1z92BQAZIatBTGVgg": {
    "date": "5/27/2017",
    "text": "Lunch today was great  It's that corner on University that is still underserved topps Buffalo X, Cartel and a few other notable spots all hold court in these old buildings.  For the record its casual, extremely. I must say that counter help was nice , congenial, and efficient, no issues there.   Buttereface.... I digress, Great steak, Beautiful chicken, Awesome tortillas round out  the fantastic food... butterface!!! But her face needs, a coat of paint and some decluttering.   Too much Styrofoam and lack of condiments make it not as good almost all restaurants in town.  Tasty tri tip, amazing chicken and great beans and tortillas are the real stars here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "XnKUcmayZd-N43fR2n-0Ew"
  },
  "qsQFhFqmDXOs8QdmBHkbCA": {
    "date": "2/1/2019",
    "text": "This place is your a great place for some no frills, delicious chicken. Remembering the tasty flavor and crispy skin is making me hungry all over again, and the beans and flour tortillas were just plain good. Deliciosos!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GPBGi7_cnuIQH5Xj9lpmHg"
  },
  "gEpvpFKVL0eUS82oIuYfpg": {
    "date": "2/27/2018",
    "text": "This chicken is hands down authentic Mexican chicken.   One bite, and I started reminiscing about some good ol' memories from Mexico as a child.   The price is fair and the quality was great. Will definitely go again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Z_1H3McoLyETOzhXdlIllg"
  },
  "4fymEfHDo_1_xGCv-eoKQA": {
    "date": "5/8/2017",
    "text": "This place is one of my favorite lunch spots in Tempe.  When I don't feel like a heavy lunch and not pay 5 bucks for a salad, this is a happy medium.  First let me warn you, cash only.  If you don't have any, you get the walk of shame to the nearest ATM.    I have been told that the Carne Asada is good but I can only review based upon the chicken.  I always go there and get a 1/4 chicken plate.  This comes with 2 pieces of chicken, either a thigh and drumstick or a wing and breast.  But like I said, the servings are just right.  The order comes with pickled onions, beans, house made salsa, and fresh tortillas.  Be careful though, the chicken is fresh off the grill and the tortillas are piping hot.  In Hawaii, they serve something called Huli Huli Chicken.  Google it.  Basically rotisserie chicken but not in an oven but over a charcoal fire.  This is as good and tasty.  And I gotta give it up for the tortillas.  These are the best I have ever had.  Just the right burnt crispiness to it but yet not chewy that I have to fight it when I bite.  When you first get to this place, you might question the location and the inside.  But sometimes, those are the best places.  The lady at the front counter is always helpful and will be happy to explain what you get.  And the price, you can't beat.  It is hard to find a lunch under 6 dollars that will fill you up like that.    Again, I will warn you....Bring Cash!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rm4poq6iB5LTOP0jj6ckCA",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Quarter chicken for under $5.50?  Can&amp;#39;t beat it.  Very tasty!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rm4poq6iB5LTOP0jj6ckCA/o.jpg"
      }
    ],
    "user_id": "yEqnapIduS1Tfv3RpUS_Dg"
  },
  "Y5Zv2oc_MO1dMXlsZheuSQ": {
    "date": "7/24/2018",
    "text": "This unassuming restaurant has been my personal diamond in the rough for years, and it will continue to be until the end of time. No matter what you get, it will be made authentic and full of flavor. Their chicken is to die for and the prices are on point as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "C9CwBTMZMDXgujgTBqHE8A"
  },
  "G0RcaEVrALdMUhJivAgWgQ": {
    "date": "4/8/2019",
    "text": "El Pollo Supremo is super delicious. The chicken is the best grilled chicken I've ever had. It is full of flavor and is moist and juicy. The pricing is super reasonable and affordable. If I lived closer I would eat here weekly. There's very few places that you can say you would eat weekly and not get sick of it, but this place is definitely one of them. I highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qNhjVYQc6tCAAKzyksClsQ"
  },
  "OXfPCH5ahNTE81fuEnXyBg": {
    "date": "10/7/2018",
    "text": "Best chicken, beans and rice! When I want to remember road trips to Mexico or simply eat very good and delicious chicken, I come here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TSYdBWQy62svPKo3buZiag"
  },
  "RjaRYiMBJ49vwAajtPk_bA": {
    "date": "5/19/2018",
    "text": "Sometimes you really want to eat meat and lots of it. Portions are huge and we usually get a plate to share. It's a quick, easy, and most importantly a delicious meal perfect for the days you don't have time or the energy to cook. Not a fan of their horchata but I can over look that for this place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3fnD5AOlwrC0-eIxAIMFwg"
  },
  "9n2AaN1vwHmpxpqNzJA8TQ": {
    "date": "1/27/2018",
    "text": "Very good! Saw a picture on Instagram and came to try it out. It was very good and portions were good too! It would be nice if the Mac salad and coleslaw were homemade they aren't. Downside is that they only take cash, but there is a smoke shop next door that has an ATM.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dWLdQjvlpNrOREiaO1SWFQ"
  },
  "iJYaB2-ldfDAmA6LIOOzlw": {
    "date": "1/7/2018",
    "text": "This place is AMAZING!!! Very inexpensive, and the food is phenomenal. Only steak or chicken, but soo sooo good. Tortillas are home made and food is authentic. Will come back for sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GTEjF1X2yEnhOf3aFUGOkQ"
  },
  "0IFkHrHXuYooDP0YWWs7UQ": {
    "date": "9/21/2018",
    "text": "This place is sooooo good! You won't regret coming here and getting a combo plate. Price is very reasonable and it fills you up for sure. Beans and tortillas",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5JS-r_sW7ljWb-l_HLSDrA"
  },
  "VlPVAdOUByN4rZcp5pF4ew": {
    "date": "8/2/2018",
    "text": "Update: I tried again. Much better. And I'm so happy as this is an important establishment in Tempe!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ak2sXowzRc4aLq7mMDyXGg"
  },
  "3XrmkZsK6A3GOLj0XFVDvA": {
    "date": "11/3/2017",
    "text": "This hole in the wall place serves some great chicken, but other than that it's hard to give this place a better rating than this.   I tried to do an order for delivery, which they say THEY DO on yelp, but when I called, turns out I had to call a different number for someone to deliver my order. When I called that number, turned out it was a wrong number.   When it came to ordering my food, the lady was very hard at hearing, and I couldn't really understand her. She also hung up on me abruptly. And then when my friend came to get the food, well what do you know, they don't accept credit card, it's straight up cash!   Overall, I get it, it's very authentic, all the way down to the service. I probably wouldn't come back here again even though they had good chicken",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "t1HdYXIzIuooNDXC09iiBA"
  },
  "3-C2gPIZnQl1pa_R3W7gvA": {
    "date": "9/18/2018",
    "text": "Cash only but my god, really great food here. Great to-go food. Make sure to get a fire-roasted jalapeno and a half chicken with flour tortillas. Everything about this place is good: simple, fresh, hot and real tasty. I'll be coming back for lunch at least once a week lol",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-K8gjsGjZyz6I7BiWynWg"
  },
  "TpxQCYqvKCZwcN0x0_TrHw": {
    "date": "1/25/2018",
    "text": "Love this place. Customer serivice is great. Feels a tad dingy but Its clean. It's cash only. I go with the tri tip and chicken combo. The steak usually comes out a perfect medium rare. Beans are clean. Salsa is spicy and flavorful. Onions are perfect compliment to the steak. Chicken is crispy yet moist. I have yet to try the tortillas. It's a Good value for the amount of food you receive. A must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jN_Au0uCMn7ld16RjBRG0w",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jN_Au0uCMn7ld16RjBRG0w/o.jpg"
      }
    ],
    "user_id": "rc7T96zYQY6f9Zkvsa286w"
  },
  "PNQFdBczLOtHcQh4Cdtp3w": {
    "date": "10/21/2017",
    "text": "I was just sitting on the couch trying to think of some of my favorite places I've tried when I remembered El Pollo Supremo. This place is an epitome of simplicity done well. Everything is fresh and done well. The chicken has a nice spice to it. Just make sure you've got a glass of water because it's salty. Just a great go to take out meal.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lVZizRLbMalu4C_tCjgjbg"
  },
  "UD8FUUCisRpOlq4lMhclQA": {
    "date": "3/7/2012",
    "text": "My Dad used to come here when he went to ASU and every time he would comes into town, this is definitely a spot we go to. The chicken is so good and perfectly cooked on a grill in the back! [i mean you can see the dude cookin' it up!] None of that already made stuff or cooked on a skillet...no it's a GRILL! The carne asada is so good because once again it is grilled! Their salsa is a tomato base salsa and not really spicy but has good flavor. Their tortillas are basically homemade but are from a local tortilleria in Phoenix. The meal comes with beef, chicken, or a combo, beans and onions! I always ask for a side of rice and grilled jalapenos! Oh and I bring my own lime since they don't have any lol",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "jND4Ie4s2HEheM3Ugb6unA"
  },
  "qFPPJPnecEjn3sD8qbO1pA": {
    "date": "11/5/2012",
    "text": "Oh my tasty goodness!  This very small and basic hole in the wall restaurant is cash only, and so worth it.  I go with the combo of steak & chicken.  I love the pickled onions & the salsa tastes just like my Tata used to make.  Although I feel like the flour tortillas are a little undercooked, they are still delicious.  No frills, no fuss, just good food.  I will absolutely be a regular here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zy2ZwrYjSAGv6AMF039iMw"
  },
  "BTAmElKl5gciavGFUTKkrA": {
    "date": "5/14/2012",
    "text": "I had this for dinner last niht based on the great reviews. But gotta admit chicken was very dry and the beef was not that great. It might be that it was 8pm or who knows. I will give it another try but i gotta review on the recent experience.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8WE7H_NvgM7V6IA7Ro3Prg"
  },
  "QG0faiiV04Riht2A_pOlzg": {
    "date": "1/20/2010",
    "text": "Not a bad place for lunch.  Relatively low cost, simple menu (chicken or beef - corn or flour tortillas - no other decisions needed!), and tasty food.  It's tasty, all good (don't know about best ever by a long shot).  The decor is non-existent (but who cares) - if I lived close, might be a good option for dinner take out (but I don't live close).  Problems would be lack of flexibility - things like not enough salsa to go with servings, and unwilling to provide more salsa (this was odd!), although they are willing to sell additional salsa.  I am also annoyed when places charge for refills on drinks, all of that gives it a rather stingy vibe (and the prices aren't that cheap!).  Overall, I go back every few weeks for lunch as it's tasty and reasonably priced, but it is not someplace I frequent or go to on a regular basis even though it's close to the office.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "GArSorY_bjEaTuhqQ4oz0g"
  },
  "2JIcfJdnfI95TYEj1zA1JQ": {
    "date": "9/27/2013",
    "text": "Been going to this place for years about time I wrote a review. Basic fajita and chicken menu that has stayed the same, Great.  Love to sometimes just get the rice and beans if not in mood for meat, my vegetarian friends like it too. Love Love Love this place anyone I have ever taken has loved it too (ALOT  over the years).  staff always friendly. Would have given 5 stars but sometimes it can be a little warm and seats a little hard, so I get it to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bwyDKrSpvVfLma2qZnq5vQ"
  },
  "9eVQ5TLZTwQ2fQ110mXyRg": {
    "date": "5/1/2012",
    "text": "This is hands down the best chicken in town.  Perfectly spiced and paired with beans and super tasty onions.  Fresh tortillas round out the meal. It is a dive but worth the trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FGkq_yMe53te4_o2f6JVpg"
  },
  "gPEdtesInIXQA1HH9WRm2Q": {
    "date": "4/30/2012",
    "text": "WOW! My wife and bro have been telling me about this place for years now but for some reason we never went. We always visit Cartel Coffee on the weekend which is about 100 steps from there and FINALLY this past Saturday we went for lunch after our coffee and I am still kicking myself for not going sooner. The red chicken is ridick and the tri tip was amazing as well. I am (as we speak) thinking of putting in an order for lunch and I work in Chandler! The food does take a little bit but its more then worth it!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IxJCTKzpfSseTyOSGbc8TA"
  },
  "uquiv3zygnVHEPCeBKYKoQ": {
    "date": "1/22/2011",
    "text": "This was the very first place I dined in AZ when I moved here to attend Arizona State.  I've gone there about 125 times in the 15 years since.    the place isn't much too look at, but there's enough to look at in Tempe to worry about that.  I'm there for one and only one reason - the finest grilled chicken in Phoenix (all competitors fall flat) coupled with some outstanding tri-tip.  I honestly feel like the tri-tip in the late 90's was better than it is now, but it is still very good.  Tired of the usual?  Try this place.  Very easy on the wallet, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8riySShDD_qy_3yfieHeQ"
  },
  "JWQQ0HutKJzcD1T62NMEBQ": {
    "date": "12/10/2011",
    "text": "Heck. Yes.  This place is amazing.  Basic, flavorful, and cheap.  I am guilty for not eating here after passing this place for years because it looks like a sketch fest.  Shame on me.  Don't make the same mistake!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "xTwt6RzY6NxZAeMFJSuSCg"
  },
  "Dm7kctBkxI50v3KHlbaR4A": {
    "date": "11/18/2009",
    "text": "I ate dinner at El Pollo Supremo after reading about the place on Yelp.  I love grilled chicken and this place knows how to grill.  The chicken was lightly spiced and the skin had a red color.  At competing grilled chicken places the chicken is served luke warm, or cool.  This chicken was HOT and juicy.  The meat was tender and separated from the bone easily.    The beans and tortillas were tasty.  Tortillas were warm and heated on a stove not a microwave.  Yum Yum!  Carne Asada stands for 'grilled meat'.  Usually a skirt steak.  Prepared by a skilled griller (I know griller is not a word but it should be)  the meat is tender, and juicy.  When prepared by an amateur it can be used for shoe leather, or cheap tires.  The griller at El Pollo Supremo is an artist.  Two folks could split a combo dinner easily.    El Pollo Supremo is in a small strip mall.  Upon entering the restaurant you place your order at the counter and can take a look at the small kitchen where the magic happens.  The place is old.  The fixtures and tables are old.  Nothing wrong with old, it just sort of hard to keep old stuff clean.  The proprietors do a good job of keeping the place neat and clean.      The reason for only four stars is their drink policy.  They charge for refills.  I can see charging for refills on Horchata but not Pepsi.  It's a minor thing, maybe I'm too cheap!    You can leave your plastic at home, cash only here.  Don't tell the IRS!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "pKvIao5r1bB5TJYspKWwKg"
  },
  "sE-xNREp0a3uZlGP0yPETg": {
    "date": "5/12/2014",
    "text": "I loveee their chicken, extremely flavorful. The beef is tasty too, but a little rubbery and hard to chew.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-o4IHkD53fdMKcVjqC9DMA"
  },
  "1TC2c2hkM3LkJP2o0HUb6w": {
    "date": "6/16/2007",
    "text": "If you haven't been here. Go. Now. Stop reading this review, ignore the fact that you just ate an hour ago, and go nosh the shit out of some of the best damn chicken you'll find in the valley.   There are only two options at this place that are on par with some of the best carne asada or red chicken you'll get from a carniceria. Seeing how the only options are chicken or beef (Or both! Go wild!), it's probably not the best place to bring a leaf eater. They'll be stuck munching on marinated onions, since I'm pretty sure the tortillas and pinto beans have got a lovely amount of lard in them, plus their senses will be assaulted by the delicious smell of succulent, juicy grilled meat. That smell by the way can be detected throughout the strip mall this place is located in, and without a fail gets me salivating whenever I walk by.   Everything is prepared lightening fast and you can eat in the place or get your food to go. The combos are dirt cheap and delicious, at four bucks for a 1/4 beef or chicken, and seven bucks for the combination of the two. Each combo comes with two torillas, pinto beans, salsa and maninated onions. Half and whole chickens or piles of beef are also available for extremely reasonable prices. They only take cash though, so run over to the Circle K at Ash and University to the money machine if you find yourself with nothing but plastic. The 2.00 fee to use the ATM will be totally worth it.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "dyhTHLIf6eWBvU78Y3T06A"
  },
  "b7QeA9JaBRELTbeVrf6ZCA": {
    "date": "2/20/2015",
    "text": "Wow what a find this place was.  Wanted to write this review mid meal it was so good. Had the half chicken  plate. Perfect example of keeping it simple. Everything abt this was good- the pickled onions especially. Is amazing value for the price. Sadly no place like this back home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nt1jIMsaO6TfDYQrq5Vfkg"
  },
  "qQRG9681hNvqD-VXpb-WZw": {
    "date": "8/8/2009",
    "text": "Seriously I'm not just talking out of my ass when I announce:  BEST Grilled Chicken and Carne Asada EVER!!!  They only serve grilled (beyond marinated) chicken on the bone and carne asada.  Both of which you may order 1/4, 1/2 or the combo with BOTH (all come with corn or flour tortillas)!  Which explains why such greatness that is 5 stars is involved in the concentration on 2 main items.  Now on to the main points:  -Meal will set you back only $4 to $6 bones per person, cash only  -Chicken may be ordered white or dark and is the most flavorful and crispy grilled, ignore the red-dyed skin, it will be the best grilled chicken you have ever had  -Carne Asada is always cooked to perfection, not overcooked or stringy or chewy, always is Carne Asada greatness  -Not only do meals come with your choice of flour or corn tortillas, they come with perfectly salted pinto beans (not refried), fresh salsa, and red onions that seems to have been soaked (not pickled) reducing their flavor to a delicious subtle onion instead of a crunchy onion.  -Salsa is a tomatoey, pureed (not over pureed), juicy salsa that screams freshness with every bite.  -Lastly, the BLISS OF THE FOODGASM experienced when the tortilla/chicken or beef or both chicken and beef mmm/onions/salsa/and sourcream for those that enjoy a lil sin, explode in your mouth with flavors you only dreamed of...is the reason you must GO HERE ASAP",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "zQ8nG2DemIq9cC0zjAMIgw"
  },
  "iQnHvSMcsU1Vt6ihqGg0nA": {
    "date": "9/12/2010",
    "text": "I tried El Pollo Supremo based on a recommendation from my professor. I always though he was a smart man, but after eating here I know it.   For under $5 you get chicken  that is juicy and flavorful and a plateful of tasty sides and condiments. Wrap it all up in one of the piping hot tortillas that comes with your meal and enjoy.   Another testament to the quality of the food is the fact that on my most recent visit no fewer than three police officers stopped in for lunch. You don't get that kind of patronage unless you are everything that El Pollo Supremo is: cheap, fast, friendly, and delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mxf88PS_UJyjd2b-07FXng"
  },
  "ZpitmKOuXCrMjuXajCpW0Q": {
    "date": "1/5/2009",
    "text": "Delicious.  This is Mexican Barbeque at its purest.  You have two meat options:  chicken or beef.  There's no fancy orange-spiced, or other-spiced flavors here.  They offer two things and those two things are so good.  The chicken was greasy, but you know what?  I didn't care.    The main attraction was the beef.  It was so good, I didn't want it to end.  It was one of those moments where I hadn't eaten all day, and when I dove it, I was silent.  I wouldn't have answered my phone.  I got the most expensive thing (I think) that they had there and it was like seven dollars.  It came with chicken, beef, onions, tortillas and beans.  The beans are, meh, so-so and the tortillas are perfunctory but the real star is the barbeque, that's what you come for.  The chicken is greasy, but TASTY.  The beef is perfect.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "2uZ8uULKN38ZiM-Iakr5TA"
  },
  "xZgzgJQsxmvah46Ya3bUFQ": {
    "date": "8/27/2007",
    "text": "Me gusto El Pollo Supremo.   It's always a sophie's choice between the chicken and the beef...each are equally tasty but I must say that my carnivorous soul favors the beef. Unless my soul is feeling especially gluttenous and I order both. Both meats are grilled to asada perfection, served with flour or corn tortilla, fantastic sweet onions, beans and salsa that I could probably eat an entire bucket of by itself.  Speed of service is hit or miss, I don't recommend coming here during any kind of football event but most times it is relatively quick. Just sit down and brush up on your spanish with an El Voz or read the College Times.  The only thing that sometimes prevents me from coming here is that they only take cash, and I'm often far too lazy to go to the ATM.  But if you have some cash in your wallet and want some good, straightforward Mexican food eat here immediately-you won't regret it.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ltIe_eGArzU8b48rKM6yQQ"
  },
  "oI9AX9shV2UUdg-aXY385A": {
    "date": "2/21/2008",
    "text": "I like this place. The food here is like what you'd get at a typical taco stand in Nogales, but without the dysentery.  The chicken and beef are equally tasty, but I tend to favor the beef because it's boneless and less work trying to get it all into the tortillas.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hoCTR-aiEcRJT8asMVKu0w"
  },
  "J_LfOgUKR_aQkQbi0iLqiA": {
    "date": "12/23/2008",
    "text": "I'm a food purist.  Forget the atmosphere, forget the cash-only policy, forget everything but the taste of combining the right amount of salsa, steak, marinated onions on a tortilla and then taking as big a bite as I can fit.    Having few offerings has allowed El Pollo Supremo to dominate supreme in what they do.  5 yums.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "BSJDp9-kCmV4tVtYMJyhGw"
  },
  "iPmvzymkyegLwNqskd_XuA": {
    "date": "4/14/2010",
    "text": "I love me some red chicken, especially the dark meat.  Don't even bother making a soft taco.  Just eat the chicken then wash it down with the rest of whatever is on your plate.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z1Ce1N6F7vw9pKnsv8MtRA"
  },
  "xgYj80XWPbx_ugwlVC0d5g": {
    "date": "9/14/2019",
    "text": "The greatest chicken ever. Seriously. The value can't really be beat either. A whole dang chicken is $15 and comes with warm fresh tortillas, beans, pickled onions, and salsa. Such a great deal for crazy good food.   Bring cash though, no cards accepted.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b05HTysZ-AgGVX2xGDzIxQ"
  },
  "q3OLT43YT7uGmzj7NL-sUA": {
    "date": "8/16/2019",
    "text": "Warning!! Eating this chicken will ruin chicken for you anywhere else you ever eat chicken again, don't say you were not warned.  Ignore the horribly outdated decor and how dirty the place feels and just go straight for the chicken!! Seriously I almost rated this place 5 stars eventhough it's outdated inside and dirty, the chicken is that good!  The flour tortillas are heaven too, don't order the corn.  Also, stay away from the restroom before you eat your meal, the restrooms are always dirty.  Some of you will be in for a culture shock though when you walk in here and feel like you were transported to Mexico, but don't run out before trying the chicken!!  Sidenote, they also serve carne asada here but did I mention the chicken is",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "LzpNHv-o1KKrdO2Cgk5-XA",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Half chicken platter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LzpNHv-o1KKrdO2Cgk5-XA/o.jpg"
      }
    ],
    "user_id": "PeJ5y6WfMXCBWSLex26qFw"
  },
  "nmbO5-QlEhGTuojklEu6wg": {
    "date": "4/28/2019",
    "text": "I have been going to Pollo Supremo in Tempe for 35 years!  This is the longest I have ever been continuously eating at the same restaurant which has NEVER disappointed me (nor my fellow Yelp reviewers).  Same owner, Laura, all these years who always remembers me.  Definitely not for those who want to be catered to: Cash only; only a few tables, they have only 3 simple entree selections.  Their menu has not changed since '83; and they cook with 100% Mesquite: 1)  BBQ Chicken (2, 4, or 8pc. - no \"white meat only\" option, no substitutions) 2)  BBQ Beef (1/4, 1/2, of full pound) 3)  Combo Plate (2pc. Chicken + 1/4 lb Beef)  That's it!  Nothing fancy at all, just fresh ingredients prepared perfectly. One of those \"simple, unpretentious, & home-style\" places that, IMHO, Anthony Bourdain (RIP) would love. The following sides come with either protein: Ranch-style beans, lemon-marinated red onions (!!), and a simple, but tasty fresh tomato salsa; with choice of corn or flour tortillas. You order, you sit down, Laura brings it to your table. You make your own tacos with what you are given. The chicken skin is what I go for first - mouthwatering and oh... so crispy!!  The beef is tender and well-seasoned; always hard to decide between the two, but there is the option of the Combo Plate.  Want spicy? I suggest adding a side of Jalapenos Asados.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "tWHjD7ZZYK1Wy_8b6b_Mjg"
  },
  "j4ROFdI9xdCG1AaSRtPmXw": {
    "date": "9/8/2019",
    "text": "I used to think that Pollo Lucas in Puerto Penasco was the shiznit. This iz the best chicken I've ever eaten.  Stupid good.  Make sure you ask for the roasted peppers.  I don't know what else to say. This place rocks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_yT72pzNZzFaPpOiu6_F_g"
  },
  "PwuTwJiswnWAMskC2S4POg": {
    "date": "4/26/2019",
    "text": "I'd been hearing about this place forever from my sister. They live close, it's delicious...seems to all add up! When we finally got to try it, it was indeed supremo. The chicken is so well cooked and flavorful. You could potentially eat a whole one by yourself. It comes with salsas and tortillas and the four of went to town. 10 out of 10 would have it again. We ordered online and the guys went to pick it up so my expectations was only the food. I'm totally ok with that cause it speaks for itself. Trust me you want to try this place and make it a weekly favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F6wDIDZ58GQvMUIjGxiwTA",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. One picture before the devouring happened",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F6wDIDZ58GQvMUIjGxiwTA/o.jpg"
      }
    ],
    "user_id": "GQ8jQKc5jsvC9tZUaHR-MQ"
  },
  "JY0s1N5GXuAEnpqXgHNF9Q": {
    "date": "8/10/2019",
    "text": "Everything I put in my mouth was delicious. Ordered the chicken and steak combo and I couldn't stop raving! Fresh, flavorful and delicious!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vb0IEmm1g1Lp7EGXrbxJMg"
  },
  "Gvz5_-N4lkvmv1kesBj60w": {
    "date": "8/16/2019",
    "text": "Cash only; the chicken is great, but the steak is phenomenal! Had the 1/2 chicken 1/2 beef plate with a flour tortilla, beans, and salsa. Would recommend, especially if you like wood grilled stuff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LNVfQTuyVfrH6XVamXdrfw"
  },
  "TSO0OVj-cChXde9xH-QPqg": {
    "date": "7/30/2019",
    "text": "The chicken was so dry it didn't taste good. Normally I love having this type of meal and look forward to leftovers. We threw it out because it was so dry.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y4W4dfoBllZcU4hzw82TLg"
  },
  "4RCNB9eI3WWZ5LAku7S2fg": {
    "date": "5/13/2019",
    "text": "They cook on Mesquite wood, place has 5 tables. You can smell the wood outside. Incredible. Simple menu. Grilled Chicken and beef, i have the combo in the picture. Not a fancy place but the owners are on the grill and register and deliver this food with pride.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8cDMudB79usssq7IZ02_Yw",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Pollo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8cDMudB79usssq7IZ02_Yw/o.jpg"
      },
      {
        "img_id": "cFT20cS4ZRosQeGBp4m8DA",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Pollo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cFT20cS4ZRosQeGBp4m8DA/o.jpg"
      },
      {
        "img_id": "6XRBuvg0wsMW4IJhjylvrQ",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Beef chicken combo flour tortillas. Beans. Salsa. $9",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6XRBuvg0wsMW4IJhjylvrQ/o.jpg"
      }
    ],
    "user_id": "fAhHUswOTmNMAEIhke6QZA"
  },
  "KLmm_B9C-SE06IZTbb56qw": {
    "date": "1/22/2019",
    "text": "No frills...a True hole in the wall kind of place when you're looking for a quick place to grab a bite. We came around 6pm and there was plenty of parking up front. We ordered the chicken and steak combo from the counter and chose our table. The plate was brought out to our table. The chicken (leg quarter) was kinda dry but the steak was delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "WSptrgW8NLFBNvw1FOpifw"
  },
  "YaM5WOjsq9sKBEt6v-AFxA": {
    "date": "5/18/2019",
    "text": "Tasty with a huge amount! Will definitely come back when I'm hungry. Cash only.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jS550j6VaDSwxHSJwGR2VQ"
  },
  "K0XABgzZtPeaJKm2GrnBxg": {
    "date": "3/18/2019",
    "text": "The mesquite roasted chicken here is phenomenal! El Pollo Supremo has the ambiance of your typical \"hole-in-the-wall\" restaurant but the chicken more than makes up for it. I recommend skipping the beef, which is okay, but nowhere near that specialty of theirs-- El Pollo Supremo indeed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "be8uoQm0n8Y0FIaTmJk2oQ",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/be8uoQm0n8Y0FIaTmJk2oQ/o.jpg"
      },
      {
        "img_id": "UqciU6vV9nE3x69_an-VTw",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UqciU6vV9nE3x69_an-VTw/o.jpg"
      },
      {
        "img_id": "gSpwQr-uxvb1Uy-UBIRwvQ",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. Whole chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gSpwQr-uxvb1Uy-UBIRwvQ/o.jpg"
      }
    ],
    "user_id": "DMyWyIFK5yh2arrgcr7Knw"
  },
  "f5516hxhAv_1BClsjfEW_Q": {
    "date": "2/28/2019",
    "text": "Best Chicken in the Neighborhood .. And there are 5 chicken joints in walking distance to my home. Mesquite women and the same 2 people working and smiling for years. A must!   Bring Cash",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y7UPZdO2xoFDENxFIBfn1g"
  },
  "x9xFgV9qLYmhpDO6cmwoSg": {
    "date": "4/23/2019",
    "text": "Another hidden gem. I have been eating here for years. I always order the combo meal. Both the steak and chicken are equally packed with flavor and I can't say I would choose one over the other. Not to mention the homemade salsa and pickled onions that come with . Throw it all together on a corn or flower tortilla and enjoy! There is no other place in town you can get food like this and at such a great price!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fvZAsxHyamBQg6a-qUpiA"
  },
  "M4kQaGNqkd2fu0xTycVR2Q": {
    "date": "9/13/2018",
    "text": "This was the most amazing food I have had in a very long time. I don't usually take the time to make comments about restaurants but this place was so incredibly good that I felt I must let everyone know.  The menu is very limited. They have Chicken and/or carne asada. Each plate choice comes with simple but amazing pinto beans, corn or flour tortillas, marinated onions and super fresh, AMAZING salsa.  There are a few other sides available. I didn't order any of them but I can only imagine they were good.  If you took the time to read this I would recommend that you immediately put your phone in your pocket and get over to this place. If you do I'm sure you'll be back a few times. It's amazing!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4b2Q648auou-K4KvuS8dlw"
  },
  "PA1ihvianb1rohzWWALtUQ": {
    "date": "9/30/2018",
    "text": "Limited menu so what they do, they do very well..  Grilled chicken and/or beef.  Homemade salsa, pickled onions, home made flour or corn tortillas.  Everything is AMAZING!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gosp0i805t8o5diY_1pfPw"
  },
  "7TvHSj8DkvfpM8WCXGkVsw": {
    "date": "12/28/2018",
    "text": "This place is a real treasure. I would have never known it existed if my daughter hadn't insisted on driving 20 miles to eat there when she was visiting from out of time. The menu is simple between chicken or beef and then some sides to pick from. Everything is homemade and tastes like you are in a family home. The pickled onions are amazing as are all the sides. The chicken is so tender that it just falls off the bones and the flavor is savory and delicious. They only take cash, so make sure you are prepared for that. This is a simple place. You order at the counter and then you can eat there in a booth or take the food home.  I highly recommend this place. I've heard that they can run out of certain items later in the day, but I have not personally had that issue.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cKx1zgbvtqpluSKySiZp_A"
  },
  "ER_tc-6SSh2JbH73jEi7kg": {
    "date": "12/30/2018",
    "text": "Stopped in last night and tried the combo plate (1/4 chicken and 1/4 lb beef.  It came with salsa, beans, pickled onions and choice of corn or flour tortillas. I ordered a small rice.  Meat was loaded with FLAVOR.   I mean it was moist and packed with delicious flavor.  Also tried the Horchata it was sweet and cinnamon.   The only down side is this place is 30 miles from my house.  It is located off of Ash and University so I was fortunate that ASU wasn't packed over winter break.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "iU9l8MargxocKRH9ZVoyvg"
  },
  "oU2GEhIHXQWI6CAUxywqmQ": {
    "date": "7/7/2018",
    "text": "The food here reminds me of my Tata (grandfather) and Nana's (grandmother) old school Mexican cookouts and family get togethers. As they are no longer on this earth, this place somehow makes me feel connected. The grilled Steaks and Chicken are Sooo tasty! Then there is the mexican rice. and Whole beans both of which are almost a ringer for my nana's old recipes.   The pickeled red onions compliment the meats. The fresh salsa is amazing. Homemade tortillas with the burnt spots are so Nogales. Love it.  Cole slaw and Potato Salad both great as well. Glad to have finally discovered this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "0fTwR6cAPJqnHcJf6ZOdsA"
  },
  "wXDAwcsntkmtz8UjElemOw": {
    "date": "3/25/2019",
    "text": "This is a place my roommates and I loved when we were at ASU from 1988-91. I recently returned with my son to visit campus as a prospective student and was surprised but very happy to find them still open in the exact same spot and still turning out the delicious and no-frill chicken and beef dishes. The chicken is spiced and cooked to perfection and the beans, tortillas, and salsa are the perfect accompaniment. The surroundings are appropriately low-budget, helping to keep the price low. My only concern was the upscale encroachment on all sides, leading me to wonder how much longer they'll be able to hold out in the face of gentrification. I wish them a long life and was happy to get back in after 28 years to introduce a new generation to EPS.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NYf37RfjQD0pICt5mif4OQ"
  },
  "YqGT-LwZrTv3gFbJUE5wRw": {
    "date": "7/1/2014",
    "text": "Tonight was my first time at this restaurant and I must say the food was not only excellent but, with excellent customer service.  We spoke to the son for quite a while and he was such a joy to talk to.  We found out the history of the restaurant. He had such a great attitude. We will definitely come back to this place again. I will refer my friends to come to this place. Pollo Supremo muchisimas gracias por todo. Bien rico!  Esther y Jim",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FDukaw32MyawQ0RIRJlQTg"
  },
  "JpXma-uQkJgvZBCBJ1iZ4A": {
    "date": "5/22/2013",
    "text": "The food here is awesome. I always get the half chicken. If you get corn tortillas it's a healthy delicious lunch. Remember, it's cash only.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nY9Ao682pYS-Mqsu6hW8Wg"
  },
  "TQxzVT-lSZ0k1YlawIS_6Q": {
    "date": "3/31/2016",
    "text": "This is the best authentic Mexican food I've ever had. The prices are fantastic, and the host is so sweet. This little place has a very limited menu, but they have perfected their items.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iBE83j_TzmA6mha-uHAxbw"
  },
  "nQWNGbgbeMysI4yTXwmhUA": {
    "date": "3/10/2011",
    "text": "We stopping in for a quick meal and split a half chicken.  The chicken was very tasty and similar to Tandoori Chicken.  The outside was flavorful and dry-ish while the inside was juicy.  The skin was extra crispy too.  It is definitely some of the best chicken in town.    We did a little build-your-own tacos with the pickled onion, salsa fresca, pinto beans and corn tortillas.  It was refreshing to find a Mexican joint that didn't bathe their beans in lard.  Two of us split the half chicken and left satisfied.        We were there at 8 15 and they flipped over the closed sign around 8 30 even though the hours on here say open until 9p.  May want to call ahead if you are trying to get there before close.     CASH ONLY",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ykY7aVvXlNgKpnbNjhUciA"
  },
  "-bjfx4aHNjqe273oiaupcg": {
    "date": "9/6/2011",
    "text": "I've been taking my kids to El Pollo Supremo for YEARS! They love it and still go as adults.  I love the marinated onions, the homemade salsa, the flavor of the chicken is better than any other chain grilled chicken.  The cost is great and I've always received great service when we go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GDM0CCXdMD0xFJdmvklnsQ"
  },
  "oqMaMSfAlCmTRUc6KwrBUA": {
    "date": "7/10/2013",
    "text": "I had high expectations after reading the reviews from my fellow yelpers, but.. not sure if it was because I stepped in later than a usual lunch time (i.e. at 1pm..) or what, the quarter chicken I ordered was NOTHING close to \"juicy\". On the contrary, it was so dry, I had trouble cutting through it with my plastic knife! ALSO, I had to continuously dip it in the salsa just to make the meat edible. The flavor was good, but WHERE is all the JUICE in the meat?   This leads me to think that, albeit being nice and friendly, these folks just couldn't care less about the consistency or quality of food they serve. Two stars, done-and-done.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6A_Cc7ispiwTxObuCvkBg"
  },
  "zv_AXdRUq3_O3fnhpg6xlw": {
    "date": "2/10/2016",
    "text": "get the beef, you won't regret it. don't forget cash and don't throw a fit when you don't like their cash policy. a business can run how it wants. (I've heard way too many people get upset)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fp35VCgGulLF4QoTHcQWiQ"
  },
  "KEb3P1uvRwdwn4UvGebkRg": {
    "date": "4/19/2014",
    "text": "Been going there for over 20 years, when my sister comes back to town she has to stop. Always good, clean, sometimes very busy but worth the wait. The guys in my family and friends circle especially like the grilled chicken and meat. my vegetarian friends love their bean and rice. A plus, you support Local, they are local family owned and operated.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v2jmi7W7Z3XZ_9Sl-fir7w"
  },
  "D_Cgn2TnqSmgW7EuE-dWVw": {
    "date": "1/31/2014",
    "text": "My family and I have been going to El Pollo Supremo for at least 20 years and it is the best kept secret in Downtown Tempe.  no mater fi you're local, or a traveler this is about as authentic as you can get this close to campus.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xK3LfgHZuV8-Ps4Qkr4Hvw"
  },
  "StAk7sPTbaAcNqNz3lAGcg": {
    "date": "10/30/2013",
    "text": "So good, I eat here at least once a week and never tire. The pickled onions are crack! Chicken and steak both marinated, freshly grilled deliciousness. Beans, rice, and salsa all delicious a fresh too. Cheap and high-quality. Combine tortillas, rice, steak, onions, salsa and sour cream to make tacos then thank me later. Crazy good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e20odwMKY7UqopQkNC3nLQ"
  },
  "eEsZ4abcuq29NoxcT9VMfA": {
    "date": "7/13/2011",
    "text": "HOW DID I NOT KNOW HOW AMAZING THIS WAS? Occasionally, a restaurant comes along that makes me want to run around and bang on the doors of all my friends' houses in Tempe and yell, \"WHY DIDN'T YOU TELL ME?!\" On the other hand, considering my affinity for delicious well-kept secrets, I suppose I respect that there are places in my neighborhood that I have yet to discover-- and will leave me satisfied and wanting more at the same time!   OK, to reiterate, this is a hole-in-the-wall. That means you should have no expectations about things looking remotely nice. The first time I walked in, there was a smelly bum asleep on the waiting bench inside. He wasn't hurting anyone though! I thought it was strangely sweet for the staff to let him have a little nap out of the sun... I have simply gotten take out both times, which is quick and painless. Now, a birdie told me that the owners of this place are related to the owners of Restaurant Mexico--which is irrelevant to the food, but it's nice to know about the little connections around town! The talented and tasty apple doesn't fall far from the tree in that family.   So-- the FOOD. The chicken is marinated in baby kisses and rainbows before it is mesquite grilled, and I hear the onions are pickled in jalapeno juice and vinegar. Together, that makes these two items alone truly the most delightful combination that man has ever known. I definitely recommend extra onions. The beef is nothing to scoff at-- it's seasoned, thinly sliced and tender.  The beans are beans. The prices have gone up recently and the combo plate (chicken, beef, beans, onions, salsa and fresh tortillas) now costs $7.49, while additional 1/4 lb meat options are up to $3.99. I will definitely be a regular from here on out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "a7Z_P1SGRAbeOf2NxpbGsg"
  },
  "byxt5JRLJaZ9HoHS3aEMOg": {
    "date": "4/3/2013",
    "text": "Tri tip  is very good  !!!! Hot tortillas!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4sbYhwTFs8qdhhYbloN30A"
  },
  "feGUsdYWPfxVugfi-e2pwQ": {
    "date": "10/5/2011",
    "text": "Man I love this chicken. Their menu is not huge but man is the chicken good. They marinate the chicken and then grill it. I comes out and is red but that is due to the marinade. It is very tasty and juice. I order the 2 piece chicken plate which comes with beans, salsa, 2 tortillas, chicken and marinated onion. Mmmm so good. I have had the carne asada too before but it was a little dry for me but also had great flavor This is a CASH only place, so stop before going.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jIlbndTaH6bhOYyIGJFL2g"
  },
  "Oi1vXQtM9sZTNtQ1l3GXHA": {
    "date": "9/7/2013",
    "text": "I was surprised how much I liked this place! I had a quarter beef and it was delicious. Not too much food, and the price was right!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fH1TpgVyMuQcColrknmbZA"
  },
  "mBTmKyHb0NPqm_vRrc94AA": {
    "date": "1/12/2015",
    "text": "This place is amazing! My family has been coming here for years and the food is always delish and cheap. Anything you order comes with the supplies to build your own burritos. I especially recommend the chicken, don't be thrown off by the bright red color, it is incredible",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ErJL_UfkSCJKVgYfujPGw"
  },
  "h90a0hE39TGqqWIbwJbUNQ": {
    "date": "11/26/2012",
    "text": "A divey Mexican place that only serves chicken. It was ridiculously cheap and actually quite tasty. The place has obviously got grilling chicken down and the sides such as the onion complement the chicken very well.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "w4MlcTNAqVLePZFb3DuiEg"
  },
  "YvJ4Q0zLM2zLJd5jywA48w": {
    "date": "1/26/2011",
    "text": "I've heard good things about this place, so I finally got around to checking it out. (Tip: As other people have noted, this place is cash only.)  Anyway, I just finished my meal from there and I'm so excited about it, I had to post to Yelp!  Since it was my first time there I got the combo, which includes two pieces of chicken (breast and leg), and a decent portion of carne asada. Both were amazing, but the star here is the restaurant's name-sake. The chicken was moist, tender, salty (in a good way) and just all-around flavorful... and the crunchy skin was delicious.  I ended up eating the chicken by itself and saved the soft, doughy, warm tortillas for the carne asada. It also came with a side of salsa, onions and pinto beans. The pinto beans were nothing to be shrugged off either, probably some of the best I've ever had.  I am now left stuffed and happy - and all for about 8 bucks. I think I could easily go back and probably just get the chicken sometime and be just as satisfied for even less money.... or the carne asada when I'm in the mood for that. Either way, I'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yE4dTCWmBNoCrbbFvn8LQg"
  },
  "OFHAdB4g4TPSHqjI7uhgZw": {
    "date": "7/12/2011",
    "text": "I'll just echo what everyone else said.   It's really good.  The chicken is red.  The skin is crispy and amazing and it's not greasy or fatty.   The chicken is better than the beef (in my opinion).   Pintos = very good.  Marinated onions = crunchy and good in tacos.  Corn tortillas = warm and soft  Get it to go, because you're not gonna find ambiance here, but the service was good.   Warm, simple, cheap, delicious. Mmmm.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XFAicPSIGX_pd23rkMBNXw"
  },
  "z7z6HDDRMhvsI2yL2NMQwQ": {
    "date": "3/1/2015",
    "text": "Amazing mexican food! Dont forget about the macaroni salad and the beans. The Carne Asada is my favorite. Absolutely love the people that work there. I was almost 1$ short on my order and decided to downsize my beans. She refused and gave me the full order with a smile. It is nice to have local businesses that still care.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "usGBqIQjogfyZ-T0FnMDuA"
  },
  "Apejhom3iVvgyUgLod5mSA": {
    "date": "7/15/2015",
    "text": "I had read reviews about this place and was really curious to try it out since I was in the area. I'm so glad I did! I ordered a 2-piece chicken combo to-go and a side of grilled jalapenos. I appreciated that the wonderful woman working (who I believe owns this place) was nice and honest--I asked her if the 2 piece was enough for 1 person and she assured me it was plenty. She also didn't try and convince me to order extra sides or drinks. The chicken is really delicious and reminds me of a WAY BETTER fresh version of El Pollo Loco. They give enough tortillas for the whole meal and the overall portion of my 2-piece combo was great for under $5. Also, those jalapenos....yum! My only personal complaints: 1) Although it was lunch time and there were definitely a lot of people eating, I waited for a pretty long time for what I had expected to be a pretty casual/quick meal and was late to a meeting. That said, I will just order to go next time I'm on a time crunch. 2) I like the way the salsa tasted but it looks like it might be canned/some of the ingredients are canned. I grew up with home-made salsa and am pretty judgmental about salsa at Mexican restaurants. It's still yummy, so whatever. Definitely a great place and amazing prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jSs2q7mM_L9ZdBxgJ_gV7g"
  },
  "5s1BsWYK_KvaAHPr4A2sCw": {
    "date": "5/9/2014",
    "text": "I've been to this restaurants a few times now to get some take out & it's starting to deteriorate in quality. The chicken was always plump & delicious along with the beans & salsa. Lately, however the size of the chicken has become smaller & the last couple of times the beans were really salty. Very disappointed in this, especially because the food was worth the money .. Now, not so much.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CjhTdmN6qWEKC7Zo6qadow"
  },
  "n0vunR4H7LivK6Cq2OgC8w": {
    "date": "12/22/2013",
    "text": "Forget chimichangas or burritos or other gringo Mexican food, when it comes to our \"signature food\" here in Phoenix.  I would instead say that our real signature food is grilled chicken.  We do it better here than just about anywhere else, and El Pollo Supremo is an awesome example.  There is no need for a complicated menu here.  I don't even know anyone who has ordered the asada beef, though I'm sure it's probably pretty good.  The chicken is the real deal, so that's all I have ever eaten.  Every meal is the same... chicken, charro beans, homemade salsa, pickled red onions, and a pack of tortillas.  And every meal is really tasty.  It's amazing, and it's very cheap.  Cash only!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UaW4trsb7ig3LOPvNOHCVA"
  },
  "rW1cJVQMJb2Q-nTM1Pye9g": {
    "date": "8/1/2014",
    "text": "A friend of mine gave a speech at Toastmasters on whole the wall restaurants that he loves and this place, was on the list. I could not disagree because I, I love it as well. The chicken and beef is cooked above a real wood fire and it is delicious and the price, it is low, low, low! However, bring some cash, I don't think they accept cards.   I'm not a huge meat eater so I usually don't get the chicken and beef combo plate but I do get the next level up on the chicken plate (I think three instead of two pieces, or some such situation) and then I save the bones for when i make chicken stock at home - as they are perfect for it having been wood fire roasted.  The beans here can be a bit on the salty side but love the homemade salsa and the pickled red onions - I generally pull the chicken meat from the bone and wrap it up in a corn tortilla (you can get corn or flour) with the salsa and onions, and it is wonderful! You can eat at the restaurant but many people get the meals to go and take them home, which is how I tend to roll.   Look, this is not high-class dining but it is a solid example of the beloved hole in the wall and the people behind the counter, always friendly. I've ordered meals from here many times and will order many more - grilled chicken at a great price, try it out and share you what you think of the place. :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UyuWAvDcLp4zU1Wfc1PNXg"
  },
  "TEk1OQXWNthnHaHBQFt9Jw": {
    "date": "7/8/2017",
    "text": "This is everything all said.  A small little hole in the wall with delicious food.  The chicken  is cooked over an open pit right in the restaurant. We offered the  combo as was suggested and was not disappointed.  Will be back next time we are in Phoenix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jG0MMXFIZTxzzvOgbwnGLg"
  },
  "8xdux5ElAyHxtZQZCiuTHQ": {
    "date": "2/12/2016",
    "text": "Combo plate. Mediocre at best. Salsa isn't salsa. It's pureed stuff and smells like grass clippings. Wouldn't dare taste it if you paid me. Meat was below average. Beans are just boiled and I'm not sure who wants to eat pickled onions on their own. Waste of money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m8vzTbQJRIO7D7RW9G0M1g"
  },
  "e6IFqJxvZzcq3yPwPHpQWA": {
    "date": "2/8/2015",
    "text": "You want awesome street tacos?  COME HERE!!  Just down the street from ASU. Their steak and chicken is delicious and the tortillas are awesome too  I wish I had known about this place sooner",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6UBvIW7cl8VGmvy4-v_Q1A"
  },
  "cpk1_fNbjnXkp3qUccmvww": {
    "date": "7/2/2016",
    "text": "I have been coming here for maybe 25 years, since I was a kid.  I'm visiting Phoenix for the weekend and had to come here.  It's the exact same and still amazing.  If you are looking for over done,  hipster, this is not it.  If you are looking for amazing mesquite chicken that will leave a lasting impression,  you won't be disappointed.  Just try it,  you'll be happy you did.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tsoFpOW25i85qpUy4EXGWQ"
  },
  "xefYbs0x75a1F7JySv9Now": {
    "date": "5/20/2014",
    "text": "This is a local spot with the best chicken in town. Only serves a few things. Cash only!!! Very casual! It's packed at lunch with workers. Most dishes are served with onions and beans. I like a side of sour cream and make mine into tacos. I saw David spade last time I was in. There is an ATM in the shop next door if you need one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P61PKcYwJ3paZZTHWtizRg",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P61PKcYwJ3paZZTHWtizRg/o.jpg"
      }
    ],
    "user_id": "WCwsJkBYRVls1e9-DmQKcw"
  },
  "fFonicPKatDktAdErFkwZQ": {
    "date": "5/15/2017",
    "text": "Great food, great service. Cash only so hit the ATM before you visit.  Hey have a very simple menu and it's all good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f9X9XKf4hvNzWzSvon3w6A"
  },
  "i97N173CkP3bbCwba2Thaw": {
    "date": "1/17/2016",
    "text": "This place always delivers.  I've been consistently enjoying it for 15 years, others I know for even longer.  Its different than other Mexican joints in that its all grilled and there are really only 3 or 4 options on the menu, which is great.  They do a few things and do them well, ALWAYS.  Portions are massive, tortillas are traditional, and you never leave here hungry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4SgysgtsIa72eC1RSuB2YA"
  },
  "4qrUZtQtisW3PFiHCp4zOA": {
    "date": "10/13/2015",
    "text": "Really good flame broiled chicken!  Bring cash because they do not except credit cards!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lW4-fwht1tzBJ1aDUr0o4Q"
  },
  "fsBJk2gRyCGLSHc35ht-ew": {
    "date": "11/22/2015",
    "text": "I don't even want to mark this as a one star. The food arrived cold and the This order and the service provided was atrocious. The delivery was well over an hr and 15mins from time of order. Several items were removed without me being notified as I would have cancelled my order if that was the case along with the horrendous wait time. And the delivery portion was shockingly unprofessional. The delivery guy pounded on my window instead of knocking on my door and was not apologetic at all. Even my neighbor came out after and asked if all was okay as he too was alarmed. I am 120% dissatisfied with this transition and the Un-professionalism that took place.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YDz2u_ksQFI6X7N4ssUBNA"
  },
  "P_hnMMflIgSp20LjLTabeg": {
    "date": "9/25/2014",
    "text": "Tried it out tonight.  Honestly, It's good, but not as good as what I have imagined. Maybe an average good Mexican grill restaurant. Still I would recommend it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uIHM2sJs_ArYe8QkzFJaTw"
  },
  "9Z1XDFVRP3djnf1Ozv3e8g": {
    "date": "5/19/2017",
    "text": "Every time I come to Tempe I make a stop at this institution for a 1/4 chicken and 1/4 beef. It has never changed as far as I can tell and has never been anything but delicious. Red chicken for life.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d5-fL52Pr1WJSOk_aQQaCg"
  },
  "F-wfstlOhT4mlgG3fcf0Pg": {
    "date": "8/16/2013",
    "text": "Delicious chicken barbecue! Although time was a factor, it took 5 minutes for me to be assisted. Although, the food was worth the wait. I ordered 1/2 chicken that came with a choice of flour tortillas, pinto beans, Salsa, and pickled onions. I satisfied my thirst with a refreshing Jamaica drink. I took my food to go as the establishment was a bit crowded. I enjoyed the chicken. It was crisp where it needed to be and still moist! Eating it with tortilla and salsa made it heaven. I'd definitely come back here and highly recommend this place if you enjoy a good Mexican plate.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Q6QX-kpKUHfeWoQPxITVaA"
  },
  "Q8ElO_FZQljy-kMw5Kj0hQ": {
    "date": "2/23/2017",
    "text": "Have been going there for 5 years now. Not much has changed. Solid flavor and value for money. Their spice level is to the spot. Aah can't forget having their chicken after a few beer in cartel!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1nstTQdLihxPnmxuE89vsA"
  },
  "MxskpXmEU4y61C9KTrj-2A": {
    "date": "4/27/2016",
    "text": "This is as close as the chicken that you will get in Mexico this stuff is to die for you can't even simulated  at home with the El Pollo Loco seasoning salt. we go to Rocky Point Mexico and gotta stop and get the chicken in town right on the Main Street it's killer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pBuq5Xr4JhUCirwfUjbtsA"
  },
  "wm5RX1kCvMlwy5rn6IINWQ": {
    "date": "4/10/2013",
    "text": "3 stars stands for A-OK, and that's exactly how I feel about El Pollo Supremo, it's A-OK. I love hole in the wall type of joints, especially when it comes to Mexican food. I was expecting to have my mind blown with delicious chicken and carne asada, and while it was good, I didn't think it was as spetacular as others were raving about.  Maybe since we came in here on a Sunday and not during normal lunch hours during a busy lunch work week, maybe the food was sitting out, allowing the chicken to dry out...just perhaps that was the case...but seriously, my chicken was really dry. The carne asada was pretty good and seemed super duper fresh. The beans, tortillas, and pickled onions were all good. Again, the food was okay, but nothing to write home about.   The service is super friendly. I believe El Pollo Supremo is a cash only place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZoXOhuVmh4bG1qfzW_aOIg"
  },
  "HehZGuQqw9AqB18PDvlt3g": {
    "date": "4/8/2016",
    "text": "It was very good! Had the Combo Plate-- wish the beans were refried but still good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2yuRkC5MpTiaLfaSv-DAmA"
  },
  "gsbYmI5ZosTe2fUteitjCg": {
    "date": "4/16/2013",
    "text": "Another business that doesn't get it. First off, I walked in here and the cook was in the middle of rolling the garbage cans outside or somewhere. Then I start looking at the menu board and the cook appears in the kitchen window offering suggestions, but failing to wash his hands. In between those two instances, I ask the Mexican women if there is a combo that doesn't include their nasty, fatty beef? Nope, whatever the menu says cannot be changed. So, if you want their chicken then you have to order everything ala carte, but if you want their chicken and beef then you are allowed to get the $7.99 combo? Makes no sense, but I hope for the guy's sake that ordered the whole chicken right after I left that the cook washed his hands, but that would be wishful thinking for this unfriendly dive.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ELcQDlf69kb-ihJfxZyL0A"
  },
  "UucaOjtMj8xFYLeBofSsNg": {
    "date": "7/2/2015",
    "text": "Decent but not any better than El Apollo Loco and the owner lady was very rude and messed up our order.  This place is also a health hazard. Take a look around on the doors and bathrooms. So gross!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m35ODBrr76JYr20nxoMg_w"
  },
  "zygSgqY6ts5ac4UbpQePhg": {
    "date": "6/15/2015",
    "text": "Best carne asada in all of phoenix. Although the condiments are basic. They are really good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pKFkWC41K5oyWh6IhlJgwg",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pKFkWC41K5oyWh6IhlJgwg/o.jpg"
      },
      {
        "img_id": "I_Q-6vB6Z_cwPHHkVs98Xg",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I_Q-6vB6Z_cwPHHkVs98Xg/o.jpg"
      }
    ],
    "user_id": "J8JuNduJA0ohSGLxw04QXA"
  },
  "jU1LgkXkiknx8kRtNn_hQg": {
    "date": "11/13/2016",
    "text": "I love this find.  I'm on a paleo diet so so happy to find this place.  Meat salsa and onions are enough and the taste is delish...shared this with my fellow Crossfiters",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6t_LB2eUtvRoD-IfWqBPaw"
  },
  "knMZcdXcrWAc5nbUjA-U8Q": {
    "date": "4/22/2015",
    "text": "I stopped by here for the first time today and fell in love. This place is as close to authentic Mexican street food flavors as you can get in Tempe.   While the menu limits you to two options (chicken or steak), the food flavor is so good you won't mind the limitations. The fresh salsa and the marinated onions remind me of home. They are absolutely delicious. The only thing that would make the food better would be an ice cold beer.   As for price, I got the combo plate and a drink for less than ten dollars. It was more than enough food to fill me up.   This is definitely going to be my go to place for Mexican flavors when I'm away from home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ojROs-lOeI65y-Qzxcfndw"
  },
  "Hv8HrU5MGW2ULGhLZCbNWg": {
    "date": "1/24/2016",
    "text": "Love this secret hole in the wall, and I'll definitely be going back in the future. To be clear though: it's not the place to take your snobby, uptight, possssibly racist mother-in-law if you want her to think of you as a \"proper young gentleman.\" Bathrooms are narsty, cashier doesn't speak English, and the menu looks like what you'd see at some concession stand at a beach. (I personally interpret this type of atmosphere as \"exciting.\") But the food is amazing! Super flavorful chicken grilled up before your eyes, surprisingly cheap too. If you're adventurous, enjoy tasty food, and don't want to break the bank, check El Pollo out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V7sCRk1amsM16Tgn8tCbrw"
  },
  "2UFJ9ig9wx27JDNlZzqfAQ": {
    "date": "6/4/2015",
    "text": "After driving 30 minutes down here I was expecting something better honestly, the yelp pictures really invited me to try them, but when we order the chicken plate, I found it was over priced and tiny, a couple of cold tortillas and 2 small pieces of dry over cook chicken with a hint of beans. Salsa was not so good neither. I found this place dirty, and unsafe because of the amount of homeless around the area... I think the only good thing that I can say is about the staff they were nice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gyAXK11G2HJcjekU5gQtaA"
  },
  "wQb10w28xdRdatVgFN_Elg": {
    "date": "7/11/2014",
    "text": "If you believe the 5 star reviews on this dive, you are \"El Schmucko Supremo!\" NOW I am truly convinced that yelpers in the Tempe area either have no taste buds or give 4 to 5 stars to immigrant restaurant owners out of patronizing liberal sympathy. What is wrong with you people??? This is a filthy little luncheonette serving up chicken that is too dry to swallow and beef that is so tough you can't even chew it! They give you a little salsa on your plate and charge you for tiny pre-filled cups if you want any extra. The woman behind the counter was utterly unfriendly and did nothing but jabber in Spanish with the cook, caring nothing about whether I was happy with my food or needed anything else. This place does NOT qualify as a restaurant, Mexican or otherwise.   The lack of authentic non-chain Mexican food in Arizona, particularly Tempe, is shameful, tragic and  pathetic. What disappoints all newcomers to Arizona is finding out that the state's proximity to Mexico and its large Mexican-American population has NOT resulted in it being a place where one can find great Mexican food.",
    "rating": 1,
    "rated": {
      "funny": 7,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "8zvoABdUO8RXM-CUvpp7iw"
  },
  "epQoYH__3aLGVWj2dzZExA": {
    "date": "10/12/2014",
    "text": "I'm originally from Southern California so I'm a big fan of good hole in the wall Mexican food. The staff here is nice, it helps if you speak Spanish which is another thing I miss about these places being from SoCal, but their pollo asado is awesome. The food is basic, beans, chicken, tortillas and rice is extra. It's good, comfort food and very flavorful.   As a plus, its probably in the best strip mall in Tempe, next to an awesome comic shop, Otto's Pizza and Cartel. Give it a try if youre in the neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "w0B7U_-vU2y7O2rpzR2nbA"
  },
  "oEJ1zjC7JvdECChZe0jchQ": {
    "date": "9/10/2016",
    "text": "I have driven straight from LA to eat here... I love the chicken with all my heart. The service is shit, and whomever was behind the counter last month really doesn't care about this being a successful business. I called in, requesting yummy chicken. When I arrived it was a 40 minute wait for more chicken, why? Because it's so delish that people had ordered all of it and left nothing for me! The chef is amazing and should be considered royality. Of course I went around the corner to Casey Moores for a drink. No problem.  I'll wait. I just drove 7/8 hours for yummy food. The tortillas are seriously the best, better than LA... Yes seriously. This could be the most basic menu but they do it well. Much love, and fire the chick with the attitude working the register.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "84JJ49hgZrO5tXX74Nu5Qw"
  },
  "aNbA5sqeLw7r2asi-JfoKA": {
    "date": "9/8/2012",
    "text": "Ghetto but spectacular. I constantly wake up craving their beautiful red and seasoned chicken cooked on an open flame.  This is my favorite make your own burro type of place that I've been going to since I was little.  Don't expect chimichangas and re-fried beans cause that's not their style. They have a small but satisfying menu consisting of mainly chicken.    Only downside to this place is that it can get pretty toasty when the fire pit is going and it's the middle of summer.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4PfNYZoVhD1AU4s5CVF33w"
  },
  "gBlaR3ssbHNLR1A2ldRN-w": {
    "date": "12/16/2014",
    "text": "I have been coming here since I was a kid and it's the best beef and chicken I have had. It's one of those hole in the wall places that I love, they always have the best food !  I love to get the combo plate with a side of rice and sour cream trust me you can't go wrong",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Glt4icu8iGdaofZ396xYIg",
        "caption": "Photo of El Pollo Supremo - Tempe, AZ, United States. 1/4 beef plate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Glt4icu8iGdaofZ396xYIg/o.jpg"
      }
    ],
    "user_id": "O8hF62zCU-7jBZzTreDEew"
  },
  "oBL29YFGGVvaZ4aPNYgQjg": {
    "date": "10/30/2016",
    "text": "Best place ever, been coming here since I was a kid and the combo plate taste just as good as when I first had it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kzAAhpGs3_Rsdzvu43zSAQ"
  },
  "X32w_hg8Ji45jg-lEcIN0Q": {
    "date": "3/8/2015",
    "text": "TIP: cash (or check) only, so stop at the ATM before you get here.  Came based on a friend's recommendation, location is completely nondescript, easy to miss.  If you can't decide if you want steak or chicken - pick both! they have a combo plate.   this is a no nonsense hole-in-the-wall serving good Mexican food. If you've been to El Pollo Loco, this is what the non-gringo, non-franchised, non-commercialized version would be. (And I l admit, I like the occaisonal El Pollo Loco, there is always a place and time for that kind of food, usually potlucks, but anyways - I digress)  this is a good mid-week work lunch spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i1y_-2QqluZx_bGJUGtiQg"
  },
  "9_TN-_J57T71prjj9Sh43A": {
    "date": "10/31/2016",
    "text": "This place is the best hole in the wall chicken and beef place I have ever been to. The ladies at the counter are wonderful and the food is simple, fresh, clean and delicious. My favorite is the beef, but the chicken is also out of this world. I love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Thv9fQBcBX3267637cb9xw"
  },
  "F2o3_VSww8kmHraKE10-Sg": {
    "date": "3/3/2016",
    "text": "Just one word..\"Awesome\"... They only take cash but let me tell you it's worth the inconvenience .. The chicken is just WoW and the carne asada is right behind it ... Get some for the family to go or stop in and get your grub on Generous portions .. I give it 7 stars if I could",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5wm5MZ6KQF6yBRa67vVSZQ"
  },
  "HFNEsEVK51G68eQK86xY3Q": {
    "date": "2/2/2015",
    "text": "I love this place, reminds me of this small joint in Mexico with amazing food. I always get the half dark meat chicken, 2 jalapenos asados and corn tortillas, the salsa is tasty and the side of onion are delish... Make a taco and you are set! I only wish they would sell liquor here! That would make this place a gem in the Tempe area!  I honestly don't see why this place has lower than 4-5 stars. Maybe those people don't really like authentic mexican food. Well either way don't pay attention to the star rating... Just stop by and enjoy this amazing food.   Cash only!!! Or there is an ATM at the smoke shop right next door.   No picture today as I sat and inhaled my food today. Next time I'm here I'll post a picture.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLvC_BGa0dw3HWGVhz2YkQ"
  },
  "ZUKeQfKlYKSPzcJFG-IX5w": {
    "date": "8/1/2016",
    "text": "i wish the portions were a wee bit bigger and the cup sizes could use a boost in too. Aside from that the food does not disappoint at all. small cozy place with great food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J3rmGtqYgPZzh9l5q3O3WA"
  },
  "mpCKChwflfkt6L-VIoJeLA": {
    "date": "12/30/2014",
    "text": "The grilled steak was on point since it was made to order. Seasoning was great, came out hot and dare I say best quality of meat for a fast food Mexican shop. Less mystery, more natural in texture and actually a desirable cut.  Wish the chicken had the same juiciness but I can imagine it to be hard to turn around rotisserie that quickly so it had to be pregrilled.    Rice and beans were on the salty side but the pairing withy the tortilla allowed me to overlook that. Will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n824BH7temeuPL3V7-tr8g"
  },
  "bJErmLrf_Bn9lTGxEYq8kg": {
    "date": "8/29/2017",
    "text": "We call this \"Red Chicken.\" It's consistently good, always fresh and tasty and you can't beat the prices. I love both the chicken and the beef. The beans are rather bland, but the salsa, rice,  and pickled onions all go together for an explosion of flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bhGKT7n98Z7eZSJ4TNSLgA"
  },
  "g8TKVnXQttJ1m8HmSrzbfw": {
    "date": "3/6/2017",
    "text": "Didn't like the service, cashier really rude, didn't wash her hands after handling the cash and then grabbing the food, real disgusting. Ordered some chiles asados and drop one of the chiles on the floor picked the chile from the floor and put on my ordered, real disgusting, not going there again and not recommended.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ThWkqCndzdVoWPPlh8fP2A"
  }
}