{
  "JNS9SK7SGPJF863rVpKK7A": {
    "date": "7/26/2017",
    "text": "if I could rate this place a Zero I would. I was seated but ignored by wait staff while they took care of tables near me. I can't say anything about the food never had the chance to order... good luck you want to try I arrived just after 1:00 to avoid the rush but still POOR service",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V7gSmEPbeZMeBBDoJKGT6Q"
  },
  "FjiJ-6aYsN-0bnA88HS0bA": {
    "date": "7/20/2017",
    "text": "Had a turkey club today for lunch. Was a big portion and so filling. Tarissa and Lynn were very helpful and I enjoyed my stay! Will definitely be back for more great tasting food:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mIbXYOvWd5Ub5F_z2YrMkg"
  },
  "j20_jM3yZBFS543BcbTukw": {
    "date": "7/20/2017",
    "text": "Love this place. This place was great and what made the place even enjoyable was our server Collette! She was Fast , Friendly and extremely helpful. Great food, perfect for a terrific breakfast",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wVJk45AZF3yLxc9algqyGQ"
  },
  "3ytS7wQI7cqXEB36V0hH-g": {
    "date": "12/16/2016",
    "text": "We have been here three times now! Donna was amazing to us last week and today Dre was absolutely amazing!!! We will certainly be back! The quality of food and the service is perfect!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FWkg5OMjUL0VYjLBm8QhRQ"
  },
  "_JVLQij4iTT0g_GMbkpaIQ": {
    "date": "7/13/2017",
    "text": "Wow!!! Foods great! Thank you staff for treating us like a guest in your home! Donna's smile and fast service makes the cherry on top.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aIzmJsP50EuZQ3u8T37L5Q"
  },
  "MVFt8nStWgKRKtGuzezuQA": {
    "date": "11/27/2016",
    "text": "Two and a half hours for breakfast. Ridiculous. The food is decent, but the service is very slow. Waited over an hour for a table, then more than 45 minutes for our food. I'm not sure we need to go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vUoPyKfqvz2UixCFfKFtDQ"
  },
  "56bjxZNVHRUinmrihWrmwA": {
    "date": "11/27/2016",
    "text": "Clean restaurant and friendly servers. The host seemed pissed off and only gave us one placemat for a table of 3. Two of the three orders came out not only wrong but also cold and the coffee was not fresh at all. I could hear the cooks cussing and the hosts bickering. The server took a cup of coffee off of the bill to make up for the messed up orders but overall I was far from impressed with everything.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3SSZRJW0jZrh_0ZaIzZeNg"
  },
  "zzX5d4YMFa9-rsQsEx6wQA": {
    "date": "10/15/2016",
    "text": "If I could give this place 10 stars, I would!   My fiance and I have never been here before, we wanted to try something new, and I saw the billboards on the freeway. We decided, hey why not?   We have a thing for hole in the wall diners, and this place totally passed our expectations. Awesome food and portions, awesome service, and all around just an awesome cool and different atmosphere. He music is great too!  Our server was David, he was amazing! He knew we hadn't been to Black Bear before and talked the food up, and gave us a little history about the chain as well! We could tell he totally loved working here, which we strongly admired about him. He knew everything about the menu, and was very proud of the food and they even have fresh squeezed orange juice! When we told him how much I loved ranch dressing, I asked for a small amount to go because I couldn't finish my meal. The ranch dressing, oh the ranch dressing! It has bits of real bacon in it, sooo good. He let us box up our food, and came around the corner with a tub of ranch for us! Lol it was so cool!   They also have staff working here with disabilities, which warmed our hearts because the rest of the staff treated them with so much respect. And they did a fine job too! We even tipped the bus boy because he was super friendly, and told us that loved Black Bear Diner! Honey, we do too!   Upon leaving we got the bill, and couldn't believe how inexpensive it was for our meals! We'll be having breakfast, lunch and dinner with our left overs! The portions are that big!   When we left, the hostess at the front, her name was Audi- \"like the car\" as she said with a huge smile on her face! She was very sweet, and complimented my engagement ring, and my makeup, which I thought was very nice of her. She said she hoped to see us again soon, and we hope to see you too!   Loved the staff here, they made our first time to Black Bear memorable. We will definitely be coming back!  I think we found our new spot, during our meal we even discussed bringing our friends and family here because man, it was that good! I can't wait to share this place with people! It's awesome, and if you want a cozy and comforting meal, this is the place for you!   You HAVE to try Black Bear, they have a huge selection of food, and the decor is very different from your typical diner. Even though this place is new, the decor is dated and have this really cool country vintage vibe. It's definitely not hip or chic, but we really appreciated it, considering that we love these type of diners!   Go here! You will not be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Q0KzDI1_HXAd-T1fgiJaWw"
  },
  "2pxFJwmN0CpOJVBocA95lA": {
    "date": "1/8/2017",
    "text": "Awesome food at a great price.  I ordered the Bigfoot Chicken Fried Steak breakfast that came with 3 eggs, a chicken fried steak that took up half the plate and hash browns that were cut thick and cooked crispy brown.  On another plate came with 2 Sweet Cream Hotcakes with butter and syrup.  I came starving and I couldn't finish my breakfast.  All of that for $11.99.  My wife ordered the Huevos Rancheros and her portions were good sized and cooked perfectly.  The service was awesome and we were seated right away on a Sunday morning at 9:30.  it was crowded but the restaurant appeared to run smoothly.  I'll be coming back for their pot roast dinner and try their lunches too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mnqEyxp3Ju5_v8mHnLrNAQ"
  },
  "7C3pW55xgZljGgVwuJRfIg": {
    "date": "10/9/2016",
    "text": "First weekend this location was open and they did great. My boyfriend and I walked in, were greeted right away. We were asked if we wanted to sit at the counter instead of waiting for a table and we said absolutely. The wait would have been about 40mins. When we sat down, we were greeted immediately. We had a great server, that was very attentive. Our food was ready fairly quickly. Both delicious and a huge portion. I ordered a fiesta scrambler and he ordered volcano breakfast with harvest grain pancakes. He wasn't even able to finish all his and he can always finish his meals. The price was decent and for being a new location, everything for us ran smoothly. We would recommend this place and we will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "K58HMcTEAlTgMa4TU0W4yw"
  },
  "8BWPIHmEyuCzu4r5b1Uq5g": {
    "date": "5/19/2017",
    "text": "We have been to the West Bell location many times. This time we decided to try the Tempe location since we were going to go to Arizona Mills afterwards. We were seated pretty quick and the waitress was very nice. Our food seemed to come out pretty quick so I didnt question it. Well hours later my husband started violently throwing up and having really bad dirahea. Myself my stomach was not feeling good at all and not to be crued but pooped alot and felt like I was going to throw up. Now we both feel drained of all energy, hubby is very pale, and havent had anything else to eat cause we dont feel good. So I woild ask them to recook your food if you eat here or make sure its nice and hot and cooked all the way. FOOD POISONING IS NOT FUN. Wont be back probably at all to this location ever again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1mxwoqmkj3XGkTvcVUteA"
  },
  "c3tCJQ_A7N_zEPv8mtLlow": {
    "date": "10/8/2016",
    "text": "So I called in for an order at 925am hoping to get my food before 10a since I work across the street and start at 10. Lady put me on hold for 13 mins in fact I drove to the place and still was on hold. I tried to see if I. An get my food by then but it would've made me late. The ladies were nice however the one that put me on hold told me she tried to get me back on the line but couldn't??? Like you couldn't un hold me? Anyways they just opened and what way to start off my experience after telling everyone at work this place is awesome.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fR1NDpVYlxewdzUWsk1gdA"
  },
  "Msu44o3dk3p05HS6Y3oa3g": {
    "date": "11/19/2017",
    "text": "My boyfriend and I come here almost every weekend and it's perfect EXCEPT once in a while his pancakes are dry and I order my eggs over medium and they're runny and wet and gross, staff is always very nice overall a delish place to have breakfast. Bears choice is my favorite",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z47MQIJY-OJu3nWuXYgNjg"
  },
  "95tj57Bl9XeM-NxaDTVF0Q": {
    "date": "1/1/2017",
    "text": "My husband and I totally enjoyed this diner. Portions are huge and the prices are more than fair. Friendly service and flexible when you want to make adjustments to the food you're ordering from the menu. We will be coming back for sure. We lived our server Marci!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9TwgDOnfvwjuS-z_ysLtA"
  },
  "SrhXjPkxPCeLzLTP4pSbjQ": {
    "date": "11/4/2016",
    "text": "went here this morning with my friend from out of town and i'm pretty impressed. the food was really good and you can tell that the biscuits are made there. my service was also pretty good. but probably the main reason for the stars is the atmosphere. I really like how it feels like you're in a cabin and it's pretty cute! If you're in the area i'd definitely check this place out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y37liFE-rrd0qRY7n8YjZw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. bears choice!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y37liFE-rrd0qRY7n8YjZw/o.jpg"
      },
      {
        "img_id": "FhdJ-jhzPtXQPQTwRZ6Y2A",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. chicken fried steak!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FhdJ-jhzPtXQPQTwRZ6Y2A/o.jpg"
      }
    ],
    "user_id": "EejA3YNon_gCTqQzDkCFKQ"
  },
  "21Li53EpVgfm8dRn_bOEhA": {
    "date": "12/10/2017",
    "text": "Simply AMAZING! We're traveling by on I-10 and found it a convenient location. Hardly ever do I see breakfasts too large for me to order! I got a Standard 2-egg breakfast with homemade sausage links. The food was all excellent, great hash browns and a huge biscuit. Cooked nicely. We ordered in a few min and it came in 3 minutes! You must stop here. We will be back soon! JD",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0yZ420IFrL5YKkdnho-rqw"
  },
  "hJfC8EIEN_Fuc4xPZXxOkQ": {
    "date": "11/5/2016",
    "text": "I was happy with the experience, but if I had invested a bazillion dollars in a new business I would make the food and service a minimum of ten star all around. The fish was good, the chips were blah; there is no good chips made from mashed potatoes, the tartar sauce was excellent, the service was excellent. I will go there again, but not without a coupon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ommIYQi6Z0MmwGX0e6oV1w"
  },
  "KCJWC46kFcYu2f9myUGgMA": {
    "date": "2/22/2017",
    "text": "First of all, the food was great.  Good portions, good tasting, and the waitress was good also.  My complaint comes when I was trying to pay for my ticket.  For my brother and I, $30.  I got charged $88.  I thought it would take a couple minutes to fix, which is fine, but 15 minutes starts to put things behind schedule if you have a full day planned.  I didn't want to cause a scene because I didn't want to make any of the elderly couples or the staff uncomfortable.  It would've been cool if he would've taken a few bucks off the bill, but I was just given 5 Bear Bucks. For one thing, Black Bear Diner is a luxury for me, a place where I go if I have extra cash or I wanna show someone an awesome breakfast restaurant.  So, I go there once-in-a-while and Bear Bucks are pretty much useless and is gonna get lost almost immediately.  So, after 15 minutes of having several customers giving me that \"what did he do?\" look, inconveniently making me late to my next appointment (15 freeway minutes is a lot), I leave 5 Bear Bucks richer. But the problem was resolved. I guess next time I should just say something and maybe they'll have a faster way of dealing with this situation. But I think them offering a discount on the meal would've made me glad to wait.  \"Sorry Sir, there was a problem.  I'd like to offer a discount on your meal while I fix the problem.  Thank you.\"  Problem solved and I still leave satisfied. Late, but satisfied.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rOphlb03dhcrGIE1mQMeBA"
  },
  "F319jAhwKHjb0NqTkW9fRw": {
    "date": "2/22/2017",
    "text": "Awesome breakfast!!! Huge portions!!! Everything we had was good!!! Chicken fried steak and omelettes were amazing!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HMjTRc-cg8rOP_3QtYnpUw"
  },
  "BylmUA0jiwuRZAdyDNsNpw": {
    "date": "7/3/2017",
    "text": "Extremely slow service. The waitress loses tickets and makes you wait 30-45 minutes before she realizes your ticket was lost. Do not plan on coming here if you're hungry and expect actual good service.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8LeaZdORzk3Dmd15aYR5Sg"
  },
  "4CVKF5wrwWe2DnAlBVkiig": {
    "date": "11/20/2018",
    "text": "Entry was not welcoming. Customer service lacked especially what seem to be coming from the manager themselves. I had to seat myself with no menu. Food took too long, 25- 30 mins before it arrived. Just lacked on attention and I noticed walking out the manager greeted 2 other people much much differently and walked them to their table with menus",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1ov0L2dvGgdL3K6GbtHvg"
  },
  "NzG0iA1eDPJAenRY-pVMWQ": {
    "date": "12/29/2016",
    "text": "I've been the the black bear Diner in Gilbert so I was excited when this location opened in Tempe. A friend and I went after work for dinner. It wasn't busy so it was nice to have the place to ourselves. The staff was friendly and attentive. The menu has a huge selection of breakfast, lunch, and dinner items. I had the chicken fried steak breakfast. The biscuit that came with it was huge. The chicken fried steak was a really good portion and tasted wonderful.   I will definitely be back to try more dishes!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2hPB83XGvb3InsZQwAHmUw"
  },
  "_v3XJRfbZOxJJbVWsUz5WQ": {
    "date": "7/14/2018",
    "text": "My wife and I went to the restaurant for breakfast today. When we first arrived it seemed clean and quaint. We thought the decor was cool and the waitstaff was pleasant. I ordered the New York steak and eggs. I asked for the steak to be medium rare and my potatoes well done. My wife ordered the eggs Benedict with hash browns also well done.  It took over 30 minutes to get our food! The waitress kept saying that she would check on our food but never came back with an update. When the food finally arrived my wife's hash browns were ice cold and my steak was well done. She brought my wife another plate of hash browns yet I just ate the steak as is. I didn't have another 30 minutes to wait for another one. When the waitress came by and asked us how everything was we told her how poor the food was. She offered us a free dessert at 10:30 in the morning. I politely declined. She didn't tell a manager about the food or the wait in spite of the fact that we told her it was our first time eating at the restaurant. Of course they charged us full price. When we went to the register to cash out the hostess asked us how everything was. We told her how mediocre the food and service was. She politely apologized and said that she would tell a manager about our experience. She didn't even take our name or number. We will not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AiElfvrNQkCBb1tvpIaBYQ"
  },
  "jdN2DMshzKXEAciqUcyqvw": {
    "date": "11/11/2016",
    "text": "Busy Veteran's Day with a lot of people going out for breakfast. My girl and I were seated right away by a friendly hostess. Our waitress was quick, friendly and accommodating. My girl got chocolate chip pancakes and they were awesome (I took a few bites). Black Bear Diner owns the recipe to the best pancake batter out there today. I ordered the bread pudding a la mode and it was warm, fluffy and delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Vg7HFN1oc84N6bWccZbBdw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Vg7HFN1oc84N6bWccZbBdw/o.jpg"
      },
      {
        "img_id": "ygCzot1jfxYmo5A037yn2Q",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ygCzot1jfxYmo5A037yn2Q/o.jpg"
      },
      {
        "img_id": "veeJi7IHsjde7cMOQbjLDw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/veeJi7IHsjde7cMOQbjLDw/o.jpg"
      }
    ],
    "user_id": "PcvbBOCOcs6_suRDH7TSTg"
  },
  "h-y5DCGH_CGgBpqt7sZxnQ": {
    "date": "11/17/2018",
    "text": "I've been coming to this location for about a year now. And in that time the food has decreased in quality. I ordered the California Bacon Benedict with Country Red Potatoes. The food was bland and the country potatoes should have come with peppers and onion, guess they missed adding them. The waitress had to bring the veggies in a bowl on the side. Not sure I will come back to this location.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hIAmNCuwYSMlRXGzJqtXjA"
  },
  "oPzS9HaYtF640o5ehHdXdA": {
    "date": "12/31/2017",
    "text": "This is my go to place when I want a good and hearty breakfast. Dre was an awesome server who gave me great customer service. I enjoyed my visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RQNKuUiGImuQQeY7128nfw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Melt in your mouth",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RQNKuUiGImuQQeY7128nfw/o.jpg"
      },
      {
        "img_id": "2e882g6ueWoEfHI-u77bnQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Food Porn",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2e882g6ueWoEfHI-u77bnQ/o.jpg"
      },
      {
        "img_id": "25DfBWC-hHh4joshZvk1eg",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Scrumptious",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/25DfBWC-hHh4joshZvk1eg/o.jpg"
      }
    ],
    "user_id": "sEs4jZkDmH-QyUjKdfIptw"
  },
  "ukSy4RlYnPXu-QIHmDPrWw": {
    "date": "6/29/2018",
    "text": "Very cozy. Cute decor of black bears. The food was a little of a wait, but everything came out hot and perfect. It was very delicious. Also had a banana cream pie and a coconut cream pie. I recommend this to anyone coming into town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rHG-0tkiLFgJzBuQJxMwJA"
  },
  "E3vgco4XDXZ228b35oRq8w": {
    "date": "9/24/2017",
    "text": "Ok, this review is only for one meal-honesty upfront. I've eaten at the Paradise Ca one, but only breakfast- which was pretty good.   With that in mind, I ran over to have a bite before a concert. I almost went to an old standby-Cafe Boa- because it never lets me down. But I figured I didn't want to pay 16.00 for dinner that night, and hence made a poor choice to go to the Tempe Black Bear Diner.  Was early, no wait (or maybe others have already decided ugh-not!) waitress was sweet.  Brought me water that I took one sip of and gagged-tasted like dirt or mud. Sounds weird. It was crystal clear. Huh? I asked for bottled- didn't have, so I asked for another try. Ugh! Same dirt flavour. I mentioned it and she said that she didn't like their water either.  I asked if any drink they sold wasn't made with their water and she said lemon aid.  She apologised  and said she wouldn't charge me for the drink-since I didn't really want it. Since I was soooo thirsty I got that. Was good- but I NEVER drink sweet with dinner. Oh well  I ordered the meatloaf- don't know why. Guess I figured you can't screw that up.  You can.  It was so damned bland- was like eating unseasoned burger meat. Bland bland bland.   I just had to choke it down as much as I could. But the seasonal veggies were very good. That's what I ate all of. The mashed potatoes were bland too.  At the end, my bill was almost 16.00!  She had charged me the 2.75 for lemonaid. She was no where to be seen for 5 min- so I just paid and left.  There are SO many better-and cheaper places than this in Tempe.  Yeah, the bear stuff is cute. Go look at it- and eat somewhere else!!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EZHBVGm8VQlj4zsGifzrxw"
  },
  "E-nQjvKk0Lc5NRDWXaUFkQ": {
    "date": "11/11/2016",
    "text": "Enjoyed the decor,  as first time patrons.  Thought  the pajamas for sale were cute,  but couldn't find a price on the 3t ones.  Had the chicken  club, not a fan of triple decker style sandwiches and the chicken was a little too seasoned with rosemary for my taste . I also prefer my Cole slaw cold, it was kinda room temp. My daughter's steak was cooked well done instead of medium and my husband's sandwich had cheese when he asked for without. The tri tip sandwich is a bit spicy,  beware!  Overall good food and service was nice. I looked at other tables dishes,  and already have a mental list of things to try. Would return to try some more dishes, but please be more attentive when putting in food orders.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y_4UdLKpt9nsojhndcE45g"
  },
  "qLD1Q72zlrYzyAAfoAq6cQ": {
    "date": "11/10/2016",
    "text": "So overall the food here was great.. very filling and reasonably priced for huge portions.. the menu is the Newspaper by the way. lol I am excited to make a trip back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dJqLr3-IMZTUUbEU-jOWmg",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. The SramBOWL",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dJqLr3-IMZTUUbEU-jOWmg/o.jpg"
      },
      {
        "img_id": "CGFwz-cydeK1_SoinQB1TQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Country fried steak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CGFwz-cydeK1_SoinQB1TQ/o.jpg"
      }
    ],
    "user_id": "LP9_pEcY-ofbVGIhK9UUDw"
  },
  "xyUk2Sg4Eiqz8sEmzP1qFA": {
    "date": "1/15/2019",
    "text": "I love the food here at Black Bear diner but I ventured to one closer to my home in Tempe. I came with my girlfriend and we were sat next to the kitchen area. As we were talking and watching how the employees worked , we watched as the manager grabbed food off the plates with her bare hands and moved it around. It was disgusting. I then saw the manager do the same to my food . We then waited to see if they would bring that food to me. They did , I then asked for the waiter to bring me new food and she said\" I'm sorry I hadn't noticed that she wasn't wearing any gloves\". It was very disgusting and made me want to leave immediately. I only give two stars because I've been to other locations and the food is fantastic.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y98eP5CkEd9P8NTW54MBfQ"
  },
  "3moMlhrL6J-B6vEO2I7V-A": {
    "date": "2/9/2019",
    "text": "Server was fantastic food superb more than I expected loved the comfortable environment as well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FqPsOszupdQJbHjbkhThlQ"
  },
  "4fD69ToKdTt6h_ySHc7fyg": {
    "date": "8/10/2017",
    "text": "Black Bear Diner!....let me see. Where do I start? First of all, they are decked out with bear gear. Which is the cutest, it makes you feel like you're eating in a lodge in some backwoods town. (This feeling btw is a good one lol). You get to sneak away from the busy life of a \"city life\" to enjoy some fresh treats. I always enjoy their bears special, which you get to choose your style eggs and whether you'd like pancakes, waffles, biscuits or sausage, bacon etc. i recently tried their chorizo scramble & it is great. All their portions are large, enough to share if you'd like. Although everything seems too good that you may not want to share. Haha And dessert?? Make sure you leave room because their pies are to die for!! I typically take a chocolate pie home & myself & my fiance will enjoy it later. Great spot! Kid friendly! Family friend! Warm inviting environment! Love this spot & I recommend it to everyone!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W_Oug2nvvQ5mqKczdTTsgw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. BEARy cute pictures on their walls!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W_Oug2nvvQ5mqKczdTTsgw/o.jpg"
      },
      {
        "img_id": "OtQASyhaGplJJZ_mC9ZeyA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Delicious hot chocolate!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OtQASyhaGplJJZ_mC9ZeyA/o.jpg"
      },
      {
        "img_id": "LYArsLXgnb8WK7mdrf6hDw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LYArsLXgnb8WK7mdrf6hDw/o.jpg"
      }
    ],
    "user_id": "YXro7DYEzalWWD43Q1gkzg"
  },
  "D9PivkGC5Z1fjzO3zdiuHA": {
    "date": "6/23/2018",
    "text": "Not a fan. Not that the food is bad just not my taste. I know many ppl that like it but I would rather have traditional breakfast food",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MuvbVd37zfk6Kj1Bn5tqxA"
  },
  "HLzUshDk-PhO5h_LJLV4Hg": {
    "date": "6/17/2017",
    "text": "Sat here for an hour and nothing was brought over no food it is completely empty.  All we got was drinks Susie was amazing and very sorry but management never even came over to the table to apologize",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S4C9utCOhbRMwcjuzJTUGA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Empty table",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S4C9utCOhbRMwcjuzJTUGA/o.jpg"
      }
    ],
    "user_id": "XoPmR44HXNrUQdYplPPPCQ"
  },
  "mh3S6fCyvQcY2ym5KcXVEA": {
    "date": "6/25/2017",
    "text": "I hate to give a place a 1 star review, and maybe it was an anomaly the morning we tried to go to Black Bear Diner.    We came in on a Saturday late morning wanting to try a new breakfast/brunch place.  The decor is very cozy and we were seated right away.  The gentleman seating us said in passing that they had just had a huge rush and that they WERE an hour behind.  But he assured us that the rush was over.  At the beginning our server was very friendly with good communication.  We decided on our meals quickly and this is where it all went south.  Yes it was a busy morning, but 45 minutes later were were all getting anxious for our food.  Two adults and 2 kids (10 and 8)  Our server had not been back to check on us, refill our coffee/drinks, or update us on our food.  By 1hr15 minutes (another 30 MINUTES after we had seen our waiter) my husband found our server by the kitchen and asked about our order.  We were the 3rd ticket in and it hadn't been started.  So disappointing. If were would have been told how far behind the kitchen was, we wouldn't have stayed. So we paid for our drinks and left.    Next door the Costco hotdogs tasted AMAZING!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3njSt409JPn1ftmTtyvqjQ"
  },
  "MgEvdSiXIF1x0XkhD6KuWQ": {
    "date": "6/9/2018",
    "text": "I ordered a Reuben it was not too good. Bread was hard and cold.  Another person at our table ordered the same it was better. I had them redo mine. I liked the pineapple pancakes from previous visit. It is a fun place. I just do feel like some days they are not serving to order. If you don't like it they are quick to correct. I just do not like to have to do that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EtySygJ2sep1ELBBCaJgMQ"
  },
  "BasGpzjFP2WOEzV834_0wA": {
    "date": "6/6/2018",
    "text": "Awesome little place. Our service was prompt, friendly, and helpful! Our food portions were huge and delicious! I would have eaten here again given the chance. Worth a try for anyone willing to check it out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nVjhnL91f3JWdKuGIVbpyQ"
  },
  "-EQ4HG3bJG44vy2CWJ_DIw": {
    "date": "6/12/2017",
    "text": "Due to the service and breakfast selection this place gets 4 stars. I ordered the 2item breakfast combo with Bacon and my brother the same but with Country fried steak. My bro said the country fried steak was seasoned well but slightly over cooked. My food was delicious, especially the hash-browns. Had a minor mishap with my food but the management fixed it right away. Thanks for breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7eZQqyF-AFytqot40u2DUw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Bacon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7eZQqyF-AFytqot40u2DUw/o.jpg"
      },
      {
        "img_id": "KuRvPGyKknN0Ng40DQcyGw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Country fried steak",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KuRvPGyKknN0Ng40DQcyGw/o.jpg"
      },
      {
        "img_id": "r2QIojtk6bSmPwIwVnaOhg",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Dinner",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r2QIojtk6bSmPwIwVnaOhg/o.jpg"
      }
    ],
    "user_id": "73jsD-kNNe54bYOBTMXFOg"
  },
  "f07vTMdSV01BiXWVcTqMig": {
    "date": "4/2/2017",
    "text": "Was here recently and not totally excited the first time. This time sat at the counter two waiters at the food window and they kept doing their thing not even acknowledging me. Anyway I want to be short and not get to deep with this but couple things that confuses me : breakfast is served with Italian sausage?, and not a breakfast sausage? The gravy was bland and the biscuits so so.  Service at the counter is minimal almost would be more efficient to low wall the server area and put in3-5 two person booth and assign to a waiter.  Just my thoughts",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "-AkZkFH_md2-2kaSsvgrkg"
  },
  "KbIDHw0frAmC0aabYGfKsg": {
    "date": "12/9/2018",
    "text": "This was our first visit to black bear diner in Tempe.  The food was amazing!! They sat our huge party of 18 and gave us two super kind and patient servers.  We will DEFINITELY be back:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A6vEvxF3RP3Ppq-FsZp_tQ"
  },
  "MHGSLUQFNHK2ZEyl1aAiYw": {
    "date": "7/3/2018",
    "text": "My wife and I went there for and to be honest it just wasn't that good. I had a waffle with scrambled eggs, sausage links and a slice of watermelon. The waffle wasn't cook thoroughly and the watermelon tasted like it was left out on the counter overnight....warm and soft. My wife had the \"Fit and Healthy\" which consisted of egg whites, mushrooms, chicken sausage and cheese. Maybe it was fit, maybe it was healthy but it just wasn't tasty. I also ordered a small orange juice that they claim is freshly squeezed for $3.49. It tasted like an orange drink not juice. The only highlight was the very good wait service we received. Our waitress was very friendly and attentive to our needs. It wasn't enough however to motivate us to come back again.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "1S3NXAluUp5FB-YVSj3yOg"
  },
  "ZDpoyMvXf13RI2xeCPqU9g": {
    "date": "3/6/2018",
    "text": "Decided to stop for an early breakfast on the way to the airport. We had eaten at another Black Bear Diner for dinner, but never breakfast. It was very quiet on this morning with only 4 tables being served. Our waiter was fantastic - he took our drink order and returned with them quickly. He then took our meal order and we waited in anticipation. In the meantime, we watched our waiter scurry around the restaurant taking care of everyones needs - super friendly & very effecient ! Then came our meals - french toast & eggs, bacon, hash browns - all looking & smelling fantastic - and plenty of food ! All of it tasted great ! In fact, I would venture to say this is one of the best breakfast meals I've ever had !! Great food & great service - High praise & definitely deserved . . . Well done - Black Bear - Well done !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9cLyJWjfIc-xnWOmmHHt-Q"
  },
  "6FuxtWX55KcEnhZZ3V27mA": {
    "date": "1/18/2018",
    "text": "9 min 36 secs for chicken and waffles.  My friend said they are crazy good.  My Beni is always perfect.  Everytime I go through Tempe.  I eat here.  Always amazing.  Thanks to Amber",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5YjbrS0rv2xWE6Xdi5rJlw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Chicken and waffles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5YjbrS0rv2xWE6Xdi5rJlw/o.jpg"
      },
      {
        "img_id": "2u1rCeUpx9BWMpOTHaDrig",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Eggs beni",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2u1rCeUpx9BWMpOTHaDrig/o.jpg"
      }
    ],
    "user_id": "yfWuWHdQOGMBXZd0RSBBAA"
  },
  "m6mKVwCHZ3ge_hjr_wqQCg": {
    "date": "9/13/2018",
    "text": "This place is so inconsistent food is never the same quality. Is it really that hard to cook eggs? Over medium eggs should NOT have snotty runny egg whites!!! Bacon dripping grease hash browns half cooked. This is the worst location I've visited by far. Our waitress was too busy flirting with the cook to even check on our table so I could tell her my eggs were raw. Then wants to get me new ones when our whole table is done eating. Pathetic... this was our 3rd attempt at this location and every time my eggs are way undercooked.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5mbbvjQaOkyPm5jepLmwCg"
  },
  "_RQPT8mzc_AyHphoNlErWg": {
    "date": "3/18/2018",
    "text": "I'm a big fan of Black Bear, they are CONSISTENT. I'm from Northern California and this Black Bear is no different than the originals! Great food, great service and friendly people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H7aW0eszOvzbOJ4IpSE0Lw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H7aW0eszOvzbOJ4IpSE0Lw/o.jpg"
      }
    ],
    "user_id": "4X1plw6EmfIuExODTGhjrg"
  },
  "P4oUBFPzg63iJMKewXrR8A": {
    "date": "10/28/2018",
    "text": "I come to Black Bear Diner in Tempe every week! It seems to be better than the other locations!! I always get great service in Tempe.. The fresh squeezed orange juice is amazing.. not to mention the pancakes!! They're always so warm and fluffy!! The manager Chris or Nikki always go around and talk to the guests I've noticed and make sure everything is good for the customer!! I'm always happy when I leave!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "389inJQEpwqctRWO5lqHSA"
  },
  "ywXweRRcTPsIyK8IEVAj1A": {
    "date": "9/9/2018",
    "text": "Came in and it took 15 minutes to get drinks.  We waited 40 minutes to get our food which was 2 kids meals and a grilled cheese.  About 10 minutes before we got our food the waitress apologized for the wait and said they were waiting on the fries.  One half of the grilled cheese barely had any cheese on it.  I showed the waitress and she did give us $10 in gift certificates for that plus the slow service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OoXOpUzCdnkZAVIn5YVg2w",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Grilled cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OoXOpUzCdnkZAVIn5YVg2w/o.jpg"
      }
    ],
    "user_id": "q9KE1Vk8B2jb8KCFS0OzWQ"
  },
  "YwOzs_PcL_6xw2Wawc06-A": {
    "date": "3/14/2017",
    "text": "We came to Black Bear Diner after viewing the dismal continental breakfast at our hotel and boy am I glad we did. Tarissa was an excellent waitress, friendly, smiley and quick and the food was amazing. The cinnamon roll French toast was some of the best breakfast I ever had! The side of potatoes I asked for was huge! If you're so hungry you could eat a bear, then black bear diner is the place for you. I loved the cute touches they put on the decor and various accessories of the restaurant. The menus were newspapers, and there was etchings of bears in the wood posts!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cjiuZTNXpmb9dlHEpoFdlw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Newspaper menu!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cjiuZTNXpmb9dlHEpoFdlw/o.jpg"
      },
      {
        "img_id": "_sFqso9L3Y8W5SsdE43hzQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Cinnamon roll French toast and fresh fruit!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_sFqso9L3Y8W5SsdE43hzQ/o.jpg"
      },
      {
        "img_id": "0zOTv2Oq70tZe8wKOCBFCQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Huge side of potatoes!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0zOTv2Oq70tZe8wKOCBFCQ/o.jpg"
      }
    ],
    "user_id": "xNgjJuN6rO3BtwRUF0qZsQ"
  },
  "5uFRuTyNcUJii8aiIwYCxA": {
    "date": "4/29/2017",
    "text": "There's a nice, homely, country feel to this diner. We went around 10 am and it was not a wait to get a seat at all, which is great because there are a lot of brunch locations in Phoenix that get packed in the morning.  I absolutely love and cannot live without coffee, and I have to say, their drip coffee was perfect. It was not piping hot, or lukewarm, but just the right temperature to give you that warm morning coffee feeling. It was not bitter and it still had a good kick, so they definitely know how to brew a good cup.   The menu has variety, and apparently you can order anything off of the lunch or dinner sections for breakfast if you want, which definitely opens up options. I don't know if folksy is the right word, but that's how I felt about the menu, which is printed on a newspaper and added some extra charm to the place.  I got the Mushroom and Spinach Eggs Benedict, Baked Red Potatoes and a side of Corned Beef Hash. And everything was delicious, and even though the corned beef looked fairly pink, the taste was on point. The Arnold Palmer was also in perfect proportions.   Lastly, the staff and waitress we had were very friendly. I really look forward to going back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hQgYYgcxrOz9RAq9ZGS87A",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Eggs Benedict with Mushroom, Spinach and cripsy Baked Red Potatoes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hQgYYgcxrOz9RAq9ZGS87A/o.jpg"
      }
    ],
    "user_id": "z2qf4lxBeyCPJW8AyD9_zg"
  },
  "GyP0BIn_f0cXmAxmSrmPNw": {
    "date": "11/17/2017",
    "text": "Cute little cafe with a woodsy theme. The black bear cafe serves breakfast lunch and dinner. Feels like you are in a log cabin with a jukebox playing oldies in the background. The staff is friendly and very attentive. I love the fact that they have their own ketchup and sauces. For the menu, they give you a cute little newspaper. Food portions are big so come hungry. I ordered The Grizz. If your into breakfast, this is the plate for you. You can choose from a waffle, pancake or French toast. It also comes with bacon, ham and sausage and your choice of hash browns or potatoes . The bacon was delicious! The rest of the food was okay. Definitely add some salt and pepper. Overall good experience here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qyAJ8kfOsWQIripJ18M0wQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. They have their own steak sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qyAJ8kfOsWQIripJ18M0wQ/o.jpg"
      },
      {
        "img_id": "XFWaZlTuc8uf_YdqIQaaiA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. They have their own sauces",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XFWaZlTuc8uf_YdqIQaaiA/o.jpg"
      },
      {
        "img_id": "TNdzY-OneINEISR9QBi8Ag",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. They have their own ketchup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TNdzY-OneINEISR9QBi8Ag/o.jpg"
      }
    ],
    "user_id": "vRJUVOSOOY4VeQkfiV6nIw"
  },
  "aRcdsxm2QdDJ3Tfm39ck0g": {
    "date": "1/10/2018",
    "text": "We had breakfast here, beware you will get a ton of food! I got the bowl, can't remember actual name but it was really good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OTSG-JvBKMxTaf8z6N7KsA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OTSG-JvBKMxTaf8z6N7KsA/o.jpg"
      }
    ],
    "user_id": "mcfvIMIxf21H5g2pTbushg"
  },
  "HsYTdDl5DlUsnRAcY18m6g": {
    "date": "10/26/2017",
    "text": "Gone here a couple times for breakfast and it was always excellent. Except for one time we were seated in the back where there was hardly any people. It took a while for anybody to notice that we sat down. I have to say about 15-20 minutes before somebody asked us if anybody had helped us. We got our coffee 10 minutes later and we had already ordered so we waited another half an hour to get our food. When Our breakfast came to us it was cold. I mean stupid cold. We didn't say anything because we were heading to the game that day and needed to get out of there and didn't want to bother trying to have them warm it up for us.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "2EoDMnaTeS82IRu5m4ATnA"
  },
  "jiLoe93YTX6t8BSGVNTsWg": {
    "date": "4/28/2017",
    "text": "My Bigfoot breakfast was filling and filling, but most importantly delicious. The servers were friendly and attentive, but not intrusive. The cost to portion to quality all seem to be balanced as can be.  I will continue to return to Black Bear Diner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cwcWM-nJ1Iel394GoeEv2w",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. The Bigfoot served with white toast instead of biscuits. Super delicious and filling.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cwcWM-nJ1Iel394GoeEv2w/o.jpg"
      }
    ],
    "user_id": "7l7-VCOb4Xc2W9IWCGuL4Q"
  },
  "htNU2D13vpYQNqtvnzUFIA": {
    "date": "5/7/2018",
    "text": "My first time going to any diner since last year and I have to say that I had a good experience at the Black Bear Diner. My coworkers and I had a break from work and one of my coworkers had actually ate at the Black Bear Diner before and suggested on having breakfast at this establishment. Great environment and cool how the menu is made from newspaper. Anyways I had The Grizz; 2 sweet cream pancakes, 3 eggs*, 2 slices of hickory smoked bacon, sausage links & a hickory smoked ham steak, I was not dissapointed, I will be going back to Black Bear Diner in the near future with my family and friends, thanks for the delicious breakfast.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Z4jbHK1-U6pVfI6RfNUSow"
  },
  "PzFrZBi02tR9wpGGf_OQsg": {
    "date": "3/19/2017",
    "text": "Black Bear is a good place for BIG Breakfast. Really enjoy the Grizzly it gives you a sample of everything. The sweet cream pancakes are delisious! DON'T FORGET THE HOMEMADE PIE ON YOUR WAY OUT.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sSmRtIP6fWRTgl-TIgzmVQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sSmRtIP6fWRTgl-TIgzmVQ/o.jpg"
      }
    ],
    "user_id": "XwcNgKLd_p1ug5wiK5H9LA"
  },
  "_-gRtGLAKp4mQaUDp15xjQ": {
    "date": "8/25/2018",
    "text": "Horrid food. Please avoid at all cost.  Tomato bisque could be mistaken for dish soap.  Big bear chicken fried steak...tasted like dirty oil and fish. Yuck.  Had to get the heck outta there after wait staff said they KNEW the food was subpar but were hoping nobody would say anything. Spoke to the manager and he said he feels food isn't good either but what can they do.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AlHHl02Jbdm7fY39cLhEog"
  },
  "ebMOUCtn_bdgyM9oUqsDSg": {
    "date": "10/16/2016",
    "text": "Decent food, good service - and long lines!  Recommended!  This place has only been open a couple weeks, and I was eager to give it a try, despite the mixed reviews. Three of us ventured here just before noon on a Sunday, so it was no surprise that we had to wait. They told us it would be 40 minutes, but we had a table in a little over a half hour.  Food: I ordered Joe's Hobo Omelette, and it was really good!. I prefer low-carb, so I substituted cottage cheese instead of the hash browns and biscuit. The omelette was huge, with lots of meat and cheese. Definitely not for the cholesterol-watchers! I also enjoyed the three types of hot sauce to spice up my Joe's Hobo. The Papa Burn has habanero, so it's spicy! But it's flavorful, too. The Mama Burn and Baby Burn were less spicy, and each had its own character. I suggest you try them all and decide what works best for you.  While the food was good, my friend ordered a side salad which included the \"butt\" (or core) of a head of lettuce. They should be more careful to omit these from their salads!  One thing to note: Yelp doesn't yet have a link to the menu, so try this:  <a href=\"/redir?url=https%3A%2F%2Fblackbeardiner.com%2Fmenu%2Fbreakfast%2F&s=2e8d62c981fd0eeb8b3b6388cedaf60809917da155cff04ee0a43ecf43ea1070\" target=\"_blank\" rel=\"nofollow\">blackbeardiner.com/menu/...</a>  Cost: My meal, with no drinks, was a reasonable $10.80 including tax. Considering the amount of food, I'd call this a good value.  Service:  Like I said, they were really busy! It took about a half hour to be seated, and once we ordered it was another half hour before our food arrived. Our server was personable, and checked back on us often, so there's that.  Atmosphere: As others have said, the decor is reminiscent of a hunting lodge. But I have to say, it's a bit kitschy, not at all authentic. Still, there's a lot to see while you wait...  :-)   Overall: The food was good, so I'd like to give this another try when it's less busy.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 9,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "KuYDw-k9ucA8wXBVVA0ziw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KuYDw-k9ucA8wXBVVA0ziw/o.jpg"
      },
      {
        "img_id": "YV3HdnPbVu7RcDsDul1eaQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Patty Melt",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YV3HdnPbVu7RcDsDul1eaQ/o.jpg"
      },
      {
        "img_id": "nOAx5ebu_ilwJalFViyU6Q",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Lettuce &amp;#34;butt&amp;#34; shouldn&amp;#39;t be in the salad!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nOAx5ebu_ilwJalFViyU6Q/o.jpg"
      }
    ],
    "user_id": "e0pVHbAZE3B_iwRenLfImA"
  },
  "PIm7PV3wydwGPwxkKBLJsA": {
    "date": "1/22/2019",
    "text": "Absolutely great for my first time there. Great service, great food. I told the waitress it was our first time there and she was very patient while we looked at the menu, asked if we had any questions and let us know that portions are big so we could share something if we wanted. Definitely going back, convenient location. Thank you Black Bear Diner!! See you soon!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j3dOIhksxbSlGaQ6IwfZug"
  },
  "KQYLcNyvm9Y1rxWObzdeMA": {
    "date": "10/9/2016",
    "text": "They just opened this week.  As with their other locations the food and service are good.  The only difference is there are no  lines and no 30 minute waits for a table.  Once people know it's here - that will change.  The portions are big so come hungry or consider sharing.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "Mf3vY9h0Zjw9cmQ-2uEIbw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Mf3vY9h0Zjw9cmQ-2uEIbw/o.jpg"
      },
      {
        "img_id": "bIFAIsP-I3km9F_KJSGvxg",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bIFAIsP-I3km9F_KJSGvxg/o.jpg"
      },
      {
        "img_id": "__E9dSyCDUyPYl3PTHcaJQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. The Grizz",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/__E9dSyCDUyPYl3PTHcaJQ/o.jpg"
      }
    ],
    "user_id": "1l_O3VEl9TV_JjKAzzyz0Q"
  },
  "cav_0AmvV7GQaRyg5SP3RA": {
    "date": "5/8/2017",
    "text": "We arrived about 1:30 on a Sunday afternoon and saw a huge line, so I expected a long wait for a table. I was mistaken; that was the line of people all exiting at the same time. We were seated right away, but after about 10 minutes of no one stopping at our table (although they made eye contact so they knew were there) I finally had to ask someone if we had a server assigned to our table. The server took our drink order then several minutes later said she couldn't find our who our server was, so she took over the table. It took quite awhile for our order to arrive, way longer than one would expect for a BLT, grilled cheese, and chicken strips. The server was friendly, but not enough to make up for the lack of attention. I doubt we will be back to this location.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-1rQvJAjAhNYE5X4ub-icg"
  },
  "zywH5K-b9HuP_GD412GvNQ": {
    "date": "5/5/2017",
    "text": "I had French toast and chix apple sausage. It wasn't good. The meat was tough and the French toast was bland and you can tell it's very commercial and they don't use quality ingredients. I didn't finish my meal. If you're used to quality food you won't like this place. I prefer local restaurants.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ilC5Ml4ViKvS_qyEzwmkoA"
  },
  "xCLkcPQjlesUwPIiaXSTjg": {
    "date": "7/27/2017",
    "text": "The Black Bear diner has a kitschy atmosphere. When you walk in there are bears everywhere. You can even buy t-shirts keychains or stuffed bear along with other cutesy items. The food is really great, like down home cooking. My husband likes the Chicken Fried Steak breakfast. Their biscuits and gravy are phenomenal. They also have the best bacon, it is really thick cut and they cook it perfectly. No fatty chewy bacon here. The portions are super generous we always leave with a box, but they have a few items that are offered to be smaller portions of some of their popular items at a lower price. The prices are very reasonable. The service has been great every time we've come to the Black Bear Diner. The only thing that would make it better would be if they sold cherry pie. The sell many other pies but not cherry. Awesome place for the family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RCD-Av2aTsbhrK9d6eNUgg"
  },
  "aI3J7KnO5hgdtLSEGCPY3w": {
    "date": "1/2/2017",
    "text": "First of all, when we walked in we were greeted bY the front desk. We were told the wait would be 10-15 minutes. Looked around and no one was waiting ahead of us. The restaurant, from our view near the front door, seemed pretty empty. Initial thought was that the kitchen was having a tough time keeping up with the food demands. We were seated right around the 15 minute mark. By this time my kids are already complaining that they are starving. The restaurant is very clean and doesn't look chaotic whatsoever. Anyway, we sit down in a bench table near the back of the restaurant. Colette was our waitress. First thing she did when she saw us is let us know she'd be right back for our drink order. We had enough time between that moment and when she comes back, to figure out what we are all eating for lunch. Despite the wait, She was very friendly, engaging, and attentive. She let us know We have wonderful, polite children and I think of how many times that goes unnoticed and how nice it is to hear. It takes a good 20-25 min for our food to come out. Hearing my kids pleas for food makes me kind of upset that we didn't just stop for fast food like they had asked earlier on.  My husband I just crossed our fingers and hoped that the food would be worth it. The food was good. Definitely not the best I've ever had, but it was good. Definitely didn't warrant an hour wait from start to food on the table. It did taste fresh and like it had just finished cooking. Collette did apologize profusely for the wait, which I appreciated because that doesn't happen everywhere. So, if you are looking for a quick meal, I wouldn't recommend this place. If you are looking for the most amazing meal ever, I wouldn't recommend this place. If you are looking for a home style cafe with friendly waitstaff, give it a shot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RG3nFP9gXUjMnNBL7BnRYA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Placemat",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RG3nFP9gXUjMnNBL7BnRYA/o.jpg"
      },
      {
        "img_id": "-V9ZxZTKgz0yhTQPNE9lEw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-V9ZxZTKgz0yhTQPNE9lEw/o.jpg"
      },
      {
        "img_id": "5HjDtZ8dt6zPt0dd4WEKaQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. French toast sticks-kids meal",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5HjDtZ8dt6zPt0dd4WEKaQ/o.jpg"
      }
    ],
    "user_id": "7BRSwg4sIZgxR_nLxRO2yg"
  },
  "78d7yQlxPetDeS5HII93lg": {
    "date": "8/21/2017",
    "text": "Good food, and good service what more do you want. The portions are big, and they make delicious homemade biscuits. Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3U-t2CWBuGjZ1dUpjCN5wQ"
  },
  "9uHyVztoV4HtumMrNny5Jg": {
    "date": "1/19/2017",
    "text": "So I've been here twice now. The first time I ordered the chicken fried steak with fresh squeezed orange juice. The orange juice is so fresh that you can actually watch their fancy machine squeeze oranges if you sit near the counter. The second time here, I got the tri-tip French dip. The Au Jus that came with the sandwich was insane-dark, salty, and robust. The bread was fresh-crunchy on the outside, soft on the inside. It's worth it to get the sandwich upgraded to \"deluxe\" because it's only some $0.50 more (deluxe= grilled onions, mushrooms and cheese). My fiance got \"The Grizz\" breakfast combo both times. They make their sausage in house and the pancakes are probably the best I've ever had.  Both of my experiences have been great. They serve large portions of comfort food-who could possibly complain?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nBhfzkwGfdABnHrOcwsdLA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Tri-tip dip with Parmesan house chips. SO GOOD.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nBhfzkwGfdABnHrOcwsdLA/o.jpg"
      }
    ],
    "user_id": "twMUFzHc3Q-NnhsVsjxRvQ"
  },
  "70IThxkkuOC670AnekCOZw": {
    "date": "7/2/2017",
    "text": "When u order anything and don't want it greasy make sure you tell them light on the grease or oil otherwise it will come served greasy.  Service is slow.  Food is ok.  I was here 3 time and all 3 times something happened.  2 time here the counter girl double charged my credit card.  3 rd time waitress help other tables that came after us before helping us.  This makes service slow.  The veggies were bad and served brown, greasy.  Manager was awesome and corporate was great in responding to problems.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4qJFCY0FjedLRkV_c238Ew",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Front door to entrance",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4qJFCY0FjedLRkV_c238Ew/o.jpg"
      },
      {
        "img_id": "sIvqKfjZs4D4qov_BaV6nw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Outside waiting area benches.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sIvqKfjZs4D4qov_BaV6nw/o.jpg"
      },
      {
        "img_id": "TN0oDHDFs3GxeHvYSukHeQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Entrance lobby area.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TN0oDHDFs3GxeHvYSukHeQ/o.jpg"
      }
    ],
    "user_id": "nwIhYrWhJLvWJN-7urAU6Q"
  },
  "lbL02PhJVFE1pHJm68kgEQ": {
    "date": "8/2/2017",
    "text": "We stopped in after a shopping trip at ikea and my son had been wanting to try it because of the commercials. The food was really good. The chocolate pancakes were amazing. I deducted stars because our waiter. My mom asked a question about the pot pie and he gave her a unnecessary smart ass answer. Also I get some restaurants like to be clean but was it really necessary to vacuum while we were eating.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_qq8Wb0rPIdhXzlpoX8WMg"
  },
  "r2S11E_px_PXgoUJsDX6pA": {
    "date": "10/4/2016",
    "text": "New location! Still learning the systems but customer service is phenominal, and the food was Yummy! They have music playing that fits the diner surroundings :) highly recommend !! The only complaint i have was the phone number didnt work for me to call in my order but it is the second day open so thats expected.. everything else was great!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RCPwrGlJf5OtzRinmauaZw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. As you walk in :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RCPwrGlJf5OtzRinmauaZw/o.jpg"
      }
    ],
    "user_id": "5BqzkEIhRP-77HVPUoC4mg"
  },
  "k10iTk9WZzConL4EcOAuTw": {
    "date": "7/15/2017",
    "text": "Food was great. Super family friendly environment. A little slow as far as service and it was not super busy at the time. We will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SvlfHcEPywlDurElYeBV-Q"
  },
  "rnspo-nmQ8XJ8UTsKjYWGQ": {
    "date": "7/14/2017",
    "text": "I came to Black Bear Diner tonight on Friday specifically for their fish fry dinner that they just sent me the email on either today or yesterday.  This dinner starts at 4 p.m. and here they are sold out already before 6:15 p.m.  This is very poor planning on their part.  I would not even bother coming here on a Friday if that is what you are looking for unless you get here right at 4 p.m....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MjtU-_4DVqsW42v3Y_qD-g"
  },
  "vA24IS3cUpsFSzS9JHwnBw": {
    "date": "3/7/2018",
    "text": "One would think that on a Wednesday evening and a party of 11 comes in, the manager would help out the 1 waitperson on duty. No, he's outside with a buddy on his phone. Food is always good but tonight's service was horrible. The waitperson was very nice and kept apologizing.  This manager should really learn what management is all about.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jq8TH7qFzm4MpcRAnYS3sw"
  },
  "bnwxAE4knUhof6seN0hxkQ": {
    "date": "2/22/2017",
    "text": "This is the first time I've been to the diner,and most likely my last,went there with my girlfriend I wanted an English muffin which came back not even toasted !!!I didn't say anything because I don't want to make a big deal out of it and I was going to order a breakfast but if they can't even tost a muffin then forget it, my five-year-old can toast a muffin, Forget this place and there was even a line when I walked out I have no idea why!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-9S_Fh-sQebyB1yhEM5zHw"
  },
  "HEDRS7R9txoXoAdzDj1VzA": {
    "date": "11/27/2016",
    "text": "Waited outside for an hour. Waited at the table for an hour for food. Half of the food was cold, and the service was terrible. Will never return. I understand that Sunday is a busy day, but that doesn't make it acceptable to serve cold food, and leave your patrons waiting for as long as they did.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "230oajvVCqqJZrhNsH32Vg"
  },
  "dUvsHnCD5N8CmWzYEml4OA": {
    "date": "1/30/2017",
    "text": "Its Monday night and there are 3 families in here with 3 servers the MGR and 2 cooks yet our order was completely messed up and they brought my daughters food out separately first the hash browns, then eggs and 2-3 mins later the chicken fried steak.....I ordered a plain cheeseburger but it came with everything on it and the wait for a new meal was 5-7 mins which isn't bad but it is if your dinner party is nearly done eating their food the food was good but the service is terrible! When I spoke to the MGR 15 minutes after I asked for him he offered 15% off",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S4CUkGqUqMfc6P6E9baKwA"
  },
  "lMzAo1QiBQMGpewiikVWmQ": {
    "date": "4/5/2017",
    "text": "Had to have some work done on my car and the dealership recommended Black Bear. I'd never heard of it, so hubby and I reluctantly walked over to give it a chance. So happy we did! Great atmosphere, great people, our server was spot on (even though there wasn't an empty chair anywhere) and the food... I've used a lot of words to describe food at restaurants, but i'm almost speachless on this one. Just like sitting at my Mom's table, it was that good! Homemade, fresh, local ingredients. Both of us had great meals and did not leave hungry!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-DmrFVzkT3bkDcmeq1tbtQ"
  },
  "AYRinKBtVKvWhp4qk2wxeA": {
    "date": "2/4/2017",
    "text": "This is our F & L* at the Black Bear diner. Visited at 12:30 on a Saturday, fairly busy, waited a few minutes to be seated. Limited menu with breakfast, lunch and dinner available all day. I ordered the turkey plate and was disappointed. It came without dressing (stuffing) or cranberry sauce... come on, what's turkey without stuffing and cranberries? Two bites and I was looking for our server. Asked her to bring the plate back to the kitchen and have it microwaved since the items were cool. Offered to replace it but if it was not hot the first time I figured it wouldn't be hot the second time. Didn't really matter since the meal was not worth eating. I guess I'm not a fan of \"slab o' turkey\"; meat was sliced as thick as a pork chop. Lesson learned. * First and Last",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L59_sVLQxAaR_eoPwv5u0Q"
  },
  "xhteGzquPEiEhK32appe8Q": {
    "date": "7/31/2017",
    "text": "My husband and I recently visited family in the Tempe area. One Sunday morning, around 11:00am, we were out looking for a good brunch and came upon Black Bear Diner. Sunday was probably not the best day because it was extremely busy and we needed a quick meal before heading out for the afternoon. We saw seats at the counter and immediately sat down thinking it would be faster. It wasn't but I am not complaining. We watched a well-oiled machine, so to speak. We enjoyed brunch and a show! There was a man from the corporate office directing traffic while numerous orders were placed, cooked, and sent out to customers. The staff, from the corp guy to servers to runners, were extremely efficient and never lost their composure the whole time we watched. It was amazing.   We ordered our meal after waiting awhile, but Susie was very friendly and kept an eye on us. She knew we were there, so we remained patient. In the meantime, she ran around like all the others doing a fantastic job in a difficult situation. Once we got our food, it was absolutely delicious! My husband ordered the Grizzly (I believe that was the name), which contained eggs, hash browns, an assortment of breakfast meats, and pancakes. I had a smaller breakfast of two scrambled eggs, two pieces of bacon, and two delicious pancakes. Unfortunately, we had to eat quickly due to time, but took our food with us. It was too good to waste!  A couple days later, we decided to go back around 10am and enjoy our food at a slower pace. We were immediately seated, brought drinks, and attended to by Collette, who was friendly and ready for us. We again ordered eggs, bacon, sausage, and pancakes - we loved the pancakes and wanted more! I asked for extra powdered sugar as I enjoy that on my pancakes more than syrup (they dust the top of the pancakes with it to begin with, which I love). I was brought a small container with plenty. The food again was hot, delicious, and worth the money! Prices are reasonable, but we probably would have paid more. We like the food that much.  We visit the area often and will return to Black Bear Diner. I cannot say enough how great this staff was on an extremely busy day and on a more laid back day. I have only had breakfast there and it was delicious. I imagine lunch and dinner would be good too. Our two experiences were enjoyable and our stomachs were happy and satisfied! Good job Susie, Collette, and all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qLY_A5h9qMCtYr1q-Np5cg"
  },
  "n6bzKF4LWvqZpVFgKeYkoQ": {
    "date": "12/26/2016",
    "text": "This review is not on the food. My friend and I walked into this establishment for breakfast and were greeted promptly by the host who informed us that the wait time was 20 minutes. No biggie. While waiting, there were several patrons who were walking out due to long wait times for service. Trash was being taken out the front entrance where general seating was located for those waiting on tables (great way to make someone lose their appetite). The floor looked like they had not been vacuumed or cleaned for days. We decided to opt out of trying out this new local diner for our neighborhood diner, Biscuits.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "I_FnLJfkbJR9ROsn8FIcgQ"
  },
  "unFPsOn_IUJvAd0hnTsUfg": {
    "date": "7/27/2017",
    "text": "I frequent black bear diner daily for breakfast and almost always go for the Acapulco. Where else can you get a healthy omelette with chicken , fruit and an English muffin for under $10. The management and staff go above and beyond here and the banana creme pie is the best I have ever had. I would put it against any dessert at Cheesecake Factory and choose this banana creme pie over it every time. For great service and great health type food go to black bear diner today",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gwgf-IUYU2G3tel4VAqhag"
  },
  "1j2XqklHhvoLeGK9I3hUYg": {
    "date": "3/9/2019",
    "text": "Good food and huge portions.  Black bear never disappoints.  Nothing too fancy but good diner type food.  Friendly and attentive staff did a great job.  First time at the Tempe location which is in a shopping center complex.  It was easy to miss from the street.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eV6gMcE6GnbrBeFaMTyvng"
  },
  "xOTiIgPfZY3VLTo4LKq0HQ": {
    "date": "3/19/2019",
    "text": "Stopped in for a late breakfast and was seated quickly. Server was  RJ Very helpful. Ordered a tuna chef salad and a side of pancakes. Salad was fresh and actually to much, pancake was o.k. Not as fluffy as some other restaurants but it was good. RJ followed and gave great service. For the price it was a good experience and I would come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Cygyle1cmWQyk36Xo65XOA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Seating area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Cygyle1cmWQyk36Xo65XOA/o.jpg"
      },
      {
        "img_id": "x3gHr9G3-n2EijyA3X1OIw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Chef Salad and pancake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x3gHr9G3-n2EijyA3X1OIw/o.jpg"
      }
    ],
    "user_id": "RYtk8YRktsIozkHs32j4xg"
  },
  "-RgKsAwULxvoYlWP3V1mjQ": {
    "date": "1/19/2019",
    "text": "Went after playing hockey tournament game for lunch with party of five. Wait ten minutes to be seated, no one says one word to use after getting to table for 15 minutes. They seat parties to left and right of us. Take their order and five minutes later since were not important enough we left. Zero effort by all three waiters in that area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "antZPHQGyqgg5V42VpGQVA"
  },
  "pLf0DYI62GmT58_gBPXW7g": {
    "date": "1/5/2018",
    "text": "It was time for lunch and we just passed Black Bear Diner.  However, since we hadn't tried it, we decided to turn around and give it a try.  We loved the menu.  There were lots of choices.  My husband settled for the potato soup and I ordered the lunch portion of chicken fried steak. The potato soup wasn't the best.  It tasted more like a gravy.  Thus, the bowl wasn't finished.  The chicken fried steak was delicious and we both eat it along with the real mashed potatoes.  That was delicious.  We were surprised at the size of it considering I had ordered the small portion.    We would definitely return but wouldn't order the soup.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a8Yu6dm8ptckNlW2LDUbZg"
  },
  "NNcW3FOgoK5H3jjlKwhfuQ": {
    "date": "1/3/2018",
    "text": "While in town on vacation we ate her a couple of times and really enjoyed this restaurant. Our meals, even on Christmas evening, were served quickly, as requested and piping hot.  One thing I would point out to the management of this location: When a cashier / host is busy helping other customers and people are waiting to be seated, they should at least make eye contact with the waiting people and acknowledge them. A simple \"I'll be right with you\" would go a long way toward making people waiting feel like they aren't being ignored.  Our servers were on the ball and the cooks prepared our food just as we asked. Next time we're in Tempe, we'll be back for another visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D3O-yzZZuE9UB-O7b6R_AA"
  },
  "l8lqOqwYoWQXUb0vZKyFzQ": {
    "date": "7/6/2018",
    "text": "Stopped off at the Tempe location on an early Friday morning. First time coming here and there wasn't a crowd. Every time I've stopped off there is a line and wait which is a good thing as it's that's good. I had the chicken fried steak with biscuits n' gravy, country red potatoes, egg whites and watermelon (which was so fresh and sweet). Our waitress Veronica was very friendly and attentive. The service here is always great. Even when they are swamped they do their best with customer service. The place is always so clean and tidy. Never had a bad experience here. I highly recommend this place for breakfast, lunch or dinner. The portions are very hearty and you definitely get what you pay for and then some!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_1wryfROe7MKUUnJ202siA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_1wryfROe7MKUUnJ202siA/o.jpg"
      }
    ],
    "user_id": "nAFCw6DFy8uulYb1GODB2Q"
  },
  "ZkjV6jy16qCyG8x0WVQmRg": {
    "date": "10/23/2017",
    "text": "This place is pretty solid! They have a big menu with great prices and bottomless coffee is always a plus. The atmosphere is fun and the wait staff is also super friendly.   ALSO, I've had my fair share of bacon and this place has some of the best. It's thick and crispy and everything you would hope for in a piece of bacon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gRWkdkMwLqBVrwFrrTYOgw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. 2 egg combo with bacon and fruit instead of a biscuit",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gRWkdkMwLqBVrwFrrTYOgw/o.jpg"
      }
    ],
    "user_id": "WjPLEr26Y0nW_ZtCEymnDw"
  },
  "j-_mCFKrscmaN-PCHkxXgg": {
    "date": "6/14/2018",
    "text": "We love black bear diner, the food is great and the service was awesome and the place is clean and the food portions are huge and love it! But gets busy busy but worth it , we big fans of black bear!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qsHjgztFIHIBORiFjKzdhw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qsHjgztFIHIBORiFjKzdhw/o.jpg"
      },
      {
        "img_id": "5GE8Uw2i8YTWl811wHxItw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5GE8Uw2i8YTWl811wHxItw/o.jpg"
      },
      {
        "img_id": "1eIpQCVzN-afGyvrjoFRXQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1eIpQCVzN-afGyvrjoFRXQ/o.jpg"
      }
    ],
    "user_id": "UZz7ju-6IBEjp0S7OBOTjw"
  },
  "WqcdONcmBAXdiJFVyoIXpg": {
    "date": "1/25/2019",
    "text": "I really like Black Bear.  The food is always good and staff is friendly.  I've eaten here quite a bit and the food is always consistent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sMzMP5YfbwuL5dyA6-aHXw"
  },
  "4QVbgNJkCk2_xrNRoo57Kg": {
    "date": "3/11/2019",
    "text": "Went to the Tempe location near Costco on March 4, 2019.  Had to wait almost 10 minutes to be seated.  Then we were sat in the back at a table that had a fan/ac above us and constantly blew cold air down on our food as it arrived.  Had to ask for extra salad dressing twice.  Ordered the meatloaf and it was pretty watery and very bland to say the least.  I've never had meatloaf with big chunks of carrots and celery in it.  Was so watery that it basically fell apart when moved on the plate.  Obviously, they don't believe in using an egg and or bread crumbs to bind the meat together.    Asked for a Manager, and was told that they were currently busy.  Thoroughly disgusted at this point and left.   Went to pay the bill and had to wait almost 10 minutes for someone to come up to the cash register to cash me out.    Tried calling the restaurant after our visit to speak to a manager via phone since one was not available during our visit.  No avail.......phone just rings and rings and rings.  Tried calling again today, and the same thing.........phone rings and rings and rings and no one answers.  Called their Corporate Office in California, and told her of the issue.  She then tried calling the same number that I have been trying to call!  Hmmmm, guess what.........phone rings and rings and rings...........no answer.    HORRIBLE FOOD and HORRIBLE SERVICE!  Will NEVER GO BACK!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IGKG_VO1ck0IRbt__h8P7g"
  },
  "p7OoKLdEk7U3A3B64TnsoQ": {
    "date": "10/14/2018",
    "text": "By far the worst breakfast experience yet. After a 45 min. wait our food arrived COLD! Not just luke warm but actually COLD. My omelette I had ordered arrived sloppy and there was no cheese in it, just egg folded over. The pancake actually broke in 2 it had been sitting for so long. Super sad as I am a cook in a very high end restaurant. I really expected much more. Next time I'll stay at home and just do it myself....",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2KwB8PadXc5SVOWgGpUsOQ"
  },
  "UFGaiMt2iUZOPHliZXJc7Q": {
    "date": "2/7/2019",
    "text": "Cute, quiant place. A little on the pricey side but worth it! Feels like your in the Pacific Northwest.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ntRsoAbJa67pK-wECqs7zw"
  },
  "GmU6kGNyPYrVuF3Yxy_JIQ": {
    "date": "3/3/2018",
    "text": "I had to return on a Friday to take advantage of their special, \"all the fried fish you can eat\"!!  I was not disappointed.  Deep fried crispy and very flavorful  crusted cod fish, quite moist and fresh tasting.  Friendly staff, clean environment including the bathroom.  The fish came with coleslaw, great tasting french fries, and splendid tasting hush puppies.  The refill consisted of two large pieces of fish and two hush puppies, and the offer to keep bringing this plate until you say you have had enough.  For $10.99 this was the bomb.  I know where I will be eating many Friday nights.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "LXEgiSBjBpWaT4oX2kUo_w"
  },
  "tsLbb_rfn8Nh4bLGqFMwBA": {
    "date": "9/28/2017",
    "text": "My husband saw an advertisement for the Black Bear Diner and suggested that we check out their biscuits and gravy.  We arrived there a little after 10 AM and were seated immediately at the counter (we're counter people).  We both ordered \"Bear's Choice\" (we selected 2 eggs, 2 biscuits & gravy, 2 slices thick-cut smoked bacon).  We both ordered our eggs over medium and were very specific about the need for the whites to be completely firm, but the yolks runny (this is how medium eggs are supposed to be).  We also ordered an extra side of gravy.  It wasn't long before our food was brought out.  It looked wonderful, and the portions were HUGE.  We checked our eggs, and to our dismay, the whites were still liquid and runny.  The server said they would correct the eggs and took the plates away.  A short while later, our plates were returned with correctly cooked eggs, so we settled in to enjoy.    I was doing fine with the eggs and the bacon, when I tried a fork full of the biscuit covered in gravy.  There was absolutely no flavor at all to the gravy - I mean AT ALL.  We tried adding salt and pepper, but it was useless.  We waited for a good while for our server to check back with us, but finally gave up and decided to go eat elsewhere.  The experience was ruined - the gravy was what the dish was about.  We went to the front and got in line to request and pay our check (our server never brought it).    When we were trying to pay, there was difficulty with the credit card reader, so the manager came over to take care of us.  As she was about to run the card, she smiled pleasantly and asked how everything was...  We shared our thoughts about the meal and I asked if anyone bothered to taste the gravy that day and mentioned that they might have some quality control issues.  She listened, seemed genuinely concerned, and was very apologetic about our experience.  She then indicated that she could not let us pay for the food.  My husband and I both objected but she gave my husband his credit card back and would not take it again.  She indicated that she was going to go to the kitchen to taste the gravy herself since clearly something was out of order.  She just asked that we return to try dining there in the future.   In retrospect, I appreciate the manager's attention, and handling of the situation, but the eggs, and then in addition the gravy ruined our entire visit - and we had driven well beyond our zip code just to eat there.  We may return in the future, and if we do, I sincerely hope that I can write a revised review.  Our experience was in June and I hesitated to publish this review torn between how bad the food and service were, and how the well manager handled the situation. I didn't take writing this review lightly.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KdyEQujEJW2K4g72xyaDgw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Biscuits &amp;amp; Gravy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KdyEQujEJW2K4g72xyaDgw/o.jpg"
      },
      {
        "img_id": "WRR5UxygW07AXexP5VxAow",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Biscuits and Gravy.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WRR5UxygW07AXexP5VxAow/o.jpg"
      }
    ],
    "user_id": "1BcNXW9_Y16TIofPVpFqIA"
  },
  "DUplkY4sIosWYD-7YozFEg": {
    "date": "8/31/2018",
    "text": "We normally go there for the fish fry friday. And it is excellent, let me tell you. We have also been there for breakfast and other meals on different nights. All great food.  However, we kept getting the promotions in our email about the Burgers they have had recently. So, my wife wanted to go try them.  I got the Blazin' Bear Burger. It is a burger with cole slaw on the bottom, mayonnaise, pepper jack cheese, Papa Burn BBQ sauce, tomato & dill pickle chips. And it comes with french fries. Wow! I have to say this is one very tasty burger. We can only hope that they keep these on the menu.  Go get it before its gone.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-QZH7mJUYfaLwXFjG0yI8w"
  },
  "h8WZcdTkrncqhRRd0xDyhw": {
    "date": "8/30/2017",
    "text": "Went for the first time this evening.  Restaurant was fairly empty, seated quickly and we noticed a very clean and cute, decorated place.  Joslyn was our server and she was pleasant and very efficient.  We ordered the pot roast dinner with salad and blue cheese dressing, the smaller portion of the meatloaf, both had mashed potatoes sans gravy and I had the \"Italian\" green beans and partner had the corn on the cob.    Salad came and it was a great salad...fresh mixed greens with grated carrots and the dressing was wonderful.  Great experience thus far.  Then came dinner...the meat loaf was horrible; over cooked, dry, and just a very weird texture.  The pot roast was ok...no sauce (ok I did say no gravy for the potatoes).  The meat was tender but really had no flavor; I used some steak sauce to give it flavor.  The mashed potatoes were great!  They had red skins and were kept chunky and we really liked them.  The green beans were horrible!  They were not \"Italian\" style...they were your typical Del Monte canned green beans and they were swimming in a small little bowl with a ton of over cooked, placid looking bacon.  The corn muffins that came with the salad were tasty; sweet and corn tasting.    Joslyn noticed that partner didn't eat meatloaf and asked about that...she ended up taking the entire meal off the bill.  She didn't have to do that and I made sure her tip was what she would have gotten had we paid for the full meal.  She did a great job and we told her we would come back and try breakfast...she raved about the pancakes so we'll be back to give them a try.  Dinner?  Never again, thank you.       Two stars for the salad, dressing, muffins, mashed potatoes, and server experience!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "m1hh7pNYO7qMJcueiBwD_w"
  },
  "6PeUOu0knqPlV8WukoaraA": {
    "date": "10/13/2016",
    "text": "This location has only been open a week, so they're still working out some kinks. I noticed the servers rushing around apologizing for things find wrong and trying to make them right.   The pies in the case looked fresh and amazing but I didn't try one.  I had the hot turkey sandwich. The turkey was dry and nothing in the plate was particularly warm. I asked for some extra gravy which was hot when it arrived.  Apart from that, it's typical of a Black Bear Diner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qQXwfRkB9JbLa55mapxAIA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Hot turkey sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qQXwfRkB9JbLa55mapxAIA/o.jpg"
      }
    ],
    "user_id": "HjCfLjX6pbL-RSVuxRnHGA"
  },
  "kuhGYTI-YiYZB23N11wIdg": {
    "date": "8/31/2018",
    "text": "First and most definitely last time here :(  We waited over half an hour for our food (party of 4). We went during breakfast around 9am...the place was quite empty. Sat near the kitchen and didn't see much orders going out. Got our food and on a scale of 1-10 for flavor, texture, and overall it was a sad 3. One of us got the corned beef...it's horrible. Dry and flavorless. Absolutely nothing like the picture. I had the Hobo Omelette...again, flavorless although the link sausage was okay. Hash browns were mushy. We paid $80 for our meal after military discount. Think that came out to maybe $2 off our entire bill.   Kinda bummed me out so bad I didn't wanna try the pie and be that much more disappointed. Service was okay. Overall...McDonald's could do the same.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "E3HTXbblIQvlRSKso14kDw"
  },
  "UObEzQZ8Yg_GHNE6mLrfbw": {
    "date": "3/24/2018",
    "text": "Came here for breakfast with a friend and we got seated right away.. I ordered the scrambled bowl and it was pretty good.. our waitress was very attentive.. this location was a lot better then the other location we went too in chandler..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c40DTzCb-fHY6vI03PNRLw"
  },
  "g2j1KVubbDxluqkbGGVbLQ": {
    "date": "12/11/2018",
    "text": "Black bear is always a great choice for any meal. Their breakfast is amazing. I got the Shasta scramble with bacon and it was excellent. The staff is very friendly too. If you are traveling through Tempe and need a good meal stop here. Forgot to take a pic at the beginning but here's the aftermath haha",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QK_iAHo6OSEIcfcHOMlWfw"
  },
  "rc-4RfsklqJ3v4K1dj8MDg": {
    "date": "12/31/2018",
    "text": "Omg... huge amounts of food, good food, good coffee, nice atmosphere, friendly service. Will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6GKC6N1dNpsZf7XOt6EfRA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. We&amp;#39;ve always wanted to try here  So here we are... let&amp;#39;s see what it brings.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6GKC6N1dNpsZf7XOt6EfRA/o.jpg"
      }
    ],
    "user_id": "koRVMP65qg1E4aIrOCqv0Q"
  },
  "txGdzkzZImmNVwmCq3LqTA": {
    "date": "2/19/2019",
    "text": "Ordered an omelette and sausage to go. Told ten minutes, it took 20. Pretty sure my ticket didn't go in until I showed up. I did. I declined hash browns and toast as they do lot have whole grain. There was no sausage. Lady told me you can't substitute. I asked, well I didn't asked for a sub, I wanted sausage. So I paid $15(after tip) for an omelette and no offer to make it right. RIP OFF....NEVER AGAIN",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Apt4y4mlnW7QpVWdPf4RoQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Apt4y4mlnW7QpVWdPf4RoQ/o.jpg"
      },
      {
        "img_id": "mTtExQ_XkIYGbW3J7OkN6w",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mTtExQ_XkIYGbW3J7OkN6w/o.jpg"
      }
    ],
    "user_id": "goSOATAhrQg4FvTVzKoCoQ"
  },
  "nPoenX5ciIo2OCWcjpwM5A": {
    "date": "11/17/2018",
    "text": "This diner used to be great when they first opened. Now they are just mediocre. They changed how they prepare their country potatoes. Stopped serving pineapple upside cake pancakes.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cRd6chMRXBsL2ClzhRInuw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Had to get a side order of veggies for me country potatoes. Country potatoes used to be good when first opened. Now they DICE their veggies",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cRd6chMRXBsL2ClzhRInuw/o.jpg"
      }
    ],
    "user_id": "RIqtwbExvJCheqmlc6bqRg"
  },
  "LekYQyX0a6RH262c99MA-A": {
    "date": "11/26/2018",
    "text": "This review is from 9/24/17- I moved it to close a duplicate account.  --------- Ok, this review is only for one meal-honesty upfront. I've eaten at the Paradise Ca one, but only breakfast- which was pretty good.   With that in mind, I ran over to have a bite before a concert. I almost went to an old standby-Cafe Boa- because it never lets me down. But I figured I didn't want to pay 16.00 for dinner that night, and hence made a poor choice to go to the Tempe Black Bear Diner.  Was early, no wait (or maybe others have already decided ugh-not!) the waitress was sweet.  Brought me water that I took one sip of and gagged-tasted like dirt or mud. Sounds weird. It was crystal clear. Huh? I asked for bottled- didn't have, so I asked for another try. Ugh! Same dirt flavour. I mentioned it and she said that she didn't like their water either.  I asked if any drink they sold wasn't made with their water and she said lemonaid.  She apologised  and said she wouldn't charge me for the drink-since I didn't really want it. Since I was soooo thirsty I got that. Was good- but I NEVER drink sweet with dinner. Oh well  I ordered the meatloaf- don't know why. Guess I figured you can't screw that up.  You can.  It was so damned bland- was like eating unseasoned burger meat. Bland bland bland.   I just had to choke it down as much as I could. But the seasonal veggies were very good. That's what I ate all of. The mashed potatoes were bland too.  At the end, my bill was almost 16.00!  She had charged me the 2.75 for lemonaid. She was no where to be seen for 5 min- so I just paid and left.  There are SO many better-and cheaper places than this in Tempe.  Yeah, the bear stuff is cute. Go look at it- and eat somewhere else!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QOZxUF99ILhhs4XE764FPQ"
  },
  "jDlhNcEHcK1_Cr9OB3QjTA": {
    "date": "4/19/2019",
    "text": "Always have the greatest service at this location.  If you want down home cooking at a decent price with large portions and the friendliest staff, then you can't go wrong at the Black Bear.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QUXOIIB6Ka-r3xGXYxRa8A"
  },
  "sIwFgr2-uFMZmfmF2g0JRA": {
    "date": "5/11/2019",
    "text": "The worst black bear ever. Ordered the California omelet didn't come with any avocado. Then asked for my hash browns crispy they came out white not even cooked properly. Told the guy at the counter when I went to pay and seemed to not care about my concern. Took my breakfast to go and I shouldn't have to cook it properly at my own house. Never going back terrible customer service and food service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0qN481F6H_qd38zvGcRhgg"
  },
  "EeYu-c2ZN6N25p495OVZvg": {
    "date": "8/16/2019",
    "text": "all tables are dirty, took about 15 mins for a server to even give us water. we've now been waiting for our food for about 20 minutes and the tables around us are still dirty... not impressed",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sbwXVXYV43GTu4zRbt4dDw"
  },
  "BPkJNB8U7ZzXSwbE2FYTxQ": {
    "date": "9/23/2018",
    "text": "We tried this restaurant for Sunday breakfast.  The coffee is so bitter I had to send it back.  The next cup was the same.  The server was nice and accommodating. She said that other people have complained about as it and she thinks it's the brand of coffee.The decor is all about black bears, cute napkins and plates, suspenders, well branded.  But we were underwhelmed with taste of food.  I got a biscuit and gravy with 2 slices of bacon. The biscuit was not actually a biscuit. It was some kind of baked bread in a square shape. The bacon was super salty.   We were disappointed.  I won't be coming back here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cxMvDKS5pQSj2nVjRI4pmg"
  },
  "5irWD63wexlqkPGG470NDw": {
    "date": "4/30/2019",
    "text": "This was my first time here with my mom. I had the little less size pot roast which is the smaller portion. It was really flavorful. It came with green beans and mashed potatoes. Downside was the green beans were really salty so I needed something to balance it out so I asked for rolls. My mom had the little less country fried steak, she liked it and had no complaints of her food. Only thing about our time here was that service could be better. Our server only came around once when I asked her to; which was for the rolls. Other than that, she only checked up on the other tables around us and didn't come around for our drinks. Not long after we got our food, we were handed the check and not even asked if we needed anything else. Food is great, service could be better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nYzlPsuwq-1bhPjJKvpl-Q",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Little Less Pot Roast and my moms chicken fried steak she ordered",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nYzlPsuwq-1bhPjJKvpl-Q/o.jpg"
      },
      {
        "img_id": "3AsnyfJD3i3hF95jLG2zhA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3AsnyfJD3i3hF95jLG2zhA/o.jpg"
      }
    ],
    "user_id": "-ocbI1sGjtIpdb50S_nWCg"
  },
  "OQAb7MmdiaRfXt2U4ibC3Q": {
    "date": "7/1/2017",
    "text": "I went to my very first-ever Black Bear Diner in Grand Junction, Colorado back in 2008 with my dad. Ever since then, I wished for one to open in my area here in Tempe and one did this year. I've been to this location twice & have also ordered online & picked up food from this one. Great service, very friendly staff, & amazing food each time, plus a wide variety to choose from whether it be breakfast, lunch, or dinner.   I also recommend my friends to try this place. I always give places I like lots of good word of mouth.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Tc01_HjF5W7TlWUqW-IHdQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Tc01_HjF5W7TlWUqW-IHdQ/o.jpg"
      },
      {
        "img_id": "b1JlaNRmFEM7G-w22yhUUw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b1JlaNRmFEM7G-w22yhUUw/o.jpg"
      },
      {
        "img_id": "YCZOk5sMyzmhvjfbl5Jytg",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YCZOk5sMyzmhvjfbl5Jytg/o.jpg"
      }
    ],
    "user_id": "FqNJxZ3zkcF-o-QUXz4yeg"
  },
  "XbSb_c1M13JzTzLnpkz72Q": {
    "date": "3/24/2018",
    "text": "We just enjoyed brunch here, and this is our second time at this location (not to mention we've eaten at the location on Bell Rd a number of times). This is always a solid choice if you're craving breakfast food. I had the Shasta Scramble (a vegetarian dish) with a pancake and the boyfriend had their Chorizo Breakfast Burrito (without chorizo, since he's vegetarian) and ordered a biscuit. They have large portions, so you're absolutely getting value for your dollar, and everything is always cooked well. We enjoy their own brand of hot sauces that they have at every table, and we always walk away with happily full stomachs. The servers and staff are always friendly and eager to assist you. You can't go wrong with Black Bear!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "omSj_hJ7Qyt5XpygPWdyoA"
  },
  "oCvyQPTFrW-d1lSfLrwecg": {
    "date": "8/3/2018",
    "text": "Wow. What an awesome menu. The decor was definitely bear themed. Felt very comfy as soon as I walked in. Now for the food review: They asked if I wanted toast or biscuit with my order and I opted for the biscuit in which the waitress graciously asked if I wanted gravy on it....um ..hell yeah; it was so light and fluffy like a cloud with baby angels singing. The portions are not for the delicate eater. We came here for breakfast and I will be taking my leftovers, that's right I said leftovers, home for later. The taste......yummmm.  I will be frequenting this place fo sho. Can't wait to try those homemade mini pies",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PeOZn87_r1kdVSSDVP0TRg",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PeOZn87_r1kdVSSDVP0TRg/o.jpg"
      },
      {
        "img_id": "w80HSQX_jjxtbV4oj4e96w",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/w80HSQX_jjxtbV4oj4e96w/o.jpg"
      }
    ],
    "user_id": "Ord4M_Bx09A6LIvcxJcXDw"
  },
  "TgIA0R56fnwZovcSCrP96A": {
    "date": "7/2/2019",
    "text": "Horrible customer service. Went in to pick a to go order for delivery. Stood there for quite some time before I was at knowledged. Told the girl that I was there picking up a to go order for delivery. Overheard sane employee telling customers they were shortstaffed due to corporate only allowing one cook, one dishwasher and two servers for the whole night. Between the two servers helping me with the to go order the older lady was super rude to me and seemed very put out by trying to help me with that to go order then even complained and said she was going to turn off the tablet because she didn't want to deal with any more orders. The young girl was OK up until the point where she told me that I'm not the customer I'm just the delivery driver. As if the way I was being treated was OK because I'm not the customer!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6tt5UNPaBmGHhQjqf-f49Q"
  },
  "khRNYv-xJa1Mc9_0JRdk-g": {
    "date": "7/3/2018",
    "text": "I had the fit and healthy breakfast.  But it was not tasty.  I disliked the wheat toast, it tasted weird (old?), the fruit cup was not fresh and fruits weren't sweet at all, fruits looked slimy especially the watermelon and strawberry.  The egg white mixed with cheese, chicken sausage, mushrooms, spinach should have worked but it is put together in such a way that it looks nasty and it tastes wrong. Chicken sausages are brutally chopped sometimes in tiny pieces, sliced or torn in chunks, like a murder scene.  Food was slapped on my plate like a punch on my face.  BUT Staff is nice and helpful.  My hubby picked the waffle with sausages and eggs. Waffle wasn't cooked thoroughly. Small OJ (minutemaid) costs $3.49.  It is my second time at the black bear. Shame on me!",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 6
    },
    "photos": [],
    "user_id": "ByNfFYaW544SRchjvAHscw"
  },
  "DvV0tSi_J7rmHLyDIWOO4Q": {
    "date": "2/26/2019",
    "text": "Extremely mediocre food. Everything tastes processed and bland. The waiter asked if I wanted a box for my mostly untouched meal, and I declined, because I couldn't bear the thought of trying to put that food in my mouth again! To top it off, they're not cheap, and the place doesn't look particularly clean either! Kind of like a bear-themed Denny's. So if you want school or hospital cafeteria-tasting food at higher prices, this is your ticket!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUz9iPWNfcZr_kvcv4TahQ"
  },
  "nHGnVsggYVwJKDSTaXx6pg": {
    "date": "11/30/2018",
    "text": "A cozy cabin-like diner with lots of charm, friendly staff, fast service, and surprisingly good food! They have their own brand of ketchup which you can taste the difference, excellent fish fry and tartar sauce, and their BlackBerry cobbler is incredible. Our waitress was very sweet, and we plan on coming back another fish fry friday. Only complaint would be my wife's coleslaw, very dry, needed a lot more mayonnaise. Oh and by the way, love the menus, very unique...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uPMWadUbToCZWhdkYEIxWw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uPMWadUbToCZWhdkYEIxWw/o.jpg"
      },
      {
        "img_id": "VYXu_hP7NLH5CsSXyTWAtg",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VYXu_hP7NLH5CsSXyTWAtg/o.jpg"
      }
    ],
    "user_id": "pbcjyIi9JZIKXhJzkUT31g"
  },
  "gO_fE7wNevz1gNxu-9uang": {
    "date": "7/16/2018",
    "text": "We ordered BBQ ribs and chicken and waffles. The chicken was burned very dark but was edible and the waffles were as expected.  The BBQ ribs however were very very bad in taste, texture and appearance.  They were plopped on the mashed potatoes and beef gravy puddle discovered after looking for our sides- lifted up the ribs and found them under the bbq puddle in a big brown/red mess. They tasted like Old bay and Old shrimp? Beware of the bbq!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "udRT2F8zX0tkh7-S4nVkig"
  },
  "0IlwXRlbPjfREsCel_5kWQ": {
    "date": "9/22/2018",
    "text": "I lovely little find for a neighborhood diner, covered in bear decor  truly adorable. Felt like we were back in Montana. Great for breakfast very friendly service. Loved the pancakes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XqPKDAzS9_Ur55YXR9X8IQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XqPKDAzS9_Ur55YXR9X8IQ/o.jpg"
      }
    ],
    "user_id": "ArkziPhx3oRRZ2pDIz7GQQ"
  },
  "oqI20n_4vozvpNSycnRqzA": {
    "date": "4/9/2019",
    "text": "I was there food was delicious we invite friends for the first time they love it, my husband order ham and eggs, and I order fried steak chicken everything came to the table on time our server stop by a lot times to make sure we have everything need it even the manager show up to ask how was everything and take some empty plates from our table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DN3Ph1DnqPo7zxz_6N2t2Q"
  },
  "YnNU3hwnypZ9HAbf7SQduw": {
    "date": "12/23/2018",
    "text": "I gotta tell you, read Credo # 4 n believe they are serious about their serving sizes  we had chicken fried steak n it was very yummy. Try the meatloaf dinner too, plenty of food.  We had \" little less\" portions, but filled us to our satisfaction. Saw they are are over the West Coast. We'll be stopping in at various locations. Payton served us tonite at the Tempe location, she's a GREAT waitress",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "x8-1qoDJ6X2IoI6CiV41kw"
  },
  "SISMRRcCR4-1NfAkTh52Dg": {
    "date": "1/29/2017",
    "text": "The food was OK, but the wait for it was WAY too long and frankly it seemed like a pretty expensive check for two of us.  And I could DEFINITELY do without seeing the line chief place her grimy shoes on the low coffee-cup shelf so she can step high enough to reach the pass-through from the kitchen.   Won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s7xT3jT_BZQiYAaNR9iDTQ"
  },
  "sAK1tD37S57gKmpTJzCWZA": {
    "date": "6/17/2017",
    "text": "I would have liked to say my experience was above that of other estabishments, however, the wait on a Saturday morning was unreal.  Our host did set the expectation for a 25 minutr wait time while the kitchen caught up. Huge flag.  This made me feel that they werr not appropriately staffed.  Then as the lobby began to fill with many familys the story was the same .  If i was waiting 25 minutes just for a seat there was no way that others would wait the same 25 minutes.  Then people who had already been seated began walking out because they wait once the got seated was lo g as well with 1 gentleman proclaiming in the lobby that 2 other familys were served before his family was served and they were there first.  I did not need much more after this.  While it is possible that this estanlishment is fine enough, this was not a great first experience so i went across the street to Crackers where I walked right in ordered my food and got o. With my life.  Maybe ill try another time when i have more than 25 minutes to wait in the lobby.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jB_7-N3oJc3wVX5vtZiMrg"
  },
  "A-GFJZIOsncAhgQdIGtwyA": {
    "date": "10/29/2016",
    "text": "Not going back to this location! We did have good service and the place was very new and clean! But our food was cold, we waitress ask how we were we said our food is cold and my eggs were over cooked. She took it back and brought it back well eggs still over cooked and potatoes was warm but not crispy like hash browns should be. Nope won't be back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ewUpAmp89fEQ65E9WfZzw"
  },
  "EL_ioMoP04zCwUsD2K1B4g": {
    "date": "4/23/2017",
    "text": "Horrible experience.  Bad food, rude hostess, inaccurate wait times, slow service and overall a waste of money. Take your business elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2AaBuMSH86u6k9Yh77LkIw"
  },
  "ck4U5VxMd4tBb2dawv-J0w": {
    "date": "9/24/2017",
    "text": "Stopped in the Black Bear Diner today around 11 it was crowded and busy as usual. Plenty of seats at the counter set down they were quick to take my order. Took a little while to get my drinks but I understand it's busy on a Sunday morning. I asked the waitress what she recommended between the turkey club or the burger? She said her all-time favorite was the turkey club that was my first choice so I went with that. Once again wait a little while for the food but not excessively long. They serve my turkey club and I went to eat it and I noticed the sandwich only had meet in the middle nothing on the sides mind you it was wheat bread toast that was your average size white bread so not very big slices. So you would expect there would be plenty of meat on such a small piece of bread literally there was one slice of turkey one slice of ham one slice of lettuce of one slice of tomato one slice of bacon not what you would expect from a turkey club. I think this place is more of a breakfast place since they do a great job on breakfast a very poor job on sandwiches. Not sure I will ever go back there if I do it will definitely not be for lunch or dinner. Sorry I didn't take a picture next time I will.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBjf04yPkgBSd99AAweIrA"
  },
  "H9yvht0AWEaVMa2YHmXXUg": {
    "date": "11/24/2016",
    "text": "We wanted a new tradition of not cooking on Thanksgiving and no family stress and a laid back meal and we found it at Black Bear.  I had fried chicken and my husband had turkey!  Yummy!!  Welcome to Tempe!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ydyXasiSMv6wObYYgrFWlQ"
  },
  "Ms09ok9RFl9a-O0aX4Atvg": {
    "date": "12/26/2016",
    "text": "Waited 30 minutes to be seated, waited 30 minutes after food was ordered.  Restaurant was full, but only had 1 bus boy.  Ran out of hashbrowns.  I ordered an open face turkey sandwich - surprise!   They ran out of gravy !  Didn't even offer to comp the meal.  A rather unpleasant experience.  Doubt I would go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0nO5046oVcXVVXLbGS1XSA"
  },
  "J1JcMNngneJ3gRscRcnz6g": {
    "date": "3/1/2017",
    "text": "Equally as important to me as the quality and price of the meal is the professionalism and eagerness to satisfy of the management and staff. I am not impressed with huge portions but rather quality good tasting food. The food on both visits has been fine, prompt, and tasteful. I have issues with a server that doesn't listen intently and a management team that doesn't either instruct on customer service either initially or when a situation is brought to their attention. Listening is a required trait in the service industry, the old and well written quote is \"listen to understand rather than to respond\". No matter the industry when listening to take an order, directions, or instruction clear your mind focus on the person speaking and LISTEN.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zJoGZJe0CN8cHUTEIKOfzQ"
  },
  "a1ZQid1qLOVRQ7VrLkzj0Q": {
    "date": "10/22/2016",
    "text": "very disappointed with the service took 20 mins to get our drink order in and had to ask who our server was. we wanted soup and half a sandwich at 12:30 they said we are still doing breakfest so we then orederd the turkey sandwiched it was dried out had to return it",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qWE4OccgyPJkrjBZ-7Fu2A"
  },
  "FAMMTSyeUi5VWUV9YFOhjg": {
    "date": "1/28/2017",
    "text": "Great food...everything was fresh! Servers are nice welcoming and are nice to each other and support each other. The hostesses need some serious training for all the seats to be open and they tell you 25 minutes. We sat at bar!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLZvJqECXHGmlmpM0jH8cA"
  },
  "GzXFZIt_7ml2N5Vx7N2Nmw": {
    "date": "10/15/2016",
    "text": "this place is awesome their exellent customer service is consistent in every location I have been too our server was very attentive and friendly my grandma has been to various locations around the country and this is one of her favorite go-to places when she's traveling",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L1sF_ABVplSqMuIE0Ow56w"
  },
  "IBrXeFmqApL6kkvPKTjC8A": {
    "date": "12/30/2016",
    "text": "Took my parents on a Monday to black bear dinner on priest and elliot in Tempe , Nice place, Short staffed took 40 minutes to be seated ,Ther was clearly plenty tables avalible but we still had to wait , When we ordered we asked for crispy,crunchy hash browns,our eggs where runny again for the second time the hash browns where not fully cooked , I took them home to fry them my self , this is the third time in a row I been there and we had to send something back . the staff apologized for being short handed , My parents have  diabetes and need to eat ,so waiting 35 to 40 minutes to order and then waiting for the food , If you are diabetic you might wanna bring a snack for the wait last time entry plus exit time 1.5 hours, Customers from the neighborhood , thank you very much",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2m8brU3HQFpzxnr_u5ah_Q"
  },
  "7BHmsd1gSKwO8udMlcMGFQ": {
    "date": "12/29/2016",
    "text": "What's up with the loud music???  The music made it difficult to talk with my partner who was sitting across the booth from me.  It reminded me more of music that should be in a 50's diner.  The service was slow and the food was inconsistent.  My country potatoes were plain; my partner's country potatoes had a large amount of onions 'thrown' on the top of them and even in the fruit that was ordered as a side.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3GqEkJ09YNh5DuT8Qat23w"
  },
  "OwxjuVNTWUHAYp9HCrRUaA": {
    "date": "12/28/2016",
    "text": "Wife and I went first time I've ever been to a black bear diner. The food was very good it reminded me of grandma's cooking. We both got the chicken fried steak and the portion was huge! The price was more than fair for what we got. Not sure what the bad reviews are talking about i thought it was great! This is my new favorite spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G1qXkV1K9oEgyFhQZeF-iw"
  },
  "fClSFWM7leVTl61LaFlwAg": {
    "date": "11/12/2016",
    "text": "We love black bear diner. We were driving 30 min every week a for breakfast date, but now this location has open (conveniently 3 min from home!) we had to try it. Black Bear Diner you never disappoint, food was great as always, service on point and bacon was amazing Thank you for a great meal, fast service and all round wonderful experience. We will be back next week",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDzzFGO6D0vnHJ4QLrdVzQ"
  },
  "Mz5T-YM-It-f6GjphxBMhQ": {
    "date": "10/23/2016",
    "text": "On Saturday, October 21, 2016 for the first time I had the opportunity to patronize the restaurant Black Bear Diner in Tempe, Az. Upon arrival we were seated almost immediately. The hostess was very friendly, led us to our table. Cassandra was our server, and she was VERY hospitable. Then it was time to order food, so we did. When the food arrived, all I could say was \"MY WORD\". Because the portions were humongous, and of course I couldn't and didn't finished mine. All in all EXCELLENT food and a great variety as well. I also liked how we were checked on quite frequently from time to time by Cassandra and by the manager. I will be back and most definitely recommend you to others. Keep up the good work!!!!!    Kevin",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "auD28BmAogiF3iPILcJIog"
  },
  "PBnx6YT9w1p-mwYND7GaDw": {
    "date": "10/22/2016",
    "text": "We were pretty stoked to learn that this location opened up in our neighborhood. Had breakfast there this morning and, as always, it was great. Forgo the usual corporate chains and come here! I also need to mention that our waiter, Andrew, was excellent (and that's a lack of a better way of saying it, he was so rad.)  Take note Tempe BBD: he's definitely an asset to your restaurant. I'd be certain much of the staff is as great too. 5 stars all the way round for Tempe BBD!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X5p43ec6GN4LLoNWUcfZAA"
  },
  "qSeWqstyrNegLbvq3zVC2g": {
    "date": "10/17/2016",
    "text": "One of the worst breakfast I have every had. Hash browns were undercooked and not hash browns but potatos cut like flat noodles. Eggs looked like they cooked them a large number of other eggs was a yok with a little ring of white around. At least half of our group had something missing from their order. Took forever to serve food. O yea they biscuits tasted lile baking powered.. Basicly horrible from start to first. Some if of our party didnt eat all and went to jersey mikes after",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xg1TTndGmGlHR3se66EPiQ"
  },
  "CEej-n_MfihI2ppCcABiNQ": {
    "date": "8/29/2019",
    "text": "I confess. I am at work and am craving pancakes. I didn't want any wimpy, flavorless pancakes, like they have at Denny's or IHOP. I'm a Scottsdale girl and on weekends, we visit Butterfield's to satisfy my pancake needs. Needless to say, the bar was set very high.  I did it. I actually ordered pancakes and bacon from BBD for lunch while at work. The description said \"Sweet Cream Pancakes\" and I could hardly contain my excitement, since I work down in Chandler and could not get to Butterfield's.  Oh. My. Gosh. The pancakes at BBD arrived from DoorDash piping hot, with loads of syrup and three pieces of bacon. The entire office had their heads held high, noses in the air, wondering who in the Sam Hill ordered BACON for lunch while at work?! I ran back to my office, pancake contraband tucked under one arm, and excitedly unwrapped my treasure.   Good Lord! They truly are sweet cream pancakes! Divine, soft, buttery pillows of yum that made this Thursday even sweeter. If you've got a hankerin' for real pancakes and can't make it to Butterfield's, give the sweet cream pancakes at BBD a try... you will likely need a nap after but it's well worth falling asleep at your computer!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gmTzAjxjkhAv9gIlw-sumQ"
  },
  "_5SJEqsTUlouVW0-Lx-MoQ": {
    "date": "8/4/2019",
    "text": "I've heard about this chain when in CA and saw that it was also in AZ, so I decided to give their pies a try. They only sell individual pies, each for $5.99, which didn't seem too bad, until I tried it.  First of all, I was assured they use fresh whipped cream on their cream pies - 95% sure they do not! It tasted like that cool whip stuff just piped on top of a very thin pudding with scant amount of coconut. There was no body to the pie and could have easily been a frozen pie that was just thawed. The chocolate cream tasted a little better - a little fluffier - but similar to the coconut, was too sweet for me. From the top to the crust, nothing had texture.  This makes me miss Marie Calendars in CA and House of Pies in TX!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-_PGr7SyZp8JlxMMr-E15A",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-_PGr7SyZp8JlxMMr-E15A/o.jpg"
      },
      {
        "img_id": "QJeRgwxxIaN1fZuJ7ym2BQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QJeRgwxxIaN1fZuJ7ym2BQ/o.jpg"
      },
      {
        "img_id": "QYZFUrhZUhh9b6snytL0_w",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QYZFUrhZUhh9b6snytL0_w/o.jpg"
      }
    ],
    "user_id": "5DvwqSHmn7olufoz8em3Dg"
  },
  "Rb8tjnHOU4ONZMq9nEIWDQ": {
    "date": "7/24/2019",
    "text": "It's good comfort food, but each plate has about 1,000 calories (or more).   Best thing about Black Bear Diner: the coffee!! It's SO good I bought a bag of it online!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IoBl8D62hnDZwATcRi4MSg",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Open-Faced Hot Turkey** (1200 cals.)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IoBl8D62hnDZwATcRi4MSg/o.jpg"
      }
    ],
    "user_id": "ppe_9TpKKoYqiVirWr92Pg"
  },
  "Ue8cbbbpo8MeXUeuEF8gNQ": {
    "date": "7/2/2019",
    "text": "Love BBD! I always come here after work with my closest co workers. We work graveyard shift and of course by the time we get off is 7 am which is breakfast.  I always get their NY strip steak with potates and scrambled eggs. I love meat! Oh yes and my small self can finish all of it. The steak is flavorful. Its not plain like most restaurants with just their salt and pepper on their steak.   Sometimes if I dont crave meat I'll get their ham, or bacon, with eggs, and hashbrowns. Also with two soft, fluffy pancakes. Its a lot of food so make sure you come here super hungry. Unless you want to take food home to go.   This place is good. Way better than your average ihop, dennys, or other breakfast places. I'd go to black bear for some awesome breakfast. They never disappoint me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Qa1YaAtpT0nuqwL9-A6m9w"
  },
  "CTRs8DSTdOychUJGcMboVQ": {
    "date": "3/16/2019",
    "text": "This was our second visit here and a year or more had passed. We were excited to have a good, hearty breakfast. Once we entered, things went wrong.  The host mumbled something at us that sounded like \"Would you like to be seated?\"  Why of course! Why else would we be standing here?  We said yes and headed back. He turned around and mumbled something again and I just nodded. We were seated at a table for two. Five to 10  minutes later, another couple was seated next to us.   We placed our order with a nice server and relaxed. After waiting a bit, and starting to feel like our order was taking a long while, I saw our plates float by and delivered to the table next to us. Hmmm... We were here first and got out order taken first. Come to think of it there is my husband's special and my bacon and eggs. The look on the woman's face as the order was placed in front of her was shock. She told them it was not her order and it was whisked away. The man kept my husband's special and began to eat. Shortly after, our server returned with my dish and told me it got delivered to the wrong table. No way was i going to 1) eat a plate that had been in front of someone else 2) eat cold eggs.  I asked for them to re-do with my order. The server apologized over and over and I get it, he wanted his tip.  It took about ten more minutes to make our order. Frankly, I was ready to walk out. My husband's order was correct but I don't think mine was re-made. I'm pretty sure my SAME ORDER was plopped down in front of me. I asked for scrambled eggs but what I got was an omelette chopped into pieces. Come on! You don't think I know what scrambled eggs should look like? Truly disappointed.   Our server returned and I asked for coffee. What I got was probably the worst coffee I've ever had. It was so weak it was practically undrinkable. Yuck. The saving grace? The bacon. It is really, really good here. If you love bacon, you'll their bacon here.   Bottom line, we won't be back.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "QRIwNQ-aITpcOi9agWFA4Q",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QRIwNQ-aITpcOi9agWFA4Q/o.jpg"
      }
    ],
    "user_id": "DvDEccGguYTxxPDNU35y8w"
  },
  "oP2uU2wQh4Twwh3zr6NFrQ": {
    "date": "8/8/2019",
    "text": "The food is delicious and hot.  Our server,Tarissa was excellent!! The diner is well kept up. It is also fun to see the things they have for sale. My granddaughter and I came together and she loved everything we ordered including mine!!! Ha ha. we will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MtPAmhvreKTXZSltpj7eTA"
  },
  "brbL-U48t3lYMYUzrKq6Ew": {
    "date": "7/10/2019",
    "text": "In my continuing quest for good food at reasonable prices, I was convinced by two companions to try Black Bear Diner. They are a chain of about 50 restaurants in the western states. We arrived at dinner hour and were promptly greeted and seated. The atmosphere is a bit eclectic and kind of reminds one of a hunting lodge in the mountains.  Our waitress came promptly to the table and asked about drinks. The menu is written on a kind of newsprint, and makes interesting reading. Apparently, each one is tailored to the state it is printed in, and is replete with interesting facts about the state.  Companion 1 ordered the Cobb Salad ($8.99). The portion size was enormous, and two could have easily made a meal of it. Nice smoky bacon, a large portion of blue cheese, and tons of assorted salad on a plate that was more than 12 inches across. Companion 1 was unable to finish half of it and ended up with a doggie box to take for the next day's lunch. Companion 2 ordered the Bacon Burger ($10.49). I'm not sure, but I'd bet that the patty was a half-pound of meat. By the time it was all stacked up with all the fixings, I couldn't figure out how anyone could get their mouth around it - but companion 2 managed it along with the cheese on it and a portion of onion rings instead of fries.  For myself, I ordered the Chicken Fried Steak. It came on another huge plate (a necessity for the size of the portion) along with mashed potatoes smothered in gravy and fresh cooked assorted veggies. There was little doubt that the veggies were cooked to order as they were still a little crisp and done to perfection. All this came with a delicious corn muffin to add to the calorie count.  None of us could avoid desert. Other than Washington State and Oregon, I've never been served anything with huckleberries - perhaps it's because the bears like to eat them as much as the humans do, so they are expensive and hard to come by. Nonetheless, they had huckleberry ice cream - the only correct word for it was yum! Companion 1 had it over a deep dish cherry pie, and companion 2 had it as a shake. Neither of my companions could finish their deserts. I had mine as a simple ball of ice cream in a dish, and just managed to finish it.  I have also had breakfast there, and once again the portions are huge. You will probably need a wheelbarrow to exit the restaurant, but the food was delicious and I love the bottomless coffee pot. This is a place that knows how to feed a hungry person. If it is crowded, its well worth the wait.  Service was outstanding, and everything was nice and clean. I give them 4 stars for quality, portion size, and cleanliness.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SCYd8BnpdTCoGIFUIw_SWA"
  },
  "BkMdiXkI1lJ7f9_iC_d_1g": {
    "date": "8/6/2019",
    "text": "This place has a good standard breakfast. Their kids menu is great. It includes ice cream for kids after 11!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sJouxPqItZ1X2-ac1U8AVQ"
  },
  "uJKBLhWBcl_saT4hbhjMdQ": {
    "date": "8/24/2019",
    "text": "Service was slow our food was cold when we got it, they forget our sides we had to have the hostess call our server to the table, they did not check on the table we had to flag our server every time we needed something except the check, the portions are large but id rather have smaller portions of hot food. Prices are not bad for the amount of food served",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iX5SZwIMRvNVtbBu1e_u1w"
  },
  "68QEnAxwFLx2ZFL9W8b6ng": {
    "date": "12/2/2018",
    "text": "Awesome Birthday Breakfast For Hubby  Pancakes Fluffy Biscuits Unreal ! Sorry No Room For Much Else Today This Is Breakfast Lunch & Dinner !! Staff Friendly But Seemed A Little Slow Considering There Were Only About 5 Tables (Went Late 2 Avoid Rush)**",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wSgExeMR_DK4mh8QmzqR5Q",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Huge Shareable Breakfast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wSgExeMR_DK4mh8QmzqR5Q/o.jpg"
      },
      {
        "img_id": "wuS16JogU9S1_eFpgLvGIQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. This Is @ Monster Biscuit!! Black Bear",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wuS16JogU9S1_eFpgLvGIQ/o.jpg"
      },
      {
        "img_id": "BKQxg37APaDlFsTv1PzOUg",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Giano-rmous Biscuits !!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BKQxg37APaDlFsTv1PzOUg/o.jpg"
      }
    ],
    "user_id": "dDmCuTlCJGEbyJmv8AZa3w"
  },
  "21_lbCQyfmI9R2G6-dpt_g": {
    "date": "1/30/2019",
    "text": "Working around the area. Came for breakfast. So glad I did.   Halee was my waitress she did great checking on what I needed and was very friendly.   I had the California omelet with added bacon. I had the biscuits with added grave. Holy cow the portion is large! So tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Babo0n2KnLtwzLbqHxxICA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Babo0n2KnLtwzLbqHxxICA/o.jpg"
      },
      {
        "img_id": "PSUwdyJiXid2DS9OclChRA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PSUwdyJiXid2DS9OclChRA/o.jpg"
      }
    ],
    "user_id": "9SF8ZrMWlehvxh-Kk0DqdA"
  },
  "EBfNxGzaJcksu2a1Mvbt8w": {
    "date": "4/27/2018",
    "text": "This is my second time eating lunch at a Black Bear Diner, the first one was in Fernley Nevada. The in Tempe met my expectations.  I had the bacon cheeseburger (cooked medium well), fries and iced tea. I also tried their homemade bacon dip for the fries which was pretty good. They have an assortment of sauces so I tried the chipotle sauce on my burger which was flavorful and fairly spicy. I'd say the food at the Black Bear Diner is traditional American food with some good variations. The iced tea is just iced tea but isn't bad.   The atmosphere is like an alpine lodge with 50s diner music piped in. The AC works well so bring a sweater. The only thing I didn't care for was being seated right by the kitchen doors when the restaurant was half empty, but since it wasn't super busy it wasn't that much of a nuisance.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f6AUyq9URHBJJosvRUWptw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f6AUyq9URHBJJosvRUWptw/o.jpg"
      }
    ],
    "user_id": "tDO7sFFz004X2oH_gU9adw"
  },
  "FoLxOWYxhMiLeP8K1-ywQw": {
    "date": "7/12/2019",
    "text": "Black bear diner is cool. All of the people are nice, and they're pumping out the classics, pancakes, waffles , french toast. Sammiches , meatloaf. Salad, if you're into that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3I-OTb3ElEiJHEUhOfQIZw"
  },
  "gxJvTM7wV5qxOJLZ6g8H0w": {
    "date": "11/1/2018",
    "text": "Wife and I came in on Oct 28 for my free birthday all American breakfast which consisted of 2 sweet cream pancakes, 2 eggs, 1 sausage. 1 bacon and my wife had a BLT from the lighter side menu.  It did take awhile before we were served and it did take awhile to get our check.  All in all, we loved the food... server apologized in the beginning.... it's sort of like Denny's.... service sporty but the food is great..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wOenaEKa35XcmbKmcUU4WA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wOenaEKa35XcmbKmcUU4WA/o.jpg"
      },
      {
        "img_id": "FeFaRJKH5PZpyQhc5fqs0Q",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FeFaRJKH5PZpyQhc5fqs0Q/o.jpg"
      },
      {
        "img_id": "EIQ87Bs7PPkE7iYj5bsCbg",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EIQ87Bs7PPkE7iYj5bsCbg/o.jpg"
      }
    ],
    "user_id": "GRJocDslz2yHCODF_c8ioA"
  },
  "Scp3A67oRLDGJBrkMm84WA": {
    "date": "8/17/2019",
    "text": "Food was good however overshadowed by the fact we waited 27 minutes for breakfast and it was not busy. The place just needs a good cleaning starting with the bathrooms and the carpet.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B9u27ovHgR0R41TBj9EEGw"
  },
  "5NFi7Q7ZObeHFZbdA3jA0Q": {
    "date": "3/31/2019",
    "text": "This place has only 3 stars?!!! No way! The food portions are huge AND delicious! The staff was very friendly. Atmosphere is cute/Adirondack style and comfy. Get in to check this place out!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bjdbYKEed7zBfDKirGKh5w",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bjdbYKEed7zBfDKirGKh5w/o.jpg"
      }
    ],
    "user_id": "5NA4jrLs96YTufCAGPyD8w"
  },
  "YlRByBozJqP7nRQpsBCgPA": {
    "date": "7/19/2018",
    "text": "The big thing I have to say for this restaurant is that it is cute! From the rustic cabin decor, the individual desserts with little flags in them, to the menu being printed in a newspaper. This place just screams adorable. The service was very good - your casual diner with the waitstaff that treats you like they have known you for forever. The food was surprisingly good. Seasoned well, cooked correctly - the burger I got was even medium rare! The potato salad was the most interesting because the celery and the black olives in it brought an interesting flavor and texture profile you normally don't get in potato salad. The only negative I have is really with the garnish. My parents and I all ordered sandwiches and got a tini tiny pieces of watermelon that looked so out of place with the rest of the food. My dad's piece of watermelon was cut so thin that it was transparent. He was able to pick it up and wave it like it was a flag for surrender. It was very entertaining when it was not supposed to be. This place gets a five because it went above and beyond my expectation for a chain diner restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xczNXONvAcjcLcI4NhEqKw",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xczNXONvAcjcLcI4NhEqKw/o.jpg"
      },
      {
        "img_id": "P6nMp8cQrNXIseaX9DxnZg",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P6nMp8cQrNXIseaX9DxnZg/o.jpg"
      },
      {
        "img_id": "zpU9i2FWqNLiE1g6QCoZpQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zpU9i2FWqNLiE1g6QCoZpQ/o.jpg"
      }
    ],
    "user_id": "srx_nUpba8cwwzdcZunaCA"
  },
  "urSzYK0osrlUFeRPf-hWTg": {
    "date": "5/13/2019",
    "text": "Service is always great the amount of food you get is just unreal and all  for a great price",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nslrSJiGguYl-K8witAhyA"
  },
  "mPukiKqF_nM1FzncR7mdQw": {
    "date": "6/27/2019",
    "text": "Starting off with food was decent. We had to wait about 25 minutes to be seated after hearing 3 different reasons to why it was taking so long with only one family ahead of us. After being seated at a very small booth for 4 adults and one child(there were bigger booths around where we were seated)we were told it would be awhile before we got our drink orders, which was a nice heads up even though there was maybe 8 parties already seated. The hostess took our drink orders which was nice. After being seated it was about 10 minutes before we were able to place our orders, which was not an issue. After placing our orders we had an HOUR wait before four of the five meals were brought to us, and another 10 minutes for the sandwich to arrive. I've visited other black bear diners that were busy(this one was not) and never had an experience like this.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nMtd6mpljJRq67MQT6wmhQ"
  },
  "mqa6GVhmzl3WAuM83J5x1Q": {
    "date": "6/9/2019",
    "text": "The food was amazing! I will say the service wasnt the best thing. but great overall!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zin3GA-TCF6dvXIudCTlJg"
  },
  "X34dnV6CIUa9vA-Ve_NVOw": {
    "date": "10/8/2016",
    "text": "I cistitis the store on Thursday this week and was amazed on how there were no people there, the restaurant is new so it super clean and everything looks new. The food was delicious as usual and the waitress was super nice. This place is great for breakfast! Much better than IHOP or Denny's",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_529dpeTlh0S55193wdEaw"
  },
  "C5JOWgLcmvePGENb46eI4Q": {
    "date": "12/3/2016",
    "text": "Came to black bear 15 minutes wait get in. Our section about ten empty tables. Still waiting for food another 20min later",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xlErhLFkdZpttQcqNk2JBQ"
  },
  "fuSoZKc09UhOCLyQY0L91A": {
    "date": "10/23/2016",
    "text": "Came here hungry for breakfast - only waited about 30 min for a table (on a Sunday morning). Everyone from the hostess to the servers were extremely friendly and attentive.  The oj was fresh squeezed - delicious!  And the pancakes were huge!  Definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HeoTVaFlRFeFcZKBT4UyFg"
  },
  "TbmtKsmMoQv5WfvLLW8_ug": {
    "date": "10/20/2016",
    "text": "A great family place with huge portions.  Fresh is best and that's what's served.  No canned food here.  Our server, Amanda was very pleasant and helpful with menu choices.  Our host was very accommodating when we wanted to change our seats.  Next time you're in Tempe, AZ and looking for some good old fashion comfort food, come to the Black Bear Diner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yTA4i1c4KYaXlFFAcbI6Iw"
  },
  "FcIdGBIDnEiiL9LtHOOiMw": {
    "date": "1/14/2017",
    "text": "Very friendly people!  Very busy which does suck at times but it is busy because the food is awesome!  I have only had the breakfast food--- Omelettes and Cinnamon Roll French Toast!  As good as it gets! I highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WcGExRkvFY7Zuu5LmbKA9g"
  },
  "EcON0QbB79S-Ws107hdYdw": {
    "date": "1/11/2017",
    "text": "Black Bear Diner is great! Awesome food, large portions, great variety! This comfort food has a home-cooked taste just like Grandma used to make. The restaurant has a quaint northwest diner feel, and the staff is very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oPzt_3KHAQ5-xtTE3T996A",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Black Bear Diner chicken fried steak! Some of the best comfort food!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oPzt_3KHAQ5-xtTE3T996A/o.jpg"
      }
    ],
    "user_id": "uMqUy9ELjvhiW6_jD47Xaw"
  },
  "7oviDNpV2y1biFlKSb8_bA": {
    "date": "10/30/2016",
    "text": "First time here and I had the huevos rancheros and my hubby had the chicken and waffles. I probably should have stuck to something more traditional for a place named Black Bear Diner. It was tasty, but the potatoes it was served with were cold. The salsa was hot, meaning steaming. Eggs were supposed to be over medium, but only one was, sort of. My hubby loved the chicken and waffles! Service is a bit slow, and a second cup of coffee did not come until the end of the meal. What makes me willing to come back is the attitude of our server, David. I was very impressed by how upbeat and positive he was. Because  of him I will be back and try again. I will say that the place was nice and open and airy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S_g2T3bW8AnMbmda-SPWvg"
  },
  "x2Pwu2oFqvA4FYSOGRj7Pw": {
    "date": "10/29/2016",
    "text": "Like others have said - still working things out. We went for late breakfast. Arrived slightly before 1pm and had a short wait. Once seated, order taken timely enough...then we waited - over 40 min later (and numerous excuses) no breakfast. What made us walk out was when they were more concerned with giving someone they birthday ice cream with all hands on deck rather than find out why we had no food. Our server was very nice however. We were really hoping for a great place to go close to home...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CverhxYgYg1Ph08LF9t8vw"
  },
  "9A_b6Qw6cgCdpiFj9RwYxw": {
    "date": "12/26/2016",
    "text": "Slow front of house probably due to the many unbused tables.  We had to ask twice for utensils difficult stirring coffee without them.  Slow service and no sign of management.  We were here a week ago and things were good.  Ramp up staff and make sure they know their roles",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7FbDQloqnrkqpleDqgkUlA"
  },
  "hrPDry0sY0STI-C0NFmrWw": {
    "date": "11/22/2016",
    "text": "This place was such a disappointment. The only redeeming quality is the decor. The staff are inexperienced. The management is worse. The food was inconsistent and not at all like advertised! Don't waste your time!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BNSj9ctn6-K-q7NwFE14gQ"
  },
  "DmZMZ3WJVumblOzuBU_i1w": {
    "date": "3/26/2017",
    "text": "If you love Huge (really Huge) portions but don't really care about what it tastes like, if you don't mind standing and waiting for 1/2 hour for your table (and another 1/2 hour at table for your food), if you don't mind food strewn on the floor and an overall slightly dirty feel, if you have a large party with a bunch of crying babies, and if you don't mind if the waitress never checks on you and leaves dirty plates in front of you for 20 minutes -- then this is your place!!!!   I prefer good tasting food!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ldXFCEc9XQ7zmfNZD029XQ"
  },
  "7yq5QqGAScjTAtY6UO5qvw": {
    "date": "10/29/2016",
    "text": "Can I go negative stars? This was the worst experience I have had in a long time at a restaurant. Started off well enough. We were sat in in a good time frame. Then we watched them sit everyone else and then we ordered after 10 min. And then we watched every one around us get seated order and get their food. We waited just I e an hour and no food. The table next to is had to tell them to get a manager because they were in shock that we did not get our food and no one was responding to is flagging them down. We finally talked to a manager who said they were doing their best and that was it! She could not explain why everyone but is got their food. I will never go back to this place and recommend that no one go there. Worst place I have ever experienced.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Aa2q3_W5XzB2gH1S2cKsA"
  },
  "2OXdO5GdX4OBZVX4ykscsw": {
    "date": "7/14/2017",
    "text": "Food was great. Restaurant was clean. Nobody in the front to greet us when we entered. Took a little bit to be greeted and seated. Our waitress was horrible!!!! She took our drink order then brought them over with a promise to return with straws and she never did! We had to ask another waiter for straws. She got one of our burgers all the way wrong. She was very slow in her speech and her return to our table. Even when we asked for hot sauce and napkins she took forever to come back. She still didn't bring back any napkins during our whole stay. We asked for a dessert menu and she gladly brought one back then took forever to come back and take our dessert order. She had no name tag so I have no idea what her name is! Just a horrible waitress all together! As she approached every other table she kept apologizing for the long wait. The restaurant wasn't even that busy for the amount of time we waited each time for her to come back! We will be back to eat here and hopefully she's not working here anymore!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s4263hONYgewt4kHsW7UXA"
  },
  "UuiA0dou1a3eqLKOymLiyA": {
    "date": "10/23/2016",
    "text": "The staff needs training to work together effectively. The food took way to long and very poor quality. The napkins are cute.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t7XF_qAV5SLPjS-XVwrMmA"
  },
  "BdUHOvDg5u2sT_QztpvQOw": {
    "date": "8/8/2017",
    "text": "This place is absolutely the worst, went there this morning my wife had a Denver omelette and I had Joe's omelette. Biscuits and gravy and potatoes were cold. Plus it was really expensive! Late in afternoon now - and my wife has diarrhea and upset stomach.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yLt6WX56gd93dn7dEy4ksQ"
  },
  "roVZDJUa-Ej96Mnh0o2-xw": {
    "date": "7/4/2017",
    "text": "Horrible. Do not go here!! Service was horrible. Food was okay. The line just to pay the bill was horrendous. We will not be back. Took us over 45 mins to get our food. When we would ask for a refill and the server would forget he would just say \"my bad\".",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kWeyKXQVivj3e02cWuH1FA"
  },
  "9Na_CzvKELM63xCDXV8EHw": {
    "date": "9/3/2017",
    "text": "Soooo happy we found this place! The atmosphere and decor are adorable and speak to our family. The prices are reasonable but the quality of the food and the friendliness of the waitstaff are awesome! Our family was so glad to find a great breakfast spot close to home and are planning on coming back for lunch and dinner! Could spend days here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sU5l1Lj_GRkI_lcjqcZ1vg"
  },
  "2aizoLzlX_SvYY8MnD32jA": {
    "date": "8/16/2017",
    "text": "I had lunch there and the staff wasnt rude but they weren't attentive either , me and a friend went and she ordered a chicken salad, and I had a grilled cheese sandwich. First off the bread on on sandwich was so hard it stabbed into the roof of my mouth when I bit down. Second my friends chicken salad looked very appetizing, until she took a bite of the chicken, it was nothing but hard cold grissel. She looked thru the rest and it was all fat cold hard grissel chunks. When we told the waitress that she didnt want it and to bring the menu back so we could order something else she walked away and didnt return. We sat there for 15 minutes I figured she got busy, but when we called her to the table and asked what happened she just said \"with what I don't understand\" I was so pissed I got up and started walking out the front door when the hostess stopped me and said \" ma'am you haven't paid your bill\" Are you freaking kidding me I said we didnt eat our food we sent it back And your waitress never came back to retake our order and walked out.  I won't be going back to that place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lgfg2QXgJRZds8x-wYWsbQ"
  },
  "nL6Ye97u2Vr7OqT_sbu0EQ": {
    "date": "12/10/2016",
    "text": "I have been to black bear diner's before. Most of those I would rate a lot higher, particularly the one in Mesa. This one is skimpy on the food and it's seldom cooked properly although sometimes it is. This one is not at all reliable. I've been there six times since it opened thinking that it would get better, they were just going through opening pains. But no. No improvement at all.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QoeoNQlXtfaiiwTDYIYveQ"
  },
  "UheRdbJqQeo_87smFj2V6A": {
    "date": "12/30/2016",
    "text": "Extremely slow service. The food was fine. Someone was vacuuming the whole time. We are still not sure why...it felt like a place where damned souls go to await judgement. My mouth still tastes like onions.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "28Xos_zcNRoFXLgYAlKPZg"
  },
  "a04ghScLQJDk8QHazy8ZVA": {
    "date": "10/29/2016",
    "text": "There was nothing about this experience that would make me try this restaurant again. We were sat down and didn't see a waitress for 10-15 minutes, and then after ordering immediately we weren't served food for 25 minutes. When the food finally came the country potatoes, that I ordered extra crispy, were not even cooked! The centers were cold and they tasted raw!   The waitress said she would let a manager know, but no one seemed the slightest bit miconcerned that after we were not happy about your service or meal.   I was sad to see this place fall short. I was looking forward to having another spot to enjoy.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6a2MwtpAgw3v_nmJeaHgQg"
  },
  "WkkHTuzjpOr99kKpVAU4tA": {
    "date": "12/5/2017",
    "text": "I have given this Diner on Priest and Eliot three chances to impress me.  The food is mediocre - not good but not horrible.... only edible. The service is prompt and friendly.  It is the food that is the problem.  Breakfast this morning was corned-beef hash with more potatoes and eggs with english muffin.  The corned-beef was okay, but the portion was very small (skimpy!) and the very bland country potatoes loaded the plate - however, the few peppers and onions were tiny to nonexistent. Three Eggs were over-medium but heaped in the corner of the plate on top of each other (?!) and this is the kicker... the very first english muffin I ever had that was just crap.  Not even a side plate for them!  Not burnt or under done - just smashed and compressed.  A Cold english muffin that was pressed on the grill did not even taste good.  I usually love english muffins (even burnt ones - this is the first one that I despised.)  the only enjoyable item during breakfast was the orange juice.   I had lunch there a couple days ago...  The sandwich was again, mediocre, the coleslaw tasteless etc, etc.    However, their veg soup was good.  I can not say I enjoyed the three meals I have had here.  My experience at the Reno, Nevada Black Bear was just the opposite - the food there was fantastic!  That is why I gave this place three chances.  The wait staff was nice - no complaints with them.  Sad.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZnzeYusvU172cfMjYC9xA"
  },
  "OFthiUbuhvkzN_UyhIp7-Q": {
    "date": "11/20/2017",
    "text": "Breakfast crew is awesome. Food during breakfast is very yummy. Been twice for dinner and both times I was disappointed. First time I got ribs which were good although it took more than 45 min to get our food. 2nd time I got the California burger which didn't come out until after the rest of my family's food came out. Menu offers gluten free bun but it is nonexistent. Not many GF options for dinner. Son asked for lemonade and they were out. Expect to be here a while for dinner especially if it's busy. This is new to Laveen and hopefully it is only growing pains. I will NOT be back for dinner. Breakfast is a go!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lE4YQzYW7vuFnJ81Twlquw"
  },
  "9U95VQRLUKw7442uNUT0nA": {
    "date": "10/22/2017",
    "text": "Went here many times for breakfast.But last Friday I had my granddaughter and husband with me after I picked up my check decided to have lunch there.  Took a pic at 1205 out side the diner place was empty we got seated right away at 1255 got our order REALLY . I was pissed.  I ordered a taco salad my hubby a burger my granddaughter French fries . It wasn't busy I asked after 40 minutes where is our food.  So I was going to say something to the woman at the register but she was training a cashier and didn't ask how our meal was . What a disappointment",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TaMlkGcJ8bXj0BrEPKPxHA"
  },
  "vecHAWGYBI8LEiu2AgqvaQ": {
    "date": "9/5/2017",
    "text": "Everyone seemed to be so excited that this was coming to the neighborhood. I finally tried it after a long while haha! But to be honestly, it was extremely lack luster. The food is very bland. The proportions are not proportionate. I got an omelette with hashbrowns on the side. The hashbrowns took up at least half of my plate, which is fine IF the omelette was bigger than the size of my closed fist. It was also extremely watery as well. Very unappetizing :( with so many great breakfast places near by, this place needs to step its game up.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LE2LmjefEP1lFW1ybCYnZg"
  },
  "dqY1TUc4IOWKp4Pi_m20Xg": {
    "date": "10/23/2016",
    "text": "Went in yesterday for a late breakfast. They seem to still be working some of the kinks out as they had a bunch of empty tables and people sitting around the lobby waiting to be seated. Food was really good, which is normal for Black Bear as was the service though it seemed to take quite awhile for the food to come out. Cashing out was also a bit of a mess but apparently they were having technical difficulties there as well. Once the bugs are worked out, I'm sure this place will be fine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGXKMV1omio1I_3qNLdtAA"
  },
  "D_82rZ7WcPPuGDzhYEIMxw": {
    "date": "6/30/2017",
    "text": "Usually like black bear but I get to place they make you sign in for bar area eat then service was bad 3-4 waitress pass buy before ask need menu something drink like this is your job greet say something me lol then then buy this process I've been here 20-25 and still haven't received nothing then finally they take my order terrible terrible service especially for outer Towner beware this place",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3SJTno9z5U6xkprIWsRmMg"
  },
  "2Idhar2AutBFrxqrJ0eNmA": {
    "date": "10/22/2017",
    "text": "I was disappointed. The service was poor. There was not one time our server came to our table and did not apologize for something. Our meals were made incorrectly, our checks were split improperly, I was overcharged. Overall I would not eat there again. Mediocre.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IoiFyogOAkepR9wswISGUw"
  },
  "t1k2QIo8oACeMBq896ppDA": {
    "date": "10/8/2017",
    "text": "Stopped by this location before we go on road for weekend trip.  Been to this chain before just not to this location.  Everyone from the hostess, waitress, and cashier were so pleasant.  Food was awesome and came really fast and hot. Portions are huge but really good for price so be prepared.  We were never left with empty drinks. Will come back again to this location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zh7eETAM2Wx7TjuffSTO-Q"
  },
  "d4r2K2wmnurh2ENFWowH-g": {
    "date": "6/8/2018",
    "text": "Service is Great, everyone is really nice but the food is just beyond disgusting . I will not be coming back. Their was a big group of us so it wasn't like I tried one thing..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qr5sfXIadie1Gt50RHNicg"
  },
  "_ItcdrLdnNIYuypdO7r0ww": {
    "date": "10/11/2017",
    "text": "Great breakfast place!  Very cute beary decor. Great service and prices good. Made my vacation a little cheery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WIPXgqJRSEYOjGKekhgzXw"
  },
  "I5GEJ0xSf8pvR-qke__DuQ": {
    "date": "11/11/2016",
    "text": "Just ate here today. Food was really good. Service was ok. Sat close to the kitchen so I had a front row seat to the chaotic activities of the waitresses.   They were very loud and obnoxious and sometimes rude to each other but never did the customers see that they were boarder line out of control.   I will eat there again I just want to sit far away from the kitchen.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IL09whbG96mgn9Kx1k1y-A"
  },
  "xboHL8RMydzVVK44XKn0Hw": {
    "date": "10/21/2017",
    "text": "One of my favorite breakfast spots! Big portions for the price. The environment inside is cool, they have their signature black bears everywhere! I personally enjoy the eggs Benedict's and my boyfriend gets an omelette. This is definately a diner style type of resturaunt that carrys the essentials, don't expect nothing fancy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "akX-0DhbMH_OgKIRfrq3xg"
  },
  "e8Ly5gpIJluSeAC6zooGjg": {
    "date": "6/17/2017",
    "text": "We got here about an hour and a half ago. The restaurant is completely empty and we still haven't brought our food out. Our waitress was really nice and felt really bad but also informed us that there are 5 cooks in the kitchen. So this is no excuse. Definitely not not a great experience for my first time here! Needless to say, never coming back!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_IuRfMXGR8trYgQEi7WZvw"
  },
  "TSUTYNeYMNqi3D5D6Za-jQ": {
    "date": "8/24/2017",
    "text": "For our first breakfast joint in Phoenix, my fiancee and I stopped here yesterday morning. We decided to split the Denver omelette as she is adjusting to American-sized portions (she's from Korea). Luckily we did split it because the generous portion size was definitely overwhelming. The service was spot on and our server was the nicest as she walked through the menu with us and offered suggestions.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sce8Q3cyr-z2_PmD88QAGg"
  },
  "tZaeTCQHUuLwbSs6SSG_dg": {
    "date": "7/9/2017",
    "text": "This was my first time here and it will be the last time there was supposed to be 20 minutes away, but Andrew lied the service was okay, we got in at 730 we didn't get our food still 8 I would not recommend this to anyone...",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oyzWUo1koiJlk1jUCZ_EIA"
  },
  "QBoXy9N_zE-Qq3b-4q_oQw": {
    "date": "9/28/2017",
    "text": "Went for lunch and hostess was so thoughtful, as we were waiting for another couple to join us and it was early. As more folks came in, she recognized and asked if we wanted to be seated. Server was equally friendly and patient. I love that they have some lighter options as I know the normal portions are large. Other couple had never been to a Black Bear Diner and they really enjoyed it as well. Not sure about the negative reviews, ours was very positive. I loved my tuna salad. The others had burger baskets and really enjoyed them as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AFvCiRDdLAr-C7hg3RBHEg"
  },
  "sYZ-XxnUg7HsAw9pJI3D1g": {
    "date": "10/27/2016",
    "text": "Upon arrival we noticed that all of the staff was happy to be there and happy we were there. They took the time to greet us, refill beverages, and seemed genuinely interested in our experience.  My husband ordered the meatloaf off of the smaller portion menu. My daughter who is in college nearby, ordered the large portion of  the chicken Parmesan. I ordered the \"blast\".  All portions generated substantial leftovers for my daughter to carry back to her dorm.  We finished the meal with the apple and peach cobblers. Both were good but the peach cobbler was cold throughout. Overall, good food and good service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NYOz3TD1urRZ1IPryL1Vog"
  },
  "nd3V0RQ-l5-Yg7DPPSTUvA": {
    "date": "6/17/2017",
    "text": "Let me just start with this: fries cold to the touch. Wandered into this new location hungover on a Sunday and I don't know which was more painful; the dining experience or the hangover I was experiencing. Waited for a table to be greeted by a very bland server after sitting for several minutes. Forgot to give us straws. Would avoid eye contact with us throughout our meal so she didn't have to check on us. Everything seemed inconvenient to her. First and last time at black bear diner. You made my hangover worse.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eMm0eiClT82alhFcGYKBjg"
  },
  "4nbaJ6UuC1WAkJC53hbWmQ": {
    "date": "10/23/2017",
    "text": "A pretty great diner experience- I was craving breakfast food at 2pm and my boyfriend was hoping to get lunch so this diner met all of our needs. Tasty food, quick service, and a really diner-y vibe. Quickly became a spot in our restaurant rotation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iWrAQTJp3JqgIqdPIVxH9g"
  },
  "dSE4fuGope9l6oFYyhE9Dg": {
    "date": "3/18/2017",
    "text": "My husband and I just moved to AZ and this place is really close by us so we thought we'd try it out. I'm so glad we did. We've been in Tempe for about 2 1/2 months and have been to Black Bear Diner at least 10-12 times already! It's our go to for breakfast out. The portions are HUGE, the price is reasonable, the service is great and the food is delicious. Very country cabin feel...   They definitely took the black bear theme and ran with it! Almost to the point of being tacky in my opinion, but I'm there for the food so what do I care?  We haven't had anything we haven't liked on the breakfast menu. My husband LOVES their waffles and I'm a fan of their pancakes. They even have pineapple upside-down pancakes which are scrumptious! Their biscuits are huge and the gravy is good. They also have a spicy sausage patty that they make and it is super flavorful! If you're an OJ person like me, their fresh squeezed orange juice is so good! Oh and definitely go red potatoes over hash browns! Their hash browns are just kind of plain but the potatoes are cooked with onions and peppers and really tasty!  We've only been ordered lunch there once. We both got burgers and they were also pretty good.  Really no complaints! If you want a big breakfast (anytime of day) for a little price, this is the spot!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "w0JVarL4bfWrvWp-rgWLWg"
  },
  "QlhJtJgU-kCGY6ZacKrAFA": {
    "date": "9/13/2018",
    "text": "Way too expensive for the quality of food. Excited to visit after hearing good things from a co-worker, I was disappointed with my meal (fried chicken)",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9zjq_e6S2hVQAYX1JdkxtQ"
  },
  "QREWpIWg7WgULpfjYPdtng": {
    "date": "2/2/2018",
    "text": "This location is miles ahead of other locations I've been to. We were in the mood for diner food and it's exactly what we got. It was hot, crispy and plentiful.  The service was absolutely awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M8hsjur81r3_LhHo7w4sCQ"
  },
  "_tC00kpE0F8N7ZHQ3M5G2Q": {
    "date": "2/19/2017",
    "text": "Service was good but the food was anything but good. We ordered desserts and drinks. My dessert was the bread pudding. It was disgusting! And the sauce on it was too thick. I took 2 bites and wasted the rest. I ended up ordering a plate of fries since I figured if I couldn't have sweet I'd have salty. My husband and daughter shared their cobbler. They said it was ok.   The restaurant itself didn't appear clean. Have you the feeling that you should probably bring some wet wipes to sanitize. I guess if they're going for that dirty cabin feel they nailed it. (And the place is relatively new.).",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DUuxKUVMKhxpdbwThqerEg"
  },
  "B_K-p564jp-XiT2o6f6_1g": {
    "date": "7/13/2017",
    "text": "This place is so good I love it I will be back, it's so clean, the staff is supper nice, the food is so good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VajVtRqv1XotwpI4pxdWsQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VajVtRqv1XotwpI4pxdWsQ/o.jpg"
      },
      {
        "img_id": "EDabhn4RFYzLPRCTkEje4A",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EDabhn4RFYzLPRCTkEje4A/o.jpg"
      },
      {
        "img_id": "obDdzbzQio6Lsh9qF8ag8A",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/obDdzbzQio6Lsh9qF8ag8A/o.jpg"
      }
    ],
    "user_id": "EAdHluZvmYQQyA2dvU-zyA"
  },
  "sujDuEXQMaHdKulAOZ6Z6Q": {
    "date": "7/8/2017",
    "text": "First time here. The menu items are great and the staff friendly. It's a small diner feel very humble and friendly. They say they have big portions here. Bring your appetite",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bZG3ebFIGR1qqYy-wIXRNQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Time to eat.. Corn bread muffins are delicious",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bZG3ebFIGR1qqYy-wIXRNQ/o.jpg"
      }
    ],
    "user_id": "1AKf_1cyKliulq-lEkEpaQ"
  },
  "CkvniWZEnr_RgvL_NTl7ow": {
    "date": "7/3/2017",
    "text": "Yummy food large portions. The staff is very friendly, food takes awhile but it's worth the wait",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TbkI7VOnr9pxAxMw888LHA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Chorizo Scramble  with a side of bacon &amp;amp; The The Grizz",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TbkI7VOnr9pxAxMw888LHA/o.jpg"
      },
      {
        "img_id": "n5f3zpCLst50DNV3zid15g",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n5f3zpCLst50DNV3zid15g/o.jpg"
      },
      {
        "img_id": "PhD36pP-IkzOPPX6wkzCpg",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PhD36pP-IkzOPPX6wkzCpg/o.jpg"
      }
    ],
    "user_id": "N6DwlZc8yt5muWOO3mjYSQ"
  },
  "i4k-RX68f6obGsRF01Xs_g": {
    "date": "9/23/2018",
    "text": "I will never eat there again.  My daughter and I sat at the counter and the service was horrible.  I was willing to look past the poor service until I got my food.  My food was cold.  I asked for fresh bacon because the bacon they brought me was overcooked and cold.  I think it was left over from yesterday.  The potatoes were not cooked, and also cold.  When I asked for fresh bacon, they brought me a plate of the same cold bacon.  I used to love eating at Black Bear because the food was amazing.  My last 4 experiences have been less than satisfactory.  I will not go back to Black Bear again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lUcX9mva_lq4-Z4UqOoQQQ"
  },
  "yrs6tTPew3_MM0Spjo5H2Q": {
    "date": "12/27/2017",
    "text": "Food took forever. Poached eggs were not great, huge portions but overall the food was not great. Basic diner with underwhelming dishes.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgxiRExIIkRIT1jHDp5zuQ"
  },
  "hBpSlDHioidNJFbmMaN35w": {
    "date": "3/7/2017",
    "text": "Love coming here for breakfast. The wait is usually between 10-20 minutes on the weekends but the food is worth it. The portions are huuuuge (trump voice).  I usually order the Grizzly breakfast which comes with ham, sausage, bacon (thick and to die for), hashbrowns, 3 eggs, and pancakes. WHEW! All for about $10.   Out of our 6-ish experiences there, only 1 was sub par. The bacon wasn't cooked all the way, the waiters were inattentive, and the eggs came as 2 instead of 3.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "t6uAOJHnui8zl2-PJ9m_Jw"
  },
  "_ZFDCt85OQ5AIZYYVJn_Jg": {
    "date": "10/31/2016",
    "text": "This is my second time here. I know a lot of people love the food here, but I haven't been overly impressed. I will say that I had a bite of the chicken and biscuits which was very good. It reminded me of something my mom made when I was a kid. Very comforting. I also share a few bites of the apple crumb pie with ice cream. It was served cold. It would have been much better heated up with the cold ice cream.  The pie was good but nothing to write home about. As for the type of food that I choose to eat, the choices were limited. I prefer a healthier lower fat/sugar type of diet. However, If comfort foods are your choice....this place will accommodate!  As for the atmosphere, this location just opened yet it seemed somewhat dated. (Maybe because they used a prior Cocoa's location.)  It seemed clean. Somehow, for my liking, it needs something to excite it.  It is perfect for those who like home cooked comfort food.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 12,
      "cool": 11
    },
    "photos": [],
    "user_id": "MdGnY6eLxy82nEZhCc6rnQ"
  },
  "eTbqDclMUGC7LQCGGJGEEw": {
    "date": "12/17/2016",
    "text": "TWO STARS  OK this is the second weekend they have been open, so I guess gotta give a few alibis.  Service is extremely slow, 40-mins FIFA burger. The couple next to me had to leave as their lunch time expired, without even getting to eat. I am sure service will improve.   The location is fine, they should get a lot of business.   Time will tell if they can turn their poor service around.    12-17-16 Update FOUR STARS Second visit and service was as expected. Fast and friendly with good food. Attentive wait staff.   They need to figure out how to separate customers wanting to be seated from those paying their bill. NO easily recognizable method for the customer walking in the door. They have to get in line with the customers paying if there is a large number of customers standing in line.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YTtaAnHMsXozVB29qr3sbA"
  },
  "rlJqO8z0hdx0Jd-Qcs24Lg": {
    "date": "11/13/2016",
    "text": "Went for breakfast yesterday, our second time at this location. Took a friend visiting from out of town.   There was a small wait when we arrived, no big deal. Once we were sat at our table - it took over 20 minutes for a server to even acknowledge us! It was like they were avoiding us - unreal! They visited the surrounding tables multiple times. People sat after us were getting their food before we even had our drink order taken. We were about to get up and walk out when finally a waiter asked if we'd been helped- he told us multiple times we weren't his table but he'd still help us. Well, gee, thanks... It took another 20+ minutes for our food to arrive and when it did it was just ok- not great.   They do give large portions and the only reason I'm giving them 2 starts is our first experience was decent.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Sj9ZfSKmaqz6xfgKSJibjQ"
  },
  "nno-ciB3Y8R0HwL0loaTsA": {
    "date": "11/5/2016",
    "text": "Yummy! The wait was definitely worth it. The service was great, all the servers and hosts were attentive. Our food was delicious and they make fresh orange juice! I definitely will be back. Oh yeah! The portions are bearnormous!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "eK5GQVlGZVo5M_pZxGTn3g",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eK5GQVlGZVo5M_pZxGTn3g/o.jpg"
      },
      {
        "img_id": "zhYbZCJvLpsH9b5hAhbN3g",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zhYbZCJvLpsH9b5hAhbN3g/o.jpg"
      },
      {
        "img_id": "m0Twb37Qdx7QHWQWVVaC3A",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m0Twb37Qdx7QHWQWVVaC3A/o.jpg"
      }
    ],
    "user_id": "zNzeCh4mZPZsdGU1uV3z7w"
  },
  "iFUw-UUYsiYySRwwbXyA4g": {
    "date": "8/27/2018",
    "text": "I had never been to black bear diner, but when the hubby and I were craving something sweet we stopped by and couldn't resist a slice of pie. The service is kind and their dessert is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ekPYiNDKE10QOsQ-E4EnQ"
  },
  "kZKf4kkGLV1Uw6lnIthFzA": {
    "date": "10/13/2016",
    "text": "I was thrilled seeing one of the (million) umpteen empty strip mall places in my area was becoming a Black Bear Diner. I've eaten at locations in Northern California a few times and found them to be dependable comfort food at a great price.  In a nutshell, the Tempe location needs some work - a LOT of work - before they reach the level of standards I've come to know of Black Bear.   The service was friendly, although everyone seemed to not know what they were doing or where they were supposed to be. They only offered to refill our waters literally when we were ready to walk out the door. I could have used that water when trying to choke down dried up meatballs...  I ordered the Spaghetti and Meatballs and was thoroughly disappointed. The noodles were fine, the sauce was relatively uninspiring and the meatballs could only be classified as WMDs... they were so overcooked and old that I could have hurt someone by tossing one at their face. Meatballs should very easily be cut with the side of a fork - I couldn't get through these buggers. Solid as a rock. They were utterly tasteless and not something I would feed my old, blind, deaf dog. When a server FINALLY made it back to our table to check on us, I told her they were inedible and she replaced them. But by that point, I'd had my fill of my spaghetti and took one bite of a new meatball and promptly put everything in a to-go box. The new meatballs were better - albeit pretty greasy. I'm wondering if they threw them in a deep fryer to moisten them up a bit.   My husband's Chicken Fried Steak - while delivered several minutes after the rest of our meal - was perfectly cooked and very nicely flavored. The gravy - perfect. Potatoes - perfect. Eggs - perfect. We ended up taking the biscuits home and I tried eating one for breakfast today and it was inedible - \"dry as a popcorn fart\" as my brother would say. Tasted like packing material. Our daughter gobbled up her kid's scrambled eggs and absolutely loved the apple dish.   I regretted ordering anything but breakfast and will probably file this place in the \"breakfast only\" category.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P4z8peS_XFNFKhWcdDuHyw"
  },
  "fRFmosayCsxBv844o1TnmA": {
    "date": "10/2/2016",
    "text": "We went to their exclusive pre-opening event and it was wonderful! This is the newest location in Arizona, right off of Elliot and Priest. The decor is reminiscent of a lodge in the woods. When you sit down, they hand you little newspapers. The newspapers are actually the menus which is a cute little touch. We went around noon, so we were trying to decide between breakfast and lunch. I finally settled on the California Bacon Eggs Benedict. My husband ordered the Cheeseburger salad and oh my goodness, it was huge. One thing I should warn you, the servings are huge! So either bring a huge appetite or share that meal. We both had leftovers from that meal. I actually thoroughly enjoyed my Eggs Benedict. There was hollandaise sauce over poached eggs on top of an English muffin, on top of avocado and tomato. I also got a side of hash browns with it. Overall, the experience was great and I think this will be a new breakfast spot in the future. Plus the prices are reasonable!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "d0DPlc35pEk2TbTycEXtuQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Onion rings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d0DPlc35pEk2TbTycEXtuQ/o.jpg"
      },
      {
        "img_id": "59-hJdKSuZfyATJSnQinCA",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. Chicken fried steak",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/59-hJdKSuZfyATJSnQinCA/o.jpg"
      },
      {
        "img_id": "bixP4x2SvfP0LGtAUs_5uQ",
        "caption": "Photo of Black Bear Diner - Tempe, AZ, United States. The cheeseburger salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bixP4x2SvfP0LGtAUs_5uQ/o.jpg"
      }
    ],
    "user_id": "QVGpwHZXsGOgHmp8w-ipvw"
  },
  "CYgGkFi1l4yoHiZGwE0SlA": {
    "date": "11/29/2017",
    "text": "Ive got to say that the untrained host was the nicest person there yesterday. I go in to place a to go order and the server that i had was extremely rude and disrespectful. To top it off... The food i got was disgusting. I ordered biscuits and gravy and guess what was pretty much missing. The gravy. There was enough for maybe a 1/2 a biscuit if that and it had no flavor. Oh and my bacon was missing. For the amount of money i payed you would think they would have gotten it right. Such a shame too. Ive never had any issues with this location.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C_NAWNdp2IQ2EyE-OiLHUQ"
  },
  "JI7YAnENFBK9vzxl6Rnsrw": {
    "date": "1/31/2018",
    "text": "The food here is great! Wonderfully sized portions. Most plates can be shared. Breakfast served all day. Real home cooked taste to almost every dish. Service is ALWAYS superb! Deanna at the Tempe location is really sweet. Would have given 5 stars except the music is horrific and plays too loud over the speakers. They have a jukebox but the selections are minimal. It puts a damper on enjoying a nice meal. Would make me hesitate to dine here. Otherwise love the food is awesome!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZKK3P7uH3oFVSgr33w6Bvw"
  },
  "6ZbWEwsKj3ZYCo950rBp1A": {
    "date": "7/30/2018",
    "text": "Very good food.  Varied menu.  Good prices.  What's not to like?  Will definitely be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FIYE2Mm5eqQyoxlP9EaVSA"
  }
}