{
  "Pbb0X-p79yJSb3B-xIDFPQ": {
    "date": "10/2/2017",
    "text": "Always treated with amazing service followed with the best Vietnamese food I've ever had. Love the S3 with chicken",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-8WCJpg2myLq37UVgQoLMg"
  },
  "bbEbugW65LMlvQ_Eg5zOiw": {
    "date": "12/30/2017",
    "text": "This restaurant has the largest menu I've seen in a while. We chose two of our favorites- beef stew and pho with rare beef and meatballs. This is the first place where they had beef stew with bread like we used to have in Washington. They were both very good. We will have to go there again and try some other dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mQi133c1cVbbauY0OuNN0Q"
  },
  "8ouFQS-XszSp9HArm6S2DQ": {
    "date": "9/1/2016",
    "text": "Good place to come, had the chicken pho service was good to. Also had the spring roll very good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S2cDWByWpTTo4dmWwMUIpg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S2cDWByWpTTo4dmWwMUIpg/o.jpg"
      }
    ],
    "user_id": "usNO7JLf0iypR17LyzAg7Q"
  },
  "Hhn8obbb-sLvAh0nd0Cznw": {
    "date": "9/26/2017",
    "text": "They have the most amazing Korean Beef BBQ ribs. They are tender with the right amount of seasoning. They have a nice selection of Korean not Chinese food. It is a warm environment with kind people. Special orders no problem. Everyone was nice and helpful. It is a clean restaurant that even smells good. Come eat here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A1Vw2EIxu-1vl8ReylzEAA"
  },
  "V7jz06DVzuMEUbQn25a7RQ": {
    "date": "10/8/2016",
    "text": "My favorite Vietnamese Restaurant... I love this place, they serve the best spring roll without the peanut butter sauce, pho and b6 salad.  Good customer service.  Specially great service from  Giang",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "446Ne1z0HifwvYdQ6jW9bA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. B6 so yummy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/446Ne1z0HifwvYdQ6jW9bA/o.jpg"
      }
    ],
    "user_id": "AqRS07FmwbkGID57IRMs_w"
  },
  "WVoY1q2OIwiN5xK7SCcBzg": {
    "date": "6/4/2017",
    "text": "Love their lunch specials! I do take out and I can call on my way and its usally ready by the time I get there.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K_aSZQKgZyZ1VkYEsdT9pA"
  },
  "3sGe2YUCOxz7ZL58bSI9zA": {
    "date": "9/22/2017",
    "text": "Beef Pho noodle soup was freshly made. Not a fan of poor quality of slices or cut of meat used in soup-- was supposed to be brisket. Shrimp wraps no pork with peanut sauce was excellent. Nice atmosphere. Cozy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4NrG8idk2mpMvSFwFmEqmA"
  },
  "bKlastIukm7NS00QjAxUjg": {
    "date": "10/21/2017",
    "text": "Song Lynn, everyone here has always been nice and attentive. Excellent service & food is delicious.! Definitely my go-to Pho spot. My fave is the Tofu & Veggie Pho with chicken broth.. miracle soup for a hangover. Thai Tea is also amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "foAc8TDDZWdlPT1xn6vIqg"
  },
  "oh5Pr0zx9NPGoSzWl0V9Sw": {
    "date": "6/15/2014",
    "text": "I've been feeling under the weather all week and figured what better way to get a pick me up than my favorite Vietnamese spot? We walked in and noticed they've got some new seating. Beautiful booths! I love the decor and atmosphere in this place and the staff are just the best.   My boyfriend ordered the beef stew with bread (his favorite) and I had the pho with dumplings. The broth in the pho is delicious and comforting like a warm hug. Every time I eat it I wonder why I don't eat it every day.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pxfAvVwfuoIpKsc0dCGYxg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Beef stew and dumpling pho",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pxfAvVwfuoIpKsc0dCGYxg/o.jpg"
      }
    ],
    "user_id": "rwSeljfFrH7X1CBaDriiJA"
  },
  "kn1TdJH_gyg8g_3yrMDNfA": {
    "date": "6/27/2014",
    "text": "It was sort of a last minute decision to stop in and dine here, but not one I regret. It was a pretty decent experience and reasonable prices. Our server was extraordinarily kind. Bubbly and always near. The restaurant itself is very clean, modern, and looks new, though it doesn't scream Thai restaurant. I ordered my favorite dish, Pad Tai.  It was good, but not great. They were generous with the chicken, but it was just a tad dry with a little too many onions in it. I also tried a strawberry boba tea, without the boba. It wasn't bad. Tasted like a strawberry daiquiri.  I'd be willing to give this place another go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sTAAPSkBP_6zxpajW40bHw"
  },
  "rQaNZzxW-_Z23lU79PowLQ": {
    "date": "4/23/2014",
    "text": "Don't pay any attention to the other reviewer's negative comments...this place is excellent.  I've had Pho from Texas to California so I know my Pho. The Pho here is one of the best...the broth is hot and very clean, just enough meat and just a hint of anise...portion size is perfect.  The springrolls are average...Little Saigon in downtown Glendale puts shrimp & grilled pork in their springrolls.  I have also had the curry chicken and the mongolian beef which  both come with white rice and both delicious with high quality meat & lightly flavored & not overly sauced. Okay now the negative...other than the Pho, the portion size of food is too  small...you get 1/3 of what other vietnamese restaurants serve. For $8.95 I expect more than white rice & a small fist size of Mongolian beef or curry chicken...I guess I will just stick to the Pho & sandwiches.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8VC7r5TGJZQ09GH_DB9jxA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Mongolian beef - portions too small",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8VC7r5TGJZQ09GH_DB9jxA/o.jpg"
      },
      {
        "img_id": "z155QhNjXhBx5PJlVNNWKQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Pho Tai / springrolls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/z155QhNjXhBx5PJlVNNWKQ/o.jpg"
      }
    ],
    "user_id": "x1eaCoYs3uyN9mNm9i8bOw"
  },
  "5Ue-2u6N1xAzpjZiabT6HA": {
    "date": "4/28/2017",
    "text": "This was our first visit here as we decided to come based off if yelp reviews and we weren't disappointed. The Pho was delicious! We also had spring rolls which were huge with tasty peanut sauce. We couldn't eat it all, but took it to go. The place was relatively quiet, very clean, and service was nice. We'll definitely be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KcEa4h8xvyHOWSbbU52bkw"
  },
  "UlX2NT6JNHUquSkfjqvw0Q": {
    "date": "4/24/2016",
    "text": "My family & I have been coming here since they first opened. I've tried a lot of different pho since then but nothing compares! Song Lynn is clean & tasty :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tnBARXf9Wmo2kBwPETTpPw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Vegetable &amp;amp; Tofu pho (lots of spiciness added)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tnBARXf9Wmo2kBwPETTpPw/o.jpg"
      },
      {
        "img_id": "C2VGU785rchTs6-V7UK4Fw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Spicy Thai Fried Rice (Chicken, shrimp &amp;amp; pineapple)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C2VGU785rchTs6-V7UK4Fw/o.jpg"
      }
    ],
    "user_id": "nCTwun6Wanaofodc7-uHoQ"
  },
  "FAVPWpX7In7ZkHlJdfxaRA": {
    "date": "7/22/2017",
    "text": "Wow wow wow! We are upset it took us almost a year to find this place!! It's been a long time since I've said \"oh my gosh so good\" every minute while we were earth. I got the B1 which was an amazing combination included beef, shrimp, rice noodles, three sauces, mix veggies, and more. My husband got one of their many Pho offerings and was amazing! This very well might be our new favorite restaurant in Glendale!! (Cheap beer too!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SXAUlvBckxUiy7Dj83cKrA"
  },
  "a0MqSPkerod5FzSuGdE5Wg": {
    "date": "7/7/2017",
    "text": "Hands down best pho in Phoenix (most likely AZ as well). I'm sure a lot of people agree with me because its always hard to find parking. That's when you know the food is popping!  Staff are friendly, restaurant is new looking, and prices are very reasonable. They even have happy hour for appetizers etc !!!  I recommend any type of pho on their menu honestly the broth has a very rich and hearty flavor. 10/10",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dDcLMw3uvOl4HIKivM-ibg"
  },
  "jPSqEhpVHSDUphvCRPB3cA": {
    "date": "3/24/2017",
    "text": "If I can't make it to Da Vang, I come here. Its closer to my house. Anywho, the dining experience here is great. Service is very good! Each table has a call button attached to the wall that will page them when pressed. Thats a great way and attempt to make sure they attend to you. The format of seating in the restaurant is a little different and forms an \"L\" shape which is also why I'm sure they have the buttons for. The times I've come here, the restaurant is clean. Dirty was never an issue the times I've eaten here. My favorite is the bbq chicken pho, as for appetizers I like the eggrolls. The grilled chicken with fried rice. I'm simple but I love flavor. Its the best one yet I know on the west side of town. I've been here a few times and I always leave full and satisfied.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VhFc0oSJF76M0KxM5PRURw"
  },
  "SL0g0U-6elKA36El6zyuCQ": {
    "date": "4/7/2017",
    "text": "The Pho broth was some of the best I've ever had. The portion was small for the price though",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cS4lg6XG3rMr9IiwpnafIQ"
  },
  "cyff9qexFCJIp6uW-VBNbw": {
    "date": "8/16/2017",
    "text": "Love the Pho here!!! Friendly, clean and delicious!! The Singapore noodles are also amazing! Never been disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NMkBqd_ZLT7p3T3NTBEalg"
  },
  "F6z0AVrCZU7CUSFD-rJqag": {
    "date": "6/17/2017",
    "text": "Place is great. Been coming here for a few years now and Everytime it is super clean. You can tell they keep investing back into their business because they pay attention to detail. My favorite place to come eat pho.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hxlmvx9k36Ecp3mFv3uMhA"
  },
  "_qm70Q3y2NoTrFQnq2oZFg": {
    "date": "12/5/2016",
    "text": "Dropped into this restaurant on a whim after getting my nails done a few doors down and it was amazing! I was seated immediately and quickly brought out my iced green tea. I ordered the number 9 which is pho with rare beef and brisket and it was delivered to my table within 6 minutes. The pho itself was some of the best I have had, very flavorful broth and tender meat. The one thing I also really loved was how attentive they were to my water/tea glass when it got empty, within my last sip someone was already there to refill it. Overall, awesome experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "khR6NYufAL5lRpW62efK_Q"
  },
  "Ry00ZifoqKOXCk6urtIP6w": {
    "date": "8/4/2018",
    "text": "Bun bo Hu tasted so bad, especially the meat is horrible. Hu tieu bo kho is ok. Bun thit nuong is not bad.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PtIX9XNe_Sfu501h1psmDA"
  },
  "KFQwpgLiRDl46MNK2UZymg": {
    "date": "9/26/2016",
    "text": "Great meal  I live in the area and have past by Song Lynn dozens of times but never stopped in . I love Vietnamese cuisine so I thought I would give Song Lynn a try. My only regret is why I didn't try Song Lynn sooner.  We were greeted and seated immediately. The staff was very friendly and our server was very knowledgeable of the entrees on the menu. Our entrees were served quickly and the portions very generous.  On this visit we had the Stir Fried Spicy Lemongrass Chicken with Rice, Pho, and eggrolls.  All of our entrees were very flavorful, authentic, and delicious.   The prices are very reasonable and you will leave satisfied. Don't let the plain strip mall location fool you. We are happy we visited and will definitely come again.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 11,
      "cool": 7
    },
    "photos": [],
    "user_id": "MMf0LhEk5tGa1LvN7zcDnA"
  },
  "Pg_iv-Kj2wzCbb2T0WLwTQ": {
    "date": "2/20/2017",
    "text": "I ordered the Buon Bo Hue (not sure of spelling) and spring rolls for take out. It was a busy Sunday night and all tables were full. The lady who took my order was very pleasant and friendly. Both were good but I've had tried many pho restaurants and I must place this under good. It wasn't so so, but it wasn't amazing. It was good and you will be content with service, food, and price. I suggest for others to try :) I must add that my current fave pho restaurant in Goodyear has a much more delicious broth, but, this place has much more meat in comparison.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NFiNRnoDn-2AmFm_PyNWRA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Bun Bo Hue and spring rolls for take out",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NFiNRnoDn-2AmFm_PyNWRA/o.jpg"
      }
    ],
    "user_id": "DJ8G-IzmeX_euX6Vp02DQg"
  },
  "eh3S_guS-dZaqLZyYUv6FQ": {
    "date": "1/29/2017",
    "text": "Nice little find. Came for lunch with a party of 9, seated right away. Our server was very friendly. The restaurant is very simple and the food was very tasty. Our table was quickly full of dishes with Rice vermicelli, pho, pad Thai, and all were very satisfying. Very fairly priced. Would definitely come back! Some TLC to the decor and bathrooms and visible storage would have gotten 5 stars from me.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6GLw9GlHw-S_Ezw3bx-y3g",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. The fam",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6GLw9GlHw-S_Ezw3bx-y3g/o.jpg"
      },
      {
        "img_id": "FCoc0QxtzLqffJeIdH77Xw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Pho (beef)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FCoc0QxtzLqffJeIdH77Xw/o.jpg"
      },
      {
        "img_id": "4nGpUGYBr7Y9WnISLcGurQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Pork, egg roll &amp;amp; shrimp Rice vermicelli",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4nGpUGYBr7Y9WnISLcGurQ/o.jpg"
      }
    ],
    "user_id": "PUC-wLobZ99sX0agdLIS8g"
  },
  "NgWQjmlYTUoSrCBOVPTZSQ": {
    "date": "12/30/2018",
    "text": "Service here sucks won't be coming here when we got here they gave us a table and my son was seeing the fish then the server was gonna have people sit there before I mentioned that I had been given that table she seemed mad then she ignored us for 10 min before we pressed the button to ask for waters and we ordered my bf food came then 15 min later I pressed the button again and I finally got my son's food when my food arrived the shrimp and pork on there were cold and the egg roll was burnt I told then then she said they heated it up didn't notice any difference. We never got refills on out waters either I didn't see then refilling anyone's drinks we won't be going here there service sucks",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RzvH5bSD2q8UGhSre3noLQ"
  },
  "zmgaPTVbsNfy3IXTXkqGEg": {
    "date": "8/21/2018",
    "text": "Great food and super nice service 10/10 recommend. The boba is just a great as the food!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iHe6cLWKbbnxIAd_RApIQw"
  },
  "4xeSKjBG1h8OVgKeA0NTeA": {
    "date": "8/18/2018",
    "text": "I'm from Seattle where Vietnamese restaurants are on every corner so when I got a cold, I immediately searched for pho. I got my order to go. They have large portions and packaging that travels well. My chicken pho was really good. I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ju5V5_D5jV86fYBafIBzew"
  },
  "_3Kzz9S_ygDJTlk2rSToVg": {
    "date": "2/11/2019",
    "text": "A lil overpriced and not that great tasting. For a regular sized pho 2 pork spring rolls and a flat pepsi was 16.50. The spring rolls came packed with lettuce too Ive never had it with lettuce it was gross.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X3rSBWNdhUrSbSDusYxnJw"
  },
  "S3j3AHhKYUCs8xzLqcWcbg": {
    "date": "8/2/2018",
    "text": "ALL the spring rolls are delicious! #Chicken Dumplings. I'll definitely be coming back. I give It a 5 Star!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GM1X9qHvGY2cIesLjHdFIA"
  },
  "CtexRRwOdZMHSaK89qBv7g": {
    "date": "1/1/2019",
    "text": "The pho is amazing! My go-to is the chicken and I've tried the beef and it's also great. Will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ehj0lhep9RoROUHWyGa31w"
  },
  "34J5OOTXJGA3FaZPLYbl-Q": {
    "date": "12/30/2018",
    "text": "My nana and I visited this place the food was delicious!! She ordered a seafood bowl and I got the lemongrass beef! The meat was well seasoned and just plain delicious!! The only thing is the service was okay! But other than that I recommend stopping in for the food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VF56lKMtLQIwTm981ir6Vg"
  },
  "QR2uzm9sJPyo-4c4CAPdkw": {
    "date": "5/16/2015",
    "text": "I'm so lucky this place is right across the street from Banner Estrella. It really satisfies my Asian cravings during long hours of work. A lot of medical staff & docs order togo from this place for a quick meal during lunch/dinner break.   The pho is pretty decent for AZ. It's not as outstanding as the pho in Cali, but I would recommend this place if you want some good pho in AZ. I usually get the pho tai, which is one of my favorites. If I don't feel like pho, I usually order egg noodle soup as an alternative - their broth is spot on. At times when I'm especially hungry, I'll add on the combination appetizer. The pork egg rolls are yummy!   It's a little pricier than Pho Thanh on Camelback, but I think it's worth the drive. This place is way cleaner with great service.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "NNEH_-i2v_LEo4ROTcZSog",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Avocado Shake - sinh to bo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NNEH_-i2v_LEo4ROTcZSog/o.jpg"
      },
      {
        "img_id": "dRb6COQV6RMwLCns0VUS3A",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Com Bo Luc Lac - Vietnamese Shaking Beef with Rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dRb6COQV6RMwLCns0VUS3A/o.jpg"
      },
      {
        "img_id": "cE3-6eS83WdB-Ujc1U0Ndw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Mì hoành thánh xá xíu - Egg noodle soup with BBQ pork &amp;amp; wontons",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cE3-6eS83WdB-Ujc1U0Ndw/o.jpg"
      }
    ],
    "user_id": "Apwv9r-1TXGoJmUo6Ye2Qg"
  },
  "6knz3IDcur6EMQpV9bNMlA": {
    "date": "10/26/2017",
    "text": "Excellent food delicious pho totally recommend this restaurant, clean and good service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "48S2e_Y580mln6FUZho7vw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/48S2e_Y580mln6FUZho7vw/o.jpg"
      }
    ],
    "user_id": "cipMdVLk6dOQCGlisPSSbQ"
  },
  "6e6rTJroNZ2LEOQ7hkCLRQ": {
    "date": "1/12/2019",
    "text": "Came here for first time....we were not disappointed.  Very tasty food, very clean dining area and the staff is efficient, courteous and friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zPGz5OVhXASa7s3B-HxQpw"
  },
  "w_eXtMA7kKk2tstpkJT13w": {
    "date": "1/4/2018",
    "text": "I don't always eat Pho but when I do, I go to SONG LYNN!!  I had Pho once in my life and it was in California, I have been looking for a good place here in AZ and this is my new favorite place!!!   It was amazing!!!! I loved it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJjDQdCEWty7v_59OpzE2w"
  },
  "jnvW40DSon7Oau9UYz4WZg": {
    "date": "1/2/2019",
    "text": "Food good I've been here a couple times they're device and food are really good I recommend this place to all my friends",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v_Sr4chthssGN0p8PHaP6Q"
  },
  "V_cfqfsxiN5OIsSQSIp90g": {
    "date": "3/20/2018",
    "text": "This is my favorite Pho spot on the west side, or I like to get Pho 43 express..the broth has really good flavor..usually get steak and tendon or brisket..not much for tripe..some sprouts, jalapenos, black pepper, oil and couple shots of sirracha to round it out..spring rolls or a Bahn Minh sandwich if I have a bigger appetite..good quality food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sm35H-ozSHdc4K89MP6Yog"
  },
  "MovW9WQlaZm_vs4_YLmocw": {
    "date": "6/26/2018",
    "text": "We don't have a ton of winners in the west valley, but Song Lynn is a diamond in the rough. We love everything we have tried. I usually get the Filet Mignon with fried rice and the flavors are amazing! My husband like the dumpling pho, but honestly, I don't think you can go wrong with their menu. For takeout, they are wonderfully surprising!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gDSlSa96_2mkz9W8tCgCVA"
  },
  "QLOXHcmHpzOr1vQ6QCWkvQ": {
    "date": "12/26/2018",
    "text": "This was hands down the best pho restaurant I've tried in Arizona. Everything was great! This is my new favorite spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UcCYoPi4D62zYqIy5xvLzw"
  },
  "SM4aXkeU7MqQQZDS_1jzHw": {
    "date": "7/1/2016",
    "text": "This place was really good. My best friend and I were driving around trying to find a pho restaurant that was open at like 9:15pm and we got desperate lol. I found this place was close by and open longer. So we got there and looked and quickly ordered. They were very quick. Within 5 minutes we had our dish. We both ordered number 9. Which if I remember correctly was medium rare and shredded. It was so moist and yummy. We were both impressed with how nice and how quick the service was. And the meal was awesome! Us being desperate turned into finding a good pho restaurant haha. I'm so glad we did. Him and I are both very picky on pho too. So this was good that we both liked it. And the plate with stuff to put in it, they actually gave one to each of us. One for him and one for me. Which was awesome cause we could put more than usual! So yummy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3zlU2N95e7pGH1VvjKbu4w",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. They were quick and friendly! I got the number 9. The meat was so yummy.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3zlU2N95e7pGH1VvjKbu4w/o.jpg"
      }
    ],
    "user_id": "t1I3LLMuwz1ytLXw88PFPQ"
  },
  "Xz5w4aJ9PmqcHirLnUX0YQ": {
    "date": "3/24/2015",
    "text": "I love this place! Staff are always friendly and help you right away. I've never waited more then 10 mins for my food. The food always taste great and the place is always nice and clean. I definitely recommend this place and the P1",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uFH3_cjq0OV1SMOe8ADsRQ"
  },
  "OBx_sxxSMSz8t0aWjYLPcQ": {
    "date": "2/4/2014",
    "text": "Really good food and great service! The interior is decorated nicely too, and it was very clean. Good selection of food, including some vegetarian options. I had the chicken pho and my husband had the beef pho - both were delicious. The fried egg rolls (cha gio) are always my favorite and these didn't disappoint. Prices are very reasonable. Only reason I gave it 4 stars instead of 5 was there was a lack of veggies (used to wrap around) with the egg rolls and Bun Bo Hue is not a standard menu option - although it was a special item when we were there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "10-8Ga4oSzUtFY6WRCtARQ"
  },
  "zZL5Mi1UuSIM_NvmLNM8iA": {
    "date": "5/6/2014",
    "text": "In my great adventure of trying new foods, I found this cute little place. Now I had heard about Pho and wanted to try it, they have so many options and such good food I want to go again tonight....in fact I might try to go again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y5TBosGCi59Rl5n_m6lKQg"
  },
  "o4XILiryVNXoZP8r3t3yng": {
    "date": "4/23/2016",
    "text": "What a wonderful find the food was great the service was  perfect (Gi Gi )rocks .Clean restaurant with a large  menu. Try the Vietnamese iced coffee  better than any starbucks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vvyyv6hSXuLnGOsRFtDkCA"
  },
  "UFNoTsP2OBN2ZXdWuBSNdA": {
    "date": "12/2/2013",
    "text": "First time here just b/c there are other pho places closer to my house, I happened to be in the area and wanted to try it since I've gone to all the pho joints in the Valley I come across and I wasn't disappointed I always get the number 1 which is usually all the meats in XL bowl the broth tasted different from any other place It had more rich flavor to best describe it and yes like I've been reading the service is friendly here and the place is clean this might be my new favorite place to PHO. Will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "A5XdqRuzz_Oe0gy1WJUgZg"
  },
  "Roocar9aX2KdIA2CgIxhZQ": {
    "date": "5/3/2016",
    "text": "My husband and I would drive 45 miles round trip to go to a restaurant similar to this one because we couldn't find a good place.... UNTIL we stumbled across this gold gem! Their food is awesome, and to go orders take 10 to 15 mins if that. Their beef soup, and spring rolls are the only i usually order and it's on point every time. My husband has had the curry which he really liked as well! So glad we found this place, now we drive 8 miles round trip instead of 45.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XeyuGYRQZ1-AhzvSlAMHMg"
  },
  "BhenSyXSMbLUBqjPebOt-A": {
    "date": "2/12/2014",
    "text": "Visiting from Los Angeles, where one can choose from a slew of Pho veitnamese restuarunts",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ymWF9ZNn_yawpIczQqsaAw"
  },
  "YeuGnq4xeFmV1XpGaHWcZA": {
    "date": "5/26/2014",
    "text": "I assumed this would be a good place to eat Vietnamese cuisine, seeing as how it had 4 out of 5 stars. I was not at all impressed. The pho broth was too sweet, as was the nuc mam sauce for the egg rolls and vermicelli noodle dish. The egg rolls tasted strange and the goi con was fresh but did not have any mint or green onions wrapped in with the noodles, pork and shrimp. Very bland. And the peanut sauce was diluted. I don't believe that Song Lynn is a True Vietnamese restaurant as the name is not authentic and there are Chinese dishes on the menu. We sat in front of the TV that sits too high in the wall. The radio and TV were on at the same time which made it loud and difficult to concentrate on one sound. Sadly, I will not ever eat there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cvm3VbOd3K6TAks28L5nCw"
  },
  "38OItziyDxRkNKSI8w6wSQ": {
    "date": "6/15/2015",
    "text": "Definitely the best Pho on the west side!  I've tried all the other Pho restaurants on the west side and am always comparing them to Song Lynn.  The appetizers are all also really great.  I always have the same waitress when I go, often on my lunch breaks, and she is super attentive and friendly.  It's a pretty small location so I wouldn't suggest for large groups.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K7DAinC5CA5HDxOdST-rfw"
  },
  "ODsINZ_OdCnR6giWKiBsDw": {
    "date": "11/6/2016",
    "text": "We first ordered from here when we moved in 2 years ago and didn't want to leave the house while unpacking. Sadly, they don't delivery anymore....but I like their food enough to get off my lazy butt and go pick it up....so if I'm going to go I ways pick up a feast for us to spilt and eat off of all day. Our favorites are the spring rolls and the egg rolls to start. The dipping sauces are all very tasty. I'm not a huge fan of peanut sauce but theirs is pretty darn good. My favorite though is the slightly sweet but vinegary one that comes with the fried egg rolls (the one with shredded carrot floating in it) I like to dip everything in it...I could drink it!  Hubby always gets their Pho...I pass. It's certainly not bad...but not my favorite pho in the valley.  Instead I always gorge on the spicy chicken pad Thai. It's to die for! Love their noodles better than any pad Thai I've ever had. We also get a pork bahn mi. Bread is perfectly soft and chewy...perfect amount of mayo and fresh veg. Only complaint is sometimes the pork can be a little chewy. It's hit or miss but never been bad enough for me to not eat it. Overall it's a good joint for the west valley",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "25XW-03zM0p-4oVOZ0ZLHQ"
  },
  "h2dGslXkzyC-mb-ckpHoxg": {
    "date": "6/12/2015",
    "text": "I'm definitely a regular there now, great food for affordable pricing. Nice atmosphere with amazing service in which I take all my friends and families too and haven't been disappointed yet!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aTK01GfTMGyj4hTkQ7CeSw"
  },
  "UNtRGi7ywenI6QYz6ytHLw": {
    "date": "2/15/2014",
    "text": "Pretty good pho, excellent service. Very clean quiet place with friendly people. The P2 meatballs were tough and stringy, and there wasn't a lot of meat. The vegetable/herb plate was kind of lean too, but they brought more when I asked. The combo appetizer plate was delicious. Overall this is a solid choice for pho in the west valley.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qN2PHY9ZQmKIxW_3UzIVtQ"
  },
  "rVUc_nYmXc2ThXGocHs8BA": {
    "date": "12/10/2013",
    "text": "Finally found a Vietnamese restaurant that is clean and has great food. Great pho and spring/egg rolls combo. Will definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "-8eWskzEFJf9fN21Eo77vw"
  },
  "J8bLYp29Cw21D1FHAg3QKg": {
    "date": "7/20/2016",
    "text": "always friendly, probably the best Vietnamese on the west side along with Little Saigon in Glendale. Always fresh!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WOV7d6kzESwJfDKSNXrIlA"
  },
  "giwllqi5qEQ_88uMXid4aA": {
    "date": "10/10/2013",
    "text": "Pho was average \\ on par, a little pricey for what you got. Egg rolls were a little stale, but not beyond the point that I was upset that I was served them.  Wife loved the dish she got (filet mignon), ambiance was nice, and the service was head and shoulders above most pho places. It's close to my house, so I can't complain. I wish the noodles were a little fresher and the broth a little more authentic, but pretty good for a local Phoenix spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "krwgM0viAl-tTdPZKWBl7Q"
  },
  "WuOUAmHYOlTZ1zxgtY4cGw": {
    "date": "10/15/2014",
    "text": "Great little neighborhood place with authentic Vietnamese food.  My co-workers and I frequent this place often because you get great fresh food at a good price.  We have always had a good experience at this great little place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l7pSbDJLP5xN1vXn3In-nA"
  },
  "ZbgOzkJzLGm8DbPuHqQoOg": {
    "date": "12/27/2014",
    "text": "Mostly clean environment.  Friendly staff.  Quality of food is what killed it. The food was like top ramen in comparison to the Pho I've had elsewhere. Definitely not the comfort food that proper Pho is.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yKxN8AN6xgm67UJtTNqfNw"
  },
  "dsxQPbRPFOwulYJe-ThdgQ": {
    "date": "7/6/2014",
    "text": "Wow the minute we walked in ,the service is awesome ( Maria ) gave it a spark, we felt welcome ... The food is very good not to pricey just right to go Back again and again. Love Vietnamese food just minutes from our home ...Thanks Song Lynn !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5SRsiKfq6a1BdBDM7eFadQ"
  },
  "OkmCdxHi-sjeZ0DKHmRbQw": {
    "date": "6/28/2013",
    "text": "Awesome Pho and amazing friendly staff experience!  Couldn't have been nicer!  The place is very clean and the menu is extensive!  Will definitely be back to try more options!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "SiWEloBaxpP2_luQEw8eFg"
  },
  "sXSXaH5Raq4C7iML9VHKkg": {
    "date": "11/30/2013",
    "text": "More than decent pho! My girlfriend and I come here often. Prices are fair. Only complaint might be the smaller portions of meat in the p2, but it's quite good nonetheless!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a2Gy4_729uFgcE5u2xJSzQ"
  },
  "M52R_HN8as3179mf7WljYA": {
    "date": "3/18/2016",
    "text": "Very fast! Very good!! Very friendly service!!!     My past experiences with Vietnamese restaurants has been slow and bearable because the food is typically so good. Here? Nope. All the food was out faster than I could blink. And it is all soooo good. I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CjPm0_ZSr0EqctjxQBjLww"
  },
  "nb9nG1onytNcFK2adbcxww": {
    "date": "1/14/2017",
    "text": "My favorite place for Vietnamese food on the west side. Big clean place with good service. Love the beef rolls and pho.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UpLZQibLNo-Udo8Ds6VSwQ"
  },
  "sO4XDAlL1ZnKQqpmth0AEQ": {
    "date": "8/3/2015",
    "text": "I'm giving it a 5 star only because the food is amazing.  Finally I'm able to enjoy asian, vietnamese food and tell everyone.  I love the flavor of the Pho soup, the fried rice was to die for.  We are defenitively coming back.  I would though get the server to move and be more alert, if you are in any rush then you will be late, if you are just there to chill with family and friends then is a great overall place to eat.  Clean, nicely decorate, sweet staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "55sdBWUYfoIgjL62Fn1xRQ"
  },
  "QOmJR8aKU44Az-XJDhs-QQ": {
    "date": "1/5/2017",
    "text": "I love their Pho! Such great flavor! I was surprised at how fast the service was. Definitely will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zb46GWalNoovh4XuRkOUcg"
  },
  "xVACMiPK5ZojUtVQefA6LA": {
    "date": "1/2/2017",
    "text": "What a disappointment! I was looking forward to eating here with my family but the food was more expensive and lacked quality than other Vietnamese restaurants I frequent. No friendly greeters, egg rolls didn't come with fresh mint but instead wilted lettuce, I had three pieces of beef in my pho, no cilantro, overall it was pricey, less flavorful and skimpy on the vegetables. Not impressed at all, wouldn't come back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BhHfvbG_GKMYwwdu0iWafw"
  },
  "h2SlUdgg4yUWYRAKyY_jrQ": {
    "date": "11/2/2015",
    "text": "My husband and I came in one night for a date and it's a very small place, clean, and service is AAAAMMAAAZZINNNGGG! Our waitress was GREAT! Their Thai tea is delicious, and their pho is delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BhqtMSOHRa9IfaQOAcbETw"
  },
  "k2TrfYO2O16qENWq7ZXCvA": {
    "date": "7/13/2015",
    "text": "I LOVE PHO! This place is definitely the BEST Pho in the West Valley. I often travel all across AZ to get a good bowl of Pho. Song Lynn is among my favorite Pho spots and it is your best option if you live in the far West Valley. Its clean, modern, service is quick and they accommodate an array of options from vegetarian, gluten free etc.The Banh mi are fresh and the bread is so soft and crispy. The Spring Rolls are made to order and the portions of Pho are quite generous. We usually order appetizers and share a large bowl of pho P1 or P12. The Curry is fantastic and the Song Lynn Special (S1) Is amazing, Its a nest of noodles and fresh stir fried veggies with your choice of meats. I love how they already know what I usually order and how I like it prepared. I love extra limes and jalapenos and they always accompany my pho. They are very attentive and  I come here several times per week because the food is consistently delicious! Happy Hour is from 3-7pm but prices are great all day. You can literally have a Vietnamese feast for less than $25 bucks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hDf4Pcp5swH80D8MBzeIWQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Feasting! appetizer Combo, Hanoi vermicelli and large Pho!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hDf4Pcp5swH80D8MBzeIWQ/o.jpg"
      },
      {
        "img_id": "27_4Jel9Q-gGtWKrnatZuw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Pho to go! #p12",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/27_4Jel9Q-gGtWKrnatZuw/o.jpg"
      },
      {
        "img_id": "U-MjlNix9BdAUtNSmoKSlA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. B1 combo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/U-MjlNix9BdAUtNSmoKSlA/o.jpg"
      }
    ],
    "user_id": "H0r5UfPsofy7PXmVEplRpA"
  },
  "foL_2NmeiaOL9HoW9mVWmg": {
    "date": "7/21/2016",
    "text": "The only reason I gave this place 1 Star is because they gave good service.  After seeing their rating of 4.5 stars and the good reviews I was extremely disappointed.  My family had ordered a couple bowls of large size P1(Pho Dac Biet) and a large bowl of Bun Bo Hue.  The $10.50 they charge for the portion of a large bowl was not worth it.  The meat they gave was like cheap scrap meat and on top of that they didn't even put the right cut of meat in the Bun Bo Hue.  Not sure if they ran out of the correct meat and just substituted with whatever they had left.  I definitely will not come back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oFkZbHSiT0jqEKLZ3uK95Q"
  },
  "a_u-fWmXFmXSU5Imowbmxw": {
    "date": "4/2/2015",
    "text": "I want to beat the owner's butt because they won't put salty lemonade on the menu. Otherwise my new favorite pho restaurant.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sNoQJjemPvRjultTQa5wRA"
  },
  "FjQhES_HT38FYOmzb4yDJw": {
    "date": "1/27/2017",
    "text": "I've only been here twice but both times the food has been consistently great! I've had their egg rolls and the \"P8\" which is the well done brisket and beef broth Pho. Even my not so open to try new things fiance and son loved this place. Trust that's saying a lot because they are picky eaters. I'm so glad I finally found a good spot for Pho close to home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DN8Vs8tiWHgG98RUd3uaIQ"
  },
  "9Uy4eiOJxTHZ7pzfSX4gPA": {
    "date": "3/2/2015",
    "text": "I absolutely adore this place! I come all the time and get the pho tai. Only place on the west side that nails it. The servers here are INCREDIBLE. They are so sweet and cute! Kitchen is super clean and you can see it from the front dining room. I love Vu the owner as well. Yay song Lynn!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wu2JdXulqG0slUemcZZNnQ"
  },
  "IZLtpryAL5pCgKxIQ8BUog": {
    "date": "7/29/2014",
    "text": "I've now been to this place 7 times.  The food gets 5 stars!  The decor gets 5 stars.  My problem?  You have music playing and the TV playing at the same time...It's a racket!  Pick one or the other.  My other problem with the TV, it's always on Fox News....REALLY?  In an Asian restaurant?  Isn't like like Chickens following Colonel Sanders?  Turn that divisive crap off and put something pleasant on for a dining experience.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ubZk0FCJArDL4do33Vn6Nw"
  },
  "qY1xKqAkJD-WV6_U1tFyZQ": {
    "date": "6/18/2015",
    "text": "I had the curry! It was Amaze! Fast service. Clean place. I'll be eating here more often for sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CxYMwWTP8NiIXwXna2Ln5Q"
  },
  "LULGxxBkfs8SUQH0TAGhDg": {
    "date": "12/28/2014",
    "text": "A cute and nicely decorated restaurant hidden in the corner of a small shopping center across Starbucks. I ordered Hu Tieu soup which is an egg noodle soup with vegetables and pork, and it was very good. The staff was also very friendly and the environment is clean. I will definitely be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sYJyJKmN6IF0gNP1b02ldQ"
  },
  "GrSarNGk9q_MMj1rnEwceA": {
    "date": "12/9/2014",
    "text": "Very clean restaurant and the food taste so good . I loved the service here I would defiantly come again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-CRqd1gH6m9qG7tWTm0Ltw"
  },
  "Iqc5ZoZw_rBnJGquLttHXA": {
    "date": "11/23/2014",
    "text": "I dropped in on this place on my way to a comedy show, we were running a bit late, but man they were fast.  It was also the first time I've seen a restaurant use a tablet to take an order (saving time writing it down and entering it later).  I also noticed they had call buttons for the servers, what a proactive and forward thinking concept, and the place is pretty small and would fall into the hole-in-the-wall category.  The food was great, the service was fast and professional.  It's on my list to return and a good place to bring my vegetarian friends!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PaCipJMIGAhK2c9bQVkeJw"
  },
  "PcdDPxe2OVulPyZfp8NktA": {
    "date": "5/12/2014",
    "text": "Today is my first day going to this Vietnamese restaurant, and the waitress she was really cute and nice, but the thing that tick me off was usually when people order a plate that has rice they should give a free small broth on the side. This old guy which seem like his a boss there he said the broth is free with my rice, but when I paid and look at the price they charged me for the soup that they say it was \"FREE\". I compared my receipt to the price in the order book and it was different. So they did charge for my small bowl of broth. So whoever goes there please check your recipes and make sure they don't charge you extra money. I would've paid extra money if they would tell me the truth, but instead they lied to me saying its free and yet they charge me extra money.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "G-Y-ZLyzioGNt6Gz1bwSTA"
  },
  "ttzwns7bfHFY7_GZ_S98fA": {
    "date": "10/23/2015",
    "text": "Their pho is really lean . They are always so nice . Their lunch special are good and really affordable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NL6U8jc_0gnAE0SmtMiTdA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Really good pho . Not greasy it all..",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NL6U8jc_0gnAE0SmtMiTdA/o.jpg"
      }
    ],
    "user_id": "gjW_74O-bgpuxLQc3Sr_bA"
  },
  "KOi7pMDGxgul7T9wvsG4xA": {
    "date": "12/2/2013",
    "text": "One of my favorite hidden lunch spots!  Their pho is delicious and we love the pork egg rolls. The atmosphere is nice, and employees are all very friendly and accomodating.  Delivery is quick, and they include everything you need to spice up your pho. I'm so glad we found this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5r5OlxPFlexu7uyTt7tH_Q"
  },
  "F75lgc4jc2QdoziqmWdKOA": {
    "date": "8/31/2014",
    "text": "Came for lunch. Extremely disappointed. My fiance and I had pho. She's Vietnamese and she knows her broth. The broth was simply chicken stock. Pho broth is very complex. It has star anise, cinnamon and other fragrant spices that were not in this broth. The owner has got to know that her broth is subpar! How could you not? And if a Vietnamese restaurant does not take pride in their pho, then I don't care to try other items.  On the other hand, service was good. But I won't return to a restaurant for bad food with good service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "agR6de0vN78LfSzH5-2spQ"
  },
  "s_1qQdysQqZ_nirf1-hhCQ": {
    "date": "7/26/2018",
    "text": "The food came out fast and everything was very good. The noodles didn't have much meat but it was delicious",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gfvYAb5SAj4oe-6A9PctGw"
  },
  "6WM-U0t4Zq2an_HRhwcEgQ": {
    "date": "1/30/2018",
    "text": "Love this place! All staff is so friendly and their service is always quick.  I am never waiting long after I order! My favorite things to order on a splurge day is the hot tea, chicken noodle soup and calamari!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5bdzjc_DKdfvAdclkJMKgw"
  },
  "-SGZD1CUOJCc7V8U6VGiHg": {
    "date": "7/12/2018",
    "text": "I had the pork and shrimp spring rolls to start.  They tasted vegetarian, not a plus in my opinion.  I could barely taste the pork and could NOT taste the shrimp even though I could plainly see them.  They were good size, too.  That's what happens when restaurants use seafood that has been treated with TSPP (a preservative).  It washes out the flavor.  Almost all of the shrimp one buys in this country has been treated.  The peanut dipping sauce was the worst peanut sauce I have ever had.  It had a strange taste (fish sauce, maybe).  I did not finish them.   As a main entree, I had the P7 -- rare beef soup.  I asked the waiter for his recommendation and went with that.  The broth had no depth.  There was no beef flavor.  The flavors were plenty of cilantro, some onion and a seasoning I am not sure about (5-spice, maybe).  The thin sliced beef in the soup was essentially tasteless.  Of the four Vietnamese restaurants I have eaten at in the Valley, this is the only one I would not go back to.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jChCmmwK0MsTFuKQY8u2JQ"
  },
  "uyR9B5IsVOoRnwF1MZ1bJA": {
    "date": "11/5/2018",
    "text": "Super friendly people and super delicious food! Everybody should tried their chicken fried rice it's the best at this part of town",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aSOeVcoRb8fStNfGjRbR5A"
  },
  "TXfrVo9TE3-Lw-Py7zpplA": {
    "date": "11/5/2018",
    "text": "Service is great and most importantly the food here is delicious!  Parking can  get packed but well worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ge85AwHrIBYJE9u2Xg1TA"
  },
  "eX5SNPq2mDOSJwyn_k8G3w": {
    "date": "3/9/2018",
    "text": "This place was okay. Pho tasted good. Their prices were higher than other pho restaurants but the size of the bowl was tiny, so value was not that great at all. Service was just ok. They were friendly but seemed busy with other people. One thing this place has are great banh mi....especially the grilled pork. Probably the best I've tasted. But again, size was small and price was higher than average. I would suggest to try the banh mi though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OT0VuG0p5l1NplYjao-5hg"
  },
  "gAD5-OU7wtU_xrIJ2Gzy4A": {
    "date": "8/15/2018",
    "text": "sooooo good! I grew up in the Bay Area of California where we were saturated with delicious pho restaurants. Coming to phoenix I really missed and craved that authenticity. This place filled that hole in my heart!! The waiters are always so attentive and the food is so good. Would definitely come back and would come back again and again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "b71jtwxyN60B9xDArnI_0A"
  },
  "_xTEhCKUcxfbdLwnrDLoRQ": {
    "date": "4/23/2019",
    "text": "Real good food for everybody good seasoning , I will be back after my first time they are today. My fiance loves this place!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "de2PCqYel2FZ5pP_p4BmCw"
  },
  "yWAoV4i_D8fjDN9Qq1dK4w": {
    "date": "7/14/2018",
    "text": "This was only my second time ever having pho and compared to my first experience, this time it was good! The one I tried was the beef flank pho, and that portion was HUGE despite being the regular. I did also get an order of spring rolls and those were definitely my fav.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Z3vfui023J2S1RKRAmaMkA"
  },
  "LFaPMGYa4JvneCSexx4m6g": {
    "date": "11/16/2018",
    "text": "The food was absolutely amazing, quick service, friendly staff...would definitely come again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "epEJ9PwvbPRO83Jw6v__6Q"
  },
  "EKvhYUgjxhhgxUpc1Dt2_w": {
    "date": "11/16/2018",
    "text": "A perfect lunch.  The food is so fresh, hot, delicious.  There is huge variety on the menu so everyone will find something to enjoy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2vM_HIgU_mplKz975BCf7A"
  },
  "ekC2kw39z7PnnDm3mi8xRg": {
    "date": "11/13/2018",
    "text": "The food and service is great and the restaurant is clean.  The best Vietnamese restaurant in the area for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kwWR0-J5-AnCgTYNCyI0Mg"
  },
  "RlSyuYfwuP7g2su3XrFN4A": {
    "date": "7/9/2018",
    "text": "I love this place. Food is authentic and delicious and the service is good. I am a fan of the fried dumplings and pork banh mi. Yummy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5rf70vnqvROvr4GDvMCP1Q"
  },
  "eGM9S9eDicchfiqcrBKcsw": {
    "date": "5/26/2019",
    "text": "I went to go eat and although it was 30 minutes before they still told me that I could sit anywhere I wanted and I went to go sit in the back tables and then I heard the workers talking about me and saying how I was weird and why did I sit there and I thought it was very disrespectful. Later they took my order and brought the food out fast and literally wanted me to finish a regular shrimp pho in 5 mins. 5 mins after I got the food different people kept walking up to the table to see if I was done when it was around 9:20. I was trying to eat fast because I just didn't feel comfortable anymore and then this worker walked up to the table again so I asked him for the check so he could just take my card and I could fit in another bite but instead he wanted me to get up right there and leave and at that moment I was in tears because of how upset and embarrassed I was, he asked me if I wanted to take it to go and I said no I didn't want to take their shitty pho home that only had like 4 shrimps in it. I was so mad I didn't get to enjoy the food that I PAID for. I just didn't want to deal with it and me and my brother got up to go and i gave him my card while I waited in the car because i just wanted to get out of there. NEVER in my life have I ever had shitty service like this. And also the waiter got upset because we didn't tip. I should've of spit in his face that should've been his fucking tip. It was 9:28 by the time we left. Don't go to this place if you don't want workers who don't know you talking about you negatively. Things could've gone WAY differently if they would've just said \"hey we're closing in 30 mins we can only do take out\" or something rather than to just try to shove the food down my throat in 5 mins. I would've understood because I'm not crazy or aggressive and this is the first review I ever wrote on anything so yeah I'm pretty upset.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GY1De4SJ6zddzQvRNjA-gQ"
  },
  "MAraBaBP_lnW46Dw3cfuxA": {
    "date": "6/11/2018",
    "text": "Best pho in the West valley hands down. I am a regular. Staff is very friendly and service is very fast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "J_VD8osornn-MsgR985Ocg"
  },
  "IlhEkIGbZ1nm_j0Q_wQ7XA": {
    "date": "7/2/2018",
    "text": "Great place on the west side! I've only been coming here a few years but every time they impress. Love their Thai Tea too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nPC-uzbGfhw0MDtzjjQv3A"
  },
  "LagJWNTKgSbd9f7giOsXWw": {
    "date": "2/18/2018",
    "text": "My dad was visiting from texas and loves vietnamese food so we decided to try Song Lynn after seeing a movie.   We got our food to go but the girl who took our order was very friendly and helpful. Our food was packaged nice and secure which i definitely appreciated.   We ordered two kinds of pho, chicken fried rice, crispy chicken wontons and vietnamese spring rolls.   The portions were very generous with a good amount of meat. The crispy wontons were very tasty and were even still hot when we got home. The soft spring rolls were pretty bland even with the dipping sauce so i will probably skip those next time.   Their bahn mi looked very tasty so i will definitely be hitting them up again to try some other things.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SDW9oFh31koSFlwrEV5M2w"
  },
  "VNgV7P0iEGiXAS63PBwivQ": {
    "date": "7/27/2018",
    "text": "Being from the Bay Area we have our fare share of excellent Vietnamese restaurants. We were apprehensive to try it being that we're in the desert. Boy we're we wrong! This place is excellent. The staff was super friendly. The Pho was perfect. The spring rolls were super fresh and the sauce was yummy. The egg rolls and shrimp rolls were cooked perfectly. We'd definitely go here again .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HGANiSkXUTEEX50Xhtz_5Q"
  },
  "oeJocf2XBgmI3sBUOOXOnQ": {
    "date": "9/12/2018",
    "text": "Great restaurant and delicious Pho, I have come back here a few times great service and atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3oX5g1lv8UtvEetsGqnRaQ"
  },
  "Z_apLhVa2uetJNXRUBc2Ww": {
    "date": "2/5/2019",
    "text": "I love the pho here! It's definitely some of the best I've had in the valley. The staff is also always friendly and the price is great. I just wish I lived closer so I could go here more often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RaUihkdomiQ0uMH9ErGfaQ"
  },
  "eCJLNrSUC4sRDsOv2wcXVQ": {
    "date": "11/12/2017",
    "text": "Wait staff is always prompt, food is good and best of all they allow you to call ahead of time and order so you don't have to wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ql6FL3iK_Iy8QvKgksibOA"
  },
  "GLrilLSOeWXPJGL0G2upOg": {
    "date": "9/2/2017",
    "text": "The Asian girl that works the register sucks!  I fucking hate her. I literally avoid this restaurant just to not interact with her. Some of the other asians that work there are snobby, like that other young man that sometimes works the register. Some are nice. Overall they will treat you differently if you are African or if African dissent(black). Fuck them.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mtsT8yJfRJnbwlpPqCRYkA"
  },
  "XHXbT9tpauxYAuOySBVgGQ": {
    "date": "12/8/2017",
    "text": "Such delicious pho! Crowded on Fridays and weekends but that's because it's so good. Affordable and high quality, very friendly and polite staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GhIhs4GrpAZb2OU1aXoxqw"
  },
  "mQHq_H_w-jj1MEOKyEmuAA": {
    "date": "4/1/2015",
    "text": "First time in here.   Great services, friendly, and fast. The interior of the restaurant was nice and clean.   I ordered the bbq pork sandwich and I like it. It tasted great and couldn't get enough till the last bite.  The pho was OK. There was something missing flavor in the soup. It didn't taste fresh and light. I believed it still authentic since part of their city have different style of flavors.   The restroom was clean when I came in although they didn't have toilet-seat-cover.   I would like to go back for their sandwich :) and also I will come back to try something else in the menu.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "tM84r9rP7XTjX4SnRzviMA"
  },
  "Fkxs4S8k3kUJThmR3TzLfg": {
    "date": "9/7/2017",
    "text": "One of better Vietnamese restaurants in west Phoenix. I come here whenever I'm in area.  I really like their Beef Stew served with either noodles or Vietnamese bread.  Also the Pho here is really good with decent sized serving.  The servers are always friendly and nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hoiPZA2YBXhA2h-lV1nvQw"
  },
  "aJ_EuxznweuTOhQz8NZxAg": {
    "date": "11/6/2016",
    "text": "Love this place I probably come here too often! I like the P7  Try it out! The food is cheap and delicious, it does get a little crowded some times but I think it's worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0rdOPjM0nw5ICUe_GUrQBA"
  },
  "gvVzwz33WBWBFj5pkPPgPw": {
    "date": "7/15/2016",
    "text": "I come here for pho, so far every type has been very good,  so far Pho tai chin is my recommendation. My wife likes the chicken Pho but is not a person that likes Pho ordinarily.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Z_RR2FSZy-LVsFt7QdzK0g",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z_RR2FSZy-LVsFt7QdzK0g/o.jpg"
      },
      {
        "img_id": "wwfd0Hy3f_qqhqhnHr4vNg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wwfd0Hy3f_qqhqhnHr4vNg/o.jpg"
      },
      {
        "img_id": "mOSnyTkPjrLxNV4OOu4qsA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Yes again.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mOSnyTkPjrLxNV4OOu4qsA/o.jpg"
      }
    ],
    "user_id": "amF-OFti3Op-uo3xZmryqQ"
  },
  "wEEP96SrmqF8PCsrELAVPw": {
    "date": "7/15/2016",
    "text": "Our server was great! Loved that they had pictures for everything on their menu. It made it easier to choose our food (which was delicious). on top of all that, our food came out fast!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-Ow1JnG0uYah1CFnZUjraQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Combination fried rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-Ow1JnG0uYah1CFnZUjraQ/o.jpg"
      }
    ],
    "user_id": "lun1-NaXabXfm6v2dg8Yiw"
  },
  "Q1cdOVLdXdW522bTPcs6uQ": {
    "date": "10/7/2017",
    "text": "Good portions, would prefer if servers would bring fresh glass for beverage refills- I'm pretty sure I ended up with someone else's glass that was getting refilled and that's a major issue. Pho is tasty and filling, plenty for  leftovers later.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x7uiR4x0ZlK6SIQDz3S9OQ"
  },
  "RrVppL0vBd9BWq8PIiYvHA": {
    "date": "10/7/2017",
    "text": "I had a great experience with their food, not  so much with one of their customers.  The table behind me was so rude. There's this mother with her kids saying mean things about the place and the food. Her kids were so uneducated about difference between Chinese, or Vietnamese food, so ignorant about their waiter accent and she didn't say anything about it. Don't take your kids to a place and not discipline them, thats a total reflection to your parenting.  I don't go to Filibertos and mimic a Spanish accent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h334e8R_TpDaj3YUKV81-w"
  },
  "hwSpJDvEZqf0OISFZ9tLGQ": {
    "date": "11/21/2017",
    "text": "Service was great, didn't really like the food I chose it was sweat. No matter shrimp fried rice was good , but ordered spice and it wasn't at all. The noodle dish ordered shrimp I got chicken. Had too send it back because I really don't like chicken.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dae4gB7flkPKGfmEusysww"
  },
  "H4LzRetRCxxuzKxZoebyhQ": {
    "date": "6/14/2015",
    "text": "Modern Vietnamese food and atmosphere, very good food. Interesting method of calling the server over..a doorbell at every table.  a bit more expensive than Pho Thanh, but nicer atmosphere and better service.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MJHPYg6fkL6BvncuGZ27xw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Interior view",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MJHPYg6fkL6BvncuGZ27xw/o.jpg"
      }
    ],
    "user_id": "xCGGOBUHMs8-w-EJdCXZPw"
  },
  "TF48MJkBhb9E4DabVl6zkg": {
    "date": "10/23/2017",
    "text": "I drive across town just for SL. They're the best. Food is great, staff is friendly -- I couldn't ask for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0domXXJ8qgqGgBwe_zmVmA"
  },
  "w35q8EDW3RhA5Cjz6llRRA": {
    "date": "5/18/2016",
    "text": "DELICIOUS food!  I don't know much about Vietnamese food but this restaurant is just the place to try it out.  So far every dish I've had, I would order again. It's family owned, the staff are friendly and helpful.  I try to go there at last once a month.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_PECVc_fx0IK-PzcCAh9FQ"
  },
  "dSFdzed2tyIc3jOAnz0BaQ": {
    "date": "3/31/2016",
    "text": "Very friendly service, and I love how customizable the dishes are. I wanted a small combination pho with clear glass noodles instead of rice noodles and I only wanted 1/2 the noodle portion (I never finish the noodles anyways).  And they happily accommodated and the pho tasted great!  Tried the garlic chicken wings also - they were really salty and greasy (What did I expect) - meh not for me.   Coming from Socal where there's tons of Vietnamese restaurants, this one is on par with the rest of them.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "rIEHhintJA_HGcy6X6hYtg"
  },
  "9Lz87sW1z1xvpl6cHuQ84g": {
    "date": "10/28/2017",
    "text": "This is by far the best place to have Pho... I have tried several places around The Valley and I always come back to this place for a good Pho.. service is great and the place is very clean... most definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "roz4lo7C7JrjOLCZh-WLfA"
  },
  "lzt7cH2l5T9mx0u2bMhwXw": {
    "date": "9/27/2015",
    "text": "Incredible atmosphere. Nice piano music, great service, the NFL game was discreetly playing quietly in the corner on a huge screen, and the food was great!   I got the Pad Thai with chicken, for lunch. It was perfectly spicy but not as many noodles as I hoped (but I am odd - I love many a noodle). It was very tasty though no doubt.  I also got the Thai Tea which was wonderfully sweet and soooo yummy.   My wife and I totaled 2 drinks and 2 meals for $26 which is not bad. The food wasn't EXCEPTIONALLY killer, but the atmosphere was just so bright and healthy, coupled with great service, making the meal much better than average. If you like Vietnamese, there is no reason not to come!! And you can grab your latte across the street after you eat!! Haha (Starbucks).   Give it a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DfOTFj4nDRqxSCJW3z1hJg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Chicken Pad Thai and Thai Tea -- Get that fork out of here!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DfOTFj4nDRqxSCJW3z1hJg/o.jpg"
      }
    ],
    "user_id": "kXR3CaSuo2X2YQHMO0XoUw"
  },
  "3tpGK82qqX0tkOh7qdHObg": {
    "date": "10/23/2017",
    "text": "Really disappointed by the pho! I ordered the spicy beef with lemongrass. The beef seemed low quality - fatty, chewy, not appealing. There was a heavy layer of grease on top of the broth and the broth itself lacked flavor. The noodles were thicker than I have ever had in pho and seemed to have consistency that they had been in liquid for too long.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0nMN1s2p5UA_RxkiUteMNA"
  },
  "R89uxlyCb2lqjIxPZtZfCA": {
    "date": "11/8/2014",
    "text": "Clean, semi-upscale, and family owned business in the West Valley. Great staff and great food at very reasonable prices!  Great place, I must say we were surprised how great it was. Growing up a little bit over a mile from this place, I would never have thought to find such a clean and semi-upscale establishment in a deep corner of a retail strip in West Phoenix.  The tables have a call button to get the servers attention and they use tablets to place orders.  Our server knew the menu well and I was glad to hear it was a family business that has been open for a year know.  This is a hidden gem and I wish them great success.  Everyone was friendly and several employees, possibly one of the owners, asked if everything was good.  We had the fried shrimp rolls, chicken dumplings, and pho.  The plating was very nice!  Great place and we will be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g6uV4F6kCkFJ4gOxrxRSoA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. P1",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g6uV4F6kCkFJ4gOxrxRSoA/o.jpg"
      }
    ],
    "user_id": "rKYOzGzCL_QlbLxt64UKlA"
  },
  "dKTyd8-COOziW4Tm-F6cLA": {
    "date": "7/16/2016",
    "text": "Great staff and service. Food was cooked to order and wonderful. The flavor pallet was fabulous. I love Vietnamese food and this place delivered on the flavor. Price is right and food quantity was right on.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YKPM9UDqKzPpgekWTFezsA"
  },
  "4iw95mmlvRmyx3xVW5Fa6A": {
    "date": "9/11/2018",
    "text": "Worst sandwich ever . Don't waste your time or money on this place. They put hardly any meat and it was the size of an egg roll. Go to 23 ave and bell to get a real Vietnamese sandwich.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fqowjRT_U5pe0pGQmRbLoA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Worst Vietnamese sandwich I&amp;#39;ve ever had.  Had zero flavor and meat was like subway meat.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fqowjRT_U5pe0pGQmRbLoA/o.jpg"
      }
    ],
    "user_id": "UZeAlqL-QPRJTcR05z36Kw"
  },
  "db6FLb0dH_SGTFxF78spvg": {
    "date": "7/7/2018",
    "text": "Best service and pho in town! I've been coming here since it opened and even though I moved further away, I still make the trip here. Great atmosphere, calm, cool and dark. As pho goes, it's great! My favorites here are the meatball pho, Vietnamese coffee, Thai tea and the BBQ pork sandwich. Hardly busy so you are almost always seated right away. Prompt and courteous staff as well. Quaint little spot that I try to frequent as much  as possible. You'll see the same people here too because they, as well as I and soon you, will know this is the best spot for Vietnamese food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jBP4baCciroZKYKdW7gQ9w",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Vietnamese coffee",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jBP4baCciroZKYKdW7gQ9w/o.jpg"
      },
      {
        "img_id": "D4AHdeRoqrxXCIYtXgWDyQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. BBQ pork sandwich cross section",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D4AHdeRoqrxXCIYtXgWDyQ/o.jpg"
      },
      {
        "img_id": "0z1BytYZZQvcCn4wKfHtwQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0z1BytYZZQvcCn4wKfHtwQ/o.jpg"
      }
    ],
    "user_id": "w8MxuklfpiJrh-Jt7hE3Pw"
  },
  "T8GTVSDzARFdi3hrZP3Gtw": {
    "date": "12/30/2018",
    "text": "I honestly didnt like the Pho or combination fried rice. Definitely dont recommend this place .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1gH5hxxnR2VLGIakQCHO6w"
  },
  "TGWgqABnTt3-n7nEZfKhEQ": {
    "date": "6/16/2018",
    "text": "One of the best pho places I've been to. The only bad side is that the prices were a little too high considering the portions are smaller than what I'm used to from other pho places. I asked to add extra meat which came to an up charge of $2. Not bad. Also, the broth was super flavorful. Everything inside looked clean and the service was good. Highly recommend if you want to try a new pho place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4mMV14WvAftkuz4DwjvWGQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4mMV14WvAftkuz4DwjvWGQ/o.jpg"
      }
    ],
    "user_id": "Y28TmNFWTsy5nE2zyZvg6w"
  },
  "LAheI_Dw6KQ2j4cc_-IgYw": {
    "date": "3/3/2019",
    "text": "My boyfriend and I were feeling not so great and were looking for a pho place that was open since our normal spot was closed and we came across this place. First off this place is packed until they're closed which was a great sign, second the service is fantastic! The employees were on top of everything and were very attentive. Lastly we got a large bowl of pho, a regular size of pho, garlic wings, and jasmine hot tea and it was all DELICIOUS. I 100% will be coming back to try more of their menu but definitely for the pho because it had a great ratio of everything and tasted so so good. The price is fantastic considering how high quality the food is, you should definitely check this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wi6kgX_iLnyFHz2C9cKVXg"
  },
  "1uCGH47ZxhHNo7RTl_3Gsg": {
    "date": "4/26/2017",
    "text": "So we have never been here before, wanted to try it. It's not a very big place but it's clean and nice inside. The staff are very friendly, the menu consist of lots of pictures with small descriptions which is helpful. We ordered spring rolls, they were good but obviously had been made in advance they were a little hard around the edges. My husband and I both ordered the dumpling pho but I had Pork he had beef... It was good, but nothing extraordinary, my kid ordered the shrimp fried rice which was good also. It's a tad more pricey than some of the places we usually go to but not by much. Over all it was good, but honestly I'll stick to my other 2 spots.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2qQuKPo5BbsA2XlbT6BPSw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Pork dumpling pho",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2qQuKPo5BbsA2XlbT6BPSw/o.jpg"
      },
      {
        "img_id": "kYUzO1ZY0JhYiG9XziwcdA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Shrimp fried rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kYUzO1ZY0JhYiG9XziwcdA/o.jpg"
      }
    ],
    "user_id": "jHONHSh8BHkmDARrfcoCGg"
  },
  "vNd_eigCmF0kBKg5NHlB8Q": {
    "date": "3/19/2019",
    "text": "The service was great! I had the P1 Pho and it was good. Ingredients tasted and smelled fresh. Will def come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XmRCTcQ5owx7DoHvrwXSqQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. P1 has everything",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XmRCTcQ5owx7DoHvrwXSqQ/o.jpg"
      }
    ],
    "user_id": "r6wx--bG3mzYBFMtsLEjLw"
  },
  "n0wy3zA67k-4d_uYGUeePQ": {
    "date": "2/5/2017",
    "text": "On a roll with my reviews for my favorite pho places- this one takes a top spot. Nice, clean restaurant with delicious looking bowls of pho. Wow!  Service was excellent, an older man came out with our soup and had a super friendly smile and seemed very happy that we were there.  Pho of course was amazing!! Thai tea as well!!  The server took our order on a tablet, and my order came out perfectly, just as I wanted! Love this place! Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yzfbtyVHlNKzJfsNs71y3w",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Meatball and Brisket Pho, wow delicious looking and definitely one of my favorites!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yzfbtyVHlNKzJfsNs71y3w/o.jpg"
      }
    ],
    "user_id": "qDCMUmZktIft-UQwuuP6yQ"
  },
  "WN2M-HA2asJVaI6RgSd-FA": {
    "date": "2/12/2019",
    "text": "We got the egg noodle sea food soup. It was okay but it could use more flavor. I tried to add some spice but added too much. They had Good service though",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fAOa2haWJEWxAbq04X6ctA"
  },
  "Iyg-F8dlkclZ_x1C3c4rbA": {
    "date": "2/20/2019",
    "text": "Loved it, the pho just comforts me every time I'm feeling sick! I just have a great experience every time  love their food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EhF7yb3CLh1G07N6P2S54Q"
  },
  "ML_dTvz771XXQaEfQgBAow": {
    "date": "2/2/2019",
    "text": "Yes...that's a 5 star review! Everything from the service, to the delicious food down to the take home containers is just great! This is definitely my new favorite Vietnamese spot in Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mGH9x_KFNp1aaYxR5MJ8TA"
  },
  "sS9FnnAboNuMZR1BCeIotw": {
    "date": "12/28/2018",
    "text": "I would like to say stay away so I dont have to wait long for a table but best Pho this side of the Salt River.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RwCm5DLfdjoh2C4Re88PJQ"
  },
  "QzI1jRPgJKjeWZIGXt1DIg": {
    "date": "8/24/2017",
    "text": "I decided to come here for lunch to show my boyfriend my favorite Vietnamese dishes aside from pho.   Ordered the nam nuong cuon as an appetizer. Right off the bat, I noticed that the pork/nam was rather brown compared to the red colored meat that I'm use to seeing. Also, they did not have the fried egg roll wrapper that's traditionally wrapped inside.  For my main entree, I ordered the bun tom thit nuong cha gio and my boyfriend the mi xao don tom. I would order his dish a second time.   It's hard for me to find a notable Vietnamese restaurant since I'm spoiled by home cooked meals at home. Overall, everything was decent so I would come back again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0e7Zun1ZS_bR2zMzFa2JXg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0e7Zun1ZS_bR2zMzFa2JXg/o.jpg"
      },
      {
        "img_id": "y4uZq4cbjL_L2VIiPNeblw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y4uZq4cbjL_L2VIiPNeblw/o.jpg"
      }
    ],
    "user_id": "vZFYa63rZtbyiL4bH32CdQ"
  },
  "DTYGsV-_TEVH2OtLx7nndA": {
    "date": "1/9/2019",
    "text": "I love this place so much! I live close by, and when they first opened, I fell in love! Their service and food is beyond amazing.one of their female servers with glasses who is almost always there, works very hard. She is quick, listens to customer needs, and definitely deserves the best of tips. The restaurant has to be the cleanest in Arizona, and their fresh lemonade is breath-taking!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "waE6MUX_FFMLe_Rj1O3Q6A"
  },
  "yCn4QJUbJ0eCeCQkHv40sg": {
    "date": "11/16/2018",
    "text": "Really good pho. Tons of food choices Also awesome costumer service and friendly! Very clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fuSxYNpx2AqaVdSIf6GpAg"
  },
  "ZHLikh2UbHa8TV5O9SJMQw": {
    "date": "10/1/2018",
    "text": "This place is heaven to me!! Amazing food :) no complaints the staff is nice the place is clean!! Prices are well worth every penny.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BA61CF2SEh6FsbPAGsMKXQ"
  },
  "vMS0MjvDgQShS1wrzJZqzA": {
    "date": "9/18/2016",
    "text": "This place was alright as we were looking for something fast before the football game.  A friend had referred this place.  It's a good size establishment with plenty of seating.  Had their spring rolls which were light and airy.  The peanut based sauce was good, wish it had more taste though. The entre ordered was some sort of meat and white rice.  Flavor was there, but the meat was tough, almost like chewing on shoe leather.  Service was OK... the people there didn't particularly seem like they wanted to be there, but it happens.  Glad I tried it for the sake of saying I've been there.  But won't be back...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o05-Cf_BBswFGxs7PLD7AQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Somewhat edible shoe leather",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o05-Cf_BBswFGxs7PLD7AQ/o.jpg"
      },
      {
        "img_id": "XeUutRh4WCI4FsVpBfSZwA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Spring rolls  were alright",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XeUutRh4WCI4FsVpBfSZwA/o.jpg"
      }
    ],
    "user_id": "U3pUjfYNZZjmpjVE1tKboA"
  },
  "0u2GwsdwSsqzSttJpk10Aw": {
    "date": "1/23/2018",
    "text": "I normally order through Yelp for takeout- this is hands down the best place for Pho in the valley. Their broth is tasty and savory, without being overwhelming to the ingredients you put inside. They are very accommodating for takeout orders and package everything up for you that you might need. I'm a fan of their Well Done Brisket Pho, as well as their Vietnamese Coffee and their appetizer sandwich.   The parking lot is small, so be prepared for that. It's tucked into the southeast corner of 91st Ave and Thomas Rd, next to SimonMed Imaging and behind the Starbucks. I love supporting local and these guys deserve your business.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3ksIE0ySpHJxvgDz0_K_Zg"
  },
  "PgkBsc4iGbsbBtJkUVXd5Q": {
    "date": "11/23/2018",
    "text": "Enjoyed the portion on their Pho even when you get it to go they don't cheat you.  I have only had the pho here so I can't really tell you how other dishes taste.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SwV6gsJo5lQQ810uB1qd7A"
  },
  "woIwTYDZxd7B4FTktIYjvw": {
    "date": "9/28/2017",
    "text": "THIS is the food that is SO delicious that you forget to take a photo until you've already dug into it! Haha.    I have lived near this place and EVEN get my nails done right next door, for the past 3 years and I'm so disappointed in myself for this being the first time ever coming here. I've had it bookmarked, and even told people that we should go but never did...UNTIL NOW...I can't even put into words how impressed I was by this place. It's so clean and nicely decorated, the menus have pictures of the food, they serve pho AND the most amazing Thai Tea Boba!!!! My boyfriend and I couldn't stop talking about how much we are going to frequent this place from now on. The server was delightful and timely and everything tasted better than I even expected.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZsNYFWbnm7U8p470eUXzFA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Spicy Thai fried rice- Chicken and Shrimp, hold the pineapple though",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZsNYFWbnm7U8p470eUXzFA/o.jpg"
      }
    ],
    "user_id": "_2HT951XwN7YlyWfdMXYNw"
  },
  "U2W6YZEtoKiuIKt9Mzp9xw": {
    "date": "8/3/2014",
    "text": "My parents came to visit so I decided to take them out for Sunday lunch. This place was closest to my house so we decided to go here. As I pulled up I remembered that I came here once and hated it. So I decided I will just order something diff but again the food tasted terrible  The spring rolls dipping sauce was spoiled and asked them to switch it out which they did and it was more fresh but they stand by that it wasn't spoiled, I'm not going to argue.  The pho is very sweet and I literally had 2 meat ball and a few tendons the rest was all noodles and broth.  I'm very surprised that they had such good reviews. I knew the moment I walked in and it was so quit on a sun 12 noon this looks bad. I wanted to go some place else but we were all hungry and thought to give them another try.   I'm sorry to review this place so badly but I really dislike the food. The service was very pleasing tho. I'm sorry but we will never come back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xGYa-YAqaIpvSvs3GCzScw"
  },
  "BOJBKMpD8KXqGx4hbpkyTw": {
    "date": "8/14/2015",
    "text": "Very clean restaurant. The food is really good. I especially loved the strawberry boba shake. Overall experience was an A+.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pICPyekffemht7r1oBJavg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. The shake is extremely fresh.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pICPyekffemht7r1oBJavg/o.jpg"
      }
    ],
    "user_id": "Q-TUKlprhXu3zALfIs_9Tg"
  },
  "k4gZbdrVsBfc4wc6vDPRlg": {
    "date": "8/5/2015",
    "text": "If you haven't gone here, go! Delicious every time I go consistently. I love the meatball pho. Just thinking about this place makes my mouth water.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tc7KMemClmLQD3-OfLBYhw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tc7KMemClmLQD3-OfLBYhw/o.jpg"
      },
      {
        "img_id": "t5mJuMaq7MnsSiTk997xhQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Delicious heaven",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t5mJuMaq7MnsSiTk997xhQ/o.jpg"
      }
    ],
    "user_id": "FL-YTGSgKQ3QC06DD-Q4Ew"
  },
  "M0W47o2HR2elAfFvpptvhQ": {
    "date": "6/24/2016",
    "text": "Friendly and quick service, great variety of dishes.  Food was tasty and prices are reasonable. Get advantage of the happy hour !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FOp1g4tBXBOuf4xUmP0EiA"
  },
  "ahwXJRan6bCJ7kRFiAEDZw": {
    "date": "4/2/2016",
    "text": "Pad Thai was amazing. We will definitely be back for some more. It was the perfect amount to share !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ussTX2dlUmwE90K5GaXF1g"
  },
  "DzDQ3Mq_d0LDOxsgl988Gw": {
    "date": "11/16/2013",
    "text": "This was my first time here and I must say I really liked it! The pho was delicious and they have great service! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "IyJHlNCjZMEF6FZgba1ZpQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Delicious food!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IyJHlNCjZMEF6FZgba1ZpQ/o.jpg"
      }
    ],
    "user_id": "4VRQaxqhtfzppjD2bqcV9Q"
  },
  "MaaSD5Py-Q1qK_uZLAubfg": {
    "date": "3/25/2016",
    "text": "Great Food, fast service. Try their combo fried rice with Chinese sausage and grilled pork chops. Delicious!!! Definitely coming back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d36vl0abNc778zbw6Zljtg"
  },
  "_BPoSwf3ttMT--H059WWLg": {
    "date": "1/25/2016",
    "text": "This was a beautiful reasturant and the staff was very polite. Food was delicious. Overall it was a great experience and there was almost no wait time when it came to ordering and picking up food on the spot. Everything was packed together very neatly and with care.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KArDHXi-SLgFufvr_7j4VA"
  },
  "C3Ze8CRnDgYbqcZtibxwgw": {
    "date": "11/29/2015",
    "text": "The owner is very friendly and came to say hi, the food was really good, they were busy but managed to get the food out quickly, also very clean environment, the only thing is I wished they implemented banh xeo but I would recommend this place!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FSpFT-OCXxg4qWZEXOS25g"
  },
  "YAbXE_c5a3etBpdZGyw7Mw": {
    "date": "3/13/2016",
    "text": "I LOVE this place..BEST Pho on the westside....always fresh, service is great and it's very cozy......our go to spot ALWAYS for great Pho",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BOhK-VJJ0YWT4GkHPK7Y-g"
  },
  "DUzsPE53Zqx91M20eFIafA": {
    "date": "4/18/2016",
    "text": "Just tried this place for the first time with my fiance. Gotta say we definitely were impressed. It was a very friendly and casual place, but with a modern look. We both ordered Pho, as well as the combination appetizer. Both were really great and was out in fair time. We went right at the peak of the dinner hour. It was fair priced, and definitely left us full. We are looking forward to our next return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h3JsITblItc6euQp666_tQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. P14. Chicken pho. Delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/h3JsITblItc6euQp666_tQ/o.jpg"
      }
    ],
    "user_id": "xksREiNoWPcSm4Ks558rmQ"
  },
  "gs1CSLZmorVNEa3fY-mgyw": {
    "date": "4/8/2017",
    "text": "Really good pho recommend the pho chicken dumpling get the large bowl to split with other ppl and also the chicken pad Thai is good. Sometimes wait times are lengthy but good clean and nice",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ntVNxVeSimzi4q4pXgUWwQ"
  },
  "EKeENNy9_LMbAix2ZAqdwA": {
    "date": "5/25/2016",
    "text": "Love this place! My boyfriend got the lunch Pho and I got Orange Chicken and they were both delicious!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mt5DKHa2yIWx1NMHcknrlA"
  },
  "N8YGikfEGzLvlC6m3fiDPA": {
    "date": "1/31/2016",
    "text": "We order the Vietnamese sandwhich and egg rolls and it was super delicious. Service was great and place was clean.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QpBNM98HFnkq71-mrX9JAA"
  },
  "xzsPMCXzcqa4uRl32f1RVA": {
    "date": "12/31/2015",
    "text": "Super yummy! Very clean.  Nice staff, very attentive, very good prices and food was so good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JQZzaOv9tRimpC-Iwzgz9g"
  },
  "adaxSfK1XBGBKESY8MzwrQ": {
    "date": "1/21/2016",
    "text": "Very delicious chicken pho, but I would like to see a little more chicken. Didn't seem like there was enough.  Staff were friendly and good prices.  Enjoyable meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tFD49hitYWw74TmF43zQ8Q"
  },
  "z5AzCfyxurOBYKWAn5s1Qw": {
    "date": "12/6/2015",
    "text": "This place is really good. Very good service and it is super clean. I have had their pho and it is very tasty. I also had their banh mi which is what I recommend.  It is nice to have a pho place on the west side of Phoenix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1uag3wxLKUiK4qZ0c_tCKQ"
  },
  "H89VRPVv7_Ttmb2_b9zVNw": {
    "date": "5/1/2016",
    "text": "First time eating here and was very impressed by the cleanliness, exceptional service and great food!!   We will definitely be back!  Five star *****",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mm4-vnbZmCxGtZKFgPCBBQ"
  },
  "k5rq4sE_rCat5u4GiiGvJg": {
    "date": "8/21/2014",
    "text": "I have just fractured my ankle by tripping over a log on a fishing trip. Yes, it is sad. However, every cloud does have a silver lining and I found this misadventures at Song Lynn. You see, it is just a small jump away from the Emergency Room that I went to! The food is great, the service is fantastic, and the pricing is perfect.  I plan on telling all of my friends about this gem of a restaurant - with any luck they'll have to expand until they reach my neck of the woo.. eh, desert.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_yBLezUDOLvviE2wn9CSrA"
  },
  "h0bNX-m0WgzIIi0Kk9sFfA": {
    "date": "12/5/2016",
    "text": "Good food, casual enough to walk in wearing anything.  The software database on their pads to order seem to be inefficient though (which slows down the service).  Go here if you enjoy Vietnamese cuisine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OlsL70HRz3_C9J2WcwuZKw"
  },
  "vy70JjwyjLzSPO1YhqZ9GQ": {
    "date": "6/22/2015",
    "text": "Unsure what we wanted for dinner, we stopped at Song Lynn for pho. It was your standard pho with beef. Nothing to write home about. The one my son had was red with a meatier broth and very flavorful noodles.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lRTkzWy2SdXZ7BvTKUFnCA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lRTkzWy2SdXZ7BvTKUFnCA/o.jpg"
      }
    ],
    "user_id": "Ixaz7mLwzGQGg_W2yfBGqg"
  },
  "yhHvg7rMb749EM4o1lSWcw": {
    "date": "8/24/2014",
    "text": "Excellent Pho! Great to find a place that has great food in a location I travel often by. Had the rare beef brisket and the flat rice noodle combination.  Both were delicious and everything was fresh. Ambiance is relaxed, simple and modern. Enjoyed the meal and will come again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fO5mXQNKJKSJIsG0B7a_lQ"
  },
  "saB-gI-g_-cGgQ34wP6ALw": {
    "date": "8/29/2016",
    "text": "I'm a regular at this place. H2 is great, with crispy wontons. A7 is a good appetizer - pork is better than chicken in my opinion but both are good. S3 is good, pan fried noodles. I think C7 is the best filet dish and it looks much better than the picture too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uLQuBlH2lH0kMT3VuD3n3Q"
  },
  "HifKcSZY02cTT_i2mlbgQA": {
    "date": "10/12/2016",
    "text": "Very clean and modern.  Very friendly staff. Family owned and ran. They are always helpful and suggestive. A lot to chose from on the menu, that's why questioning helps. Everything I have tried, has been delicious. If you have never tried Pho, this is the place to do so. Pick up is quick tio.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TnIl3R0w2ju9b21JPw5AFQ"
  },
  "qJ2SsW0nijeJMpthRkmG4g": {
    "date": "11/13/2016",
    "text": "5 star all the way...great service.. The food was amazing.. C25 and A 2 love there coconut water so yummy. I recommend this place. Thank you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7WHX4WiEoJyigTjhDkFrIw"
  },
  "CaKNy89kXtJDxRFS2-SvCw": {
    "date": "9/1/2014",
    "text": "Seriously yum! PHO GA & PORK, SHRIMP SPRING ROLLS with fresh hot tea. Yang was an awesome server! Coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zrRR1G7yXRgUX0KbaGlwgQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Pho times!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zrRR1G7yXRgUX0KbaGlwgQ/o.jpg"
      }
    ],
    "user_id": "Ht2mGMdRnuSDY0hGhMJG6g"
  },
  "vwmWHygu8c-6Qflo3fwU7Q": {
    "date": "4/7/2014",
    "text": "I reeeeally want to like this place but after my fifth attempt it's just not going to happen. I know .. it took me five times. I wanted to make sure.   The Pho broth itself is mediocre. Hardly any flavor making it necessary to overload on hoisin and sriracha. The brisket has a weird flavor to it.   Second time I went there I wanted to try another dish. I got a pork Banh Mi and spicy lemongrass chicken. The banh mi was actually pretty good but definitely did not have enough meat. What was in there was about half a sandwich worth. The lemongrass chicken was also pretty good. The chicken was cut into tiny pieces and the lemongrass flavor was plentiful. I was getting my hopes up for this place! I wanted to give the benefit of the doubt and hoped the lack of flavor from my first visit might be the cook trying to find his/her place in a new setting.   The third time I went I got the pork banh mi and the lemongrass chicken again.  The meat in the banh mi had a very scary flavor.  Tossed that immediately and dove into my chicken. Opened the container and it looked like a basic Chinese dish with big chunks of chicken and vegetables. And the flavor? Absolutely none. UGH Ok. Back to square one.  Fourth time, I got the beef banh mi and a shrimp and pork vermicelli dish. The banh mi was delicious.. All two pieces of meat at least. The shrimp in the vermicelli was soooo dry n overcooked.  Another disappointment.  Fifth and final attempt. One last chance because I'm hungry and craving Vietnamese food. I get a spicy beef with lemongrass and cha gio. The cha gio had little pieces of tendon? gristle? in it. Something with a hard popping texture. Not excited about that. The broth for the spicy beef with lemongrass had a strange unidentifiable smell to it. Totally turned me off.   I think I went through a fair amount of the menu to give a fair rating. This place is just not happening for me. I will stick with 43rd Express or Dong A. THIS is where you need to be if you think this place is the  best. I think most of the five stars is for the \"cleanliness\" \"newness\" and not the actual food.  Shame.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "bY83XvCmDVq3ScD9IUkpfg"
  },
  "eG77JGp8bHrEU2es-ZgKsw": {
    "date": "1/25/2016",
    "text": "I tried pho for the 1st time , it was so delicious!!:) the staff was super friendly, I'll definitely be coming back,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cEeVZ3s84jlFC3L0ojjLCA"
  },
  "NLYKGsl2O201urNi3DqwgA": {
    "date": "3/4/2014",
    "text": "FINALLY!! A REALLY GOOD **CLEAN** PHO SPOT!!!  I just moved to the area for the Cal-E-Fo-Nay-Yay and in the three months I've been here I've been in pursuit of a default Pho restaraunt. On the verge of giving up of what seemed to be a figment of my imagination, I found this place.... YAY!!!  The PHO was FANTASTIC! It came in a smaller bowl I was accustomed to but it was a optical illusion because it was a quite satisfactory amount.  The ambiance was more modern and clean. (Kind of reminded me of a quan nhau... hmmmm now I wonder... lol)   Their primary server is a young bilingual latina, which I think is genius!!! I don't have to be confused if I'm ordering a orange juice or a manicure... But they of course they also have the traditional Vietnamese servers if that's your cup of tea who are also really nice and helpful.   I'M SO GLAD FOUND THIS SPOT! AND IT'S NOW MY GO TO DEFAULT PHO PLACE!   =)  NOOB TUTORIAL:  it's pronounced \"FUH\" not \"FOE\"",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "hV_AI_6_-gFO16Z-1wvRJg"
  },
  "Scc_Ld0XTh3WIj1PfCaMtQ": {
    "date": "7/12/2016",
    "text": "They have the best customer service! The food is very good. The restaurant is clean. I'm glad there's a vietnamese restaurant near by my house that has the best tasting food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TZ9uxtunHDnIoy0i_o6dnw"
  },
  "i5mbN8zEhX3GbjEONLgq6Q": {
    "date": "7/12/2014",
    "text": "Nice little restaurant...loved that the menu included pictures of every dish. Food was delicious and service was nice but not too over bearing. I gave a four star rating because we did wait quite a little for our check.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MV1PGd8tDfRWeaDLw2QAjg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Combination fried rice. C13 I think... yummy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MV1PGd8tDfRWeaDLw2QAjg/o.jpg"
      },
      {
        "img_id": "zMWLuSFmA1355oB09qmxtw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Thai tea, try it if you&amp;#39;ve never had it",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zMWLuSFmA1355oB09qmxtw/o.jpg"
      },
      {
        "img_id": "f4Eh1U44cEkKV2wpGnQMGw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Egg rolls that are not skimpy! 4 for $4.25",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f4Eh1U44cEkKV2wpGnQMGw/o.jpg"
      }
    ],
    "user_id": "aKE_9UZKXXHJv8vzHU2j4w"
  },
  "XJrxeJMYX9ur-eZf-TPpvg": {
    "date": "12/8/2015",
    "text": "If I could give this place zero stars I would! I am absolutely furious with the events that happened during my pickup order last Sunday! Please everyone check your receipts and make sure they are not adding tips to your bills even when you clearly marked out the tip line and put a total for a pick up order (I usually tip if I am dining in, but not for take-out). My receipt showed one amount but my statement had another. The excuse I was given for this error was a glitch in the system which made no sense in my situation. Their solution was for me to drive back to the place, which I live about 20 minutes from and only went here because they had good ratings, to get the tip refund. If this was my business I would have fully refunded my customer the entire bill in order to ensure they returned in the future. This place has lost my business for sure!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "uvFe30uMzQo4MIk91wodBA"
  },
  "435rXHF1JL-P-Lrjr16fCA": {
    "date": "7/1/2014",
    "text": "I've been trying Pho places all over the valley.  This is by far my favorite so far.  Great broth, didn't have to add anything except some chili sauce to spice it up.  Great flavor.  The only problem is that you really must buy the large bowl to get enough.    The large bowl should just be their default bowl I think.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TOc5Mp75tikXQUe9gIBR4g"
  },
  "VLzDLQaPXaKtEG71-ATQFA": {
    "date": "5/10/2016",
    "text": "I went here with the wife and it was a great place.  I had the orange chicken with fried rice and it was very tasty and food portions were more than reasonable.  It is a small place which to me makes it better and the service was as good as you could expect.  The wife had chicken curry and she said it was the best she has ever had.  Definitely will be coming back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C0LFnk358Ib9MATlZJuZDQ"
  },
  "G6TPcMA1R3m-w7DEYLIMNA": {
    "date": "10/12/2014",
    "text": "This place is great and to top it off it's on the west side two thumbs up. Clean place great service and good music. Will definitely be back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-ydKZYCeowLarH9PMNOdxQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. BBQ pork sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-ydKZYCeowLarH9PMNOdxQ/o.jpg"
      },
      {
        "img_id": "vyK8txmse-HVk7hAKCvuMQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Combination appetizer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vyK8txmse-HVk7hAKCvuMQ/o.jpg"
      },
      {
        "img_id": "hw7eFXKK2UheVpoye4EdDg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Chicken wings in fish sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hw7eFXKK2UheVpoye4EdDg/o.jpg"
      }
    ],
    "user_id": "lwGMvb3daaYvqRhglfrNPw"
  },
  "5pKfTSZVrmID1en0Sy3L3Q": {
    "date": "3/21/2014",
    "text": "I was in the mood for pho, so I decided to check this place out.   I started with tofu spring rolls, these were delicious. I've had spring rolls before where the tofu was raw. I do believe the tofu in these were fried which gave the spring roll a really nice texture. The peanut sauce was delicious, I added some sirracha to give it a kick.  I ordered the won-ton soup it was piping hot, the rice noodles were amazing!   The waiter was attentive but did not hover which I appreciate. My experience here was great and the price is right.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "grzcOU38b7bHVkDwCQwS-A"
  },
  "0RUQeFJaXjS2ydzSW9FofA": {
    "date": "2/2/2016",
    "text": "I have tried just about every Vietnamese spot on the West side. This has consistently been my favorite. The pho is great, and the beef stew is phenomenal. The flavor of the beef stew has me hooked! They have a great happy hour with cheaper drinks and apps as well. The staff is very friendly, and the food comes out fast. The atmosphere is peaceful, yet casual, and very clean. I highly recommend you try Song Lynn.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2bU81qu-e4KciA3DSaEFJQ"
  },
  "tQH0x_KdDzbrDaHfqqtZ0w": {
    "date": "11/7/2015",
    "text": "Came here yesterday for try first time with a friend. Good ways good but the service was amazing. The young waitress was genuine and adorable. She deserves a raise.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "fKC4WFEMCcW-e9b5VYOWKw"
  },
  "ffPri_I9KTBg3Q14IRBWrw": {
    "date": "9/5/2016",
    "text": "I've recently moved from moon valley to 96 th off camelback and wanted to find a great orcas good pho restrurant as I've loved on bell and 47th Ave. I was so amazed how good this restrurant was and they had the best potstickers I've ever eaten. The soups are my favorite and I just wanted to express my happiness and thoughts. Really great place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HEQz7q5dBDd-VgQwdGDlAQ"
  },
  "GpwnuRngLlxWu9fSTEWkQA": {
    "date": "12/23/2013",
    "text": "Our party of 6 was served very quickly by the kitchen staff and our server was very attentive. I look forward to coming back soon, I had the large \"P2\" with spring rolls and hot tea. My soup was solid, spring rolls perfect size, and tea was hot.   The price was affordable, I am happy that a good Pho place is so close to home.   I will certainly be bringing my family back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "qxTRgdbvhgw14xEh7Wt97Q"
  },
  "_3q3TV4ZSE2oaiooHlhjvw": {
    "date": "12/6/2017",
    "text": "Great Service With A Smile, Smaller Portions and Bigger Ticket For Soup....  The staff was 5 stars friendly and big smiles make you feel welcomed here. I was actually surprised at how much of a smile our waitress had for the entire time we were there. She seemed to greet everyone with a genuine warm personality and gentle niceness.   I ordered the Pho and Donna got the Beef Stew and we both spent the $2 more for the XL bowls. The food arrived and we felt like the XL bowls were the size of regular bowls at most places.   The Beef Stew was 4 stars of goodness...  The Pho was 3.8 stars of goodness...  All in all I just feel a bit odd when my bill is $28 after a small tip for water and 2 bowls of soup... It's just a bit carried away for price....   General rule of business is that you make more in volume sales at a lower price than higher prices but lower volume.   AKA Farmer Logic: You can shear a sheep a hundred times, but you can only skin him once...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "J9F3lp-MxyM1fUR8eauVmg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J9F3lp-MxyM1fUR8eauVmg/o.jpg"
      }
    ],
    "user_id": "3R_dB9VQ_D3WPJEw7pmorA"
  },
  "Pc-7N_QCa5qIdyIYliBYPA": {
    "date": "3/11/2019",
    "text": "A grey and gloomy day outside and what's better than a giant bowl of pho. I'm looking for a new place to indulge and I turn to my trusty Yelp. I found a location near by with great ratings. Four and half stars with 299 reviews. This may be 300...  I entered the nicely designed and comforting establishment. I was immediately welcomed with a smiling face and promptly seated. The heavy aroma of beef stock filled the room. So many tasty looking options on the menu but I had my mind set on a large bowl of pho. My order was quickly taken and the fresh garnish was brought out.   I ordered fried spring rolls and the Pho Tai Bo Vien (rare beef and meatballs). The spring rolls came out  beautifully golden and hot enough not to handle right away. The vinegar sauce was great with the rolls. I only wish I had extra roman lettuce garnish. I love dipping the leaves into the sauce after biting the roll. The large bowl came out and conquered the table with its steaming entrance. The concentrated scent of a carefully simmered beef broth was steaming in my face. There was no shortages of rice noodles, tender meatballs, and nicely marbled thinly sliced beef. The broth with its slightly oily sheen was absolutely wonderful on its own. After enjoying it in its intended form I further garnished and spiced it up with garlic chile paste and sriracha.  The pairing of fresh basil leaves with sliced meatball is fantastic. The bowl was almost too much to finish. Almost...   I would definitely recommend Song Lynn to friends and family. I'll be dreaming of this delicious dish until I return. Well done to everyone working there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "svLggL_8_aDqnB4kvtn1dA"
  },
  "H9W_XLWUXrZ2ZER78Lfbaw": {
    "date": "6/10/2019",
    "text": "Yum! I love pho. I always get the rare beef pho and it doesn't disappoint. I'm a noodle junkie so sometimes I order extra noodles for just a buck! Dine in or take out, I'll keep coming back for pho on the west side!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QOJbs5jE75VHXmpmK_2C9g"
  },
  "i695cB1aQy5lirYteQx34w": {
    "date": "5/27/2019",
    "text": "We have gotten take out twice from this place and we have been completely satisfied both times. Price is a little high compared to other whole in the hall pho joints but you get what you pay for. We get the rare beef pho and they give a generous portion of the beef(literally had a bite of beef with every bite of noodles) and generous portion of all the toppings included. Soup tastes great and everything is very fresh! We don't like getting take out pho anywhere else now because of all of the above mentioned.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ot-WtN5DzpNFQiUEcn6Ipg"
  },
  "z0RqvbZN_vlFKATahs2VtQ": {
    "date": "10/13/2018",
    "text": "Probably my favorite Vietnamese restaurant in the valley.  Fantastic pho. Even better crispy noodles! if you happen to be vegetarian, they got you covered as well.  Great food. Always clean. Staff is always nice an attentive.   Will continue to go here in the double digits every year.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "IykCAoqe61Zp-8TCDM2obA"
  },
  "auS67GZ2jJmuGNSpmXuc3w": {
    "date": "3/10/2019",
    "text": "I love this place I come often but my recent visit there on Friday 3/8/19 was pretty horrible to start off normally we can sit anywhere we want and this time they girl said we couldn't sit there we had to sit in the front where it was really packed and noisy then our waitress was in a rush took our order wrong and also had the nerve to say we did ask for a item that we did NOT and said \" you did order this\" I insisted and told her we did not order she literally wanted to leave it on our table anyways I just did not like the dishes costumer service and rider waitress and we got our appetizer til the very end.   Next time please put reserved on your tables if you don't want people sitting there or a simple DO NOT SIT",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uC8qSwYU6elpGxD48GVjqw"
  },
  "2DjTpbP4IpNRvGXowjSI_Q": {
    "date": "3/3/2018",
    "text": "Alright, alright...the second time gave me the charm that was necessary and much needed to place this Vietnamese establishment in my pocket of goodness to return to. The fresh spring shrimps and pork ,rolls, while not the best I have had, are not even on the my personal richter scale of dislike. My order was awesome,  food that came out quick and fresh. Customer service was awesome and price is great. Solid four and a half stars.   Make the greens a little fresher and green in the rolls and this will be a five :) GO HERE, will not be disappointing to you.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 13,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "BCdSnzsgeJ2OTqpf4luN7w",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Minimal noodles!! Awesome! They just made them correctly in my opinion",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BCdSnzsgeJ2OTqpf4luN7w/o.jpg"
      },
      {
        "img_id": "5lWvwytVsafpeR4DaQBUTg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Didn&amp;#39;t provide heat but I keep a bottle of Sriracha in car so all was well. I subbed for fish sauce.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5lWvwytVsafpeR4DaQBUTg/o.jpg"
      },
      {
        "img_id": "pRjizESQ5rmVwK_XHw44kA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Honestly, excellent. I subbed the peanut sauce for fish sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pRjizESQ5rmVwK_XHw44kA/o.jpg"
      }
    ],
    "user_id": "lWwlPEbkR-yUt057Oc_wjA"
  },
  "TBrRSlMaDyAIe0vP3_nIjg": {
    "date": "6/1/2019",
    "text": "#1 spot of pho .. always clean and the waiters always have the best manners 5 star review for a 5 star restaurant",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1roxKudO23BeUTfNn8Huhg"
  },
  "nh_jKzU6cAALs6AJJd5Uag": {
    "date": "10/20/2018",
    "text": "Best place for Vietnamese Pho in the Phoenix area! The service is like no other. We get the Chicken Pho. Also, best place in town for orange chicken!  They bread it then grilled it bringing out the flavor. The chow mein was also very tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kjT9AiZWXvFDz6eBAwN4TQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kjT9AiZWXvFDz6eBAwN4TQ/o.jpg"
      },
      {
        "img_id": "LE3_7cMcI9Ysor1yGkGtqQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LE3_7cMcI9Ysor1yGkGtqQ/o.jpg"
      }
    ],
    "user_id": "81l-UIM8RCp8EjV3JQMI_A"
  },
  "J9p-TxZajPeSwZFZyyLnCg": {
    "date": "11/2/2018",
    "text": "I really, really like Song Lynn. When you enter the restaurant it smells like food (as it should!) and not like a strong, cleaning product which most pho places smell like which totally deters me from eating there (because I can't stand that smell and that's just me). Anyway, the food is yummers especially the pho which is basically why I eat here. Also, I really like how fast it is to order and how the food comes out so quickly. I've even been able to order food and pick it up which helps for those nights when the fam wants Vietnamese food for dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "irs6z6GvxaC5c8n5o_VmbQ"
  },
  "0MlyQwzMqmNK1u32wXDfiA": {
    "date": "4/9/2019",
    "text": "Those about second visit. My 2 daughters and my wife all ordered the \"P1\". The last time we were here they were pretty good. They don't give you slot of the basil, beansprouts and lime but they don't hesitate when you ask for a little more for your soup.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yYBQ1w43-luJJJ4MvTWxbg"
  },
  "hkyttrBmz0bDg7WH9Y1O-g": {
    "date": "10/6/2018",
    "text": "We've been coming to Song Lynn for about a couple of years now and they never disappoint. Everything I have ordered has been super delicious. I have talked to my friends and family about this place and recommended them to go. Great customer service and delicious food well worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P1jCsfFgIKtuGB-n5-bYHA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P1jCsfFgIKtuGB-n5-bYHA/o.jpg"
      },
      {
        "img_id": "HNjzquhA4eZO3Py_ZPxSfw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HNjzquhA4eZO3Py_ZPxSfw/o.jpg"
      },
      {
        "img_id": "2lQ_BG1gsoTPoD_i_WtVsg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2lQ_BG1gsoTPoD_i_WtVsg/o.jpg"
      }
    ],
    "user_id": "_nGy0ROTvIcLLS5U4ls5Aw"
  },
  "4O0wjhiGq382rHTbMhc8kA": {
    "date": "4/9/2019",
    "text": "Had the rare beef pho and it was fresh and delicious!  Friendly staff, nice clean restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V5a3VTlK8qksogShR78qcQ"
  },
  "X-Y-4Uldea7a31mPGiFhNg": {
    "date": "5/11/2019",
    "text": "One of my favorite places for Pho. Very clean and friendly service and food is great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hibT3yBStPx0b-rapSCMFg"
  },
  "Sm8TkPqt-Etil9M6ykVuAQ": {
    "date": "9/17/2018",
    "text": "Better than the Pho places closer to my house. Everything was really good and the service was excellent. My wife and I had the Pho Thai and the appetizer combo. Outstanding!!!  Will definitely be back to Song Lynn.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cZMn2p8HbzEkFknbvM8e9A"
  },
  "xEerVJ5E2IXeL7lLSwYNLg": {
    "date": "10/7/2017",
    "text": "Din for 2 and an infant; Sat afternoon.  Excellent Vietnamese stop! The banh hi tom & tht nng was delicious! Very fresh veggies and the fish sauce was well mixed. The h tiu bo kho was also really good!  They got our customized order right, which is a definitely plus. AC was working great. Service was very good and prices are reasonable!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "utzOWEyG4J3DT1b1bHE--Q",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. H tiu bò kho",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/utzOWEyG4J3DT1b1bHE--Q/o.jpg"
      },
      {
        "img_id": "0h6aGvzwmcB47uKRyKs0pQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Bánh hi tôm &amp;amp; tht nng",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0h6aGvzwmcB47uKRyKs0pQ/o.jpg"
      }
    ],
    "user_id": "Culr4pWO9tLZbjcxV87HAQ"
  },
  "3389ZeyZerfArJ4itxBgvQ": {
    "date": "9/29/2017",
    "text": "I'm super stoked to have found this quaint little gem of a place.. I always order PHO when my husband and go out for Vietnamese however tonight I had the Pad Thai and I was NOT dissapointed! We also had the egg rolls which were standard but enjoyable.  I'll definitely order it again!  My husband enjoyed his chx noodle soup...(PHO w/o veg)  Upon entering I noticed smiling faces & nodding in a welcoming way which was inviting and they keep it very clean. The staff is friendly and helpful.  Super close to home,  we'll be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qI6AqdM1Ls0B_ojw8Zoi4w",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qI6AqdM1Ls0B_ojw8Zoi4w/o.jpg"
      },
      {
        "img_id": "LBcAao8FEEtvB259B50rYQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LBcAao8FEEtvB259B50rYQ/o.jpg"
      }
    ],
    "user_id": "ftycLKBF8GiQzugUwtO4VQ"
  },
  "O-7kS-Hfn3Nm-_QFuHKMtQ": {
    "date": "3/23/2019",
    "text": "Went to Song Lynn just to try some of the appetizers. Wow, they have some tasty dishes. We ordered four different items. We started with the fried dumplings which are called goyza in a lot of places, nothing special but tasty. We had the chicken wings which are  not what you would think. They are fried  and meaty. Both drums and flappers, not small wings but of a good size. Served with sauteed red and green peppers and onions and green onion tops which also come with the fried calamari and the salt and pepper shrimp that we ordered. The salt and pepper shrimp come with a ramekin of garlic salt which you can sprinkle on yourself. These can be ordered shell on or shell off. We opted for shell off and were really pleased with this dish. The shrimp are fried in a very light coating of flour and the were a nice size and very meaty and super good. The calamari had a heavier breading but was meaty and very tender. Also a taste treat. We were very pleased with our choices and of course as usual the service was very friendly and helpful. This place seems to be very popular, this was a Saturday evening and it was very busy but everything was well paced. Would certainly recommend this place for anyone just wanting to try different appetizers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xb49y6JmxS39lJR-_tRkaw"
  },
  "3_6LW4JbUreAcdxQFtDjJQ": {
    "date": "7/13/2018",
    "text": "Me and my husband went here before heading to a concert at the Gila River Arena. Service is really fast. I had the regular sized beef and brisket pho and my husband had the large sized shrimp pho. We also ordered the pork bahn mi sandwich to split. Pho was good and very satisfying. We loved the sandwich so ordered another. The sandwich is a tad small so it's smart they have it under the appetizer section. Overall good experience fast and fresh food that tasted good. We asked for extra cilantro as the only cilantro was already in the pho and I like a little more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "GSGgqR50m2z7vpNSEiG5LQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GSGgqR50m2z7vpNSEiG5LQ/o.jpg"
      }
    ],
    "user_id": "xuFvZqP16IxJuMUbCn1oeg"
  },
  "V3_23yO-xlSRow8xGi-_lA": {
    "date": "4/14/2019",
    "text": "Dumpling pho is the best I have ever ever had !!! The place gets very busy but the food is always great n.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_BU0vvNDvrCo64MCi1OltA"
  },
  "N-dhT8hI4b9s3S2D7v7jSA": {
    "date": "2/20/2017",
    "text": "My husband and I have eaten here many times, and we are always extremely pleased.  The staff is always friendly, and the restaurant is clean.  Also decorated very well.  The Pho is soo tasty..let's just say that I now have an obsession with Vietnamese food :P.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Ek1WMJcYPkl0ild7eFpDQ"
  },
  "_YzxwjDgzZdM3ak1LJvc-w": {
    "date": "12/4/2016",
    "text": "My family and I have been eating here for a couple years now. The restaurant is very clean and organized. The pho is pretty good, and the employees are very nice. We always get the fried rolls as an appetizer. I would definitely recommend this place to anyone looking for tasty and hygienic Vietnamese food in the West valley.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7yrpuEu12oO_OmBHyxKu9g"
  },
  "gh7HoOh1MsFG0zxvvnrAYA": {
    "date": "1/26/2015",
    "text": "Who would've thunk it?  A seriously delicious Vietnamese restaurant in Maryvale?!?    Well, it happened.  I work down the street and this is on my way home, I had been telling my bff that I wanted to try this place for quite a while.  I had worked in my classroom late on night last week and I wasn't in the mood to cook...so I stopped to get an order of pho to go...I am so glad I made the choice.  Savory broth, raw beef, fatty brisket.  An abundance of noodles and veggies and a slice of lime.  Hoisin and sriracha.  Spring rolls.  Just do yourself a favor and order them.    Well, a week later and the bff and I were out and about on a rainy night.  What is better than a big bowl of pho on a rainy night?  Again, perfection.  Friendly and fast service is just the icing on the cake!  One word of warning...they're closed on Wednesdays!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 12,
      "cool": 7
    },
    "photos": [],
    "user_id": "5g5BjhARiZ4zw0SthMH0OQ"
  },
  "5zJO5ZoVQuZV6pCXwucEmw": {
    "date": "1/31/2017",
    "text": "Great local Pho with vegetarian options! Awesome service, I just wish they were open on Wednesdays. V4 all the way!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sAXmGzzv4ovtSL8slU6i4A"
  },
  "JHTS2GKXFuT9ai76mc20nQ": {
    "date": "12/1/2016",
    "text": "Seriously good Pho. Prompt service even at lunch. Very clean. Make sure to try the Vietnamese iced coffee if you want a True pick-me-up for your day!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "59xlIIiQvldmw5i-5e8Nkg"
  },
  "EqG2EuT9aNxIgnQUbPSThw": {
    "date": "7/17/2015",
    "text": "Came into this place w high expectations, since everyone I talk to tells me they love this place! The atmosphere was comfy and chill, my friend kassie and I were impressed. Our waiter was nice and patient and helped us out, she was so sweet. So atmosphere and customer service wise, this place is a 10. Now for the food.  I got the Spring Rolls with pork, and my friend got spring rolls with shrimp and steak. I also got Pho with meatballs and Thai Tea Boba. the spring Rolls were delicious, I love the BBQ pork, it's my favorite thing ever. It only had one small slice of the pork, I wish it would have had more, though. The spring roll was big, but it just needed a little more pork! Perfect none the less. The Pho was amazing, broth was really good, but I was so sad because I put the wrong chili, there was 3 different types and the chili I put made my pho taste more smokey, but it was so good anyways. I couldn't even finish my bowl honestly, I was so so so full half way. It makes me sad when that happens. The Thai Tea boba wasn't as good, honestly. The boba was sticky and chewy. The Thai tea itself was just like any other Thai Tea haha. But it was still drinkable so I can't even complain. The food came out QUICK and the employee was so nice to us cause we kept asking for things, I kind of felt bad haha. Really good to go out w a friend or two and really just dig in, we were so full. Thank you, pho real! (Get it ahhhhh)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RV1-w6Lc8812s75QFrw8pw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. MY PHO CUSTOMIZED. just incase  yall wanted to see",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RV1-w6Lc8812s75QFrw8pw/o.jpg"
      },
      {
        "img_id": "EOyVXITQ4pqJKiMhTmh6Ug",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. PHOCKING AMAZING",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EOyVXITQ4pqJKiMhTmh6Ug/o.jpg"
      },
      {
        "img_id": "Qr3FQGjtWx0N1SHhsvUxHA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Thai Tea boba :-)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Qr3FQGjtWx0N1SHhsvUxHA/o.jpg"
      }
    ],
    "user_id": "9VqiijnM6ub5it_mJOwHjg"
  },
  "1V0n81FGnDGrwLH22G_nyw": {
    "date": "6/23/2016",
    "text": "The food was ok I ordered Beef and brisket Pho and it easy good but I've had better.inside is nice and the price is good but I felt that my Pho had too much cinnamon. But I mean I'd eat here again just wouldn't be my first choice for Pho",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TkBqxhPK74x1HNKcWzcStA"
  },
  "JZjuJIYJ1NR4vqgeEf0q9Q": {
    "date": "3/24/2015",
    "text": "Good Vietnamese that delivers?! No way!  Yes way.  I will miss living by them, that's how amazing it was.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WG01L6anJONfskLaJis4Vw"
  },
  "xRP545grnRlJTStxG3AQeQ": {
    "date": "8/26/2013",
    "text": "Friendly staff, clean modern room & delicious food Wish you longevity and prosperous business",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3fMmrAmLGr6HzIpDfeEofw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Grilled pork take out lunch special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3fMmrAmLGr6HzIpDfeEofw/o.jpg"
      },
      {
        "img_id": "DMiIpfJc7R-UcBtFuvbyYQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DMiIpfJc7R-UcBtFuvbyYQ/o.jpg"
      }
    ],
    "user_id": "30p6ZGPklYh2u3mcniYHcg"
  },
  "sNMprETObI9QlTWIs-DUYg": {
    "date": "11/14/2016",
    "text": "This place was great! It was quick, clean and the good was SO GOOD! I got the chicken pad Thai and my bf got the pho. It's a small place, but we came in On a Monday night so it wasn't crazy! We will definitely return",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M8QGyx-F_uFQJfpYfD9-2Q"
  },
  "lb8K9lKCkXQosHJu_47ceQ": {
    "date": "11/14/2016",
    "text": "Was looking for something late night one night. Couldn't think of anywhere I could got for some great Pho. Someone mentioned this place to me that I had completely forgotten and every time I wanted to try this place I'd go on the days the restaurant is closed. Finally, I got to try it. Omg! Pho is amazing and so are their shrimp spring rolls. Such friendly people and service. Definitely will be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nSLz1hlkiLz_fflqOR1jdA"
  },
  "-MNj41UKj1KJhOdgMuqcRg": {
    "date": "12/31/2015",
    "text": "Friendly,  open when many are not,  beer and wine,  great food and they encourage you to ask for anything you need with a bell at each table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W8vetpW5RtounAG2aN2WMA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W8vetpW5RtounAG2aN2WMA/o.jpg"
      }
    ],
    "user_id": "IpXGWrBxF9sriBx5LuuhaQ"
  },
  "MXY2CHOdaS7DqAH_lWJhCA": {
    "date": "10/24/2014",
    "text": "The service is 5 stars, water glasses were always full and the food was brought out right away.  The food was meh.  The fried egg rolls were okay, a little too bland for my taste; and the lettuce served with them could have been fresher, they looked so lifeless.  My friend got the pork & shrimp spring rolls, but it was 95% rice noodle, 5% pork & 0% shrimp.  The pho was pretty bland, lacking the beefy/meaty flavor normally found in the soup.  Even with all the hoisin sauce that I put in, it was still so bland.  I would come back here, but only because it's near my friend's place. Hopefully, the rice dishes are better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "JJOBCYHG0o19HI_oz7Y05A"
  },
  "O46B4gqqqDZzVr_yR-ZPGA": {
    "date": "8/11/2017",
    "text": "Poor service take WAAAAAAY too long for just an order of spring rolls. I waiting over 20mins. To go and the restaurant is empty! I'm upset enough that I do not even feel like eating my food. I arrived at 5pm and got my food at 5:30pm. Let me say again it was one order of spring rolls! Omg never again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JticijuLq66jogWKTPZTCA"
  },
  "Cd-3Tc2Oonq5ecQAbf6daA": {
    "date": "10/26/2017",
    "text": "As soon as we arrived we could smell the aroma from the parking lot. Yum yum!! The Pho is to die for. A hidden gem, don't miss out. We're going here again Friday night, delicious!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KOrKOMHSSWh-V_5KBJtZKA"
  },
  "MnlnRJnJ0t3y4G0s5oLvPg": {
    "date": "11/21/2017",
    "text": "This place is by far my favorite little spot. I promise you once a week I am ordering the P7!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rbddBmbSMnhYulo-RvqV7Q"
  },
  "BcU5fo7z504tztmG9eeTjA": {
    "date": "8/20/2016",
    "text": "Absolutely fantastic!!  We have loved absolutely everything we have tried here and recommend EVERYTHING!!   Great place with quick & attentive service - we have made this our \"go to\" Vietnamese place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GLVA6cNY9AWemuhaS2Hrog"
  },
  "NAeBR4LO29_AC9Kxlqv5FQ": {
    "date": "6/23/2016",
    "text": "Great customer service! We arrived less than 30min before they closed and they took us in with open arms, we didn't feel rushed at all. We ordered pho and it arrived quick. Pho was the best that we had in the valley. I will 100% come back and recommend to others.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m1lzaRPxvE--ojmuJH99Zg"
  },
  "0twoq1zxrHWssA2Pq7SRTw": {
    "date": "2/28/2015",
    "text": "I am sorry for ruining everyone 's raving reviews about this place, but it was a total disappointment for me. Everything was salty and awful. It is overpriced for the poor quality of food. It's not an authentic Vietnamese restaurant. The restroom is nasty, dirty and gross for the supposed to be \"upscale\" restaurant. Nothing is upscale about this place. The food is only cater toward Caucasians and non-Asian groups who know NOTHING about fine Asian dining. However, I am VERY Impressed with the outstanding service which you can hardly achieve that in any Asian restaurant. For the wait staff, I would give a 5-star!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jnWT6oggsyk8Zhz9JwYp2w"
  },
  "BbMJ_pLNLEvhIxB2O7Bmlw": {
    "date": "7/19/2014",
    "text": "We still go here every once in a while, but what we have found out is that its still cheaper to drive to Da Vangs than to visit Song Lynn. We can get 2 orders of Pho and Bahn Mi at Da Vangs and pay $15 (including a 20% tip). At Song Lynn that same meal costs almost $30.  Overpriced but very good. The nicely re-worked menu is saving them from dropping to 3 stars in my book. Everyone is still very nice, but even with gas factored in its cheaper to drive to central Phoenix from the west valley.  Sorry guys, we won't be coming back as often as we have in the past. Still a good place, if you don't mind spending a little extra.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "5ANQiGT0d0RWMJG1LCvNWA"
  },
  "lIxJO-gh2vYWMMHdBvtuOQ": {
    "date": "8/16/2019",
    "text": "Great food, friendly staff! I order to go a lot and each time the food is prepped and secured for my transportation back to the wifey. If even one drop of the awesome pho broth leaks out my queen would banish me from all nightly activities. Overall, this establishment is numero uno.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "63zfOlO2di0qHzeOm8tURQ"
  },
  "l5WxM7WDLpuRRt-andAaBA": {
    "date": "7/19/2019",
    "text": "Been here lots and lots of times, ordered takeout lots and lots of times :) so good.  I get the Pho combo for all the extra parts it's very exciting :)  They always give big portions even for children. Sometimes it's too much for my son to finish. I've asked for a smaller amount so he doesn't waste but they are just extremely generous and happy to have you there!   It has a really nice ambiance too, we always like to sit by the fish tank. There is a semi open kitchen which is pretty unusual too and speaks to their comfortability at letting everyone see how their food is prepared.  They have a cute ice cream macaron freezer too !",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "BerI9RsKckitvMWb_qsFYw"
  },
  "GmCELTCcn3bA6HM1VxLPtg": {
    "date": "6/7/2019",
    "text": "I met a friend in the area and she never had pho before, so I did a quick search for a restaurant nearby. Song Lynn was quite the surprise! I only wish I lived closer. The food was really good. I can never get myself to order anything other than the pho dac biet, and theirs was delicious. The place looks tiny, but they have a seating area in the back. The service was very friendly and attentive. Bottom line, really good. I will make sure to stop by if I am ever around here again. Great find!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "z_tqPytGQF_tDw_buHKJcw"
  },
  "57K9TaarCb4QxRsAg_4BSA": {
    "date": "9/10/2019",
    "text": "Any time I hit a new city I look for a pho place. It's my go to and I like to get the same thing and compare so I can gage how good it is.   This time however, I deviated from the plan cause they had the Vietnamese beef stew.   I used to get it all the time at my go to place but I've moved across the country and haven't had it in years. Most pho places I go don't offer it so I had to get it   I started with the required summer rolls. They were good, a little too much green to shrimp but good nonetheless   The beef stew came out and it was as I remembered. Full of tender hunks of meat, carrots and noodles. The meat was tender and yummy. The only difference was my old place made it pretty spicy. This place was mild but the broth was tomato red and tasty. Service was good. Thai iced tea wasn't sweet enough for me, I like it real sweet.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pV3_vCj6_2DJgUaSBLdl1Q",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. P17. Beef Stew with Rice Noodle Soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pV3_vCj6_2DJgUaSBLdl1Q/o.jpg"
      }
    ],
    "user_id": "WYSf63EuLpUbSqco5BsSKQ"
  },
  "USmyLMJdaDc3mWVoGdAwPA": {
    "date": "5/16/2019",
    "text": "This is one of our go to Pho places. It's one of the only pho places I know that makes beef stew pho. Not sure if thats what its called.   Service: is always great! They are very attentive. There is a button you can push at ur table if you need the waiter. We almost never need to push it. =)   Food: The food is very authentic and delicious. It's very clean broth in the pho. We also love the spring rolls and eggrolls.   I gave it a 4 star because price wise its a bit on the pricey side.  Over all, we will always come back bc its a clean restaurant and the food is good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "QtO86whSJn54mfjIBslMnQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QtO86whSJn54mfjIBslMnQ/o.jpg"
      },
      {
        "img_id": "rliy11Bv4GpIi4oyTk_u0A",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rliy11Bv4GpIi4oyTk_u0A/o.jpg"
      },
      {
        "img_id": "6qTfiqXKy_Yi8iii4rNywg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6qTfiqXKy_Yi8iii4rNywg/o.jpg"
      }
    ],
    "user_id": "7HdO7phQV4FrJGIle_zxJA"
  },
  "Th16z4IvGCI2GAkmLFVSRg": {
    "date": "4/17/2019",
    "text": "Simple straight forward Vietnamese fare. Originally wanted to order Bun Bo Hue, but was told it didn't come with the usual traditional fixings. Opted for the Mi Bo Kho instead, wasn't disappointed. Nice chunks of beef and loved how the egg noodles weren't cooked to mush.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rZKPuQ9c_Dx7-zCEqXorlg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Mi Bo Kho",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rZKPuQ9c_Dx7-zCEqXorlg/o.jpg"
      }
    ],
    "user_id": "Z47l-owDdPanv3C8WxNVRQ"
  },
  "kFd3upaZg4REr-z0j7CVzg": {
    "date": "3/25/2019",
    "text": "Great food. Great service. Nice location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kc1SymR2-qxcs8T5rscaJg"
  },
  "lGwcwHYyyQ0NFdTIFS5jtg": {
    "date": "5/28/2019",
    "text": "Ok I tried this place because of the reviews.   I was NOT impressed. I've tried many Pho places through the valley, from dives to upscale.  This place had the prices of upscale, but was dirty and smelled like a dive.   I came in at about 11 am.  Only one other table was filled.       The place had the sour smell of unwashed bodies. It's the only way I can explain it. Definite sour BO smell.  I was not impressed with the person at the front counter, as he asked my name and seemed to think I was there for a take out order. I had to ask him if I should seat myself.  This confused him so he asked if I wanted to place a take out order.  I told him I was dining in.  He said take a seat he would bring a menu.    I seated myself in what looked like the cleanest of a the booths,  I was wrong they were all this filthy.  Considering they had only been open 1 hr, you could tell they just didn't care about cleanliness because the spatters all over the wall were obviously old, and looking around and seeing straw wrappers on the floors, dirt under the table legs where they had cleaned around the legs but not pulled out the table to clean under it recently.   A few crystal like chandeliers do not make up for lack of daily cleaning and wipe downs.  So pretentious those crystal light fixtures are in such a place.   I ordered the p1 without tripe and a soda.          Another couple came in and ordered Pho also, so why did they get their order before mine?       The soup was hot, tasty and plentiful, however I had asked for no trip and I got several clumps of tripe in my Pho) also I kept looking at the splatters on the wall and smelling that sour smell.  The price was a bit more than I'm used to for Pho, the somewhat flat soda really overpriced ($2.50).  While there are things on their menu I would like to come back and try, I just can't get past the uncleanliness in the eating area.  If it's that bad where customers eat... how bad is it in the prep and cooking area.  I mean Pho 43 a True hole in the wall feels cleaner than this place.  And PT noodle is only 1-1/2 miles away and is impeccably clean.     I did appreciate the free wifi, but don't think I'll be going back here any time soon",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fJUHz-sncCt-UxvL8opaXw"
  },
  "GQiX3nBID1BHNDVzxoCqKQ": {
    "date": "7/29/2019",
    "text": "Hands down, best pho place for me in Arizona. I love the staff there and she always give me extra lime when I go there. When we place to go orders she already know what I want on it. The soup and meat all taste fresh. Some pho places you know when the meat have been sitting out or old because you can taste it. If you ever want to eat pho or anything come here and eat. You will love the food and staff!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6PuMHxTcMlbwbuzL6aG_pA"
  },
  "leIjxzPBmjnyrwyMpKOqQw": {
    "date": "7/22/2019",
    "text": "Pad Thai was $13 plus dollars with tax and the chicken tasted re-heated... As well the taste was completely off, it was completely overpowered by turmeric...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eXgu_58P1Yey37n58epqzw"
  },
  "y9kLrVvKfq3soWRJYieCOw": {
    "date": "4/2/2019",
    "text": "Sooooooo.....I have mixed feelings. The first time I was here the pho beef broth was not screaming hot, was cloudy, but very tasty. Now I'm trying a pho with chicken broth and the broth is piping hot, clear and just as tasty. Each time I found the bowl size lacking but the amount of protein satiated me sufficiently each time soooooo maybe I am just being a little piggy??? Hahahahaha :D :D  Both times I noticed a good amount of the local Asian community frequenting this spot. For the area this is as authentic pho as you're going to get. I will be back for another visit soon.  Oh! And the 1 Merlot offered comes in at 13.5% which I was very happy about since my stomach was blech. And I see they have boba too so maybe I'll try that next time. If you are way out on the West Side try this place out!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 10,
      "cool": 8
    },
    "photos": [],
    "user_id": "VM-pBrNPfZm-5YWcMCVbqw"
  },
  "b1AAzXZL48Cfi7ZLJpQwIg": {
    "date": "7/4/2019",
    "text": "Ordered 2 bowls of the Pho Dac Biet - not a fan. Quality of the pho rice noodles you can tell it's made with dried noodles and the not fresh ones. The tripe had a weird freezer burned texture. The flavor is lacking, not that flavorful. The price is definitely on the expensive side. Other pho places have MUCH better quality pho and is MUCH cheaper. I wanted to like this place but just truly not a fan. This place is just okay - could be better but JUST okay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K5OH2T9Qmcde9fVtE7HAIA"
  },
  "ghtp5lVj3KyrY9w7ub4G8g": {
    "date": "7/3/2019",
    "text": "This place is incredible,  Very clean establishment when I walked in, i was greeted right by the door and seated which was awesome me and my husband were starving!  We ordered 2 large bowls of chicken pho and a 4 piece egg rolls,  Everything was so delightful, the service are incredible our waiter made sure that we had everything we needed and of more,  I found my new favorite pho place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kh0umlHyVxN9-YeXsGT-rA"
  },
  "Q3xUT0RKNXyvcoCn1G4F5g": {
    "date": "8/13/2019",
    "text": "I go here 4 times a week for the pho soup! Don't judge me, the food is great. My only recommendation is to make the inside of the establishment more presentable!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sfMA6HcxXobxboxk_TJ6fg"
  },
  "Dg7ELjUNqOrx31K4aaRhbw": {
    "date": "2/5/2019",
    "text": "Every Friday is Phoday. Love this place and their Pho. Service is always friendly and quick. They can do customizations on soups and portions are usually generous.   Try clear noodles once for a change.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3qAudxedWMgIboNlKlr58w"
  },
  "j-vH2oLriywq9YCIe5OgZg": {
    "date": "6/30/2019",
    "text": "Very good!  The Pho beef broth was on point. The wait staff was extremely attentive and friendly. Lots of Vietnamese folks eating there, which is always a great sign. I even learned something new about ordering beef fat and green onions to pour into the broth. It added texture and enhanced the flavor. We also ordered Eggplant with Tofu, which was flavorful yet subtle, cooked perfectly. Will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4jdUCXWGDawnLOGAq7yBMA"
  },
  "Lf_AdNdXrWE_-J0XYJM5fQ": {
    "date": "6/23/2019",
    "text": "One of my favorite places to eat Pho. The owner is always very nice and welcoming. They appear to be a family business and provide exceptional customer service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aIdtOiLjNMFTexCCH7V2vg"
  },
  "OtI48AXgz--fDtoJm4fnFA": {
    "date": "4/11/2019",
    "text": "This was our first time trying Song Lynn and was very please. Staff was very nice, restaurant was small but clean and simple, and the food was delicious. I had a beef brisket pho and my bf had a shrimp pho, we also order a combo fried rice. All of it was so good! Def plan to go back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qUdC_MjejrudqnxW_MZL9w",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Beef brisket pho, shrimp pho",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qUdC_MjejrudqnxW_MZL9w/o.jpg"
      }
    ],
    "user_id": "X2zjEdgN1cEC_Tl_BuvTXA"
  },
  "LUsOA_ItQwsbcI7kiEBsug": {
    "date": "12/17/2017",
    "text": "It's been so cold in the morning lately, I've been craving a warm pho noodle soup.   Came here for late lunch after shopping, staff was very nice and friendly.  I ordered my usual pho special, added $2 for extra as I was hungry. I thought I was hungry but their large potion was huge, I was still full several hours later at dinner time. They add generous portion of meat, each piece is very good and tasty, perfect food after workout, not shopping.  I also tasted pork chop and their flavor was so good. I can't decide which one was better. I actually liked both equally. I didn't eat but fried rice looked very good too. I guess I need to come back here to try some more on the menu next time I am in the area.",
    "rating": 5,
    "rated": {
      "funny": 17,
      "useful": 31,
      "cool": 29
    },
    "photos": [
      {
        "img_id": "9tTJBf1JroLrgwfb5yeOBg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Pho dac biet",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9tTJBf1JroLrgwfb5yeOBg/o.jpg"
      },
      {
        "img_id": "Z1B-A8QozHrINxEiou_6Bw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Pork C3 Pork Chop Rice Dish",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z1B-A8QozHrINxEiou_6Bw/o.jpg"
      }
    ],
    "user_id": "Gfxb_D1k8tueAoGn4cseoA"
  },
  "kbGQe_vzoY7rLt5d6AmQmA": {
    "date": "12/7/2017",
    "text": "The Beef Stew has lots of flavor! If you want hot soup In the winter in AZ and want something besides pho. Try the beef stew.  It comes with white rice noodles, carrots, big chunks of beef, and some tendon!   Add a half spoon of chili oil to add some spice!   The table even has a call button if you need something from the waitress, that's the first time I saw that.  FYI, the regular size bowls are smaller than the average size pho bowl. We ordered a large bowl that cost $2 more and when they brought out the bowl, it was the size of a \"average size\" bowl we get from our go to places.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "CcUHh2ftjPGa0-0rCk30yA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Beef stew",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CcUHh2ftjPGa0-0rCk30yA/o.jpg"
      }
    ],
    "user_id": "EIj7osC_bYTkv4eyHHuvNQ"
  },
  "cAS3pJNE0_yrAOgs_h_pww": {
    "date": "4/17/2016",
    "text": "I eat here all the time!!! Friendly fast service, never lets me down!!! I'm a big Vietnamese food junky and have tried many different places in the valley, song Lynn always has fresh vegetables and high quality meats that are tender seasoned and grilled perfectly!! Big thumbs up",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4lYdAEL4LXFb6hp5iHjuPA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Vermicelli is amazing! Lots of meats tons of flavors fresh veggies and a very good size serving!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4lYdAEL4LXFb6hp5iHjuPA/o.jpg"
      },
      {
        "img_id": "h4bZQG0Nr-LtAQD82BN5Sg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Pho Tons of meat too!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h4bZQG0Nr-LtAQD82BN5Sg/o.jpg"
      }
    ],
    "user_id": "ttJRMeR1p2kASqq2X753ew"
  },
  "ao-E7o3I2x8HH0rCxyxKFw": {
    "date": "9/15/2015",
    "text": "Pretty decent place with excellent hours! The food is good at Song Lynn and they are the only place I know of with Bun Cha Ha Noi. Song Lynn is a spotless place which I got to admit isn't very common in Vietnamese place. Staff is super friendly and I love it. Will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "mN_sWRaeWamsu8iHblQsNg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Bun cha ha noi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mN_sWRaeWamsu8iHblQsNg/o.jpg"
      }
    ],
    "user_id": "LYP41bD7PnTWmdVQCll5PA"
  },
  "z9cTAAP0d87itDdUYtmKiw": {
    "date": "8/10/2015",
    "text": "After seeing an ROTD for this place and reading the reviews, I thought this was worth a visit even though it was quite a bit of a drive. It's one of only a few businesses in operation in a large commercial square, but the square itself as well as this restaurant are clean and well-maintained. Inside, the atmosphere was cozy and the  very friendly server had me seated at once. I started with two very good grilled beef spring rolls, followed by pho with tripe, tendon, and meatballs. The flavor of the pho broth here is the cleanest and freshest I've had of all the Vietnamese restaurants I've tried in the Valley; there was no overpowering cinnamon flavor to hide the more delicate flavors such as lemongrass. The tendon was tender and the tripe was sliced into very thin strips, the way I like tripe in pho. I finished the meal with an avocado shake which was thick without being heavy and with just the right level of sweetness. Free WiFi was available, too. Though the prices are just a tad higher than in most Vietnamese restaurants, that is justified by the quality of the food, the service, and the atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 12,
      "useful": 19,
      "cool": 21
    },
    "photos": [
      {
        "img_id": "Cc-sPzCRjLDGDltQ8TnxbQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Song Lynn, on the southeast corner of 91st avenue and Thomas.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Cc-sPzCRjLDGDltQ8TnxbQ/o.jpg"
      },
      {
        "img_id": "ne0oggSUL0Vu52WURfZhsA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Pho with tripe, tendon, and meatballs; grilled beef rolls; avocado shake.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ne0oggSUL0Vu52WURfZhsA/o.jpg"
      },
      {
        "img_id": "RILMV3B1evqoNG3PcW6pSA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Inside the restaurant.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RILMV3B1evqoNG3PcW6pSA/o.jpg"
      }
    ],
    "user_id": "24AzZDQKHySwMQR7VQVCAg"
  },
  "7JAmu0oLYpa3qlCruFiQGg": {
    "date": "7/18/2017",
    "text": "I can't begin to express how wonderful this place is. From the sweet serenading music to the consistently delicious entrees, especially the Pho,  and of course the most important part, the service! The service has not once let me down. Kudos to the hiring manager for the courteous servers and double kudos to them for making the experience pleasant each time. This isn't just the best Pho restaurants around but truly just one of the best restaurants period! Awesome job!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yv3LmiSZ26vK6Ua-Hzex9Q"
  },
  "cNP23gOVd1LZDZftE-c3og": {
    "date": "2/19/2016",
    "text": "Love love love this place!  Not only is the food great, but the staff is just as great. They're fast, they're polite, personable - top notch service at this place.  Definitely try their chicken pho!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s2Prwz9kWiejnd4j7lpK7A"
  },
  "1nDqlj5DbTKuMI080ylryw": {
    "date": "12/17/2017",
    "text": "This place is outstanding.   Service is friendly and good.  Food is great.   There is a bit of a lunch rush and you have to go through their entire menu for the lunch specials but it is so worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LQWLI0zlH9nBKQY92M_9_g"
  },
  "0LDa2DcLFHtoJAzNcLp9SA": {
    "date": "6/11/2017",
    "text": "We lived in the East valley for 15+ years and went to the usual places over in that area. We have been in the West valley for 3mos and this is by far the best place in the Phoenix metro area.   Awesome! We will be back for sure! Thank goodness for random food stops!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GdpZQUS2mSWvLKZhyedKxw"
  },
  "0doCEWBOhRJblUWzuqaxRQ": {
    "date": "1/22/2018",
    "text": "I honestly was expecting the portions to be decent with a regular size pho bowl that costs 7.95. They could be a little bit more generous with the portions and the broth was too sweet. I'll stick with Pho 43rd Express from here on out. They could do better than this.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJaldQcDm-hLhsanavweQA"
  },
  "bshjkH9SB2PTJihHViKMfA": {
    "date": "9/27/2015",
    "text": "I loved eating here! I've been to a few Vietnamese restaurants, and this one is one of my top ones. The atmosphere is great, and the service is as well. I got the Pho with rare beef and brisket. It was very delicious. Their Thai iced tea is also incredible. I've been to several places with Thai tea, and this one is probably my favorite. Overall, it is a great Vietnamese restaurant, and I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WAQpLtJrwHengVzyifSVOQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Rare Beef and Brisket Pho",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WAQpLtJrwHengVzyifSVOQ/o.jpg"
      }
    ],
    "user_id": "u3QxrLwAFum2fVte8tm7Kw"
  },
  "WbgMeFE6NHbMCoDpCxf5Tg": {
    "date": "7/11/2015",
    "text": "Though on the inside it  is looks like a small restaurant,  Song Lynn's food packs a big punch with a good Vietnamese  style of food with natural bold flavors and deliciousness with every bite! The restaurant was  clean and new. The service was attentive and nice.  The food was bought out quick for a table of eight and everyone was happy with what they ordered, truly making  it a new found gem for Vietnamese food to come to and visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "B3JIP3egrdVAH_nt_UG8aQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Hanoi style vermicelli noodle and combination meat baguette ... Both very good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B3JIP3egrdVAH_nt_UG8aQ/o.jpg"
      },
      {
        "img_id": "Jr9yXRmckwyFCHejKqfXlg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Vermicelli with pork",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Jr9yXRmckwyFCHejKqfXlg/o.jpg"
      }
    ],
    "user_id": "7cKky5hh2rKY69mRDwRlgA"
  },
  "aLiscivs0iocPJgbXZ-yKw": {
    "date": "9/2/2016",
    "text": "There is a good broth to backup the delicious pho, fresh ingredients, quality herbs, cute, clean space and quiet attentive service.  Hard to beat the happy hour selections and prices.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "G9Kz73YlhDFOVpFdenT_3Q"
  },
  "DcCB6R0WNv4PxTVbVLV3pQ": {
    "date": "9/3/2015",
    "text": "My buddy and I stopped by here mostly because I love pho but in reality we were wasting time till the concert started. I ordered my usual pho and it was wonderful. I have nothing to complain about. Their menu is large so there are many options. Overall, the service and food was good. I recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KcjLcdus-XWt6E9uJeHONA"
  },
  "4WsgveBXkq6lV9AmH8I9Dg": {
    "date": "12/10/2016",
    "text": "This place is really not the best. My gf ordered a combination fired rice, it was as tasteless as it gets. The really bad part was the meat was still cold (both chicken and shrimp). Needless to say, that was a disappointment. I'm seriously questioning those whose comments stated this is the best pho if they had actual pho before, because the pho here really wasn't that good. The broth wasn't hot enough to cook the meat on time, and the taste wasn't great. I honestly was not happy with the food provided and do not believe the price of the food was reasonable for its quality.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G0DvZEe7_rxNm2EAlsDhZA"
  },
  "_-QJiXvdDt_nmI3EWUeqmg": {
    "date": "8/21/2016",
    "text": "This is the go to place in the West Valley! I enjoy the food and the friendly service. My friend and I come to eat here about twice a week. A must try!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HZ_FLbM1wM20xHr5sQvcdQ"
  },
  "RR1lDqdGleu7JmcKJik-Qg": {
    "date": "3/3/2017",
    "text": "I called in a to-go order which was ready when I arrived 15 minutes later. The lady who took my order was friendly and answered my questions about the different pho sizes available. The overall look of the restaurant inside is updated, attractive, and clean. The lady who took my payment inside was friendly but abandoned her post as soon as she handed me the receipt to sign, which I had to leave the signed copy next to the unattended cash register. The pho was delicious and full of all the flavors you want in a good pho. It was one of the best I've tried! I wish they offered chow mein on their menu. But since they don't, I ordered their chicken fried rice. It was just okay... it was a bit dry and lacking in flavor. But I will be back for their pho!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EXAApVZMUKF_TfyS5JBxZw"
  },
  "tyWHiAEBPUxqxGHkxAYBzA": {
    "date": "9/18/2015",
    "text": "This is one of my favorite Vietnamese restaurant. Always really friendly staff. The food is always good. And I think the price is is good as well. Given McDonald's for 2 combo comes to 14-17 bucks. For that price. You can go to nice sit down here and eat something good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8KIyQCKwD2Ntw43is1xtfw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Mongolian Beef very yummy.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8KIyQCKwD2Ntw43is1xtfw/o.jpg"
      }
    ],
    "user_id": "Eo7w1gEn0tZu3Mgt3i9mhg"
  },
  "x7aDnJSXhi0gtFZ9ydUaYw": {
    "date": "11/11/2017",
    "text": "Service was good, but the food was lacking flavor. We had Pho and there was barely any flavor in the broth. Their tea with boba was really good, and the best thing I tried there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OHxmeJOMtWkK3j7zsVhYYw"
  },
  "bLjL-JBXwL8OaevIrbsDIQ": {
    "date": "5/12/2015",
    "text": "Meh.....I've had way better. I ordered the Pho Tai and eggrolls. The bowl of Pho was very small compared to other restaurants with a very small amount of rice noodles and meat! $7.25 for what should have been called a kids bowl. I never been to a Pho restaurant that was stingy with their rice noodles (which has to be one of the cheapest ingredients). I ate all my noodles within minutes and was still very hungry. The broth wasn't that great either. You can immediately tell just by looking if the broth is a good one and this one was a murky color with no richness to it. The spring rolls were really good, but they came with a few iceberg lettuce pieces, which were too small to use for wrapping  around my rolls. I won't return that's for sure.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QrwgaD9f7lACu8pS2dIKjA",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Very small bowl with little noodles and meat for $7.25",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QrwgaD9f7lACu8pS2dIKjA/o.jpg"
      }
    ],
    "user_id": "YLyFQ9VVBoqqPIiUeDvVZw"
  },
  "RSbus-xvOIxTIfMZ5ZAw7Q": {
    "date": "7/24/2016",
    "text": "My go to pho spot! I always get a P19 (pho with dumplings) and it's always fresh, delicious and fast.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iy-fw1skYdt5chwXHUifRA"
  },
  "d5WoJ9enTQZ5xRQo80orpQ": {
    "date": "2/21/2017",
    "text": "Love this place.  Clean, free wifi, reasonable, and THE BEST PHO pho MILES.  Legitimate pho broth, and the classic vermicelli fried rolls as well as the fresh rice rolls are exactly what you'd expect.  Awesome Vietnamese coffee (drip, and mixed with condensed milk).  I come from the hospital across the street almost every night I'm on call; the only time I can't (and the only complaint I have) is on Wednesdays, which are closed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MJ8xqrYF0bLSYynYVuWVqQ"
  },
  "nMBOBEWyw58ZefeXIqLZlg": {
    "date": "8/15/2013",
    "text": "This is a new Pho place and the only Pho's restaurant near Tolleson, its good compare to the place on 43th Ave.  The price is reasonable, they are high tech I visited their website and noticed that they take online, what I unmeaning by high tech is that every order is done through an ipad. I normally Pho large bowl (its not large like Da Vang) but its okay, they offer fish sauce but you have to ask for it I also noticed that they don't really have that much topping, you have to understand that I'm Laos. Meaning our topping normally include fried garlic, green onion, chili oil sauce..etc...But over all this place is good and would recommend for Pho lover in the neighborhood. I'm actually going there right now..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "J2aahXsbgU1ys5i_5VkVtg"
  },
  "OO7yaRR6_8xNjPnfyDhktg": {
    "date": "8/11/2013",
    "text": "Superb local Vietnamese restaurant. Recommend the Rice Vermicelli with Grilled Pork, Shrimp, Egg Rolls, Pork Sausage. Filled with fresh veggies, savory seafood and meat. The Pho combination beef soup was also well done. Friendly staff and fast service. A nice surprise was that their flatscreen had more than the local fare and had the game on cable I was just watching at home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cPNAQuE03MsdGBAOTQSGOQ"
  },
  "5fnnhRbckeZZ2JCilVdeIQ": {
    "date": "10/3/2013",
    "text": "Great Pho, friendly people, and reasonably priced.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JkXQmrFy9RoViTSY-KBtvg"
  },
  "c7sb0eP2boRRhU8qoFAmbA": {
    "date": "11/8/2013",
    "text": "Yum! There aren't many options for non-fast food lunch around here, so I was very glad to discover Song Lynn today! Really yummy Pho, reasonably priced and very fast service.  I ordered take out and my order was ready and waiting when I arrived.  They also automatically included a small container of plum sauce, and sriracha with my to-go order which I appreciated! Natch they also sent along basil, bean sprouts, cilantro, jalapenos and limes, plus the raw beef to add to the soup.  (It cooks up deliciously!) I will definitely return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_eaz4RB0KtzuvRt1oE4BQ"
  },
  "I_WadMZqkq-2AwQgq-xr2A": {
    "date": "4/14/2018",
    "text": "The family is in love with this place. Have been here a few times and the service is great. This type of food is not my cup of tea however everyone is happy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h1cDUv1das57MHowaKj96Q"
  },
  "x7ro5CBdJ-zP5ADBPkLrZA": {
    "date": "7/2/2018",
    "text": "I came in around in the afternoon Sunday.  Brought my two kids...6 and 8.  We ordered 3 appetizers and two noodle soups. We waited awhile to finally have service....waiter didn't greet us or pay any attention until I glared and waived him over to finally take our order and bring water.  My son was extremely thirsty.  And drank all his water quickly.   Waiter never came by to refill, clear our appetizer dishes, or ask how we were doing until we were done our meal.  The appetizers were good spring rolls and egg rolls.  However the pho soup was a little bland..didn't have the deep bone flavor I'm used to and meat was tough and chewy.  Oh well...probably won't be coming back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3YmAFSh9KM4ID1b7lJ4aqw"
  },
  "TJHphQX2BfRmZyWuU3EZag": {
    "date": "10/19/2017",
    "text": "(This review is from 2014) The beef pho is pretty good. It's the best-looking Vietnamese restaurant I've been too. The pork spring rolls have gotten worse I think lately. Maybe I just got a not so good batch. I've had other dishes. All good (especially the noodles) except for this one egg noodle dish I had it to-go. Maybe cause it was to-go that it was not good since I didn't have a plate/bowl to put it in. When you order to-go there they give you the dish components separate for you to put together on a plate/bowl yourself at home. I ate at a park. This place has good noodle dishes.  For better pho and spring rolls go to Central King Egg Roll (AKA Pho King Eggroll) in Goodyear.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2qhJQJPtXhfCFbp35JaaQ"
  },
  "mFz8JrCoH_OrQyhDqsfK8w": {
    "date": "3/3/2018",
    "text": "Song lynn is bomb-diggity. The lady and I like the yellow curry chicken and the filet mignon with bell peppers, onions, tomatoes stir fry dish. Oh yeah their crispy spring rolls are second to none.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4eCI13o-J9PiVhqLB0KCuw"
  },
  "L-5uePjqz0KflQ1yKyMF5Q": {
    "date": "4/1/2014",
    "text": "As soon as you walk into most Pho spots you are one pointed to a table by someone who looks harried & almost too busy to pay attention to greet you. But it's Pho & if it's good you will not only overlook that you will graciously sit on what can only be a chair leftover from the 70's banquet scene & be perfectly happy doing it.  That is not case at this place. It is newer, clean & the staff lovely. Loved the Beef Pho & spring rolls with BBQ meat! So yummy & on my side of town. I've been driving far & wide to what was the best Pho place in my opinion in town. However cleanliness, good Pho & on my side of town...  I will probably never darken their door way again.This is my new Pho spot. Just typing this I'm thinking a Pho lunch is in order. So go & Pho!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "TVkU2gHhe05v_lgsE_NccA"
  },
  "d_6nILm11KJjyJI4A8Oyxg": {
    "date": "1/3/2016",
    "text": "By far our favorite spot for Pho and it's just down the street!  It's not much different than Central King Eggroll as far as the food goes...there's a few slight differences in their eggrolls and their meat is slightly thicker than Central King's. Get yourself a P7 (rare beef).  I had some issues with gallstones this last summer before having my gallbladder removed, so I was munching on their P14 (chicken) for awhile and it was just as tasty.  You basically can't go wrong with anything on their menu.    But I can tell you...the actual restaurant and the service is loads better!  We usually have the same waitress and she is someone that always deserves that 20% tip!  Try out their homemade lemonade...they had squeeze it and add a bit of soda water to it so there's a slight fizz to it.  Yum yum!    Each table also has a little button you can press when they are super slammed, but we have seriously never ever had a problem with service here unlike at Central King.  Don't forget either...there is a back room here so if it looks too crowded in the front, don't walk out!    I can literally eat Pho here once a week and still be totally fine!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wxuoPfNbYiN1yhNhDsqbjQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wxuoPfNbYiN1yhNhDsqbjQ/o.jpg"
      }
    ],
    "user_id": "_CDP0zqXE3iqMYGitD_NjA"
  },
  "ZSszfpS-5VwZpe23PC7dRw": {
    "date": "2/28/2017",
    "text": "One of the freshest Vietnamese restaurants. Everything is made to order just how. You want. My office orders take out weekly, we have never had a problem or a incorrect order.  I love the friendly staff. Try the pho, all kinds are delightful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J6kIeDHskClXNHCoeQhRDw"
  },
  "pG7yElffhUkxy8_6v_Fndg": {
    "date": "1/5/2018",
    "text": "Well me coming from La where Pho are like tacos everywhere the tendon in my soup needed to be cooked longer and soup temperature should of been hotter the spring rolls should of came with more lettuce not just 1 piece I know how to eat Pho and how it should be served. So this is why I will give the ratings I gave. I will give another try when I'm back in town.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lyz48cxnHI6F_3CnE4K2dA"
  },
  "39OGE0eFAzLH2E8ucqd3-w": {
    "date": "12/23/2016",
    "text": "i stll love this place!!  the food is fast affordable and so delicious.    Pro- the menu has a great selection for every picky eater.  clean and friendly service everytime.  Pho has lots of flavor and options can accommodate chicken lovers, beef lovers and vegie lovers.  i highly suggest the spring rolls.   Con- if you like it spicey you will need to use 2x the amount at the table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Mdiel0muHKA9wr9RfF0kFg",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Mdiel0muHKA9wr9RfF0kFg/o.jpg"
      },
      {
        "img_id": "X--Ovwtok-9pJN_HnL5_gQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X--Ovwtok-9pJN_HnL5_gQ/o.jpg"
      },
      {
        "img_id": "6C9P9QvTiQKWsvpiTtQhFw",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6C9P9QvTiQKWsvpiTtQhFw/o.jpg"
      }
    ],
    "user_id": "aBwuFN_u8mfzSDQ6oDHwpA"
  },
  "Sp9tkJ1bP2HbQwAbtrnsHw": {
    "date": "12/5/2017",
    "text": "This place is awesome.  Ordered on doordash for dinner one evening and then went back a few days later for lunch.  Fast service, good food and pretty reasonable.  Will become a lunch staple for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GvNp_muVxGBgIUlB8GPTJA"
  },
  "hCsCG8vZP_by_Kl_cIDGsg": {
    "date": "11/15/2015",
    "text": "Place is nice and clean!!  Service fast and friendly. I'd been here twice and I'm just happy this place is so close to me.  I like that u have the option of getting regular size or large bowl of pho.  Since everywhere I'd been before only serves the huge kind of bowls that I end up finishing and feeling miserable for over eating. (Yeah that is my bad not the restaurant's)  The reason they don't get 5 stars is cause even when Pho broth is good and light it was still missing something in the flavor.  I have no idea what, but definitely misses something.  Definitely not the best I had but not bad at all!! Spring rolls are big and good. My daughter love the fried rolls.  I will definitely recommend this place and will be a regular customer for sure!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "n_SNkUrzWMjMxEKvKlOV_w",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n_SNkUrzWMjMxEKvKlOV_w/o.jpg"
      }
    ],
    "user_id": "dVW5PaOj20SzBfbPCi5m_Q"
  },
  "b1mUfRCBFITX83pK_4x8vA": {
    "date": "2/24/2017",
    "text": "This place was easy to get to, no fuss, just like most standard Vietnamese restaurants. The staff was friendly, and we were immediately seated for dinner. The pan fried flat rice noodle with chicken (S3) was fantastic. The flavor was great and the pan fried noodles just added more to that taste. The Pho with rare beef, brisket, and flank (P12) was total comfort food. The regular size was enough for me. Good place to go for affordable, satisfying food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oVCdGLc82TYV0MZuk6RRaw"
  },
  "WfJVUAlQsmeKTotG6H0rng": {
    "date": "3/23/2017",
    "text": "Love Song Lynn. Pho is so good and the service is top notch. The restaurant is also very clean and modern. Everyone is friendly but GG is their main waitress, she remember us, and knows exactly what we order; she is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tDl15gunWvbPCG2iFzLDiA"
  },
  "Taty3cRQvIgykZkt_KNICA": {
    "date": "5/5/2018",
    "text": "All of their food is amazing!! You know its authentic when the menu is in a different language and you have to decide on your meal based off of the pictures. Quick service and really nice staff. I eat here about once a week thats how amazing they are.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "svhTOxRE1BNOFVISPhrJFQ"
  },
  "D0XEmMPNuJpNxrop140QGQ": {
    "date": "10/9/2016",
    "text": "Third time here and still the best place for Pho in PHX.  The P1 (large) is always delicious with generous amount of meats. The rice noodles and broth always taste great.  The service is fast and pleasant.  Our server checked on us numerous times and filled our drinks in a good rhythm.  She was just very friendly and helpful, making some good recommendations.    We come from San Diego where there's quite a few awesome Vietnamese restaurants and we're always on the hunt since moving to PHX.  We had our favorite place in San Diego named Pho Cao Doa and now I think we've found our new favorite...Song Lynn's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "vP9WIejTgCJdJsO1RUxoaQ"
  },
  "icDuNdaX-3Gql7ihVgdFKA": {
    "date": "1/24/2018",
    "text": "This place is super yummy, nice and clean and good service. I've been here a few times and I've always had good food and a good experience in general. It is weird because they close in the middle of the week but just check their hours before you go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wBWaKVUkxrPOIAN_Istokw"
  },
  "TvoZ7VzIWniqdH9m20bVNA": {
    "date": "4/30/2018",
    "text": "Okay, I have tried almost all of the pho places in Phoenix, but Song Lynn has got to me my most favorite place to as of right now! Their pork sandwich was delicious. The marinade and overall components of the sandwich satisfied me so much, I wanted another. The only take away is that they are pricier than other Vietnamese restaurants I've been to, but Song Lynn is worth it! If you're feeling Vietnamese today/tonight and you live in the Southwestern part of Phoenix/Avondale/Tolleson area, definitely try out Song Lynn!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "B-Pkiz6aUvIA1k2E66CWkQ"
  },
  "tLauKf5KxEqt0Nhsaozlbg": {
    "date": "12/7/2017",
    "text": "We have had very good pho having lived in the Bay Area with so much computing to make good pho.  The broth is what makes it breaks pho.  We have eaten pho at several places in the phoenix area - phoenix proper and in the east valley.  The broth here is the best we have tasted in phoenix. We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p3JoLuLcmONxg28laQpnhQ"
  },
  "PRKyKvCoeqdxt2LEghcFrA": {
    "date": "9/7/2015",
    "text": "100% the best I have had.   I called ahead to place an order for my lunch break, that way I can dine in without waiting for it to be ready first.   As soon as I walked in I was greeted by name, and seated with my drink already there, within seconds my Veggie Pho and Veggie Spring Rolls (both vegan safe) were placed in front of me and I started immediately.   The portion size of everything was perfect and filling, the Pho was not greasy and the spring rolls were huge. Everything was worth the price I paid.  This place was also so clean you could eat off the floor, and I really appreciated that.  The service was 10/10 my waitress didn't bother me but also attended to me in the perfect manner, they have a CALL button at your booth.. They know customer service here!  The only one Con would be that for \"Dine In\" it was just a little too quiet, maybe play some music or the TV louder or something, but that's a very minimal almost nit picky complaint.  This was my first time coming here and nothing makes me happier than a positive first time dining experience, I absolutely WILL be returning to this place and bringing friends. I work in Sales and I have ALREADY referred customers. Try this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "seVBAB9xn49ihOtVtZ0xmQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Veggie Pho and Veggie Spring rolls (vegan safe) best $13 I ever spent!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/seVBAB9xn49ihOtVtZ0xmQ/o.jpg"
      }
    ],
    "user_id": "PIHzBOSpSU1zFuSHBxSQQg"
  },
  "jGdD7Zd_srK8v1TXeN0wCg": {
    "date": "12/9/2017",
    "text": "Really good dumpling pho. The basil was limp and the bean sprouts were kinda brown in spots. Not as huge of a serving as you normally get for the same price at other restaurants. Theres an upcharge $2 for large (which is standard at other places). Fried eggrolls were ok. The seating here is kind of awkward if you dont like practically sharing a table with strangers. (Some tables you are literally table to table with other diners) not the best or worst experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gpjyQ8giL5ulQi62r7BtyA"
  },
  "V8o3Z8ADxxqirnN_3Eqh7A": {
    "date": "10/9/2016",
    "text": "I tried this Vietnamese place near where I live. The spring rolls were just ok. I've had better. They were plain and bland. Could use more veggies. Now the pho broth is delicious! I even think it's better than the usual place I go to for pho. Good to know cause this place is closer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HMMndwfXYTvr6u28uuhOgQ",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Shrimp and pork spring rolls and Song Lynn combination phö.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HMMndwfXYTvr6u28uuhOgQ/o.jpg"
      }
    ],
    "user_id": "LbMJEGRN8679j7ue5Y9RIQ"
  },
  "6ULOafdESDHZgn2xOICQbw": {
    "date": "6/21/2018",
    "text": "I'm not from Arizona & I'm Asian. I've had better broth elsewhere. I have yet to find one with a good deep DARK broth. Here, the soup is pretty clear/watered down. Their Thai tea and boba is good. It was hard to flag down our server for soy sauce. We asked for it and she forgot about it. 5 minutes later she remembered and brought it. I might be returning but I wouldn't give this pho restaurant 4 stars or more bc I don't think it deserves it. You will agree if you like your pho broth dark and more flavorful. This place isn't bad. It's just OK. I will be returning but I'm going to try something other than your pho.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "himsvVbU3MTfRmJ2v_Cfzw"
  },
  "mRm3y768Lo9FVzmUF-DUmg": {
    "date": "12/9/2017",
    "text": "Best pho I've had in the valley! Vegetarian spring rolls are legit too!! Not to mention the service is awesome!  we love our Song Lynn!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UkOIqY4MiuZI1fLBMBCWbg"
  },
  "flm5uNuqar0SrjrrVfRZlQ": {
    "date": "9/8/2017",
    "text": "I have eaten here several times, has courteous prompt service. The pho is very good. The both is very tasty. Inside of restaurant is very clean. Love the spring rolls. Pricing is very reasonable. Very good place to eat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PXe-x5SAMzAEn8EOBCVgeA"
  },
  "2AhcekaXnyXvTxNh8I7R5w": {
    "date": "11/1/2018",
    "text": "Our first time here thought we would try based on other yelp reviews and glad we chose this location . Tried the egg roll very good. So good that my husband got a 2nd order for himself. Also ordered shrimp Tempura very good also. Pho chicken broth was very good and tasty. I ordered the chicken Mongolian with side of steamed veggies also very good. I will be trying chicken stir fry next time per our servers recommendation. Our server was very pleasant and helpful. Our food was hot and fresh and everything was reasonably priced. We will be returning again soon .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KrUOBn1u09u4srinBw_42Q"
  },
  "VoP823laLrCIv6zPkubrYA": {
    "date": "4/7/2018",
    "text": "I had pho with chicken dumplings and they were exquisite and I like how clean the restaurant was. Service was also immediate and server was very kind and listened to us carefully. I will come again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V_7hQ-RaJQrQVcKLLcEeoA"
  },
  "dkn9XVeuvIwbZeoO1Q6Blg": {
    "date": "5/27/2018",
    "text": "Delicious and healthy eating! Friendly staff. I like that each table has a buzzer, so you don't have to wait around if you need something. They also offer great takeout.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-zQ88UG7vKqjSBNifW7NA"
  },
  "Ly9r8rSdFvs3DQIXbyPnEg": {
    "date": "4/27/2017",
    "text": "OMG! Please eat here! New to the area looking for Vietnamese food and tried SL because of all the great reviews. We go a few times a month now!  -Food is delicious and HOT upon arrival to your table which I love. -Large portions for great pricing. I always end up really full or asking for to-go boxes.  -Very courteous and professional wait staff. (Don't think they ever get the order wrong because they repeat it back to you to be sure. If you're new to Vietnamese food they'll walk you through or explain what items are but the menu is very detailed as well so you know exactly what you're ordering). -Clean restaurant (and I'm weird about things like that. To me, if the place is not clean the food isn't either) but SL is on point. -Kid friendly. I have a 7, 2 and 1 yr old and they love SL",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "uus6cZpaTiAjAEiHdmTiRg"
  },
  "lSZB10d3S3EVIQsl6igJdg": {
    "date": "11/24/2018",
    "text": "I've been here twice and look forward to my next visit! The food is delicious! Both times I went they were very busy (usually a good sign) however it put the waiters/waitresses in a tight spot as they were literally running their butts off! The reason for the 4 stars is solely because we had to wait a long period of time before we received our beverages and once we received our food the waiter never came back to check on us or offer us a refill on our drinks (which we needed) and we weren't given our bill nor were we given to-go boxes we had to go up and ask for both. Again, the food was wonderful!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gTeynO5XqHV8btPXzDElqg"
  },
  "dinJAm76wKwFVDmS1sqrdg": {
    "date": "9/3/2018",
    "text": "love this place  Pho & Spring Rolls are the best...Quaint & clean....service friendly & fast....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uo0KmGHJNHqqmN9lphrY6w"
  },
  "MnvYN0_254I3czEEb05Bkg": {
    "date": "11/8/2017",
    "text": "By far the best Vietnamese food I have had!   The employees are so friendly, and the environment is very inviting.  LOVE IT!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "20_z1obrVKAtyrIQg1vAdQ"
  },
  "_lpgXrF_vdZ7DG-l1srAKg": {
    "date": "10/8/2018",
    "text": "Came in not knowing what I was getting into. OMG! amazing. Im so happy that I chose to come here over any other place. Food is great! Service is great! Price is right. Definitely highly recommended. I got the P1 and the regular was just right. Can't wait to bring my family and friends here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DuPQSbByJQ6d9QhGAAEp9g"
  },
  "5ll1o2hnuPiLdDZiuQqKog": {
    "date": "4/27/2018",
    "text": "Really good food and really good staff. They will bring out food as soon as it is ready, so sometimes other people get food much sooner than others but we expect that when we come here so it's not bad. All in all, I highly recommend this place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yWx1mCK10gOh91QIMPp66A"
  },
  "e6bmgqDu7hqPDwMcamJxbA": {
    "date": "1/25/2018",
    "text": "If you love pho and you live in the West Valley. Then this is where it's at! I always get the combination pho  bowl and it's loaded with goodness- steak, tendons and herbs.  You just got to check it out for yourself",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KHolVqLjAKo2KprLmUiVkQ"
  },
  "-0ZIASF7GNXAdvxkXWukfA": {
    "date": "4/22/2018",
    "text": "As I walked in, it smelt so delicious. Took awhile but after our waiter explained the delay, it was well worth it. Thank you guys.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IMLVUzq19As8Wy4F28yiTg"
  },
  "wwy32UA7waDloc2Q4kNMDA": {
    "date": "8/11/2017",
    "text": "Relaxing and quiet. The service was quick and food was delicious, not short on serving size, and I love the call button so your not waiting for someone to walk by. I had the BBQ chicken pho, the only thing I'd change, my chicken kind of tasted like light cinnamon which I'm not really a fan of but it was still good. Will definitely return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HXv_FGSrIT2q5IbPRDdH7A",
        "caption": "Photo of Song Lynn - Phoenix, AZ, United States. Bbq chicken pho with vegetables. Egg fried rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HXv_FGSrIT2q5IbPRDdH7A/o.jpg"
      }
    ],
    "user_id": "54VofkrKho-huMloGoFSiQ"
  },
  "cNQInz8xXt35Fa7pr-HFcg": {
    "date": "8/21/2018",
    "text": "Great place, love chicken pho and chicken fried rice. I come here about twice a month and the servers are always so nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QYy75LNjlZKwtYaQ--RRMQ"
  },
  "sW7tWg0ky8rzaW0NUDmB4w": {
    "date": "7/4/2017",
    "text": "Huge portions and great tasting food. They have buttons in the booth to alert your server.  Great place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4qFq8yLp-BGK7eCQb3tEIg"
  },
  "RvB-iKXV8Hn_JFaGA7yjYA": {
    "date": "4/8/2017",
    "text": "Amazing atmosphere!!! Super modern decor, and very fresh food! The staff is friendly and helpful. The Pho was delicious! The egg rolls were yummy. The BBQ beef sandwich was great:) I will Definitely be coming back and making this my regular west side Pho place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nb9xx5vxYcpZzVMoxfozXw"
  },
  "zELDR5Q7xn2xes5Bu5Wbqw": {
    "date": "2/21/2018",
    "text": "Not the best Viatnamese I've had, but still yummy. Friendly staff and quick service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gWmiil_hnoHLEAnQuqni2w"
  },
  "5dkrT1wYJs4yJs-tWeD3Hg": {
    "date": "8/3/2013",
    "text": "Great new place with good Pho and Banh Mi.  Been here twice already with the wife.  The service is excellent and the decor is super nice and clean.  Great Vietnamese on the Westside now!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ho0PID3Zlt9cCZmZVeoo_Q"
  },
  "CTrk7dsUEgi2yHkhHqjtvA": {
    "date": "8/28/2014",
    "text": "We have tried just about every Vietnamese restaurant in the West Valley.  Song Lynn by far has the best Pho we've had, and the serves is friendly!  We usually have P1 and P2, we have tried their spring rolls, fried egg rolls, and their Thai Tea.  The Thai Tea was a little too sweet, but the rest....Just Amazing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AL96a4zBoGenPzFx69n1iw"
  },
  "uXhA-Kh7xe__06mWPDb2aA": {
    "date": "11/21/2015",
    "text": "Reasonably priced authentic Vietnamese food. Great shrimp rolls. We had the claypot combination bowl that was awesome. Staff was friendly, atmosphere was relaxing, definitely eating here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rB2zocyYsgh0-JAMZNQpPw"
  },
  "q4lahJ9RdIn2aXrtQR_1Mg": {
    "date": "9/6/2013",
    "text": "I loved the pork vermicelli, the banh mi, and the egg rolls. I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oxcty2NQ9hz-O4pToG2Qqg"
  },
  "MX_C2adNVgTcE1UhKCrpqw": {
    "date": "12/8/2013",
    "text": "Thank you yelp! This place is a do over do over and another do over! By far some of the best Vietnamese food we've ever eaten. The place is immaculately clean the food is unbelievable and the proportions are more than generous. Best part can't beat the prices will be back again probably tomorrow!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YUDaojObIq5liMTlmB0mlQ"
  },
  "PQKmFVp5-U2aJ7Wk2GF7Gw": {
    "date": "6/28/2013",
    "text": "What a great place! This is honestly some of the best Vietnamese I have had. Had lunch there today with a friend and it was excellent. We both had the Pho and it was very good with huge portions. I also tried one of the \"Sub Sandwiches and it was excellent! The Staff and owners were so friendly and attentive. We will definitely be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dMaBP287FwD1bqQyQeUEfw"
  },
  "yOaiHy8XAAHAX60ZUSOVGA": {
    "date": "8/14/2015",
    "text": "Best Vietnamese restaurant... Great service, great food. Love the Pho,  spring rolls,  egg rolls and more...  Taste the same everytime I come around",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KLRi0lG77iP4SBQE_pBKog"
  },
  "mP9SgMDtmuOS4P4wguanLQ": {
    "date": "12/7/2013",
    "text": "What a good Vietnamese restaurant! They have the best Vietnamese food here. Especially the pho, it is super delicious. Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bHfqsbI27GTxnPy6d4oVQA"
  },
  "UBbOgpQskKXGKoQ1DGpDbg": {
    "date": "11/18/2013",
    "text": "my favorite place to eat. Great service pleasant staff and service. Definitely the best Vietnamese place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "akahwNOkcBctcTzl3bPzVQ"
  },
  "T6qRB17KifoF8mfF1KzVKQ": {
    "date": "7/20/2014",
    "text": "Third time coming here in a week. Between me, my wife, brother and sister-in-law, we have tried at least 10 dishes and everything has been amazing. We've been lucky to have no wait and the food comes out fairly quickly. It will be a regular stop for us. We are very happy to have a really good Vietnamese restaurant nearby... and they deliver!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TZWmCCL9sTVohmoK6ibzWQ"
  },
  "rfUUI35I6TZ_VucMXai8rQ": {
    "date": "6/8/2015",
    "text": "First timer: I don't have a ton of experience with Vietnamese but found the Pho to be tasty and filling. I also had the eggrolls which came out super crispy and piping hot! Reading some of the reviews I'm unsure what people were talking about when they said some of the portions were small... My spicy beef and lemongrass pho (p11?) was full of noodles and savory broth. The female server was truly quite pleasant and plenty attentive. The restaurant appeared quite clean and leaned towards a modern interior.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rc7jR5836kjkozMoeyohOQ"
  },
  "ZSgwhgBJfQ5szBp3WHDMWw": {
    "date": "4/15/2015",
    "text": "The waiters are really nice. Their egg rolls and pho is really good. :) I always find myself coming back here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KBnspbi1XjfdV2NoVMrN9A"
  },
  "JJ4Ke5l3IxFXDwuyZLHXtw": {
    "date": "4/11/2015",
    "text": "Came and ate here for the first time because my husband loves Vietnamese food. He said it was really authentic and delicious. We loved how we came 45 before closing and everything tasted fresh! Service was great waitress was really nice and attentive! We will be coming back often",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UExf0VF6PG7XaYpbr-JNUg"
  },
  "M9KK1rn-skqqNerKhCmaBQ": {
    "date": "4/4/2015",
    "text": "One of my favorite places for Pho! and they deliver! Beautiful inside, very upscale for the location. Love the staff, very personable. We have loved everything we have had and we will continue coming for years to come!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NmTLoHBG3bz_X3jxB2GdXg"
  },
  "5LTc725u885XAxUSMv5Fag": {
    "date": "6/14/2013",
    "text": "We are so happy to have a PHO place on the westside! The decor is great. Clean, modern, and relaxing. We got seated right away and the staff was very attentive. I had questions on the menu and they had the manager personally explain it to me. We got the egg rolls, PHO, and fried rice. Everything was delicious and we will definately be back again soon. They also took our order on a mini iPAD which made the food come out super fast and accurate.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hxjAthEnwYCEMg5hGDIO-Q"
  },
  "u9G4F9o9pqKk9RDRpu_YsA": {
    "date": "4/23/2014",
    "text": "CLOSED WEDNESDAY!!!! Went there last wednesday but they were CLOSED. We'll try again this week.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WPhP1LIQQzBuL0c0JcWTPg"
  },
  "k4QqQnkKyr6er1KtGmCIzw": {
    "date": "3/8/2014",
    "text": "Randomly stumbled upon this place and it was well worth it! The atmosphere was great. I'm not sure what play list they had going, but I loved every minute of it. And the food...that's the best part of the experience. It was fresh, delicious and fast. The staff were extremely friendly and welcoming. Like the environment. I wanted something new, different cheap. This was the perfect place. I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wG4-5CpT7o4gCPdteb4grA"
  },
  "DcZ1uZWNy-XgBwdtOqRpEw": {
    "date": "5/4/2014",
    "text": "Went to this place for the first time today with a Groupon and was super impressed.  The servers were very friendly and efficient, even though they knew I had a Groupon.  The food came out in a flash, too.  I had the shrimp, pork and sausage combo with an avocado shake with boba, and both were very good.  I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q0r41YMEfZlYn5lx6KOfZg"
  },
  "A_Rhpg5Pdxga2Vl3zUmCjQ": {
    "date": "6/12/2013",
    "text": "I'm so excited to have a Vietnamese Restaurant close to home! They just opened on June 4 and they include 10% off for their grand opening. I ordered P10 to go (Pho with well done steak). The staff looked absolutely thrilled to have their new restaurant and they were just as friendly! Great food at great prices. Can't wait to try more on the menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "KpAMZkAfgzULz4Qz2EXlIw"
  },
  "f7Lxhuy3W8xkO9_xiTS15A": {
    "date": "12/4/2014",
    "text": "This place is amazing, pho soup (chicken) is delicious and their chicken and white rice as well. Reasonable prices and great customer service :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3eltP4YR6oW1DX-HRvBsbw"
  }
}