{
  "uAIljZ71sCxyTRJsDjoi8g": {
    "date": "6/1/2018",
    "text": "I never ate here.  I tried to order a drink. It wasn't all that busy and the bartender made sure to put in an order on an iPad and then never actually made it.  Cool.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KoZowzOGRuoLtM_0FuaOdQ"
  },
  "MttLt63H1TlmR2EgZtaR3Q": {
    "date": "6/24/2017",
    "text": "Best Tacos in Arcadia. I just went to a new place on Indian School and honestly this place BLOWS it out of the water. The tacos have so much flavor and the service is amazing. I brought my kids and they even make them special quesadillas.   I am a huge fan of Lengua Tacos and theirs are the best I've ever had. The crunchy tacos are also soooooo good. Our server walked us through the menu and helped us pick the perfect amount of food. She was friendly and even the manager/owner came by our table and made us feel so welcome.   Hoping to go back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 7
    },
    "photos": [],
    "user_id": "yvGVfBYnZ0CdZ5onAcH9TA"
  },
  "6G3qXPmmqfRMm4uolSjJAA": {
    "date": "5/25/2017",
    "text": "No bullsh*t... The best crunchy tacos of my life. And I know tacos. Don't screw around. Just go there. Immediately. Talk with Jason and Rich. If you don't, you're IQ level is sub tea party.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 10,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "rEveaNcEKXLblTBQslRXmw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rEveaNcEKXLblTBQslRXmw/o.jpg"
      }
    ],
    "user_id": "W998Rw0mvzE7CQNYdVqoHg"
  },
  "SSUHD9AN3K-A2hj_qlWiJg": {
    "date": "7/29/2017",
    "text": "Super great environment and vibe. Its a newer restaurant and has already won tons of awards. The tacos are amazing and so are the appetizers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "V_XxWWaiK9K6LZLVb1i9gQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Award winning Pork belly taco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V_XxWWaiK9K6LZLVb1i9gQ/o.jpg"
      },
      {
        "img_id": "CVNiqERXP11NPqhg65DeZA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CVNiqERXP11NPqhg65DeZA/o.jpg"
      },
      {
        "img_id": "d2MIkpModI_4euZuwYOvKA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. View on the inside",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d2MIkpModI_4euZuwYOvKA/o.jpg"
      }
    ],
    "user_id": "isgb2Np1sK4HhQc0KwhzUg"
  },
  "1mTEA3_6RuYqlIN8P4OI5Q": {
    "date": "4/3/2018",
    "text": "Tacos here are amazing! Found this place here on yelp on my first trip to Phoenix, and went out of my way to go back when I was in town for a wedding. A little pricey, but definitely worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "YzBhpKJvz13hlZDyttpBKw"
  },
  "ZaN2fqNrF11x5aScvw9duA": {
    "date": "4/13/2018",
    "text": "This place shouldn't even be called taco's.  Everything is unique on the menu and the atmosphere is great.  A great place to go for signature margaritas and food.  Love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "CXVVi8uTicNClDc0r7kr1A"
  },
  "G3DTP4V41n7O7IVuzFcuOg": {
    "date": "10/9/2017",
    "text": "Wowie good stuff! Great ambience, great food (fast and hot), and darn good service. Oh, and the tacos....YUM! I had a pork belly, Korean fried chicken, and tempura avocado taco. We also shared a guacamole and chips. Good stuff! Can't wait to go back and try other tacos on the menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jCGjZEdpRRzehZ3RoL9EVA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Guacamole and chips. Nice heat with the fresh Jalapeño!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jCGjZEdpRRzehZ3RoL9EVA/o.jpg"
      },
      {
        "img_id": "UgT_yINAifAfdYpaxqii-w",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Left to right....pork belly, Korean fried chicken, and tempura avocado tacos. Super tasty. My fav was the Korean fried chicken!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UgT_yINAifAfdYpaxqii-w/o.jpg"
      }
    ],
    "user_id": "-xzvt0ZzKndd8jR380nxzA"
  },
  "ujzVFAxTc7nvtz1KST4GgA": {
    "date": "11/8/2018",
    "text": "Seriously wasn't impressed with anything here. Like the tacos were okay but weren't great. Step it up you guys!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m-4BgNck6WyHTntH_WN3nQ"
  },
  "k0xJVAQ4CGBEmR7qX_zCfw": {
    "date": "1/30/2017",
    "text": "My husband and I arrived in Phoenix on our year long trip around the US, and were HUNGRY. This place was right around the corner from where we were staying, and we can never pass up tacos! I got their house margarita, which was $7, not too sweet, and refreshing! They had a great selection of tequila, bourbon, and whiskey from what I could see, as well as a nice rotating craft beer tap. The street tacos were really good, but pretty small, so be aware. Their crunchy tacos were bigger, and around the same size, so I recommend getting a mix of the two.   Never thought I would be saying this about a bar, but I really like the padded section around the bar. I don't think I've seen this anywhere else, but it made sitting at the bar really comfy! Bartender was very friendly and attentive, the space is cozy but hip, and we will probably be back! Feel free to follow our journey at <a href=\"/redir?url=http%3A%2F%2Fwww.tandaintheusofa.com&s=d2d28c7404c65fd25b76b8d7f70da9a651e2e1cf86deec5b0862408a60b0415b\" target=\"_blank\" rel=\"nofollow\">tandaintheusofa.com</a>",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m5RUnrlPPZpTWwQi-XFu3w"
  },
  "jwVruTtKSbcWCxezlqxAqg": {
    "date": "6/3/2017",
    "text": "Spent the week trying taquerias in Arizona, and this was hands down the best. You are missing out if you don't try their grilled corn appetizer. And for tacos, the Korean Fried Chicken, Duck, and Pork Belly are a MUST!! I don't know if I'll have tacos again after this.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 2
    },
    "photos": [],
    "user_id": "JFnUwdlNYjDlTTEbOHoSqA"
  },
  "voMrIDcElFLNv5BZ2sGbfQ": {
    "date": "4/13/2017",
    "text": "Great spot for happy hour, late evening munchies, and margaritas. I'm a big fan of all their street tacos, especially the Korean fried chicken and pork belly. The ahi is the only one I've had that leaves a little to be desired. On that note, their queso is decent but nothing to write home about, but the guac is pretty fantastic.  They have a pretty solid happy hour, and keep their kitchen open until 11 during the week and midnight on the weekends, I believe.  It's a small spot but service is usually on point, both table side and at the bar.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 10,
      "cool": 7
    },
    "photos": [],
    "user_id": "si7trhnlFun_jVlxODWAYw"
  },
  "U3m3XNP3QRAzQUe9ec2CJA": {
    "date": "3/29/2017",
    "text": "Incredible!  Being from Houston I've had plenty of tacos but this was one of the best tacos I've had. The beef taco, fantastic!  No not ground beef shredded beef  I went with a group of 8 and everyone was telling me what a great find!!!!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 11,
      "cool": 6
    },
    "photos": [],
    "user_id": "PoU0nYYMMg0hzn2hJFCz7Q"
  },
  "QwiLXY0P_oSEZ547XEbITQ": {
    "date": "7/19/2017",
    "text": "Came here for drinks and their strawberry margaritas are on point! It was super refreshing! The ambiance is great at this restaurant and the service was really great! The menu looked super tasty so I do plan on returning to sample some of their tacos!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "sRrl6zoyLYRTVlhdn25hhQ"
  },
  "G0cBKIadTILFigV_bF0Ksw": {
    "date": "4/13/2017",
    "text": "Best tacos in the world! Flavors are so complex and unique. You have to try the entire menu. Sooo addicting!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "RUnm6NIBZdEG5OK1k1qR2w",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Wow.. just wow",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RUnm6NIBZdEG5OK1k1qR2w/o.jpg"
      }
    ],
    "user_id": "UIOLYHykqKdKaNPuXeJCgA"
  },
  "GQMMk7RZP35jyRAvkk8yGQ": {
    "date": "4/2/2018",
    "text": "Really liked this place!    If I lived here it would be my weekly hang out!  So good!   The owner is completely involved and it shows.  The chef is so creative and the margaritas are really really good.   Go on Monday!  $5 drinks !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ir8nBdkvt9ozqJdl6TCAew",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. What a great experience.   Delish salsas and Queso! Margarita Monday&amp;#39;s are the bomb!  Friendly owner  made us feel right at home!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ir8nBdkvt9ozqJdl6TCAew/o.jpg"
      }
    ],
    "user_id": "1gzl6DC-Do9nCpVZb4FbOg"
  },
  "V1TJud-apVb-51JNkwdH8A": {
    "date": "9/17/2018",
    "text": "Crujiente has some of the most unique and delicious street tacos in Phoenix! The chef is creative and each taco is made with much attention and care, I would recommend to anyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zufnWG4oI2hxkaNxTzjp4Q"
  },
  "K8GoBVBYGgTF6DEj7zm8-g": {
    "date": "3/16/2018",
    "text": "This is by FAR my favorite taco place. My fiance and I have become regulars because we just can't get enough. The salsa trio, queso and guacamole are al delicious appetizers! We haven't tried the others because we love these so much. Our favorite tacos are the crunchy beef and Korean bbq and I personally love the tempura avocado and poke tacos. We have never gotten anything we didn't love. Plus the staff is amazing. Very happy and upbeat and always on top of everything!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "FDzIR4-i2fcCu8-JulaGzQ"
  },
  "By2qK82FF8htzwSPU21_xA": {
    "date": "4/25/2018",
    "text": "Had the pork belly, beef short rib and the lamb hard taco.  Soooo good.   Service is fantastic.  Quick and delicious",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hNEGnUB5_9NMw0J0ZZ_LsA"
  },
  "dfhPHymQNVqgwIP6h0dssw": {
    "date": "3/29/2018",
    "text": "Wow! Hidden gem Finger licking! Telling everyone about this place ! It's a small place but they still saved a table for 6 people for us . Thank you! The Pork belly is the best !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ryKyznbcpghJZje_A1g86g"
  },
  "GVSeBIE8t3Py2Bq4nmQDQg": {
    "date": "3/1/2017",
    "text": "Really good place to grab a few tacos and watch the game. I really like their lamb tacos and they have a really great selection of alcohol. Will be coming here very soon whenever a game is on. I want to try other tacos on their menu. Their happy hour is from 3PM-6PM so if your just getting off of work stop by and watch a game.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "oQH6JexMaMK8-9GGpR8iJg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Got the lamb tacos yum",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oQH6JexMaMK8-9GGpR8iJg/o.jpg"
      }
    ],
    "user_id": "SHaEzyoo6JyryscEi7NMRw"
  },
  "-nU5aYa2gAhvfrVsxIzONA": {
    "date": "6/23/2018",
    "text": "They never fail to impress! We went (this time) to celebrate our family's new US Marine! The staff was accommodating, helpful and of course served the greatest tacos in AZ!  Sad to see the menu change and the loss of the amazing 36 hour rib... was my fave!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "8gYk4nBvYyviPP7ltCrJow"
  },
  "ROYIDx3-DKU_N_XawXQaDw": {
    "date": "1/8/2019",
    "text": "We found this place based on the yelp ratings and I'm so glad we did. I was torn between the shrimp or the duck taco, but our server said the shrimp was his favorite so I went with that.. It was my favorite out of the three I had. Everything was good and we will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "pCkRTsO0L5XnX5EcHZr2sg"
  },
  "439JY0J2LTbUDYjNAVL1VA": {
    "date": "12/21/2018",
    "text": "My favorite tacos in Phoenix come from Crujente! This is a tag team of excellence with Chef Rich making these diverse tacos from Korean Fried Chicken tacos to the pork belly my favorite each has a story to tell. The other half of this team is Jason who can recommend some great wine or have a delicious flight of mezcal. The cocktails and margaritas are always on point. Plus they have a rotating taco of the week to always keep it fresh. Saludos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "ShHuTiE40KGTVwp1ZTqrHA"
  },
  "NRAQVITb9QcdaxEc5gWBvw": {
    "date": "2/12/2018",
    "text": "We randomly came here and were quite surprised! First we thought it was more of a bar and would not have good food but were wrong. It was recommended we try a Crujiente (fried) taco and then two regular tacos. I was worried it wasn't enough food but with the chips and salsa it was quite filling.   I had the Crujiente pork taco, pork belly and korean fried chicken tacos. I liked them in that order. The korean fried chicken had too strong of the red sauce flavor for me (the gochujang sauce I think). I tried some of the lamb taco and that was pretty good.   The different salsas were also really good and there was one that was especially spicy but flavorful.   Recommended for some nontraditional tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_my3vp-ah7_iLGL9GZLA4A"
  },
  "JGRFWh-UJEmql2IEg-01eQ": {
    "date": "3/14/2019",
    "text": "Loved the food and atmosphere. The guacamole was some of the best I have had. Margarita too! Loved the variety of interesting taco choices. The Korean chicken taco was tasty. Friendly service. Would highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WXLDUsETkC_iwx25GXnGlg"
  },
  "QqAnNSACwCLTuwHCfOVkHQ": {
    "date": "12/5/2018",
    "text": "If you're going to any other place for taco Tuesday, STOP! This place is the classiest and most flavorful taco spot I have ever been too. ALL the appetizers are amazing.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "8jqTLlJ6aQ88C2kROmthNg"
  },
  "3NcrncKJFhdcEZQWDhcQWQ": {
    "date": "9/25/2017",
    "text": "I tried this place once with my cousin and then went there three days in a row! Everything I have tried here has been absolutely delicious. The chef and co-owner Richard is a culinary genius. Tried the Sandia salad and it was a treat for the taste buds and very refreshing. You get three different salsas with your chips, all three equally tasteful The other co-owner Jason will help you choose the best alcoholic beverage that pairs well with your meal.  Now, I haven't tried most of their tacos because I am vegetarian but I went with a friend that tried the Pork Belly taco and the Koran Fried Chicken taco and she loved it. They do have a vegetarian Avocado Tempura taco that I always get there and I love it.   They also have a great HAPPY HOUR! Perfect place for TACO TUESDAY! Seriously go check this place out, you will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 13,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "Quf8XX8OL7CIYHWb_Cekjg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Quf8XX8OL7CIYHWb_Cekjg/o.jpg"
      }
    ],
    "user_id": "egIY70hCe5K-ekOPQgYWYQ"
  },
  "CEGq_s9GP1VlFTnzZJGSEw": {
    "date": "2/3/2018",
    "text": "Weird name. Great good. Happy hour is one of the best in the valley. Stopped in here on a whim when I had a 45 minute wait at the sushi place close by. Impressed with this establishment.   Food - Tacos made to order, would recommend getting a few different kinds to mix it up. Chips and salsa are a great choice as well.  Drinks - Met Nate the bartender. Upbeat and fun guy with great stories. Makes a killer margarita. Top Notch bartender. Happy hour does seem to run later on in the night as well.   Seating - on the smaller side, would recommend getting their early to beat the dinner rush. The bar has the best seats in the house in my opinion.   Will be returning. Best times I've found to come in are Wednesday evenings and Friday's after 6.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Wb_9AL74fh85qRSdI-742A",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Wb_9AL74fh85qRSdI-742A/o.jpg"
      }
    ],
    "user_id": "hJA0ogPW4pSnogeHG1pf5Q"
  },
  "ue5jzQHJAvLsDZlMM7qgWg": {
    "date": "9/23/2017",
    "text": "Have to try this place!  Cru has an unassuming storefront but has amazing ambience and knocks it out of the park with their flavorful tacos!  A favorite of mine  was the avocado tempera. Savory grilled street corn is an absolute must and don't be misled by this place being stuffed in a strip center-the moment you walk in you will smile and your tastebuds will be happy!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "datRiqdr84LNjujok-N9XQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/datRiqdr84LNjujok-N9XQ/o.jpg"
      },
      {
        "img_id": "hS7d06tHawrwrr3WQhsQoA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hS7d06tHawrwrr3WQhsQoA/o.jpg"
      }
    ],
    "user_id": "qk14Zl9FtvvduaKzK91eVg"
  },
  "ZyufkmDZO_pw0oYMl5_PZg": {
    "date": "7/16/2018",
    "text": "It was our first time at CRUjiente Tacos. We LOVED it! We loved the ambience, the service,the drinks, the chips and chorizo queso, and the tacos..oh.my.word. The tacos are amazing!! Our favorites were the pork belly, the Korean fried chicken and our absolute favorite was the crispy pork taco!! If you haven't tried CRUjiente, you are missing out! Get ya some!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pKb59eFqXjtfCNlDK_sgcQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pKb59eFqXjtfCNlDK_sgcQ/o.jpg"
      }
    ],
    "user_id": "VZpmteBksJZzNKOWsvQPQw"
  },
  "UO-Z7_AD4T_XSzlxjHokVQ": {
    "date": "2/24/2019",
    "text": "Place is cool, hip, and busy. One of those places that takes longer to find parking than it does to get a seat. We were seated at a community table and ended up having dinner with strangers which in this case was cool because they were fun. The tacos menu is different from pretty much everything else in the valley. Good quality too. You'd think in Phoenix of all places it wouldn't be that hard to get a good taco, but it really is.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_EXDgO6_wbWKrSZk4pBLrQ"
  },
  "tViWPrSD92mQUzmTioTZkQ": {
    "date": "4/20/2019",
    "text": "Didn't expect much from the outside and the location - in a crowded little strip mall. But man they didn't disappoint. This was our last stop of three taco joints all in the same general area and the four of us agreed it was the best. Each of us had one crunchy and one street taco each and we loved them all. The short rib and Texas wagyu were excellent. Best of the day. Will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "BLuM30EVJd1jYBKn-GwlpA"
  },
  "KRE1tW0e3jCAqaEeKYVnpQ": {
    "date": "11/25/2018",
    "text": "Food was ok. Not at all traditional Mexican. Unique flavors. But not real street tacos like other reviews say. Ambience is really nice. More of a cocktail and a light, small meal type place. No sides with tacos.  Tortillas are super good , just tiny. $5-$11 a taco is absurd. Service was ok. Waited about 40 minutes for food. If you're looking for good traditional street tacos, not the place. Unique flavors and a cocktail. Check it out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "WIXZY-mPjATskkg060OU0w"
  },
  "2i33CjHNXBJHomnFWEUM8Q": {
    "date": "5/20/2019",
    "text": "If I could give zero stars I would !!! Service ruined all! Food was modified not to our order basically tortilla had a touch of meat on it. When we expressed that to our server she became very rude! Overrated !!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vU7GS_qyibthjTGa7MCXLw"
  },
  "EPVfugc6YxkEh0IKSH82Tg": {
    "date": "12/14/2016",
    "text": "I heard good things about this place and decided to try them out for lunch on Saturday.  When I walked in I thought I was in Chuck E Cheese for a moment.  There was some kids soccer team in the restaurant and they were all running wild without any proper supervision from their parents or the staff.  I sat at the bar and had three tacos.  Duck, grouper and pork.  All three of them were very good and flavorful.  After my meal arrived I was noticing that they had a taco of the week.  It would have been nice if the bartender had let me know what it was before I ordered my meal.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R58lBSAcvDYjXaV2XLLJNg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. L to R grouper, duck and pork",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R58lBSAcvDYjXaV2XLLJNg/o.jpg"
      }
    ],
    "user_id": "S9Jw00eZHVj5_0sOM_C5Rg"
  },
  "6VsBVODLKsN5H99G5W3WJQ": {
    "date": "5/2/2019",
    "text": "Great spot; good margaritas and tacos.  The octopus is really good, and that's not an easy thing to cook.  Decent heat on certain items if you ask for it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DDM_PQXJFCvMq4QUltWSjg"
  },
  "Cj_KIUa4oLJaSOhascLffQ": {
    "date": "12/3/2018",
    "text": "I was reading reviews here, looking at pictures, and was completely sold! The charred octopus with shishito peppers for $13 consisted of 4 cubes of octopus and 2 shishito peppers with cold black beans on the bottom. I'll give it a B+ on flavor. If you go next door to Sushiholics, you get a full order of Octopus for $7 and a full order of shishito peppers for $5. This place is beautiful inside and the food is good, but not worth the price. I get that it's tapas, but you don't need to gouge people. You're not The Sanctuary, you're in a strip mall.....next to a shoe repair shop.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "l0os2KTLDSdMkj8CXBIvzg"
  },
  "H4r3qc1IlNCfwNoqZNAYjg": {
    "date": "11/11/2018",
    "text": "We went on a Friday evening and the restaurant was packed, however we were seated promptly . After many drinks and bags of chips, which were delicious with the guacamole, we ordered dinner. The crispy tacos are unusually delightful, I would order these again and again. And everyone in our party of four were in agreement on this! Can't wait to return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "gcKOPrd8Kh0IfqlKiCszpg"
  },
  "UrLrvPH87GP1HFhadXNomg": {
    "date": "12/2/2018",
    "text": "I really wanted to love this place but unfortunately it missed the mark where it counts, the tacos. I have had it on my yelp bookmarks for a while now because tacos with a twist are my favorite. Don't get me wrong, I love traditional street tacos too but their menu is so creative and sounded amazing!  As you walk in, the vibe is awesome with the lights dim and the front window open to the fresh air. The music is loud but not too loud. Just perfect for a Saturday night. The waiter was also very attentive and knowledgeable about the menu.  We tried the Korean fried tacos, the lamb CRUjiente taco and the fish tacos. Everything was fresh and beautiful when delivered but way over seasoned with salt. The grouper for the tacos was very fresh and had a perfect texture but I couldn't get past the first bite because it was very salty. The lamb was also very salty. The Korean bbq had the perfect amount of heat and the chicken was fried perfectly but the batter was really salty again. Maybe we hit it on a night where the chef just had a heavy hand on the salt, but we left feeling very underwhelmed. I do hope to come back and maybe try a few other tacos when the \"salt bae\" isn't in the kitchen overdoing it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "S_PvShsyfpTFqtqJLWlSQw"
  },
  "4mvmNMMjq-3QvZRlgVulZw": {
    "date": "8/15/2017",
    "text": "Amazing Flavors and Presentation!  Stopped in after seeing a customer appreciation giveaway post on Instagram. Their pork belly taco won the \"Best of the Valley\" award by Phoenix Magazine. As a thank you, customers received a free pork belly taco with any purchase off the menu.  Sat at the bar and was immediately greeted by the owner and friendly wait staff. It was happy hour so lots of great deals to be had, but I had an idea of what I wanted.  The bartender, Morgan thoroughly explained their menu and offered great recommendations. I decided on the Korean fried chicken taco, the duck taco, the beef hard shell and obviously the pork belly.  The tacos arrived quickly and wow, the presentation was special! Morgan advised me on the order to eat the tacos based on flavor and boy were they flavorful! Every bite was pleasing. There is a reason why the pork belly taco won Best of the Valley and it was clearly my favorite. I finished my meal feeling satisfied but not uncomfortably full.  Also took advantage of the 50% off dessert check-in offer and it was well worth it.   This is one of those places that you need to visit and will want to come back for more. I will return soon to try all the other tacos.  Do yourself a favor and come here ASAP!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "VrdVtMvR0JwK2-hJ7O5EFQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. The check-in dessert promotion",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VrdVtMvR0JwK2-hJ7O5EFQ/o.jpg"
      },
      {
        "img_id": "qYLDRIpvgeCTc_bhJOANpQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Awards and Recognition",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qYLDRIpvgeCTc_bhJOANpQ/o.jpg"
      },
      {
        "img_id": "2V8yXVjleJDp74YFgDrdkQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Happy Hour menu, great value!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2V8yXVjleJDp74YFgDrdkQ/o.jpg"
      }
    ],
    "user_id": "CKANnw2IcpRHS-oDigYxCQ"
  },
  "6Kw-Fwxb6JWCshDM2z-1SA": {
    "date": "2/26/2017",
    "text": "The food and drinks were great!!  Will definitely be back.  The Cedar River New York tacos and the pork belly tacos were my favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "yj1KQ8yRIzP3__BV4YqxuA"
  },
  "Htdpw-1QunCEwwXpNtCQAg": {
    "date": "1/21/2017",
    "text": "Wow!  The tacos here stand out above almost anything I've had. The Korean Fried Chicken tacos were unique and a fabulous blend of flavors. The fish, short rib, and beef tacos were fabulous.  The food is superbly prepared and the service was spot on. I also had the chips and salsa which comes with a trio of delicious salsas with just the right amount of kick. If I wasn't from out of town, I would eat here all the time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "JnSOlSiFHWf1Y0zoIvj_FQ"
  },
  "9PP2GNkxrfwAlWBwL37Dwg": {
    "date": "1/21/2017",
    "text": "Our family quickly became regulars. There is literally nothing on the menu that is bad or even mediocre, absolutely everything is mind blowing. If you love tacos you will fall in love with this local, hole in the wall restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "QtMLZzrRWKwVq7iv44L9mA"
  },
  "nxgddPylywyYhepHa5uQQQ": {
    "date": "1/21/2017",
    "text": "Amazing tacos. Some of the best I've had and a large selection. Don't be fooled by being in a strip mall, this place is fantastic. Great food, service and mojo! A can't miss.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "3c4ey0Z3ibCXWWNjIopWPQ"
  },
  "-5FtaFvENrS7Rf5Wz5OB6A": {
    "date": "11/25/2016",
    "text": "Amazing new taco place! I would definitely recommend the pork belly taco it is just bursting with flavor. The kimchi balances everything out and the result is just amazing. I'm not much of a cocktail guy but you have to be impressed with the amount of offerings at the bar it is downright impressive! I would definitely recommend this place to anyone who likes tacos done the right way.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 0
    },
    "photos": [],
    "user_id": "ckCcA2nfSdM-GU3yNpjo_A"
  },
  "fFNlzYOYAxNcgGiU2u_W8A": {
    "date": "11/22/2016",
    "text": "I have found a new favorite place! The crunchy tacos are amazing, but loved all the different flavors of the soft street tacos,.  I want to go back tomorrow and try all different ones tomorrow! Great margarita too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "BeliULHHreUz5QEbKdgnIw"
  },
  "I-w8M1WklA2qStLhVc_ENQ": {
    "date": "12/23/2016",
    "text": "Food & service was outstanding!  Short rib taco melted in my mouth & had the right amount of heat that lingered.  The ahi poki taco was simple but flavorful.  The Korean chicken was crunchy & savory.  I tasted the duck that my wife ordered and it was great too!  Nothing I would change about this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "-w_77DfbugWMehzC71XF3w"
  },
  "SBYdTPaWMoPOQ7di3ISCbg": {
    "date": "3/30/2017",
    "text": "I planned a birthday party here on a Wednesday night for a large group. The service was good, I liked my margarita a lot, and we had a nice big table. This wasn't enough to outweigh the bad though. The food is way overpriced, $9 for chips and guac? And the tacos are miniature. For $16 (three tacos) I wasn't remotely full; my husband was shocked at how small they were. The men in the group all thought the beers were way overpriced. The icing on the cake is that I brought a Costco cake in for the birthday girl, it cost $16, and they charged us $19.50 in cake cutting fees. This isn't a fancy restaurant, not to mention we were one of two tables in the place when it came time for cake. One would think for a party of 13 (all who had never been in), on a Wednesday, in a new restaurant, you might let it slide.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qt6KlG9mVG2h87pJ7jVADA"
  },
  "ao07m-PDV4X4KTmV2m5mVQ": {
    "date": "8/24/2017",
    "text": "This is a fantastic place.  Great, creative and delicious food in a friendly environment.  Went for the first time and Jason, the owner sat us and asked if we had been in before. When we said no he talked to us about the food, his chef, his mission and you could feel the passion he has for his place.  Gave us recommendations on food and margaritas.  Their margies are better than the Missions, and they have unique and interesting combinations and that goes as well for their tacos.  Our waitress was helpful, friendly and also spent time talking to us about the food. After we finished dinner, chef, Rich Hinojosa came over and asked how we enjoyed the food.  This place really cares about your experience.  He spent 20 minutes at our table taking about his recipes, his past work experiences and what they plan for the future.  We left feeling like we had been at a friends house for dinner.  Just try this place and see for yourself how this place sets itself apart from the others.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "r_6R94ZEegSkAm07IhiM7w"
  },
  "rWJBDSYVD_0Ft_1eDE-hkg": {
    "date": "3/11/2017",
    "text": "Great tasting tacos and margaritas.  Little pricey for the amount of food you get. Great service and ambiance.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ALk7822vTH2-tE29iAZz0g"
  },
  "my9vPejq1J4On83bv-kuxw": {
    "date": "2/1/2017",
    "text": "Amazzzzing tacos !!!! My only recommendation would be to give plates when ordering the queso. I also didn't like that my chips came in a paper bag, but other than that food was good and service was great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hcnAnB8ky1y1x5qR0S8jAg"
  },
  "xUjJ5Ce5QXlVCTgAwn1Qew": {
    "date": "12/29/2016",
    "text": "Very good tacos- I give this place 4.5 stars.    Good vibe.  I really enjoyed the queso and the salads.  I felt like the salads and queso are a nice portion size.  Tacos are small, but they are great flavorful punches.  I do wish they were each a dollar cheaper or so since I end up getting 3-4 to be full as a woman so it adds up fairly quickly.  But I'll be back.  Service is great.  My favorite tacos so far are the korean chicken, NY cedar creek, and the fish.  I still have plenty to try though!  It's a little chilly inside so bring a jacket.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p9PfXxQa8XqTJBhkLG1PsQ"
  },
  "rLE6oZ-6iGRMbHoJEx8LDw": {
    "date": "11/16/2016",
    "text": "Let me start off by saying that this place is a little more pricy so don't expect tacos mich's .75 taco Tuesday. That being said this place is more of a time to really experience more than your average taco and is well worth it. With each taco(tasting a total of 6 different tacos) you can tell the effort that was put behind crafting it with how well the proteins blend with the sauces and garnishes. The set up of everything was extraordinary and service was fulfilled with any questions we had and she checked on us thoroughly (thank you Lauren) overall my favorites were the Korean fried chicken taco that tastes like it came straight from a sushi chef and the 36 hour short rib taco, although extremely spicy so be warned. Overall an amazing experience that you don't do every night but will definitely recommend people for the atmosphere and food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "a30hjdVw5yEb3n4dRWEoAA"
  },
  "udUlg39g4zEWvVl1HR0dUg": {
    "date": "1/3/2018",
    "text": "The owner, Jason, responded to me and explained why the restaurant is not doing take-out orders. He and his staff are reviewing take-outs and hopefully in the future they will be able to accommodate me and other customers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iSbAYtamJ6Mmaj348-BvrA"
  },
  "ptV0qgXZcsHI9KnNE6KQHw": {
    "date": "2/17/2017",
    "text": "I can understand why some would rate this so high. It had some good things going for it, but personally I thought portions were quite small and prices a bit high for what you get. I understand they're going for a different taste, but it wasn't for me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6P5VERbgywcYm77Sg19wPQ"
  },
  "RagM_A-D_gnttk4ZBRrS5Q": {
    "date": "8/11/2017",
    "text": "The food here is amazing! From the delectable drink menu to the mouth watering flavors of the tacos, it is definitely one of my favorites.  The tacos are delicious and very unique, a mix of flavors and ingredients that will leave you coming back for more! Atmosphere is great, fun for a date or dinner with friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "X9Bql7RrPU5Mab5-hJsI8A"
  },
  "V42LWHF_spi-ATN8DGOWEA": {
    "date": "2/24/2017",
    "text": "We've tried CRUjiente Tacos 3 times.  I'm not a fan of the restaurant layout.  The food deserves a better setting.  I recommend ordering lots of different tacos so you can pick your favorites for next time.  Not a date night restaurant.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uTxFgHtJiwChxyIq-Tm0-Q"
  },
  "GdvfrBHb16vF7IRDBYO22A": {
    "date": "3/4/2017",
    "text": "Tacos were good, although very small, and they have a good beer selection. We stopped in for lunch, just two of us, and for 6 small tacos and 3 beers, it was $54. Pretty pricey for not much food. Ambiance /decor was nice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fVCPPr5tHKALlyQKImmsIw"
  },
  "RZ5I89-CmfYyaoize-dssw": {
    "date": "1/21/2017",
    "text": "Food tastes great, but lacks in service and value. We were expecting normal sized portions but they're fairly small, especially the chips and guac that's $9. Also, visiting as a vegetarian our options were extremely limited. Go to try it once, but we weren't very impressed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IajdRGejBo4ZsqMAEfx6TQ"
  },
  "1ydX6DvINZ0-0FJ9RJ9xvw": {
    "date": "1/10/2017",
    "text": "Delicious, artistic tacos. Really they are amazing. I would get the Korean fusion ones, they were insanely good. Unfortunately everything here is also really expensive. Wouldn't have even sat down if it weren't for HAPPY hour. I got 3 small tacos for about 14$. I'm not going to put that as a negative, but to each their own. 4 stars cause of how it good it was!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hWHepEcbGWzjpmlnBSz0g"
  },
  "fizydef_swKEydytdOzLfA": {
    "date": "1/28/2017",
    "text": "Very good... def high quality food! Good vibes however it is a little expensive for a restaurant/bar in a strip mall :-/",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TeP1CYCLiGDiZ0SplCWJFg"
  },
  "hfbB93FXmjbHmYxlO75x2Q": {
    "date": "12/30/2016",
    "text": "If you're looking for Mexican food then go somewhere else. But if you want a great foodie version of tacos that are unique then this is the place for you. The food is fantastic. And I highly recommend everything but the Korean Chicken Taco is a personal favorite. The atmosphere is casual and cool with a great bar. A total neighborhood kind of place. My only reason for 4 stars is that it's pricy for what you get. One small Taco can run you $6. Other than that, it's a place you have to try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XaZr-o5c9VUvoOAATJs2-g"
  },
  "nTRVNawj7Vpe6EaNH2TmNQ": {
    "date": "12/10/2016",
    "text": "So good! definitely coming back. Great cocktails  and food!  Great location cool decor great service. Korean fried chicken taco-  awesomeness! The only thing to complain about  is it's too cold in the restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iGwIVlQBFX5h2_8sCdIyJQ"
  },
  "FwJh9j4vu-DbEmOk79GgWA": {
    "date": "3/19/2017",
    "text": "I moved from the Mission district in SF where there are taquerias everywhere. These aren't generic street tacos, these are refined takes on street tacos and they're incredible. I love this place and really hope it opens for lunch too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "-xTA4nqXQldzGDnz1lvS_A"
  },
  "uglURlhwHJz2cswVBq9FeA": {
    "date": "12/28/2016",
    "text": "Great look, great atmosphere, mediocre food.  Limited menu choices, no side dishes and extremely small portions.  Overpriced for the quality and quantity.  During our visit we saw 3 groups leave after they reviewed the menu.  I really wanted to love this place but unfortunately all I could give was 2 stars.  $60 dollars later we had to go next door to order a little sushi to fill up.    If you want to drink, this is your place, but don't expect to curb your craving for Mexican Food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "chuI1dCPHa5GthO1QoNNkA"
  },
  "fXyaxJWLHQo0wzpYxCCEsQ": {
    "date": "3/11/2018",
    "text": "I am from Northern NM and I have never been to a restaurant out of state that comes close to the heat,  flavors and textures of True NM cuisine. CRUijente did not disappoint! The 4 of us had an array of different tacos and I can't decide what I liked best however, the beef came pretty close and the 36 hour short rib was a table favorite, among others. The guacamole was exceptional! I had a ceaser salad that was dressed perfectly! Now , the posole, for New Years my mother has guests for two days that show just to have her posole. I told the table that I felt guilty for enjoying the posole at CRUjiente as much as I did, it was outstanding, (sorry mom). The dessert was plated so meticulously it was almost too to beautuful to eat, almost! Only one option for dessert but that was all we needed. The bunuelos were not too thin and we're perfectly crunchy plated with a chocolate mouse and strawberry pico that was the perfect end to a perfect meal. We did not have drinks from the bar however, I will note that one of our dinner guests mentioned how impressive the bourbon and whisky options were.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3qCeZjQgpVOTjkpGBrf1MA"
  },
  "8w34q_4sC5rLBntxU4mH_w": {
    "date": "11/17/2016",
    "text": "Disappointing, the Tacos were not worth the price.  I had the Grouper taco which was mostly tough fat, the Beef Crujiente was very good, and the Korean Fried Chicken was good but not special.  The decor is very much like its' predecessor (The Grind) minus the large photographs. The service was friendly.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hfi3FqvH9YRFELWYDKxLKg"
  },
  "HZW_OBpi0_YYRxaK-aELJg": {
    "date": "2/16/2017",
    "text": "This is probably my favorite taco shop in the northeast valley. You really can't go wrong with anything on the menu. My favorites are the Korean fried chicken and the pork belly, delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "oqZKLvRq1a0t06L1pTZpUQ"
  },
  "B-oHA95_eOdLQvwtUw3OoA": {
    "date": "2/26/2017",
    "text": "Tacos were AMAZING!!! Highly recommend the Pork Belly tacos! Overall great food and great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "L1iKxQe3KH2dR0r5RZORig"
  },
  "eoQ4sA8JenPtdnxtSs35kA": {
    "date": "12/12/2016",
    "text": "This place is hands down the TOP taco place in Phoenix air have tried. I have lived in Phoenix for the last 6 years and this place is amazing. The chef has new, delicious mixtures for the taco of the week. The meats are cooked impeccably and the veggies are fresh. The service just adds to the atmosphere of this place and the pleasant bar tender truly knows how to make a drink (whatever base alcohol you like).  Being a new restaurant in a foodie corridor, this place is a gem! A total must try for anyone who loves great drinks and amazing food! We will be regulars here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 6
    },
    "photos": [],
    "user_id": "MiIv9Jxo_pHgGU2lrVFudw"
  },
  "ib26fdMF61nLawnC0yRTWA": {
    "date": "2/28/2018",
    "text": "My husband and I visited this restaurant during Happy Hour on National Margarita Day and, though we're not big taqueria fans, we were pleasantly surprised. The place has a sleek, modern decor and an upscale vibe. My husband ordered the Grand Cru margarita and I had the Strawberry Basil margarita.  Because of National Margarita Day, both drinks were $5, normally they go for $10 and $9 respectively. The drinks were different than any margarita we've ever had, but both were excellent. We also ordered the chips and salsa trio, the chips were served in a brown paper bag and tasted like they had been freshly made - delicious!  We opted for a few different types of tacos, I ordered off the Tacos de la Calle (street taco) menu and had the Pork Belly Taco and the Korean Fried Chicken Taco. My husband also had the Korean Fried Chicken Taco along with the Tempura Avocado Taco as well as the Beef Taco off the Tacos Crujientes (crunchy tacos) menu. Far and away my favorite was the Korean Fried Chicken, loved that combination of Asian spices in a street taco format.  My husband's favorite was the crunchy Beef Taco, the beef was perfectly seasoned and extremely tasty.  We'll definitely be visiting this restaurant whenever we're in the neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gbQN7vr_caG_A1ugSmGhWg"
  },
  "pkNP8AMXE9PX95GpXdwNWA": {
    "date": "11/9/2016",
    "text": "Awesome new Arcadia spot! Best teq and whiskey menu around. Tried almost all the tacos and they rocked!! Worth checking it out... casual bar, highend tequila and whiskey and simply great tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 11,
      "cool": 7
    },
    "photos": [],
    "user_id": "uqjFxRw7sPCczWEK_5QSzg"
  },
  "x4CjUhvIsuzeiopEPVWpTw": {
    "date": "4/26/2019",
    "text": "The tacos here are assembled with pride, and provide a variety of unique flavors and textures. The house margarita is one of the best in town. Have yet to consume a taco here that was average.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "A_QGbAK9E_3JPn_dtw1N0A"
  },
  "4k2ckmfvQY07XOBA-FzsJw": {
    "date": "11/30/2018",
    "text": "This place doesn't try to do it all, but what they do, is done well.   The octopus starter with black beans was very tender and flavorful.   In a town overrun with mediocre tacos, I like the modern twist and quality of these tacos. The CRUjiente pork taco was juicy and had the perfect amount of kick. I also enjoyed the melt in your mouth wagyu beef street taco served on a blue corn tortilla with a creamy horseradish sauce. My friend raved about the Korean fried chicken street taco.   We were there around 7:45 on a Friday night and I used the Yelp waitlist app and we were seated right away. The place was packed and the server was still very friendly and attentive. She even brought a cute little deep fried carrot cake with goat cheese cream and candied walnut taco as my birthday dessert.   The owner even stopped by to chat and wished me a happy birthday, a nice personal touch!  Our only issue was being seated by a table of 10'ish that was so obnoxiously loud we couldn't hear ourselves talk at times. Note to self, sit towards the front of the restaurant, it's quieter.  I can't wait to come back to try something else on the menu!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "hyJiSA9B91qAzRXvMus62A"
  },
  "2bzjVgijuLWa_tUh0OkTPQ": {
    "date": "11/17/2018",
    "text": "Excellent spot for happy hour, or even a nice dinner.  Way goo tacos a must!   Not to mention the beautiful women who may be enjoying a cocktail or two",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zp59Aarg0k3MyRm2CRAjJg"
  },
  "5pyUQvjAes0b8zwxt5s6KQ": {
    "date": "12/16/2017",
    "text": "Ranked as the best tacos in 2017 for the State of Arizona, I was super excited when my friend took me here during my visit. When we drove up, it was dark and we thought it was closed, but it was open!  We came here right at the start of reverse happy hour at 9pm so we were pretty stoked to get a deal.  I ordered the mezcal margarita, the pork belly taco (soft taco) and the lamb crujiente taco (crunchy taco).   The mezcal on the margarita was light, so I barely got a hint of it unfortunately. It was not on happy hour so I should have ordered one on happy hour instead.   Personally, I'm not a fan of crunchy tacos and I wished I had ordered another soft taco instead. The taco was tasty and the lamb was moist but I was disappointed.   I really enjoyed my pork belly taco. The meat the flavorful and balanced out well with the tortilla. I didn't even need any salsas!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2oopnk6fYiLa8z3TKDQRRQ"
  },
  "JyDSaAtuWjlwRzALlgOpdw": {
    "date": "9/25/2018",
    "text": "The BEST tacos around.  YOU MUST get the pork belly tacos  But......make sure you go on a night that Nathaniel is working. He is the best!!! The female bartender can be.....well a bit rough and it can take a while to get served.  I have friends who refuse to go when she's working.  Owners are AWESOME!!!!!!   .",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "yQIk-HXNJl9CapZAeT4KtQ"
  },
  "2u7AOsmEMXD48DEa1xDt2Q": {
    "date": "10/4/2018",
    "text": "One of the most FLAVORFUL taco experiences I've had in Arizona! Taco prices are definitely a little pricier than most street tacos, but worth it for the experience. The staff was extremely polite and knowledgeable.  HECK YES: -Grand CRU Margarita: for those who do not like super fruity margs. This baby has the right hint of tequila mixed with orange and lime.  -Guacamole and chips: not just mashed avocados! The flavor hits with every bite.  -Green Chile chicken taco: the best chicken tacos I've had at a restaurant ever. No lie.  -Grilled summer squash taco: a vegetarian's dream. I could fill up on just these alone.  Also had a taco of the week that was incredibly flavorful, I just don't remember which one . Worth the ask though!!  An appetizer and three tacos was more than enough to fill us up. We will definitely be back to try the grilled street corn and more of the specialty drinks!!   DON'T:  Dessert taco (unless you use the 50% off Yelp coupon)... okay experience but nothing special.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "EXQHo3ucFehNDBwBVd1WJg"
  },
  "km9YIQtxlK7aulppUKomGw": {
    "date": "3/2/2018",
    "text": "5 stars for sure!   The restaurant itself was pretty small so it took a little time to get a high top but it didn't matter in the end because the food was delicious.   They have different happy hours every day! I went on Wednesday which meant happy hour all day! So I went with a margarita and some of the street tacos and the salsa flight to start.   The chips and salsa were really good and a good combination of mild to spicy.   For the tacos, I went with one crunchy beef, the short rib, and the fried chicken. I really ended up getting the crunchy just because it was in the name but I liked it and I really like the spicy sauce on top. The short rib was really good and the meat was flavorful. In the end, the Korean fried chicken was for sure my favorite! It won best taco and the taco fest in 2017 and it's clear to see why! From the mixture of sauces, bell peppers, to the perfectly crispy fried chicken, this is one of my all time favorite tacos.   I cant wait to go back... I'm probably going to get a whole lot more of the Korean fried chicken tacos...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "nbaeXaWbZF0kwyxEocHRWQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Crunchy beef, short rib, and Korean fried chicken tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nbaeXaWbZF0kwyxEocHRWQ/o.jpg"
      }
    ],
    "user_id": "WjPLEr26Y0nW_ZtCEymnDw"
  },
  "hjqLd-lS5QFjlhTeYov2Zg": {
    "date": "8/12/2019",
    "text": "My husband and I had a very disappointing experience this past Saturday.  It was a busy Saturday night and the restaurant was full and we were just trying to get a drink at the bar.  Both bartenders were busy so my husband asked an employee, (who ended up being the owner), if he could order some drinks.  The owner proceeded to tell him \"well, you can try\".  Come on...as a manager/owner of a restaurant, you should never tell a customer \"well, you can try\".  Your immediate reaction should be, yes of course, what can I get you.  He then proceeded to tell my husband we could try and get the bartenders attention or if a server came by, they could take our order.  Fortunately, an amazing server overheard and took our order and had to apologize on behalf of the owner for his response.  My husband did call the owner out on his comment and his response was \"well, we made it happen\"...which again, not ok.  The server made it happen-he had absolutely nothing to do with it.  I grew up in the restaurant business-my parents owned/managed restaurants for 30 years!  A restaurant should never make a customer feel as though they're not important enough just because it's busy.  I would think that a restaurant would want to make money, not refuse it.  We left shortly after as he was so incredibly rude.  I get it-you have good days and bad days, but your job is customer service and there was no such thing given to us by the owner but we are so grateful to the kind server.  To the owner-you should take some cues from her on how to treat customers.  We won't ever return to this restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DJ8Sy6rmJ0wfDGDD1yhJVQ"
  },
  "ecNtEHURZwCBMxOGJr3tJA": {
    "date": "3/22/2019",
    "text": "A friend who we were visiting is a regular here!  We absolutely loved the tacos!  We tried the crispy and the soft!  Both were very good!  We tried chicken , beef, lamb, duck and a fried chicken!  All were amazing !  Margaritas were good!  We will return next time we are there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "WQMzSFZBWJafxch2IDKozw"
  },
  "mntaLCjfQMLjQjR9QA-34Q": {
    "date": "2/18/2018",
    "text": "Here's the thing with CRUjiente, do not go if you're wanting authentic Mexican street tacos. This isn't the place for that, if you're looking for more of a tapas experience then it's great. CRUjiente's specialty tacos are fantastic, I've tried many different ones and the standouts are their Wagyu and Korean Fried chicken. I find that their traditional tacos are pretty basic and not a good value, but if you stick with their specialty tacos you will be much more satisfied. Their guacamole is delicious too and comes with an ample amount of chips which are served in a paper bag to stay warm. I also really enjoy their margaritas which have fresh ingredients, no fake stuff. They also have a great beer selection on tap.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "5KqN_fBjU9mFUgllXG8aow",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Seared Shrimp, taco of the week, Green Chile Chicken &amp;amp; Korean Fried Chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5KqN_fBjU9mFUgllXG8aow/o.jpg"
      },
      {
        "img_id": "8amnRgDSrBOniGnZ4PxCEg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Texas Wagyu Cap Steak &amp;amp; ahi tuna",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8amnRgDSrBOniGnZ4PxCEg/o.jpg"
      }
    ],
    "user_id": "QG9ZJatKSWj5p5VrW3cfMA"
  },
  "VX-SB-truToN-qoMCiD2oQ": {
    "date": "7/3/2019",
    "text": "AMAZING. Not your typical taco joint but if you want delicious tacos and a satisfying meal, this is the place. I have been there a few times and have ordered almost every one of the tacos on the menu and have never been disappointed. Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xy0P5pCEIbVaN6oLcBsS-g"
  },
  "b7RP8Rj8yDyNDzNE58opZg": {
    "date": "3/29/2019",
    "text": "Had an amazing night that started out with the octopus appetizer that was savory, spicy and tender. The crunchy lamb taco was delicious and the mushroom taco was devoured by my wife. This is a great local spot that I highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZNW5_diGP_t6qUdcyp_gMA"
  },
  "-8yLTGgwjZikuWmw1r8VjA": {
    "date": "1/27/2018",
    "text": "Went to have some amazing tacos tonight.  The Korean chicken is a definite fav. Enjoy several great beers. A Special thanks to Jason... that Casade Sang Noir sour was outstanding!   I have to say we enjoy many nights out a week and Crujenta has a great thing going there. Location & Ambience, award winning  food, and great service.   We will be back soon. Thanks again for spending your valuable time talking beer with us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "b50Ik6fOQAB8LVbuOgDvlw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/b50Ik6fOQAB8LVbuOgDvlw/o.jpg"
      },
      {
        "img_id": "RyaGYpSKZqkoR8PjFTVXEw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RyaGYpSKZqkoR8PjFTVXEw/o.jpg"
      },
      {
        "img_id": "8jCL2oh_zmFK7tmrLSTc1Q",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8jCL2oh_zmFK7tmrLSTc1Q/o.jpg"
      }
    ],
    "user_id": "FPpXNxqy9Gl2UxnZAQHVVw"
  },
  "9vHsPdfDk_JPJHOUkRm8jA": {
    "date": "1/13/2017",
    "text": "After briefly scanning their pictures and skimming the menu, I was a bit skeptical about visiting CRUjiente Tacos. In fact, in many of my reviews, I often make jokes about the whole naivety of people that blindly pay 4-5 dollars for street tacos that are no better than what you can obtain from a reputable taco truck.  But going into CRU, one must realize, this isn't really traditional Mexican tacos - nor are they trying to be. The focus is on chef-driven creations. Some unique, some traditional, but all consistently executed to the highest level possible. And over the course of the last year, my girlfriend and I have become very big fans of what they're doing here.  Taco recommendations are tricky, because while I've not necessarily loved every taco that I've tried here, poor quality is never the culprit. Virtually everything is made well, it's just a matter of personal preference. My favorite is the pork belly, while the 36-hour short rib and Korean fried chicken are ones that I feel everyone should try at least once. All tacos seem to thrive on their simplicity, using just the right amount of ingredients to create balance, where nothing is too overpowering.  They offer a single dessert (bunuelos). It's fine, although I wish they had more options, as I have a feeling the chef could really do some amazing things on the dessert end if they chose to do so. Hell, even their more traditional offerings like guacamole and cheese quesadillas have become staples during our visits. More importantly, the quality is always consistent, which is more uncommon than one would assume in the Phoenix dining scene.  Parking is a total pain, which isn't necessarily their fault. Unfortunately, there are many instances where there is absolutely no parking available in the entire plaza whatsoever, forcing you to either fight for spaces or park across the street and jaywalk across Camelback.    Despite my praises, I will maintain that the tacos aren't really for everyone. If you eat a lot (and drink even more), you'll rack up a massive bill pretty quickly. These ain't cheap. With this warning aside, I really enjoy the process of experimentation with chef-driven creations - which is what this place is all about. Sometimes, just being given a handful of bare-bones tacos to cover at the free-for-all salsa bar gets boring. It's nice to have a great alternative like this available. As a result, it has quickly become a favorite of ours during the last year. And the more I go here, the more I like them.  Highest recommendation!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 13,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "IqRhS7YzsyLq0W4BeVXzJQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Taco of the Week: Chicken, Chicharron, Pico &amp;amp; Goat Cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IqRhS7YzsyLq0W4BeVXzJQ/o.jpg"
      },
      {
        "img_id": "B79dgZoksqrG43N_-ye30g",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/B79dgZoksqrG43N_-ye30g/o.jpg"
      },
      {
        "img_id": "u4UADO--TQqACONHhwlH0w",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u4UADO--TQqACONHhwlH0w/o.jpg"
      }
    ],
    "user_id": "TCPLaprJm4FFei2DkW6K6g"
  },
  "gcPh3k4YXoWBwJobO8_k6Q": {
    "date": "1/28/2019",
    "text": "Loved all the dishes we tried! Def going back and bringing friends! Love the atmosphere and style of the place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "gWw6xHh3beISBeOodwPJUg"
  },
  "DFU1GDLCmbpC2a-zgfoagw": {
    "date": "3/3/2018",
    "text": "I have been to CRUjiente a couple of times now! It's a great taco restaurant with an upscale and modern vibe! They have an extensively tequila list but I usually stick with the house margarita, which is $5 on happy hour! The beef CRUjiente taco is my favorite! In fact last time I was here, I had to order two! The guac, salsas, and chips are delicious, but I wish the chips were not served in a greasy paper bag. It's not classy and it doesn't fit in the atmosphere of the restaurant. The prices can be a little high for the portion sizes of their tacos, but they do a lot of deals. For example, Wednesday is all night happy hour!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U30MueFijfpUGbW39c1Arw"
  },
  "av3rXMogIlT91jVMNx8i1w": {
    "date": "2/18/2019",
    "text": "We love this place!!! Best tacos for miles. I would do just about anything for their pork belly taco. Even the kids cheese quesadilla is the best quesadilla ever.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IKmJzb67sLsaKa8PnCdl1w"
  },
  "1w45iC7skeYHm5oduq-CVQ": {
    "date": "9/29/2018",
    "text": "Chips made in house with salsa.  Tacos here are creative but lacking in flavor.  No sauces came with the tacos and the signature beef taco was bland.  The fish taco was probably the best out of what we ordered but that's personal preference.  The cost didn't match the flavor overall.  Recommend for margaritas but wouldn't recommend for food.  Would possibly go back for the ceviche.  Restaurant was very clean and ambience and service were what boosted my rating to 4 stars but based on flavor only, it's a 3.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UUvaNFnLiDt0vS6Wp8GAmA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UUvaNFnLiDt0vS6Wp8GAmA/o.jpg"
      },
      {
        "img_id": "G0lA05wN-LKspzfNRuNGrw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G0lA05wN-LKspzfNRuNGrw/o.jpg"
      },
      {
        "img_id": "FAwluZ5ftHuZKQ91Yyag5A",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FAwluZ5ftHuZKQ91Yyag5A/o.jpg"
      }
    ],
    "user_id": "44UmNRJOMrKPMcvYhz1DRQ"
  },
  "fdUA0SNVTv6II73ODK_jnw": {
    "date": "6/8/2019",
    "text": "Best tacos ever.  Great service.  Highlights were the Korean fried chicken taco, grilled street corn and wagyu taco.  Will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qHTXznaNEopHZvo2q0gpbA"
  },
  "uGoF6QIFgVKi4IxzqYCSoA": {
    "date": "11/18/2016",
    "text": "Brand new taco joint in Arcadia, and it is definitely worth checking out!    Let's start with the food/drinks: we sampled the ceviche appetizer, and 3 different tacos.  Every dish was super tasty!  The ceviche was nice and light and came with warm chips, and the tacos (blue crab, korean friend chicken, and 36 hour short rib) were all sensational!!  If you are willing to try something a little different, please please PLEASE try the korean friend chicken: the chili paste on this taco is out of this world good.  For the drinks, the 4 that we sampled were all delicious (2 different margaritas, and a fresh watermelon/vodka cocktail) however they were a bit light-handed on the spirits.  Just a splash more of alcohol would put them over the edge into special-land ;)  I was also super please with the interior decor.  This place used to be the burger joint The Grind, and the interior updates still have cool vibe The Grind had, but with a Mexican street, open feel.  They also opened up the wall to be one giant window, so the beautiful Arizona breeze made it's way through the whole restaurant.  And one more thing: the service we had was awesome!  Our server was very attentive and gave us great food and drink recommendations, and the owner, Jason, was incredibly friendly and informative.  After chatting with us a bit about the concept, chef collaboration, and finding the perfect place to open, he sent us a dessert that was smack-you-in-the-face tasty! I don't remember what it was called, but it was a Mexican chocolate moose with fresh strawberries.  Totally unique, light and delicious.  If you're in the mood for tacos, definitely come and check out this new neighborhood joint!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 16,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "5W8-n2ITvue7_J32TEB2zg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Ceviche",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5W8-n2ITvue7_J32TEB2zg/o.jpg"
      },
      {
        "img_id": "xfT-xOzEKRSu1xvI5XwIxw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Tacos from the left: blue crab, Korean fried chicken, and short rib. Would order all 3 again",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xfT-xOzEKRSu1xvI5XwIxw/o.jpg"
      }
    ],
    "user_id": "43zyz08tPXuHkhxMavXG0A"
  },
  "6o80B0hUTEcBZiPkVXhRFA": {
    "date": "3/2/2018",
    "text": "Amazing tacos! My favorite are the tempura avocados! The taco of the week was a sweet potato.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VkeTzXEJJ-DwSr1YFD3zng",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VkeTzXEJJ-DwSr1YFD3zng/o.jpg"
      }
    ],
    "user_id": "WqJtrH5cq-rkoQus8KVK9A"
  },
  "zmQoLPJIAmZX1imUxkMi-g": {
    "date": "10/19/2017",
    "text": "There's tacos, then there's TACOS!  If you like hard shell tacos, this is the best I have ever had!  They have beef, lamb and chicken, plus other soft shell options.  Happy Hour is a great deal and service is great!  If you haven't been here, why not!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "pVnhhT-Jgq5SvXhJwq06Pw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Lamb on left, beef on right. Incredible!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pVnhhT-Jgq5SvXhJwq06Pw/o.jpg"
      }
    ],
    "user_id": "9z9-qdLBeV3xI0KFzldoNQ"
  },
  "8x0TZ0YO4uMJkVQKKu1eLA": {
    "date": "7/25/2018",
    "text": "Wow! Not tacos in the traditional sense.  This is a whole new spin that leaves you wanting more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ayqm3ytdLkuAYERa15nN9A"
  },
  "0aYp_j0ESkyZrQm9yrGRzw": {
    "date": "12/18/2017",
    "text": "Went here for happy hour on Saturday. Place was pretty much dead outside of maybe 5ish other parties. Ordered 3 tacos, the pork belly, fried chicken, and wagyu steak. Wife got one of the shrimp tacos  I enjoyed the Pork belly the most, the steak was pretty good. Not a huge fan of the fried chicken - Korean sauce tasted extremely chalky. additionally, the portion of horseradish on the steak was out of control. Wife absolutely hated the shrimp taco.  Additionally got a whiskey cocktail, wife got a marg. Drinks were not bad, nothing spectacular.  Honestly, I don't even know why I'm rating this a 4. It wasn't bad, it wasn't great - I probably wouldn't go again. But I feel like 3 stars isn't appropriate.  TTW has exponentially better tacos and drinks. Will stick to that.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "a_5KUo01DJ9lSp4wyBKd8Q"
  },
  "8mheB4X-DP6DP3bHtc179A": {
    "date": "12/20/2016",
    "text": "AMAZING....the tacos here are great! My fiance and I tried this new restaurant in Arcadia which is right around the corner from our house. We were more than surprised how great the tacos were and how good the jalapeno margarita was.   We tried the blue crab taco, Korean fried chicken taco, duck taco, steak taco. They all had excellent flavor and spice which was well worth the experience.   We are currently telling all our friends that live in the neighborhood and we will definitely be back soon. My fiance is just happy she found a place that can produce an unsweet margarita with spice!   The service was on par as well. Noor our server was knowledgeable about the food and drinks. She was friendly and added to our great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ew9ah6TT65yt3YpplHabow",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Must try all different kinds of tacos. They are all so good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ew9ah6TT65yt3YpplHabow/o.jpg"
      },
      {
        "img_id": "zx_0M2pCgTWyqnFhPUPQYw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Amazing spicy jalapeño margarita",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zx_0M2pCgTWyqnFhPUPQYw/o.jpg"
      }
    ],
    "user_id": "6C8LIM2PPn4n-JEaaiohcA"
  },
  "cdnhx43iW4V1I-motZ09JA": {
    "date": "3/9/2019",
    "text": "Came here two days in a row! Love the food and the beers on tap. The guacamole and the queso are amazing. Working my way down the tacos list as well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cBuW2glLP1ARhnTBRqZ7ow"
  },
  "Cz4PU8pQaQXsUgr3jAekSQ": {
    "date": "2/17/2019",
    "text": "First the good things. The ambiance is nice and cozy and the pork belly taco was pretty good.  I actually hate reviews based on service, but this one is an exception.  We arrived around 8 and was seated at 815.  It was somewhat full, but no wait by the time we were seated. I fell for the tiny lobster street taco with two pieces of lobster for $15.50, because the waitress said it was amazing! It was not! The flavor was OK, but the lobster was extremely chewy and definitely not worth $15.50.  We ordered the octopus appetizer, not bad, not good, nothing exciting. The octopus arrived pretty quickly and then it was 45 minutes before our tacos arrived. No one stopped by the table to see how we were doing. The manager with the iPad walked by our table at least six or seven times talking to customers he knew, and never once mentioned that we had no food on the table for 45 minutes. After the food arrived, the waitress stopped by to see how things were. I couldn't help myself, so I said does the food usually take this long and she went on with some explanation about getting behind because they had large parties. I get it... Stop by the table of the people sitting there with no food for 45 minutes and say something! Sometimes it actually is about customer service! It was our first time, and we won't be back, because the experience was so bad!  I hope this review at least catches the attention of the owner, so they can work a little on Customer service... It does go along way!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WsP8QHk2BP7x-2wMwKbDeg"
  },
  "40XgpO7r4iESKXWEYywwig": {
    "date": "3/5/2019",
    "text": "This is not your Tex Mex or commercial chain Mexican food. This is serious quality and a creative culinary delight! With a great tequila and decent beer selection. Try the Korean taco and the octopus!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d9dJKkQNg8UxlBSmXq3AmA"
  },
  "xtvSTj2_Z-VUjBiU9BhTLw": {
    "date": "5/14/2018",
    "text": "We rarely veer off of our normal taco loyalties but we decided to try something new tonight. There were no regrets in that decision! Our waiter Shannon, was amazing. I truly hope crujiente reads this and gives her some tacos and one of their strongly poured margaritas on the house! Check their nightly features as Monday's and Wednesday's they have killer deals and make it one of the the best dollar for dollar margaritas and food deals around. However despite these deals their food quality remains a cut above your average taco restaurant while entertaining fun and delicious options such as wagyu beef taco with horseradish and a Korean fried chicken option. I recommend you stop in here and experience a nice mix of ambiance, food, service, and quality libations at this Arcadia taco standout.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Y6xZ8lzKjb4hKGYAgP_QaA"
  },
  "_s9mk3G7u3KMijjFSInpog": {
    "date": "10/27/2018",
    "text": "Yes please....amazing!!!  This place is the bomb...go here, you won't be disappointed!  Definitely some of the best tacos I've had in the Phoenix area....I've had a lot of tacos.  Started with the ceviche, which was really good.  Tried several tacos and they were all amazing!  The pork belly and beef were probably the favorites, although it is really hard to narrow it down to a favorite as they were all so very good and unique.  Will definitely be back time and time again...can't wait for my next round of tacos!  The margaritas were very good as well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "-iuUaoQXVoXJZNfEUKsQHw"
  },
  "Xe9spHGFKIgtIb9g5w_Jmg": {
    "date": "12/14/2017",
    "text": "Not what we were expecting. It's a small place with a loud upscale bar environment. Overall an odd combination to be very into the gourmet food scene yet the restaurant looks like a bar. When we first walked in we just stood there awkwardly until the bartender noticed and called a waitress over to seat us. The drinks are reasonably priced, I got a margarita for $8. There are lots of tacos to choose from. I went with fish tacos and my husband got fried chicken, pork, and the special of the week, oyster tacos. Man these tacos are small. Our waitress said they are legit Mexican street taco size and I haven't ordered any street tacos from Mexico before, but I have ordered from legit Mexican restaurants in the valley and never seen such a small taco. And most tacos are $5 each and if you're hungry you'll want 3-4 so this is not a cheap taco meal. Anyways the size isn't that important, the tacos were just okay. I enjoyed my fish taco, but I've had better. It didn't have a lot of flavor or spices. You can tell all the tacos are very freshly made and high quality but if the flavors isn't there, that doesn't matter. My husband was not impressed with any of his 3 tacos. His favorite was the crunchy pork, he said the other two were just overly spicy. Not a good place for a date night because it was loud and all of the tables are high tops.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "saepNpskREN3SIVGvGaYgw"
  },
  "OO1NRwqXBH65XkdIjC2y_g": {
    "date": "5/17/2018",
    "text": "Wow what a rip off!! 5.00 and up tacos that are so small you wished you'd gone to Taco Bell!! So mad I spent 30.00 on two tacos and a quesadilla for kids!! Not goin back!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "--Nnm_506G_p8MxAOQna5w"
  },
  "seATY4og68orjlkIxgjWug": {
    "date": "9/13/2017",
    "text": "Didn't capture a photo of all the food but the Lengua taco, guacamole, and queso are also not to be missed. Have a mezcal margarita or a tasty glass of Spanish wine. Great atmosphere and super friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "xy_jMI3k5-wc8PvkguOcag",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Waygu beef cap taco and seared shrimp taco. So damn tasty!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xy_jMI3k5-wc8PvkguOcag/o.jpg"
      }
    ],
    "user_id": "RDbCO9co-BYzNdovulEQhA"
  },
  "KJXwHubOUhUd1tddh13MFw": {
    "date": "6/21/2018",
    "text": "I am the laziest driver in the world and dont get in my car for anything......except Crujiente Tacos!! I have taken my family several times, my extended family and have enjoyed ladies night out at Cru. I have never had anything but the best experience at Crujiente tacos!! YUM YUM",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1ZTzpP6zKIJ3vl3iQ2rs0A"
  },
  "RIFEzGszmGgH9SksX6NM7Q": {
    "date": "8/11/2017",
    "text": "After thinking about this review it is more like a 4.5 so I will round up and give this place a 5 star review.  Pretty busy place at around 6:30pm.  Grabbed a seat a the bar and started out with a bourbon - excellent selection and prices.  They have a diverse taco selection and I opted for the Korean fried chicken taco, duck taco with mole, and the weekly special which was the green chicken chile taco.  Also got some grilled corn.  The best taco was the green chili one.  Grilled corn was good but a little spicy.  I thought the portions/price were reasonable given the quality of taco you were getting.  Food was $20 but if you  look at just the tacos it was $13.  Will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "1LnH0YqsKz8z92DGT6hWow",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1LnH0YqsKz8z92DGT6hWow/o.jpg"
      },
      {
        "img_id": "FikGjpW7AJTfYQ0RGDwRRw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FikGjpW7AJTfYQ0RGDwRRw/o.jpg"
      },
      {
        "img_id": "8TAk5lJkhmJfpHkQp0zb5g",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8TAk5lJkhmJfpHkQp0zb5g/o.jpg"
      }
    ],
    "user_id": "GE7DgP1uFPEBCr81NEWMjg"
  },
  "zHYzS91984s4m674mgjrPw": {
    "date": "5/6/2018",
    "text": "Amazing taco selection. I love the Korean fried chicken waffle! Don't think you can go wrong here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "LpDg0iuYQrm8kHbyxMrilQ"
  },
  "fRverCChQ4L3bkfLmGuE3w": {
    "date": "11/8/2018",
    "text": "This place is ridiculously good. I have never had a taco here I didn't like. The weekly tacos are always a great choice! The pork belly taco is a must as well as the Korean fried chicken taco. The chips and guacamole are also amazing! Service is always excellent. This place never fails to impress. This is by far my favorite taco place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "m8d05DABQaBbVz-IgzLt3w"
  },
  "HPA2PFs1VisU-APkPpErkg": {
    "date": "12/28/2017",
    "text": "Pretty good taco, lols very elegant, and taste pretty good. Slightly small in size, but kind of expected. Tasty appetizer, tacos and desert. Great choice of wine and beer. Will definitely come back",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t1Jfh-VX8EZuw71L7bNzgw"
  },
  "yfIIfkFJTsP12Fv7nNbIjw": {
    "date": "5/22/2018",
    "text": "Love the atmosphere....however, I ordered the ahi tuna taco.  Caution: it was the smallest taco I have ever seen.  Much smaller than their normally small tacos.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3s8ZZIdWZZ3qqBAsi305Iw"
  },
  "y_0qCmg5mOSTYaosq6TQdg": {
    "date": "11/30/2018",
    "text": "We come here at least once per week and the food is always great and service consistently pleasant. What a great neighborhood spot",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IE9FlcEs5GlvFHfElXZ62A"
  },
  "DW4tHHWk2IS6I1cibYjSdw": {
    "date": "7/19/2019",
    "text": "First time, left to right got the Korean fried chicken taco, pork belly, crunchy lamb. All three tasted great with unique qualities. Also, had their Arcadia Margarita (spicy) marg which had a kick but was super good. Priced well also, a lot of happy hour options. Definitely will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HBlYvl7zF_fxbL3joDT3jg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Korean Fried Chicken, Pork Belly, and crunchy lamb.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HBlYvl7zF_fxbL3joDT3jg/o.jpg"
      }
    ],
    "user_id": "pF4gp1W6YyoWhvipjDLt3A"
  },
  "fVrzl6cewaFiMuPeRgBrCQ": {
    "date": "7/18/2019",
    "text": "OMG!  Went here last night for a birthday dinner.  All I can say is WOW, and I'm glad they are so close to me! The food is amazing, creative, well presented and delicious!  Nothing run of the mill about these Tacos!!  I wish I knew our waitress's name, as she was fantastic.  She suggested dishes, described everything, answered every question - and she was so busy!  I ended up buying gift certificates for friends and relatives!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hpkshb4bM73KF7wuvPBC8Q"
  },
  "zLamaNRzdgPdO0tHhnDTrw": {
    "date": "7/11/2019",
    "text": "This is a trendy type hipster place. I went there about a month ago with my parents. I'm in my 50s and they are in their early 80s so we were definitely the oldest people there. You'd think we'd be uncomfortable and feel out of place but we didn't. We actually loved it! Wait staff was great. It was noisy but it's the noise of a busy restaurant. The servings were just right and the flavor of the food/spice combinations were perfect. Would go again the next time I'm in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dMNt8Fv49JeYCfdzP1JA0g"
  },
  "ljP29ES30vSBDt6Rj7ZkeA": {
    "date": "12/14/2017",
    "text": "I popped in here with my bestie on Taco Tuesday and am so happy that I FINALLY made it in! It has been on my bookmark list for a while now and it is in the neighborhood so I really don't have a good excuse as to why it took me so long to come!   On Tuesdays, their happy hour taco prices go all day which is great! I do think that their tacos are a little pricey for the size normally, but they are unique and delicious regardless. Therefore, Taco Tuesday is a great time to come.  We ordered the guac, salsa, and chips to start and they were all so tasty. Chips and salsa are not complimentary here but that is ok! If you're a salsa addict like me, you'll get them regardless. And their regular salsa was fresh and flavorful!   For tacos, I ordered their CRUjiente beef which is in a crispy shell and definitely bigger than their normal tacos. The shredded beef was delicious!  Next, I ordered their shrimp taco which has a curry sauce and pickled vegetables on it. SO different but I really liked it! It came with one large shrimp, not multiple small shrimps which i've never had before. Way to stay unique!   For my third taco, I got the crispy Korean chicken taco and THIS WAS MY FAVORITE. Yup, I saved the best for last. If you come here, you must get it. It is a flavor explosion in your mouth!   All in all, I would definitely come back here for happy hour! They have great drink specials and the food is decently priced at happy hour too. I just think it is a tad on the pricey side for tacos if you were to just come normally.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 22,
      "cool": 14
    },
    "photos": [],
    "user_id": "e6iCOIhtupBCiw-VwBvJ4A"
  },
  "ZhLEBpZBaSa2UNOLsVSl2A": {
    "date": "3/10/2019",
    "text": "We had a subpar experience here yesterday. We went do happy hour which is every day 3-6. Sounded really great! When we got there, not one person acknowledged us. There was no hostess. There were plenty of waitresses buzzing around, and two bartenders. One of which just kept looking at us, but never said hello or offered  directions on what we should be doing.   Finally we just walked to a big long table in the back, and as soon as we were going to sit down a waitress tells us that it is reserved for a party later. I ask her where we should sit, she said we can go put our names in the iPad up front or sit at the bar. So we sit at the bar to wait for a table.   Bartender does come over, but is not friendly at all. We order a margarita (which is by far the best thing about dining here). And order some tacos. We came here because the menu says they use \"organic non-gmo blue corn tortillas\". So we order up since I'm gluten free.  While we wait for the tacos, a few tables open up and are immediately snatched by people hovering. We still get no text that a table is ready. When our tacos come out, one is on blue corn and the other is on a white tortilla. I ask the bartender and he said it's a flour tortilla. Wouldn't you take the time to say this taco comes on a flour tortilla instead of our usual corn tortilla, since he did explain about the blue corn tortilla when we were ordering?  The tacos were okay. Some were better than the others. But the lack of service and mediocre atmosphere, is enough to have us pass on this next time. Also, we got a text when we were leaving that our table was ready.   Pass if you like to dine somewhere with friendly attentive service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "K1hCONaIEcqFptN9AwMSkQ"
  },
  "WkihA-b-53kYDOaVbyZSXA": {
    "date": "1/21/2018",
    "text": "Some of the best tacos I've had outside the great state of Texas. They are small, but delicious! Their green chile chicken taco is to die for - so so flavorful with the seasoned chicken and onions. I LOVED their tempura avocado taco as well - very smooth - and it countered the spice in the green chile taco well.   Their tortillas are house made!!!! That's also hard to come by. We got their chips with guacamole and house salsa. The chips were fresh, thin, and salted to perfection. The guacamole had a kick to it for sure and so did the house salsa. All excellent.   They have some great cocktails, all of which they will happily make non-alcoholic if you ask. I tried a drink that was called \" ___\" Kid (sorry! Forgot what it was called and its not on the online menu) and it was FANTASTIC!   If you cant handle spicy food, let your waiter or waitress know. This place does not tone anything down for you at baseline, if you don't ask - it is 100% authentic.   The service was amazing as well! We loved our waitress who was knowledgeable, kind, and forthcoming with recommendations on what to do in the area!   It is located in a random block with a few other shops, away from the busier areas of Phoenix. It was not crowded when we went on a Saturday evening and we didn't need a reservation! So if you don't have the time for a long wait for delicious tacos, this is the place to go!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "LmoYySdaAO7XBEajSAytGA"
  },
  "BlcmAQSeXAXnhXxCpew-Qg": {
    "date": "3/8/2019",
    "text": "Top drawer, gourmet tacos. The place has a nice vibe. Loved the crispy lamb taco. Excellent signature margaritas.  Pretty good service. Go early. It gets very busy even on a weeknight.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "W7nxCUJo7tWNTaOlHIZ58w"
  },
  "bXphxHgTvNor_rCSqz9H4g": {
    "date": "6/23/2019",
    "text": "Came here for a work dinner and the chicken tacos were amazing. Really good atmosphere overall.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V18qUVndtthmgKGiO0vKDQ"
  },
  "CNqmybHTtwpM_9npMZilKQ": {
    "date": "7/16/2018",
    "text": "Delicious tacos!! Yum!! I especially loved the fried tacos but they were all delicious, especially the pork tacos!  The bartender made an awesome margarita for me!! Will definitely come back for more!   Very cute and classy decor. Beautiful bar. Great comfy seating. Even the bathroom doors have fun art on it!   They have an awesome happy hour too!!   Will definitely get more tacos and margaritas next visit, but also want to try the cheese and chorizo, guacamole and Mexican corn!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XpCSn8Xhi3EGpPaK3CrL_A",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XpCSn8Xhi3EGpPaK3CrL_A/o.jpg"
      },
      {
        "img_id": "14m-v6gY-uoS3RzYCk6T1A",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/14m-v6gY-uoS3RzYCk6T1A/o.jpg"
      },
      {
        "img_id": "Bng8SNp5hBKMftEGx6Z2eA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Bng8SNp5hBKMftEGx6Z2eA/o.jpg"
      }
    ],
    "user_id": "FQUe6VPj-uo85bktpjDYmQ"
  },
  "Vt29xpWWGTRTKo-hjZMMIQ": {
    "date": "1/23/2019",
    "text": "This is by far my favorite place to get tacos. These taco are absolutely amazing. The atmosphere is great and the service is superb!!! Even the owner stopped by my table to ask how me what I thought. This maybe my first time here but it is definitely not my last! I cannot wait to come back and try all the different types of tacos they have. Oh and let me talk about the margarita: it might be small but it packs a might punch! I.Am.In.Love. with this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "uX4l-OYGL6AJQPMiiJ5HWA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. From left to right: Korean Fried Chicken, Beef (or Lamb i forgot, sorry) and the Pork Belly",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uX4l-OYGL6AJQPMiiJ5HWA/o.jpg"
      }
    ],
    "user_id": "A5cqyk6_ADvWwLt4Vc5oPA"
  },
  "VOr_vPMSCCbZetvPe0agnA": {
    "date": "3/12/2019",
    "text": "The service was great, the decor was good, the drinks were average and over priced and the food was horribly over priced. I am very confused as to why anyone goes to dinner here... great service and nice people thou... food is no, no and no",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HCF1XgiB4SRIEkmyB52Fgw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Salsa for the chips.... they were terrible... salsa like this comes in big jugs at other places for free.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HCF1XgiB4SRIEkmyB52Fgw/o.jpg"
      },
      {
        "img_id": "PLN5096VK-K-fe_NJbmnUQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Dessert taco ... no go...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PLN5096VK-K-fe_NJbmnUQ/o.jpg"
      }
    ],
    "user_id": "fQEhKtIlA_XX7aOnDakBcw"
  },
  "_1-sudJlYwXjtLyPK95_lA": {
    "date": "9/13/2018",
    "text": "Steer clear of the duck taco. No Bueno!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9UWmnhMdGqEM_LfO5QEUGw"
  },
  "baZa4NfAcZ-QyozRM3C7bw": {
    "date": "5/25/2019",
    "text": "If you are looking for a True change in Mexican food.  You must try CRUjuente tacos. With choices like Green Chile Chicken, Texas Wagyu Cap Steak, Duck and Garlic Roasted Mushrooms. You can find the perfect Taco for your taste.  appetizer Charred Octopus, and Papas Fritas are a great place to start. Dont forget to try the Pasole Rojo one of the stars of this menu.  Margarita for ever taste hand made to order. Save room for the dessert taco tonight it was a blueberry lemon taco. this is a MUST TRY. The service is great and the kitchen is in point",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XvRZ7JIrdQEX2tFrhdZSiw"
  },
  "hMIlt3D7mAo3gamx1rvdBQ": {
    "date": "12/26/2018",
    "text": "I went to CRUjiente tacos by myself on a Thursday night because I didn't want to wait for a friend to go with me to try it. I'm a vegetarian and was excited to see that they had two savory taco options for vegetarians. Here is the breakdown of what I ordered: -Garlic Roasted Mushroom Tacos: This taco had a really delicious savory umami flavor. I've never had this type of a taco before so it was interesting to try. -Tempura Avocado Taco: Also really delicious, but more straightforward taco. I'm glad they have this as a second option for vegetarians to help keep it a bit more interesting. But if I'm being totally honest, I feel like I've had this taco before. -Arcadia Margarita: My favorite item of the night. Their margaritas are so fresh tasting and definitely worth a try. I will need to come back for happy hour to drink more margaritas! Their margaritas are definitely some of the best in the valley.  Service was pleasant, but nothing over the top. I do like the general upscale yet trendy casual vibe of the restaurant. I would definitely keep in mind that if you plan to eat here for a meal, you would probably need 3-6 tacos depending on how much you eat. And at $5-8 per taco, you will be spending anywhere from $20-60 just for food+tax+tip for one person. So if you aren't prepared to spend that much, I would recommend going for happy hour and making the tacos more of a snack. Also side note that Yelp says \"Latin American\" as the type of cuisine, but I would definitely say that it's more \"New American + tapas\" in case that matters to anybody.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "p2kLZuhvouCbe3jYPwKtig"
  },
  "FrA2QtBA0uzEP-JMJoYYhg": {
    "date": "5/8/2019",
    "text": "Best tacos in town!! Can't get enough! Have to eat here at least once a week!!! Crujiente Beef taco is my fave fave fave!!! Fresh fish taco....BOMB!!! Ceviche..... to die for!!!!! Chips and guac....YUM!!! Have to get it all!!! And if you're looking for a bomb michelada!!!!?!!!! This is your Jam!!!!!!!! Get it!! Best one you'll ever have!! Margaritas are top notch!!! Get one of those too!!! The staff is wonderful! Lauren and Rachel are always so sweet, warm, efficient, fast, and love the food as much as I do!!!! CHECK THIS PLACE OUT!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jNkTR0QvQIomwIvb_C8Q8Q"
  },
  "E2_S4Rgc3Acy4aW2AEVT6g": {
    "date": "7/27/2019",
    "text": "Great little restaurant...don't let the fact that it's stuck in a strip center fool you...this place has a really cool vibe and the food and drinks are amazing.  I would definitely recommend this place to any and everyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wajMko_5H2y1pRgFbY3K9A"
  },
  "FHLghZ9oqBz_gRdLRijnCA": {
    "date": "4/19/2019",
    "text": "Awesome tacos! Try it family style and order 2 of each. They're so amazing and fresh. Great service too. Happy hour is highly recommended",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "7WXnOhhCeHHF_EnbcVDH8Q"
  },
  "Q19rYjjKpLD-OEzxshbCRQ": {
    "date": "11/16/2018",
    "text": "Delicious tacos! Great vegetarian and gluten free options (avoid the chips and crunchy tacos if Celiac). Had their weekly taco, it was butternut squash. Highly recommend the shrimp taco!  Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "KtvS2sVpjxoV1_w8wZmO7A"
  },
  "yq_H-4UmRzdjaOWhswLtag": {
    "date": "4/16/2019",
    "text": "The BEST tacos I have ever had. Perfect cocktails, too. I only wish I didn't live 2,300 miles away.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "vo25QbCP4RTUcDYeZEDkKQ"
  },
  "2lDVE6HeOpMGvN7TFz_q0A": {
    "date": "7/24/2019",
    "text": "These tacos blew my mind! You really can't go wrong with any of them. My favorites were the shrimp, mushroom, and the crunchy lamb tacos! I couldn't stop ordering. Special shout out to the duck and pork belly tacos, and don't pass up dessert! I was on a diet but came here for a special occasion...let's just say that the tacos were 1000% worth the calories. The happy hour specials are amazing too, so there's really no reason NOT to come here!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_c6gaLfGVFjvU_HrdD8A4w"
  },
  "mxA-YKqwOgnYaGSWs-6lIg": {
    "date": "12/28/2017",
    "text": "Best Tacos, Drinks and atmosphere in the area. Try the salsa trio, you won't be disappointed",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "wGh0YMxOkJ7JKvWRRQPhzA"
  },
  "eyjy84xC_6V7bnI9I-zpuA": {
    "date": "11/15/2017",
    "text": "Absolutely no place else to go for your taco fix.  Far and away the best.  Beautiful build out, friendly, efficient staff and, in case I failed to mention, amazing tacos, ceviche, posole, salsa, beer and cocktails.  You will immediately abandon your other \"favorite\" taco place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "RzBAC76x6Cl0i3gHnBP2sg"
  },
  "17TapECNeonNgs3OT6GZlg": {
    "date": "11/17/2017",
    "text": "Everyone posts about the fantastic tacos... so I'm gonna post about the amazing spirits! The Cinnamon Margarita and the Cherry Sour are amazing thanks to the creativity of their bar manager Laura! We love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "NsS_8SNIXuX8p1ZYEj0QIg"
  },
  "oJmWX7br8ajEIpwh2dWQoA": {
    "date": "2/27/2017",
    "text": "Incredible tacos....don't miss the ceviche,  pork belly, Korean fried chicken  (unreal) and poke. Great service and a cocktail list that will keep you busy! Can come back over and over and have a different and amazing meal each time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "2-sqi8jVsjUm6AAvWPfN8A"
  },
  "pOTfEu7QD6TSlTwnPIjjFw": {
    "date": "12/13/2017",
    "text": "I have been stopping in once or twice a month now since they have opened. The tacos are absolutely amazing and the staff is always super friendly. I would recommend this spot to anyone looking for great food and a superb atmosphere! 5 stars and make sure you get the crunchy beef taco or the Korean fried chicken taco....so good!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "zfiae1K19rHKIl8MYv1QLw"
  },
  "UTjBcrS7rSMb6ebjY5amOQ": {
    "date": "12/30/2016",
    "text": "Simply astonishing. I came here expecting just another strip mall average to below average taco shop. This place is phenomenal. The crunchy beef taco is off the chart.  Ambience on point as well. Our server was gracious and so talkative.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "26087x8ysx3qLiGc6oibDw"
  },
  "Y9OhDYFaiHLPQDKEgroGUw": {
    "date": "1/28/2017",
    "text": "Awesome place! Our waitress was amazing and very friendly. The fried beef taco is out of this world. Nice beer selection as well. We will be going back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "-LHZAx3S5t6kdLhXvDHryA"
  },
  "EWt79cuL9pbYCNVqyerUKg": {
    "date": "11/26/2016",
    "text": "Blows Blanco out of the water!  Had the chorizo Queso with warm chips!  Ate every spec out of the cast iron pot. Had the crispy pork taco, Korean fried chicken taco and the blue crab taco. All three were yummy but I will crave that pork taco.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 1
    },
    "photos": [],
    "user_id": "zu_r9dycJzzHT_D2LOnHTA"
  },
  "EZ-VAaResduwcIHnIqc3ZQ": {
    "date": "12/3/2016",
    "text": "We stopped in for dinner last night after reading all of the amazing reviews on Yelp and were not disappointed!  We started with a beer and the Don't Drive and Thrive cocktail (so tasty!) and the queso.  We tried 6 different tacos, so we could sample most of the menu.  Here are the tacos we tried in order of preference: crab, NY Cedar River steak, crispy pork, fish, crispy beef and crispy lamb...honestly, all of them were amazing, so it was hard to even rank what we tasted.  I highly recommend tasting a mix of the regular and crunchy tacos...both are unique and flavorful.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "cMEtAiW60I5wE_vLfTxoJQ"
  },
  "pU4qyYSfv_70kWoOASwykw": {
    "date": "11/19/2016",
    "text": "Great spot: nice ambiance, great service, excellent food. We ordered 6 different types of tacos and loved everyone of them! My favs were the lamb, pork, fish and avocado tempura. Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 1
    },
    "photos": [],
    "user_id": "2HoYHTUjWfmY3vHruQlDhw"
  },
  "S3By-0T8wc3KlM8TVcni3A": {
    "date": "12/6/2016",
    "text": "Came here on a Tuesday night for the first time.  Although they didn't have any taco Tuesday specials and their tacos were a little pricey for the size, they did not disappoint!  We came in a little after 10 and even though their kitchen normally closes at 10, they were happy to take our food order.  Our server Lauren was really informative, and attentive.  And the tacos were delicious.  Favorite was the Korean fried chicken!  Also tried the grand CRU Margarita!  Yummy!  If I'm in the area and craving tacos, I'm coming back here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 2
    },
    "photos": [],
    "user_id": "GZ5-CTKGWDJqE8EXIOJyUg"
  },
  "PpHx5gUr18PzyZ-6c4047w": {
    "date": "10/10/2017",
    "text": "Staff is super friendly and tacos are amazing! I'd highly recommend the pork belly taco, ahi poke taco, and the Kaula pork taco (taco of the week). Margaritas are awesome as well! I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 7
    },
    "photos": [],
    "user_id": "f58e5EMExkzAd_9Xt5XyRg"
  },
  "frTgCty-r9eNjYtn4E4KIw": {
    "date": "12/2/2016",
    "text": "Get the 36 hour short rib taco. Authentic style dressing and the meat is phenomenal.  I had to order more. The bar is stacked for whisky and tequila lovers.  Salads need a little pick me up but who goes to a taco joint for salads? Only my wife. Silly goose.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 0
    },
    "photos": [],
    "user_id": "RE5JM95d_2CxvuO7u2MtXA"
  },
  "lHSrZRajxkLEWQ_AQlNyCw": {
    "date": "10/23/2017",
    "text": "Amazing beef tacos! The margaritas are good but sometimes are a little pulpy...but at least they are fresh and not from a mix. My only complaint is they are not open for lunch. Service has been friendly and the food is delicious",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "R212QvBa4l-eBkK5j3sbww"
  },
  "VDp6G6_HHWXFSxwjYhEDaA": {
    "date": "1/18/2018",
    "text": "Being named one of the best new restaurants in Phoenix area for 2017, I had very high expectations. Tacos were good but not great. They were very small in size and very pricey. Guacamole was very small and flavor was average. My husband and I had guacamole, lamb, avocado, beef short rib, fish, and Texas Wagyu tacos and two margaritas. For the total of the check and we had much, much better meals at many restaurant in the valley. Their concept remanded me a little of a great places in Chicago area called Bien Trucha and A Toda Madre except they will never share their success and endless lines waiting to get in over last ten years. Crujiete Tacos are simply overprices and not that great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9-hhIriVooUUsj3SB1ooEA"
  },
  "dMs10o9CjK1ia9GbYpKeDQ": {
    "date": "12/28/2017",
    "text": "Ok, nothing to write home about. Restaurant was pretty busy but service @ bar wasn't great.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3lUEQb9TIxOeAUtvgh7p8w"
  },
  "oVyrqBejiVzSNrItMA_cew": {
    "date": "1/21/2017",
    "text": "The girlfriend and I are always excited when a new taco place opens up because we really, really love tacos. However, Crujiente didn't really do it for us. Here the play by play: Drinks - expensive enough that we didn't get any Queso Fundido - like most of the meal, they went for something outside the traditional. The flavor was decent, with an unusual earthy taste. Unfortunately, the consistency was a bit too oily (and the oil felt a little old) Pork taco - by far the best food item we had. The shell was awesome, and the pork was very well marinated and moist. Everything here was on point.  Lengua Taco - dry, bland meat. I'm usually a lengua lover, but this one did nothing for me. Lamb - The super-sweet Birria sauce overpowered everything else. The flavor would have been pretty good, if they just laid off the sugar a bit. I love mole and don't mind sweet with my meat, but this was too much. Service- attentive, but oddly cold. Atmosphere- dark and swanky  Overall, we likely won't come back. With so many great taco places at pretty much every price point. This one just didn't stick out",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "opqc8_MO_yVuMbGvfoYJgg"
  },
  "WRmqPv0uHSGU9HfUSMSPuA": {
    "date": "3/3/2017",
    "text": "Delicious tiny expensive tacos! My only real complaint is that they do not do to go orders. Great food and service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WEOwFGIVr0f5dD9JtGOi8g"
  },
  "yolu6QlgA0o3PKhOtexNpg": {
    "date": "11/15/2016",
    "text": "So this place was fun but a little disappointing unfortunately. My husband and I had he Korean fried chicken, crispy beef, poke, and blue crab tacos. They were tiny!!! I was still hungry after several bags of chips and two tacos. Probably will not be back when there are better priced places in the area.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "qSpffgRcmwWy0ZK9mTKidQ"
  },
  "V5so7XtRxAYi4sMlvsZ_xw": {
    "date": "2/16/2017",
    "text": "Do you like inventive, spicy, delicious food?! get there. Everything was completely delicious, including fun cocktails, homemade chips, suuuuper fresh & good salsa/pico and I loved the guac (my companions were mixed on this one). Can't wait to come back and try it again. Great service, super friendly staff, excellent food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WzULGffVqOilClN-CEAJBg"
  },
  "Qjx1f3pSYKph14gDz_odng": {
    "date": "8/9/2017",
    "text": "The place is trendy and comfortable, service is good; food is very good. Love the avocado tempura tacos!  Friendly staff and the chef nailed the flavors, quality and presentation!  It's so beautiful you want to eat it, the fragrance of the food is so balanced",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "Oce9RryvQopBMvV3JZhfRQ"
  },
  "NfuDX6Rj6XkwosV4gStMKg": {
    "date": "8/11/2017",
    "text": "We love this place!  Great atmosphere, excellent food and drinks and super friendly and knowledgeable staff!  Morgan was working behind the bar both times we've been there and she is great!  We will be back Monday for $5 margaritas.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "8KnO7mx06Ql53fSSDC8XHQ"
  },
  "43NLVLq7VnKO9YWSEHNRSA": {
    "date": "12/28/2017",
    "text": "THIS IS MOST FUN AND EXCITING RESTAURANT I HAVE BEEN TO IN A LONG TIME!   It starts with very great Arcadia Margaritas and Hacienda de Arinzano; and some excellent happy hour wines. THE VARIETY OF MANY DIFFERENT TACOS IS EXCITING! We had Beef Tacos, Pork tacos, Lamb Tacos, Korean Fried Chicken Tacos, Tempura Avacado Tacos (extra special), Beef Short Rib Tacos, Green Chile Chicken Tacos (very special) Pork Chicharron VIP Tacos! (very special), Cruncy Beef Tacos, Ceviche Taco, Taco de la Semana.   AND there were five more I wanted; but, I was too full. Thes many Tacos make a dinner exciting, fun, and very different from your normal Mexican restaurant.   Our waiter was Lauren, who we wore out bring us many, many drinks and many, many, TACOS All Special and Wonderful!!!   It was special surprise to see Jason Morris come to our booth 36 to greet us.  Jason is the owner and Co Founder.   Try this exciting eating experience; and, you will not be disappointed. TIP:  Go early 4 pm to avoid crowds.   The Bar scene is also very exciting.  I talked with several people who love sitting at the Bar!!  sincerely,  Ed Altman,  Jr",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RSmteXAxCZOtWSbNIHUkcg"
  },
  "vA_JDcUlT5sSQhW9CeEkDg": {
    "date": "5/22/2017",
    "text": "We have dined at Crujiente a handful of times now and it does not disappoint! Service and especially the food are great. Our particular favorites are the Korean fried chicken taco and the crunchy lamb. Their Cru margarita is also delicious. Solid spot for happy hour and such a great addition to the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 7
    },
    "photos": [],
    "user_id": "2IN95j9tkqGVnbaOYdL7Sg"
  },
  "DIflooAOUHCqonCBiyuEiw": {
    "date": "6/3/2017",
    "text": "This place is an overlooked treasure. We thought we were going to be getting typical Mexican food, but it was anything but that. Instead we found a charming restaurant with nice ambiance, excellent service and a delightful menu. There was a wide selection of craft beers that made us happy but the best part of the evening was the tacos. Whether you felt like fish or steak or chicken, each taco was a culinary delight. Excellent sauces, many varieties and none disappointed. This place is now on our A list.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 3
    },
    "photos": [],
    "user_id": "YfzyyN7gv-BUAAaT5N7DVg"
  },
  "E-7fAv884B6c1c3QkyvN9g": {
    "date": "5/15/2017",
    "text": "I love this spot it reminds me of the bar/restaurants in NY.  Ordered salsas tacos and drinks and everything was tasty.  Nice hangout, good service and great food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 5
    },
    "photos": [],
    "user_id": "Qszci3ygCsq08oUFRom3WQ"
  },
  "31sgQ0GeeA3Z_xaIpeok4Q": {
    "date": "4/26/2017",
    "text": "Have been meaning to try this place since it's just down the street, but was hesitant, I have to admit... was totally impressed immediately when we walked in- they put a window in the front! It didn't feel like a dungeon in there, as it did with the previous restaurant.  The bartender immediately greeted us and asked if we had ever been there. He told us all about the menu, was attentive, knowledgeable, great personality and very friendly! I'd sacrifice an average meal for great service alone... However, the food was much greater than average. We ordered quite a few tacos, ceviche, gauc, salsa- it was all so fresh and flavor was amazing.  The chef came out as well as the owner or manager, and spoke to the few of us who were there at the bar. Impressed to say the least! I will be back! Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 11,
      "cool": 4
    },
    "photos": [],
    "user_id": "14Nlx8MVBzYR5DvBiYUpcw"
  },
  "2nIiJEda9iqTto9s6G28uQ": {
    "date": "4/27/2017",
    "text": "The BEST tacos, craft cocktails and staff.  I'm blessed to live walking distance and this is a regular spot for me.  They're consistently raising the bar with the Taco of the Week, and getting ready to roll out some surprises!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 8
    },
    "photos": [],
    "user_id": "hX_rDnzojluvcencerRk5w"
  },
  "tHUpGerl41vdU5Gce1U0SQ": {
    "date": "5/8/2018",
    "text": "3.5 even though regular tacos are excellent.  Service is lacking.  Friendly but understaffed.  No one wants to be thanked for \"their patience\" when waiting for food.  My food sat in the window (thankfully they don't use heat lamps), so it was room temperature at best. Guacamole took 15 minutes.  DO NOT come here really hungry like I did, or it will test your patience.  Food presentation is very aesthetically appealing, and most of the food tastes as good as it looks.  Also, apparently, even though nothing in the description indicates fried, the CRUjientes tacos are deep fried.  Not delicious at all...and usually fried is.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OU6gjK9Zt0ha0FK42NupRw"
  },
  "fA6m0yX-vw19hNXoWo5RHA": {
    "date": "6/16/2017",
    "text": "Omg this place is bomb!!! The cocktails are stupid good. I love the service we always get, and the happy hour is awesome. They accommodated my vegan diet, but the boyfriend is a meat eater and he is always blown away. I love the chips and salsa trio, it's super yummy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "NftDx7ER0iz2o8zP9jpkyA"
  },
  "8Nvf_cl9c_ocO-SfObNjAg": {
    "date": "1/9/2017",
    "text": "Always awesome to hear a new taco place is opening up in the area. I'm so glad this place lived up to our expectations. We ordered a smorgasbord so that we could try as many different tacos as possible and they were so good. I would definitely recommend the short rib, the Korean and the crunchy taco. The fish taco was also good. The New York was too sweet for my taste. We also had the queso dip with chips. It has chorizo in it and it was so good.   One thing I definitely hope they change is the fact that they don't do take out. I called to find out if they do and I was told no.. That's a bummer..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xvjCropvlaOB11QQypCfZQ"
  },
  "Pk7oItkLBSZZhyuQ7PdIMg": {
    "date": "3/27/2017",
    "text": "Hands down best tacos ive ever had... been in three times already  tried almost  every  taco and they are all to die for, if you want your taste buds to start dancing  look no further. Excellent service at the bar from the lovely morgan!!!! P.s the michelada is AWESOME!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 3
    },
    "photos": [],
    "user_id": "PT8txwEU7eoBaeQRnXqCzA"
  },
  "IrUtTECo4ovPCfV3eGMhwQ": {
    "date": "12/29/2016",
    "text": "So disappointed!!  After hearing for weeks that this place was opening we were looking forward to trying it.  The service was horrible. I really don't know how else to describe it.   We ordered chips & salsa as an appetizer.  It never came.  We had to ask for it after our dinner was served.  Not one person came to ask how our dinner was. We never even had silverware!  Fortunately we were eating tacos but I still would have preferred a fork or knife.  The worst part is the bill. For $50, 5 small street tacos and chips & salsa, way way overpriced.  Yet and still if the service was better we could have lived with it.  Edit in response to Jason's comment below: Breakdown of bill looked like this: 3 hard tacos - $18 2 small tacos - $10 total  Chips & salsa - $5......btw, never went to Mexican restaurant and had to pay for chips 1 cocktail - $10 1 ice tea  Total: $47.63 Tip: $6.50 Total bill: $54.13",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lc7kaCXo4JFEDiC1KVxznA"
  },
  "ExE7S3wzH3RroGGpn3ecpg": {
    "date": "8/30/2017",
    "text": "We came for taco Tuesday because the ratings were so high. They offer unique variations of tacos, I'd say they are non traditional. The Korean chicken tacos were great but a bit salty. I would not recommend coming if you are looking for your traditional pollo or carne de Asada tacos. They weren't supper busy around 9pm . The Waitstaff was very welcoming and gave great service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Aas3IaSkOnyNDtgnD8yPg"
  },
  "J1pywn7c7jg1Z7Mh_aA71w": {
    "date": "1/12/2018",
    "text": "This is my favorite local spot.  Love the tacos, the service, the margaritas, and the ambience.  The Korean chicken tacos and the street corn are my favorite dishes but you won't be disappointed to Rg anything.  Wish they were open for lunch too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "8HVtgGiWTvkLJMKdckLXMg"
  },
  "F4ZIyHA-LbP01yKbk18KDQ": {
    "date": "1/10/2018",
    "text": "If I could give this restaurant 1,000 stars I would. THIS IS THE BEST FOOD I'VE HAD IN A LONG TIME! From the moment you walk in, you get a sense of a relaxed vibe with the perfect ambiance for a nice dinner with friends. Several booths and large high top tables are great for enjoying the company of friends or family. Now let's get to the important part, the food!! There were so many mouth watering options I couldn't even decide. The owner was very helpful and was very passionate. I could tell he loved his job as hr was describing the flavor notes of each street taco.These street tacos are not messing around. No take out orders to keep the QUALITY of their food fresh. I finally decided on the Waygu and Korean bbq and I am still dreaming about them! My friend ordered Waygu and a shrimp as well as a fish taco and all were delicious. You really can't go wrong but the flavors and the melt in your mouth beef had me craving more and more! And the best part? The prices! For the quality as well as fresh ingredients and homemade salsas it was very affordable. This amazing restaurant needs to be HYPED UP! It is in an unassuming little shop area! You won't be disappointed and the atmosphere and taste of the food is excellent. I have been raving about this establishment ever since and I am so glad I was recommended to go here. OH and I almost forgot, their Queso! It is Tex Mex style with influences from San Antonio and it was to die for! Also, the chips were hot and crisp with the perfect amount of salt. Every aspect of my experience was phenomenal.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "iBES59jW0dq9odK5Qc9E1Q"
  },
  "HN3UaPzCFZQcAYCVx-Nnxw": {
    "date": "12/10/2017",
    "text": "Last night I had the best everything! Six of us met for happy hour and dinner, 4 for the first time. We got there early, ordered the premier cru margarita, a beer and guacamole and fell in love! Between the six of us we had the Korean fried chicken taco, beef short rib taco, lamb taco, oyster taco, duck taco, pork belly taco, street corn, pozole and gazpacho. We had the margaritas, Spanish red wine and beers.  I am Mexican and like rice and beans with my Mexican food.  Last night I did not miss them.  The food is all perfectly seasoned, a bit hot for one in our group, but otherwise just perfect. Service was excellent from the moment we walked in till we walked out. Chef Hinojosa has created my new favorite Mexican restaurant.  And not just because we are both from Texas where he obviously got his very fine early training.  What a wonderful addition to our Latino restaurants.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "OMqmrrdDH7NTNPTOPoWg9g"
  },
  "eN6Vrr-ZBpdY7OQIBp-npg": {
    "date": "5/2/2017",
    "text": "I kept seeing photos from here on my Instagram feed and have been wanting to go. I finally made it here a few weeks ago for some tacos. I got the ahi, blue crab, and fish tacos since I had a big burger at lunch and wanted to go the seafood route. The ahi taco was by far my favorite... I could have those every week! The blue crab tacos kind of reminded me of a fish stick. The fish taco was really good too. We also got their chips & guac. The chips came in a brown paper bag and were nice and hot (temperature-wise). Note that they are closed on Sundays.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "SNQcE_Bc0QAbxFu5F1dTzw"
  },
  "WhANNvhohCmmeCXaPfulTg": {
    "date": "1/28/2017",
    "text": "Stopped by after seeing my favorite paleo chef post on Instagram that she ate here last night and raved about it! Her review did not disappoint!! This place is fabulous and happy hour is daily from 3-6pm!! Lots of gluten free options.  We had the chips and guacamole and queso which were $2 off for happy hour. The pork belly tacos were our favorite! Also $1 off during happy hour. They have some super fun cocktails too. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "IYzNBbwPB8zLy1gzOD8fhQ"
  },
  "gvEqbMXR4WZzYAFMOlsL5A": {
    "date": "3/10/2018",
    "text": "Host was not organized in taking names to seat folks, no place to stand and wait.  Drinks are delicious $10-13, tacos are small, DELICIOUS, and pricey $4.50 - 6.50 a piece.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n-bwX73RUsqd5rM7Rj8t6w"
  },
  "wObJ5VATCYB9Ylu-YNBrSA": {
    "date": "6/19/2019",
    "text": "Started with Guacamole & Chips, and the best Michelada  that I've ever had. The guac was amazing. Ordered a couple of amazing tacos pork belly and a crispy taco with beef.  Man, I will definitely be back here!!   By the way, the service rocks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdRJ1xo7z20Z0V1EMGxF_w"
  },
  "fBlImCfD66s0TtmEb9CU-A": {
    "date": "1/29/2019",
    "text": "Exceptional! From the service to the food! This place DID NOT DISAPPOINT! This will be our new taco Tuesday spot! Pork Belly taco... amazing! Korean Fried taco... magnificent!(the server suggested we save this one for last, thank you Morgan!) CRUjiente pork taco... my favorite! CRUjiente beef taco... great flavor! Cinnamon margarita... holy margarita heaven! Yamakazi single malt whiskey (thank you random helper)... not for the weak! Dessert taco, with carrot cake and goat cheese... bomb! Queso... geez can they do anything wrong? Seriously, pleasantly surprised. It's a must try!  Hold the phone... HAPPY HOUR ALL DAY WEDNESDAY? never mind we're coming back tomorrow!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "nrzrkout-fEt2q2i0QubkA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nrzrkout-fEt2q2i0QubkA/o.jpg"
      },
      {
        "img_id": "M-OixnX0rdiBlS59k0zFwg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M-OixnX0rdiBlS59k0zFwg/o.jpg"
      }
    ],
    "user_id": "6EEsT4F5P79LQkNKVOcJBA"
  },
  "OZieFhdtIcNTBM95itBLYw": {
    "date": "1/11/2019",
    "text": "CRUjiente offers some of the tastiest tacos in the valley. Whether you are looking for a more traditional taco, or you are looking for a crunchy Korean Fried Chicken taco, this place has it all.  Special note for you whiskey fans, I spotted a bottle of Yamazaki Single Malt 12 year whiskey behind the bar.  I highly recommend it, as it offers notes of butterscotch and caramel.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "1DAISYKxna2vnOk2bZXMVg"
  },
  "z1sgr4UmrhPhVJY73fD_qg": {
    "date": "7/17/2018",
    "text": "Ordered - Tempura Avocado Tacos : too good to stop with just 1. Amazing taste, Good presentation. Desert Taco : chef special. Cheese cake with strawberries. Just mind blowing. Amazing combo and well thought.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "6C7TotgZq3CGbKF6MbcqoQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Bar chairs, tempura Avocado tacos and sweetest lady next to me to talk to. Simply the best night!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6C7TotgZq3CGbKF6MbcqoQ/o.jpg"
      },
      {
        "img_id": "tgiCA6zPcZAfe75FnkZl4A",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Tacos are great.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tgiCA6zPcZAfe75FnkZl4A/o.jpg"
      }
    ],
    "user_id": "YpVvSMuQWQiRCHbbUjFzag"
  },
  "7e6YA-6YXn_h-io5nOpZxg": {
    "date": "5/11/2018",
    "text": "I've wanted to try this place so my hubby and I decided why not today.    Parking: horrible, it's a strip mall area so you already know the deal!  Pray that someone is leaving quickly.   Food: WOW.... I'm very hard to impress when it comes to Mexican food but those tacos were a slam dunk! I had the fish tacos... and OMG the fish was grouper! It was seasoned to perfection with not a lot of fluff, just a great piece of grilled fish.   My husband had the Korean tacos.... oh yeah! It was tempura fried chicken that was extra crispy.... oh my I'll have another one or two.   Drinks: the drinks were excellent.  The bartender really takes the time to make you a perfect drink.  There are not frozen from a machine she muttells all of the fresh herbs that go into every drink, so a mojito takes like a refreshing mojito!   Is it worth a return visit: most definitely. The decor was hip and some what romantic but of course the food had me at HELLO!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "urSHJH5fq1-TK-5-zseTNQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. It&amp;#39;s Friday!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/urSHJH5fq1-TK-5-zseTNQ/o.jpg"
      },
      {
        "img_id": "nTE8nqtUuzARunVdvV_wjw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. It&amp;#39;s complete",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nTE8nqtUuzARunVdvV_wjw/o.jpg"
      },
      {
        "img_id": "mze7E7ZPPiSM-XddyfHptw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Oh yeah",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mze7E7ZPPiSM-XddyfHptw/o.jpg"
      }
    ],
    "user_id": "Rp1_suVRaH7Fha0RsT9u5Q"
  },
  "ATQq1LducwE-rv6yo6ae_A": {
    "date": "6/27/2018",
    "text": "Our friends have been trying to get us to try CRUjiente for months and we finally stopped in last week. I am super picky when it comes to tacos and Mexican food in general and this was the best I have had in a very long time. The taco special of the day was crab, which I ordered in addition to the shrimp taco. They were street taco sized but packed a ton of flavor. My husband ordered a pork belly (YES!!!), Korean fried chicken (super tasty), and green chill chicken (YUM!) tacos and loved them all.   Our table ordered the guacamole and trio salsa appetizers, both we loved. The queso was good but nothing exceptional, our friends let us know that it is generally better than it was that night. We also ordered the grilled corn, which I could easily eat my weight in, yum!   We tried a number of specialty cocktails, each more delicious from the last. I look forward to coming back on Wednesdays for all day happy to score deals on the tacos, apps, and cocktails. It is like Taco Tuesday, but even better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "SU_qFIfjkvzElcFXidlRgw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Strawberry basil margarita",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SU_qFIfjkvzElcFXidlRgw/o.jpg"
      },
      {
        "img_id": "X9Mi729s-wnv9tvvJlb3eg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Roasted corn and Guacamole",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X9Mi729s-wnv9tvvJlb3eg/o.jpg"
      },
      {
        "img_id": "iJvgNydedUOR7AM0oVCvgg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Salsa trio",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iJvgNydedUOR7AM0oVCvgg/o.jpg"
      }
    ],
    "user_id": "gOYgSEbE-Z7cqGsgGW3LBg"
  },
  "uAGM_l42uGxoUUsdJtWKWA": {
    "date": "2/16/2019",
    "text": "I've been coming here consistently for over a year now and it is, hands down, my favorite taco place in Arizona. The quality is always top notch and service is fast and friendly.  My favorites are the Korean Fried Chicken and Pork Belly and be sure to ask about the taco of the week!  All margaritas are great and they have an extensive beer and whiskey list.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cwueZl7VqnEiuY-c8CWaLQ"
  },
  "I0nwHhUS7mS3FzfdMf2eRA": {
    "date": "3/14/2019",
    "text": "The place looked small from the outside, but the atmosphere and ambiance inside was great! Never judge a book by its cover! The staff was super friendly.   To start, we ordered guacamole and chips. The guacamole was freshly made with the perfect amount of flavor. The three salsas they provided where full of flavor!   I ordered the pork belly (deliciously tender pork), the shrimp (perfectly seared with the right amount so flavor) and the short rib (packed with flavor and so tender) all tacos!  The Japanaknees Bee drink was a great taste of honey infused Toki whiskey margarita! Great place to eat overall!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gIw1BhENjtmh9Sa2n2rnDg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Japaneez Bee Margarita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gIw1BhENjtmh9Sa2n2rnDg/o.jpg"
      },
      {
        "img_id": "FJqAIbEmPu3n5l8F7Ix2eg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Short rib taco, shrimp taco and pork belly taco",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FJqAIbEmPu3n5l8F7Ix2eg/o.jpg"
      },
      {
        "img_id": "G3GIHtw1JOmnNnWmOJe3MA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Guacamole!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/G3GIHtw1JOmnNnWmOJe3MA/o.jpg"
      }
    ],
    "user_id": "VHPPbVlwz2pbPWkUeyetzQ"
  },
  "_cPh6tTTYyMndQkp6tRtwQ": {
    "date": "8/27/2018",
    "text": "Service was impeccable at the restaurant. The food was great tasting as well. If you go there please get the grilled street corn. Is a must have and tastes delicious. Be warned it's got a kick to it but it's not too spicy.   I ordered lamb taco, shrimp and the Korean chicken. Loved the Korean chicken, and the shrimp as well. The lamb had a great taste to it at first but then later noticed it was super salty. Thankfully it was still bearable.   For drinks I got an old fashioned with bulleit bourbon and that was also good. Will definitely come back .  Thanks to our server for taking good care of our table and always checking upon us.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8GFyYYTTx44TIUGpp_mK9Q",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8GFyYYTTx44TIUGpp_mK9Q/o.jpg"
      }
    ],
    "user_id": "SGobMWMf7xwbOYHL6WMXyw"
  },
  "JshfYTPQoWQ_BnrnVBKKFQ": {
    "date": "4/29/2019",
    "text": "The tacos were so much better than I expected them to be.  This is a new fav, the kind of place I want to bring friends, visiting family, just myself often... I was so impressed at the amazing flavor of every taco we ordered.  The Korean fried chicken, the pork belly, the crunchy pork, the duck, the Wagyu beef, the fried avocado... were alllll amazzzzzing .... The blue corn tortilla,  ohhh man, just beyond amazing... I also had an Arcadia margarita, it was fantastic.    Now knowing the check in process (very confusing for 1st time, as other reviews said, you just get looked at, no hostess, no space, etc)  I know what to expect... It isn't ideal, but it isn't a big deal... It was very cool to see you can check in on Yelp.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "0mvmUHuGQL2kRRkX14CkTw"
  },
  "Gz983nGEJJZbsT5_FlaByg": {
    "date": "5/31/2019",
    "text": "I loved this place! This was the food highlight of my trip to Arizona. While pricier than your average taco at $5-7 a pop, each one was a unique fusion experience of different flavors. We got mushroom, fish, pork belly, duck, and steak between my friend and I. I have no regrets (except maybe not ordering one more taco...they all sounded so good). Margaritas were also standout- smoky, spicy, bold concoctions that aren't your typical sugary drink. If I'm ever back in the area it will be hard to stay away from this place, especially with all the daily specials (deals on food and drinks) they have!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tg-bPEy7TKpXaVeaKUtxNQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Pork belly, duck, steak tacos (left to right)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tg-bPEy7TKpXaVeaKUtxNQ/o.jpg"
      }
    ],
    "user_id": "rJW1TA51uW0IWfvuJJRh6A"
  },
  "h2IQlZg5sDC8ZAYMvj5JOw": {
    "date": "7/22/2019",
    "text": "Went for a Saturday dinner with another couple who had never been to CRUjiente. I called ahead to make a reservation for 4, but was told they don't make reservations for less than 5. Strange policy, but okay.  I recommend securing your time slot online about 20-30 mins prior to when you'd like to dine. My husband went through the online request but it wasn't needed as we were sat right when we walked in. We went in just before 6pm.  We made it in time for HH (ends at 6) and were able to order some discounted drinks and apps. By the way-- the CRU margarita is delicious!  Our group ordered a variety of crunchy and regular tacos and were pretty pleased. The green Chile chicken was a little bland, but the crunchy pork and fish were very good. We took a gamble on their featured dessert taco and it fell a little flat.  Overall, a good dining experience and our friends said they'd try it again. Our waitress was extremely kind and helpful in making recommendations. We'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ibYds1FU8IqPhoqtY-zSKw"
  },
  "LvqxScfP44k8bZum9r4lCA": {
    "date": "5/13/2019",
    "text": "Good vibes, tasty food and fast service, cannot describe this place better. Tried their salsa trio which was delicious! Highly recommend their avacado tempura and the mushroom tacos. Love that they had these vegan options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "o-yDNsuwtcbG8iFQM3TrEg"
  },
  "2Hd34hXEBQKDQNahoDZAPQ": {
    "date": "8/3/2019",
    "text": "Korean fried chicken! Best tacos I've had here in AZ!! just wish happy hour was a bit better ;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1hEDPilnhpAXo7fuyZ5oDQ"
  },
  "KNcrNpUuCfVaoRJcj2LtQw": {
    "date": "4/15/2019",
    "text": "Came to this little neighborhood gem for Taco Tuesday with some friends. I would definitely recommend trying different styles of tacos but my favorite was the pork taco dishes. The flavorful was bursting and the pork was moist, tips were crispy, which I absolutely enjoyed! Service was good and the ambiance is low lighting and super comfortable vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "vCYjSND9ik9HWeLzZT4pGw"
  },
  "Z9plZTtwzMUROHPSe7A2lw": {
    "date": "8/1/2019",
    "text": "Flavorful tacos. Try Korean chicken taco. Remember to use the iPad out front to get on waiting list. Very popular but wait is short.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kn6jwgPrS4vc92dpe179ew"
  },
  "su-4UjY7JQRW5ytFkgpVlw": {
    "date": "5/3/2018",
    "text": "Very sophisticated and artistic tacos, it's an art gallery you can not only see but also smell, taste, and touch! The tacos really do look like works of art that are both appealing to the eyes and also palate.   We ordered the Duck Breast taco, the Tempura Avocado taco, Green Chile Chicken taco, 36 Hour Beef Short Rib taco, the Pheasant and Potato taco (taco of the week), and the Lamb taco. My absolute favorite was the Duck Breast, it was otherwordly! Tasted surreal. I never liked duck or pickled anything but almost every taco had a pickled vegetable and it went incredibly well with them. I feel converted. My second favorite was the Pheasant and Potato taco. And third favorite was the Green Chile Chicken taco.   The flavors in each taco are completely different from each other which is refereshing, and the flavors within each are a combination of complementary components. Yes, $5 for a taco might seem like a bit much but it's well worth it. You might end up loving a food or meat that you didn't like before, which is saying something.   We also had dessert which were strawberry tortilla tacos with strawberries, cream, and cake.  The bathrooms were neat and had large complementary images on them and the inside was slightly surreal as well as modern. Keeping with the theme of the restaraunt's concept.  Great execution in every aspect!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "n4laD4Xk4H6WdgZ_0_Bmmw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. The cute bathroom doors.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n4laD4Xk4H6WdgZ_0_Bmmw/o.jpg"
      },
      {
        "img_id": "96P6YSRhdsl_U290hhkiAg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. All their awards from the Arizona Taco Festival from 2015 to present",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/96P6YSRhdsl_U290hhkiAg/o.jpg"
      },
      {
        "img_id": "NMaqHQYoN6vhGjWfnVJIdg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. The dessert taco: fresh strawberries, cream, and cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NMaqHQYoN6vhGjWfnVJIdg/o.jpg"
      }
    ],
    "user_id": "W4ZuWztx47aiksyYPUMYDw"
  },
  "V6cyvXRI3VIUncEfZYNz6A": {
    "date": "5/9/2019",
    "text": "The Korean fried chicken taco is literally <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>! I'd pick this for my last meal good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fXIWQI9-Rvryb6egzfvqpw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Korean friend chicken taco  and taco de la semana- cauliflower taco.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fXIWQI9-Rvryb6egzfvqpw/o.jpg"
      }
    ],
    "user_id": "JMv8HAkFbuFpKWBfPX2b5Q"
  },
  "-vmj-qshGExV5PskoApxMQ": {
    "date": "11/9/2018",
    "text": "Delicious, savory tacos! A perfect combination of flavors. I don't typically eat modern Mexican food but this place did it right and I am glad I tried it out. All my tacos were very well put together and bursting with flavor. Our visit was pleasant and our waitress provided good recommendations. We will definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ji9I1UxEGNP__lpL-dmhVw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ji9I1UxEGNP__lpL-dmhVw/o.jpg"
      }
    ],
    "user_id": "XEcsxGwyIgeYApWghDfg_g"
  },
  "rKrnChWeZDKE0AhLbxfpgg": {
    "date": "7/19/2019",
    "text": "This place was amazing! We had seen it and had it saved in our collection forever and it did not disappoint. I had the taco of the week which was a flounder taco, a beef crunchy taco and a Korean chicken taco. The crunchy taco was amazing in that it did not fall apart, and did not cut your mouth! The flounder taco was so perfect that I could eat 100 of them. I can't wait to come back here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hjzfcRkuBGhAN7bGyyF_LQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Flounder taco, Korean Fried Chicken Taco, beef taco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hjzfcRkuBGhAN7bGyyF_LQ/o.jpg"
      }
    ],
    "user_id": "_e-zZ6KBzlr5LP_tI9fZxg"
  },
  "85WnreA6lDuUVfohb6DLgw": {
    "date": "2/3/2018",
    "text": "We went for taco Tuesday. My bf and i are vegan so they made veggie tacos with out cheese. They were really tasty but for a small street taco that's $4.50 is a little much.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ctLrn5mR2xolmyC4EADtFA"
  },
  "wuYLZ6CvHrCfJrStc_OWMw": {
    "date": "10/29/2017",
    "text": "Fantastic service (Nora, manager and bartender- great job).  Knowledgeable staff, great bartender, and food is beautifully presented and delicious.  Street corn, tacos and guacamole are my favorites.  Have a healthy happy making salad too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "Ai7iG-6YoIrdixnNYkFWzg"
  },
  "H0yXt5AowebDrVPxgGqufg": {
    "date": "12/30/2016",
    "text": "My husband and I initially had our mind set for sushi at Sushiholic tonight, but it was a long wait to be seated so we decided to try the new taco spot next door. This place was really amazing. My husband loved it too. The chef even came out at the end and spoke to us for at least 10 minutes. They prepare all foods from scratch in the house. Starting from the presentation to the flavors of the tacos It blew me away. We had Porkbelly, Korean chicken, Ahi tuna, and crunchy beef. All of them was flavorful and delicious! I can't wait to go back to try the other ones. I highly recommend this place, a can't miss for the Arcadia food scene.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WQRlM90rLFPU-jSda1wuyQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Ahi tuna, Korean fried chicken and crunchy beef.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WQRlM90rLFPU-jSda1wuyQ/o.jpg"
      }
    ],
    "user_id": "LwccdGsY95BXN98RMJLsbg"
  },
  "QOdzLudnMby3-9dgVKkFxA": {
    "date": "2/10/2018",
    "text": "Absolutely fantastic experience. Food = amazing.  Had Pork Belly, Crunchy Beef, Duck Breast, and Wagyu Tacos.  Would have gone through the whole menu if I had time and room! The Chicharron and House-made Michelada were a wonderful start to all of this, as recommended by Jason.  He was extremely knowledgeable about all of his ingredients and menu items.  Was also able to meet Chef Rich and his crew in the back of the house...great team! Finished off with The Pisco Kid Cocktail...very refreshing and would have loved another, but ran out of time.  Comfortable bar stools, and clean restroom as well!  Can't wait to go back!  Well done CRUjiente....well done.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M_lPkxjXf6UL3s1AxMxCXg"
  },
  "InQJBN7VnC5yP3MDDS7bLg": {
    "date": "10/11/2017",
    "text": "I'm lucky to have this place in my neighborhood, although I'd happily drive any distance for what I consider the best tacos and margaritas in the valley. The atmosphere inside is unexpectedly hip and warm, a True gem hidden within a commercial complex. The weekly deals are a steal for incredibly top notch food, and the servers are knowledgeable and friendly. Lauren recognized me my 2nd time in, and welcomed me back like an old friend. Be sure to ask for the \"secret\" dessert, a family recipe from the chef - you'll be glad you did!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 6
    },
    "photos": [],
    "user_id": "StmTf14zrTsbCIyIDd0lSg"
  },
  "hxWZ49rHM6gAT8Kx7QP7dw": {
    "date": "8/2/2018",
    "text": "Kind of expensive for tacos but very yummy and excellent service. Atmosphere was amazing so I guess it is worth it!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pHMCJmhlZ8t-usYJgLaRRw"
  },
  "YKgGHvvqUgo1W8Sx9qsfOA": {
    "date": "2/1/2017",
    "text": "Tuesday Night Supper Club   We had a group of 20 this time, and the servers were very attentive.    Started with a trio of salsas & guacamole.  Guac was very flavorful and they provided nice options of creamy green, tomatillo and a red salsa with mediocre chips.  I prefer super thin or thick like you get in Mexico.  Next course, Ahi Tuna taco with a Taro root shell, delicious sashimi grade simple dish with a few green onions on top.  Not too spicy for the tender tongues.  Three other tacos were served: Crispy pork belly, crispy beef and crispy green chile.  Not a fan of the quick kimchi on top of the pork belly, meat was very tasty.  The beef taco was my favorite, flavorful and the right amount of toppings.  Green chile my least favorite - not spicy enough, strange flavor. My friends and family loved the green chile taco, so it's a matter of taste.  Biggest blunder by the restaurant was they did not provide complimentary 'extra' salsa for the tacos.  I realize the chef has a certain flavor they are looking to achieve, yet for the patrons who are accustom to eating out regularly a side of salsa is a given at a taco joint.  Overall a four given the tasty dishes - know that these tacos are pricey ($5-6 per) so it's not your roadside taco stand!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "5f3A2-8HEtfGN7jikb4ALw"
  },
  "zaSPmqa-grJLkiB1LUn01A": {
    "date": "5/24/2018",
    "text": "Great bar/cocktails, great atmosphere, great service but the food eclipsed them all.  Each time I tried a different taco, it became my immediate favorite.  The flavor combos are so good, one could simply order randomly from the menu and come away completely satisfied and wanting more. Bravo!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "0GVwtbAYrgBcBxbcu0P9Xg"
  },
  "_h5Hi0-QeFIz_t4w5tevSw": {
    "date": "9/12/2017",
    "text": "Omg! This place is amazing! Tacos so special and unique. You just don't find these kind of joints everyday! We ordered the taco of the week which was simple but somehow so good out of he most basic of ingredients! Chicharrones and refried beans, aji tuna tacos, and pork belly! Just delicious! Margarita is anejo tequila and lovely",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 6
    },
    "photos": [],
    "user_id": "nC6fp0V1RoNLEv5QkDfD3Q"
  },
  "OpE7ZXOP0UF9ztqCyYc3rA": {
    "date": "11/25/2016",
    "text": "The service was fantastic, we met Noor tonight and she was very attentive and friendly.  We ordered Aguachile to start followed by Posole Rojo and a few tacos both crujiente and de la calle with some drinks. It was tough to decide what to order as everything on the menu looked delicious. The flavor and presentation were great. We will pay a premium for good food but the portions and price seemed disproportionate for the atmosphere. Corn tortilla flavor could be better and more \"authentic\" to match the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "R3EocBvd9XEA1Mk3BMC8uQ"
  },
  "FHNCMn1YBTut6326xvC1LQ": {
    "date": "2/17/2017",
    "text": "Don't let the strip mall location fool you, Cru offers some serious eats.  The setting was very well appointed and the drinks were great.  The fresh and hot cocktail was my favorite (can't go wrong with gin and elderflower).  We went for happy hour and tried the pork belly and Korean fried chicken, as well as the taco of the week.  Pork belly was the best, Korean fried chicken was great but very very spicy.  Taco of the week was an Indian take on a taco and missed the mark, too salty and seasonings overpowered everything.  Pork belly and Korean chicken were a tad over salted as well but quite good.  I'd recommend going for happy hour, too pricey and tacos too small to make a full on meal.  Will go back, service was great too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eFAxebO6ZfG9KrEP0qUOIg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Fresh and hot cocktail and cru margarita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eFAxebO6ZfG9KrEP0qUOIg/o.jpg"
      },
      {
        "img_id": "VnQoJws0cVdF1Z2u9PWjTw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Taco de la seamana (on the right) &amp;amp; kimchi pork belly taco ($1 off from 3-6pm)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VnQoJws0cVdF1Z2u9PWjTw/o.jpg"
      }
    ],
    "user_id": "WVxADgC3NTaPCNU_8LuSyQ"
  },
  "HFjSGOuflv8dFI0hBcRTrQ": {
    "date": "11/15/2017",
    "text": "Came into CRUjiente tonight during happy hour. They have all night happy hour on Wednesday's so that is pretty cool. My wife and I started with the chips and salsa trio. The salsas were all really flavorful and the chips were nice and crispy. Our server actually ended up bringing out more chips for us since we still had some salsa left. Between my wife and I we tried the Korean fried chicken taco, the beef short rib taco, the pork belly taco, and lastly the crunchy beef taco. Overall, every taco had its own unique flavor. Pork belly was interesting how it was cut into small pieces but it is definitely in the fatty side. My top two were the short rib and the chicken taco. Short rib was super tender and had a good flavor and Korean fried chicken was probably the most unique. It had a very strong ginger flavor and the sauce was really good too. The shredded beef was seasoned really well in the crunchy taco. I will say that the main downfall about this place is the price in comparison to their portions. If you come and visit here I would highly recommend coming on happy hour so you can get more of a value. Tacos are really small and the price is a little high. However, you can tell that they are using quality ingredients so I didn't mind that much. Lastly, I got their happy hour margarita for $5 and that was a really good deal. Pretty strong marg for 5 bucks. Come check this place out for happy hour!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "9Sc7vPSSdC4-Kkm1uzB57w"
  },
  "ky1qThc-uPkkU4uLKgIOtQ": {
    "date": "6/1/2017",
    "text": "This is an interesting place which tries to be innovative with their tacos. I don't love all of their food as not all tacos I have had here were consistently impressive. But they are surely on the path as I do not know any other place here in the Valley which tries to go beyond regular tacos to create something that is fun and different. I hope to find more if these gems. To be fair what I appreciate about this lil taco place is they have dared to be different, hence the one extra star  I have tried most of their tacos and I think I love their ahi poke taco served in taro chip the best. I think the crunch of the chip balances the lovely textures of the poke.   I wish them luck and hope to see more places that bring innovative offerings to the Valley.  Hopefully they keep innovating as at some point I would love to see them bumped to a 5 star. If only they are more consistent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HUOyIxnC8pCcgkg3n0e8GQ"
  },
  "fL6G_hVpVPsdclFtzGBZ3g": {
    "date": "9/5/2017",
    "text": "Great food! We really enjoyed the crunchy tacos and the taco of the week.  The chips and salsa were amazing as well.  The salsas were flavorful and the chips served nice and warm.  Overall great food and we'll definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "O_qWmKJfUYl4HE9L3rL67Q"
  },
  "Ks62b1GwabeRB3Z2lcx2lA": {
    "date": "7/25/2017",
    "text": "Awesome happy hour. Great margaritas. All the Crujente tacos we had were amazing and the habanero and tomatillo salsa are killer. Great happy hour specials too! Taco Tuesday staple from now on. Morgan was a great server for our first experience! Answered all questions, great at giving us a tour of the menu. She's a rock star!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 3
    },
    "photos": [],
    "user_id": "Ee_IZ6gVj0EYjD86sGOOzA"
  },
  "5MK4qIcgXxooCzwkyiufrg": {
    "date": "8/1/2017",
    "text": "New favorite taco place. Wow. Try the wagyu beef. Or the crunchy. Or the pork belly. Need I go on?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "YUqVF-GzdXpnrYC1iNqB5A"
  },
  "OMI0E1H1W2qYQ0hokKbiKA": {
    "date": "7/16/2017",
    "text": "Located inconspicuously in a shopping center that was once anchored by Fresh and Easy. The space is intimate, modern and has a semi open kitchen. We tried several items on the menu- Korean fried chicken taco, pork belly taco, fresh guacamole and chips, beef crujiente, margaritas, and beef short rib tacos. EVERYTHING was excellent- bursting with unparalleled flavored and meticulously placed on your plate. Chef Hinojosa is well know in the valley and can be seen in the kitchen creating your dish. Jason, the owner, walks the dining room making sure everything is perfect. Try out these street tacos with a twist! You won't be sorry! I have been craving that Korean fried chicken taco ever since!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 3
    },
    "photos": [],
    "user_id": "ADZ9PDE_wIYKouH7fO9GJQ"
  },
  "LJM5QqjW3I45vjXc1SgOYw": {
    "date": "5/5/2018",
    "text": "Best margaritas! Muddled orange makes them the so yummy. Tacos were pretty good, very unique options. I had avocado tempura and a lamb taco both were delicious. The service was outstanding, the red headed bartender rocks!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "N-IuIHOraLR7c1yeb3aCrw"
  },
  "RqjxTv__6RrgqIty8GXkyA": {
    "date": "9/2/2017",
    "text": "Came in tonight and made it in time for happy hour. Our awesome waitress let us know we had a few minutes to order. The Cru margarita is just like I like it, not to sweet. Then we had the guacamole, delicious. Husband got the shrimp street taco, 36 hour short rib street taco and the lamb crunchy taco. I got the crunchy pork. Guys, the crunchy pork is sooooo good and melts in your mouth like the most amazing pork flavored potato chip you've ever had. Order that. Do it. Server said the beef crunchy is just as good. We'll do that next time. Great service too. This is a great neighborhood restaurant. Will definitely come back. Thank you to our great sever, Danielle! Compliments to the chefs as well!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "ozjPsnxs5Y6Tc668pf8WJA"
  },
  "J7Qx36742aIEUwGEmyW_0Q": {
    "date": "7/13/2017",
    "text": "CRUjiente Tacos has been open about 6 months, and this was our first visit. We will definitely be back! Their tacos are creative and some of the tastiest we've had. They have 2 sizes: 6 inch crispy and 4 1/2 inch soft. Our server carefully explained the menu, so we knew how to order. We started with a very fresh ceviche servicer with thin crisp chips. Next, we had beef and pork 6 in crispy tacos, short rib, Korean barbecue chicken, and fish tacos all of the smaller size. Although our favorite was the Korean chicken, all were very good. They have a decent selection of wine, beer, tequila, and mixed drinks. Happy hour prices are 3-6 pm, later on weekends, and all evening on Wednesday. Prices are fair for the quality, and happy hour will save you some $, too. Give this place a try!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "xEK9Y8g_odASZV6dnY0LIQ"
  },
  "34YwgSkq52Jz6HLbJFzvCQ": {
    "date": "8/25/2019",
    "text": "This place is amazing! I recommend this spot to anyone that lives in the area. I go at least twice a month to satisfy my taco and margarita craving. The tacos are delicious. I've tried most of them and never get tired of this place. They have a Taco of the Week, that's off menu and only available for that week, and they've always been so good. The specialty margaritas are so freaking good I crave them!   It's not a big place and they have limited hours so definitely take advantage of the Yelp waitlist before you arrive. Also, parking is limited so carpool or catch a ride share.   Full bar (I've enjoyed some great beers here) yummy apps, great place to meet friends, bring out of town guests and have a fun night.   100% recommend. I've always had amazing service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ml43nuoLUWwxX8bKcuWfpA"
  },
  "x-vQfNtU9qqL834C5YIuqg": {
    "date": "8/6/2019",
    "text": "This has been on my list for months !! Excited to finally check it out and was lucky enough to show up on Thirsty Thursday - $2 dollars off all margs, cocktails and wine.   Loved the margarita options the Arcadia had a great jalapeno kick.   Service was fast and attentive.   The space is fairly small with an open kitchen and some community tables.  Everything is made from scratch. As a vegetarian I found plenty of options but was slightly disappointed by the tempura avocado which I was so eager to try.  The mushroom taco was much more flavorful and unique in my opinion.  Nothing knocked my socks off but this was a fun, casual place to go with friends. Would certainly go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "M3lHc6TbrqqF5n5wRi7ePg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Mushroom and tempura avocado tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M3lHc6TbrqqF5n5wRi7ePg/o.jpg"
      },
      {
        "img_id": "_GJNC-2gPc9yc_MEUMNAAQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Thirsty Thursday !",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_GJNC-2gPc9yc_MEUMNAAQ/o.jpg"
      }
    ],
    "user_id": "NorW_qcBjw3JWYDsN9z9ag"
  },
  "BWaIFR87VgxHJBibeUgiLw": {
    "date": "8/6/2019",
    "text": "Behold some of the most delicious AND most expensive tacos you'll ever have in an average environment with ok service... some of these were some of the best tacos I've had so far, and definitely the most outrageously expensive ones too.   They serve gourmet tacos, carefully prepared with premium ingredients that taste really really good, freshly made tortillas too...my only issue is to pay $6.50 for a taco that after tax and gratuity ends up $9! For a single 3in diameter taco?! See pics  So we had 4 tacos each plus one beer and paid over $110 with tip...yes you saw that just fine, our bill was over $110 buckaroos for 8 gourmet tacos and 2 beers, I'm still confused about how this happened although they were delicious...I'm giving 4 stars only because of their super high prices...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "npgdZ2Z9Ae9qnSPJzb-7aQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Beef &amp;amp; Lamb tacos on top, order these if your hungry as they&amp;#39;re the biggest ones",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/npgdZ2Z9Ae9qnSPJzb-7aQ/o.jpg"
      },
      {
        "img_id": "yAySV5Yf_NSlquedmtoWbA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Shrimp &amp;amp; Fish taco on a 3in diameter tortilla",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yAySV5Yf_NSlquedmtoWbA/o.jpg"
      },
      {
        "img_id": "xNVDnUnrLv1LPNy5tytH4g",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Wagyu taco that is to die for! Also $9 after tax and tip. Ask for an extra tortilla .25c to make it last longer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xNVDnUnrLv1LPNy5tytH4g/o.jpg"
      }
    ],
    "user_id": "5Uhr1M2-qvzk-VHpa_WrNA"
  },
  "ZxlLWM5ngQusg-D2SXvztA": {
    "date": "8/31/2019",
    "text": "The best fusion tacos in town, just sat on the bar and asked the bartender for recommendations and everything was delicious!! Atmosphere is good, drinks are  amazing...I'm a happy customer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OkQqCisNhCELin-qP_EFkA"
  },
  "nsB4trl-Bh1e2fd8ufQGdw": {
    "date": "5/6/2019",
    "text": "Not gonna lie, I was really hungry when I came here at 3:30pm on a Friday afternoon.   We ordered some tacos, the Tempura Avocado Taco, the Fresh Fish Taco, the Shrimp Taco and the Mushroom Taco ($1 off during HH)  We really enjoyed these tacos!! The tortillas we're soft, didn't fall apart and super tasty!   Nice big booths to sit in and our server was pretty attentive, which is great when I have a gluten allergy! She was able to help navigate the menu and select items I could have without too many modifications.    10/10 recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IDttVLBghAcoNQuKgV_PDQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Bag of chips. Not gluten free, deep fried in same fryer as other breaded/ battered food. But I heard they were tasty!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IDttVLBghAcoNQuKgV_PDQ/o.jpg"
      },
      {
        "img_id": "N3_RJRpRTcvIAVrROE8uFw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Many awards and accolades, great job!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N3_RJRpRTcvIAVrROE8uFw/o.jpg"
      },
      {
        "img_id": "iz68TgvfEEnGT6z5if4oXA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Super tasty, wish there was a little more of a serving.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iz68TgvfEEnGT6z5if4oXA/o.jpg"
      }
    ],
    "user_id": "3wANTgwtoejdou-oWXadow"
  },
  "HDq_VXfTrMAZB6nX_CFkgA": {
    "date": "5/16/2019",
    "text": "Excellent artisan tacos.  This is the gourmet stuff. Melt in your mouth, delicate, balanced...   Strong drinks,  crunchy tacos.  Quality stuff.    Came straight from the airport.  Happy hour (3-6 pm)- woohoo!   $7 passion fruit margarita.  Wish it had a little bit more passion fruit flavor.  Nice balance of sweet, salty, spicy though.    $5 Garlic roasted mushroom taco was spot on. Lovely roasted gourmet mushrooms.  Garlic wasn't overwhelming,  but a nice balance of flavors and textures.  Definitely on the filling side.   $4 Korean fried chicken taco was tasty and pretty.   $4.50 crunchy pork taco wasn't too fatty,  but rich and delicious,  contrasted by the crunchy,  spicy,  savory cabbage slaw.  Excellent balance and probably my fav.   Little gnat kept flying around my plate, which was little annoying.    This is a hangout place to chill,  not if you're super hungry,  but want gourmet tacos in a cool environment.    Great little spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IrN1Ooaj_von_5fPMyFlYA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Crunchy pork taco $4.50 during happy hour",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IrN1Ooaj_von_5fPMyFlYA/o.jpg"
      },
      {
        "img_id": "cPWc_3MpOUxenBqt0JqHfQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Happy hour menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cPWc_3MpOUxenBqt0JqHfQ/o.jpg"
      },
      {
        "img_id": "nnuh-pV2Uf95vs-jWsbzBQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nnuh-pV2Uf95vs-jWsbzBQ/o.jpg"
      }
    ],
    "user_id": "Pk2EF2487BCgQJ0dpwIukQ"
  },
  "Fs935KXKUNOTyYKgYIPj9g": {
    "date": "3/20/2019",
    "text": "It started off a bit rocky. They respond quickly to yelp messages, but reservations are available only for parties of 5 or larger. The location is not the most romantic, being inside a small mall and next to CVS. They were out of Cazadores Blanco and Don Julio. And we almost missed happy hour. But then... it got better, a LOT better.  Our waitress recommended a tequila for our margaritas that was divine. One of the tastiest I've had. They have a larger selection of whiskys than other places we visited, and it seems they are working to expand their library of alcoholic beverages.   The staff worked together and helped us get our orders right before happy hour closed. All the tacos were creative and delicious. My friend and I split each taco so we could try as many as possible. These aren't the huge monsters you get at fast food places, but closer to the palm of my hand. They are filling though.  Highly recommend the green hot sauce. If you can handle the heat, you will absolutely love it. I wish I could take a bottle home with me. They take great efforts to elevate their food. For example, they bring the chips in bags rather than on plates so they stay crisp and warm. The noise level is decent. The interior is nice, and the designs inside the ceiling lamps are quite cool.  Jason, the co-owner, was extremely friendly and informative.  This is a joint for locals, unlike some of the newer establishments that seem a bit too touristy. Definitely coming back!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "lGvdNs37yHaT5cIOwQqS-A",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lGvdNs37yHaT5cIOwQqS-A/o.jpg"
      },
      {
        "img_id": "IxP84-3B10oCMMQfJ7uYjA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IxP84-3B10oCMMQfJ7uYjA/o.jpg"
      },
      {
        "img_id": "0337ZYKq_kz6UBFL53XBEQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0337ZYKq_kz6UBFL53XBEQ/o.jpg"
      }
    ],
    "user_id": "vEKZWbKECFVsMggy_cEnKA"
  },
  "2aw2zo1exbo5yrESPAeGqA": {
    "date": "2/21/2019",
    "text": "I always passed by CRUjiente Tacos but never made it in.  Well now, I finally have eaten here and the food and drinks are delicious! The bar is long and the drinks are fancy but wonderful.   We started with the Salsa Trio, and everything about this antojito was perfection. The fresh tortilla chips are served in a paper bag, and served hot. This is served with 3 salsas, verde, pasilla, habanero (hot).  After eating these chips, I was not too hungry so I ordered two tacos - one crujiente and one taco de la calle. I decided to go with the Beef Crujiente with Cheddar-jack, cabbage, house hot sauce, pico de gallo  which was OK to me, I didn't feel like there was anything special about it.  For the Tacos de la Calle, I tried the Fresh Fish with citrus slaw and ancho tartar which I really liked.  The next time I revisit, I am going to try a specialty cocktail and some other tacos.  A lot of reviews I read, pork belly seems to be the favorite, so I might try that next!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "mQX7qSrsV1kPSDF4IgqdGQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Fried chicken taco  Pork belly taco Beef crujiente",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mQX7qSrsV1kPSDF4IgqdGQ/o.jpg"
      },
      {
        "img_id": "Lz9qUWDOihUNUaGDWaAdrw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Fish taco and beef crujiente",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Lz9qUWDOihUNUaGDWaAdrw/o.jpg"
      },
      {
        "img_id": "WMJxlwHBmHvjPo99qQiICw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Salsa selections",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WMJxlwHBmHvjPo99qQiICw/o.jpg"
      }
    ],
    "user_id": "YF3KmwYMeONIfX02OTxwFw"
  },
  "7WSdoVH0rQ1Mfdbekmx5uQ": {
    "date": "8/26/2019",
    "text": "Wow !! This is our neighborhood spot. We were fortunate enough to come here for a friends birthday and this place didn't disappoint. Cool atmosphere inside, very friendly staff, and most important the food and beverages were out of this world. My husband and I now make this our weekly routine for Monday margaritas and tacos ! I was never really a taco fan, but this has definitely opened up my taste buds to a new world. The coconut margarita and pork belly tacos are a must !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2kGczlsTUwySoWixbnWm6w"
  },
  "dKsOOxPotPofcqUbBsCj9A": {
    "date": "7/30/2019",
    "text": "At the Taco Festival everyone speaks so highly of this place so I finally decided to ask one of my dates do take me! They looked so aesthetically pleasing I couldn't resist. I'd recommend making a reservation ahead of time. We went on a Thursday at like 7 and it was still packed our wait was short but if you're impatient; that's the way to go. I got the passion fruit margarita without the Serranos and my date got the strawberry one without the habaneros (spicy alcohol is so weird to me) they both were strong but I liked his a bit more.   The tacos didn't disappoint. I got the Korean fried chicken, Texas Wagyu steak, and the special Korean short rib. It was such a nice, bougie switch up from my regular street tacos, I loved it! They even have dessert tacos which I'll have to come back and try hoping I like the speciality.   Date Rating: 2 out of 5. Tunde is like straight from Nigeria. Or so that's what he told me. He calls me a \"socialite\" but that's because he doesn't ever leave the area code of Tempe lol (I can't imagine why a grown man would refuse to venture away from a bunch of college kids but I digress) in his whole two years of living in the states so far he's never been anywhere else but a couple clubs in Old Town. How incredibly boring that you don't wanna explore your environment.  You know those kids you graduate with in high school that wanna become rappers and chase that dream well into their 20s? Well my dear friend Tunde is like that but wants to be a professional athlete. I'm a sucker for seeing people get all excited about what they love to do so it was kinda sweet seeing the stars in his eyes. I'm hoping that works out. When he made a comment about Chris Brown being on Beyonce's level in terms of performing, AFTER watching Homecoming; I knew I wouldn't be able to take him seriously.  And then we watched me eat while he didn't touch his food. All of these little things would not allow me to imagine this going further romantically. He was attractive and we laughed but it all just felt too buddy buddy. Or maybe it was because he wanted me to order for him and then I felt like his big sister. He apparently gets tables out in Old Town so I will be making an appearance and putting my friends on to all his friends. Someone around here deserves to get lucky after all my effort.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nn55j_G_-f4IKK7JkUIKlA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nn55j_G_-f4IKK7JkUIKlA/o.jpg"
      }
    ],
    "user_id": "PUSC01dkDvBjs2FS6cXqoA"
  },
  "oEWH23AfuIdkr8EQeooVig": {
    "date": "4/4/2019",
    "text": "Not too sure what to think about them their happy hour specials pretty good the tacos are pretty decent but I'm not really a fancy Taco Guy I'm more of a food truck Taco Guy give me some good asada or lingua are Cabeza and I'm super happy maybe throw a beer in there but this ain't that place well the beer definitely but for a different kind of Taco pretty good the mushroom when was my favorite and the fried chicken that's pretty good too our server was great very attentive was able to ask all my questions even brought some extra salsa definitely go back if want something different",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "EyHWhFKxOhR-N1L7wxPiqQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Green chili chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EyHWhFKxOhR-N1L7wxPiqQ/o.jpg"
      },
      {
        "img_id": "-SKUtezO4tyOWMqE3kchJA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Korean chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-SKUtezO4tyOWMqE3kchJA/o.jpg"
      },
      {
        "img_id": "Z3_FzugEKDF6y1Gp93kpOQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Mushroom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z3_FzugEKDF6y1Gp93kpOQ/o.jpg"
      }
    ],
    "user_id": "kbfpED-6FURIsNlsAXqc2g"
  },
  "CfFQq5ITjdcvGL7wURz9rw": {
    "date": "8/13/2019",
    "text": "I wanted to try this place but first of all they have no parking. You will circle the lot FOREVER. I try to go inside and the bartender is rude so I give up on this place. No parking and poor service is a no from me!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "BRAuNgJGolSgAEgVZLedGw"
  },
  "mLg4IGu7T8iNyGq2xdfRXA": {
    "date": "8/21/2019",
    "text": "Second time I've been, and will continue to travel from North Phoenix (NoPho) to have the BEST tacos and margaritas! So appreciative of my Grandpa who turned me onto this place via watching a PBS show, of all things. Such a little gem in the city!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NgQS25fbqmuwZo5RsEVGCg"
  },
  "tR2d6fSpVQoEBtRAlZ-Syg": {
    "date": "8/17/2019",
    "text": "Amazing cocktails and delicious food! We were planning to get sushi next door but then we got side tracked with this place...and wow, it was da bomb!! Definitely worth the trip! You would never think a good place like this would be in a basic strip mall like this but it is and it's awesome! Our server was Nicole was super friendly and helpful..told us about all the yummy recommendations and she was right on point and got it just right because everything she recommended was ! Will definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N46bwjLDdbb9WbzG0oXBaQ"
  },
  "lCiKbVB5zo1QOSHxLuFTjw": {
    "date": "11/4/2018",
    "text": "Delicious!! Chef Richard Hinojosa elevates tacos to a whole different level-these are definitely not your ordinary tacos.  The combinations and flavors are outstanding & the ingredients are top quality.  I had the Tempura Avocado Taco & 36 Hour Beef Short Rib Taco.  Both were amazing. I love beef short ribs and this was the most tender and flavorful I've ever had. Yes, they're small-just 3 bites, but well worth it. If you're going for dinner, you'll want to order 3-4, and maybe an appetizer.   Would have had more but we had just come from a pre-wedding party and had eaten quite a fews apps before. Next time we'll come hungry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XfSSFgdSkcNsZDumjgACBg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XfSSFgdSkcNsZDumjgACBg/o.jpg"
      },
      {
        "img_id": "NElxSoVFzKUEoAnhgzFaAg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NElxSoVFzKUEoAnhgzFaAg/o.jpg"
      },
      {
        "img_id": "lkbtkA9CBC23ufIUIrav7w",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lkbtkA9CBC23ufIUIrav7w/o.jpg"
      }
    ],
    "user_id": "Bv-ROSFbyiVh1qOIge7Slg"
  },
  "idaPU7sdwux-jUby_l4gwQ": {
    "date": "8/22/2018",
    "text": "Best Margarita in the valley our waitress says....omg, on the money! I gave her my sideways, \"right, I've heard that before look,\" but, heck yeah! It truly is! It's the CRU Margarita, please for the love of all tequila lovers, order this! We're here on a Wednesday, which is all day happy hour. Our CRU Margarita is only $5, reg. Priced at $10 Let me tell you, there's no skipping on the pour here, it's Devine! The salsa trio, guacamole to die for, and ahi poke tacos, all amazing!  I always say you can tell a Mexican restaurant by the chips and salsa, these chips come out in a brown paper sack, thin, crispy, salty perfection! This place is fairly small, but the atmosphere is great, music, bar feel, with cool decor.  Winner, winner, I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "ebuN1TYjsnDL4qdiC8DgDQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ebuN1TYjsnDL4qdiC8DgDQ/o.jpg"
      },
      {
        "img_id": "zFUtlqcrxXE6Wp-cotzFFw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zFUtlqcrxXE6Wp-cotzFFw/o.jpg"
      },
      {
        "img_id": "RNVMH6UYg5Vq-NvObvQY_w",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RNVMH6UYg5Vq-NvObvQY_w/o.jpg"
      }
    ],
    "user_id": "ED7dq2rT3IWXjSl58CR36w"
  },
  "NnVPoId8oZCL8TlPADIbbQ": {
    "date": "8/12/2019",
    "text": "One of my favorite taco spots! Great happy hour as well! Very trendy spot, parking is hard, would recommend ubering if possible. The service is much better at the bar than the with the wait staff! Food is 5 stars, service is lacking a bit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MZrXqCuPRipOunniNNUs5w"
  },
  "hu3N_fr2sCT6bvsOL_ku9A": {
    "date": "2/5/2019",
    "text": "Get ready for some awesome, upscale tacos. I came for Taco Tuesday since they have some pretty good deals on their tacos, and I ordered a Cru Paloma cocktail (it was ok) plus 3 tacos: pork belly (which was basically carnitas), beef short rib, and Korean fried chicken. I liked the Korean fried chicken one the best. It was crispy, fried-chickeny goodness with an amazing sauce. Second place goes to beef short rib, and third goes to pork belly (because it was good but not that different from a regular carnitas taco).   Finally, I got a dessert taco, which changes seasonally. Today's version was butter-fried carrot cake with a sweet goat cheese drizzle and pecans. It was amazing! I highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "VqPQJQZhi2fCbBt27EozMg"
  },
  "dhfbugWvw7vmuvz0686Fgw": {
    "date": "9/29/2018",
    "text": "Small cozy spor for tacos with a modern twist. Came here with friends some time back. There are plenty of comfortable booths and hight chair tables to sit at. We were seated promptly and started with the queso....then ordered another round of queso because it was that yummy. I had the premium margarita and it was on point  I got the duck, pork belly and korean fried chicken tacos. Each one of them was presented beautifully and tasted delicious. I like that they have many choices and interesting flavors. A bit on the pricey side but they are fancy delicious tacos!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NqkSPYAuC941FzEDtuf7QA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Korean fried chicken, pork belly and duck. Nom.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NqkSPYAuC941FzEDtuf7QA/o.jpg"
      },
      {
        "img_id": "5pzmOEhVdYhSiuJQB1yWMA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Queso",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5pzmOEhVdYhSiuJQB1yWMA/o.jpg"
      }
    ],
    "user_id": "sugOF-7EYPH5yqrI-J_CFg"
  },
  "HVYu6UOvv5exW5BG7T21gQ": {
    "date": "1/26/2019",
    "text": "They had me at lamb tacos.  Once again, Yelp totally did me right by featuring this online. Whoop whoop.    These are fan-friggin-tastic tacos!    I\"ve been twice in two weeks.  (can I get a frequent diner discount?)  My absolute go to is and will be the lamb taco.  Lamb is my favorite thing to eat  <a href=\"/redir?url=http%3A%2F%2Fin.the.world&s=93de71656946b5d61069f22716ad3a7cfdf36690710ea235dce5b80348b3fafc\" target=\"_blank\" rel=\"nofollow\">in.the.world</a>.  SErved in a hard shell it's a great twist on the typical soft shell street tacos.    The short rib and wagyu are my absolute favorites as well. Be sure to order the chorizo dip appetizer. Sweet baby Jesus it's delicious.  The Happy Hour is great.  Discounts on a variety of apps and tacos as well as drinks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "cty-VP-wvpUbsa-nPGc1CA"
  },
  "wr0LfHAKJjJyRzTx3LJkmw": {
    "date": "2/21/2018",
    "text": "The best tacos in Arizona. Try the crunchy pork tacos! Their queso is also to die for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "bxNqxwVKtATwiwFMTYv8JQ"
  },
  "w65SCZglVcudsEHhshjhIg": {
    "date": "2/1/2018",
    "text": "I'm never on Yelp. I rarely leave positive ratings about anything. These are easily the best tacos I've ever had. If you don't agree, then I don't know what to tell you. The end.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "fQq8UN-PC8NyUByhMeJLSg"
  },
  "0dPxyfVPUY-drh-DsNxSzA": {
    "date": "1/19/2018",
    "text": "Definitely my new favorite Taco spot!! The food is phenomenal and I loved the aesthetic of the bar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "zpcQxZznk78H1Mvb0j3rfw"
  },
  "AvwpvWfMyC6d9IxH0GiK5g": {
    "date": "12/28/2017",
    "text": "Now this is how tacos should taste!  Gourmet, delicious and great drink selection. Try the pork belly tacos. OMG. You won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "Rw5THHUhiPL970kUWRJpJA"
  },
  "11INLTd6K0_iwhoS6khCjA": {
    "date": "12/28/2017",
    "text": "I eat at CRUjiente's probably once a month. Even after having tried some of the other taco locations, this is the place I keep coming back to over and over. Pros: The crunchy tacos are not to be missed! Best chips in town (always served hot in a brown paper bag). Creative and delicious weekly tacos (I'm not vegetarian, yet some of their veggie special tacos have blown me away)! Great cocktails (the Japanese Bees and the Premier CRU margaritas are my favorite). Cons: A bit on the pricey side, and lot parking can be limited in busy nights.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "Ia4cOvqB5BwZqtThz34jEA"
  },
  "ktbgnr2pPDesfY2sB1_cfQ": {
    "date": "3/3/2017",
    "text": "Amazing food and drinks.  Excellent service.  Great ambiance.  You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F1hAaulfKqMGu46u6tyAAQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Ceviche and Queso - yum!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F1hAaulfKqMGu46u6tyAAQ/o.jpg"
      },
      {
        "img_id": "VJ4jl5rgWQbwBLhovAKyng",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Simple but creative menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VJ4jl5rgWQbwBLhovAKyng/o.jpg"
      }
    ],
    "user_id": "hdhF1FSS6FUnCtZzU7-BmQ"
  },
  "GzkPp-h5r9w72MqaIOmx5A": {
    "date": "10/30/2017",
    "text": "They serve what is clearly the product of a passionate foodie owner! Amazing care and flavor with each dish, friendly and attentive staff, and you have to try the HH!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 7
    },
    "photos": [],
    "user_id": "BExEMULNDBx1sNPO6FeUHw"
  },
  "Lenhm-R_QGMf6mZkHY7RaQ": {
    "date": "11/11/2017",
    "text": "We stopped here on a whim after eating at another disappointing taco joint. Wow the tacos here are on another level. Not your traditional tacos, it's more like a Tex-mex Korean American fusion taco. So delicious and I'm Hispanic! I will be going back for sure!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 6
    },
    "photos": [],
    "user_id": "kfVHSDJS6m5nqOybFpzVVA"
  },
  "H6hiJuS08aYrbx2gENiB7w": {
    "date": "6/23/2018",
    "text": "We came with a large group (20 people) and the place was a little smaller than expected but service was great and the tacos were well worth the trip! Because we were a large group we contacted restaurant first and got great recommendation to place a pre-order which made the night run much more smoothly. Personal favorites were the pork belly tacos and the Korean fried chicken tacos, but really they were all tasty.  Everyone was pleased with the margaritas as well, nice variety and they came with a good amount of liquor which we all appreciated!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "NQuSDlcdThtsnjG7br4a_Q"
  },
  "hw0QyzZ75o0d9LG1tdQEww": {
    "date": "12/1/2016",
    "text": "Truly a gem in Phoenix. I almost don't want to write a review to prevent this place from getting more noticed and crowded but that's just me being selfish.  We started with ceviche and posole rojo, which is a great meat stew and it is perfect for the recent cold weather. They were amazing but what really hit home run for us were the tacos and their drinks. We tried both tacos crujientes (crunchy tacos) and tacos de la calle (street tacos).   Beef tacos cruijentes - a solid hard shell taco packed with meat, fresh veggies and a little bit of kick.  Pork belly - juicy and flavorful. the kimchi topping, which is not your typical red kimchi but more like a pickled white cabbage, is a great touch.  Blue crab - a great solid crab taco. I love the avocado mousse they use on this taco. it was my friend's favorite. 36 hour braised beef short rib - super soft and lot of flavors this one! My husbands favorite but must warn you, it is spicy! korean fried chicken - I didn't order this one mostly because I'm korean and was afraid that my love for korean fried chicken would make me a harsh food critic. But my friend who's tried it said it was amazing. I'll have to give it a try next time.  As for drinks, they have an amazing drink selection - beer, wine, spirits.. you name it. I don't remember the names of all of them but we each had at least 3 cocktails because they were delicious. Also got to try the best mezcal I've had so far per the owner's recommendation - Crema de Mezcal. Lightly sweet and very smooth.   To top it off, everyone at the restaurant was very attentive and provided top-notch service. I recently moved out here from LA and my husband and I've been looking for our go-to spot. This place might be it for us. Service, food, vibe - Crujiente Tacos has it all.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 14,
      "cool": 10
    },
    "photos": [],
    "user_id": "f6fIiudJ4-w9P5cpGv_4uw"
  },
  "ympka6s3abN7Yia_8zm7ZQ": {
    "date": "2/22/2017",
    "text": "I said that I would try every single Taco on their menu. So today I tryed three new tacos and of cores there famous pork belly taco \"amazing\". First up was the duck Taco that had sweet taste of mole sause, sesame with a hint of peanut and a tab bit of verdant salsa, the duck was so tender and full of savory flavor. The 2nd Taco was the ahi poke. It had seaweed, green onion, kawasaki and sweet taste of taro root. Then I tryed there Taco of the week. It has white bean octopus and chorizo. I have never tryed some thing here and not enjoyed it. The pork belly I would say is still my favorite but the duck and octopus are right behind it. If you come you have to try these three tacos. Their staff is always friendly and very knowledgeable about there menue. Thank you agen for the amazing experience.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wHGm7mrIAeWO--Ia4Bj6jw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Taco of the week. Smoked, roasted spicy flavor. Very unique but equally amazing.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wHGm7mrIAeWO--Ia4Bj6jw/o.jpg"
      },
      {
        "img_id": "k1GeUT_tBD-g516cLkOOPw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Pork belly taco. Amazing",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k1GeUT_tBD-g516cLkOOPw/o.jpg"
      },
      {
        "img_id": "yM9N9Oe7TI5WwVvaYvLFZA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Duck Taco with mole, sesame, peanut and Verde salsa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yM9N9Oe7TI5WwVvaYvLFZA/o.jpg"
      }
    ],
    "user_id": "EgUGBGTJUvFJgHyFwgpD1w"
  },
  "WFHRTwSB5bL0N2Vt_YQ3Vw": {
    "date": "5/10/2017",
    "text": "The moment you walk into this place the decor is outstanding!!! Such beautiful design. Went in with a few co-workers for happy hour. The margarita is real!!! Tastes real good, strong, and made from scratch. For apps ordered the guac and salsa trio, which were fantastic but I thought was too expensive when you can get similar salsa for free at other places.   What did turn me off was brown paper bag for chips. Wtf, I paid $6 for chips and salsa and you can't give me a plate? That's not creative, that's lazy.   The street tacos are so well thought out! It's Mexican classics with Asian influence. I ordered the following tacos: Korean fried chicken, shredded beef crunchy, and avocado tempura. The best one was the crunchy beef, hands down! Everyone else also really enjoyed their tacos.   The waitress informed us that in 2 weeks they will begin margarita Monday's so will have to most certainly come back!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yN79HCg03IxyuRDR0zQ3-Q",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Yummy tacos and weird brown bag for chips.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yN79HCg03IxyuRDR0zQ3-Q/o.jpg"
      }
    ],
    "user_id": "WTZgRgJPmsTY49B4rXXjuw"
  },
  "VYyzDc_sMoWs6FhjfCXFBQ": {
    "date": "3/6/2018",
    "text": "Tonight was my first visit to CRU and overall I enjoyed. Our waitress was great very friendly and she was on point so good service is always a plus. The handmade margaritas for $5 is the best ever. Definitely the best hh margarita I have had in a long time so I would frequent this spot for those alone. I tried the Korean chicken taco which was different, interesting and yummy. It's fried so probably not your healthiest taco but yummy and it's a street taco size so you don't have to feel too bad. My cousin tried the lamb taco which she didn't like but supposedly they are a fav so maybe try it for your self. I also ordered a quesadilla with chicken. It was not  the best. It was nice and crispy but it was gobs of cheese and even for a cheese lover you want more chicken than cheese which it was not. It was a kids and it was $10 so please more chicken than cheese. I would definitely come again but I would stick to the yummy CRU margaritas and the Korean chicken tacos and I would be a happy camper.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0bzu2z06rqOCvwYxtGOe0A"
  },
  "bB0aYqR9iuHKwRQ47u9ktw": {
    "date": "3/19/2018",
    "text": "I was excited at first because it was $5 margarita Monday. The margarita was good but that's really it. They charge you $6 for chips/salsa and $5 for tiny tacos. I was still hungry with a $30 bill when I left.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DlyraO7cid89jGLFNWtt4g"
  },
  "GsrRhCh090pjk-UeHb6MWg": {
    "date": "11/22/2017",
    "text": "Hands down amazing food! I have never had a bad taco here, in fact, they are some of the best tacos I have ever had. The chorizo queso and salsa trio are great for starters. The owners are around most of the time and are extremely friendly!! Little known fact- the owner is quite the wineo, and if you are as well you should take a couple extra minutes to talk to him and to try his favorite!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "q4Q0o08UukwlvEidKISDnA"
  },
  "6fxPsd8cf__v2Jhuxq_OdA": {
    "date": "11/12/2016",
    "text": "So so good. I was really impressed with the place. The tacos were phenomenal. The drinks were also very good. The place was dark and cool. The chicken taco and braised how many hours pork was so good. I'll for sure be back.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 10,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "rqcWRdH37VjAidiauKfIUw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Oyster special back and chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rqcWRdH37VjAidiauKfIUw/o.jpg"
      },
      {
        "img_id": "u6pp_QkTNUB_WwT4jcEDxw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Steak, pulled pork, chicken, duck",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u6pp_QkTNUB_WwT4jcEDxw/o.jpg"
      },
      {
        "img_id": "2oUFpjffd_j9Ze1A590cBw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Avocado , ahi poke, blue crab tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2oUFpjffd_j9Ze1A590cBw/o.jpg"
      }
    ],
    "user_id": "I1vJAnZ3-hUcD9gE8m00_g"
  },
  "UzBANzh3N41J0PS-wUJZvQ": {
    "date": "11/17/2016",
    "text": "First, it's beautiful inside! Second, menu was unique in an amazing way. I had the Korean fried taco, blue crab taco and their AMAZING ahi poke taco. All were more than great. The Ahi was my favorite, I even asked the owner Jason if I could buy from the chef.   Will most definitely be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 11,
      "cool": 3
    },
    "photos": [],
    "user_id": "N4rb5FoeQAXWMzhjPmqRbA"
  },
  "10g772NSvZ6qAF-wzXx0wg": {
    "date": "11/8/2016",
    "text": "Do you love crazy-delicious tacos for $5?  Think crab, duck, 36-hour beef short rib.  It's True!  Do you love world-class wine by the glass?  It's a romantic sports bar (I'm not kidding, this is possible) and they pulled all of this together in Arcadia at CRUjiente.  Big fat yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 11,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "jd4P51soUTh4YUF5_AYQCA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jd4P51soUTh4YUF5_AYQCA/o.jpg"
      }
    ],
    "user_id": "TJ4UGAIC7g8kF4hXSCYMJg"
  },
  "l7BfLY6hojOMaGqPQ7KG9g": {
    "date": "11/26/2016",
    "text": "Each taco was made with great care.  Crispy lamb (crujiente) is a velvety love song with a crunch in my mouth.  Korean Fried Chicken is a meticulously constructed Asian/Latin/crunchy buffalo wing kind of fusion I'll go back for again and again. Respectable beverage program with accessible prices too. Both owners are on site, all the time. It's a winner. Welcome to the neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 10,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WZ8SLGWDP8HnmqooG0B70w",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Lamb crispy taco and Korean Fried Chicken street taco.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WZ8SLGWDP8HnmqooG0B70w/o.jpg"
      }
    ],
    "user_id": "d196Lj2Pp_p0E7UNPZLIKg"
  },
  "EhM3N3uPkLyyuZX_igAOwQ": {
    "date": "11/18/2016",
    "text": "My boyfriend and I stopped by after work for a bite to eat. We both ordered cocktails to start. Definitely try the Fresh and Hot! Hendricks gin and elderflower, with a dash of cayenne pepper for heat. We also ordered the beef short rib taco, ahi poke, and the pork belly. The beef short rib melted like butter in my mouth. The staff is amazing and very attentive. If you get a chance, definitely splurge on some Yamazaki 12 year single malt Japanese whiskey on the rocks. Very smooth. Just an all around great place. Welcome to the neighborhood Crujiente!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2jRgc9Y_qzL2AeMnjI29MA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. The pisco kid - porton pisco, elderflower, lime, berry blossom white tea syrup, mint and grapes.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2jRgc9Y_qzL2AeMnjI29MA/o.jpg"
      },
      {
        "img_id": "EHs0vo2kC0-vbRVhnGg2AQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Pork belly street taco on the left, 36 hour beef short rib on the right.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EHs0vo2kC0-vbRVhnGg2AQ/o.jpg"
      },
      {
        "img_id": "rHukU7r2HuZPO2XpjwaeCg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Yamazaki on the rocks!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rHukU7r2HuZPO2XpjwaeCg/o.jpg"
      }
    ],
    "user_id": "D17rT7ODuT09YdbHfBhwbg"
  },
  "I3go0mgGjpBcOAtxt41yxQ": {
    "date": "2/27/2018",
    "text": "I honestly can't believe how much I loved this place! A friend recommended this restaurant and tonight we finally stopped in! It's a neat setup with plenty of seating for being a seemingly small space. We came on Tuesday so many of the tacos were discounted all night for taco Tuesday! We missed the happy hour cutoff, but ordered their house margarita anyway and it was worth the couple extra bucks! The margarita was simple, but so delicious-you can tell it's made with high quality ingredients. We started off with the salsa trio  & chips which was great. Between my husband, friend & myself we tried one of each of the taco CRUjientes (beef, lamb & pork) which were all delicious. Simple but well seasoned. We also had the Texas Wagyu Cap Steak, Pork Belly, Korean Fried Chicken & the 36 Hour Beef Short Rib. They were all delicious & put together so well! My favorite was the pork belly, but my husband raved about the wagyu steak. Jason, one of the owners stopped by the table and you can just really tell he is passionate about the place they've created. They don't just put any old toppings on a taco, they really do take the time & energy to craft their menu, tacos & drinks. We will definitely be back & can't wait to try their taco or the week!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "97gJqJ9JzvMyXHB8xfigqQ"
  },
  "-uirFOTsBEvPLr4aRmjGCw": {
    "date": "3/12/2018",
    "text": "Perfection! We LOVED CRU and can't wait to come back. So flavorful, balanced and we were already making plans on the calendar to come back before we were even done with our meal!  We went during Happy Hour (6 Days a week fri n sat too) and I highly recommend if you like trying different foods/flavors- your wallet will like you too! But really anytime works best for me, because it's worth every bite!  From the margaritas, ceviche, Mexican Caesar salad w roasted poblano dressing and ALL the tacos (although we didn't try the taco of the week - sweet potato), we did have every other taco on the menu (and except the tempura avocado and any of the CRUjientes tacos). Each and every bite was phenomenal. The pork belly, short rib and ahi poke stood out, if that's even possible, because just Yum on each and every flavor so different from the other!   As to all the people who wrote comments about size and price - you definitely get your money's worth here! And for the people who write about Bien Trucha or El Toda Madre (40 Miles outside of Chicago) there is NO comparison. Between the textures and differentiating flavors - there's Nothing we've found yet that even comes close to CRUjentes.   If you are a foodie and looking for a genuinely culinary experience, great service, clean and hip atmosphere and at a great price - mark your calendars today!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RNVE5O6CWb9ZtraKz3hwDg"
  },
  "qO1_3LXC2skCNIjdtesl3g": {
    "date": "8/25/2018",
    "text": "Wow!  Really kicking myself for not trying this spot out sooner.  Had quite the sampling of food and drink and was pretty blown away start to finish.  Our server was very helpful and attentive.  She recommended doing both the hard and soft shell tacos, which is absolutely the way to do it.  I'm really hard pressed to pick a favorite between the lamb, fish, and shrimp tacos.   The guacamole was very flavorful and the corn appetizer was an unexpected score.  Cocktails were well balanced and delicious (their version of a Cadillac marg was fantastic).  The only constructive criticism I would have is that the hi def TVs at the bar should be larger given the distance from the seats.  Can't wait to come back here. Food: ***** Ambiance: **** Service: **** Value: *****",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UnjGNyK3gy4XxyJOfu4izQ"
  },
  "aQe2fR0GP92Jpk_mGz8yvA": {
    "date": "3/10/2018",
    "text": "The atmosphere at this place is incredible. We sat at the bar and had a great time. Everything was good, but I think the only thing that was great was the Korean taco.   Queso: 3 Stars Deluxe Margarita: 3 stars Shrimp Taco: 4 stars Short Rib Taco: 3 Stars Korean Taco: 5 Stars",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-FeqoKlGNu3y4unodMJUkA"
  },
  "BshegXCt36mfQoPbvy80Jg": {
    "date": "3/1/2018",
    "text": "I had high hopes for this place, unfortunately it was just ok (but service was excellent!).  I like that they have a reverse happy hour on a Friday.  Great deals on Tecate during that time ($2.50 or $3).   We tried 4 different tacos and they all sounded so good, but were underwhelming.  We had the pork belly, Korean fried chicken, fish and short rib tacos.  The short rib was a bit tough.   My husband usually loves Korean fried chicken, but took one bite of this one and wouldn't eat any more.  Of the 4, I thought that one was the best.  We also had the salsa trio, which also was just OK.   Overall, nothing spectacular, but worth checking out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vdcMSIk0qRRf2zqohHKrhw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vdcMSIk0qRRf2zqohHKrhw/o.jpg"
      }
    ],
    "user_id": "Px4JRdOxgFiWH5edeOTSSw"
  },
  "_UNOSxb3p92mOaFkChshvA": {
    "date": "3/16/2019",
    "text": "No hostess. Poor service. Bartender did not know how to pour beer. When the waitress brought the beer, it was over half foam. She instructed me to wait until the bubbles were near the top and then drink it. (I know how to drink beer, tell your bartender to learn how to pour it). Waited about 15 minutes for the bubbles to settle and was still about one third foam and not even a full glass. Ordered 4 tacos. 2 were good (avocado taco is great, and duck confit was good but bland for having a habanero reduction) 2 were bad- goat taco was dry and bland, pork belly taco tasted like fish. (Wtf?) while food was decent, would definitely not go here again. Overpriced, poor service.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XqaIl6NFLQ9ld5pAN6jJPg"
  },
  "Im-qBAnLH-1Ueu-4BDHfog": {
    "date": "3/1/2019",
    "text": "Boom!  If you live gourmet tacos (as I do) and fresh margaritas (as I do) this is your place.  Food was on point, guacamole had perfect blend of spice.  Great experience all around and we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3hMosxOga4TSrPLFL3w1Ow"
  },
  "pwr7tXIRjqCQT4vzNf9GNg": {
    "date": "12/14/2017",
    "text": "This place is a diamond in the rough. The food is top notch. It's become my new favorite place to hit up. Make sure you come in during the week after 3 PM and have Laura at the bar mix you up some of the best cocktails in Phoenix. If you don't know what to pick out on the menu, just ask Laura. Every time I've been there all of her suggestions have been outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Yxh0bmFnKLl6dYuc9YLUrg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Yxh0bmFnKLl6dYuc9YLUrg/o.jpg"
      },
      {
        "img_id": "V74MfgKmCVAIEzQYCrH_eA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/V74MfgKmCVAIEzQYCrH_eA/o.jpg"
      },
      {
        "img_id": "Xf-kT_U25LQhNhR14ALUqg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Xf-kT_U25LQhNhR14ALUqg/o.jpg"
      }
    ],
    "user_id": "Q-7NYuVqqHiqfCjWZqbWOQ"
  },
  "5JF52HeDo4yDTg_Ykm50_A": {
    "date": "12/12/2016",
    "text": "(Lyrics - Bananarama - Cruel Summer)  Hot spicy sauce And my palates are burning I sit around Trying to Yelp and  The food is so good and fly Strange voices are singing (What did they sing)  Songs from the 80's  It's too close to my heart This drink has got Right out of hand  It's at Cru, it's at cru! CRUjiente! Leaving me here on my own It's at Cru, it's at cru! CRUjiente! Now with a song!  Tacos and whiskey.....what the funk!?  For me the two doesn't work well, but I had to give this a try.  Needless to say, I wasn't disappointed at all.  My friend and I started out with fresh made chips and guacamole. The chips came in a brown paper bag and once you open it; like fresh popped corn it was steaming!  The guacamole was thick and creamy with some onions, cilantro, and a hint of lime.  For our entrees we shot for the street tacos obviously!  I ordered the Short Ribs, Lengua, and Pork Belly tacos.  The Short Ribs were tender, but I thought the house hot sauce was so spicy; it over powered everything else on it.  The Lengua, was a bit chewy but all good cause the radish, onions, and cilantro helped with texture and the avocado & guajillo sauce gave it a mellow almost smoky bite.  The Pork Belly was probably my favorite cause it had crunchy bite along with the pungent kimchi sauce and siracha aioli giving it some kick.  As for whiskey, yeah I drink them, but I'm no connoisseur by any means.  The bartender recommended some for me and my friend and he seem knowledgeable about different brands and what we wanted.  There were different whiskey from other countries and well as price points.    In the end, Crujiente was a fun and great foodie experience.  The street tacos were fun since they have different toppings that I didn't get to yet, but plan to.  Whiskey lovers come and get your palates wet - wink! - Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 14,
      "useful": 20,
      "cool": 15
    },
    "photos": [
      {
        "img_id": "Ur-2T6zEeot-0fHcGLI6FQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ur-2T6zEeot-0fHcGLI6FQ/o.jpg"
      },
      {
        "img_id": "izA2dEsaJXQKOv7-Atw8KA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/izA2dEsaJXQKOv7-Atw8KA/o.jpg"
      },
      {
        "img_id": "q-xctoANu6dh4nVuH-XO6A",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/q-xctoANu6dh4nVuH-XO6A/o.jpg"
      }
    ],
    "user_id": "kjeX2RXvW7RhBbD2QLd5jA"
  },
  "hEniWbqjMTbX47UA5Y1VUQ": {
    "date": "3/9/2018",
    "text": "Oh em gee!   Tacos are fresh!! Cocktails are fresh!! The owner abviously cares.  Personal connection with everyone in the restaurant.   From an OI org health perspective i would buuy stock if it was a PTC.   But no.... Its ok!   Bring me more tacos!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qdnFbywyGNoULuOkz5WvXQ"
  },
  "vkXzpVSkBvjnyU-w7iyd6Q": {
    "date": "4/30/2017",
    "text": "We're huge fans of Sushiholic, which is right next door, so we've walked past Crujiente Tacos multiple times.  We decided to meet some friends for dinner this time, and we made it just in time for happy hour.  I had the duck, tempura avocado, and tuna poke street tacos, which were all priced in the $4-6 range per taco.  Normally I wouldn't balk at paying this price; Phoenix has a large number of upscale taco restaurants which use gourmet ingredients and therefore charge a little more for their tacos than you might pay in a hole-in-the-wall Mexican joint.  However, the tacos at Crujiente are much smaller than other gourmet tacos that I've had.  Each taco was approximately two bites, which is fine if you're not hungry, but when you do the cost per bite math, these tacos are more expensive than sushi.  They were good, but not unique enough to justify the cost.  That said, we got the $5 margaritas off the happy hour, and those were worth every penny.    I'll probably find my way back here again, but it'll be for the margaritas, not the tacos.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "MwWO6axFPTCXqN0DAfUhIQ"
  },
  "CcUayXCSS4GBvW__ZoHWMg": {
    "date": "8/19/2018",
    "text": "I found this place on Yelp and now I come every week with my family. The Korean fried chicken taco is the best. They always have a weekly special for a taco. I have tried just about everything on the menu and never was disappointed. The executive chef has a hand in everything. It's always perfect. The service couldn't be better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4RASyCC4LyP6ygP2Dts5FA"
  },
  "gdR_3F932EpWdfF6leof6g": {
    "date": "3/12/2018",
    "text": "Good food, focused menu. Maybe I missed the \"sides\" portion of the menu, but I usually expect something besides chips to go with my tacos (beans, rice, etc). We had two rounds of chips and I had 3 tacos and I was still pretty hungry. Anyway, the service was OK. The parking lot is awful, as is typical of that part of town... though they're one of the seemingly few places without a valet. I'll probably be back, but I'll bring an after dinner snack in my purse.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YzGQCUxpiN607wYX06x3BA"
  },
  "LBuoMm8HbERpnoOGGiE4hQ": {
    "date": "7/28/2018",
    "text": "Outstanding restaurant. The food was great, the flavors were the best, drinks were great and the service was great. I would recommend this place in Phoenix. It is tucked away but a great find and the will not disappoint with all the great flavors of the food. Great job Chef!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "IwPYzEo4PXkuGBRqBTptCA"
  },
  "2OHFck62s55nA_cQuAU6Rw": {
    "date": "12/12/2016",
    "text": "This is a PHENOMENAL taco spot. If you're looking for tacos with a flare to excite your taste buds this is THE PLACE. TACOS: Their Blue Crab Taco has a light crispiness that is complimented with an avocado mousse that is absolutely AMAZING and goes to show they aim for TEXTURE- a go to for anyone willing to try something different in the taco world. It doesn't end here-their margaritas is a glass of goodness in itself...DRINKS: Arcadia Maragarita is the place to be the jalapeno adds the right heat and is cooled with a slice of cucumber all of which is swimming in top notch tequila....not done, DESSERT: A strawberry pico sitting in a Mexican spiced chocolate mousse with cinnamon sprinkled fried dough that had been drenched in sweetness.   But the food met with the kind of \"let-me-introduce-you-to-my-family\" kind of hospitality makes it a HOME RUN!   SUMMARY: This is a restaurant that presents with QUALITY in their tacos, drinks, sweetness, and service.   I will be back again and that's a GUARANTEE.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 10,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "qov0WCSpTWrFBaK3gVYRbA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Premier Marg. Blue Crab Taco. Lengua Taco. 36 Hour Short Rib Taco.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qov0WCSpTWrFBaK3gVYRbA/o.jpg"
      }
    ],
    "user_id": "gqtW5jXTlIYzB5Exclk2YA"
  },
  "H6FoYML1hHLL7R3SjQtUpw": {
    "date": "8/28/2018",
    "text": "Great atmosphere, good Happy Hour. The Korean fried chicken is worth the visit. The gochujang sauce on the Korean taco has the right amount of heat for most people without being overpowering. The lamb taco was perfectly balanced. The pork belly taco was good but missing a little something for me. The service was spot on and attentive without being overwhelming.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g9JKnMpUb7_8IRixFzrRNg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. House margarita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g9JKnMpUb7_8IRixFzrRNg/o.jpg"
      },
      {
        "img_id": "Lhwn_1VkLjVgegFDNPFRMA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Korean fried chicken taco and lamb Crujente taco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Lhwn_1VkLjVgegFDNPFRMA/o.jpg"
      },
      {
        "img_id": "uAmtJVKo1ZDfvD_auqO6BQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uAmtJVKo1ZDfvD_auqO6BQ/o.jpg"
      }
    ],
    "user_id": "VFIyZ-HdcuiMRVfC2_aVEA"
  },
  "YmqUpCtOKQFMXunwQc3OKQ": {
    "date": "6/15/2018",
    "text": "Such fantastic food. Everything was so well crafted and the flavors were all very well put together. The tacos looked like an art.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "oEzd6VfGScuv4t45jVidLw"
  },
  "592W4dqPcz5LiixqCcgatA": {
    "date": "7/28/2018",
    "text": "The drinks are delicious! Highly recommend the margaritas during happy hour! The bar is stainless steel with a very comfortable leather arm rest positioned in front of the bar top. The tacos were really a missed opportunity. They did not get the flavors right on the Korean or pork belly taco. Service was awesome but food is crucial if you're going to be serving it -2 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NQRySZO19Edme289X3silw"
  },
  "88Zl-5xqM8zvR9arl8pDDw": {
    "date": "11/7/2016",
    "text": "Oh my freaking yumminess on the chef's 36 hour Beef Short Rib 'Tacos De la Calle' (house hot sauce, cotija, onion & cilantro) was ohhhhhh so tender with the an amazing spicy kick that I fell in heaven with. Again oh my freaking yumminess!!!!!  My fave!!  Also, had under 'Tacos De la Calle':   Pork Belly (house quick kimchi, cilantro & sriracha aioli) & their award winning Korean Fried Chicken (gochujang, mojo de cebollin, compresses cabbage). Very light & nice flavors.   Under 'Antojitos':  Aguachile (New Caledonia prawn, lime, jalapeno, radish & cilantro.  Truly Fresca tasting: little avocado balls was so clean & fresh tasting almost like off the vine fruit taste. Mmmmm.   And my specialty cocktail was absolutely perfectly balance, clean, & delicious:  Whiskey Mango Foxtrot (Makers Mark 46 Bourbon, ginger, mango jalapeno shrub & orange bitters).   Great music, service (Joe was great) &  atmosphere!!  They are passionate about food & restaurant and you can tell.   PS: no to go orders per chef. He's that proud & passionate that his food being optimal yumminess.   Definitely taste the pleasures!!  PSS:  Mmmmm getting yummier on 2nd time & I swear I can't decide lol: Lamb Tacos Crujientes (flavorful, moist, not gamey deliciousness), the Pisco Kid cocktail (Porton Pisco, elderflower, lime, berry blossom white tea syrup, mint, grapes -save grapes for last because best tasting grapes when it's all infused), Pork Belly Tacos De Le Calle (nice smoky flavor came through tonight).   All of it was amazingly delish!  Also, on special kids menu: munchkins love it with ooooooey gooooooey cheese but still grown up enough w/tastiness for kiddos who usually don't prefer kids menu because sometimes being bland-not here yummm!",
    "rating": 5,
    "rated": {
      "funny": 14,
      "useful": 24,
      "cool": 19
    },
    "photos": [
      {
        "img_id": "t23BmalAN7-qx2F_QMRMiQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Happy Hour Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t23BmalAN7-qx2F_QMRMiQ/o.jpg"
      },
      {
        "img_id": "xVm7QTx6B61OPf09zkbHMg",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Taco de la Semana: Thai Shrimp w/ coconut green curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xVm7QTx6B61OPf09zkbHMg/o.jpg"
      },
      {
        "img_id": "HQZX4_AFIgaALBtMek_zaQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Pork taco crujientes: juicy &amp;amp; crunchy freshness",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HQZX4_AFIgaALBtMek_zaQ/o.jpg"
      }
    ],
    "user_id": "zFp22UYxTFPmyFDjkSy7FQ"
  },
  "PT6DOlKeGLGSG5xsfQoing": {
    "date": "11/14/2016",
    "text": "There needs to be more stars than 5!!  We couldn't stop ordering! What we ate and each review: * blue crab taco - the best seriously hands down to any place I have been in San Diego or San Francisco! Seriously! *  Korean Fried Chicken - they are right keep this for the last it cleanses the palate and man is it delish!  *  hubby had short ribs, duck, and lamb - can't go wrong all was amazing as well * avocado tempura - amazing!  Light and delicious!    This place really knows what they are doing with the flavors and caters to your palate!  Once you come, you're hooked and a regular!  Like ME!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 11,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "XRPH1Aqk0GLiOOnqywSkcA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Carmen&amp;#39;s banuelos!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XRPH1Aqk0GLiOOnqywSkcA/o.jpg"
      },
      {
        "img_id": "ylNPvFaU7Pnm5orW4Y_B5w",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Carmen&amp;#39;s banuekos!  Yes!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ylNPvFaU7Pnm5orW4Y_B5w/o.jpg"
      },
      {
        "img_id": "6cOrkjVwzX8_dqu1ttB1BA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Blue crab!!!  YUM!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6cOrkjVwzX8_dqu1ttB1BA/o.jpg"
      }
    ],
    "user_id": "TseW_BaZU0wIjnBvrTTe4Q"
  },
  "HefM0H6Ga1dhjb-DwHLbwQ": {
    "date": "4/10/2019",
    "text": "It's a terrific restaurant! Unique and delicious food. The only flaw is the music a tad too loud. We had to talk loud and above it - exhausting!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "2o2logV9FnzRqs2CanQmzg"
  },
  "WR5VBSW2gFsfoYItGXB2jg": {
    "date": "7/7/2018",
    "text": "Literally amazing.  I am so glad I randomly found this place on the hunt for food.  The summer squash taco is my favorite. For  more reviews please go to <a href=\"/redir?url=http%3A%2F%2Fwww.hopeshabits.com&s=866acca67b4fc56254ffd7c3f91d1a0c56e737c27e8c57748733a05838e7353a\" target=\"_blank\" rel=\"nofollow\">hopeshabits.com</a>",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7LZXwvz2rgDea1WHVUDXZQ"
  },
  "RJLX4RaenK_L3K7H10q9Lw": {
    "date": "1/29/2019",
    "text": "I love going there with my family. Great food and great experience.  I would defiantly recommend the Korean fried chicken and the trip sauce with chips. I wish they would have a closer location to Tempe, Camelback location could be a little too far, but for the good test of food, it's worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L6HJVfPEKiCw9L2gpIlWjQ"
  },
  "Wwn50ZWE23_weir8ztywyg": {
    "date": "9/2/2017",
    "text": "This place deserves more than 5 stars!  Seriously my favorite taco spot in all of Phoenix.  So unique, such fresh ingredients, can't say enough about this place!  I had the Korean Chicken Taco and their special taco of the week, fried green tomato with some spicy type of sauce on it....oh my, the best thing I've ever eaten!  The margaritas are delicious and so is the guacamole.  We visited on Wednesday when it was happy hour all day!  And Tuesday's are all day taco happy hour!  You seriously can't beat their specials for such awesome food!  I live in Anthem (way north Phoenix) and this place was well worth the drive!  Go.....soon!  You won't regret it!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 7
    },
    "photos": [],
    "user_id": "ueQHkQ4FnUB2rXOGL0IkJw"
  },
  "oYsp2H5SJTv7xSYpNo4peQ": {
    "date": "10/25/2018",
    "text": "Great food, the tacos are the best. Staff was friendly, helpful and courteous. Posole was delicious. Shortcoming: the place is too small",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "bXLIE_E0FAkScXigYtUb8A"
  },
  "NeAKi8MV_kd4KaHBJ63vhg": {
    "date": "11/30/2018",
    "text": "My fav place for tacos and happy hour! Staff is always very nice! Drinks are fantastic. I seriously love the pot belly taco the most.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SOL1gtHnI07jCJSHfq_spQ"
  },
  "xu4a0XFNkliZNnef1e6aZw": {
    "date": "10/16/2018",
    "text": "CRUjiente Tacos has quickly become my favorite place to devour amazing tacos! Service was great but nothing tops the food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "qd_5sHqCDmbtXHpDKUz8Dg"
  },
  "qB371XByzZDyEVWYpiiYHQ": {
    "date": "10/25/2018",
    "text": "OMG.  What a great place. Scores five stars in all areas. Beautiful comfortable bar with great service , understated music and high quality TVs. Every item on the menu is a work of art and a culinary home run. Flavors are awesome and each taco is better than the next. World class pasole is another great find. Great happy hour. Best margarita with nothing but fresh ingredients.  Met the owner..(Jason). great guy, with unbridled passion for what they are doing. See laura at the bar.. she is super. Good news is that i still have more to try next visit! Bring friends... hang out and indulge.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "TN0NfiZj6RI6hkgk-7vOdA"
  },
  "JC_ktE5JIeH-2AbWVjReWA": {
    "date": "5/8/2019",
    "text": "First time at CRUjiente, great atmosphere. Had Lauren as a waitress she was great, suggested we I try pork CRUjiente tacos! It's close to the perfect taco as she had said! I'll be back again!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_pbFyE0w658gHxVYmbKcdw"
  },
  "PfK3cJ9SpNHv3OtDefWDHg": {
    "date": "10/24/2018",
    "text": "We were there last night to celebrate a family birthday. The margaritas are spot on excellent. The tacos were tasty, but we were disappointed that there could be no changes in the menu. We had requested a taco be crunchy instead of soft. No way Jose!!  Also, there are only two vegetarian tacos on the menu. Our server was great, no complaints. My advice, be a little more flexible.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rbNGXS884cmdVV8Xq7e5tw"
  },
  "cRJFBD5nH5WSt0Fdu-7Gug": {
    "date": "10/5/2018",
    "text": "This place is where you go to get a different/fancier spin on tacos. Our waitress was amazing, made great recommendations, and knew her stuff. They are a bit on the pricier side for tacos, but again it's a fancy joint. Their crunchy tacos are great tasting as well as their dessert taco! Would go back if I was trying to impress some company.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "r5qqCTCS8I719ALWFGSkMw",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r5qqCTCS8I719ALWFGSkMw/o.jpg"
      },
      {
        "img_id": "6bXIiaVyGdTl6RMPyt4sWA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6bXIiaVyGdTl6RMPyt4sWA/o.jpg"
      }
    ],
    "user_id": "ky2dWsgSRrw2nNJQ6DtM1A"
  },
  "rXyyRSGjxnAkKc5ZN4xxzQ": {
    "date": "8/31/2018",
    "text": "Ok hard to believe but they really have the very best tacos in the whole world!!   One caveat, watch your bill during happy hour, they charged us the wrong price on our margaritas. However they still deserve 5 stars for their amazing food and great service!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "-NwEzOvh0WBI_uY0H6tm3A"
  },
  "xsVYazBiiPHxhnMlmPW-mg": {
    "date": "5/15/2017",
    "text": "Tried out crujiente at the taco festival and loved it. Been waiting to come here since they opened but we are rarely on this side of town for dinner Finally got to make the trek and honestly wish we would have come sooner The tacos were very gourmet and delish!! The ambience is great and the beers on tap are solid.   Thanks chef!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 12,
      "cool": 4
    },
    "photos": [],
    "user_id": "GWtgqybuv6uDjdv-kOZAxA"
  },
  "KQQtbi_IvnKQ6aOgl_TfzA": {
    "date": "3/14/2018",
    "text": "Pros: Korean chicken taco was excellent and great happy hour specials.   Cons: Parking lot is very busy and it's not easy to find a spot, queso was bland, fish taco had a fishy taste.   I wouldn't go out of my way to eat here. Blanco Tacos is a better option in the area.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "maK3UBQczh33NuDjBYeHrA"
  },
  "udpS-bOv0oCDDocMBD2efg": {
    "date": "9/20/2018",
    "text": "This cozy casual spot has amazing margaritas, great service and not mention awesome tacos! The fish and lamb were both tasty, well seasoned and topped with perfection. Expect to be wowed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Q-sNqoXi7_SpNoNe-A4jlg"
  },
  "JnVq_0FZYhfE_6-7JilVnQ": {
    "date": "9/8/2018",
    "text": "A great diamond in the rough. Although it is in a strip mall with limited parking, it is SO worth it! A great selection of alcohol (although the beers are mostly IPAs) the food is phenomenal. I had the Ahi tuna poke tacos and it was so fresh and very delicious. My friend go the queso with chips. Perfectly spiced and the chips had just the right amount of salt. It was my birthday so we got a couple of the seasonal dessert tacos, which happened to be the cheesecake tacos. The strawberries were fresh and tart, the basil was an amazingly fresh touch, however it was all placed on a corn tortilla which was quite overpowering. The atmosphere was so classy, yet relaxed. The bathroom was clean and bonus points for the playlist! (Puscifer came on!) They offered a couple different beers from a collaborative with The Belching Beaver and The Deftones, which I was very excited to try. The hour drive from Surprise was definitely worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Z-3E4_LEjvoqkHA2lQGV8Q",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Dessert Taco- The strawberries are fresh and tart, the basil is perfection, HOWEVER the corn tortilla is a little overpowering.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z-3E4_LEjvoqkHA2lQGV8Q/o.jpg"
      },
      {
        "img_id": "Yg8sHg8dx4oGuFFSGqIgDQ",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Queso",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Yg8sHg8dx4oGuFFSGqIgDQ/o.jpg"
      },
      {
        "img_id": "wBXqP1NEvH477efwAs9BXA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States. Ahi Poke Tacos*",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wBXqP1NEvH477efwAs9BXA/o.jpg"
      }
    ],
    "user_id": "1kWdAv7pLWFC-3S2iQyJgA"
  },
  "8MA_lybCPWGk2sYHHt3hmg": {
    "date": "3/20/2019",
    "text": "Fun night out with friends with our first visit to Crujiente Tacos. Great selection of food and all tasted excellent. The service was good despite the nice crowd.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QwXcWqeGHTxP-BrXFWzz_g"
  },
  "Bf3y8NW5oX9jTt5g9HquDA": {
    "date": "1/1/2018",
    "text": "I met friends here that LOVE this restaurant. I loved the company, and the service was excellent, but the food lacked flavor to me. I'll try it again with them, but wouldn't go out if my way unless I'm meeting them.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "xpky-OSam_D-8FUEmyd5uA",
        "caption": "Photo of CRUjiente Tacos - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xpky-OSam_D-8FUEmyd5uA/o.jpg"
      }
    ],
    "user_id": "Isf8G6HPbNqEisKDjmUlbw"
  },
  "8i_A60UjRL8OT2ptHuy7Sw": {
    "date": "1/27/2018",
    "text": "Super delicious! I tried their famous Korean fried chicken taco, pork belly taco, and CRUjiente beef. Loved all three of them.  I would say the Korean fried chicken taco was my favorite.  The display itself was beautiful -- fried chicken coated in orange sauce on top of light colored kimchi, and few drops of decorative green and black sauces.  Note the food is on the spicy side (and I can eat spicy!!) so we had to order cheese quesadilla for my daughter. But it again was dummy!   Overall, I will definitely visit again.  And, great value for the happy hour!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "gzZt4lO56JpBl9YoxWRpTw"
  },
  "iqTbPMidAbpKa65uMMueCg": {
    "date": "11/22/2017",
    "text": "Sweet. Baby. Jebus. This place is . We have been keeping our eye on this place for months, but after all the awards they won recently we just had to come in. Happy hour is a screaming deal. Margs are so good. Even the house margarita is delish. Literally order anything on this menu. You  will  not  be  disappointed    They have done an amazing job woth seating. Room for everyone in a small space, but it feels huge. The community table is a great touch, and provides quick turnover.   Tacos. Lord the tacos. Order one, or order every one. The flavors blend so well. Our friends tried comparing Crujente to Taco Guild and I about slapped them.   Please eat here. It's life changing.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 11,
      "cool": 6
    },
    "photos": [],
    "user_id": "c9_MARHZpq8PAykyWnTuiA"
  }
}