{
  "5XgefDf3WNGSSuj2MNJCjg": {
    "date": "5/26/2017",
    "text": "My husband and I were in town for a vacation. Googled about this place. The first thing we ordered was Thai tea. It had a cockroach in it. We just left.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XLbPoGRMBbFInrif1Yh8CA"
  },
  "6iP_oVrh21vobZ7sHdiq6w": {
    "date": "8/17/2015",
    "text": "Came here once way back around the time it first opened and recognized some of the folks from Yupha's. Came here again recently and realized that the menu and presentation is almost identical to Yupha's as well. Wait a minute. Who am I fooling - I always just get the red curry from the lunch menu anyways so I wouldn't have noticed any difference. :P I'd say quality is the same as Yupha's. It's just a little further away but it's on the lunch rotation for when we're craving Thai but don't want to run into folks from work. In the same mall as Teakwood's and Jersey's Tavern. Plenty of parking.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "0d7gFJUi4cV3I7j1dHn9fQ"
  },
  "oPzz41j3abzTYRkOkbgbHA": {
    "date": "4/29/2014",
    "text": "Best Thai food I've had in the valley. After trying other restaurants in the area now that I work down in Chandler, I happened across this spot and decided to try it on a whim. I'm glad I did, and this is where I'll be continuing to go for my Thai fix for the foreseeable future.   I tried a classic - yellow curry - and chose a medium spice level to establish a baseline for future visits. The lunch comes with soup and salad, and while the salad dressing was good, the hot tofu soup was very flavorful and just spicy enough to taste the heat without burning away the flavors.   The yellow curry itself was exactly like I love it. Unlike the watery, thin curries I've had recently at other places, this was rich and creamy with an excellent flavor. The medium heat was just enough to linger on the tongue during the drive back to work without making me sweat at the table.   Recommended.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D582Y71mmeIoTA2GmFho9A"
  },
  "_SYUjIhwjVYsFNWywFYP0A": {
    "date": "10/27/2015",
    "text": "We stopped here on our way from the Phx airport to Tucson.  Unassuming restaurant in a strip, but don't let that stop you.  Delicious food. Huge flavor.  Great Thai ice tea.  I'd go back next time we were in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rFA3tSqjhaVG4rbPApu_rg"
  },
  "Tf-ryOeZN3J9-kxUuNSSZw": {
    "date": "4/2/2016",
    "text": "we ate several things here. starting with the steamed dumplings...they were very good and the ginger sauce was a perfect compliment to them. next we had the Pineapple fried rice and the Larb. I felt the fried rice needed a touch of flavor it was a bit bland but the Larb was phenomenal. we choose the medium spice and it was just right. It had enough heat that you knew it was spicy but not so much your mouth was on fire. I had the Thai ice tea which is always great. and for desert we had the coconut ice cream with fried bananas and the sticky rice with custard. Both deserts were excellent.  I was disappointed that they no longer have toppings for their ice cream as I wanted to try the coconut ice cream with sweet pumpkin.  over all it was an excellent meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dg3zKfQN-u_MgJ087uxHfw"
  },
  "PHdpyq2_G8pGloHvy-z8Fg": {
    "date": "8/20/2014",
    "text": "Very good thai food!!  Service is good, restaurant is nicely decorated with fun modern decor and I love the bathroom!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jRrmfjbY3i5x5AVW-SGT3w",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Inside the restaurant",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jRrmfjbY3i5x5AVW-SGT3w/o.jpg"
      }
    ],
    "user_id": "nN2PDIE2gqND1Q3W7URXVg"
  },
  "RtLPZk8th-Kr4K8VcA1Mqw": {
    "date": "5/8/2016",
    "text": "Best Thai food in Arizona, no question. This is as close to \"LA Thai food\" you will get and it does NOT EVER disappoint! Chicken or beef pad Thai is out of this world and their peanut sauce is the best I've ever had in my life.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W5Iaz9BcTEvJmWKYT6aktQ"
  },
  "YaYLJFQ4uj_FjwZR872Ncg": {
    "date": "2/20/2016",
    "text": "Great food, calming atmosphere, incredible service, and the best panang I've ever had. This just became my favorite Thai restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bQT-E_FsXpxwIDd_hU0P4w",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Sweet and sour with chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bQT-E_FsXpxwIDd_hU0P4w/o.jpg"
      },
      {
        "img_id": "VNHiWfyizRsY3HyDej3z8g",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Panang with broccoli",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VNHiWfyizRsY3HyDej3z8g/o.jpg"
      }
    ],
    "user_id": "BQFEVvNH-zLkXSROHAtkRw"
  },
  "4a8UwxNhAHNrWdq3_S6yeg": {
    "date": "1/28/2016",
    "text": "How did we live here for so long and miss this great little Thai place?? I love the decor and atmosphere and the service was fast. We came for lunch and had the Garlic chicken plate and Chicken red curry. Both were very good. The Curry was a little bland - needed more zing but it was still good.  We'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QkWXnyxhW8dCvIXJYcRJ_A"
  },
  "xD2zsBqLBBB5Q3oxEnlxEw": {
    "date": "4/19/2016",
    "text": "Spring rolls and accompanying sauces are the best.  The currys are always done right with fresh vegetables. Good service and reasonable price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G8ziGXdwCkWwGSA4k6EcuA"
  },
  "Qr8YlIraZiI_2mgXPFll4w": {
    "date": "8/28/2015",
    "text": "The go to Thai restaurant now has a cool sounding name.  Come on people -- Thailicious.  Thailicious has all of the standard fare in varying degrees of spiciness.  We usually order our food to go.  I can attest to the Green Curry and Drunken Noodles being good.  The location is in a strip mall with ample parking near Walgreens and Fresh and Easy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YvYr6FhVnzGEP7WVYoWUJw"
  },
  "PHr9NXQdHVTwWIwQHQ2jTQ": {
    "date": "12/8/2015",
    "text": "I can't believe we haven't been here earlier! The garlic chicken is really good, but my favorite was the yellow curry. I have never had anything like it. It had so much flavor mixing with the spicy seasonings on the table. I will attempt the spicier curry soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JHa6QhwsnQ3tBfoHwz9pJg"
  },
  "sP6An38llnW6_xvBiqp_XQ": {
    "date": "10/1/2014",
    "text": "Wanted to try Thailicious based on the reviews, sadly we were very disappointed. Went in on a Friday night around 5:30, one other table was seated when we arrived. Most of the staff seemed disinterested in serving us and were running back and forth between the kitchen and dining area. Our server only half paid attention and served us one order of spring rolls instead of the 2 we ordered. Very mediocre at  $5.99 for two rolls, glad she only brought one order. It sounds like an exaggeration but we sat and waited for our entrees while other tables seated after us were served and eating.  We had one of the most expensive dishes on the menu, a Thai seafood entree that I can't remember the name of right now. It had a nice chili spice but was heavy with sugar which was overpowering. The Drunken noodles were OK but nothing special. Sadly we have no desire for another trip to Thailicious, there are much better Thai and Vietnamese offerings in the east valley.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l2z_-RKy3IvYl0-yuwXctQ"
  },
  "HvvDHMU2HCB1F0EeSDITgg": {
    "date": "7/14/2015",
    "text": "In my opinion this is the best Thai restaurant in Chandler. Great ambiance and their Pad Thai & Pad See Ew are phenomenal.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "glgmDB4btDplNlv_SXQLWQ"
  },
  "G8-YXmoqjU3quOSKmw_dig": {
    "date": "4/11/2014",
    "text": "Update.  They have beer!!  I had the Thai fried rice with a split of chicken and veges today.  I ordered it with medium heat.  Perfect!!  5 stars now!  I'll come back weekly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rPYLAZGD5XaczN_GBTaA0A"
  },
  "pwF_jsFyiMHCBQdMaugpWQ": {
    "date": "8/18/2015",
    "text": "We stopped by Thailicious around 6:30 on a Saturday night just before going to see a friend perform at a nearby venue in Chandler. We were greeted and seated promptly, as well as presented with cocktail menus, suggestions and dinner menus. The service was wonderful and the food was great. I ordered Pad Thai and my husband had the Royal Yellow Thai Chicken curry, both ordered with medium heat. We also shared crispy spring rolls, which were bright, fresh, and not overly greasy. We would definitely recommend this restaurant to anyone looking for a great Thai restaurant in Chandler!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LnzkE5ubITLbKYJF59VB5Q"
  },
  "2IvrpgCfyxJkvvYHNLqshQ": {
    "date": "3/29/2016",
    "text": "Good meal, smaller portion.  I had Garlic Lover with Chicken,  it was very good and hot spice.  My wife had Green Curry, it was good but not as good as some.  Salad bar with soup was a nice touch.  Good friendly service, good value for the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ahmtdJHLRz-0jRZLnoe3CQ"
  },
  "xzNrB2CamPpPwGP4Ao0iRw": {
    "date": "7/15/2014",
    "text": "Delicious food. I tried the drunken noodle and for dessert, the coconut ice cream. However, the service was slow and they didn't even tell us the salad and soup was self serve. They took forever to bring us our straws and chopsticks. But the food was amazing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NFXQw6LD5-zDardH_G0ovg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Drunken noodle yum!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NFXQw6LD5-zDardH_G0ovg/o.jpg"
      }
    ],
    "user_id": "_kY1pwAvbTKFOnjYNUnXUQ"
  },
  "TnDMdbVXx0hEO5sSajVTfQ": {
    "date": "2/3/2016",
    "text": "Very disappointed in my visit to Thailicious last week. I've been there before and loved it so wanted to take my friend. The kids plate that was brought to us had a dead bug(I don't know why we stayed)when we advised the waitress she was very cold and gave the \"whatever\" attitude. My friend didn't really like her first dish, so they replaced it, which is great, but the attitude/feel we got was so unwelcoming. Super bummed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AcgHUGiekgVOb5QUj3niHQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Gross bug on a kids plate they gave my daughter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AcgHUGiekgVOb5QUj3niHQ/o.jpg"
      }
    ],
    "user_id": "cI9V3b5l31buoWASKNaOTQ"
  },
  "Y_bxrH9aCwy1LEE3gnfjDw": {
    "date": "7/3/2014",
    "text": "Silly name but very good food.  Ambiance and decor were ok; background music a la Kenny G got a little annoying.  Tom Gha soup was pretty spicy even at level 3 (out of 5).  The drunken noodles and Pad Thai were both very good- level 3 and 4 spicyness but they seemed about the same.  Panang Curry was delicious- maybe a bit runny but tasty with steamed rice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wcOnj5t0QIC70g57BTD0lw"
  },
  "JTOivJ-Qw8rJNU1pd__nGg": {
    "date": "1/10/2015",
    "text": "As Thai food in Arizona goes, it's pretty good!  Clean and nice inside, friendly staff. We went on a Saturday evening and it wasn't very busy.   Food was classic Thai, good sauces, everything was served hot with beautiful presentation.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yA__uoKlDQH44msS28qz9Q",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yA__uoKlDQH44msS28qz9Q/o.jpg"
      },
      {
        "img_id": "Luxj8Jr1QAXAH7NHfswaeA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Luxj8Jr1QAXAH7NHfswaeA/o.jpg"
      }
    ],
    "user_id": "dwoRgz7GuUAlz8LHY_VyzQ"
  },
  "H-M2q5gwTtQctCuCh7ATcg": {
    "date": "5/17/2015",
    "text": "Great thai place with many options in entrees and special dishes! Service is good and quick. Food was delicious, presentation was great. Will visit again for sure. And extremely reasonable",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t2tnBjIZ-DTn_1sGY7VCJg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Tom kha chicken soup! Amazing",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t2tnBjIZ-DTn_1sGY7VCJg/o.jpg"
      },
      {
        "img_id": "j4bZuPKP68qyHN8Sngl0nw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Drunken noodles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j4bZuPKP68qyHN8Sngl0nw/o.jpg"
      },
      {
        "img_id": "Gt5MqcQ9QwvSACmdt3i-pg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Chicken satay",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Gt5MqcQ9QwvSACmdt3i-pg/o.jpg"
      }
    ],
    "user_id": "TqVnflpwX_V6Wwpv_OSyuQ"
  },
  "dpFnUZ0HxGCu07IjjehOFw": {
    "date": "11/10/2017",
    "text": "Ate here while visiting my parents and all three of the dishes we got were good, fresh and clean. Will have to come back next time I visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "05IXC8JCHhdrBLmMg2RWUw"
  },
  "qEKSWOPhAJpen5txU-Y2CQ": {
    "date": "10/1/2016",
    "text": "There are a ton of Thai places in Chandler, and particularly here in West Chandler. Thailicious is practically in our backyard from Gila Springs, and I have to say it's our favorite! We love the Steamed Seafood in Love, the broth is incredible. The Tom Yum Fried Rice is excellent as well, but VERY strongly seasoned; we usually 'cut' it with plain rice 1:1 and it still tastes great, plus you have plenty of leftovers. Kids love the drunken noodles, and my wife and teenage daughter really love the Panang and yellows curries. I usually go for the Holy Basil, great flavor also. I don't know that you could go wrong with nearly anything on the menu.  We usually get takeout, and always cook up extra vegetables (Stir fry veggie mix from Costco) to eat with what's provided, and can easily get two meals out of an entree.  The restaurant has a cool, understated vibe on the inside. The service could use a bit of improvement, but the ladies who work there are very friendly (though sometimes a bit difficult to understand). Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1-cj1ZY4Llrg6W5yM5R_3w"
  },
  "qSRuF-B50NIaOmUxTGrnhA": {
    "date": "7/16/2015",
    "text": "We are here dinner with another couple. I got a steak meal and TL got a rice dish.   We went here not to long ago. I just remember that the food was \"okay\" usually when I like something I remember.   The food wasn't bad here or amazing, that's just me. So give it a try!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EIj7osC_bYTkv4eyHHuvNQ"
  },
  "EKs0dmVktg610HKShWjE4g": {
    "date": "3/21/2016",
    "text": "Very good quality Thai food on the south side of town. Having been to a few places in the valley, this is quite a good one. Service is excellent, restaurant is clean and the food is great. We ordered the Pad Thai and the the Drunken beef noodles. The beef noodles were absolutely delicious, top notch really. I was not swept away by the Pad Thai though. Despite it being really good, it's not my favorite version. It seems to me that there are two versions of the Pad Thai sauce, one sweeter than the other. This happened to be the sweeter one which I'm not a big fan of. The food is quite spicy so be careful what spice level you order. I ordered my Pad Thai mild and it was slightly on the hotter side for me. I happen to like spicy food but honestly, my tolerance has gone down recently so you be the judge. Portion size is pretty good. You don't have to ask for your cold water, it'll come to you in a nice jug with glasses and it doesn't taste like tap water! Overall the food is great therefore we will be going there again any time we make it to Chandler!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "n30KtbtlUJ5gxSKckBRsfg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Chicken Pad Thai",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n30KtbtlUJ5gxSKckBRsfg/o.jpg"
      },
      {
        "img_id": "Knm45IQpSSRTrIwuBBah5Q",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Drunken Beef Noodles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Knm45IQpSSRTrIwuBBah5Q/o.jpg"
      }
    ],
    "user_id": "L4dg-hA4Ek0M9sSBMJCqWg"
  },
  "LQKdlEeDliGYYWSrpK5Heg": {
    "date": "8/1/2014",
    "text": "This adventure takes three unlikely people on an international journey across Thailand, Thailand, and more of Thailand. They try to recall the day after they blacked out (hopefully from a food coma ). The adventure is filled with one hooking up with a male prostitute with a bangin' body, one befriending a chain smoking monkey, and one getting a face tat. If that sounds fun, come and rent Hangover 2. Because none of that happened when Joyce W., Brett B., and I went to Thailicious. Although I could see Brett B. with a face tat.  The lunch time specials were good for the price but what is really worth it is dessert, Thai tea creme brulee! It's so good that it makes you feel like you got roofie for all three Hangovers .",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "XNa94zfuNfJo1sJk5MtcBg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Thai -ing out: Pad Thai and Thai tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XNa94zfuNfJo1sJk5MtcBg/o.jpg"
      }
    ],
    "user_id": "-GjUaJEyjw2Frrva_QW2Rg"
  },
  "h9a_ZuHuIt7MKL1amTHSwA": {
    "date": "1/4/2015",
    "text": "Updates: I haven't been back here for a while and was craving for Thai food again. I was looking forward to good food as well as saying hi to the owner, unfortunately she was very busy helping out in the kitchen when I got there. This place is a whole lot busier than the first few months when it was opened. Still clean. Still spacious. Everything is exactly the way I remember it.   Service: Service is still great. Even after the bill was paid, they still come by to check up on us and even offered to give us to go cup for more sodas. We politely turned it down but thought it was very nice.   Food: I ordered a Thai basil dish with beef and it wasn't as good as Basil fried rice. Beef doesn't have much flavor on it and I can hardly taste the basil flavor. We also ordered egg rolls and it was pretty decent.   Rating: Overall I still think it is a good Thai restaurant. I'll come back here again to try some other different dishes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EWT3q5hHlg7cUNTAxHb_Lw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Very Basil rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EWT3q5hHlg7cUNTAxHb_Lw/o.jpg"
      },
      {
        "img_id": "nwm2XpX9IPr6BFEwmcCZew",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Eggrolls",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nwm2XpX9IPr6BFEwmcCZew/o.jpg"
      }
    ],
    "user_id": "j_j4DLfvNkhCRNWC0VBS9g"
  },
  "luyRqWCNu2sQWBRqHk59nQ": {
    "date": "4/18/2016",
    "text": "I have no idea how this place is so highly rated. It's average food, at best, and the service was one level below awful.   I came here for lunch and found my usual pad prik king, so I was excited to try their version of it. There weren't any tables available but there was some room at the bar.   The bartender (if you can call her that, since she spent probably an entire 60 seconds behind the bar the whole time I was in there) ignored me until I waived at which point she said \"you ready?\"  She took my order, didn't tell me about the salad / soup bar, and left. It was the last time she spoke to me. I actually had to flag another waitress to refill my water and bring the check. At least that waitress was pleasant and helpful.   The pad Prik sauce was too sweet and unbalanced. The soup wasn't great either. The salad dressing was really delicious, though.   They didn't give me one reason to come back, so I probably won't.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGGapvfP1SZH2ZOikdSpNA"
  },
  "TS5eUW-8vxtdJA9ZyBGIoA": {
    "date": "1/28/2016",
    "text": "This place was SO yummy! We had a take out order and everything came out right. We ordered the Tom Kha Thai Galangna Coconut Soup, Panang Curry, and Pad Thai.   The coconut soup was pretty good but defiantly not the best I've had from a Thai restaurant. I ordered it mild and it had a good kick to it.   The curry was really good. It came with plenty of sauce. So much so that I had about a cup left over.   My husband really liked the Pad Thai. It was a very big portion. He ordered medium and it was spicy. We like spicy but it wasn't a typical medium.   Overall this was a delicious Thai place. We will defiantly order from here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HAC5_ATw3GjDWIk9OxdSOA"
  },
  "VB4Zz4zMJ7N2jgo6_B75-A": {
    "date": "2/15/2014",
    "text": "Came here with my friends for lunch. Liked the decor and modern style. As we entered, noticed some of the crew that worked for Yuphas, another one of my favorite Thai places. Upon inquiring, found out they have opened this restaurant and moved here. They were very gracious and eager to please which was a stark difference from how I have been feeling about Yuphas lately.   The lunch buffet comes with soup and salad. I thought soup was tasteless and unappetizing. But the taste was made up by the entrees.  The food was as good, if not better than Yuphas. Loved my ginger beef with rice. All four of us loved what we ordered. And then we ordered sticky rice with coconut Ice cream. I thought it was pretty awesome.  If they keep up with the quality of the food And great customer service, I don't think I need to go back to Yuphas and go through their deteriorating customer service and food quality.  Look out Yuphas, your ex-staff is out there to beat you in your own game :) I have to say, it's a must try for every Thai food lover!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "J62CpEEMRoJRPa2jSxzLAA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Coconut ice cream with sticky rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J62CpEEMRoJRPa2jSxzLAA/o.jpg"
      }
    ],
    "user_id": "ro8FBO3FGxR41tqrChvYVw"
  },
  "N1JUQJsnuvcaTkfEajfTSQ": {
    "date": "10/14/2016",
    "text": "We were mostly disappointed in the quality, but also in the average portion size for the price point.  The soup, which you get yourself from a salad bar, was too sweet and lacked flavor.  It was just thick, sweet, flavorless, soup.  The salad bar was iceberg lettuce which isn't unexpected and it did have nice sizes of sliced tomatoes. The dressing was like an off the grocery shelf type Thai salad dressing. Nothing special. The pad see ew was not remarkable.  The broccoli was all but missing. The egg undetectable. The Garlic Lover also had tiny amounts of \"steamed vegetables\". We were told there was no shrimp in the Garlic Lover (which I can't eat) and perhaps it was heavy fish sauce flavor, but we both tasted heavy shrimp flavor.  The only really good food on the plate was the rice and  Thai crispy roll.  We won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eJNhC6WLDUG_toDDqCQagw"
  },
  "aLl-5zb2t4kzqFjIVlS7kA": {
    "date": "2/8/2017",
    "text": "Went for lunch. Good food for reasonable price. My friend didn't like to serve himself soup and salad. I really liked the peanut salad dressing",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fHsuPEQgs9xspAErMhpE3Q"
  },
  "9lWE41fViC6edzpB2-wL_A": {
    "date": "12/10/2014",
    "text": "The decor is awesome and hip! The restrooms are really nice. The food is great too. It would be cool if this place had beer on tap.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEazfFhRLtegguH1X8t8iA"
  },
  "I2eKM-s4_8tnbMNH5s0IDg": {
    "date": "2/21/2016",
    "text": "This place is by far the best place in az for Thai food. I have been here a few times and I enjoy it everytime. The mood setting is great, dark with a few headlights over each booth. There's a small water fountain up front which gives it a relax feel. Along with jazz music in the background.  There's a good bar at the end with a tv to watch a sporting event.  The food here is great!! The tum yum soup is amazing!!! Spicy with a hint of lemon. I definitely recommend it to all!!! The drunken noodles also are great!! I had this as my entre with some pineapple rice and sweet and sour chicken. You can definitely split each plate with another person.  This food cured my hangover :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iWQ9Cv3z36KjLnaHcf0u0A"
  },
  "ylHd14ZXjTiaWu5Xpr3qig": {
    "date": "5/17/2014",
    "text": "We ordered pad thai and colorful vegetables with beef. Both were delicious, but the pad thai didn't taste like pad thai really. I would eat it again though. It just had a different taste. What was the best was the Thai sticky rice with mango. Oh my God I will dream about that dessert!!!!!! It did not sound that appealing to me (my family member picked it out), but it was soooo good!  Also love that you can order online!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aMzH2Ev7prWMJ1UMJlndCA"
  },
  "wdlSMEQ8TsARjXg52WURYg": {
    "date": "6/15/2014",
    "text": "I have tried a lot of noodles in various Thai places but never found drunken noodles as flavorful as the one at thailicious.  Noodles I ordered came with fried tofu with egg at level 4 spicy (hot). The flavor was impeccable and certainly a treat for those \"drunken\" fans out there ;)  Also ordered the red curry - though kind of runny I felt the taste was surprisingly good. Not usually a fan of curry at Thai restaurants but glad I made that exception.  Lastly Thai iced tea - great drink at any Thai place - tall glass and not too sweet!  Overall great experience - recommend to those who want to try something new on Thai!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jcKsdmqquKnKUrZ3DmFC7Q",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Tom Yum soup with tofu and vegetables",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jcKsdmqquKnKUrZ3DmFC7Q/o.jpg"
      },
      {
        "img_id": "4aDdmXO_TmKvwgmKL4uPCQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Drunken noodles with fried tofu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4aDdmXO_TmKvwgmKL4uPCQ/o.jpg"
      },
      {
        "img_id": "SKVg6HIQxdySeo8skdUAEg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Red curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SKVg6HIQxdySeo8skdUAEg/o.jpg"
      }
    ],
    "user_id": "V8M1Txtrx0SomcnhxfDM5A"
  },
  "h-WEtHLmdTAl6IvMTaZyRw": {
    "date": "11/10/2015",
    "text": "Amazing food, phenomenal service, very clean and modern ambiance.  I loved the soup, salad with peanut sauce and the chicken basil.  Great staff, service and top notch Thai food.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iqpSkSV9MwscDuwBNMfTGQ"
  },
  "mN17w2SYI6O033vR0UOHmg": {
    "date": "4/7/2017",
    "text": "Very impressed by this relatively new spot.  The furnishings seem upper-scale but the prices are quite reasonable.  I appreciate that they have brown rice as a choice.  Food overall was quite tasty (including the Basil Smash cocktail).  We even received free coconut ice cream when we ordered dessert.  I will be coming back for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xWAamRi-xLRbn6Gxf89vvg"
  },
  "5ZHIn8hR2uK3IArNnqOBdw": {
    "date": "2/18/2018",
    "text": "The food here is awesome. I'm kind of a Thai food snob since my family owns a few Thai restaurants up North and have been trying to find a good Thai place here for years and stumbled upon this place a few weeks ago. I've only been for lunch, so I've had the salad and soup bar. The salad dressing is amazing, I could drink it. The pad thai is a 7/10 but the pad see ew is much better 8/10. The first time I went I had a rude waitress, but I decided to give it another try a different day because the food was so good and we got a friendly waitress this time. Definitely recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oE77JRhVLd_w6nwT64wuSw"
  },
  "ElZeNkjuRxOpAbHloG-uLg": {
    "date": "4/23/2016",
    "text": "Thailicious is Delicious!  Food: Very good! I ordered the Pad Prik Khing with chicken. I wanted something fairly spicy, so I asked for a \"4\" on their scale of 1 - 5. It was fairly spicy, but next time I'll ask for \"5\". The dish includes rice on the side, which I appreciated. That way I could decide how much rice to add to my plate. The Pad Prik Khing has a good portion of green beans, which were cooked just right - they had a nice snap, not mushy at all. I asked for fish sauce with diced chilis, and they brought out a little box with that, plus chili sauce and chili flakes. I only tried the fish sauce, and it added another layer of flavor to my food. Recommended!  Cost: I paid $12 including tax, which I felt was very reasonable.  Service:  Outstanding! The place wasn't crowded at all, especially for a Saturday evening. Well, it was really early, so there's that... Anyway, I was greeted and seated immediately by a very friendly hostess. She brought me an ice water with lemon slices right away, including a carafe for refills. A different person took my order, and only 13 minutes later she brought it to the table. Impressively prompt. Several times during my meal someone came to ask how everything was, or if I needed anything else. This was just right, not enough to be annoying.  Atmosphere: Nice. They were playing fairly quiet jazz music, and water features near the entrance and near the rest rooms also added to the mix. The decor isn't over-the-top Thai, but it's tasteful. Also, the men's room was very clean - always a good sign!  Overall: This was a very pleasant experience. Good food, good service, and an menu with enough interesting choices that I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 18,
      "useful": 32,
      "cool": 28
    },
    "photos": [
      {
        "img_id": "3b9x82_6pr40UGPdiskyRA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Men&amp;#39;s room was very tidy!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3b9x82_6pr40UGPdiskyRA/o.jpg"
      },
      {
        "img_id": "1kJXHrMTbuq5bwbvJwoUzA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Water feature at the entrance to the rest rooms",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1kJXHrMTbuq5bwbvJwoUzA/o.jpg"
      },
      {
        "img_id": "mmw2qhlxky_Q37SOMymOjw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Fish sauce, chili paste, and chili flakes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mmw2qhlxky_Q37SOMymOjw/o.jpg"
      }
    ],
    "user_id": "e0pVHbAZE3B_iwRenLfImA"
  },
  "gUyxqylVgIcaN5Xki8k_rw": {
    "date": "3/10/2018",
    "text": "One word: YUMMY!!!  Thailicious is amazing!  I would recommend the drunken noodles, fried rice, and Chicken Pad Thai!  The food is always fresh & delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qhfnN1cAJj5HS4XrWj8yJw"
  },
  "ztrxtIpDJk76-NrSInyD8Q": {
    "date": "11/13/2014",
    "text": "Thailicious - cute name very catchy and the place inside is just as stylish as the name. They have a 2 big screen tvs on both sides of the place and a nice little bar area smack dap in the center back of the room. It's close to my job so I thought today was the day I go check them out during my lunch hour.  Service is friendly and fast, I was arrived a little after 11:30, it was still slow, I'm sure the lunch rush was coming soon. But I was able to pick any place to sit.    After checking out the menu I went with the Heaven Ginger with chicken, it was ginger, onions, mushrooms, bell peppers & scallions in a house bean sauce and a side of steamed rice & crispy roll.  I also ordered it Thai Hot.  The heat was a little lacking for me, it was more like a level 2 not a Thai Hot, the flavor of the dish was good too, it just seemed to be lacking something, it was an ok dish, it wasn't spectacular or mind blowing, just a good lunch.  The salad was a typical iceberg lettuce blend with carrots and to add to it some sliced cucumbers & tomatoes with a warm peanut sauce dressing and the soup was a sweet & sour soup. The peanut dressing had great flavor just a little runnier than I like, I like it a little thicker so it sticks to the lettuce leaf and not just run off the leaf. The soup, it was surprisingly good, it had the perfect blend of sweet & sour.  Thailicious makes a decent lunch, not spectacular, but good. Didn't have anything wrong with my meal, just didn't get blown away.",
    "rating": 3,
    "rated": {
      "funny": 7,
      "useful": 11,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "6v9LU2iY2mUE5MVagTKEkA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Salad with warm peanut dressing",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6v9LU2iY2mUE5MVagTKEkA/o.jpg"
      },
      {
        "img_id": "utneckXd8NASi44JuxHJQQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Sweet and sour soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/utneckXd8NASi44JuxHJQQ/o.jpg"
      },
      {
        "img_id": "ILSv9S3GEqvY3vn4eoSrtA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Heaven Ginger chicken thai hot",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ILSv9S3GEqvY3vn4eoSrtA/o.jpg"
      }
    ],
    "user_id": "bpgbVPJcG-wQ4cNBcPPIxw"
  },
  "-N_-QNeIPuzr-bPkN6lcsw": {
    "date": "7/31/2014",
    "text": "In honor of my YFF being today's ROTD holder, I declare an end to my review hiatus.  Thailicious has sat motionless in my bookmarks for months, ever since mon ami Kristin J first alerted me to its existence.  The name alone evokes images of \"superlicious delish\", as the superlicious Mary A states.  The characters in this screenplay are as follows... Joyce W - my YFF and international essay contest winner, who I shall refer to as J-WoW.  If you want to read an actual well written review, check hers out. Linh L - one of today's top talents in beat-boxing, who I shall refer to as Mr Peanut.  If you want to read an actual amusing review, check his out. Brett B - the author of this autobiography, who I shall also refer to as Mr Peanut The Waitress - who I shall refer to as Flo  As an author, whose responsibility it is to convey an experience to you, the reader, I hope you'll be able to take away this... I arrived AND checked in prior to either J-WoW or Mr Peanut!  After 'handshakes & hugs', we gangsta strolled up into that beyaaaa...ah.  What a sight it must have been.  Two of us could have passed for cast members from the Asian version of Melrose Place, while the third closely resembled Zippy the pinhead.  We were promptly ushered to a booth with what appeared to be vinyl seats, and I make this distinction to inform the reader that as I scootched myself across the bench, an inopportune vibration was simulcast from the vicinity of my pants bottom.  Not wanting to appear like a wind-talker in front of my co-diners, I made an effort to replicate the sound by continuing my side-glide until successive audible vinyl rubs were rendered.  But no such vindication was attained...  My companions were a True delight.  Dear reader, may you be blessed with your own J-WoWs and Mr Peanuts.  Lunch doesn't always have to just be about binging on 1800 calorie entrees.  Open your heart, and your heart may just open you back.  I ordered the Pad See Ew, vegetarian style as a nod to my girl Cici F.  Now, I'm down with PSE, yeah, you know me.  It's my jam.  The dish gets my merkin a twerkin... however this one didn't have the je ne sais quoi of Thai Spices or Thai Rama, but that didn't dissuade me from a raucous display in which no less than half of the deadly sins were involved.  After putting in our dessert order, I asked Flo if she would be so kind as to provide me with a spoon, say... eighteen or nineteen inches in length.  Now here's the kicker.  She looked at me like I was a damned fool.  That delightful Thai Tea Creme Brulee dessert proved to be the meal's Swan Song. It boasted a sun kissed glow that could have passed for San Diego's own TM, a consistency smoother than my girl MC J, and was reminiscent of everything that's right about pumpkin pie without the benefits of high protein or dietary fiber.  How is no one singing its praises?  [Chorus - Nicki Minaj, J-Wow & Mr Peanut:] Flo, I got this short-azz spoon in my hand Beating like a drum on a treat that's all tanned Can't you taste that creme, bacreme, creme, creme, bacreme, bru, lee? You got that creme brulee creme, bacreme, creme, creme, bacreme, bru, lee Yeah, that's the creme brulee (Creme) [x15]  Side Note: If you enjoy leering at beautiful women from the shadows, as they make selections from a salad bar, then boy are you in luck!",
    "rating": 4,
    "rated": {
      "funny": 21,
      "useful": 19,
      "cool": 19
    },
    "photos": [
      {
        "img_id": "zdFBAtuRaxQjDa9-rey4Bw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Pad see ew... as seen through the fogged lens of my S3",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zdFBAtuRaxQjDa9-rey4Bw/o.jpg"
      }
    ],
    "user_id": "rMsB82tk9uOB6JumPMgczg"
  },
  "LFDtQ6G_8kNmAqkVEGeCjw": {
    "date": "7/31/2014",
    "text": "#200:  It was an action-packed day!  Celebrating my 200th review on the day I just so happened to get ROTD made for a fun day with the boys!  What better way to celebrate than with a Thai Tea Creme Brulee that we've all been dying to try?  After a little while, our food arrived.  The Pad Thai was nothing extraordinary or spectacular but I enjoyed every bite.  I was really impressed by the portion given that it was lunch.  For $8, I got myself not only lunch but dinner!  I'm interested in seeing how big their dinner size is now.  Anyways, after nom noming for a good while, we were ready for the grand finale:  Thai Tea Creme Brulee!  It was probably a 10 minute wait before three Thai Tea Creme Brulees were placed before us.   Not wasting time, I gleefully grabbed my spoon and cracked the most beautiful caramel shell.  That first bite made fireworks go off in my head.  It was Chinese New Year and I had front-row seats on Victoria Harbour... which is weird because we're at a Thai restaurant and not Hong Kong... whatever!  This is my review so bite me.  Reminiscent of warm pumpkin pie in texture, it was creamy perfection!  It was smooth and the Thai tea flavor really hits you and it was delicious.    At $18-something a pop for beverages, lunch, and dessert, I definitely think Thailicious delivers.  Good portions, great atmosphere, and friendly service.  This place gets packed around noon so come prepared.",
    "rating": 4,
    "rated": {
      "funny": 13,
      "useful": 13,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "pryL09DXC5erCokZSm_NPw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Pad Thai with Chicken lunch!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pryL09DXC5erCokZSm_NPw/o.jpg"
      }
    ],
    "user_id": "zFYs8gSUYDvXkb6O7YkRkw"
  },
  "mJ4yO8MdDmo_RZTugcC-sA": {
    "date": "3/28/2016",
    "text": "Solid Thai food!  I'm usually a \"medium\" type of person, but my friend got his Panang curry in the \"hot\" variety and it was not only still edible, it actually had good flavor.  We also had the green and massaman curries.  The only thing that keeps this from being a 4 star restaurant in my book was the service.  Our waitress was very polite but not the most friendly, and it was obvious that she had a huge workload (she seems to have been the only person taking care of every customer in the joint, and she was also working the cashier), but we did not receive any water refills during our stay (my friend jumped up and grabbed an additional pitcher from the counter for us when it became obvious that we wouldn't get another), and we weren't ever offered additional rice (we resorted to drinking the curries like soup). Fine but not ideal.  Still, not a bad place for some late-night food!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "MwWO6axFPTCXqN0DAfUhIQ"
  },
  "VRomYMcrm_fm5o_eipZXtg": {
    "date": "5/5/2018",
    "text": "What can say, other than Wow!  I took a couple of friends here for their birthday dinners and we had nothing but an amazing experience.  We were greeted right when we walked in, and sat immediately.  The food was delicious!  Our waitress was tremendous and very pleasant!!!I highly recommend Thailicious!!! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PvM-M5xkYVJyjVDVXyw75w"
  },
  "ZQ-39-fw3MmXXd-iwEd6qQ": {
    "date": "6/3/2016",
    "text": "Almost 4 stars. $16.99 for curry duck with full leg and breast slices. Yellow coconut curry with basel, leaks, red peppers potato etc accompanied by an array of chili sauces and dry chili. The sauce was amazing. You can order it at any spice level. Also had Thai iced coffee. The place is clean!  Staff is friendly. Service was good. The duck unfortunately must have been sitting around forever. Not tender. Dry. I thinking it was cooked yesterday and warmed up, that was disappointing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CbA90NmR5UOUvpqV9wTCCQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. The duck",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CbA90NmR5UOUvpqV9wTCCQ/o.jpg"
      },
      {
        "img_id": "XHSrO0mpiradj4ZHh0QPCQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XHSrO0mpiradj4ZHh0QPCQ/o.jpg"
      }
    ],
    "user_id": "9Y1YkloHk2MAE3hkwYdFKA"
  },
  "TWSQ9UZAx8o4zhwBWl0Gow": {
    "date": "3/29/2014",
    "text": "Thailicious= delicious! We were excited to try out this new restaurant based on the great reviews. Nestled in the Laguna Village shopping center, it's nice to see another Asian restaurant take over where the previous Szechuan restaurant was. They've remodeled the place, adding color, new seating and tables to create a soothing, contemporary atmosphere with an Asian twist.   The menu is fairly extensive and has all your stand-by favorites such as pad Thai, drunken noodles, and your various forms of curry. They also have some more unique dishes and chef's specialties. I decided on a more pedestrian entree this visit, settling on the chicken red curry, medium spiciness. I also tried some of the tom yum soup and the holy basil chicken.  The tom yum soup was a delicious pungent mix of spices and flavors. It was a great start to our meal. The red curry sauce had an interesting balance of delicate flavor from the coconut milk, with a strong punch of spice and kick from the curry paste itself, and the chiles used for heat. The spiciness level was a perfect medium- just spicy enough to tingle your palate and tongue, but not so spicy that you'd be in pain afterwards (Or drinking gallons of water!). While I enjoyed the sauce and the vegetables in the dish, the chicken in the entree was overcooked and tasted pretty tough. On the other hand, the holy basil was divine. The chicken was tender, cooked perfectly, with a great mix of veggies and flavors.   One bowl of rice comes with the entrees, which I appreciated, but I would have liked to see more rice included because the meager portion wasn't enough to eat with the lovely red curry sauce I had.  We ended the meal with some Thai tea creme brulee. It was a unique twist on a French classic, executed wonderfully. I would definitely order it again!  Service was decent, and waters were refilled as needed.  Overall, a pretty satisfying meal. I'd definitely go here again to try more dishes!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "MDUXpSRQcok655CsIgHfYA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Thai tea creme brulee",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MDUXpSRQcok655CsIgHfYA/o.jpg"
      }
    ],
    "user_id": "DK57YibC5ShBmqQl97CKog"
  },
  "gFOeq5lFP_5tF2IGTWPfvw": {
    "date": "2/2/2018",
    "text": "I come here Everytime I'm in Chandler, from San Diego. Their food is delicious (Yes, I've been to Thailand) and consistent at moderate price. The owner and staff are always sweet. I will continue to return and you should too...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ryO-sB6cy9c7FxYK7mN1xQ"
  },
  "QBThXlGgcm20-tY2N6d35g": {
    "date": "9/7/2015",
    "text": "Yelp Review 100!  This place is so under the radar its not even funny.  What a gem hidden away in an unassuming strip mall.    Greeted quickly, WE were asked where WE wanted to sit. Can you believe it? We were then asked how we were doing, and we ordered drinks, including a much too small Thai iced tea.  Waters were brought our without asking (points scored right there) and a carafe of ice water was left on the table (more points again).  My sons water came in a to- go cup with a lid, also much appreciated.   Spice level 4/5 was perfect for me, but I am the type if person who puts Sriracha on everything.   The Tom Kha kicked my butt it was so good.   It was served in white clam shell shaped bowl and is enough to share.  It was packed with fresh semi crunchy veggies and thin flat strips of chicken. The spices were dead on. I have been to other Thai places that make their soup all about the heat.   What surprised me the most was the fried ice cream for dessert.  Enough to share among four people, the outer donut shell was chewy and sweet while the chocolate syrup with perhaps a cherry sauce was a great way to end the evening.  It",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qzT0Rz5BK6P3W0R2XmolMw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Relaxing white noise",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qzT0Rz5BK6P3W0R2XmolMw/o.jpg"
      }
    ],
    "user_id": "MVvWOlVgOfRAtP41-A-g2w"
  },
  "YIR6UiRhrx6wFCSSEBcDIg": {
    "date": "8/17/2015",
    "text": "Lunch with my spice-shy friend landed us at this Thai restaurant because it was close to her home. I had the chicken satay appetizer (4 skewers of chicken breast, cucumber chutney, and a nice peanut sauce) for $6.99 and a pot of jasmine tea for $1.99. My food was tasty and nicely presented. My friend had the lunch chicken ginger heaven with a Thai roll, salad, and rice for $7.99. When asked by the server what spice level she wanted, she blurted out \"ZERO\" and that is what she got. She said the food tasted good even without the spices.  There are booths and tables, the place is nicely decorated, and parking is close to the door. The salad and soup are a serve-yourself deal. Parking is close to the door. We plan on visiting again soon.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "l-B4axUNxQ9FVVxeQm8t2A"
  },
  "mk2io3EZxSF045NL--VaCg": {
    "date": "1/2/2018",
    "text": "There has never been a time I have been to Thailicious and been disappointed.  I typically get the medium spice Pad Thai, but this last time I got their take on Pho.  It was delicious, hot (temperature and spice) and comforting.  It is also a nice quite restaurant and that is great when you don't want to be somewhere loud.  I highly recommend anyone to go here and enjoy the atmosphere and food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "onYpyU2G5I1VnAljVGLnNg"
  },
  "7QYEHF8d_uXQIa91i8RK1g": {
    "date": "4/29/2017",
    "text": "This is my second time ordering through Yelp and the second time that I am giving Thailicious 5 Stars!  I believe I can only give a rating once but if I could, I would give them 5 stars 2x!   The food was AMAZING!  It was ready for pickup right on time.  I had the Beef Masaman, Beef Panang, Pork Thai Fried Rice and Beef Pad Thai.  Not one thing to complain about.  Everything was perfect.  Thank you Thailicious for such a wonderful dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FXJxkAXtn7HsJ5028sxspg"
  },
  "rKflo7BlWFbz9rfwaWRPxQ": {
    "date": "8/3/2015",
    "text": "This is our go-to Thai place around our house. They deliver, which is a plus. Have never dined in so I can't really comment on that, but it looks nice. Excellent food and good location.   Some of my favorite things on the menu:  Chicken pad thai- one of my favorite pad thais in the valley  Yellow Curry- very good as well  Word of caution- it seems their medium spice level is more like a hot. It is consistently more spicy than I anticipate.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "r3WkvAjmHZpDvW5rmBJSpA"
  },
  "kVN_xzg9arwT3vJt6oCADQ": {
    "date": "10/15/2016",
    "text": "Great Service, Very friendly.  Food was great as well. I had pumpkin curry. Husband had a beef and broccoli curry. Enjoyed the Tom Kha soup as well. Thank you for a great dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kxg_LpQqJI5Qck8_18O5Ng"
  },
  "JN-Lx6FnOwpfxFTZMOVFXQ": {
    "date": "10/25/2015",
    "text": "I'm new to Thai food, so I don't have much experience with comparing to others Thai restaurants or the origin itself. The yellow curry has been my go to for many times now, and I can say that this place has their yellow curry on point! It was about $15 for yellow curry with added chicken. You honestly don't even need the chicken because it's loaded with flavor though. Let me stop though, because I'm starting to think that this review is exclusively on yellow curry.   The customer service was great. They were super nice and friendly. Didn't take long to get our food. Oh and the dumplings are amazing (appetizer)! It was a Sunday late evening around 5, and we were the only people their! One person actually came in, but that was it. Overall, an awesome, cozy, and chill place that I will be most likely visiting back and forth now!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rGm8NKrjhoqKRx5eJc_3qA"
  },
  "1XWgQBtWVPMqlENI-10ecQ": {
    "date": "7/10/2016",
    "text": "Thailicious offers great tasting pad Thai n big portions ! They need more people to man the register.... There was quite a wait for one couple who was picking up their phone order... Hire more people please!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ggjpq3JhvrAugNqB2MsDQQ"
  },
  "keBa7p3iebbiLyxDKAwszQ": {
    "date": "5/9/2016",
    "text": "Good food and good service.  It seems close to empty the two times I went though?  I like the coconut soup and the curry.  Thought the dessert was a bit over priced.  Tried the fried bananas with ice cream.  Basically two thin spring rolls filled with banana and a scoop of coconut ice cream for $6.99.  We will enjoy dessert elsewhere next time we dine here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "bhJ6ivAuSpgXP4JiKWjSZQ"
  },
  "pzAm-t9_DyzCglGu9vcdtw": {
    "date": "10/16/2017",
    "text": "Food was great and server was superb! She had the chef prepare evil jungle princess even though it wasn't on the menu! Also, took great care to check ingredients in another dish for my allergy concerns. Red curry was awesome! Also enjoyed the calamari appetizer,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nvl8U2rJGwCeHk9q3Y8UlA"
  },
  "f8LMnrHaoHifvOJ2hkZpUQ": {
    "date": "3/11/2014",
    "text": "I am very impressed with this place. I went with a friend after yoga last week (sorry Thailicious for our smellyness!) and we were a little wary since it hasn't been open long and when we entered it was mostly empty. Well, our wariness was unnecessary, this place was great. I asked the waitress what I should get between the noodle soup and the drunken noodles... she so delicately said.... ummm lots of.... white people... order drunken noodles. Ha!!! I ordered the noodle soup with beef at her suggestion. When the soup came out I was worried... it looked kind of gross... like brown water. Oh my god this soup was good. So flavorful, like a mix of a Thai soup and a pho. Tons and tons of flavor. I ate it all. I was planning on taking half home for lunch the next day. Uh oh. I ended up deciding to order another dish to go so I would have lunch the next day and got the drunken noodles. This portion was much larger than the soup, so I was able to eat it for two days. I will say, at a 4/5 star, it wasn't spicy. Also, though good, it didn't touch the flavor of the soup. I will come back here for that soup, so good!  Cons include - expensive for the portion size (can usually make at least two meals out of a 10$ bowl of soup, but not so here), the drunken noodles were not the best I have had, and they put a big mass of carrot strings on their noodles as garnish... don't really get this, why not put the carrot in the noodle mix? the carrot garnish was a little odd after heating the rest up the second day.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "d_TBs6J3twMy9GChqUEXkg"
  },
  "hgcW4VIuyB1gpqDU-cZU-A": {
    "date": "9/10/2015",
    "text": "The good: service was friendly and super fast. The salad and soup bar were decent. The Holy Basil was decent as well. The crispy roll was good.   The bad: I had the pad Thai and it was awful.  This was due in part to it being tipped with spoiled bean sprouts. However, I still think the pad Thai would have been subpar given its excessively sweet sauce. I ordered it 4 (hot) and I would say it was mild or medium at best.    My husband ordered the Holy Basil 5 (Thai hot). It was medium spicy as well. Both plates were very skimpy on the meat. We ordered chicken and pork (respectively) and maybe had 5-7 pieces of meat on each dish.   They did void my pad Thai so I didn't pay for it. Despite the good service, the food just wasn't good enough to warrant a return visit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kWMRlv57YjNeRPxXoK_7Mg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. The spoiled bean sprouts",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kWMRlv57YjNeRPxXoK_7Mg/o.jpg"
      }
    ],
    "user_id": "6HZMazapmxIaiEs4UwVsXA"
  },
  "5LnUv0JB8jg2xB1q0VVU0w": {
    "date": "6/1/2016",
    "text": "The place is clean and service is prompt. Love the drunken noodles and have it served Thai Spicy. Sooo good. Soup and salad bar are yummy and the peanut sauce/ dressing is to die for.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XE6VkDBwLI1cKD2t7dMgwA"
  },
  "OUUJI43rmkwDW6YNhMWtOw": {
    "date": "3/16/2014",
    "text": "Bangkok in Arizona! Since I have been in BK 6 times, I can tell if the food is authentic. And the food here is truly AUTHENTIC! We ordered a red curry with chicken, Tom Yum soup, desert with Fried Banana with ice cream and they were absolutely delicious. I was pretty impressed with the food and the decoration here. Service is very good and the restaurant is pretty clean! Also, we got a complimentary Thai Tea Pudding desert !!!  Cons is it is a bit pricy compared to its portion. But over all, it is a must place to have authentic Thai food! We will come back for sure :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZKyzLldcLTnW_S-HiBVPLQ"
  },
  "HyKoqVb12jef-2FvQL31JQ": {
    "date": "7/15/2016",
    "text": "Have never been here before, but I've been craving some pad thai and a thai iced tea, so I called and put in an order for pickup on a Friday evening. Gal that took my order over the phone was nice. Food was done faster than she quoted. Sticker shock with the price...vegetable/shrimp pad thai and a thai ice tea = $20? A little pricey in my opinion. A huge serving of food, but the pad thai itself wasn't even that good. It majorly lacked in flavor and there weren't that many vegetables. Noodles seemed a little dry and sticky. Could have used more sauce. Thai iced tea was only okay.   Was not worth the money. Probably will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sImq901wECKawvRP9MsoIQ"
  },
  "2yQr8sX3rP_OH-foQtboFg": {
    "date": "7/9/2017",
    "text": "Was craving Thai food.... yelped to see what was close to home and stumbled upon this location. Went in to do a take out order at 8pmish, hostess was very nice and friendly and helped me pick out an appetizer. Ordered the pad Thai with chicken (not spicy) and was SUPER flavorful!  Ordered the pad Thai with beef spicy for my other half- he'd never had Thai food before and was very impressed!  Also ordered the sticky rice with mango and it was delicious. Would highly recommend to anyone looking to get their Thai fix :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V1x2pduN2y-MjX65XmAzfA"
  },
  "Cp62bVLhvfEYgDRYUqgzcg": {
    "date": "2/21/2014",
    "text": "Fantastic food!  Just a touch better than everywhere else we've tried Thai. Hubby had the drunken noodle, Thai hot. It was so fabulous that I couldn't keep away despite my fire- mouth. There was a menu mixup which the owner corrected and completely made right. So, we had a shrimp and broccoli specialty dish which was really good, but not spectacular. Finally, the panang curry. Oh my!  It was sincerely the best panang I've eaten in California or Arizona!  It didn't have that corner market curry taste, instead, was very fresh and flavorful. I had no complaints about service, as they were around often to fill up the glass and to check how you're doing. Oh, and the drink Basil Smash is a great sweet drink to try! We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ad8AwD3qqDFtc-6jiCdgCw"
  },
  "PSV4nrydREIL2vLRS44T0w": {
    "date": "8/9/2017",
    "text": "I wasn't really impressed, but I didn't have a bad experience.  I had the Masaman Curry with chicken; which was tasty (very sweet and creamy), but the portion size was pretty small, with very little chicken.  The potatoes in the dish were a bit too firm and almost crunchy.  My dinner date had the pad see ew noodles, and he liked his.  I did notice that we both asked for a spicy rate of \"2.\"  Mine had zero spice and his was a lot more spicier than mine; yet we both asked for the same level of spice.  Diner beware, this can really ruin your experience if a restaurant does not know how to control the spiciness of their entrees.  Wasn't an issue for us though.  We also ordered a pot stickers appetizer that turned out to be rather bland.  I've bought frozen pot stickers from the grocery store that have had more flavor.  I had to laugh that someone else commented on the background music of this restaurant; I find the choice in music to be odd.  The layout and decor of the restaurant doesn't look very well established or well thought out.  It wasn't very busy at all and one employee was running all of the service in the dining room.  With all the good Thai restaurants around, I wouldn't add this to the list of options.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vV7PAaSHB6m__NOY0HHPUg"
  },
  "sJVoWsZwXpUi8Y3wRhSfAw": {
    "date": "12/1/2014",
    "text": "Went for a take-out lunch.  Ordered chicken red curry, medium spice. I found out after I got back to work with my meal that they don't include salad or soup with your take-out order. This is too bad because I was looking forward to that and the price is the same!  Is it that hard to pack a salad or soup?    Anyway, the red curry sauce was excellent tasting and the spice level was right on. However the chicken tasted a little like freezer burn and was over cooked. The spring roll was very good.   Overall not a bad lunch but could have been better with the soup and salad and fresher chicken. I was hungry 3 hrs later and for 10 bucks plus 2 dollar tip I wanted a little more. Next time I'll eat it in!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QfixYTYIw0jXoexAf44okA"
  },
  "dGnmqa7R4RtmE3Md2GRE8g": {
    "date": "9/8/2014",
    "text": "Ummm Good, I love spicy asian food and Thailicious was recommended to me by a friend, they were so right.  Great Flavor without scorching my taste buds.  The service was great and the prices for Lunch were great, If you love Thai food then this place should be on your A List, and if you a member of the Lunch club we will be here in October for sure...",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ugqJv1hSfGsD3ui9KtvCQ"
  },
  "TpeySrH3DGI642tsfKQ7Gg": {
    "date": "3/16/2016",
    "text": "One of the best lunch specials in the East Valley.  We love this place for the drunken noodles.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VkUfz-QuNF9qeGXUhaNpTA"
  },
  "Nyi7ioHC7HduilsJczQlMw": {
    "date": "12/14/2015",
    "text": "I recently relocated to Chandler from the Seattle area and unfortunately (or fortunately?) had to find a new go-to Thai restaurant. This was my first stop, and this is IT. My husband and I had the Thailicious Dumpling for an appetizer and shared the Pad Thai and Massaman curry. Everything was terrific, and the portions are generous. We ordered it to go, so I can't comment too much on the service. They were friendly and quick for a Friday evening. I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UDs4-vd8RujBInfXZWTB-g"
  },
  "-OkbU3V2tsBSN2qmqcr6DQ": {
    "date": "7/8/2014",
    "text": "I decided to try this food on my day off at the house and was really disappointed with the outcome of the order.   I ordered about 50 dollars worth of food and of course a coke.  I saw that the coke on the menu from Grubhub was 2.50 or 3.00 I can't remember exactly and was expecting a 2 liter of coke. to my surprise I received a 12 oz can of coke. I tipped the driver 10 dollars and called the store back.   I was really upset with the lack of customer service and the lack of understanding and had to return the order. It was a lose lose for both parties and I would be careful ordering from this restaurant in fact I think that they stopped taking deliveries last night.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L5w5f1ZzuNtvYmkAg1AF0w"
  },
  "centajL-9V5N2C9aGpkd_Q": {
    "date": "7/26/2014",
    "text": "Delicious!  Live music was a treat!  The food was great and seemed very fresh.  Wine list needs a little variety.  Server rushed us a bit, asking to take our dinner order before we got our drinks which took 15 minutes. Bartender had alot of important texting to do. ;0)  You have a really sweet dining room/vibe. If you step up the service and really SERVE your guests, you will be successful.  We will for sure be back with friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MWorXXFGZ4WUBxUMCz83ng"
  },
  "HTK7KmjCa8gI1XYfpsCSbw": {
    "date": "10/24/2014",
    "text": "Delivery We all have had the quality of our food minish when it is delivered.  Not the case with Thailicious.   Easily some of the best Thai food ever, the seafood was so fresh tasting, yum.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_3jur9xGEKwkU32aR10v8w"
  },
  "BiOQMEOsLRipilFNPxvkGQ": {
    "date": "5/14/2016",
    "text": "Absolutely everything here is outstanding. No joke. Best Thai food I've ever had, hands down. And the Thai Iced Tea is out of this world.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wZkg5jRVFLTMv6JYEYfMVw"
  },
  "eiKA9ILqqHKW5X_3wonqNg": {
    "date": "5/1/2014",
    "text": "We heard about this new Thai restaurant and stopped in today for their lunch special. I really enjoyed being able to make my own salad at the salad bar, and the hot and sour soup was just delicious. I ordered pad Thai because they didn't have Panang curry on the lunch menu and I always get Panang Curry. It was spicy and had a lot of egg and chicken. It came with a little spring roll that was just a touch dry. I would go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jtPHQckLwG6Mldb06-oNTw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Lunch pad Thai.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jtPHQckLwG6Mldb06-oNTw/o.jpg"
      },
      {
        "img_id": "KsI1XU-feFgDMRXU9jXTiQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Salad and soup bar.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KsI1XU-feFgDMRXU9jXTiQ/o.jpg"
      }
    ],
    "user_id": "UK2DsID5q3MCqYX23S6xXw"
  },
  "stVoO-dWyGu_qxQn-6_zAg": {
    "date": "1/27/2016",
    "text": "This place had amazing service.  Do you understand how hard that is to come by in an asian restaurant?  Do yourself a favor and get the curry",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "EE91Oh_bfHg-4u1TsUkibA"
  },
  "zfmjJDmpTSubMNJNIcIIjg": {
    "date": "3/18/2016",
    "text": "This place is Thailicious!!! Their Lard na was delicious,  Drunken Noodle was fantastic, had great taste and was perfectly spicy. The Colorful Vegetable were superb, and had the perfect combination. We're definitely coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1WwwH21QG24mc1bm7TPSg"
  },
  "cARTQraJ2E2Wv74ygBiA1A": {
    "date": "12/22/2015",
    "text": "Omg!! The food is outstanding!!  Deliciousness, I will definitely be back. Great service and the place as super clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dPMZAooTkOpA7r6-ckIeRQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Omg!! The food is outstanding!!  Deliciousness, I will definitely be back. Great service and the place as super clean.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dPMZAooTkOpA7r6-ckIeRQ/o.jpg"
      }
    ],
    "user_id": "G4PTeVGP7NP0NQcbT3TXAQ"
  },
  "QxN3bWNjARnG9yDWa72Tlg": {
    "date": "6/21/2018",
    "text": "Been to quit a few Thai restaurants around the valley, and this place is very good, tasty  and full of flavors!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kI0gHF-NEgBzExBp0A9v5w"
  },
  "p23oNrqV0AVs7cpropm84Q": {
    "date": "6/12/2018",
    "text": "Visiting from San Diego and came across this place on yelp. They had great reviews so I had to try it for myself. The food was delicious which explains why it's called Thailicious. The service was amazing and our waitress was very friendly. I would highly recommend this place to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eMK-lpLUeYD5r_So-ip2qQ"
  },
  "mn88TsBsQnjYA_l3-GG3oQ": {
    "date": "1/11/2019",
    "text": "We enjoyed dinner here tonight. Especially enjoyed the Spicy Noodles. The green curry and masaman curry was also quite good, as was the coconut soup. This little place is a winner!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ol25__A2978xfFyspkoazA"
  },
  "v5I0a3Edk5eH2k8jDVVCZw": {
    "date": "6/6/2018",
    "text": "This food was delicious, all the reviews are correct.  I ordered online and it was ready and packaged wonderfully and the food is amazing.  I regularly will be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xL48WqENd3p9R20dLOQbg"
  },
  "6MQO5idT6kLzPuz8eDcbkA": {
    "date": "11/2/2015",
    "text": "Thailicious wasn't so delicious.   The service was amazing and fast even though we came in for lunch and the place was packed. The decor was lovely.  Got to love the salad and soup bar. The warm peanut sauce... Yum!!!!  I got the green curry with beef - medium spice. - the beef was very tough - the eggplant was thinly sliced so the usual melt in my mouth eggplant feeling was missing - spice level was on point and the portion was huge  My friend got the seafood pad Thai - mild spice. - the seafood in it was still raw.... They probably could've cooked it a little longer. On the bright side, they put plenty of seafood in it -missing something that I can't figure   My boyfriend got the Thai basil fried rice with chicken and i think it was the best dish of all 3.  - chicken was extremely tender - everything was just on point!!!  The food isn't bad, i probably wouldn't return because there's other Thai food places closer to me that's better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SCwxbifBmteUo5lvu1ObKg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Thai basil fried rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SCwxbifBmteUo5lvu1ObKg/o.jpg"
      },
      {
        "img_id": "CAdaa3D9m9-4h6CIWYkJ_A",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Green curry with beef - medium spice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CAdaa3D9m9-4h6CIWYkJ_A/o.jpg"
      },
      {
        "img_id": "Ds7-VDtQHwYmrHVXEZGRUA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Thai tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ds7-VDtQHwYmrHVXEZGRUA/o.jpg"
      }
    ],
    "user_id": "YDYArKOwV5x_ILkp59-UQA"
  },
  "wPRF8WwjQhieuHJs2-A_gQ": {
    "date": "9/23/2017",
    "text": "Came here to try their lunch special. For 8.99 you can get soup & salad and your choice of entrees that include curries or pan fried noodles. I had to order my standard pad thai. on the lunch menu. The Pad Thai was a bit too sweet. Their Drunken noodles are a better choice with fragrant thai basil. The salad that day was simple but had a nice peanut  sauce. Soup was a sweet and sour soup. Thai tea here was good. Overall, a nice choice for a quick lunch.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "J-ZMQMjMhoJ6oTDZ_Y-MNw"
  },
  "n6u3s_OOOMUdDptzce_Vkg": {
    "date": "11/9/2016",
    "text": "In our mission to seek out the best Thai food wherever we live, we finally made it to Thailicious (well, takeout anyway).   I ordered the Pepper Beef lunch special, and my wife got the Drunken Noodles with chicken. Flavors are typical for Thai fare, but nowhere near the heat range from the number of stars ordered (they use a mild thru hot range vs stars, 3 is supposedly medium but tastes like a zero).   Takeout lunches did not come with soup or salad, just the Thai spring roll (which was nice and crisp), and the portions were TINY compared to nearby Swaddee Thai (our favorite Thai place so far).   Called to let them know about the lack of spicy in the dishes, got a couple of sorries then was hung up on. Yay.   Fun fact: they have punch cards! I've got two punches on mine--anybody want it, because we are never going back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZgVH70rgecYyChn6-nwlmQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Small lunch portions! And didn&amp;#39;t come with soup or salad, just the Thai spring roll.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZgVH70rgecYyChn6-nwlmQ/o.jpg"
      }
    ],
    "user_id": "0-4JZi3OM9LWSio1_HeI_g"
  },
  "mgcEzb852D3t1CX_hKpvAg": {
    "date": "3/2/2018",
    "text": "Great service and very friendly. First time eating Thai food. Yummy had soup and basil something lol.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YPei_H_c6p6zdbeG8qC6rA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YPei_H_c6p6zdbeG8qC6rA/o.jpg"
      }
    ],
    "user_id": "HmFF2Re2dOIpAieppoYx-w"
  },
  "az5YmOpzwwN-Zq0Pjw9ZMg": {
    "date": "3/1/2019",
    "text": "Dinner for 5. Every dish was awesome!!! We had Drunken Noodles, Rama, Pineapple Fried Rice, yellow curry, and the Spice of Life!!! My favorite was the Rams!!!! Excellent!!! Nice quiet environment. A very nice place to be if you want to enjoy a conversation over dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VUXrdceDmJjSefA1B4FwRA"
  },
  "S4JHgKFkBNmhaXtPbkj-5g": {
    "date": "10/19/2017",
    "text": "Thailicious! Omg!! This food is delicious! I can't stop coming because it so good. I usually get the lunch chicken pad thai lunch menu comes with salad,egg roll and soup. Great customer service and food is fresh and amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wcGHv24Ae2liC8qDe5Zi3A",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wcGHv24Ae2liC8qDe5Zi3A/o.jpg"
      }
    ],
    "user_id": "rF_xEMpqOp1te33DS_c9vA"
  },
  "XTjLD-Ikpd_8crs_7llzRw": {
    "date": "11/10/2017",
    "text": "Update, since last I was here, I was in the neighborhood and we decided to stop by. I was disappointed with  their Tom Yum Goong, didn't taste like the first time I was here, it had a total different flavor, their spring rolls had a very tuff texture, and the egg roll seemed like, either it was previously frozen not fresh or it was old.... Customer service, could improve. The only things that we enjoyed, was the pad see ew and their Thai tea. I do not recommend this restaurant.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hbSu4MNhx7J-5zm_Y4Iq-g"
  },
  "ox9pBUKjyWWe9kmf_N4DLQ": {
    "date": "1/14/2019",
    "text": "Good food. They have unlimited soup and salad for lunch. Love their peanut dressing. Average ambience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i_FXWLldE2DKgvE8dXwp2A"
  },
  "fYl-0-QNl3zbFkbhOwxVhw": {
    "date": "1/11/2019",
    "text": "Amazing food.  I am vegetarian and my husband is a meat eater and we were both pleased.  Come check them.  Make sure to order the Tom Kha soup and Garlic Lover!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NzAGdDh3SW6FDabRA5CgMg"
  },
  "mQKlvMU5ygieBD6_y2QSMw": {
    "date": "8/10/2018",
    "text": "This is one of my favorite Thai places. Staff is always super nice make me feel at home.     Food has been great every time.   Thank you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yZLL9goVPd63cXSi8ZGbJg"
  },
  "u57y6qHIE0Rukq0zCwLo7g": {
    "date": "5/10/2015",
    "text": "I've eaten at quite a few Thai restaurants here in the valley and just tried this one tonight for the first time. When you first enter, you realize how well laid out this restaurant is, not super formal, not super casual, somewhere comfortable in between. It's spacious and well laid out. We were greeted with a friendly smile and taken immediately to a comfortable booth.  The service was prompt and extremely friendly. The restaurant is clean and comfortable. We ordered satay chicken appetizer and a few entrees.  The satay chicken was the best I've ever had. It was served with the best peanut sauce and cucumber sauce I've ever had as well. The Penang and pad Thai were incredible, also the best I've ever had. My Mom's dish had chicken and shrimp and mushrooms and a sweet brown sauce, can't remember the name, but it was delicious! For dessert, we had coconut ice cream. Again, the creamiest, best coconut ice cream I've ever had in any Thai restaurant or possibly anywhere else. The food was hands-down excellent.  So, here are my ratings: atmosphere is an eight. Service is a 9.5. Food quality, taste, temperature, spice and quantity were outstanding, 9.5.  Presentation is beautiful.  This place is clearly not a chain type restaurant. Not exactly a hole in the wall either. It is clearly privately owned by people with old world recipes, quality ingredients, and truly care about the experience of eating in this restaurant. It seems to be frequented by Asian folks, and they clearly know their Thai food.  Of all the Thai restaurants I've been to in Arizona, I would return here first, hands down.  Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "KXlbUU0SMuaw8VA16oCPWA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Panang - delicious, best I&amp;#39;ve had and I get this dish everywhere",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KXlbUU0SMuaw8VA16oCPWA/o.jpg"
      },
      {
        "img_id": "siAFawOS3flbnWQAyzum7Q",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Mom&amp;#39;s dish, forgot the entrée name",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/siAFawOS3flbnWQAyzum7Q/o.jpg"
      },
      {
        "img_id": "vJjrfeVOTNN1ENQa4E2czA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Pad Thai",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vJjrfeVOTNN1ENQa4E2czA/o.jpg"
      }
    ],
    "user_id": "FWW0x5aoy-hFXALL5-mq5g"
  },
  "lWii5ezdmyBbFvMc_WpRyQ": {
    "date": "5/11/2018",
    "text": "Stopped here for lunch. Soup and salad was included w/lunch. Entrees took a long time to come out. A large group had showed up just before us so I'm not sure if that's why it took so long. All the food was very fresh and flavorful. I would recommend if your in the area and have the time to stop by and grab a bite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KL2KlPuTS_7JfWIjz-YQIg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Thai fried rice w/chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KL2KlPuTS_7JfWIjz-YQIg/o.jpg"
      },
      {
        "img_id": "cr9LCepBxFAetHTc4P25Bg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Drunken noodles w/beef",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cr9LCepBxFAetHTc4P25Bg/o.jpg"
      }
    ],
    "user_id": "4yMQYuk6CJM0ebDtEEI0Gw"
  },
  "JZQ0GVC-RPR-T2uxzvuU_A": {
    "date": "1/11/2019",
    "text": "Definitely not good Thai food. Tom Yum Soup was full of cabbage and tomatoes opposed to the usual lemongrass, mushroom, and onion. The chicken in the soup was of poor quality, it tasted very unusual and bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IQXC5VStLlfB7oOMHbhZiQ"
  },
  "x9vL2Nq6feLdeP3V8WRoYA": {
    "date": "9/22/2017",
    "text": "I'm a mostly vegetarian eater and am a huge fan of curries. I'm also a creature of habit so curry dishes tend to be mostly what I gravitate towards.    I'm constantly craving the delicious Green Curry (with tofu) entree from Thailicious. I love that you can customize the level of heat...I go for the T'hot which gives just the right amount of heat imo.  Also I'm surprised this isn't listed in the \"What's Good\" section because this dish is superb and deserves to be there.  But even more than the main entree, can I say I am OBSESSED with the Tom Yum Chicken Soup. The perfect blend of hot and sour, and if you ask them to use tofu instead of chicken, it's an even bigger treat.  Order a pot because you'll want it the next day for sure.   I've ordered this same meal several times now but last time decided to try the Thai iced tea, and fell in love with that too.  This go around when I went to pick up my food, I got to the car and realized I made the mistake of forgetting to order that tasty tea.  So I ran back in, and explained my dummy move and was given my iced tea on the house!  That was such a surprise, it was seriously the highlight of my really bad day....so thank you to the kind hostess whose name I didn't ask.  Lastly, sides never get the glory they deserve, so do yourself a favor and get a side (or two-I regret not getting two) of the \"cucumber sauce\" and sprinkle over the soup or over your entree....or literally eat it with a spoon like me!  That's it folks, this little gem of a restaurant would be a perfect place to try if you haven't already.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EDsUNb8-hL1kSiQJH-9y5Q"
  },
  "3W3BRrq2BQAs6e1SKGbSPw": {
    "date": "2/20/2018",
    "text": "First time coming here, very tasty! I am a huge fan of green curry, it was an amazing spice and the veggies were very fresh. My husband had the drunken noodles, also very good. The only thing I would say is that the AC was on, it was very cold in the restaurant, but the tea and food definitely made it!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FYXrWDA57-zEIMiiXtUOjQ"
  },
  "5Xw-q9pLgZJcFagQuW5Nsg": {
    "date": "5/29/2018",
    "text": "I love Thai everything.  Eventually going to retire there.  So trying to get the best Thai food is hard in the US especially in Phoenix, AZ.  I found this little gem of an establishment.  Not over the top cheesy Thai (fake Asian) decor. Just good environment with good Thai flavors. Pad Thai, fried tofu, larb, Tom yum, curries and more of all the classics!  Going to be a weekly hit spot for me to kill the Thai food cravings I get!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1WFQjtZAeJFB1RHwBxI5g"
  },
  "cO9RIqbG6viIZpDK6n1eqg": {
    "date": "2/21/2015",
    "text": "This place has good Thai food at a good price. I have eaten here several times and the staff is always attentive and friendly. You don't have to wait long for your food either, the kitchen is speedy! My personal favorite is the drunken noodles and I also like the pad thai. I love that you can choose your own spice level on every dish too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GWs6_VEqjmsdKjSGTQ3r2g"
  },
  "KEhIHH9wDL_9xxDFedYrBQ": {
    "date": "6/19/2014",
    "text": "This was the best thai food I have had in the valley. Service was very good and the restaurant was quiet, even though they were busy.This is my new place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4RMYjhLUqMzwqjWjcrpiew"
  },
  "ezWzLLknAlETgNNFBCqARQ": {
    "date": "8/4/2014",
    "text": "Excellent drunken noodles!!! I ordered food for delivery and it arrived in 35 to 40 min.. the food was hot and yummy!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H0lDBVZeUhaK-nVO6W3Iow"
  },
  "63SsnrNLKWcqiIWynTUH7w": {
    "date": "6/16/2014",
    "text": "Overall...probably best Thai restaurant in valley next to yuphas. I m giving it 5 stars cuz all the other mediocre Thai restuarants are given 4. So in comparison to them def a 5.  All noodle dishes are good. Pad se ewe , pad Thai..solid. Drunken noodlesand beef salad are better at yuphas. But still good. Fresh spring rolls were fantastic! Esp if u want something light and fresh. All the desserts are excellent...fried bananas, coconut ice cream. Also fried rice is exceptional. Portions are on smaller size. Will def go back. Oh...yellow curry is ok.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6gZpN5ATdv-09QnaxpI9AQ"
  },
  "JfK57RXG9UV9s0rYYcYZcw": {
    "date": "7/22/2014",
    "text": "Matches or exceeds the numerous other Thai restaurants in our Phoenix metro area dining experiences. Immaculate, nicely decorated interior, but a rather non -descript exterior in a strip mall. Tasty salad bar and soup included with lunch menu items. Ordered Thai pepper beef and drunken noodles. Both were fragment, nicely presented and ample. The drunken noodle dish was extraordinarily multi-ingredient with plenty of luscious chicken and Thai sweet basil. Rice was perfect and fragrant(Thai jasmine). Overall, a marvelous dining experience courteously and well served.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TCVxYnZkhdOGu-6DMIHpNQ"
  },
  "_S2P80YKohwy0AAKr5IgcQ": {
    "date": "7/3/2014",
    "text": "This place is as good as they say it is. I have had two different entrees, both the Red Curry AND the Drunken Noodles are great just like my fellow Yelpers suggested. I also am a crab puff FREAK and so I tried the Crab Spring Rolls. Also delicious. However stay away from the Calamari. It looks and tastes like dino bites quality from the freezer section. The order was ready for pickup in a timely manner and the young lady greeting me was nice and helpful. Enjoy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zfpg2RNAeRZJTcFLHtnRHA"
  },
  "n69u70yvKTuAj6IzJpjV4w": {
    "date": "3/21/2014",
    "text": "I have been here twice. The have tried Pineapple fried rice, drunken Noodles and red curry. Everything was very good but Red Curry was awesome. The best thai food in Chandler.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8OhuFEuxACho0mzr2l03hw"
  },
  "9uhFtxg9IP7r1XSnrxxL2Q": {
    "date": "6/8/2014",
    "text": "DELICIOUS! I have been to nearly every Thai restaurant in the valley, and spent a month in Bangkok. The food is far better than the name; trust me. I recommend the Tom Ka Gai, Panang Curry, and Pad Thai! Everything is freshly prepared, the restaurant is very clean and aesthetically pleasing, and the staff is excellent. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s0QvCZ6tZ-O6CBl8qIAM7w"
  },
  "Qr6p_oW0Xka14TvN9r26Bw": {
    "date": "4/7/2014",
    "text": "Loved the food!  Thai food is my absolute favorite.  Went for lunch with a work group.  Everyone loved the food, including a Thai newbie and Vegetarian!  The staff was fast and friendly.  The restaurant is clean and modern.  Lunch orders come with soup, salad and spring rolls.  I enjoyed the Garlic Beef and Chai tea (the best Chai I've ever had), but had the taste of the Curry Chicken and it was wonderful!  Definitely will be going back, but taking my husband for dinner.  Note:  Had the spicy at 2 and it was still pretty spicy, so be very careful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q6QC-EylxSGNcQY4Fd4L7w"
  },
  "7pUDm4t0Ri8sGP0BGSZ9dA": {
    "date": "2/23/2014",
    "text": "As full time RIvers who really like Thai food it's often difficult to find \"good\" Thai food. Last Wednesday after an appointment in downtown Phoenix we searched Yelp for a Thai Restaurant on our way back to Casa Grande, AZ. We found this restaurant not far off the 10 in Chandler which has recently opened.  The service was very friendly.  Pricing was very good.The restaurant was very clean and welcoming. The Spring Rolls, Fried Pineapple Rice with Chicken was amazing. Since we are Snow Birds we will be back! The new owner is doing a great job and should be very successful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ORvHBz0UAC1uC9a2iBKcg"
  },
  "RQR8bd19mRUqLjr8cguFLA": {
    "date": "7/25/2015",
    "text": "I am being a bit generous with three stars.  I went there last night with my wife and we arrived between 5-6PM.  Service is just okay, not wonderful nor bad.  Little displays of graciousness, like pouring my beer for me are completely absent.  We ordered Calamari, a beef dish, Tom Yum soup and a duck dish.  Everything, and I mean everything we ordered had a sweet flavor to it, as though someone cooking it meant to add salt, but mistook the sugar jar for the salt jar.  My wife's duck dish was dry, although not badly flavored.  The Tom Yum was very watery with very little ingredients other than mushrooms, and of course the shrimp I had ordered.  Calamari was okay, albeit a bit too sweet.   My beef dish's sauce was quite watery and very lightly flavored, even though I had ordered it and the Tom Yum at a \"3\" level of hotness.  Very mild.  Considering the competitive nature of restaurants I would have thought they would do a much better job.  What may be an acceptable level of service in Asia is not acceptable in the US and that is something many, many Asian/Indian restaurants around Phoenix need to learn.  Raise your game, guys. I have yet to find an Asian/Indian restaurant around here that really blows my socks off.  I am a world traveler and I have seen it done much, much better elsewhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q8JGJMevslMGLRJYUa74KQ"
  },
  "q40S91sy4P0cJoJX4EZ2Cw": {
    "date": "6/28/2014",
    "text": "Did a takeout order.  Pretty good Thai and will come back for dinner. Excellent yellow curry, pad Thai and Thai fried rice. The Pad Woon Sen was also pretty good but the beef ordered with it was a bit tough. I will update when I come back for dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wkEUf5hrjbR0MfTgZU8eVg"
  },
  "JKhrfdVbfQNVj9utzEJn0Q": {
    "date": "3/1/2014",
    "text": "We loved this place! We had lunch there and the prices were great and the food was excellent. We had Holy Basil and Colorful Vegetable, both with chicken, and they were outstanding. Both came with soup, salad & a spring roll on the lunch menu. We also decided to try the chicken satay appetizer and the thai iced tea. A perfect meal and we'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tk53h0FcrGMMWDPxUeo_oA"
  },
  "JsXTJr9ApJ_fcOKaEdZaVA": {
    "date": "4/1/2015",
    "text": "I ordered Drunken noodle for lunch as recommendation.  Unlimited salad, hot & sour soup are included.  The food serve with spring roll (so good) and all of that cost under $10 !!! \"WHAT A GREAT DEAL FOR AN AUTHENTIC THAI FOOD!!!!\"    I asked for my noodle to cook with more vegetable and less oil since I like the food a little more healthy but still delicious :)   And I got what I want!  That was awesome!  I could not finish my plate because I enjoy salad with peanut sauce too much :)  I definitely recommend this place to everyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HjRzAq0aswrnJXF4Jcm4Jg"
  },
  "3moAlaQb2Iu9tbU9HgIKYw": {
    "date": "12/23/2014",
    "text": "Good menu and the food was very tasty! The dumplings were great ! However, service was merely ok. Not sure is the best value for the money.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NQW6RkH9fphQA0SPIj7giQ"
  },
  "ejUEWBNWuorhf0_cTiZ7Sg": {
    "date": "6/1/2014",
    "text": "The best Thai food in the east valley! Such a cute restaurant and the food is amazing! Will be going back many many more times! Try the drunken noodles and pineapple fried rice! You will not be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dx2gQSFHsM4fpclrBV3d0A"
  },
  "0g_uZhzidK6e9baLn9ND5w": {
    "date": "5/30/2014",
    "text": "Wow...I've never paid so much ($7.99) for such a small bowl of soup. Thanks for the 3 shrimp...2 bits of tomato and 3 mushrooms in BROTH...in a half quart container. Additionally, we called 8 minutes before they were open...they took the call, but not our order. Told us to call back in 8 minutes. Backwards logic. Not good business considering they are one of 5 Thai restaurants within 3 miles. Won't be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ufuOeij0Px1Jl_IsVF-pbQ"
  },
  "yrk1c-QdkYRvxa_w-JPpeg": {
    "date": "4/19/2016",
    "text": "Food is very good but service is very bad. We went there Monday night at 8:30pm an was told that we could only order A togo order. IThe open sign was on and the sign in the window said they were open till 9pm. I was told that the kitchen was cleaned for the day and we could only take our food to go. Sad that a restaurant values there customers so little that they turn them away.   Shame on them!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HVviyZdEqJnjQhdkZ0YYEQ"
  },
  "jjDPM4tjQ7YcNLnG_2d4rA": {
    "date": "1/10/2016",
    "text": "My daughter and I visited on a Saturday night. The service was friendly and fast and our meals were delicious! We shared a spring roll and house salad. The ingredients were fresh. We both had the colorful vegetable entrees one with shrimp and one with chicken. The vegetables were fresh and crisp and the meats enhanced the dishes.  We enjoyed our visit to Thailicious and look forward to dining there again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FxnO9Bl7WwO6q5thxoSV5Q"
  },
  "JyuNAHEuou-K6sDjD-XkXg": {
    "date": "4/24/2014",
    "text": "Best thai food in the East Valley. Just indulged myself in the Red Curry. Amazing flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iZBRorFbp3ORbNqfBh69-Q"
  },
  "yCYG88a-tEhlG3F--C_M9Q": {
    "date": "7/24/2014",
    "text": "Sweet sour soup is good but today lunch there were only two waitresses and we had been waiting for a while . It ended up we went find them to ask for box and then brought our credit card to them for pay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cbb9UTkXj0rybGcs7PWT9Q"
  },
  "Ikecu61mp4ZMVpKfc88QZw": {
    "date": "4/3/2014",
    "text": "I was really happy to find great Thai food in Arizona.  I have no idea how authentic it is and I don't care; the green curry, garlic somethingorother and fresh rolls are all delicious and well-presented. The curry's consistency, which seem to be the downfall of most Thai places, is neither thin nor too heavy. I'll definitely be back next time work brings me to AZ.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P-QB025UiyVJzQk-XoFPww"
  },
  "6wes7l1yNcYi0xJR0a3UuQ": {
    "date": "3/2/2014",
    "text": "Some of the best Thai food that I've had and very friendly and helpfully staff. Had a hard time ordering because everything looked so good. Will be back soon to explore the menu some more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "92QVAXknKGKRbEhnruvcRQ"
  },
  "Dy3d0wnPotHsDj7-PPvoag": {
    "date": "3/24/2014",
    "text": "Great food and awesome prices and value for money at lunch. Quick service and rightly called Thai and delicious. will visit again :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XHU8CjMeT4r4wwpjs262hw"
  },
  "QkQrXSObHMHw57Vro_yguw": {
    "date": "3/11/2014",
    "text": "Great food, great service, nicely decorated clean restaraunt.  A+ I ordered the red curry with chicken (thai hot).  The spice and flavor were perfect.  The Thai iced tea was delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "odlCkfWS3cR9HxgjcklIpw"
  },
  "i5Csn5d24R2RpD7J0DiQig": {
    "date": "5/8/2014",
    "text": "What can i say. This is the BEST thai food I ever had in AZ!!!!!!  Everything we tried is good! They even have a thai tea creme brulee!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "auizc78oes1Bpu7r02lzDg"
  },
  "QNQ9KgrEunaYaXOoAJrekA": {
    "date": "1/30/2014",
    "text": "I like this place. They serve authentic Thai. If you like Thai food, i really recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wcR8N6O8sjcxjWvYIel-_A"
  },
  "SDMA7PGsnd3csfQzP-dwlg": {
    "date": "7/24/2015",
    "text": "The best Thai food I have found in Arizona.  I eat here once a week and the food is consistently delicious. It always tastes fresh and the ingredients are quality.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CB9TR6A4aX7HnXVKWAWRGQ"
  },
  "bd6S0xyYxLt4E5p6L2Imlg": {
    "date": "2/16/2015",
    "text": "Our experience at Thailicious was anything but -licious. We arrived, a party of four, for an early Sunday evening dinner. We were greeted with delay, as the host was also the primary cashier for every other party present. The host eventually got around to acknowledging our presence and seated us. Again, with about a 10 minute delay, our drink orders (simply water and wine) taken; and as the waitresses/host/cashier urged us to order all dinner items too, we did that in a rush. The drink orders did not come in a timely manner, many ingredients were missing from the bar, and we had to remind the waitress of what we ordered. It took about 35-40 minutes for the dinner entrees to arrive, which were tasty, but again, wrong.  An order of brown rice suddenly turned into an order of white rice, and the seafood portions were pathetic for the price. Bottom line: not coming back here again. Don't waste your $$$.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DGbB-HgXft99BlO4zeRXBg"
  },
  "C6YGskX9NtivEQ9qKTsjhw": {
    "date": "4/13/2015",
    "text": "I am so glad we chose this restaurant for my birthday. Excellent food and great service. The entree  portion's were very generous. I will be back again!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iwOGkV3OwS1LZ_hCBhHsZA"
  },
  "Pa-w_FXom1JXUWPNaQwVtA": {
    "date": "12/27/2014",
    "text": "A group of us went here for lunch. The food was average. Not yucky, but not memorable either. Everyone had the same feeling towards their dish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sgquvluHhQSNnqXnGYsGGg"
  },
  "m2zBXY0kbZ3IS-Za-7gGBA": {
    "date": "4/21/2019",
    "text": "The drunken noodles are on point.  Looking forward to the pad Thai next time. So far, it's been the best Thai place in Az for us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MRQaRFKssAxzJtKNhtGiaA"
  },
  "O2rj2TOvawskoGSChG7qAA": {
    "date": "3/30/2019",
    "text": "Our group ordered the following dishes, so I had a chance to try many things:  Pad Prik Khing: Tastes good but remember to order with extra sauce. I would order again.  Pad See Ew: Tastes very similar to Drunken Noodles but I prefer Drunken Noodles. I would order again.  Drunken Noodle: Love it. I would order again.  Panang Curry: Good. I would order again.  Red Curry: Love it. I would order again.  Pad Thai: Was very sweet. It's normally peanut buttery at other restaurants. In either case, whether sweet or peanut buttery, I'm not a fan of Pad Thai in general. I would NOT order again because of my personal taste preference.  Opportunity for improvement: Portions are smaller than other places. Could increase the size by 10%.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oOp38zfblIE3gH-dUJpPQA"
  },
  "zhaXocefjhESRxrhbEHxQQ": {
    "date": "3/13/2019",
    "text": "Amazing lunch deal!! Buffet/ All you can eat Hot & Sour soup and salad w/ hot peanut dressing. So many options for vegans or gluten-free eaters. You MUST come here!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SFsnQfngUO1Obz1UDqZgHg"
  },
  "bwAddkIpkDoX2kxBA3uTBw": {
    "date": "7/1/2018",
    "text": "What a great Thai restaurant - our new favorite! We stopped in for dinner on a recent weeknight on the recommendation of one of my husband's coworkers and it was a delightful experience. The food was absolutely delicious, with offerings besides those normally on a Thai restaurant menu, the atmosphere was pleasant and welcoming, and our server was charming, informative, and efficient. In addition to our delicious entrees (Pineapple Fried Rice with shrimp and Panang Curry with shrimp, both prepared perfectly), we ordered the corn fritter appetizer, which was delicious and not like anything we've eaten before, and fried bananas with coconut ice cream (\"FBI\") for dessert. Yum!! We highly recommend Thailicious and we'll be back on a regular basis. We're definitely bringing any out of town guests here to share the joy!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KL9WNSMs3IsP4555eH5TDQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Fried Bananas with Ice Cream (&amp;#34;FBI&amp;#34;) dessert. SO good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KL9WNSMs3IsP4555eH5TDQ/o.jpg"
      },
      {
        "img_id": "C9F8Y1KcdASdNb-mGXUIgA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Perfectly-prepared entrees with appealing garnish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C9F8Y1KcdASdNb-mGXUIgA/o.jpg"
      },
      {
        "img_id": "Mn9zanqGLb1DAoU4KTcAsA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Corn Fritter appetizer. Delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Mn9zanqGLb1DAoU4KTcAsA/o.jpg"
      }
    ],
    "user_id": "T-a9DwJQ0lnxQHQ63wa6Cg"
  },
  "eqE6H_SMQB0WahkYbziedA": {
    "date": "1/18/2019",
    "text": "Received terrible service from this server who refused to remake a plate for me that was not the spicy level I ordered. On top of that the server had a terrible attitude. Will not be going back here anytime soon, would recommend this place if you want to get treated like crap.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C5ucF8S0nna1FW43SpobOw"
  },
  "P_uQdt6imNUoR8FRyKEEnQ": {
    "date": "10/24/2017",
    "text": "A typical Thai restaurant. The decor was simple. The service was attentive and polite.   My wife & I ordered 2 typical dishes at medium spiciness level: Pad see ew with beef & red curry with chicken. However, both dishes came out very mild.   The beef pad see ew was delicious, in spite of its mildness. The meat was tender and tasty; the vegetables were cooked right and flavorful. We had to request additional red pepper powder to increase its spiciness.   The red curry with chicken had a rich and tasty broth. The pieces of chicken were moist, tender & tasty. So were the vegetables.   We will return to this restaurant to try other dishes, when we are in the neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "T9kc7e3IuWOe8VXBT0Ik3Q",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Chicken red curry. Tasty &amp;amp; rich. Rating: Pretty Good.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T9kc7e3IuWOe8VXBT0Ik3Q/o.jpg"
      },
      {
        "img_id": "m_uttUUXbjdGSDgBKWu-sQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Pad see ew with beef. Flavorful. Rating: Very Good.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m_uttUUXbjdGSDgBKWu-sQ/o.jpg"
      }
    ],
    "user_id": "bHzZ3shHF1PzBbqB47Ax0Q"
  },
  "ylIX3GSZV5MT5vFVfw0-UQ": {
    "date": "2/25/2019",
    "text": "We enjoyed this place, fast friendly service, nice decor, clean and peaceful  with the best Thai food around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d1LwGIu1B4v5ZuJ71qBwZw"
  },
  "lWvOwbqvaoZQqHjtMoD-BA": {
    "date": "1/18/2019",
    "text": "Love the services here the food is always great here. We love come here. The best Thai food so far. Everything is always great here. Thai pho is my favorite the papaya salad never disappoint me",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "odBmak2rBJE_dMbvujBiYQ"
  },
  "tdCPHCHjdeD3yEnpPaRPwg": {
    "date": "3/12/2018",
    "text": "Excellent food here! Definitely top notch and when people ask me where they should go for Asian food in the area, this is the place I recommend. I am a foodie so I had to get two entrees and an appetizer to make sure it was True. I had delicious leftovers that were enjoyed by all. The pad Thai was my favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ao8zAJ4Kt44Iy2MbRZPPSQ"
  },
  "CZgm7QXhQ9lC1oHIZgivrg": {
    "date": "8/14/2018",
    "text": "My first time at Thailicious and it was definitely delicious! Great customer service and a peaceful quiet atmosphere. Awesome lighting inside and cute decor. Perfect little date spot. I ordered the green curry with shrimp and it was wonderfully spicy (medium) and stayed piping hot the whole time I was eating it. We also scored with the mango sticky rice, it was a perfect light desert to balance our savory meals. Loved this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OhPnyq0k6aaJfl67B2kqwg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OhPnyq0k6aaJfl67B2kqwg/o.jpg"
      },
      {
        "img_id": "JzNu4QjXCJc9UPvWuw1eqQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JzNu4QjXCJc9UPvWuw1eqQ/o.jpg"
      }
    ],
    "user_id": "xUMo3zQYm_Dij3sQKAh7EA"
  },
  "er7b_v7Uuqg_gRx6vaPxcw": {
    "date": "12/14/2018",
    "text": "I think the restaurant owner should fire one of their waitresses! Terrible service!!  Today, on December 14,2018 we had lunch here at Thailicious. We ordered three dishes: Heavenly ginger, Basil fried rice and Drunken Noodles. We repeated our order to the waitress (not the one with the eyeglasses), but we still got the traditional Thai fried rice...I asked for the Basil fried rice not the traditional one and the waitress got angry and kept saying it's our fault to place the wrong order(we were getting really serious argument). What's going on here?  She relentlessly took the wrong dish away and asked the chief to add some basil to the wrong dish to make it as \"basil fried rice\"... I must say it tasted so terrible...not the Thailicious style we used to love...  We were unlucky today I must say. Can the restaurant manager do something to deal with the waitress? Otherwise we will never visit this place again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eKQKche7tDmuY4otebH34A"
  },
  "GEdsk_O8X0X4bcmiEMpM-w": {
    "date": "11/20/2018",
    "text": "We had the Thai fried rice, medium and it was delicious. We also ordered the pad Thai, although good just way to sweet even with medium spice. The staff was nice, we will return for dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7f0QKgM24qpdSjdgukofA"
  },
  "yYAvVQfRWEUsh17l6unAwQ": {
    "date": "11/10/2018",
    "text": "Awesome food and very friendly staff. Really cute inside and a small bar. Will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kuRlVE4dxHiusskcKVPWgw"
  },
  "8kDr3phGRZcZH6W72LonbA": {
    "date": "4/1/2018",
    "text": "I had the pad Thai and the tom yum noodles. I liked the tom yum noodles because it was very flavorful, but it could also have been salty too at the same time. The pad Thai tasted a bit like the ketchup-style pad Thai and I didn't like it as much as the other type of pad Thai, but this one could have been more authentic. They were a bit pricier than some of the other Thai places that I have been to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BsdxzBDkjbUEC_AAk1aVHg"
  },
  "xjBh2hikKvi91gkskdiTLQ": {
    "date": "9/14/2018",
    "text": "ALL I WANTED WAS YOUR DAMN HOT AND SOUR SOUP. I called and was told hot and sour soup was served for the lunch special. It is VEGETABLE SOUP, NOT HOT AND SOUR. For that I am rating 1 Star. I wish I could pick 0 stars. Not coming back here ever again.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u6ymP6PmY7ADrpJJMNiQbA"
  },
  "53XuwfsAPRHSUaESmYeA9g": {
    "date": "10/13/2018",
    "text": "This was our first time for Thai in the area, and we were duly unimpressed. The appetizer and entree were mediocre. But the service and ambiance were sub-par. I recommend you seek your Thai fix elsewhere. If you're in the UK any time soon I highly recommend Sukothai . . . by far the best we have ever had.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iafFoh41tQMfqBQlCGjTkg"
  },
  "t_8U8BVXmmN7kcxFkAre5Q": {
    "date": "11/5/2018",
    "text": "Food is great but didn't get 5 stars because every time I order from there they never have fresh rolls. Plus their open times vary.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "69EzfcHKX9AYyF2I8aQHuw"
  },
  "QQeQj81EjKWSW1sNN5Q8Zg": {
    "date": "11/10/2018",
    "text": "The food is amazing! Love that they have a full bar and tv for football games. The staff is friendly as well  Perfect place -",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GmsEwlGU5UeM3wlsiYXAHg"
  },
  "aIeQXBetdaYfIva39BdWjg": {
    "date": "4/26/2018",
    "text": "Went out for lunch today with my friends, two of us had never been there before. We were seated fast and the waitress didn't take long to come and get our orders. The food came out fast. The only thing that kind of bugged me is that the waitress didn't leave us a pitcher or water nor did she refill our drinks. Other than that food was good and service was fast. :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NR7Lh7WrMBhkz8rI9mqpAg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NR7Lh7WrMBhkz8rI9mqpAg/o.jpg"
      },
      {
        "img_id": "n2N8eXSfrUxMkBqqtg30CQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n2N8eXSfrUxMkBqqtg30CQ/o.jpg"
      }
    ],
    "user_id": "ibubweIqVafHhOWOklGbLg"
  },
  "zmIy4EK81jpAEqQ2nczilA": {
    "date": "6/30/2017",
    "text": "This place is overall really good and quality thai food, but not outstanding. It's a great price, house wine is $5 and we always get a portion big enough to take home. good enough to continue to come back.  The pad see ew and drunken noodles were flavorful but could have some more veggies and meat. The basil fried rice was really tasty (medium spicy is perfect if you like a little spice) but i thought the rice was a little hard for my preference.  The atmosphere is good, there's two tvs with your basic sports game on and a bar with 7 bar stools. it's never too crowded when we're here. Not that fancy, similar to your average thai place.  The ONE weird thing: the music choice is all slow emotional throwbacks from the 90's. Journey, Edwin McCain, nickelback, celine dion, goo goo dolls, etc. Don't get me wrong, i knew every song but just not an upbeat sound track and nothing from this century.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kcIxMNGyqC4INGaNgTbFWw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Basil fried rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kcIxMNGyqC4INGaNgTbFWw/o.jpg"
      },
      {
        "img_id": "jATpvKHrjPEgWyuT-Z4pQA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Pad see ew, with medium spicy. pretty good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jATpvKHrjPEgWyuT-Z4pQA/o.jpg"
      }
    ],
    "user_id": "6EsJMCNi_9OKVFvTwn7C0g"
  },
  "nYhOBnrUP4LmC0AZgdXUXQ": {
    "date": "4/10/2014",
    "text": "This place is so delicious!  I'm a picky Thai foodie and absolutely love it!  Best I've found in az besides malee's. Just wish it wasn't so close to my house. Dangerously good!!  My favs are chic panang and pineapple fried rice.  It's a tad on the pricey side but worth it for good Thai.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rkvAzK6UU46MRhhvfvuZwA"
  },
  "CjktNOHD7B1IomnP4VsPRQ": {
    "date": "3/6/2014",
    "text": "OMG! The best Thai food ever. I've order from this place through grubhub multiple times. The Thai rice is always good, the blanket shrimp is awesome, the shrimp cakes are awesome. GREAT GREAT GREAT Food. Awesome delivery time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "jEjMfYBBFnhcuT1WU4Y-2A"
  },
  "VTR_7mR1aM-aQGPHiDLaHQ": {
    "date": "2/8/2014",
    "text": "I stopped in a week before on my lunch break and ordered the Pad Thai. The peanut sauce was amazing and I was hooked.  My husband and I decided to dine-in this time and get a feel for the overall experience of the restaurant. The decor was modern and trendy it felt very upscale. The music was at the perfect volume to add ambiance without drowning out the voice of the person across from you. I ordered Pad Woon Sen, the presentation was beautiful and the meal was delicious. My husband ordered the Pad Thai and loved it. The staff was welcoming and attentive and  the service was excellent. It's my new favorite Thai restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "VHaShotTDQa0GVVavGelrQ"
  },
  "iBzw_i_68wAAE_Km20s4pw": {
    "date": "5/3/2014",
    "text": "<a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>!   We usually get our Thai food from Thai basil, but had heard good things and read the reviews on thailicious so we figured it was time to try it out. We ordered the tom kha soup, drunken noodles, basil fried rice, and spice of life. All of them were great and def must tries!  I've been eating Thai food and trying different restaurants since I was a kid. My parents were always looking for new places to try. They had tried thailicious a while back and said it was good but a little too greasy for them. I've got to disagree, it wasn't greasy at all, and the flavors exceeded our expectations. Now we like Thai basil, but I think we're going to make thailicious our new Thai food place from now on. Can't wait to try more items!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Qbs3PzDI-ZTeDQQw9xJ5NQ"
  },
  "x_IvGvD6bVmwqGHPCnFI3w": {
    "date": "8/30/2014",
    "text": "Oh the Flavors!!! I am absolutely in love with this place from just one visit.  How my boyfriend didn't enjoy his pad thai is beyond me.  I loved my sisters tofu pad thai i felt like it had so much more of like a sauce on it compared to most placed being all dry and gross.  Not this place unless the chicken is that much different.  I cannot wait to go back and get more of their pad thai.  From the looks of the pictures the panang is pretty soupy looking. So that i am definitely steering clear of because according to my best friend we like when it is cooked incorrectly like at thai ramas where its more of a thick curry that coats your rice rather than drowns it if that makes any sense.  My mom had ordered a seafood curry dish of some sort that tasted amazing as well. So this is definitely the best thai food spot for pad thai and certain dishes cant wait to try more off the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bxBR0vakC_OAU-5rCYCDsw"
  },
  "LZ4pZyVmeoJ7o6STWSLYVA": {
    "date": "9/8/2014",
    "text": "Amazing Thai! They have a salad and soup buffet that comes with the lunch special. The peanut dressing for the salad is really really good. I got the pad sew ew and it's the best I have had in the valley. Fast and friendly service. I just started working in the area and this will be my go to for Thai at least once a week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "l08HgKiLC7j7aFtiL6GPeQ"
  },
  "3GGmxnaEaAihTfAeeIktYQ": {
    "date": "10/24/2014",
    "text": "Just delicious Thai food.  They turned me into a Thai food addict.  The only problem I have with this place is their hours, why can't they be open 24/7?!  I always have order take out so I cannot speak for their eat in service but delivery and take out are GREAT and their food is just PERFECTLY DELICIOUS!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8d8EPlbAPDTLZZyweMXbHw"
  },
  "8eUvArjc5h7YzfxGDA50Hw": {
    "date": "6/8/2015",
    "text": "Awesome place. Great layout and super food. Every dish we had was great! This place is going into the lunch rotation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hADUTSKTOABdGv8dK7JBFg"
  },
  "-x_7FcgUz4TT4Jz8NJ3kww": {
    "date": "2/4/2014",
    "text": "Loved this place!  Food presentation rivals any 5-star restaurant. Service was great and friendly.  Food was fresh and flavorful. Decor was hip and modern. Definitely worth a repeat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vTvHXUbRwE8c_5I4tEuZGA"
  },
  "G3MdLIO7JRMeL30iZV_-lw": {
    "date": "3/31/2014",
    "text": "Saw yelp reviews and went to give it a try since it's so closed to my house. Meh... everything tasted so sweet. Meats (two entries - one with chicken one with beef) are smelly and ain't fresh. Small portion of food which it's kinda expensive. Salad and soup were not Thai at all. Will not coming back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AGbmnf2LWJbkU3_cgm2wIQ"
  },
  "vf5_kPjk4KVuGFElpZhdWw": {
    "date": "3/30/2014",
    "text": "Love this place, so glad to have a Thai place so close and so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5QRKOTb3naNJUxA-Pw_DlQ"
  },
  "yDjPi5GhqIlEPUnQEQwQQg": {
    "date": "1/21/2014",
    "text": "Just open today!!! Very nice decoration and right balance of ambience. Definitely!!! Good Thai food. I LOVE their Pad Thai , Green curry, and Crab cream cheese roll. I will be back for sure :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XuE9GTnmZI7eDcqDo8shsw"
  },
  "VfUUV88Yu1ega-RXUFYMCw": {
    "date": "6/8/2014",
    "text": "Seriously good Thai food. Such an unexpected find in Arizona! We had the papaya salad and fried chicken for appetizers that were amazing. I had a Quit Thai'n around bourbon cocktail that was really nice, not too strong and not too sweet. Love the bar there. For dinner we shared the duck curry and a grilled pork dish. The servers were friendly. Food came out promptly. Really cute date place. Would definitely be back except we were just visiting from Cali.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "etb_IkLo9zaLCbRN8etBUg"
  },
  "_IgaXtif5Dr2hv4Nt7lDXQ": {
    "date": "5/29/2014",
    "text": "All the menu items are delicious. The service is excellent and ambience is relaxing. I would recommend to come in a group or come alone and sit at the bar with red wine. Try different dishes and find your favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AuTKY-YpXxzexV6KMZI6rg"
  },
  "t16n1KgYaoI6JOFf4c8loA": {
    "date": "3/1/2014",
    "text": "Another great Thai food option in the valley! Drunken noodles were great and the Old Fashioned was well made!  Happy to have this gem so close to home!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9MHnj_Ay4H6rmIXfP_xn1w"
  },
  "tac1E3gn2N-3-zioljRfzQ": {
    "date": "1/8/2015",
    "text": "good food and good ambiance but their food, especially their drunken noodles are too oily. I even told their owner/chef but she kinda brushed my feedback aside. I like their food but won't go there too often because the food it too greasy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qh0Y0hrCRXxa0VVeiblV1A"
  },
  "dxOCT9JMj-5kGe96SUmgyA": {
    "date": "5/21/2014",
    "text": "Very nice, clean neighborhood restaurant. Food was wonderful!  Came to us hot and the spice was perfect to our order. I will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O9Yvph8XVPXJtx2R1TUqkQ"
  },
  "xabxhEZj2TFBaHTuvwgJPA": {
    "date": "4/4/2014",
    "text": "My co-workers and I tried lunch here today for the first time, all of us ordering different dishes, and every single one if us thought our meals were delicious!  Food was more than plentiful (soup and salad are included with the meal), service was excellent and super fast!  Very reasonably priced too!  We'll be back often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gOceSY1zRbTzCrSxagPUSQ"
  },
  "0NnqXPZg02OH0kUXvMQfKQ": {
    "date": "3/1/2015",
    "text": "Delicious! Close to home and never tried before because of the strip mall location. Mistake-food was excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c5nf22LIVouemf9vOfWDgg"
  },
  "R9qMqfwZXkT-ilxkC8Yg-w": {
    "date": "8/16/2014",
    "text": "I love Thailicious, especially because they deliver to my house (with a $20 minimum)! As far as delivery thai goes, if you're in the Chandler area, Thailicious is the best. Even if you're venturing in, it's still some really great thai, and everything seems very fresh! I'm a huge fan of their pad thai and their thai tea.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i_KBEh6Jkscgul5NtriuTQ"
  },
  "wKtBTlBOL1v_KeBcWHuk1g": {
    "date": "5/28/2019",
    "text": "Best kept secret for South Tempe/ West Chandler!!  Corner of Kyrene rd & Ray Rd  Oh my word their food just cannot be beat. Every other Thai place we go to gets compared to here and they always lose b/c nothing compares to Thailicious.  Tom Yum soup- Flavor is superb Drunkun Noodle - Perfect!!  Pad Thai- Can't be beat",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-2bQi-K1UK_TIh03k_vENA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Tom Yum Pot",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-2bQi-K1UK_TIh03k_vENA/o.jpg"
      }
    ],
    "user_id": "KcRKqbOjdgjq2UL1nhf9wQ"
  },
  "7PCMqeGMQH3OyM5jqyhuYg": {
    "date": "5/11/2019",
    "text": "Visited Thailicious with my husband and a friend for dinner on a Friday evening. The place wasn't really crowded for a Friday evening and we had some time before our movie to grab some dinner.  The service is relatively slow considering the number of people dining. We ordered Thai iced tea to drink which took a little longer than usual. The server took sometime before they asked us about the order.   The drunken noodle I ordered was specifically with just tofu and peppers. I had asked for Thai hot.   When the noodles were served it wasn't Thai hot, lacked flavor nor were the instructions followed as seen in the pic it came along with eggs! I am a vegetarian so I pointed it out and the servers response to it was unexpectedly rude - she said that vegetarians do eat egg and if you didn't want you should have mentioned.I personally found it odd as I don't think it's True.  They freshly prepared with no eggs but I wasn't too happy with the way they spoke.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "m1a_FbMrp6vu847tkhN6fg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Drunken Noodle with tofu-Thai hot",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/m1a_FbMrp6vu847tkhN6fg/o.jpg"
      },
      {
        "img_id": "rVtsmLZXfsp3i6F5cAIP3g",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Thai Iced Tea",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rVtsmLZXfsp3i6F5cAIP3g/o.jpg"
      }
    ],
    "user_id": "A2UXTirzw8j6ifwZx2klTA"
  },
  "ozstXU9-K7QHZZjebAVK3g": {
    "date": "5/1/2019",
    "text": "Stopped by to try the lunch menu. They have some great offerings for under 10 bucks. The place is pretty dark, especially when walking in from the bright Arizona sun! But it wasn't uncomfortable.   The staff were friendly and helpful. They have a small salad bar that is included with a lunch purchase. It's actually just lettuce and dressing. There's also what I believe to be some Thai form of hot-n-sour soup. It was tasty. On the menu, it says the salad bar is included with your lunch, but is $6.99 without a lunch purchase. It only makes sense to pay 1 or 2 more bucks to get an entree and salad. Paying for just the salad bar is not worth it at all.   The food was very good. The red curry had some great spice to it and was very creamy. The rice was nice and sweet, and it mixed very well with the curry. It was such a good deal for lunch. Great portion, great price. Will come again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OT0VuG0p5l1NplYjao-5hg"
  },
  "HvhnNyzwvTijiDqBeqVK2w": {
    "date": "8/26/2019",
    "text": "Nice quiet sit down restaurant. Duck curry, papaya salad an basil pork all just right!! Satay with peanut sauce and sweet vinegar ace were good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rlEXrRFRi46j2tEuLQu_sA"
  },
  "CAlrhgGoABO-lf8tRhYf_w": {
    "date": "8/30/2019",
    "text": "I always read yelp reviews but never post any, but Thailicious is well worthy of these five stars. I have been coming here for two years now and I have never been disappointed! The service is great and the owner is very nice. Thailicious is by FAR the best Thai food I've ever had. Seriously, if you haven't been to Thailicious you need to try it! My top two thailicious staples are always the yellow curry and the drunken noodle!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zGTbiyohyNwDLPyVB4J9bQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. 5 Piece Crispy Thai Roll (already eaten)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zGTbiyohyNwDLPyVB4J9bQ/o.jpg"
      },
      {
        "img_id": "6jXTP6adrNVA7VfmNW3PZg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Thai Pepper Steak Entree",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6jXTP6adrNVA7VfmNW3PZg/o.jpg"
      },
      {
        "img_id": "DKI0ZHUSVOIIIb__CQGnkQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Thai Fried Rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DKI0ZHUSVOIIIb__CQGnkQ/o.jpg"
      }
    ],
    "user_id": "CwvXfUohwVFv1WAgjFo2Cw"
  },
  "22YDXC2vCRvLRzsoyNat4g": {
    "date": "8/19/2018",
    "text": "Prologue: The weekly review by my fiancee of recommendations for local dining yielded this restaurant. It was very close to home and it had been a little while since we had visited a Thai restaurant so we decided to give it a try on out Saturday evening dinner date.  The Plot: All of the starters on the menu looked very appetizing and we began by sharing two, including the Thailicious Dumplings (which were very similar to Chinese Shumai) and the Fried Calamari with Spicy Mayo Sauce (by now you know I cannot pass up an opportunity to order this starter).  Those were followed by sharing two entrees, including something familiar to all fans of Thai cuisine, which was the Pad See Ew (sauteed wide rice noodles, vegetables, and egg that we ordered with mixed seafood), as well as something new for us, which was the Duck Curry (a crispy whole leg with red curry, vegetables, pineapple, and lychees). Both entrees were ordered mild, which was spicy enough for us.  The meal was concluded by sharing the customary Sticky Rice with Mango (which is also served with custard when mangoes are out of season).  The Scene: The restaurant was very clean, tidy, nicely appointed, and did have cozy feel to it. The music playing was much nicer than elevator music (I think it was Mumford & Sons) and the volume was comfortable (having a decent sound system does make a difference) \"Chinese Food Tour of Yunnan with Mark Wiens\" was on the TV (an appropriate choice in our opinion).  The chef's talent was apparent from the moment the starters arrived at our table as the presentation for all of the dishes was certainly above par among the Thai restaurants we've visited thus far (see Billie Z's photographic evidence below).  The quality of the food was also excellent, beginning with the Thailicious Dumplings. As many fans of Dim Sum will know, this type of dish can vary quite a bit as far as how well it is prepared. In this this case we were impressed with how evenly the filling was cooked all the way through, while being tender on the top with no pink in the middle. The dumplings were also just warm enough, moist but not wet or watery, and the wrappers were also cooked perfectly all the way around.The seasoning and dipping sauce were also very yummy.  The Fried Calamari appetizer was also right on par with the best I've tasted in my extensive experience. The breading was crunchy but not overly fried, the calamari rings were tender and easy to cut with a fork, and the spicy may was the perfect accompaniment.  The Pad See Ew was an excellent example of what we in this country understand to be classic Thai cuisine. The noodles were perfectly cooked, the sweet and spicy flavors were spot on, and there was plenty of fresh tasting mixed seafood.  We were both delighted when the Duck Curry arrived at our table as we discovered that it included not only slices of duck meat but also a whole leg. The skin was crispy and fatty just the way it should be and the meat was flavorful, moist, tender, and not at all chewy. The flavors vegetables and fruit were also well balanced with the red curry and it all tasted very yummy layered over the steamed rice.  The Sticky Rice with Mango was a lovely conclusion to the meal, especially since the chef didn't skimp on the portions of rice and mango so that it was enough for us to share.  The Rest of the Story: The service was prompt, courteous, and our orders arrived in a reasonable amount of time. Upscale Thai food of this quality is usually going to be a little more expensive than the average dinner out and, in this case, it was well worth it.  Epilogue: Everything was very good; there were no weak links to be found anywhere in this meal and we happily award four stars.  Photo Design By: Billie Z.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "P40NfFyF2NbK1TBqWpaCeA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Sticky Rice with Mango",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P40NfFyF2NbK1TBqWpaCeA/o.jpg"
      },
      {
        "img_id": "7TJaUMCEXEaJmyQqXtAmtg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Duck Curry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7TJaUMCEXEaJmyQqXtAmtg/o.jpg"
      },
      {
        "img_id": "fq-oFO1ORDfR_SSxLkegXw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Pad See Ew",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fq-oFO1ORDfR_SSxLkegXw/o.jpg"
      }
    ],
    "user_id": "lNDoRrMrdrK-Gd8Yllgpkg"
  },
  "CgwKzX1uDVYXYaVuUQBvNg": {
    "date": "8/14/2019",
    "text": "This was such a quality surprise! The food was fresh and DELICIOUS! We walked into a dark strip mall door and were so surprised that it was so clean and updated. The international jazz music and full bar were a nice touch! The Massaman curry was the best I've had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9iUm61w9zDoKOvY7MUpAkw"
  },
  "RhCeJID1NCxk1W1SVE57Gg": {
    "date": "2/16/2019",
    "text": "I used to be a regular here but moved to a different part of town and haven't been back in awhile. Unfortunately I see things have changed which explains the newer lower ratings. New management or ownership perhaps?   I placed my to go order through GrubHub and it was ready when I went to pick it up and the order was accurate. They did not however include any napkins or utensils.   The food was disappointing especially since I used to love it. The crispy Thai roll wasn't cooked so I had to cook it in the oven when I got home. Still didn't like it and the sauce was watery and salty.   The Drunken Noodle was ordered medium spice but they made it very hot. I like spicy but too much spice ruins the meal. It was made with Napa cabbage, barely a hint of a tomato, very few thin slices of bell pepper, one green bean and no basil leaves which is an essential ingredient for this dish. Guess they decided to skimp.   The bean thread soup came with overcooked, inedible dry chicken, bean thread noodles that were in a clump, scallions and tofu in a clear broth that was loaded with salt-- so much so that I woke up with my entire face (including under my eyes where I normally have hallows) swollen and puffy. That's when you know the cook used a bottle of salt. Horrible.   It saddens me that the restaurant has changed and has gone downhill. They used to make fresh squeezed lemonade but now they serve disgusting fountain lemonade. Disappointing experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ph95MI1UlROhkMZ5XJUC3A",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Gross Fountain lemonade",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ph95MI1UlROhkMZ5XJUC3A/o.jpg"
      },
      {
        "img_id": "IE_gRPi6m215waiEEDn4vg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Spring roll. Was undercooked and flavorless",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IE_gRPi6m215waiEEDn4vg/o.jpg"
      },
      {
        "img_id": "9eYEU1YTCAbDA2lj_DT9Og",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9eYEU1YTCAbDA2lj_DT9Og/o.jpg"
      }
    ],
    "user_id": "ohAOR3uiHO2-3TcPrOLEVw"
  },
  "T0EHVMbfN8kyOxS59dX5Hg": {
    "date": "5/5/2019",
    "text": "I haven't had Thai food in a long time well since I moved out here from LA. And from my parents house lol my parents always cooked Thai food because that's what we eat what we know and who we are. I use to get tired of it though but anyways since moving out here I really been wanting to try Thai food because now I miss that home cooked Thai food. I was out in the area and this place came up, I'm glad i came it was beautiful and the waitress are so nice. Had conversation with them. Food was so good because I cleaned out my plate . Definitely a place to come back too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x0Giijm0AtoWWu_GYmTZnQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Sticky Rice with Mango",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x0Giijm0AtoWWu_GYmTZnQ/o.jpg"
      },
      {
        "img_id": "9kmFwxkkxr9Zbya9RMiyiQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Drunken Noodle",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9kmFwxkkxr9Zbya9RMiyiQ/o.jpg"
      },
      {
        "img_id": "O7q5GUjLMYz3NRgyHhRnEw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. 4 Piece Chicken Satay, Crispy rolls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O7q5GUjLMYz3NRgyHhRnEw/o.jpg"
      }
    ],
    "user_id": "NP00lrtdp4svelYmUTf5Aw"
  },
  "LeFjGuD56L6LbdhwAauF3A": {
    "date": "3/29/2019",
    "text": "This is my go to place for great and delicious Thai food! The service is great as well! I always get their Thai fried rice and their panang curry with tofu. And it's sooo good!! My bf gets their pas Thai and it's really delicious. The only thing is the smell inside the restaurant. It doesn't smell that great, but you get used to it when you're in there haha! They also close at 3pm after lunch and then open again at 5pm for dinner time. But I definitely recommend coming to this Thai restaurant!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "4aSXYeWxDR_yvrE8EYdoXQ"
  },
  "tS911ZxDr9RM48nb5TUojQ": {
    "date": "9/5/2018",
    "text": "I love Thai food specially when it is done right. I have been to this place many times to give this restaurant a four star rating.   Generally the lunch times are pretty busy be it a weekday or a friday. We were seated immediately though. The salad and soup bar is good. The peanut dressing they serve with the salad is really nice and I am not much of a taker of that soup.   Their specials masamann curry and panaag curry are too good. I have had multiple times and the taste hasn't changed. I have always ordered a level 4 of spice and it has been perfect for me. The pad thai is good too but I prefer the curry better. For the dessert coconut icecream is too good, its not overpoweringly sweet but is light and tasty.   The price you would look at is around $10-15 for one if u just stick to the main course. Try this place and you wont be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "McLm1kVpQUcSKzxJt8Vqhg"
  },
  "ZyCjhcimMHepGa2qVzzZ7Q": {
    "date": "11/2/2018",
    "text": "This is our quick go to thai place from work. Food quality has been consistent over the years. Salad and soup counters are available over lunch. This place also has punch cards, you eat here 10 times and get your 11th meal free!. I love the thai basil fried rice and drunken noodles here. Must try",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZGKQ2zthJZx_hKRzH3Utug",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Drunken noodles with fried tofu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZGKQ2zthJZx_hKRzH3Utug/o.jpg"
      }
    ],
    "user_id": "C3MWPHeOZC_3VTlgaTH6jQ"
  },
  "xMdTMWwJNZpOU3PLtsJbMw": {
    "date": "2/20/2019",
    "text": "Love the Pad Thai here and the Thai iced tea. I love the atmosphere (calm, quiet, relaxing). Beautiful place for a date.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ZXEdG4BONeARsByxxGOdJA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZXEdG4BONeARsByxxGOdJA/o.jpg"
      },
      {
        "img_id": "iakcv7QvarhevhIMX3IY7g",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iakcv7QvarhevhIMX3IY7g/o.jpg"
      },
      {
        "img_id": "ZPuUFuS-080LhO-HsyXeBQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZPuUFuS-080LhO-HsyXeBQ/o.jpg"
      }
    ],
    "user_id": "f-Q9fV5xVu9v3jo4Z4dB7A"
  },
  "_yRs_1t08Porv1_INKcP8Q": {
    "date": "1/15/2019",
    "text": "Omg  ..ordered the medium spice beef noodle soup on a cold rainy night... and it was AMAZING!!!  Thos is enough for 3 servings for me, so a healthy portion of left overs too!!  The chicken wontons were equally good!! So happy we stopped in tonight!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "izVTBQfKSVn0ZCwqpu8K8w"
  },
  "jvZs9acfzv_RbIjcn8wUhA": {
    "date": "6/26/2019",
    "text": "This is some of the best Thai food around! I can never figure out why it's not busier but I'm guessing they do a lot of take out. It's nice and dimly lit and very calm inside. I love eating there but also enjoy doing take out. They have great lunch specials but I can't get there for lunch very often. I'm more familiar with their dinner menu. My son could live off their Chicken Satay lol. My favorite comfort food is the soup, their Tom Kha is great. So is the Larb Gai salad. Entree wise, I love the curries, especially the green. Eggplant Lover, Heaven Ginger and Garlic Lover are also good - bonus points for using good quality chicken. I need to try the duck!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Npwg7DnciMLlwcY63c3m4Q"
  },
  "JZyBJofuGwkk6KXVI1527w": {
    "date": "9/22/2018",
    "text": "While the food was fast and fresh, it was also over cooked and under seasoned. Thai spice level three should be tasted. I probably would not have noticed as much if I had been enjoying the experience more. The service was just bad. The four girls working the room (of which only my husband and I were patrons) were loudly yelling across the room and goofing off to the point where we felt uncomfortable and considered leaving. We were too distracted to even converse with each other because we would get startled by the erupting laughter of the servers. They couldn't seem to figure out who was supposed to take our order or that we were even there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "7kMfuFh7h8PYbcHrqSyqZg"
  },
  "mLz25LdY4fh40xOFU-Mk4A": {
    "date": "7/27/2019",
    "text": "Great experience as usual. We always come all the way from QC for this place. The quality of the food is great and the price is reflective of that. Their shrimp fried rice is amazing!!! We'll continue coming here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ii4Sa5tSePgIrwjRjTcamA"
  },
  "UyO8I45r6LFB-FOG4eKwAw": {
    "date": "5/2/2018",
    "text": "So glad I stopped by and gave this place a shot. They had some really tasty crispy spring rolls and a delicious fresh tasting Panang curry. I love when you can taste the coconut milk coming through. Also the chicken was done right not dried out at all and the vegetables in the Panang were fresh and crunchy. Perfect meal tonight!! Will come back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9LC42MCXGodH4SyeMAO1lA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9LC42MCXGodH4SyeMAO1lA/o.jpg"
      },
      {
        "img_id": "j16HfZ43w7yCP96jUT6GsQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j16HfZ43w7yCP96jUT6GsQ/o.jpg"
      }
    ],
    "user_id": "xmeezNsGT1RnjwdxCwaB0w"
  },
  "DKhaCaNvRf1mm5Ud0cSW0g": {
    "date": "5/15/2019",
    "text": "We visited this place after our trip to Thailand two years ago and we have become regular customers. The food is authentic . Also, it does not take a long time to wait for your food. The staff is friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T5rGCf1ur5ej0zjVjAeQMw"
  },
  "9d-siIJHdNh2oyVv1j42Zw": {
    "date": "5/3/2019",
    "text": "Cute place! Host was nice, crab wonton rolls were bad, the Spice of Life dish was delicious, my wife said the Shrimp Pad Thai was really good, the server was adequate but nothing more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xtDBy23IJg9FdqtWX-d6Q"
  },
  "AcIce9-DJep_lwJ-303pbw": {
    "date": "8/2/2015",
    "text": "I didn't know a dish of chicken, shrimp, spinach, broccoli, and peanut sauce could double as a dessert.  If there was any spice at all in my level 3 order, it would have been overpowered by the half-cup of sugar. Even after letting the sauce drip off each bite, my throat was hurting from the sweetness. For the first time in my life, I considered sending a dish back - and maybe I would have, if the waitress had ever returned to our table. (Clever evasion, waitress!) My husband's dish, while slightly less sickeningly sweet than mine, was just so-so, and both were among the pricier specialty items on the menu. I'm unsure why this place has such good reviews. Either the average person has guzzled so many gallons of high-fructose corn syrup that they can no longer taste sugar, or Thailicious is getting a lot of bonus stars for the cute decor.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "agjcq5T1Y_gL3B1ezUG7dQ"
  },
  "gy7UejToKucewwpvYeNt6w": {
    "date": "6/2/2015",
    "text": "Omg, amazing Thai food!  5 stars: Thai fried rice, red curry, and drunken noodles.  Actually, the fried rice earns 6 stars in my book.  Just ok (3 stars)- pad thai.  Also epic: thai iced tea, fried bananas, and the sticky rice.  Wow... Definitely one of the best Thai places in Phx.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5jEEo7SoLGMUq1FuRW182A"
  },
  "4XmugcFqczkMfsqOdPcfFA": {
    "date": "12/1/2015",
    "text": "I really like their red curry and their salads are amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BrCqfEj0NxlLT7AFlIYqQg"
  },
  "K_rHKROf42VP-gXf830Cgw": {
    "date": "1/10/2015",
    "text": "Stopped in for lunch and when I saw the smeary, dirty front windows should have aborted.  But my wife and I proceeded in and found a messy salad bar with spilled lettuce, etc. all over the place (floor included)  Then ordered the red curry and went to the salad bar for the included soup and salad.  The salad tongs were laying in the greens (disgusting) and the container for the only dressing available was empty.  So i decided to skip the unsanitary salad and just have soup, but there were neither soup spoons available nor bowls.  The staff whizzed around avoiding eye contact as if to communicate a \"who cares\" attitude.  Then my wife's food came to the table but not mine.  When she had eaten about half of hers, our server came to the table to refill our iced teas, but did not even notice that I had not been served.  When I asked where my food was, she went to the kitchen and returned with a bowl of warm (not hot) curry and said NOTHING as she stuck it in front of me.  I ordered my food Thai hot, and it was barely spicy at all.    IMO his place is a bona fide unsanitary dump.  STAY AWAY, if you know anything at all about Thai food or restaurant sanitation.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MkdwKHEPxVsiaSA8Rm_Kog"
  },
  "hVQc8f0Ehe36Km5l9RAtsw": {
    "date": "5/23/2015",
    "text": "Unassuming little place in a strip mall but the food is amazing. Shared the Crispy Thai Rolls, Colorful Vegetables, and Red Curry. All beat expectations and were wonderful. Definitely would come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DD5Qj1eJ28NPUQgJ12CS4g"
  },
  "VlAeF-tL_IZpt2AbTcjn0Q": {
    "date": "8/15/2015",
    "text": "I've been looking for a Thai place here and I think I've found the one! I tried a few dishes and they were all stellar. The chicken panang, the lamb panang, the pad see ew with shrimp and the Thai fried rice with shrimp were all great! This is definitely my new favorite Thai restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RyoTi4p5nfvWhxGjrWmCkQ"
  },
  "zB33r7S0VF7x9hfFr-YCMQ": {
    "date": "8/15/2015",
    "text": "First time here tonight, but will definitely return.  EVERYTHING was delicious! The service was great, the atmosphere relaxed; and did I mention the food was perfect? A must try for anyone looking for great Thai.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gi13Ed7gTDbkZu7iDpYXXQ"
  },
  "ngvBRVngT35v0eYXgeE3BQ": {
    "date": "1/24/2014",
    "text": "Modern decor,  excellent service, great food. Tom yum soup is perfect. Extensive menu. A neighborhood gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eaPy75swrxIw3FzmnlYceA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Thai tea pudding",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eaPy75swrxIw3FzmnlYceA/o.jpg"
      }
    ],
    "user_id": "L_COoc_kHfk3fIva2mPvvw"
  },
  "NFXErKuJzBH5XImLoGYLhw": {
    "date": "9/11/2016",
    "text": "Friendly greeting, prompt service. Had Penang Curry that was excellent with a creamy coconut milk soup, fresh tender chicken and super crispy veggies that were cooked just enough. Price is very reasonable. This entry compares very favorably to Thai places in my home base of San Francisco and I would say is better than many places in SF.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cONEJtlcfDrkpApwnZ4RXA"
  },
  "F663cUX1MenfU8N6Hv6-gQ": {
    "date": "12/1/2015",
    "text": "Best Thai around!  My family and I go often..love the pad thai, pad see eww, yellow curry and of course the spring rolls! ! The sauce is incredible!  Gotta try them!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vb2CTiiSnpMD3HnsGFf7yA"
  },
  "dRY5bc1WGaHMcHuyAyie8w": {
    "date": "5/5/2015",
    "text": "Was in the area and needed a quick lunch so I decided to go in. Had Pad Thai from the lunch menu which came with soup and salad but I passed on that. The food was just alright. Bit too soupy & not really the spice level I asked for. Came with egg roll which wasn't all that either. Service was just ok. Had much better elsewhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NurPaDwkLVA3qVE71jjXFg"
  },
  "Pl_f_4ncFCP2x728Y1d3xQ": {
    "date": "6/11/2015",
    "text": "The food was delicious and the service was amazing! I'm from CA and came to town for business. I would definitely be a repeat customer if I wasn't five hours away!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "srHHZmJ85p1RFjB4aQmv1Q"
  },
  "TGmIgX7XkrwZ63ORCv5_Xw": {
    "date": "12/16/2014",
    "text": "Thailicious is an impressive place; as soon as you walk in, you are no longer scared of the sketchy strip mall it's located in. It's classy, the staff is extremely friendly, and the food is incredible. I'm a man if simple taste, and the always classic pad Thai has never let me down to date - I will admit I end going to Thailicious at least once a week. Another thing that this establishment excels at is customer service. My order was one time incorrectly made, and not only was the staff apologetic, but they served me a complimentary Thai iced tea while bowing to me. I would hate to see this place go out of business.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "I7fVgiTB2z9Rk6sHsnYrPQ"
  },
  "tUXTUtX72oZJ_-po_dRwGw": {
    "date": "7/24/2015",
    "text": "The food was vey good although, very mild even if you ask for hot. The service is not very good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bIw_o679oYd3-OzPRT-c_w"
  },
  "sGiOdN0zP8cNc-9fD88-wA": {
    "date": "4/12/2015",
    "text": "Tried this place out yesterday and I was pleasantly surprised. We got the drunken noodle Thai hot with chicken and red chicken curry hot. Food was excellent and while it was spicy it still had great flavors. Was not too spicy where all I was tasting was spice and I could enjoy what I was eating. I did not dine in, but when I went to pick up the place looked very nice inside. I will definitely be going back for that drunken noodle and to try more dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AfwU8EhYXJW6H2mMJlxMJQ"
  },
  "4HPv-Hi1AJykWrL7lGYBkg": {
    "date": "6/6/2015",
    "text": "Tried this place for the first time with my mom and girlfriend and it is awesome! Ordered the spring rolls and the dumplings as appetizers and they are great. Then for the entrees we had red curry with beef and the Rama, also great dishes. The presentation of the food was also very well done. Quiet place and the service was good. Definitely a must try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "smHK9qh4tsL7MP25BwzpTA"
  },
  "5wFUT4eEWY8mQOr_J-3kYA": {
    "date": "10/15/2015",
    "text": "We were craving Thai food but didn't feel like driving far so we ended up here. It was delicious! The drunken noodles had a hint of sweetness and the garlic lovers had a great flavor! The atmosphere was very inviting and the service was great. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q104btCEcmiMbwp2MbhM-Q"
  },
  "XtIt9b-ho2MKOeilirlhuw": {
    "date": "10/31/2015",
    "text": "Soooo confused by all the great reviews for this place. The food was meh, at best. My pad thai was so sweet and the noodles were overcooked. My boyfriend said his food was ok, but this place was just odd. The \"ambience\" was so bad it made everything worse. The booth we sat at had this weird denny's diner florescent light right over the table, and they were playing terrible jaz music. Def not going back here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f-XdeHudkVSM6VXYrjQ1Ow"
  },
  "ni6Bfp_tZ0vp8DhafYaZfw": {
    "date": "8/21/2015",
    "text": "Half of these reviews must be fake, call the number they do not deliver! If anybody knows a Thai place in chandler that delivers please give me the info",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bki7kyRDbYX5NRf_sqwMxQ"
  },
  "ZZg1GP1b6MbmXRmA-KBTcA": {
    "date": "1/21/2014",
    "text": "While going to the dry cleaners in the plaza I noticed this place was now open. When I first walked in, I was surprised how modern and really trendy this place is. Honestly, it's the most upscale and hip feeling Thai restaurant I have been to Phoenix. Service was great, as we were one of very few people since it had just opened a few hours earlier. The waitress was really sweet, knowledgeable, and helpful. My soup was phenomenal and the yellow curry was good. I hope this restaurant draws big crowds. I would love to have another mom and pop restaurant succeed. And it would be cool to have a popular hangout right next door to my house. There's a bar in the back that seems to be coming soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "wIF0IjYjLIAnSf0PrOWtrg"
  },
  "_SQ0in-LMTIPIyxqSbU_zg": {
    "date": "10/6/2016",
    "text": "I've had Pad Thai, Massaman curry and many a drunken noodle here. All of them are excellent. Thailicious always seems to get the spice 'just right' (medium). The only two items I felt could've used some improvement were the Thai tea and the deep-fried rolls. The filler on the rolls was kind of mushy rather then that distinct texture the  silver noodles should be. Nonetheless better than a lot of places in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "udRT2F8zX0tkh7-S4nVkig"
  },
  "Rq5HBiAFuKk-q8Sf2xQ_fg": {
    "date": "6/1/2015",
    "text": "A little late post...my friend and I were looking for a good Thai place and ended up here! We said why not let's give it a try! She's a local I was visiting and OMG!! Glad we gave it a try!! We had papaya salad, Tom khai gai soup, chicken pad see ew, chicken pad Thai, some delicious Thai tea and to finish a delicious dinner we had the fry banana with coconut ice cream and you must HAVE THE STICKY RICE WITH MANGO!!! yumm!! definitely on my next visit we will be going back here!! Great service very friendly always checking if you are good!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p5-8tK7SHW8jF9AkHUdZYw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Papaya salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p5-8tK7SHW8jF9AkHUdZYw/o.jpg"
      },
      {
        "img_id": "-pHsoamBA6cP6Cm6Lmbuig",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Dessert",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-pHsoamBA6cP6Cm6Lmbuig/o.jpg"
      },
      {
        "img_id": "qkINmM_C39ZQhJr0qDew_w",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Thai tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qkINmM_C39ZQhJr0qDew_w/o.jpg"
      }
    ],
    "user_id": "Qai6xRbGB2yAf-Ww-Cjlvw"
  },
  "w23lLJPJvgIb2BGIjnxvJQ": {
    "date": "10/12/2017",
    "text": "Chose this restaurant because I was in the mood for Thai & it's on my way home from work.  I'd really hoped it would live up to the reviews I read here.  I ordered the yellow curry with chicken, fried rice, and the crab rolls.  Crab rolls came with a mayo sauce, which was unusual but kinda tasty.  The potatoes in the curry were underdone, so I picked them out.  The curry itself was pretty good, but thin, sparse on carrots, chicken average.  I will give this place another try, but only one more.  I was also disappointed to see the 10% off coupon for first orders on my mobile app (where I'm writing from), but I was not given the offer on my desktop (where I ordered from) and - although they clearly knew it was a Yelp-driven order, I was not given the offer when I checked out.  Again, forgiven - will give it another try one day.  My initial review - average, but paid the price of something superior.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A7dUbcKZ6izfDOlJ6xa-Zw"
  },
  "kNC6iCjXGdluaCUzLtb8HA": {
    "date": "8/25/2015",
    "text": "I finally gave this place a try and I absolutely love everything that I ordered.  The Druken noodles is delicious! I've ordered it at yuphas, Thai basil, and Swadee Thai and this place by far is the best.  I also ordered the colorful vegetables with shrimp- Thai hot which was tasty but I wish it was spicier. Their cream cheese crab was good as well.  I will definitely be coming back to try the other dishes!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3vWOfqUa08TX9H4YfeNZqg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Beef Salad...soo yummy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3vWOfqUa08TX9H4YfeNZqg/o.jpg"
      }
    ],
    "user_id": "AoeHWcrAHJlZm6xz5oWw6g"
  },
  "Y9fMtagUvyOIYsVF9a1S0A": {
    "date": "2/14/2015",
    "text": "I got beef salad. Drunken noodle. Basil chicken fried rice. Tom yum shrimp. All are delicious. Great portion. Highly recommended. I've been to Yupha Thai, Rama Thai, Thai basil, and Paradise Thai. This is my favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gkv69QkQaw0XGaLff9dzbg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Beef salad to-go",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gkv69QkQaw0XGaLff9dzbg/o.jpg"
      }
    ],
    "user_id": "ZFJ74aq65K0ReL5zZqzfig"
  },
  "YHRjSrxB33NUlkPPfKbWxg": {
    "date": "4/16/2016",
    "text": "Food was great!  My Pad See Ew was perfect!  The fresh spring rolls and peanut dipping sauce were really good too.  The service was not great.  Not the servers fault....she was the only one, along with a busser.  A different girl brought our drinks and food out but she informed us she was just helping out her friend.  One server for the 9 or so tables that were there is just not enough.  Never got asked if we needed anything else or another drink.  Maybe they were short staffed so I'm not holding it against them.  Cute decor....nice bathrooms.  Will definitely go back and give it another try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "l5x4wzz9VOcQ22XMthU6uw"
  },
  "rHsWI0Xug29eIL4mIl1GMw": {
    "date": "7/1/2016",
    "text": "So it's a lot of food. The portions were bigger than I was expecting. I had the pad Thai with chicken and shrimp. I'm a little torn because they give you generous amounts of both but the flavor wasn't there. It wasn't bad but wasn't crave worthy. My wife had an order of egg rolls and again, they weren't bad but they weren't anything I would go back for. I think 3.5 stars would be about right for this place. I just didn't see the huge draw.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMeSBbQaP0waX2750AX-8w"
  },
  "SfxQHhlpwKbLVeaBEiQVTQ": {
    "date": "1/19/2015",
    "text": "Delivery  Food was amazing! Chicken satay- light peanut sauce with dips to accompany. Excellent Tom Yum soup - spicy and fresh. Even made it without mushrooms for me. Chicken Pad Thai - best my Giant had ever had.  Still five stars though it arrived late - but so worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tgUvk_rJXFr24q-X7I1U2A"
  },
  "TmeqQJS9mEwDjCnZjxGrUQ": {
    "date": "9/17/2017",
    "text": "This is my favorite Thai restaurant in the valley!  My favorite is the the holy basil with chicken. It is so delicious!  My other favorite is their pumpkin curry!  If you see it on special, get it!  You won't be disappointed!  Their egg rolls are also amazing!  Always crunchy and never soggy!  Try it for lunch when you can also help yourself to their free soup and salad buffet. The peanut dressing for the salad is so good as is their sweet and sour soup!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "baZJYoBxdVqjt9EODBvfPQ"
  },
  "kWm2MUIqpEfB7l6mXA1VEA": {
    "date": "7/18/2014",
    "text": "Good and service is absolutely 5 star worthy!! walked in 20 minutes til closing.....I anticipated cranky workers, I would be (the husband was craving Thai)...  We are greeted by a young smiling hostess, waited on expeditiously but without feeling rushed....we ordered and got super fresh food...from the rolls to shrimp (trust me, shrimp is easy to screw up when rushing to cook it)...panang is crazy good, as is the fried rice.....  We received refills and were asked how the good was...even though we are ten minutes past closing...  Dessert came out fresh....they cared about how we felt the experience was as well add the quality of good they put out...highly recommended...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "TnUySQ5uNLD9MHZiAJMsew"
  },
  "rhM8DXP7uXUZN3hzVyMxDQ": {
    "date": "5/12/2014",
    "text": "I have found my new Thai place. I almost didn't go due to the cheesy name. But as I shouldn't judge a book by its cover, nor should I judge Americanized exotic food vendors by their innovative company names. That's correct, we found it through Yelp and their excellent reviews and I am doing mine to reaffirm this delicious Thai place to stay put. Five stars it definitely is.   I had something called like \"Rama\" Curry (could been called something else, I am going by memory here people) with Chicken and it was out-effin-standing. I gobbled up the whole thing even if I was full way before the last bite was eaten. Coconut milk, with curry with just amount of heat. This has become my new staple when it comes to Thai food. It might not been the best I have had, but in Arizona this will definitely keep my cravings at bay very nicely. I had a taste of the peanutty special dish they have, and it was good.. but not my choice and very peanutty. Almost too peanutty.   Next time I want to try another curry though, even if the want I had was just want I usually crave. Aaaah, these first world problems!!! If you are thinking Thai food tonight, this is the way to go. Its not authentic - its just right.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "7nI_9eRz1YKnaA0AYTLiBw"
  },
  "f_JDLNZKcaJnTWvEpNowkQ": {
    "date": "5/27/2015",
    "text": "Best Thai place EVER! I have been to quite many Thai restaurants but this is by far the BEST! We had the Chicken Pad Thai, the Pad Su we, the Papaya Salad.... For dessert we had the sticky rice with mango... i loved it!!! You must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BIBUr8TZihJYHBDudZ8OVQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Best Thai place EVER! I have been to quite many Thai places but this is by far the BEST! You must try!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BIBUr8TZihJYHBDudZ8OVQ/o.jpg"
      },
      {
        "img_id": "wQ6pFATWznLLOnYphW2XwQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wQ6pFATWznLLOnYphW2XwQ/o.jpg"
      },
      {
        "img_id": "kw4_1i1K95GBGH7w0nCdag",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Best Thai food EVER",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kw4_1i1K95GBGH7w0nCdag/o.jpg"
      }
    ],
    "user_id": "9oD2IczC3QUCMZR6saQSLQ"
  },
  "i5UYhEAXebLD_dtsjRE98Q": {
    "date": "5/31/2016",
    "text": "Checked this place out for lunch. I had the peppered steak and my sis had the padthai. We liked both, though her portion was way bigger than mine, so I'm dropping a star. Otherwise, good spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_94NS7-5mq4luL_6ugCNVA"
  },
  "NIngPFgp4n_Isz9s5AcTmQ": {
    "date": "4/6/2016",
    "text": "I know we ordered our take out a bit late of the evening and was 40 minutes close to closing time so I will have to go back and try it again. My BF ordered Garlic Lover Chicken (medium). It was lacking in flavor - lots of kick to it but it needed more garlic, pepper, salt - very blend. My Chrispy Thai Roll was not cooked properly - it could have been cooked a couple of minutes more. So that was disappointing. The highlight for that night was the Thailicious Dumplings! That was flavored well and it was delightful to have. Next time we go, we'll have to try other things but will definitely be ordering the Dumplings again. The restaurant itself is very quaint. Love how clean and nice the place looked.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JnIhH0aEgMB0cZNLV9ya8g"
  },
  "UG49WH7k9IomopExbd5egg": {
    "date": "8/25/2016",
    "text": "Great food! This was definitely a good choice for lunch. The food had so much flavor and the space was just tight. This is totally worth your money. I will definitely be back when I'm in town visiting my family!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wavN3_s9grNIapGOKGsLPA"
  },
  "RJRz7XG65_WIuOpfyNZadg": {
    "date": "8/20/2016",
    "text": "Place was really empty when I arrived at around 5:30PM. This place had pretty good reviews from yelp so I decided to try it out. I was surprised how empty it was but then I experienced how slow the service was with only two other people, I couldn't image a full restaurant, we almost walked out. Food wasn't bad but wasn't great. I might have tried the place again if I hadn't find a \"PUB\" in my food (trust me it was definitely not hair).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q_LOpoitidqmxHBJdExkAw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q_LOpoitidqmxHBJdExkAw/o.jpg"
      }
    ],
    "user_id": "gRE9TJieahdwRuCyKwBuqw"
  },
  "qRO2yKs8fkXHTZtX12TrXg": {
    "date": "8/28/2014",
    "text": "This was my first Thai food experience, I am glad I selected to eat from here. I called in my order promptly at the start of business hours, and my call was answered quickly. I ordered the yellow curry with chicken and medium spice level. I was a little disheartened to learn that I would not get the soup and salad lunch special, since it was to go. But, I quickly cheered up on my first spoonful once I got back home. It was an amazing cream like texture, and very flavorful. It was a perfect balance of spice with a hint of sweetness from the coconut milk. I am excited to try the other curry flavors and other dishes. I will be going back with my husband to dine in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4viaBcZt6GcQoeMoWnCzsQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Yellow curry with chicken and medium spice level.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4viaBcZt6GcQoeMoWnCzsQ/o.jpg"
      }
    ],
    "user_id": "7nSC54N298DFiLiHn6JT-Q"
  },
  "vUisWFs8IsbT8NNZveZrRg": {
    "date": "4/25/2014",
    "text": "After a disappointing experience at Yupha's a few weeks ago, I had to go back to the drawing board and find a new place to satisfy my not-creepy-at-all Thai cravings.  Heh heh heh.  What?  Now my requirements weren't strict, it just needed to be within a reasonable distance from work, have delicious looking non-professional pictures of food, some unique sounding specialties, AND kickass dessert.  Thailicious - you are the answer to my prayers.  And though the food quality and taste hovered around \"good not great\" territory, I almost want to give you 4 stars just for not sucking as much as Yupha's.  1. The thai iced tea is excellent here and the chicken satay was near perfect - so far off to a GREAT start.  2. Lunch special was pretty good - I had the Thai pepper steak and the sauce made me think that's what I should place as my drink order next time! Drunken noodle is also recommended even though there's no alcohol in it, so maybe they just mean that it's drunk in FLAVOR.  3. I wanted one of their specialties, so at the suggestion of the server I went with the Sleeping Beauty.  Here is a description: Sauteed shrimps with bean thread noodle, ginger and celery in homemade sauce, served in clay pot.  Unfortunately it's one of those things that sounds really good on paper but just fails to impress in its actual execution.  Unlike the ladies at the Salem Witch Trial - I heard they were really hot (BA-ZING!).  Anyway, in lieu of that, I tried to mainly focus on positives and not get hung up over minor details like lack of flavor and all that junk.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "iKvTAuDinBZM0Nioi_zA3Q"
  },
  "3ozKoQSmSxiEcJsRhqUD2Q": {
    "date": "5/2/2014",
    "text": "After a long day of driving (5 hours to be exact)  this was the cherry to my sundae.  Great food. Great service. Great everything.  We will definitely be back for more",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "S8Es1vou2hn6xk9QvtHYXQ"
  },
  "JH7cpS9xybAWlczxjfUxiw": {
    "date": "5/4/2014",
    "text": "Surpisingly good, I don't expect much from asian restaurants in AZ as they don't compare to the asian food in CA. I have experienced disappointment repeatedly in AZ to the point of apathy, but was pleasantly surprised when I came across this restaurant. A pearl in the small sea of mediocre asian restaurants in AZ.    Notable dishes we ordered were the shrimp cakes as appetizers, pad thai and pineapple fried rice for entrees, and sticky rice with mango for dessert. Dessert was delicious! Of all the sticky rice w/ mangos I have had this beats the rest, the only disappointment was the portion size, a little overpriced. Those are the must try dishes! I definitely will stop by again even if its a bit far for me, so worth it when you are craving good Thai food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "BCTZaCW9fspmFmgZ0tcL1w"
  },
  "5qe--srqWSVjXDOSp9gwBw": {
    "date": "6/16/2014",
    "text": "Tried this place today. It was a great experieced. The good was masterfully done - delicous seafood yellow curry.   The place is really inviting and clean. The service was fast and courteous. I will definitely comeback for more.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AE1hCnjaWAgRQwKzHNaPYw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Seafood yellow curry. Simply Delicious.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AE1hCnjaWAgRQwKzHNaPYw/o.jpg"
      }
    ],
    "user_id": "3H5089yb695fkZGZaGMatA"
  },
  "jXeJGLqiNwYjdoc_hW1fxg": {
    "date": "6/28/2014",
    "text": "The ambiance and music were fabulous - sexy vibe! The food was worthy however, just a click below Yupha's Thai Kitchen. I would come back and also recommend this restaurant. The service was good, and the faculty was clean. I would recommend though that they put some seasoning on the table or offer it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kA-sAqCRb5t9HR4qnat1zQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. The seating area.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kA-sAqCRb5t9HR4qnat1zQ/o.jpg"
      },
      {
        "img_id": "FXfDO67xpeeODJk25RRtSA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Restaurant front.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FXfDO67xpeeODJk25RRtSA/o.jpg"
      }
    ],
    "user_id": "V7B4KTBitlBs9YH_B00-9Q"
  },
  "LPwRPi81KbxWn96PgkOIsA": {
    "date": "12/26/2015",
    "text": "Have been wanting to write a review of this place for quite some time now. I have been here multiple times for lunch and today we decided to try it for dinner as well. During lunch hours, they have a salad and soup bar as well. I don't really care for their soup but the peanut sauce with salad is delicious. Food here never disappoints. Portions are always generous and service has improved a lot. Have tried their drunken noodles , pad prik khing and Masaman curry with tofu. Food is on the spicier side so order a mild and ask for the spice rack to adjust spice level accordingly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zfu1LUnThKKSoMKzo_tY-A",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Pad Prik King",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Zfu1LUnThKKSoMKzo_tY-A/o.jpg"
      },
      {
        "img_id": "YfxR2VvIqrMSj7MwDLyZMg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Drunken noodles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YfxR2VvIqrMSj7MwDLyZMg/o.jpg"
      },
      {
        "img_id": "ZH0TIh_55dFyDBdEQL-11Q",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Tom yum soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZH0TIh_55dFyDBdEQL-11Q/o.jpg"
      }
    ],
    "user_id": "twJgDw32m8K3obIRePrkmA"
  },
  "a--j-ahNiF-gkWhVTr-uTQ": {
    "date": "3/11/2016",
    "text": "This place is amazing. It's unique and full of flavor and spice. There are not too many restaurants that offer such a unique flavor but this is one of them. I know I am embarrassed to say that I only order spice levels 1 and 2. Those are still packed with powerful punches. The spices levels are 1 to 5. 5 being the really spicy. Rama, Tom Yum Fried Rice and Green Curry are amazing! The dumpling appetizers is also fantasic. Just go :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MPxPR1HPrL5b325rhvAcPA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. This is the Tom Yum Fried Rice with shrimp and calamari.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MPxPR1HPrL5b325rhvAcPA/o.jpg"
      },
      {
        "img_id": "5q8fyK-iMdOQcWIZaQwuLw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. This is the Rama with peanut sauce, chicken and broccoli. Wow..",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5q8fyK-iMdOQcWIZaQwuLw/o.jpg"
      },
      {
        "img_id": "MsjpDdNvtlkAQFLKBjoDGg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. This the dumpling appetizer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MsjpDdNvtlkAQFLKBjoDGg/o.jpg"
      }
    ],
    "user_id": "yQ2tSfi02Wx_2BMKMudElQ"
  },
  "P-JQTNDCk56eMrNdJeEBBA": {
    "date": "4/2/2016",
    "text": "What a great surprise! We'll be returning especially as it's so close...a very short drive. We started & shared the Thailiciousdumplings with the side dipping sauce - excellent. Partner had the Drunken Noodles - loved it. I had the Thai Basil rice with chicken - very good. I had an Asian Sidecar to drunk & my partner had a Lucky Buddha beer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4iGLmf-RR69KhpjIk-EMPw"
  },
  "fxq3B79r9Cn-x0rVodlu0Q": {
    "date": "9/9/2016",
    "text": "Food is very fresh, servers are very nice, and the atmosphere of the restaurant is soothing. My dad and I ordered the Panang Curry and OMG was it good!! The coconut milk-based sauce was rich and flavorful with just the right amount of spice and hint of sweetness. The chicken used in the dish was very fresh, had great texture, and was primarily lean, white meat. The vegetables included in the dish had just the right amount of crispness to it which is a great indicator that the veggies they use are fresh! Overall, I left the restaurant with a satisfied tummy :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "F9EnpbX7KE1gHtOEYx40AA"
  },
  "qMAJ6yiTreXKFk4nIth8iQ": {
    "date": "10/4/2015",
    "text": "We the takeout was very good. I'm hooked on the Thailicious dumplings. We tried out the Spices of life, and the Heaven Ginger w/chicken tonight. Since my mother-in-law was over I ordered both with medium heat, and they were both nicely spiced. Next time I'm ordering something just for me, with the Thai Hot spice, since I love hot and spicy food. Looking forward to our next visit.   I found out the baseball store next door, that hits balls at the wall of the restaurant is closed on Sundays, so that makes it a great time to go. The noise is obnoxious otherwise!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "W0DJOPsSwcAj0uqCJG8iLw"
  },
  "gVxa96DHVNVU4AYljy9QGQ": {
    "date": "9/17/2016",
    "text": "Portions were small, but it was convenient to order via Yelp and they offer discounts...",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wBg8kiWP6ndcWRCfcsVeVw"
  },
  "nc5QL-7_yRsaD1Bte7MYrQ": {
    "date": "2/20/2016",
    "text": "Great food .so yummy .each plate  has a good potion of portion witch you can share easily . Definitely will  recommend it to others .....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u6pgVQR8CHa-CbsGRAO6TA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u6pgVQR8CHa-CbsGRAO6TA/o.jpg"
      }
    ],
    "user_id": "FIaLD9-autofwca9Fq4I_g"
  },
  "Fly4J1qV4dSEQDD4vSWxfA": {
    "date": "2/28/2014",
    "text": "Just hit up Thailicious for some Thai food fix with my wife. I ordered the Red Curry, which was good however the beef they had in it was WAY overcooked (think chewing cardboard). My wife ordered the Pad Thai which while cooked properly, the sauce tasted too much like watered down ketchup.   One thing they did well was the soup, it was actually delicious (I had two servings). I also finished up my meal with a Thai Iced Tea which was not the traditional type (they had whipped cream and a cherry). While it was sweet (VERY SWEET), for $2.99 I felt kind of ripped off with the amount of tea I actually got.  Will have to continue my search for a Thai fix elsewhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7x9sZ0aXkI6zU1yy6NuEw"
  },
  "w6_xLmfQ87qtPjkLVlbN7Q": {
    "date": "12/20/2017",
    "text": "This is hands down my favorite Thai spot in the metro Phoenix area. They make the best Thai tea and my favorite meal to get is the panang curry with shrimp and I love their fried rice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ocN1aUs5AQUGCzKgnMn0fg"
  },
  "0lU6wDyNmcYkU0T7ZHIQSg": {
    "date": "7/17/2014",
    "text": "The Food I had ordered a pad thai here during lunch time. It came with salad and soup side bar which I did not get to take advantage of since the waitress did not tell me about it. The portion was a pretty good size I would have to say that it seemed a little bit smaller than Thai Basil. Nonetheless, the pad thai tasted delicious.    The Service I went a little after 12pm and it wasn't too busy, but the waitresses were not too responsive or just forgetful. I would try to ask them for straws or water  but it took them forever to get that to us after several reminders. Also, they did not tell us that the soup and salad was actually a sidebar; I figured that out myself as I left the restaurant.  Overall, their service was not great.   The Ambiance The design of the restaurant was really modern like a casual cafe. I thought it was a nice place to hangout with friends, go on a food date, or a family meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8yaMgiowtqlEf4jS7pndeQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Pad Thai Lunch",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8yaMgiowtqlEf4jS7pndeQ/o.jpg"
      }
    ],
    "user_id": "HG1O1ZaLtcGSkH9AI_lqUA"
  },
  "JIknSshMziYbc1QfalGtKg": {
    "date": "1/16/2017",
    "text": "I've been a fan of this restaurant, the food is good. I've been going to this location whenever I get a craving for Red Curry. But I was pretty disappointed tonight. They decreased the size of the Red Curry dish by about half and yet are charging the same price they always have. When I asked the waitress about it she advised that they broke the bowls they used to use and couldn't find them anymore so now they have these ones. Which are square single serving bowls rather than the normal large bowls most restaurants serve dishes in. If you're going to serve half the portion you need to decrease the price. Very disappointed not sure I will go back now when there are other thai restaurants nearby that offer larger portion for the same price.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ckAIqhdcgLLvaX541wzi4w"
  },
  "mVqtpI_qytDM1dZwAFd-bw": {
    "date": "6/12/2015",
    "text": "Great tasting restaurant!!!   We ordered satay chicken, pad Thai, tamarind shrimp, holly basil, and papaya salad ... All dishes are delicious.....  Oh, we also got fried banana  w/ ice cream for dessert!! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rWGXcaZfcAA8FyFF7eHWnA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rWGXcaZfcAA8FyFF7eHWnA/o.jpg"
      },
      {
        "img_id": "SGA5jpBBdCAYM931V_2SSQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SGA5jpBBdCAYM931V_2SSQ/o.jpg"
      },
      {
        "img_id": "RDcW0Fif-rRTiyvCz8f8cA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RDcW0Fif-rRTiyvCz8f8cA/o.jpg"
      }
    ],
    "user_id": "y_Smb1glbxVSpRtkqQYOSA"
  },
  "6xMbpuU0LfCMxX61W1-LkA": {
    "date": "7/13/2015",
    "text": "It's been over a year since my last review and at current count I have eaten here 65 times.  To say I like this place is an understatement. It is by far my favorite place to go to lunch. The staff here is exceptional. In all the times I have come here for lunch I have never once had bad service or bad food. I can't speak for how authentic the food is since I have never been to Thailand. My Thai food experience is limited to restaurants here in the states, but I haven't found any better than here. It has the added bonus of being extremely close to my house and 95% of the time the food is served way faster than you would think possible. If they are super slammed for lunch then it can take a bit of time occasionally, but they have soup and salad while you wait.  I am a huge fan of noodle dishes and they have my favorite Drunken Noodles and Pad See Ew.  TRY: - Drunken Noodles - Pad See Ew - Fried Thai Ice Cream",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "rhE4gLtM0gb3XLwSz6HPCw"
  },
  "2e7vci8QrzobYZla2DAgBQ": {
    "date": "7/26/2015",
    "text": "The staff here was very friendly and sweet. Ambiance is nice and food is great! We tried their Tom Yum vegetable soup, chicken Satay, Thai Iced coffee and yellow curry. Could not try any dessert because we were running late for a movie . I am sure it would have been tasty too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i55P5vrrGhjIHe1ZA_C-Lw"
  },
  "vtg0fULSVqrVbiW5kCQ19w": {
    "date": "2/9/2017",
    "text": "Delicious food and good sized servings, especially the Chicken Pad Thai-no peanuts. I have never dined in but I order a lot of take out from here since I live very close by. The serving to-go is perfect size for my boyfriend and I to share and get full from. It is always ready when they say it will be and the ladies at the cash register are always friendly. I would recommend to try this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2OqtQkq-Qi3epUxuHC424g"
  },
  "GI7CrdlIWqeyBnMgNDdmvg": {
    "date": "6/7/2016",
    "text": "I come to this place at lunch but this one time it was completely horrible and I found a cockroach in my food.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QXW0AnJ7TKiXoEMWHj_UUw",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QXW0AnJ7TKiXoEMWHj_UUw/o.jpg"
      },
      {
        "img_id": "Lg9z8-vxxR1fifKXLxPKhQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Lg9z8-vxxR1fifKXLxPKhQ/o.jpg"
      }
    ],
    "user_id": "vcR_9NCjwrfF8xuZLsK9zA"
  },
  "ahmSqw2QIbqkb8sGrBAFCw": {
    "date": "9/3/2014",
    "text": "We have eaten here twice for lunch. They are real fast in getting the food out for the lunch crowd.We were not in a hurry to get out, but I can see if that is important it can be done. Lunch menu is served with serve your own salad bar (lettuce,tomato, & cucumber and peanut dressing), soup(sometimes changes) and a crispy egg roll. The chicken dishes for lunch are chicken,beef,pork, tofu or vegetable-$7.99,shrimp $9.99. Some examples are Holy Basil,garlic lover, or red curry.(many more to choose from) There are tables and booths.  I believe the owner Tayiga has worked at a few Thai places over the years in the East Valley and now has opened her own place. We enjoyed the food both times,now to try dinner sometime.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GcAYWNJaDWIVrysiLKdQAA",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Thailicious in Chandler",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GcAYWNJaDWIVrysiLKdQAA/o.jpg"
      },
      {
        "img_id": "O-OBpB8hxR-1JxCaFg2pvg",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Chicken Pad Thai",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O-OBpB8hxR-1JxCaFg2pvg/o.jpg"
      }
    ],
    "user_id": "WkEfudljFL9-unjGcsmEtw"
  },
  "PLQIlS-B9MPs95Xy8Zhvuw": {
    "date": "3/17/2015",
    "text": "Definitely \"Thailicious\"!   Food is very good and the owner is very friendly.  Great spot for lunch or dinner.  Try their Pad Thai and the Panang curry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WIY1y7cHj8vOtknkAnm2uQ",
        "caption": "Photo of Thailicious - Chandler, AZ, United States. Pad See Ew is delicious",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WIY1y7cHj8vOtknkAnm2uQ/o.jpg"
      }
    ],
    "user_id": "g9KzKQHuHfUE85nnUPCKfA"
  }
}