{
  "sCimjTGMcm66bWmPERrZGw": {
    "date": "11/13/2013",
    "text": "I was recently in town for business and while there developed a bad cold. Craving the sinus-clearing magic of a good curry I found this restaurant. Upon entering my colleague and I were greeted like we were family. The menu is extensive and extremely reasonably priced. My colleague ordered a noodle bowl (mild) and I ordered the panang curry and asked for it medium spicy. Our server seemed concerned that it might be too spicy for me but I told her I like spicy food. When the food came the portions were huge. I am sure that noodle bowl could easily have fed a family of four! My curry was exquisite. Just the right amount of spice to clear my sinuses but not too much that I couldn't taste the flavors of the dish.  I am so glad that I found this place and suggested (ok, insisted) that we eat there on our last night. If I find myself in Scottsdale again I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4_-JzlxWYUe8eSkjBY9Juw"
  },
  "vRHrpOfAM5xJ8ZLa2QEOAw": {
    "date": "8/8/2015",
    "text": "Excellent. Hands down my favorite Thai place in the Valley. The atmosphere is pleasant and the service is beyond exceptional.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "VGiw9zxKt7yAoqNpCIpXQw"
  },
  "ViT4B0HgQ436-MF1SbSWJw": {
    "date": "3/22/2016",
    "text": "Well this would be a good go to place for something quick and easy for lunch especially when you work around the Via De Linda area.  The price is decent for lunch when you can get Curry or Pad Thai around $8 when getting either chicken, beef, or veggies but a little more for seafood and all.  I usually get either yellow or green curry as it has good flavor and medium spice is good but I feel they are lacking something in their flavor altogether.  Overall, the staff is nice and accommodating and the decor is not bad for being a small Thai restaurant and quick service.  I would recommend for ones who needs something quick for lunch when working around there but going there often, it would be better off to find a place that offers a little better flavor in their food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ssa1mwcA9CQaYDPurkD-Q"
  },
  "k_8XUQcPg4PMMEb5P7jHsA": {
    "date": "10/24/2015",
    "text": "The question of Thai food in America is whether you have been to Lotus of Siam or not. I have and other Thai food has been meh since. Well this is restaurant will be getting my business repeatedly. First clue that this is a great restaurant. They are streaming Mark Weins. Look him up on Youtube and you'll be booking a trip to Asia. I had the boat noodles. This is the first Thai place I have been to that served it and it was awesome. Pretty sure I'll be coming back to my review to add another star after I eat there more often.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i-sG_HZWeSRm3JDNgOB3Kg"
  },
  "ZES2FeoS7RsC9t4YhMzl0g": {
    "date": "4/2/2014",
    "text": "This restaurant truly delivers.  We enjoyed our visit and had a fantastic meal.  My wife and I had a green curry dish and an eggplant based vegetable dish that were very good.  We reccomend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sa4Y8zZ7axj7HzVMU0lGmA"
  },
  "yrJPtBjR8BQaVLivB2O3sQ": {
    "date": "1/6/2016",
    "text": "Came here on a fluke looking for good Thai Food while in Scottsdale for work. Met up with my boss and a coworker who were both Thai lovers. Overall, the food was excellent. Ive had bad Thai and I've had good Thai. This is good thai..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ab9OIrfDpwop1q3OKFhYZA"
  },
  "zGfBnisq2mP5LSGaaUGY7g": {
    "date": "4/22/2016",
    "text": "Best Thai Food in Scottsdale. We had take out from Cha da Thai about a month ago with friends and it was delicious. We have been craving it and decided to dine in tonight for the first time. The food was every bit as good as we remembered. The curry is awesome the flavors are perfect and the heat is on point. The Pad see-ew is so good probably the best I've had in Az. The Miang Kum is a must try so many great tastes in one bite. We also enjoyed the Satay and spring rolls. I wish they had a better beer / wine selection but overall this place is a hit. The staff is very friendly too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZBA4bFrsMGX05qFnx-pMag"
  },
  "mt-QQW_l5uH36TleClurew": {
    "date": "1/17/2016",
    "text": "Unfortunately, over the last year, this place has become very inconsistent. One day, I walk in and get great service and a meal, and the next time I visit, the food is so-so and so is the service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPuywU9mgUcRwf7W-yYz-w"
  },
  "AYLiMqZi4wJA_cFFe5UNxg": {
    "date": "5/11/2015",
    "text": "Picked up some take out tonight- ordered the panang curry with chicken medium spice.  It was very good. Love the flavor and the rice was cooked perfectly. Chicken was tender and veggies fresh.  You can tell it was fresh and not sitting for a long period of time.  I will definitely come back to eat in and try more things!  I'm sorry I've lived in McCormick ranch for 3 years and not tried this place sooner!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "DSDL_v5dvLOIJ-o5sRhz4w"
  },
  "fu9cXgDFWRXvjezuAfpW4A": {
    "date": "8/16/2013",
    "text": "This little gem is definitely the real deal Thai experience.  Flat noodle dishes are a real treat with fresh vegetables.  The lunch combos come in neat bento boxes.  Best fried rice I think ive ever had.  You <a href=\"/redir?url=http%3A%2F%2Fhave.to&s=44a1fc9785f0dc51c13e4db2bdfc4e41ecca8eb20c2b8b77cec2730e5658f0fa\" target=\"_blank\" rel=\"nofollow\">have.to</a> get the pumpkin dessert with sweet sticky rice, an absolute must try.The owners are wonderful and friendly if you ever run into them.  Overall, my favorite thai restaurant...ever.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G64aFXoqppL2lvCAJttYSQ",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Homemade coconut icecream",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G64aFXoqppL2lvCAJttYSQ/o.jpg"
      },
      {
        "img_id": "btGFmo4vZ_pnZH5YFKSvag",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Gotta have sweet rice with pumpkin",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/btGFmo4vZ_pnZH5YFKSvag/o.jpg"
      },
      {
        "img_id": "xl0I1mr61WxyADULqMhMwg",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Flat noodles with pork",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xl0I1mr61WxyADULqMhMwg/o.jpg"
      }
    ],
    "user_id": "llrFg3YBq7mEuBGnGVOGpQ"
  },
  "hkHCqXy1FWSYg2rLEVNujQ": {
    "date": "12/12/2016",
    "text": "Met friends here for a Sunday night Thai date.  What a fabulous surprise!  Our goal has been to try every Thai place in greater Scottsdale and this is one of our favorites so far.  They were extremely accommodating.  Friends had a spicy soup the shared and loved.  Hubby had a huge wonton soup that he was thrilled to have leftovers for lunch the next day.  I had the mushroom Laab Gai--really interesting flavors plus eggplant in garlic sauce that they made non-spicy--just the way I like it.  We are all looking forward to coming back and trying even more new things.  Menu is HUGE!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "or9XXVHTDZ7mZtn4b7vo6A"
  },
  "G6CmdcgkEHQcwdu_LbS3bg": {
    "date": "2/28/2015",
    "text": "Best best best best Thai I've ever had, hands down. To top it off even better service! I could go here everyday and never tired of this amazing food! I would give you even more stars if I could. Only wish you were open on Sunday's, but greatness needs to have a day off too!   I can't get past the drunken noodles but I'm positive anything you order will have you smiling all day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "dMwxsqbKH7oCqIhCYb8EIQ"
  },
  "NSn3CvqP0mbRYZ8jPtluEw": {
    "date": "11/6/2013",
    "text": "Cha Da Thai is our new favorite Thai spot in Scottsdale!  We go at least 1 time per week and the food is always delicious.  We love the spring rolls and fresh roll, the Pad Thai is dynamite, and the curries are out of this world.  We usually order red curry with shrimp and vegetables, but the pumpkin curry is wonderful as is the Panang.  We also love the Pad Pak and several noodle dishes.  One person in our party ordered the spicy fried rice and said it was amazing.  The mango sticky rice and coconut ice cream are amazing as well.  I can't leave out the Thai Iced tea either.   The only reason I didn't give them 5 stars is because the last time the service needed some improvement.  Granted, the gentleman helping us was also ringing out customers and taking care of other tables, but he forgot our soup, our water was empty a lot, the chicken was left out of our Pad Pak and the timing of the dishes was way off.  This was the only time the service was poor and anyone can have an off night.  The food is so good that we are definitely willing to overlook a bad night of service.   The owner is an absolute sweetheart and Cha Da has a delightful family feel.  We are thrilled it is so close to our home and recommend it to everyone!  So far everyone we've sent has been very happy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rz4eo5XIw4LC-m3Xo4jwfw"
  },
  "GDqQ2KLcKid3BXJzhGV71Q": {
    "date": "3/27/2015",
    "text": "Try this place if you like real Thai cuisine.  It is the best I've found in the area.  I'm surprised to read some of the negative reviews here, and wonder what they expect.  This is a small family-run place with consistently great food.  Yes, when they get busy the service can suffer a bit but the food is great.  Excellent quality at great prices, this place is a winner.  I can honestly say that their \"Boat Soup\" choices are better than any Pho I've ever had anywhere, including Vietnam and Cambodia.  Their spice scale is on the hot side, so I've never ventured hotter than medium and it has a kick.  Their Kapow dish is also fabulous, with the runny-yolk fried egg on top to give it the added touch of goodness.  Try this place, but don't expect five-star service if it's packed.  The owners are very friendly and want you to enjoy and come back.  If Kevin is there he'll probably introduce himself.  When your meal is complete you won't get a five-star check either, the place is a great value.  We live nearby and I eat here 3-4 times a month and have never been disappointed.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rhP8W3vKe5ZNKqnTZJm01A"
  },
  "3Fq74Y_SLpJfxKCMPTUcyQ": {
    "date": "3/20/2015",
    "text": "We found this place on Yelp. It's a little tucked away and not on our normal route so we're lucky to have found this little gem! The menu is great. Lots of options and some interesting dishes. The food was outstanding as was the service. We'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xy2plQX5HMI_3O7oUP6HLw"
  },
  "6b5dyr9oJZLp52QgFW9Atw": {
    "date": "2/15/2015",
    "text": "I decided to go to this restaurant based on the Yelp reviews. I am sorry I did.  The food was mediocre at best and the service was horrible. I asked if my dish had vegetables in it as was told the Panaeng Curry had bell peppers. It had two measly small pieces of pepper. It seemed like they forgot half the dish. I am used to curries having lots of vegetables. Mine had about 6 shrimp and just a pile of sauce. The sauce would be fine if there was something in it. Just a major disappointment!!!  My dish arrived ( without a plate- which arrived about 10 minutes later) and my families meals came ten minutes after that. We never were asked how our meal was or if we wanted another drink. We were lucky to just have someone come and collect the bill.   My sons soup tasted like canned beef broth. It was a large quantity, but I really question who is running this restaurant?  This service was the worst I have ever experienced. Very disappointing! We will not be back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "AdGgKv9jCfr_MfhGB5BEIw"
  },
  "YVSgy-nfOK7vtWesg1RJCw": {
    "date": "11/15/2014",
    "text": "Update from my previous review.  The food is good but inconsistent.  The curries are always good but if you order anything with shrimp, expect to get 2-3 in the entire dish.  You'll think to yourself, \"Wait, did I actually order this with shrimp, or did a couple randomly fall in there while cooking this?\" Overall a solid choice, especially if you live close.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cOlfzHZkir4hYCBim3-0eg"
  },
  "n8HYWC-Q3UGU3ZPg_LRmVw": {
    "date": "11/18/2014",
    "text": "Food is inconsistent. I'll order shrimp curry one time and get a lot of shrimp and then another time and get two. Same with amount of veggies. Food is generally good if you live close, but sometimes you'll get a bad batch.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "sOkWN4YbPBIrFGhTHE0TmA"
  },
  "8EjIFWEDi6S4iamrWXmo6g": {
    "date": "8/5/2017",
    "text": "We ordered take out from this place tonight. They gave us Tofu curry instead of the chicken curry we ordered. We realized this after we got home with our food. They wanted us to come back and get a new one but we didn't want the rest of our dinner to get cold while we drove back to get the correct order. We asked for a credit for the chicken curry and they told us they would give it to us. As we were eating our dinner AND ENJOYING OUR SATURDAY EVENING, we were INTERRUPTED by multiple phone calls from the restaurant. GET THIS, they were calling because the manager wanted PROOF we received tofu instead of chicken in order to get the credit we requested. And had the audacity to ask for us to text a photo as proof!! We were completely insulted by this request over $12!!! We sent the pictures and let them know we would not be back and would review them on yelp and let everyone we know know how ridiculous and unnecessary this experience was. Customer service is clearly not a priority for this restaurant. Unbelievable!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y2fn9WHiR9VY7fj4klM58A"
  },
  "9Y8Sw9x-U8ZjtWweuGXzlQ": {
    "date": "12/9/2015",
    "text": "Service was good. I got help picking out my lunch choice.  It was great.  Interior looks cool..nice little vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oqGqCUrUKXeIkSUWdP_S2Q"
  },
  "GAVzsVOseUTstlCliLH4fg": {
    "date": "8/4/2016",
    "text": "Love this place. First experience was great!  Greeted by a gentleman that talked me through the menu. I have limited Thai food experience. Fresh, tasty. I'll be back for sure. Thanks, Yelp reviewers for not steering me wrong!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HytbbZ2kZnOv0Q20gqG71A",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Jade rolls. Huge and so yummy!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HytbbZ2kZnOv0Q20gqG71A/o.jpg"
      }
    ],
    "user_id": "R2TkHrSZsX5qGxlslByVWw"
  },
  "xXSFu34cn7-ZPZIC4bWdGw": {
    "date": "6/13/2017",
    "text": "Their lunch menu is awesome. You get quite a bit of food and there's lots of variety to choose from. Noodle dishes are very tasty. I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "k_WL0lqz6CasfErLHCOKNg"
  },
  "irBjVEovtLXZHm0VGGogoA": {
    "date": "4/10/2017",
    "text": "I'll start out by saying I love Thai food and can tolerate extreme spice when it comes to food. I ordered the pad Thai \"Thai hot\" and it was actually unbearable that's a good thing I suppose. I definitely will go back the dish was very good but I might go 4 star this time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FxOPKlyb2PHOessG-vN6_g"
  },
  "LjcWFmoZgMbUcvJ2-EwCYw": {
    "date": "4/11/2014",
    "text": "First try, and we are more than ready to crown this place the best Thai food in the area. My husband and I both agreed that the food tasted amazing. The sticky rice with mango was a whole another level -  HEAVEN!   I loved the decor, very colorful, warm and original. People who own this place seemed lovely..    We had the pumpkin curry and Pad thai, both were excellent. But, the dessert was heavenly.. Yes i know i've said that already, but it was that good!! :-)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wsLp9NZVqKg6sH7BKkfGFQ",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Cool decor!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wsLp9NZVqKg6sH7BKkfGFQ/o.jpg"
      },
      {
        "img_id": "NmRx-AesDbysxCa-34RjbA",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Sticky rice with mango!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NmRx-AesDbysxCa-34RjbA/o.jpg"
      }
    ],
    "user_id": "wTRt6D9ZvBI_DVJuuvxagQ"
  },
  "I-Ou27i4R5Txuq79ZzwZDw": {
    "date": "11/24/2015",
    "text": "No. Just no. The supporting staff are amazing but this food has zero flavor and there is no distinction between \"no spicy, mild or medium\". The curry was awful. The pad Thai was bland. The satay sauce was the only thing that had even an ounce of heat/flavor  so we poured it on everything. There was 1 quarter size piece of potato in my yellow curry, a pea sized sweet potato and it tasted like nasty, unfiltered water. So gross we didn't even save the tons of left overs we had. Plus it was expensive considering the low quality.  I'll never order from here again.  EDIT- the owner contacted me numerous times after my negative review and has been horrid!!! They blamed ME for my bad food!!!! They're awful people; classist, and mock people's religious beliefs-how that's possible for a food review I have no idea but I'm happy to share screen shots. DO NOT SUPPORT THIS BUSINESS. They don't deserve anything but a boycott.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ph-nwTop9w7DXtGtlZekig"
  },
  "jY90grtoKH2JTeBYXOXHLA": {
    "date": "1/17/2017",
    "text": "Probably one of the best Thai restaurants I've been to.  The Pad Thai is perfect because the noodles are a little thinner smoother than I'm used so and the flavor is just right and not too overpoweringly sweet like some Pad Thai dishes I've tried elsewhere.  The ambience is also really cozy but colorful and classy at the same time.  I love it here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JIm7P1uS7ToLsujHwSeQtA"
  },
  "rT2pxwTnNxTL7GmG1hZQSw": {
    "date": "1/5/2016",
    "text": "The food here is really not well thought through and poorly executed. I do not understand the high reviews. The service is friendly but slow as well.  Pad Thai was a mound of sweet noodles heaped on to a plate with hardly any vegetables, tofu or picklely things that make it a pad Thai. Other dishes seemed reheated from a frozen or pre made state. Not authentic nor fresh Americanized Thai either. Would not recommend to anyone.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9p6Z7A76Ij7mQRzNQXE4w"
  },
  "9uZF8oseBpzXBVqVGadpEg": {
    "date": "5/15/2017",
    "text": "Love this place for their entrees and lunch specials. Today we ordered two appetizers to go and they were awful!!!  My friend got the Jade roll and it was missing key ingredients. I got the Fresh roll and they actually used Deli meat in it!!! So gross!!! We paid over $22 for our food... and the wait was extremely long despite no cooking, and calling ahead.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4fI6132EqxfWRUdwbz4dCw"
  },
  "94t65cnyDXzfGat7C-dJtw": {
    "date": "1/13/2017",
    "text": "Not happy.  I would give them no stars is they allowed it.  They had our party wait for an hour to serve our food and when we received it, the food was lukewarm.   Food was ok but service was horrible.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dq4oWln1er809jTpVhWPVQ"
  },
  "WWGN4AO7ptbIiBjAHD0-yg": {
    "date": "3/9/2014",
    "text": "Destination worthy restaurant.  Amazingly good Thai food at uber reasonable prices.  Squeaky clean dining room & restrooms. The room in this little mom & pop place is actually pretty.   Friendly, smart service.  I live in the SF Bay Area which is loaded with Thai restaurants.  Cha da is better than 99% of them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NVei24-9k5GIZNRR1xGcRQ"
  },
  "3UxM9jMZdOnYM6TTo9tIgQ": {
    "date": "10/8/2015",
    "text": "To start off with, I'm from out of town so I rely on my GPS to get me where I was going.  Cha Da Thai was hard to get to, and it's in a very unassuming strip mall.  It's nice on the inside and I was excited to check out their menu.  I was also joined by a business associate and his wife.  We started out with Chicken Satay and the Jade Rolls.  Both were delicious.  Most Satay where I'm from has a bland taste.  Cha Da's Satay was very flavorful and their Penaut Sauce was excellent.  One thing was that the waitress came and dropped these fried chicken wings (2) on our table, she mumbled something and ran off.  We thought that was nice of her and we thought they were given to us to try.  Maybe that's what she mumbled....oh well, we ate them.  Come to find out they were supposed to go to the next table, not us.  We wound up getting charged for this appetizer to the tune of $9.95 for 2 chicken wings.  Yes, people you read that right.  $9.95 for 2 FREAKIN CHICKEN WINGS.  Dear old Colonel Sanders would be an even richer man if he were able to sell 2 wings for almost $10.00.  When we brought it to the waitresses attention she said that even though we didn't order it, because we ate it they were charging us.  That's kind of BS, and I've never seen that in all my years of eating out.  Perhaps if the waitress stuck around a second for us to ask her what the heck she dropped on our table it would have been resolved.  Anyway, we unhappily paid for them.  I had the pumpkin curry which was OUTSTANDING.  Well spiced, and extremely flavorful.  Excellent job and I'd recommend anyone to order.  I asked for mild, closer to medium and it was perfect.  Other than the weird, overly priced chicken wing incident we had a good meal.  Cha Da Thai should definitely be on the list of top thai places in Scottsdale  EDIT AS A RESPONSE TO OWNER COMMENT:  Rule # 1 to good customer service is \"The customer is always right\".  I notice many of your responses to customer comments are argumentative.  This indicates to me that no matter how good your food is, people will begin to get turned off.  I don't care how much of an \"art\" deboning a chicken wing is, sometimes restaurants offer appetizers gratis just for coming in, which in the instance of 2 chicken wings that's what we thought and the waitress didn't hang around long enough to explain or listen to us saying we didn't order it.  Standard practice is, if the restaurant makes the mistake, then the restaurant covers the mistake on the bill.  That's just the way it goes.  That's good customer service.  Keep arguing with customers and you'll piss enough of then off where they tell friends and don't come back, that's also the way it goes.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "-rlIN1BFK65MyHWt_HhPJg"
  },
  "wpO8LTuTKfjgDvY5CV7iZQ": {
    "date": "12/15/2016",
    "text": "The food was excellent. I had yellow curry with potatoes, and it was very tasty. We had jade rolls for appetizers, and they were nice and fresh. One person in our party found her medium hot too hot, and the staff were more than willing to take it back and fix it. The whole experience was very nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "EmJO1KrWwxex-mm_dAsJ8A"
  },
  "nVVLFIVXGut-QbWh19zLHQ": {
    "date": "7/15/2017",
    "text": "Tom Ka soup with shrimp, Penang Curry with chicken is wicked good haven't had good Thai food since I left the Bay Area. This place is legit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ge_pT0DvJCqWNQO64nQXg"
  },
  "NuHTr08BZM5fKSuIHeyJtw": {
    "date": "8/5/2017",
    "text": "Horrible experience!! This restaurant messed up our order. We called to let them know we received the wrong order and they didn't believe us. They actually called us back and wanted us to bring the order back but we were home & in the middle of salvaging our dinner... They said the manager was demanding we take a picture of the entree to prove they made a mistake. It was only when we sent the picture to prove the mistake on my order that they said they would take care of this... We told them to keep their $12.00 They clearly need $12.00 more than we do if this how they conduct business. Won't be back... McCormick Ranch...Beware.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nU0Meg71n2s0UqyYlHwsSg"
  },
  "bLHqNIcpqNsSlNHAxINVQg": {
    "date": "12/28/2016",
    "text": "After getting seated & given menus the people that came in after us got served water & orders taken before we were ever approached by our waitress.  The salad was very drab and the ginger peanut sauce was awful. I couldn't even eat the salad. We used to come here when it was Swadee and it was great. Not so much now.  Husband ordered learn tofu which was not on menu. It was ok. Should be served with fresh cabbage but was served over lettuce. It was ok.  I had tofu green curry with special request for veggies. I forget to ask for steamed tofu & got excessive amount of fried. This usually is my go to comfort dish. I was unable to find any comfort from this lunch dish.  We will not be returning. Having traveled and stayed in Thailand & enjoying good Thai food for years. This does not live up to our standards.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "skN5m81T9YoqYwP02rBr5w"
  },
  "rvLdcmvXVdyC89GlCO61zA": {
    "date": "12/20/2017",
    "text": "If you love pho you need to try the Thai version here.  Boat noodle soup flavor is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fJ6r-md0_Et79WDYwdqdmQ"
  },
  "m6UX79arOT81VxVIgIb7zQ": {
    "date": "12/4/2015",
    "text": "Truly, a 3.5 review, but since that's not an option...  The restaurant itself is very tastefully decorated, the staff is great, and the prices are right. Sadly, the food left a lot to be desired. Don't get me wrong, it's not bad, it was just \"average.\"  It was the right heat level (4/5), but the food lacked seasoning. The sauce was good, but nothing special. It desperately needed something, although I can't quite put my finger on it. I'm not disappointed with the experience, but I'm not impressed either. I'd go back, but I wouldn't be excited about it. Sad, given the reviews and the initial entrance experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGGapvfP1SZH2ZOikdSpNA"
  },
  "IO9RdtKaYZXj0HOLiMAKRA": {
    "date": "2/17/2017",
    "text": "Very friendly staff, good food!  Pad Thai was very good, but a little light on the shrimp- wish there had been a few more tossed in.  Wish the restaurant was a bit brighter though, seemed so dark inside.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "miU_EpLuumsbhdeG2fvO3w"
  },
  "Mca9aWskmC-sBf3mYtCj5g": {
    "date": "3/9/2014",
    "text": "My co worker and me use Yelp for a resource to find great food. We found this little nugget and I have to highly recommend. The ambience is excellent and the server was very nice and super friendly.   All of the food we ordered was delicious.  My favorite was the Cha Da Wild Lamb.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fGpCTyAbboaaFoH3a4NYDA",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fGpCTyAbboaaFoH3a4NYDA/o.jpg"
      }
    ],
    "user_id": "RUk9VymlEE09m-DGTyPh1w"
  },
  "7Ps6Z7CbmHX_lhNuMbELgA": {
    "date": "5/26/2015",
    "text": "Hi Nina,  Thanks for taking the time to write me a condescending private message and public response, but no sincere real apology. Now let me address your commentary:   I am not the first customer to say that you skimp on your meat or have inconsistency with the taste of your dishes. I just did some research and read through some of your other reviews and found factual evidence being Dee G., Jace R., Annie G., Jennifer S., and Randy C.'s reviews (just to name a few) that state the same exact thing I did.   I stated I have dined in with you a handful of times and have ordered takeout 2 times. I have given your restaurant more than a fair shot. I shouldn't need to complain in order to get a decent meal. I shouldn't need to drive back to your restaurant to show you my dishes to prove that there is no meat in it. Nor do I need to let you know prior to me putting out a review.   Lastly, your lack of professionalism in being able to take customer feedback has left me with a worse taste in my mouth than my dining experiences with you. Congratulations on that popularity.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "xR7w63dG15MRpcPOGpGz2g"
  },
  "uIq21HxLQoW8zL8IdOShEw": {
    "date": "10/18/2013",
    "text": "With great food comes unbelievably friendly service. Go there with your kids. Definitely will be back with my family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VzZR3ITTnR3MI-9qhmy0Xg"
  },
  "Gs73qC3RL09LDjM72o7Baw": {
    "date": "9/18/2013",
    "text": "A happy find. The Tom Ka soup was good, creamy, sweet and lightly spiced with fresh vegetables and good quality chicken. Liked the Pad Thai and the Red Curry. The service was attentive and friendly.  I was sorry when Swadee went downhill, but I'm happy now that Cha Da has taken its place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2L8qE8Q19ieO_9TAsZr3jg"
  },
  "2vbfWT9WT7PhFj7cVDu36A": {
    "date": "11/1/2013",
    "text": "Just had dinner at Cha Da Thai.  I had the lamb and my husband had a noodle boat. My lamb was cooked perfectly.  The wait staff were efficient and very friendly.  The decor is lovely and when we asked about the history of the Thai head dresses that were displayed on the wall our waiter took the time and gave us an indepth explanation of their history and meaning.  We'll definitely go there again.  We always thought Swadee (the thai restaurant that was in this location before Cha Da) was fantastic, but now we've found our new favorite Thai place to eat.  The only thing I would change is to get the noodle boat as an appetizer and order another entre.   The portions are perfect, but we were especially hungry when we went there tonight.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MfWMFBZBjYcQUk6O5tiIQ"
  },
  "wacWc9hsa0qqgjZgVQk3eQ": {
    "date": "10/11/2013",
    "text": "I'm surprised at the good reviews. 4 of us went for dinner & 3 of us had bad meals. How can someone make Thai food flavorless? My meal (ordered #3 on a scale of 1-5 for heat) wasn't spicy at all; my sister's was hotter, & she ordered a heat level of 1. Swaddee was infinitely better. Try Thai House on Shea going west just past Walgreens, south side of street. Hate to say it because everyone was so nice, but the food was definitely sub-par.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lr2lpgzfAsDnO_xcBxXwSQ"
  },
  "1wbuFF79JM1dFOa-1Nt8BA": {
    "date": "6/6/2018",
    "text": "Just ate here with my daughter.  Great restaurant.  The atmosphere was nice and the people were very friendly.  I would say that the cuisine is good but not outstanding.  Still I do recommend it for solid Thai food and friendly service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S_Joujv7euX3N9yHqE4IMw"
  },
  "8uG_kczEmGWU4mgbCNSLrw": {
    "date": "12/19/2017",
    "text": "We love Thai and this was our first time here. It was so good. I love that they listed gluten free next to the entrees. I got the Panang curry which was very delicious. My boys loved their drunken noodles. The one said it was one of the best places he's been. Hubby got the beef noodle bowl which they said was similar to Pho. He LOVES Pho so he tried it. He and my son loved it. I Hate Pho but Loved this soup! I may even order it next time. Our server was super friendly. We all can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aSAaVLBgW3mNiyn4uzt8pg"
  },
  "_yKp4Y4hgyNOyKVYGTECXA": {
    "date": "10/19/2015",
    "text": "Awesome Thai food! The Penang Curry is incredibly tasty. Get it with your protein of choice and ask for added vegetables at a small cost. Tom Ka Gai soup is very good too. Friendly service. Affordable prices. I don't understand why they always have a TV on in the restaurant, though; it distracts and adds nothing positive to the experience. It's a small joint in a a strip mall - you come here for the food, not the ambiance.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r1313NxJbTpuv2EEbNSR_Q",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Penang curry chicken with added veggies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r1313NxJbTpuv2EEbNSR_Q/o.jpg"
      }
    ],
    "user_id": "ZDFjD5kHgSyM-iZUlhPSBw"
  },
  "j0LWC4DQoLoTWjcj1CLLpQ": {
    "date": "12/13/2017",
    "text": "Excellent food. Authentic thai food. Good staff, fresh food and good prices. I have been there several times and like most of the food on their menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSyU4COSy29fqrkmJGoD7w"
  },
  "32JshuZkh7YPQ6MH9r_wOw": {
    "date": "4/22/2018",
    "text": "Poor service and long wait times. Staff I felt was little rude. Not recommend...food quality is ok not special.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "t4q0WG_9g-Gj9OC2wEmkKA"
  },
  "M36D_Np0n2bK7Aq724CXnQ": {
    "date": "7/7/2016",
    "text": "How do you rate a place where the servers know your name? I go here religiously. Their noodle boats are amazing. Curry? Good lawd. Spice level? How many times you want to visit the toilet the next day? I love it hot, and they deliver. Sure I pay for it the next day, but the spice level with the addictive and unbelievable flavor are worth it. I have tried numerous thai restaurants. Cha da thai, is hands down the best.  PS-you like veggies? Jade rolls extra peanut sauce :) You're welcome!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "FZllLiOREEjLC1JAh5PBxg"
  },
  "rNx3qYzltpo6KITTGZjqtg": {
    "date": "8/23/2016",
    "text": "Authentic thai food ! Anyone who loves thai food must try this place .. boat noodles tasted great.. only place i tasted boat noodles this good was in ca  .. grilled beef laab was also good and spicy .. too bad only in town for 1 day .. very nice and helpful staff .. cant say nothing bad about this place except cashier didnt know where minnesota was .. lol ..",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nJo2Tx_ZzcEM7ttpDVfizA",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Best boat noodles in town .. glad we  made the stop at cha da thai !",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nJo2Tx_ZzcEM7ttpDVfizA/o.jpg"
      }
    ],
    "user_id": "IFbP0CFOunhv-TvByOSSrA"
  },
  "HVAvhBw9FEriu-RMPbHjGQ": {
    "date": "2/5/2015",
    "text": "This is actually our second time here. Last time we had very tasty green curry and papaya salad.  We used to live in Singapore and traveled in Asia a lot. We've been looking for real authentic Thai food for many times in the valley. One day we saw the paper about this restaurant and made us very curious about this restaurants. It was much better than we thought and became love here so much!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ynDwrHlFc2-7OwfS3JTmYQ",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Their special menu boat noodle",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ynDwrHlFc2-7OwfS3JTmYQ/o.jpg"
      },
      {
        "img_id": "BfnmQ-83BLkXSa8VnW4h3Q",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Pad Thai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BfnmQ-83BLkXSa8VnW4h3Q/o.jpg"
      },
      {
        "img_id": "xKk0BwhYGAOYU9q7uPEt9Q",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Iced Thai tea",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xKk0BwhYGAOYU9q7uPEt9Q/o.jpg"
      }
    ],
    "user_id": "TL7FDdkbvb6GBdNMTD7u5w"
  },
  "Fb1wlOl2T3RcXnIatqx6hA": {
    "date": "7/9/2016",
    "text": "I am staying in Scottsdale for a few days and deciding to cave in to my Thai craving.    The Jade Roll was disappointing.  It did not taste very fresh and the peanut sauce just tasted weird.  The chicken pad thai however was pretty darn tasty.  I got mild spice level and it was extremely mild but had great flavor.    I would try other things on their menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "thd9VCH15rnVLVah0SawnA"
  },
  "3x0GfOSbMlLgpXbbIqJkMA": {
    "date": "1/18/2015",
    "text": "Service was sweet and friendly. But our waiter wasn't able to really assist with some menu item explanations and recommendations for my dining pals who were largely unfamiliar with Thai cuisine.   Spicy levels are 1-5, and I was reassured the medium was REALLY hot. Not True AT ALL, but he brought a condiment tray for myself and a few others to bring on the heat. (After seeing what was added, he recommended my ordering thai hot next time).   I was one of a few that had enough for take-away. Our waiter bagged everything up, including ample portions of fresh rice for both of us (a rarity and much appreciated).   Overall, I enjoyed my food, as did my dining companions. No one tried dessert, so I can't comment on my go-to (sticky rice + mango... It's not in season, sadly), but I plan to be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "MPGqUhAsmVEHq9k9X6VZKw"
  },
  "okRfzUiSu2X3UB5-IaualQ": {
    "date": "10/28/2017",
    "text": "One of my four favorite Thai places in the East Valley! I eat here 3-5 times a month for lunch. Thai Boat Noodle is absolutely fabulous! It's the Thai version of Pho... soooooooo good! I think there are a dozen varieties but #1 & 4 are my favorites. The staff is fantastic! You will not be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5_YkZMphwEzSKy35jDxr8g"
  },
  "uSOh_H0vQNDEr3uctJOWcA": {
    "date": "11/15/2014",
    "text": "Short Story-  Either the best or one of the BEST at Thai Cuisine in the Metro Phoenix area. (Spice level runs one-two hotter than other places)  Service can be HIT or Miss and on my day it was a Miss or I might have gave 5 stars. (on my day service didn't get bad till we wanted to leave so it was mostly good)  Longer Story-  We came at a popular time when the place started to fill up quickly. Our server seemed rushed and quickly took our order and dashed away before we were able to order beverages but she did bring us water so we went with that. (no big deal that is typical and average service when a server is too busy)  We did notice they only had one waitress on with another that seemed like a helper. The place filled up quickly and the two ladies were working like a team together.  We started with these  green leaves stuffed with the most insanely DELICIOUS mixture of toasted coconut, pieces of lime, ginger, and peanuts. Small pieces of a very hot chili was on the side and when you add just one it's the perfect heat. You taste sweet, spicy savory, tart and tangy and all the textures. It just delicious! It's a MUST GET DISH!  I soon receive my Pad Ped Makeur (Eggplant) with Chicken. I ordered it one level under Thai Hot and WOW was it hot! I almost couldn't eat it. But WOW was it delicious! The Chicken was prepared very well and this dish was layered with the just right flavors that made it just right.   My husband had the Kapow with Beef Thai Style. They hand chopped the beef giving it more surface space to taste the sauce more. The beef seemed like a better quality than what you'd usually get at a typical Thai Place. What made the dish special was that PERFECT Crispy Fried Egg with a runny center. This Kapow was very good. (I do note the dish should have had the same amount of basil as the Eggplant Dish had and was slightly short on basil)  We eventually finish the scrumptious food and we wait about 20 minutes for our server to stop by and she said she'd bring the bill.  And we wait and wait and wait and wait and wait.  We decided she was just too busy to ever come back so we HAD to leave money on the table.  I don't know if they were short on help or if they often roll like this?  Food 5 stars or close to 5 stars.  I only deducted one star because service was mostly good  (average) and the food was delicious and was above average Thai.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "-CeIfIT6zVvV-U-YJA_OmA",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Miang Kum (really delicious Toasted Coconut stuffed Green Leaves)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-CeIfIT6zVvV-U-YJA_OmA/o.jpg"
      },
      {
        "img_id": "8MLiwKi4bmeovxjQ3gjGyQ",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Kapaw served THAI STYLE with Crispy Fried Egg",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8MLiwKi4bmeovxjQ3gjGyQ/o.jpg"
      },
      {
        "img_id": "5ArUv4mXE2mdyC1P8ZAG9w",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Pad Ped Makeur (Eggplant)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5ArUv4mXE2mdyC1P8ZAG9w/o.jpg"
      }
    ],
    "user_id": "V-BbqKqO8anwplGRx9Q5aQ"
  },
  "m5pjEQUAIXNNQzuiQ4mfJg": {
    "date": "10/27/2014",
    "text": "Great place for authentic Thai! And, close to my home (even better)!  I had the Shrimp Pad Thai (medium level spice) which was scruptious! NOTE: I can handle my spice, okay, but medium was enough to water my eyes AND clear my sinuses.  Ordered chicken lemongrass soup. Presentation was awesome (complete w/flame in middle of pot), but disappointing combo. I didn't care for the huge chunks of ginger casually floating in my soup, as I thought they were merely bamboo shoots. I felt like someone squirted Lemon Pledge in my mouth. Not cool.  Jasmine (hot) tea was great also! Not too strong and went well w/dinner options.  Location is odd - it's a part of a quiet (and dark) strip mall. Service was friendly and attentive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MahMM94Lol2L5fyCre5ZiA",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Shrimp Pad Thai",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MahMM94Lol2L5fyCre5ZiA/o.jpg"
      },
      {
        "img_id": "VVFjk8oFXlATG55QgztWiw",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Chicken Soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VVFjk8oFXlATG55QgztWiw/o.jpg"
      }
    ],
    "user_id": "SCPgLdL2hoeP3Plnc0dkzg"
  },
  "cSeJvhbHdde_4TqoopZ36A": {
    "date": "10/10/2017",
    "text": "My husband and I love this place.  He discovered it before me and had to drag me here the first time.  It took a while, but now I love it.  The wait staff knows exactly what we are going to order before we give them the order.  My husband orders the same thing every time we eat here and they know that I probably will not, since I am a more daring eater than he is.  Lovely, quiet atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfsyEkWlg5KGmPi2Z1zx9Q"
  },
  "f2TcJ_HaaPmUgR2RLSy2uQ": {
    "date": "9/30/2017",
    "text": "Impressive Thai food in Phoenix. Try the Thai boat noodles. Service is excellent and I'm sure the other food is really good too. I just can't get past the boat noodles. I order it with scallops and they are massive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-fvYGqUauQBuBQtmObZKyw"
  },
  "ZKPeBlv_xEBzc715Bak8ug": {
    "date": "7/20/2017",
    "text": "We lunch here all the time.  For is creative and fresh.  Customers decide the right level of heat  while the pho is amazing, the eggplant and veges are dreamy.  Reasonably priced as well.  Decor is faux Thai--but I think the mask collection is definitely authentic and quite beautiful.   Best Thai food in Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCE3jTxb1JzfBx11-wTnlw"
  },
  "JNYNjBVYEqqYN2QC687yuQ": {
    "date": "4/28/2016",
    "text": "Every time I come here every dish is fantastic. The prices are reasonable and the quality is amazing.    Adequate seating and a lovely environment with a genuine talented chef.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "V8SyEt6efjYqmy9CkViqiw"
  },
  "miAAEdUu_wPNEYjmua4Ckw": {
    "date": "5/14/2015",
    "text": "The best Thai restaurant I've been to in Scottsdale!   Every summer my family and I go back to Thailand to visit our relatives there, and I always end up eating Kao Pad Goong with most of our meals. Sometimes I get a craving for a taste of it but I've never found a Thai place in Arizona that has done justice to the ones I've had in Thailand (various places in Chiang Mai and Bangkok) until now! I would love to try some of the dishes on the dinner menu too, unfortunately I work night shifts.   My mother was also very impressed with how her dishes tasted too. She even said that it tasted exactly like the ones she had in Bangkok when she used to live there.   Overall, great food, friendly staff, comforting atmosphere. This place will definitely be my family's go to spot for Thai food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N01JFYSH0k9qOlUmLQEHrA",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Kao pad goong",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/N01JFYSH0k9qOlUmLQEHrA/o.jpg"
      }
    ],
    "user_id": "-oz38kvGQEI4dZKSxv9fLw"
  },
  "YwdEsPhfBT2lRIWqQf8Mfg": {
    "date": "8/10/2014",
    "text": "Went here for dinner with a friend yesterday and was greeted by a woman and a friendly man, Kevin, who told us all about the menu and made several recommendations: drunken noodles,pad see iew , and their soups. Even though we weren't dining in, they had a nice little waiting area and brought us waters while we looked at the menu.   The servers were very attentive to us; 3 different people asked if we needed help or were ready to order. We went with the drunken noodles and the pumpkin curry-absolutely delicious! The server helped us pick our spiciness level by saying a 2=a 2.5, which it did (probably closer to a 3). The food was ready in about 15 minutes and Kevin made sure to reintroduce himself and invite us back. Great experience, great food, definitely going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "FIqHWqd6-xDJ5QOVTT3Dhg"
  },
  "akJMgAU2v3F5AuRceiiW-w": {
    "date": "4/18/2017",
    "text": "Most authentic Thai restaurant in Scottsdale. Its really hard to find authentic ethnic food in scottsdale. All their dishes are well seasoned and full of spices and flavor. Everything here is good, haven't had a dish that I dont like. All their curries is good, eggplant stirfry with basil is a must if your're an eggplant fan. Pad thai is da bomb, papya salad is obe of the best i've had. I like my food spicy and this restaurant kicks my butt every time but its a good spciy feeling. You can also ordered extra spicy which spicier than level 5, which is tongue burning and sweating spicy. This is my go to Thai spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GOgnNo1WwcIIHloqjWs-Qw"
  },
  "Q_ZDwwrZkzB8BJU4SeGDBw": {
    "date": "4/16/2014",
    "text": "I have eaten at Cha Da Thai several times and really enjoyed the food. It is some of the best Thai food in town. The ambiance is nice too, and the owners are friendly.  Normally, this would be enough for me to give a five star review, but I can't because the service is awful. My most recent visit was not a good experience at all. It took a very long time for someone to take my order, the food took forever, and it also took forever to pay. When my curry was finally ready, one of the servers struggled to get the dish to me, as she had no idea who had ordered it. There seemed to be a general lack of attention to detail and confusion among the wait staff. While I enjoyed the food, the poor service tonight has soured me on returning anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rrV_iewf_L73wURjFDP0Hg"
  },
  "pMqzbU39vyTusGxeb-WRJA": {
    "date": "7/21/2014",
    "text": "Pro- good white rice, friendly staff, good water Cons- poor service, cheese bites were partially cold on the inside, ice tea had cream in it, staff got confused easily",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MfX4UgE6QHjB7Ipz3Lb3Zw"
  },
  "qM4kwawxaEpbHxG_j9Vv3Q": {
    "date": "11/22/2014",
    "text": "We found the flavors to be exceptional.  Definitely some of the best-tasting Thai food we have found in the Scottsdale area.  So glad we gave Cha Da Thai a shot.  This review would have been a 5-star rating except for the fact that our Pad Thai was pretty dry.  Since it was a to go order it's a little tough to gauge how much of that was due to preparation and how much was due to delay in consuming it.  Ordering extra sauce on the side may have been a simple remedy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YyAd1zsFxX7ySn4y7qZ8yg"
  },
  "B7L8pQWZsVpEA0WucV0OJA": {
    "date": "4/10/2014",
    "text": "One in a million is this restaurant that serves the best Thai food in America!!!!! The decor was soo cute with the Thai headdresses and paintings!!! I adore the pad see ew, the beef was nice and the noodles were full of great taste!!! The Tum yun soup was amazing and sour which suits my taste!! The server was soo nice and sweet!! I'm sure that I would come back the next visit I come to Scottsdale!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VwwDkLXP94XzaN9R0ayuEQ",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Mango CRAZY",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VwwDkLXP94XzaN9R0ayuEQ/o.jpg"
      }
    ],
    "user_id": "OgSCtXLhpCotgzrVjSDCqA"
  },
  "YP0TFhBT0MtJxPU3Q2JKWA": {
    "date": "9/19/2014",
    "text": "I have not had this quality of Thai food in years! Everything from the typically pedestrian Pad Thai to the more adventurous beef laab was authentic, delicious, and honestly, the best quality Thai food I've found in years!  The service was excellent and super friendly.  They were quick to assist but not in our faces during the meal. And they really know how to do Thai. This isn't some bastardized version of Thai. This is legit. And delicious!!  We had 9 or 10 dishes, and they were truly all great. I would say the biggest stand-outs were the Laab (honestly the best we've found since we were in Thailand) and the Poo Goong Ob Woon Sen (clay pot) which my family literally fought over. The Dessert Princess was pretty fantastic too.  It was just an absolutely awesome meal. My kids even rated it \"5\" stars, citing the \"amazing food\" and \"perfectly cooked shrimp\".  Seriously, just go here if you're a fan of Thai food. You won't regret it. I promise.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i110yLl8GJjvE8r46VIwYg"
  },
  "QixttPx1WWkc5OOlU_ApBQ": {
    "date": "1/29/2015",
    "text": "Came here with a few friends that live close by and had a tremendous experience. Not only was our server helpful with the menu, the owner came over and made us feel right at home.   To top it all off the food was dynamite. Thai noodle bowl with brisket and meatballs. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n2MV2uJoioyoAchCos3Erw"
  },
  "tAJA6lymUeZ0JPjCky2zow": {
    "date": "1/15/2015",
    "text": "Went with my wife, brother and my two boys  around 7 on a Thursday night. Restaurant was 3/4 full which meant that the positive reviews were probably pretty accurate.  Had vegetable egg rolls 7/10 and the spring rolls 6/10 to start. Pretty standard, nothing out of the ordinary here, except for the size of the spring roll which has the girth of a soup can.  For entrees my brother had Kee Mao with beef. He liked it. I tried a couple bites and thought it was very good 8/10. Wife had chicken curry. My sample of the curry had a strong lime flavor (not in a bad way) good veggies and good white meat chicken 8/10.  The best dish was mine. Not sure what it was actually called but it was sold as a Thai version of Pho (on a separate yellow menu). I had the shrimp and scallop version. It was fantastic. I love thai food and I love Pho. I would consider myself an above average consumer of all types of asian foods. This was a perfect blend of what I love about each. It had 4 good size shrimps (without the tails to pull off) and 4 good sized scallops. Asparagus was also a nice addition. Broth was spot on. A solid 9/10. If you like Pho, definitely don't miss this.  Also, the owner walked in halfway through. He stopped and chatted with us for a couple minutes and stopped at every table. I have always thought that the owner should at least say hello to every customer sitting in their restaurant. This owner obviously felt the same way, and was very natural in extending a verbal hand shake.   Longer story short. Food is great. No need to look anywhere else if you are anywhere close to the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rqr55kMPF9DUzE9z4OLg3g"
  },
  "NUE0CBIeoo4Aq5W37PTVOA": {
    "date": "7/30/2016",
    "text": "Went here last week and had a great Thai meal with good, friendly service!  I had the Red Curry with peanut sauce, and it was outstanding.  Nice and creamy (I hate it 'watery'.....)!  Great flavor!  My date had the Cocoanut Seafood curry, and she enjoyed it very much.  We will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xtJoTbn6kvYR96tXt5H5uw"
  },
  "KL_fNSyQsNFqcpxxtHh84g": {
    "date": "10/21/2015",
    "text": "I think I've found a new favorite Thai restaurant. This place has a bit of that hole-in-the-wall charm with a huge side of delicious food. The lunch menus are great with options for bento-style lunches with appetizer and drink or more traditional lunch options with soup or salad. I had the Thai eggplant with chicken (and rice) which is a dish I often order at Thai restaurants. This might be the best I've had. The lunch portion was perfectly sized, and I left feeling full but not overly stuffed. The owners are very friendly and welcoming which adds just that little extra to a great restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hyli6YWc-0PxRAerObzZIQ"
  },
  "f5cP55w4gfGZhwHLu92Z2w": {
    "date": "10/29/2015",
    "text": "This is probably my favorite Thai restaurant in the Valley. The food and environment are pretty authentic and the owner's a really nice guy. My favorite dishes here are the Massaman Curry and the Pumpkin Curry, though I've tried several other dishes and they were all very good, though I've had better Pad Thai. The prices are also very affordable for the quality of food you get.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7YhXrvwA6fK9KSb6QdSsdQ"
  },
  "lg4FA3yhAyEtl4F_D6mdWg": {
    "date": "3/31/2016",
    "text": "Love their food. Addicted. Found them through a yelp search - looked for a Thai restaurant with best review in the Scottsdale area.. and woohoo! Not disappointed at all! Both the times i visited it was during lunch. Friendly staff, warm and cozy atmosphere, fast service and to top all that - YUMMY FOOD: of course that is why i was there in the first place. Will definitely recommend to friends in the valley - a neighborhood Thai joint!  Oh oh oh.. they have all sorts of crowns on the wall and they actually offered to take pics with the crowns! :D",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "315BLx1RCtNwwit2NNgEKQ"
  },
  "UT32pRKu0fQS4KRs_8Y13w": {
    "date": "8/28/2014",
    "text": "The best Thai restaurant in Scottsdale, bar none.  I love their Thai version of Pho, but don't ask for \"Thai Hot,\" I barely survived the bowl of lava.  Great service, amazing and flavorful food as well as super friendly staff.  A must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iqpSkSV9MwscDuwBNMfTGQ"
  },
  "bk6SuiM9HL8d87zN-RzORw": {
    "date": "8/15/2013",
    "text": "I've ordered takeout a couple of times from Cha Da, and can now offer a fair assessment of my experience. Anyone can have a bad day right?   First things first, the service is great and you get 10% off if you pay with cash (nice bonus) and a good reason to let the plastic cool off.   The first time I ordered the spicy eggplant lunch special (a couple of weeks ago), it had VERY good flavor, the eggplant was deliciously soft and well cooked...unfortunately, it was drowning in grease. I'm not a grease-a-phobe. I can enjoy greeeeezy along with the best of them. But this was a bit much.  They had run out of their soup, so I had it with the side salad. The side salad was very tasty and fresh.   Today, I figured I'd give it another try. This time, the eggplant dish was still soft, still well cooked, and it was not greasy. In fact, it had very VERY little sauce at all. Which is something I can overlook if I have to. But not only was it not spicy,  it was lacking flavor and spices. Very pretty to look at, but bland. The soup, however, was DELICIOUS! So was the thai iced tea.   Since it is really close to work, I'm sure I'll be back, but I doubt I'll order the eggplant again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "mzHRaYLoV-lwX79HghP6lw"
  },
  "Ap8XGSh2Jn9qMXscKe30Dw": {
    "date": "8/6/2016",
    "text": "Excellent usage of Thai  spices and herbs so everything has magnificent flavor going on even after the meal! The fresh spring rolls are amazing the peanut sauce is the best! This place is a definite     Yes!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZpeBGkpNcSeOcMoUECbFxw"
  },
  "My3x3iNi6_J8Hldv_W_b0Q": {
    "date": "6/1/2016",
    "text": "Small place tucked away in Scottsdale.  I ordered the kao pad with chicken (basically fried rice) which also came with soup or salad.  The soup was nothing special, but the chicken fried rice was good.  The staff was very friendly and they always kept my drink full which is important when you order the dish hot or thai hot.  The place was dead at 11:30, but was completely full by 12:30.  I will definitely try this place again and try the Thai soup bowls which looked quite good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_yNP6tJY6S_4PQJ3SzLvsw"
  },
  "Ognj9VdYsNx2ptBlD0_2eQ": {
    "date": "1/15/2016",
    "text": "Best Thai food in Scottsdale! Tom Kha  is the best we've had. Try the Jade rolls too. Vegetarian heaven.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mFvQR69x-mcgmuMZSg19KQ"
  },
  "jrmqz-Xiqmd2GxRw0PZMrA": {
    "date": "5/1/2014",
    "text": "Great place and great service. Owner is very friendly and nice. Servers were also. They let my friend put on the cha da. Epic service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "sXx90_bAMIpkzOibrhem2g",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sXx90_bAMIpkzOibrhem2g/o.jpg"
      }
    ],
    "user_id": "9AvK0ARtQnNtPiA0pTGGEQ"
  },
  "u6hBuykldpjABdEtt9YotQ": {
    "date": "8/17/2013",
    "text": "Wow!  So much more than I expected.  I took one of my dearest friends to what I expected to be Swadee Thai--only to find the place renamed and with a new owner.  Ironically, I had warned my friend that the food was great but the ambiance was more like a diner.  Well, it sure isn't now!  Not only is it the best Thai food I've ever had, the owner (an absolutely charming and welcoming woman named Nina), has managed to slipcover the Naugahyde booths and chairs, put lovely fringed table cloths and Thai art reproductions under glass, and covered the walls with the most stunning collection of Cha da's (traditional Thai headdresses) and masks.  And the prices are beyond reasonable.  Run, do not walk, to this charming little gem! Laurie, Scottsdale Ranch",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "TogKHmIl2lMKkxfKRBV79w"
  },
  "9a9fWFUVYd_Z46lteh5rYg": {
    "date": "11/18/2015",
    "text": "Very impressed.  I ordered to go for dinner with friends.   On the outside, the place was dark and uninviting.  The strip mall is unimpressive.  The area is more industrial.  I actually work in the area.  On the inside, the decor is cute and restaurant was clean.  I ordered pad ped makeur (eggplant) with chicken, pad prik khing with tofu, and khua gai with pork. All entrees were still hot after 20 mins.  To go did not change the integrity of the food.  Eggplant was thick and not mushy.  I would def go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBRkJp59aKz5kiypt2WjFg"
  },
  "7krPZ1QpyoV-9JZ1IWQqMA": {
    "date": "7/23/2013",
    "text": "Went for lunch today thinking it was still Swaddee Thai restaurant.  It wasn't, and I'm happy to report Cha Da Thai exceeds Swaddee.  I ordered the chicken panang curry (hot) lunch combo with a Thai iced tea. Start off with a soup or salad (got the salad, which was crisp with a nice dressing), and then the meal arrives, sort of like a bento box. You get an appetizer (I chose vegetable tempura - which was perfectly executed; including a piece of tempura avocado [!] which was a interesting touch), rice, and the main dish.  You get a drink too, but this doesn't include the Thai iced tea apparently. The \"hot\" was spicy enough where my lips were still tingling after I walked out the door, but not so hot that I couldn't finish the meal - the right balance between heat and flavor.    The only quibble was that it took a while to order but once the order was in, the service was friendly and  attentive. I would chalk that up to the fact that they seem to still be in the opening process (contractors seem to be still installing things).     Overall, an excellent experience. I'll definitely be a return customer and will bring people with me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "vOgLBG3iFNk0HxQXNjER8A"
  },
  "pGukSNvjpuwNnE8eTNoaAA": {
    "date": "2/21/2017",
    "text": "Chicken Pad Thai was very good. Careful with he spices. This is a real deal place. Excellent flavoring and be sure you want it hot if you go high on the scale.   Smaller place, but can be exclusive on off hours. Enjoy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HuPF1XOx3N6U5BEYnTWqKA"
  },
  "K8SV1iwxkG1VU32XN7D2fg": {
    "date": "8/2/2017",
    "text": "disapointing, absolutely piss,poor i used to come here when it was sawadee and in the early days when it first turned into cha da, the food was wonderful then  now i scratch my head and wonder what happened,  my pad thai the noodles where mushy and chopped up into small bits, it can help but wonder if they where taking the piss out of me, for  i have never had thai food so bland, or bad for that matter  cha da go back to your old chef, whomever is cooking now should not do so.... absolutely barmy!!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "2aI-PmFX82U50ToNmS0O4Q"
  },
  "dJUzk7KTw4BDd2L5Or6GsQ": {
    "date": "7/21/2017",
    "text": "Wow such a disappointment, I could probably cook better Thai food at home using a free recipe found online, and I have never made Thai food in my life.  Worst of all was the service though.  There were 2 waitresses in the front seating, serving, and clearing off tables.  We were seated in a nice booth quickly by the \"friendly\" waitress.  However, the other waitress \"angry one\" ended up being our server and she was rude and standoffish in a manner that made my mom and I feel uncomfortable.  As we ordered our food she looked irritated and gave me a strange look when I ordered the soft shell crab as she ripped the menu away from us and ran into the back without saying anything...awkward.  The food came out quickly within 20 minutes.  The appearance of the soft shell crab was delightful; however the green curry my mom ordered was sloppily plated and would have benefited with some fresh garnish.  The green curry lacked authenticity, where was the coconut milk, and flavor?  The soft shell crab was covered in a pungent garlic sauce which I felt did not mix well with the crab.  If the sauce was a lighter, buttery, herby sauce it would have been perfect since the quality of the crab and the way it was cooked with the veggies was spot on.  The garlic sauce they used tasted like something you would expect on a Hawaiian style fried garlic chicken but not on seafood.  The waitress never came by to ask how our food was, or to refill drinks.  My mom wanted to ask for chopsticks instead of the fork provided but obviously could not since our waitress was MIA even though there were only 2 other tables.  She came quick to deliver the check though..not so quick to give us back our change (we paid cash).  My mom still tipped 15% in hopes that the waitresses would split the tip.  The prices are about $15 per person (for dinner) not including dessert or a drink which I feel is pricey for what you get and how you are treated.  I am sorry to say but I will never come back to Cha Da Thai, which is sad because I live right down the street and love Thai food.",
    "rating": 2,
    "rated": {
      "funny": 6,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "AtDUaCAPuSKR6E6QaSmmow"
  },
  "vfzeLwJa6NGD-5RnoQkv9Q": {
    "date": "1/3/2019",
    "text": "Love this restaurant! The food is always fantastic, and they actually listen to the spicy level you request. My husband has tried multiple options, at a medium, and has enjoyed them all -- they have been spicy enough and lots of flavor.  I'm a huge fan of their yellow curry, and I bounce back between spice levels (mild, vs, no spice) and I can always tell the difference.  We almost always call ahead and take it to go, and we've never had an issue.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "onfeOLo09HE7sBN5flpi9Q"
  },
  "eAtDO8ykc_qiL-MuiNLKQw": {
    "date": "5/28/2016",
    "text": "When my husband and I visited Thailand we took a cooking class and learned all about the specific ingredients that are used to cook authentic Thai food. This has made us a little more critical when dining at Thai places, since we now know exactly what should be used to make an authentic dish. We ordered the tom yum soup with shrimp, beef drunken noodles, and chicken panang. The soup was delicious and had perfectly cooked shrimp. Both the drunken noodles and panang were full of flavor and tasted just as it did in Thailand. The portion sizes were very generous too, we had enough for lunch the next day.   The service was top notch, the owner made an effort to visit every table and chat with them. He told us that his wife is from Bangkok and that is why the food is so authentic, we then got to reminisce about our travels there. Cha Da Thai is one of the best Thai restaurants in the Phoenix area. If you're looking for authentic Thai food, this is the place!",
    "rating": 5,
    "rated": {
      "funny": 14,
      "useful": 27,
      "cool": 17
    },
    "photos": [],
    "user_id": "QG9ZJatKSWj5p5VrW3cfMA"
  },
  "Fbz-aBAIxHKbTiEZEXL9Cw": {
    "date": "5/16/2018",
    "text": "The food is always fresh and consistent. We eat here several times a month and always have good service and food. The yellow curry is outstanding!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_PEJ_j8dopGUHtRbUdc3MA"
  },
  "qhVFHFY5JCwBhYgb8cOzBQ": {
    "date": "12/6/2017",
    "text": "I was in the area so I figured I would try it out. It's a pretty small place, but the decorations are so pretty and colorful. I was waited on immediately and overheard some women talking about how they eat there weekly. I ordered the lunch shrimp pad thai, which came with spring rolls and a salad. The food was delicious and was served very quickly! The staff was amazing, and I will definitely be coming back :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bRZpvYTqixEcRp9LxCkOlA",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bRZpvYTqixEcRp9LxCkOlA/o.jpg"
      },
      {
        "img_id": "11fmH5UPO8sJ87wLUOZhLA",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/11fmH5UPO8sJ87wLUOZhLA/o.jpg"
      },
      {
        "img_id": "k77ETlGwm4w17QU3mGlsOw",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/k77ETlGwm4w17QU3mGlsOw/o.jpg"
      }
    ],
    "user_id": "6Jj2s1TOIKkcjLAqyGhaog"
  },
  "2yb1JOyPXnj0QPMSiw7Zxw": {
    "date": "4/18/2018",
    "text": "Dude! This pumpkin curry is soooooo freaking good. I want more right now and I cant concentrate at work. It's why I have time for this review. Get it and get it hot. Spicy is the way to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R02DQgXMBuc2uqE9nX5K5Q"
  },
  "5SodBnwJKQezn4M9oZBbXQ": {
    "date": "10/16/2018",
    "text": "This is a hidden gem. So happy to have stumbled across this place. I will definitely be a regular here. I love Thai food and eat it at least once a week. The staff was efficient and friendly the atmosphere is small, cozy and authentic. The food is prepared by authentic Thai cooks and its excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQLWcN-gRpmDhxHrH8K8kw"
  },
  "YUPAQXWGVTI3dm97QmMVAw": {
    "date": "1/6/2018",
    "text": "The worst service I have experienced there ever since we found the place was on a Saturday evening. The place was 70% full.  We have been goin to Cha Da for years. We used to see the owner walking around making sure everything works as it should. As of late, service became an issue. Today we came in @ 6:40 in the evening. People were waiting for a while for the food. The waitresses were overwhelmed and it seemed as if there was no managing hand. We left after 45 minutes without ever getting our food.  So good by Cha Da, time to find a new Thai place. And BTW, to the waitress dressed up as if it was a bar, Cha Da has always been a family place, too bad it it is losing its reputation.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RBQr-EZRQYFgpBzLisYQPQ"
  },
  "vY2e_79s2K9ItGRrfX4m_w": {
    "date": "6/2/2017",
    "text": "Easily in the Top 5, if not the best, Thai restaurants in the Valley.   They make amazing Pad Kee Mao and Pad Thai. Their curries are delicious, tangy, creamy, and their staff is super warm and friendly.  I've been here dozens of times for lunch with colleagues and highly recommend it to anyone!   Be sure to come in before 12 or after 1 though! This place gets packed quick during the week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oXBV6Sn9UTA7Ndtq0N5ChA"
  },
  "5mGJSLDeNm_ED5aGEsl7pQ": {
    "date": "2/1/2018",
    "text": "Best Thai restaurant I've been to out West. Every dish was amazing. Loved the pumpkin curry with duck. Very friendly family business. You can't go wrong here. Come early. It fills up fast, even on weeknights.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pZeGZGzX-ROT_D5lam5uNg"
  },
  "iTGBH5hxt5IMo6YwDA_wcQ": {
    "date": "6/5/2016",
    "text": "Loved it.  FYI, the food really can be spicy which I enjoy.  If it's your first time here you might want to go lower than you normally do.  I like it extra spicy so it was fine for me.  Excellent flavor overall.  I was really looking to fill the need for some red curry and it hit the spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "I8nk_rf0BqHVaYrGDLdtFw",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I8nk_rf0BqHVaYrGDLdtFw/o.jpg"
      }
    ],
    "user_id": "Ap0-JqUsibRaVSlTf_HqnA"
  },
  "IuOwT1W1ozDlJBImkgstRw": {
    "date": "2/28/2018",
    "text": "This place is a sorry excuse for Thai food.  We have given it a few tries - hoping it might have been a fluke based on others high praises.  Nope, no fluke.  It's consistently a poor representation of Thai cuisine.  Oh, and the man who took my takeout order last night...rude.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpgE63NussMnGsZRq8rSGg"
  },
  "PsLUW6Il3ycQLXDX3CG4kw": {
    "date": "5/15/2017",
    "text": "OK...I have had lunch here multiple times, and the service has been fair to slow, but the food was good.  That being said, I am rather shocked as to my experience today, when I picked up a called in lunch order.  The lunch bento box meal comes with a fresh roll, rice paper wrapped, with rice noodles, veggies, and fried tofu.  I wanted to order that today ,and realized the option on the menu did not have tofu, and instead listed fresh veggies and rice noodels, wrapped in a rice paper wrapper.  I ordered the Jade roll, for 9.95!!!!    What I got, after a rediculous wait, as the restaurant was NOT busy....  Two rice paper rolls, with a small amt of avocado smeared on the inside and the rest of my 9.95 roll had a few bean sprouts and mostly shredded lettuce!!!!!!! There was not ONE piece of a rice noodle anywhere to be found!!!  Isn't that a major part of a fresh roll at any other establishment????? WHAT A RIP OFF!!!!   I will not be back.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Q4llgQjtq6v7Vw0Ef2d1A"
  },
  "txmqof49EnO3cE1ERA8RWw": {
    "date": "11/5/2017",
    "text": "We walked in 30 mins before close time and they were very welcoming, they mentioned we have 15mins to place our orders however they didn't rush us. Food tastes great we had the combination for appetizer the chicken satay was phenomenal, shrimp pad Thai delicious, and shrimp rolled in egg noodles over a green curry and more shrimp I personally like my curries more on the coconut side so didn't really enjoy the green curry my husband on the other hand loved it. Will definitely go again lots of other dishes we look forward to try",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "s56o_mkw3-LDwCwjFVhdgA"
  },
  "IJ4AcGUW3sJcpcmzhnAPDw": {
    "date": "12/21/2016",
    "text": "They are pretty good. We ordered pad kee mow and green curry. Flavor was good, not quite as rich as I'd hoped, but above average. Food came promptly and service was excellent. We'd return and recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uFYejeUNV1F1ofwftDIMlw"
  },
  "C32qbjDRuvhSK7TBjYhmuA": {
    "date": "8/10/2018",
    "text": "Very good.  Love the coconut soup.  The wife loves the Pad Thai.  I enjoyed the peanut chicken.  PS pay cash and get a discount.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJJUtaBji2YZmpvu9GCEfw"
  },
  "kQQUHgnPpbUUB5lEgwEL7A": {
    "date": "9/17/2015",
    "text": "I believe I have a new favorite go-to thai place! I was set on trying this place ever since I found out that they had pumpkin curry that looked and sounded incredible! I ordered food for pickup through the feature on yelp. Was pretty easy to do, lots of options provided and such! Drove there and when I arrived they said that they never got the order. Apparently they were supposed to be alerted via phone call about the order but it never happened. They explained that the system is new, but good thing I didn't order delivery through that because I would've been waiting for a long time! They had my food ready pretty quick, and the lady working there was nice about everything, handled the situation well. I liked how the restaurant looked, it was dark but felt welcoming and I liked the decor. Not too many people eating there so it was nice and quiet too. I also liked the bathrooms, thought they were super clean and I liked how they looked. The pumpkin curry I tried definitely delivered. I was hopeful because it sounded good, but sometimes pumpkin things can be hit or miss for me. This was absolutely delicious! I had mine with tofu. You can get it fried or soft, I had it soft. Being a wimp, I ordered mild, but I think I'd get it with a tad more spice the next time. It was the perfect portion of food too, not so much that I was stuffed, just enough to be full and satisfied. I will be back when my curry craving strikes again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Gafb2IDQMXvbRvVRKtoWcQ",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Pumpkin curry with tofu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gafb2IDQMXvbRvVRKtoWcQ/o.jpg"
      }
    ],
    "user_id": "18qEoFOVEernpVLh97PQPQ"
  },
  "1M0dwodri7KL2NWBJsqRmw": {
    "date": "1/12/2017",
    "text": "Came here with 6 other friends for a guys night and really enjoyed it. It's a smaller place but they were still able to accommodate us. I ordered my usual dish for trying a new Thai place: Shrimp Pad Thai. They have the standard 1-5 spicy system, so of course I went with 5. This place was definitely on the spicier side of Thai places I've been to. I had to eat fairly slow to make sure I could finish it all, but I did! It was very tasty and quite hot. You can definitely taste the hot ingredients more at this place. Other Thai places have masked the spice flavor a little more, but then again, those places aren't as spicy as here. Now that I've done the 5, I'll probably go down to the 4 for next time.   Tasty food, quite hot, and nice atmosphere. Overall excellent dining experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZE67Ck4gWtJBAN95AKMyZg"
  },
  "kgXrBbdZJmfIJLmgo9bxNQ": {
    "date": "7/3/2015",
    "text": "So I used to go here when it was swaddee.   I've also eaten at all the notable Thai restaurants in the valley.   The first thing I always do is get the Tom Kha soup to judge how authentic a thai restaurant is.  Well, this one rocks and ranks high on my list.  The onions in it were a little different but still very good.  The lunch combos are awesome as well.  I'm excited to go back and try this thai noodle boat soup I've been hearing about.  I had just the right amount of chicken in both things I ordered so don't know what these other people are talking about.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CpuO-YzLVqRG5L-UvwiQdQ"
  },
  "3wJbAIDWCANwt8qXVwxpdg": {
    "date": "1/29/2016",
    "text": "Terrible costumer service. I went in and ate lunch alone (first time eating there) and the waitress took my order, I got the lunch combo which includes the appetizer and entry. When receiving my bill they tried charging me $30, so I kindly brought this to the attention of my waitress and she argued with me back and forth till I finally just asked for her manager, her argument was that she thought I wanted a appetizer and then the entree (although I was ordering specifically off the lunch combo menu) finally when the manager came around she offered 15%. To say the least I'm incredibly unhappy with this place and literally had to pay for the waitress being a retard... Which I'm going to add the waitress was a young American not foreign, we had no language barriers. Lunch combo is I ordered should have been $12.95------Nina put more of your costumer service in at your business in real time and less after the fact. You are only giving the problem attention because it affects your ratings.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "35Jc2C2BZFGiB9o24eko1w"
  },
  "pOpyLofWZvhMF4nZh5YTqA": {
    "date": "10/14/2015",
    "text": "Fantastic!  Pumpkin curry is such a great dish anytime but especially in fall.  Also, I always ask for the spiciest rating available but never get real heat - here, they don't mess around!  You ask for Extra Spicy and it actually is!  Sooo good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wBrHaa0qv22QzDXuJ0gpJw"
  },
  "QQ95Bn6vVxl38ltyNUNLDg": {
    "date": "2/4/2015",
    "text": "We have been dining at Cha Da for over a year now. The food is excellent and the service is generally good. Our favorites include the Miang Kum, Fresh Rolls, Volcano BBQ Chicken, and the Desert Princess. We have, however, noticed some changes since the Chandler restaurant has opened.  We recently took my out-of-town brother to Cha Da after raving about the food. We ordered the Miang Kum as an appetizer and my brother ordered the Volcano BBQ Chicken at my recommendation. Cha Da was out of the Miang Kum and after a long wait, our food arrived without the sticky rice that accompanies the Volcano. We told our waiter about the missing rice but it never came.  As we were getting ready to leave, a late, middle-aged man holding a toddler asked us about our meal. I mentioned the missing sticky rice and the fact they had no Miang Kum. The man's (I believe the owner's husband) response was to look at his son's sweet face! We thought he was joking but he wasn't. So, that night was not great; certainly not the experience we wanted our Chicago-based brother to have. We recently went to Cha Da for lunch to celebrate my husband's birthday. Again, they were out of the Miang Kum. I wish they would mention it being off the menu or take it off the menu if the dish is no longer available. Just as we were finishing, the late, middle-aged man came in. He made the rounds asking about everyone's meals and stopped at the booth adjacent to ours. These poor snowbirds (and my husband and I) listened to this man admonish these people for not staying in town through April, tell them all about Chicago and show picture after picture of his toddler son while talking all the while about how phenomenal his son is. It's sweet that this man is so in love with his kid but it's TOO MUCH. My husband and I hurriedly finished our lunch while the man kept his captive audience. I was facing the adjacent booth and I could see how uncomfortable the diners were. My husband and I wanted to escape before the man came to our table! We think this man is probably a good guy but bringing your toddler around a busy restaurant, table to table, and talking incessantly about him is a turn off. We miss the simpler times when the Thai owner oversaw Cha Da. If it weren't so far, we'd drive to Chandler.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5FPuX9VRbeNCEl4uZSUAmg"
  },
  "nu3Fz2U-X-GBCfeO7tbPiw": {
    "date": "9/12/2015",
    "text": "I know my Thai food. I go to every restaurant that opens within reasonable distance. This place is pretty great.  Curries are thick, not thin and watered down.  All the dishes are flavorful and tasty and the service is great. We enjoyed the twist on the pumpkin curry, the spicy catfish was exotic and pleasing.  I will keep going until they kick me out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qSyEP-TNGfRJQ0K_eByATQ"
  },
  "M-m0C5XntC7OeErXMwKUIg": {
    "date": "8/13/2014",
    "text": "Having lived in Thailand I feel that I know what authentic Thai is and what \"westernized\" Thai is and this place stays True to Thai food. The Kaprow was just as good as I would get from the street vendors in front of my apartment as was the Som Tom. Will definitely be back to get my favorite dishes from back in Thailand. Bonus is that they have perfectly cooked sticky rice",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MLuhKvxpjxMcDtLeqBximg"
  },
  "N9VD0-1uvu9cqiR_vcCg7w": {
    "date": "9/23/2015",
    "text": "Best Thai Food we have found. I live in Las Vegas and none of the Thai restaurants there even come close. This will be my regular place for Thai, every trip to Scottsdale in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0yRkSTeMr7tRI1mb_L8LhQ"
  },
  "r81N7WRjTlHwW3uABWhM9w": {
    "date": "4/18/2015",
    "text": "This is by far the best Thai restaurant in town. The burst of flavors in every dish I have tried is comparable to those at the best restaurants in Thailand. It is not Americanized thai food and is very authentic in flavor and spice so be careful how hot you ask for. The owners are very nice and will not hesitate to stop by your table to make sure your food is to your liking. And it always is!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4J3DCbXx5m5pql1U0b6UfQ"
  },
  "l4X_Bt2b2kF9niMkTaU8QQ": {
    "date": "5/1/2015",
    "text": "Excellent!!!!!  Everything was wonderful, from the outstanding service to the delicious eggplant, to the beautiful decor.  A fantastic dining experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1q1AoXWfBUuXYW547OCZew"
  },
  "VWKi-OQJ44N5ngujaM8ioQ": {
    "date": "4/30/2015",
    "text": "Way too much MSG! My boyfriend and I try to maintain a healthy diet and this left us feeling bloated and toxic within a few minutes after finishing. The food tasted good, and the portion size was enough to provide lunch the next day, which was our intention when we took home the leftovers. We walked around the neighborhood for over an hour and we still felt sick from the MSG. If you try to avoid overly enhanced food, go to another another restaurant. We had to throw away the leftovers and forgo this convenient spot.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3NihN0Xpa-PtqmoOTG8bsw"
  },
  "pwi5NLFv97w4vc0sz6XYTA": {
    "date": "7/18/2013",
    "text": "Had lunch at Cha Da today - in the same location where Swaddee Thai used to be.  The very cute owner said that she just opened 2 weeks ago.  The staff was very nice and attentive, but the food was amazing.  My spouse had Pad Thai with Pork and I had Pad Khing Sod with Mixed Seafood.  Both were clearly freshly made and were sooo tasty.  Absolutely delicious.  They came with soup or salad, and we both chose the vegetable and soy soup.  It had a delicious, delicate taste and smell that I guessed was pumpkin - and was proved correct.  We were both delighted with our lunch and I decided to write my first Yelp review.  This restaurant really deserves to survive!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "hmwUpcIDJqm-jjhy18J90A"
  },
  "YrwIahS8vUygNYZyJoCDKg": {
    "date": "2/1/2015",
    "text": "I am consistently impressed with this place! The atmosphere is perfect, the bathrooms are spotless, the service is welcoming, attentive, and friendly, and the boat noodle soup absolutely rocked my world! This is one of my favorite places to enjoy a meal with my loved ones!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gDs-wItvhq8INcAfte4Udw"
  },
  "lJ1wUMp1NhTJ-jeq-YgMew": {
    "date": "10/19/2014",
    "text": "Great lunch spot. The combo lunches offer good variety of entrees with great accompaniments. Soups are excellent. Ingredients are fresh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NDjDy9tJIOKO7OIIPbV8Iw"
  },
  "8YVQOpztlMW1E6h7xviq8w": {
    "date": "8/22/2013",
    "text": "The new owners have made a very positive mark on the place. Updated the decor, the service is still very good and the food is great. An expanded menu and everything we have tried is excellent!! Happy to have them in our neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RISt9CxG0DwgVt5WTDAlEQ"
  },
  "IAp544VFhiSBEybgc-z5JQ": {
    "date": "10/23/2013",
    "text": "Great food and service. Clean place. I wish they could make better thai iced tea, that is the only thing I don't like in this place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AZOq7eC9Ljj9tEghyQP0ig"
  },
  "l390co-cGy9KdDrDjUhcpA": {
    "date": "8/2/2014",
    "text": "Cha Da Thai is incredible!!! Not only is the food exquisite, but the staff there is generous, accommodating and genuinely cares about your dining experience. The manager Kevin even let us try on a Cha Da (Thai crown.) The Tom Kha is some of the best I have had in the valley and I would highly recommend this place to anyone in the mood for Thai!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yCakwxO_gPY5atjy2Uzlmg"
  },
  "ntIcNSiYBL8H1xn7WaIQdQ": {
    "date": "4/18/2014",
    "text": "Food was excellent and the service was very good. Enjoyed the fact that the chicken was white meat and the beef had no fat. I will definitely be back. My wife and I just moved from California and were looking for a new Thai spot and we found it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nhcFg7NY9ioDYyo3iwLPNA"
  },
  "d0SWFSM8eNVSwZTqfWkgPQ": {
    "date": "12/26/2013",
    "text": "My family has decided to forgo the North Scottsdale excuse for Chinese food for a Thai dinner for Christmas Day.  We found Cha Da Thai on Yelp and are we glad we did.  The food was excellent and the service very friendly.  Don't follow the driving directions on Yelp. It's a simple and easy location to find on the south side of Via Linda, in the strip center just west of 90th St.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sEuROdpQuOYDlitO1phcpw"
  },
  "tb1Nkdw-CVm3jDCucm7n9A": {
    "date": "2/6/2014",
    "text": "Excellent authentic Tai cuisine.  Loved the spicy shrimp.  the fish is light and cooked to perfection.  Great staff and service as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mFWL2Asutdbc_qHJ0cBB1g"
  },
  "jQo5RYo7flJUVBQppI7A-w": {
    "date": "1/7/2014",
    "text": "Very good Thai food, best I know of in the area. As of summer 2013, new owners and cook in the longtime location of Swaddee; a big improvement. Understaffed and slow on one recent visit, fine on another.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-fTjxZ08bDFbQ281tvQLUw"
  },
  "w1PxYrFPVz_8Vc-eiirrpg": {
    "date": "2/15/2014",
    "text": "Excellent service...fabulous authentic Thai food...friendly hospitality...wonderful decor...five star greatness!!!!!  This was our first time at Cha Da Thai and we will be back for sure!!!!! We started with the Mee Krob and Tom Kha Soup with Chicken. Then, we had Prik Khing Salmon and Gaeng Garee (Yellow Curry Chicken with Potatoes and Sweet Potatoes) for our entrees with brown rice and really sticky rice!! YUMMY TO OUR TUMMIES!!  On our favorite restaurants list!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7sNaTLNAN-qDQtVyp6ASBg"
  },
  "E1RfJ07VALMb-U7GNaVvtg": {
    "date": "8/9/2013",
    "text": "What's the best you can hope for when you think of authentic Thai?  I envision a small space with the family running the business.  Parents in the back preparing traditional recipes the way they learned.  The owners customer facing and hustling to make sure every detail was taken care of and the meal was flawless.  Look no further than Cha Da.  Nina, the owner is as intoxicating as the food being prepared by her parents is in the kitchen.  My party had 8 of us.  We had 10 dishes.  ALL of them were absolutely delicious.  Curries, vegetarian dishes, seafood, salads, and traditional noodles dishes were passed enthusiastically around the table.  The service was attentive and efficient.  The beers were cold.  YUM!  For a new kid on the block, Cha Da has it going on.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "pUgy_6ubOyNCM1eJZkRuEQ"
  },
  "bcVjYkfLd2bfWe-el3CExA": {
    "date": "6/11/2016",
    "text": "I was excited about trying this restaurant because of the reviews. Unfortunately I was very disappointed.  I ordered the coconut seafood curry and the sadly the seafood was way over cooked.  The calamari was tough and chewy, the mussels were so tough I couldn't eat them and the crab or whatever it was, again, extremely over cooked.  The staff was pleasant but not attentive.  Had to flag down waiter for water never got the rice that I was included. There was something  gritty hard and  unchewable but could identify what it was I love the flavor so of the sauce.  My friend ordered 58 and she loved her meal. I won't be going back...too bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jaaxXR_RCtlqsJJjF0xvSA"
  },
  "6aKvEwv1Va1mdfRw_X1eWA": {
    "date": "9/13/2014",
    "text": "Burp. Really enjoyable food.  Generally don't like Thai food but they converted me. Great service and fantastic food. 5/5",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXtA_RPbZqIZ7wrh8L8AJw"
  },
  "RXBLfa9Ai5i0GxKdacMW2A": {
    "date": "12/25/2013",
    "text": "Best authentic Thai restaurant!!  I am from NY and my husband is from DC and has been to Thailand many times and we can say- without question- that this is the best Thai restaurant in the valley!! The spring rolls were some of the best I have ever had anywhere! I then had the chicken noodle soup and my husband had the duck noodle soup and we loved it. We finished with fried bananas and coconut ice cream which was the perfect end to a magnificent meal. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mDP1idXQ-w-91ZLY9Xr5Bg"
  },
  "2s-azuGvOHwlML7SXr41Tg": {
    "date": "1/9/2014",
    "text": "My experince at Cha Da Thai was wonderful !! Food was fresh and great service was very good ! if your looking for a Authentic Thai food this is the place !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "A46jE0faqumZVJ_buOAUYg"
  },
  "sXYMrfUU0dUXPZX1xUkOtA": {
    "date": "7/27/2014",
    "text": "Excellent food and stellar service. Great ambience is well. Kevin was humorous and insightful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TTGADveE_wyitOxQq4ZTXw"
  },
  "4NwyLo_9pKD4vUNORU0RZA": {
    "date": "12/22/2013",
    "text": "Having been to Thailand several times we can say that this is the best Thai restaurant in the Phoenix area. The food is authentic and outstanding, the staff are friendly and very professional. Kudos to Bussara, Wanvisa, and Tanarak. Everyone must try this restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O94rc7mx194dV8LwSnz6lg"
  },
  "3_17giSqgxKhDpcdQUADfg": {
    "date": "2/23/2016",
    "text": "Love this place. Been here about 5 times and always delicious. The pad thai, fried rice, eggplant with veggies are all excellent. Curry very good too. Cute restaurant with friendly staff. Our favorite Thai place in Scottsdale area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iAaoj4bupaoIR-4DFer3nA"
  },
  "2PAgYX02BmNH0pVzmAUXhQ": {
    "date": "2/9/2014",
    "text": "I stopped by to do a take-out and the place was nicely decorated, very Thai I must say and the server was very friendly and helpful.  I placed my order and the lady behind the counter was so nice and so helpful and so informative.  She also had the cutest little Thai pants which she told me came from Thailand, of course.  I ordered tom ga kai and tofu panang and requested mild spice.  The tom ka gai was mild and loaded with veggies, very yummy and was tasty. The tofu panang came out spicy!  I couldn't eat it and my nose was running and my tongue burning!  Guess it is hard to make curry not spicy???  They have an extensive menu and the people here are super nice and helpful, has a very homey atmosphere to it!  Met the owner, Nina and her mom!  Cute family..  Give this place a try!  They're more friendly than other Thai places that I've been to...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "msbNF-OYhHH6FJ_oQy1-cA"
  },
  "JK-SInV53lEy5R-Z38GXyA": {
    "date": "2/3/2017",
    "text": "use to love this place. i order the food through door dash delivery.the  pad thai noodle was extremely overcooked, so i can't even  grab the noodle with chopstick. i also order the tom yum soup with chicken. there is no soup but bunch of other food in there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a5EnE7cVQGYD0xe9n76C1A"
  },
  "tZxL-NFsGPzULNVGi6WxMQ": {
    "date": "10/8/2013",
    "text": "I've had lunch twice now at Cha Da Thai and it's been deliciousl The Pad Thai was excellent, ambience is lovely and the owners are welcoming and friendly.  This is definitely a new favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P4iIc7vqCaB0qzpkL1Ydig"
  },
  "zVq1rRdr9kAkfdvUSxpW0w": {
    "date": "8/14/2013",
    "text": "Yeah pretty legit Thai.  stopped by for dinner, had the pumpkin curry cause it sounded different.  ill definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EYztRSWiTFEWK1XstBfOuw"
  },
  "IL3kSqIp2O5lK3mZ5xkSXw": {
    "date": "1/25/2016",
    "text": "Ordered take out based on different reviews. Staff is friendly, but the pad woon sen noodles were dry and disappointing. The egg rolls were greasy. Our beef dish was tough. We were very disappointed and won't be back. Oshawa Thai is so much better. Swadee Thai in Chandler is awesome as well.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Wl9MkZOsylKYrEVNGBEjw"
  },
  "KNAv_tHcYt9LllaZsSwreA": {
    "date": "2/19/2016",
    "text": "Fast,  friendly,  and delicious! I've been looking for a good Thai place, and now I've found it! I had the peanut chicken and my daughter had the pad see iew. Both were excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fis_X9DOJ9fUQxFXkA0BJw"
  },
  "E2GSsNkNAhiPbMcaeT5iXA": {
    "date": "1/2/2015",
    "text": "This place is solid. It's not in the same league as Two Sisters Thai or Sala Thai in Phoenix (and I wouldn't call the flavors \"exceptional\" as other reviewers have - I would call them slightly above average), but I go there regularly since it's close to where I live. It's more authentic than a lot of the trendy Asian restaurants in Scottsdale, so that's a plus. One caveat: if you walk in and more than half of the tables are full, LEAVE. This place is not equipped to deal with a full house.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "AgSlz7LgDWTAdWadVDltEw"
  },
  "XZLJ9H8nyQYjufqacNybuw": {
    "date": "6/28/2015",
    "text": "Based on a quick look at reviews tried this place and my first time was a carry out order placed via phone. I showed up paid via credit card for 2 apps and 3 entrees. When I arrived back home (15 min drive) and unpacked the stuffed full bag I found that 2 of the entrees were missing. I called back and informed the person who answered that I did not get my entire order and she proceeded to tell me that she cooked the order and I got it. We ended up arguing (she was very rude) and she said she would call me back. Call never came so 20 minutes later I drove back to the restaurant.  The waitress inside apologized and said she gave my order to someone else. I asked to speak to the manager and the owners husband came over asking what was the issue. I explained and then the owner (his wife) came from the kitchen with her young son in her hands (would anyone want a young child in a \"professional\" kitchen where their food is being prepared) and was ready to continue the argument. Husband basically asked her to go back in the kitchen a cook the two entrees that were missing. She was totally rude.  About the food, the Satay and fresh rolls were very very good. The one entree that we got and I ate was a duck dish that was very fatty, duck is somewhat fatty, the flavors were fair and the amount small, for $15.00 not worth it. I cannot comment on the curry dish or the other entree as my wife had already finished the fresh rolls and did not try either one. She did comment that for $14.00 the curry which had chicken looked sparse.   As I logged in this morning I noticed other reviews about the owner and would suggest that she avoid all personal interaction with customers either in person or on the phone. She obviously has a problem. This is going to be a one and done for me, will check other Thai restaurants in the general area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oD0KG1O2g_xcLf9Fr97ALQ"
  },
  "7_9rHpmjlK3mDygWEebLmQ": {
    "date": "12/8/2014",
    "text": "I was looking for a good Thai option near my Scottsdale office last week when I stumbled across Cha Da Thai. I ordered the chicken panang curry - spice level: medium and an iced tea. I placed my order over the phone and picked up my order to go. Food was very hot and fresh when I received it. The curry was absolutely fantastic. Wonderful flavor, great texture, adequate portion of chicken. Although I read previous reviews that the medium spice level was very hot, I did not find that to be True. Perhaps it was the amount of coconut and peanut in the panang that counteracted the spice, but I found the medium to be perfect. I also loved the iced tea. I am not sure what kind of tea it was, or what flavors may have been added, but it was perfect! No sugar or sweetener, just a nice, almost fruity flavor, unlike any tea I have ever had. All around a great experience. Curious to try some of their other dishes and see what their dine-in service is like.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Dx2gQSFHsM4fpclrBV3d0A"
  },
  "ltk_baPkeuDZxUdT3egYpw": {
    "date": "5/1/2014",
    "text": "Stopped in for my birthday and had a great dinner. Food was excellent as well as the service. The owner stopped by our table to make sure everything was perfect and talked to us for a while and told us his story and introduced his young son. It was a wonderful meal and a great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "88Uisnp0UCbFTaFBeQ7xVg"
  },
  "S2KvNhiIAOZmr4SD9BHY5A": {
    "date": "6/27/2015",
    "text": "Cha da was highly recommended by our yoga studio and it did not disappoint.  The restaurant is very quant and decorated nicely, not thrown together like most other similar restaurants .  The service was very attentive and the food was very fresh.  We will definitely be back.  Thanks for the great experience,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cF0T8O_DZ3jf-fvqwhYYYA"
  },
  "ilgwDJ-hC7U8j18qi_mWPw": {
    "date": "9/5/2018",
    "text": "Oh, man. This vegan just found her soup noodle vegan cheat, the few times of year I'm going to eat meat: Boat Noodles #1!!!!    It's insane how good this is - the broth has a depth that only comes with good bone broth and slow cooking.  Apparently it's the owner's mom's recipe; it's obvious there is someone behind the recipe.  I've never seen my mom drink pho broth, or any broth from a restaurant because she usually finds it unhealthy and full of MSG but she gobbled this up.  She ate every piece of meat, every noodle, and drank half the soup.  She ordered the boat noodles with the al dente thin rice noodles, which came recommended. The meat was perfect - mom got no meatballs substitute extra tendon.    NOW THE TENDON is the best tendon I've ever had in a restaurant.  It's the perfect consistency.  It's chewy without being tough or too gooey, and the flavor lingers in your mouth. I actually reminded myself to eat it slower so I could taste it.  Good food is food that you can taste slowly.    The boat noodles are at least as good (if not better) than any pho I've had.  It's my new fave here.  And I LOVE the panang curry and the pumpkin curry (which are probably too similar to get both of). Since not eating animal products, I've become extremely picky when I do eat it - most of it just doesn't taste good anymore. I love how many vegan options there are here...it's our favorite Thai place in Phoenix.  We'll be back again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pX8BY8NVbla6Uzg3QIOe-w"
  },
  "W98k4bjlQZdpLLMuzzTSMA": {
    "date": "3/14/2019",
    "text": "Ate here a number of times since my first time a few years back and I have been very happy with the food and the service. Boat noodle very similar to those I've had in Bangkok.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJA3QAy2uHKC6uqt0kl7rQ"
  },
  "ZsxYOYKBjdDaljDxL6aPbQ": {
    "date": "6/3/2019",
    "text": "Food here is delicious. I love the drunken noodles with the soft tofu, and the fresh spring rolls with avocado. The staff is super nice and it's cozy inside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "66RoH5hbSvl_tPa-YCfOjA"
  },
  "mgBdeFU91wlMbdlljwswvQ": {
    "date": "3/2/2019",
    "text": "My go-to Thai food place. I can only comment on the Pad Thai and Green Curry because they're both so good I can't order anything else!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAJ-5okN8jVXfU9wSJrq1Q"
  },
  "cmOnFWG5kwDymfYMYl0scA": {
    "date": "3/22/2019",
    "text": "Have been 4 times and each time the food has been great. One of the times they were incredibly busy but they were literally trying to do their best and still came through. Right near my house so really convenient. Has become part of our regular rotation",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CRI9pS-F4wMxLhzyGUel7g"
  },
  "NWr9ZqZHaKWt3J_zlkXpLQ": {
    "date": "11/30/2018",
    "text": "I love this place!!!  We are vegetarian and love the vegetable pad thai and the spicy fried rice with pineapple.   The spices are SO GOOD and the portions are great:)  The owners and girls who work in the front are so friendly and the place is really cute inside as well.  So glad this is in my neighborhood....I could eat here every night!!:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mezHR-FOdO1zH5T40EPuxA"
  },
  "6-OOFG4sUgxZMo3CqcxnCw": {
    "date": "9/28/2018",
    "text": "Let me tell you that I know what good Thai food is and this is the best Thai I've had in a minute . They have Thai papaya salad with marinated raw crab that's not even on the menu you have to ask for it . There larb was super tasty but my only complaint is that they used regular lettuce instead of cabbage to eat the larb with ? Definitely taste better with cabbage , thus is why the 4 stars and not 5 . For my main dish I got the green curry and wow amazing . Also This place is SPICY like actually spicy . Probably the only place that makes it this spicy . I can't wait to try the extra spicy the next time I go in!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "svKDPpDu89QZ-cSaK8cGuA"
  },
  "aI3Rug-8m90yQyHOJnpNog": {
    "date": "5/24/2018",
    "text": "I ordered online via Eat 24 and the food was ready on time and piping hot!  I ordered the chicken pad thai, pineapple fried rice, and pumpkin red curry.  Overall, delicious.  The pad thai is on point.  I am an avid Thai food eater and this was the perfect blend of savory, sweet, and the hint to tartness.  I don't like my pad thai super spicy, so it had a little spice, which was just enough for me.  I don't like they put the peanuts behind the aluminum so it makes it hard to put into the pad thai, but I understand for people who have peanut allergies.  The pineapple fried rice was so delicious, except it had NO PINEAPPLES!  But it was still an excellent fried rice without the pineapples.  Finally, the pumpkin red curry was the most disappointing.  The flavor was ok, and the pumpkin didn't really add to the flavor much.  Because the pad thai and fried rice were so good, I'd say it was still a good meal overall.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oAGrdRK2RJD2_cBLsD5N8g",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Pineapple fried rice WITHOUT the pineapples",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oAGrdRK2RJD2_cBLsD5N8g/o.jpg"
      }
    ],
    "user_id": "aLtvIGucNiiC1bIuTLpmqQ"
  },
  "RDgasnnzUfZBUQqBQvIw-A": {
    "date": "8/9/2017",
    "text": "This evening my co-worker suggested we try this restaurant because he likes Thai food. After checking it out on yelp, I figured it was worth a try. I think they were a little startled when we walked in but in their defense, we are police officers in uniform so they probably thought something was wrong. I quickly put their mind at ease and said we were there for dinner.  Both of our servers were very kind and attentive. I don't eat a lot of Thai food but our server was very patient and made a great suggestion, which was #67 Kee Mao with chicken (#3 spicy). My friend ordered the Pad Thai.  Are usually don't rave about ice tea but theirs was very smooth and better than I have tasted in a long time. They we're always quick to refill our drinks without asking.  Both dishes came out very quickly and the presentation was great. The flavor of the food was fantastic! I will not hesitate to come here again both on or off duty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xEhHQ9mgMGC1ZBpFeF4jhg",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xEhHQ9mgMGC1ZBpFeF4jhg/o.jpg"
      }
    ],
    "user_id": "U_XbeK2PwtsXZt8ZQIZWvw"
  },
  "kL7G02CLguBte0SIxGcrTw": {
    "date": "4/28/2018",
    "text": "Food was so good! But the service... not so much. They're very forgetful and unorganized. You have to ask at least 3 times for something needed. We ordered the Thai tea boba at the end and. She said it takes 4 min. 15 min goes by, and I ask how much longer and what do you know, they forgot. 4 stars for food only.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9D0jZTGaL9R7xufJIzzypg",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9D0jZTGaL9R7xufJIzzypg/o.jpg"
      }
    ],
    "user_id": "c1UKBIAv4EsrfKAdjY2I9Q"
  },
  "dU28YjboF8Tf9VzMFXpuKg": {
    "date": "10/28/2016",
    "text": "The BF and I do enjoy the Thai Boat soup here!  We have tried other items on the menu and they are good, but we tend to favor their soup. It's a good portion and the broth is tasty!  They are very friendly and the restaurant is clean!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oqh6LkUP43tYDaqOS7E7cQ",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Thai Boat Soup w brisket and meatballs and egg noodles.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oqh6LkUP43tYDaqOS7E7cQ/o.jpg"
      }
    ],
    "user_id": "2hPB83XGvb3InsZQwAHmUw"
  },
  "mwldignYeobl9Ln2BpKLXA": {
    "date": "12/5/2018",
    "text": "Excellent food, excellent atmosphere very authentic Thai.  Great people.  Will come back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h6lO_BZYeodeAofrklsHdw",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Special fund raiser",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h6lO_BZYeodeAofrklsHdw/o.jpg"
      }
    ],
    "user_id": "YY0k_DVe-pJZNpLonA3pFg"
  },
  "wYL9aNVv0e-Cdcbr9a_R9A": {
    "date": "6/7/2018",
    "text": "I got the red curry tofu with the tofu deep fried and made crispy along with the jasmine rice it comes with. I was asked if I wanted soup or salad with my $8.95 lunch special. I asked for the soup and was going to give it to my girl, she asked for the salad. The server came a minute later and said she was out of salads at 1:38pm in the afternoon and brought us 2 soups. I wasn't in the mood for soup but the coconut soup looked good and since there was 2 I figured I'd try one. It was amazing! I immediately went to the menu again to see if I could order a bigger portion of the soup to get to go but I didn't see it on the menu. The red curry tofu at a level 3 of spicyness was really good. I just wish the portion was bigger. Maybe next time I'll try the dinner size if it's bigger. Great food and service, only knocking off a star cause the portion could have been bigger.  I will be coming back to give them another shot in the future. I like that it's 5 minutes away from my job.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "aeuo-PdHqd4IQSoH-Kueyg"
  },
  "vKmQa_J67iLHzMHD4PPisg": {
    "date": "9/14/2018",
    "text": "Came here for lunch today first time for my bf and I. They were full but was seated right away, water came on time and order came out fast. A couple of things that irked me was the service no one came by to the table, there was a man (bus boy, servers assistant or maybe owner) who brought food out filled up waters wearing a sandal, really a sandal? I didn't like him seemed rude or as he calls it \"a sense of humor\". The food was adequate, thai tea was decent and good thing if you pay cash you get 10% off. Go spend money elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Fq5GYqeBRWxePSgng3AvQ"
  },
  "tU_BYZ4wZSHKuZorOOuR5A": {
    "date": "8/30/2018",
    "text": "Excellent service amazing food could I say more? I've been searching for an authentic Thai restaurant since I moved to Arizona and I finally found it. Hallelujah!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-PWQGXpggw-BTa3Kc4u4uA"
  },
  "Z5ORaVhHD0JQeIcGBwYU_w": {
    "date": "2/11/2019",
    "text": "Casual authentic feeling Thai restaurant.  The food is great and everyone who works here is very friendly and they really make you feel welcome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6VE9CaDyjA7mZOY_kGNfQ"
  },
  "Kn1VXrnyPdeGb7Y6rkLeXQ": {
    "date": "4/23/2017",
    "text": "Loved the food, ambience and service. We're vegetarian and found good options on the menu. The Veg version of the Pad Thai and Panang Curry had amazing flavours. The Veg Spring Roll was crispy and tasty. The Home made Coconut Ice cream was mindblowing!!  Service was great and the ambience was very traditionally influenced. Enjoyable dinner",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TEjb2V5B_nMKSnjLUiQVLQ",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Vegetable Spring Rolls",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TEjb2V5B_nMKSnjLUiQVLQ/o.jpg"
      },
      {
        "img_id": "oXxXLbtpWNEoJ5ZG5juCnQ",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Veggie Pad Thai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oXxXLbtpWNEoJ5ZG5juCnQ/o.jpg"
      },
      {
        "img_id": "RHVHXqg4Hh1PWdgMG5aR0A",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Veggie Panang Curry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RHVHXqg4Hh1PWdgMG5aR0A/o.jpg"
      }
    ],
    "user_id": "-iGO8sRXF61OgrJ6Zn5WHQ"
  },
  "jjnX2S5VZRXRW7zUqRB8RQ": {
    "date": "12/31/2018",
    "text": "I came here for the yellow curry chicken and fried veggie spring rolls (TO-GO lunch). I've been here a few times for lunch. Food is very good, customer service is good, and prices are reasonable to other Thai places. Come check them out. They're located at end of small strip mall (same side as Carwash -89St/Via Linda).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r1pxrbmSB1Krx3Kx13w-Eg"
  },
  "8qvs3WJTJmhvM1D3d23LCg": {
    "date": "7/27/2018",
    "text": "Great Thai food especially if you like it spicy.  The service is quick and the employees are nice.  Only reason I am not giving it 5 stars is because they only have one delivery driver and only some of the times.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jqj1iXNVyRYy48iitp6Fsg"
  },
  "2QdbXf9yQtHZI87B1HhUwg": {
    "date": "6/6/2018",
    "text": "A nice and quiet Thai place that offers a delicious menu and fantastic service.  Great place to have an unrushed and relaxing meal.  Highly recommend the pad Thai...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6nFKWJd9qUw-Hyw1e7Kug"
  },
  "QGsWVPUBPgzobh7S2GxogA": {
    "date": "8/31/2014",
    "text": "Out of the dozen or so Thai restaurants we've tried in Arizona this is one of the best. Mee krob is among the best I've tasted. The fried rice and Pad Woon Sen were first class. Will be back to try other menu items but was very impressed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wkEUf5hrjbR0MfTgZU8eVg"
  },
  "jIsfj-zGDrAEbXLoyTv-Bg": {
    "date": "4/1/2015",
    "text": "I came back to try the boat noodle soup and it was very good.  The owner is also very friendly and I chatted with him for a while.  Service is a little slow, but all in all this is a nice place to eat with pretty good food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0Bw1q4XNjxyqyl4Ncfj9A"
  },
  "c-LXxxd8Rc1qd7VrharWrQ": {
    "date": "12/7/2014",
    "text": "Went back again but food and service was terrible this time , totally different from  the last time we were here. Wait staff hardly can speak proper English and they weren't attentive and unprofessional  and food were totally different. We were sitting close to the kitchen and we saw a Mexicano cook. So that's explains it why the food is not authentic ,,,,,,  Very very disappointed will not,recommend to any of my friends and never come back for the 4th time. This is a joke btw ambience looks old and worn",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iIUNUjkIoq0-IZjtIN-hEA"
  },
  "JPECIIjEwIA5zvbLKSGIfw": {
    "date": "6/13/2015",
    "text": "Good food.. Very authentic.. Nice people.. Must visit..  One of the best Thai places I've been to",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rRuxjYXe46g-petkoIcJeg"
  },
  "3ieAUA8-uzAcOGOYatFRNw": {
    "date": "9/3/2014",
    "text": "My husband and I recently discovered this place and love it! We love Thai food and have eaten at many Thai restaurants, but  this one is our favorite! We have tried several noodle and curry dishes. The pineapple curry & pad Thai are both amazing. The staff is extremely friendly and welcoming. I would recommend this place to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wiLB0CJDMcbl6OPUrOhA9Q"
  },
  "AQFRx_5hm80lrDRdUOwRvA": {
    "date": "4/25/2016",
    "text": "I came for the Boat Soup, but stayed for the curry.  Having had my curiosity piqued by an article in The Phoenix New Times about their Thai Boat Soup, I tried it, and loved it so much that I crave it almost every week.  For a change, I tried the Yellow Curry - as good as, if not better than any I've ever had.  I like things hot, and they have that special knack for making things just hot enough so as not to overpower the flavor. I go there often.  You should, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yzVltsz9SJcmuru75CSbjg"
  },
  "9rmNvKAXLnSD4NcpysLpnw": {
    "date": "5/18/2015",
    "text": "This is some of the best Thai food I've had.  I am a freak for  some Tom ka soup and very perticular.  The Tom ka her is every bit as good as malees which says alot because that stuff is a religious experience.  Nice work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hZJzx66yQ3J01xYtPmZb0w"
  },
  "m1g1ErcDdhOu9eEhmrM9LA": {
    "date": "8/2/2014",
    "text": "As I mentioned the tom kha here is wonderful!   Its not on the menu but you can add shrimp too!  All sides come mild, medium or hot.  Go for medium,  its full of flavor & some heat :)  if you really like hot just ask them to bring extra hot on the side.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E5s7RRDFN34iuo8mAFwFIw"
  },
  "V5Cvhnrx9urOgBXiZPZcwQ": {
    "date": "7/11/2014",
    "text": "Love this place! A great family-run Thai restaurant with super flavorful dishes. Everyone is really nice and attentive, you can tell their hearts are in it. I've had a number of different appetizers and entrees and they've all been great so I don't want to single any out. Just pick your favorite one and something new and enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7WDC5sJvjWbnvhGFZyyJQg"
  },
  "XyjfMfpU9ggLNniBfm0NaA": {
    "date": "9/24/2015",
    "text": "Very good food! Came out in a timely fashion. Waitresses are a little slow but very nice. Will be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I-uSeBNZYnLrjZDOIIsLOg"
  },
  "ze849Y1imRK59uhyDK3wJQ": {
    "date": "8/18/2014",
    "text": "This is a review strictly on their food alone.  Having spent a decent amount of time n Thailand, and spending half of every paycheck on Thai food, I feel qualified to say that I really think the food here is authentic.  This place more than any other in Scottsdale reminds me of the food I've had in Thailand.  The actual place is a little divey, although charming with its authentic Thai sculptures and knick knacks.  Great place to take out from.  Pretty good place to eat at.  Pro Tip: Use cash and save 10%!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8y1a0V_Jrc1xsFzMaEAUzw"
  },
  "hBzj5oa_J8dGIm2tYhcXIA": {
    "date": "8/16/2016",
    "text": "We were on vacation in arizona and found this gem.  My wife is thai and we are always on the hunt for some good thai food... this is the place.  The food was great, service was good, and the owners are lovely.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iNLtrXao1cTIy8jrdyDEZA"
  },
  "FOVJ6jLUSjIwCTkeR81XDw": {
    "date": "7/29/2014",
    "text": "This is a great little restaurant!  It is small and well decorated and friendly for a causal dinner.  The staff is well informed on the menu and can easily recommend dishes that they love.  I had a noodle bowl soup, it was served in a gigantic bowl and was very flavorful.  I also recommend the Thai iced tea, it was some of the best that I have had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cf0RTGy7wWDLOvjK_VT6Bg"
  },
  "mO4bSKscEY7M6TmWsDfotQ": {
    "date": "1/22/2015",
    "text": "Had the Cha Da lunch special.   Spring rolls are nice and fluffy but had too much lettuce and not enough substance. 2.5/5.   Clear soup was very flavorful and had bite sized bits of onions which were pleasant. 4/5.   Pad Thai had great flavor, the type of flavor you expect your Pad Thai to be. But the portion was just too small and fit in a bento box cubby. The plate had 3 empty cubbies which just reminded me of how small a portion my Pad Thai was. This made me sad. 4/5 for flavor. 1/5 for sadness.   Panang Curry was delicious and I would recommend this to anyone. 5/5.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ztKnTNiL9LY_N6fa_Li8RQ"
  },
  "BSJD_0tNsNLBUwn-cZpcYQ": {
    "date": "6/17/2014",
    "text": "Had the kapow for lunch, hot. Was good, but nothing exceptional. Would try one more time to see if alternative dishes are better. Service was good, friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2edscMTl-Rsj6LXd0ouWIQ"
  },
  "3QmvcwD8k7weg0ZOcephOQ": {
    "date": "6/26/2016",
    "text": "Very authentic Thai food! Excited I found this little restaurant.. I ordered pad Thai with chicken and shrimp for take out. It was very tasty except I ordered it Hot.. It was very hot! I will have to order mild next time to fully enjoy the flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yb69imMANqfluctYJkCw7w"
  },
  "2TVpzqOW1IOj3xTRxZa2Bg": {
    "date": "10/15/2014",
    "text": "I went back when I was in Scottsdale a few weekends ago and ordered the same things and was not charged for the crab rangoon, thanks! Ordered the mild version of the duck kee mao and it was perfectly flavorful and not greasy, would come back again when in Scottsdale!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kkrJPRxdUme47_ZbSwGVDg"
  },
  "VH4Bm2CmeFF5xPFchsVMrQ": {
    "date": "7/9/2016",
    "text": "I am a Thai food junkie and this is the place to go for Thai food in the valley.  Yellow curry, Pumpkin curry are wonderful. We also always get the satay and Pad Thai.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2N993QUZVeaZN4AdBv0Esw"
  },
  "1aaWf7iVvfOHTQ8hqNLv_A": {
    "date": "7/4/2016",
    "text": "Favorite Thai place in my neighborhood. Small local feel with great Thai food. Awesome value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BU_rORjaufKz24_n_DwP6Q"
  },
  "6JNkaeeQIYxYNGCzqxxg7w": {
    "date": "10/11/2014",
    "text": "This is my 2nd visit to Cha Da in just over 24hrs! I came here for lunch and ordered the Special Pho #2 with roast pork, Chinese broccoli and thin rice noodles. I ordered the spice medium which was as hot as I could handle. The broth was so tasty and for a Thai restaurant, this was absolutely the best Pho I have ever had. It's also what drew me back once again. I am sure their other dishes are equally excellent. I will be back again very soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6kz_Uh87FVfCsrJup0Ljkg"
  },
  "MUTSxoSnhD303glNTO7QFg": {
    "date": "8/26/2019",
    "text": "My friend and I decided to try a Thai restaurant in the Scottsdale area.  When we entered Cha Da, a server noticed us, and sat us down within seconds.  The server gave us plenty of time to order, and was very receptive to the questions we had about certain dishes (since we both have dietary health restrictions).        We started off with a Jade Roll; without a doubt, not disappointed.  The roll, itself, was crisp, and all the veggies were fresh. (I loved the hint of nori and mint.)  A few minutes later, we received 2 dishes of Glass Noodles.  The flavors were indescribable.  I never had any food with such superior (incredible) flavor!      Furthermore, the very pleasant server constantly refilled our glasses, and would ask \"How is everything?\"  Of course, everything was A-1.  When she asked us if we wanted any dessert, we had to politely decline.(The serving portions we consumed, made me feel like I was about to give birth.)      Without a doubt, I will be back.  Thanks again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "77WSKfTdgCr4TnH3YUvrYw"
  },
  "Ta_zxYy-N_7H5wtkvSCGJg": {
    "date": "4/16/2019",
    "text": "I used to come to this restaurant couple time when it was different name.  Came here with friends for dinner and it was good.  The service was good and the staffs were very friendly.  I had sauteed eggplant with tofu it was delicious but my black mussels Hoi-Obb were OK.  My hubby had papaya salad and sticky rice, it was decent.  Our friend had the fresh rolls/spring rolls it was huge and OK.  We will comeback and try something different next time.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "otvUrTT2PAyFfmY8bYFV4w",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Blue sticky rice and mango heart shape",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/otvUrTT2PAyFfmY8bYFV4w/o.jpg"
      },
      {
        "img_id": "FQpEthhrJ1fcr6ZDJ9H4_g",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FQpEthhrJ1fcr6ZDJ9H4_g/o.jpg"
      },
      {
        "img_id": "RqkdzHzDw2szenFIHTtOzw",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RqkdzHzDw2szenFIHTtOzw/o.jpg"
      }
    ],
    "user_id": "LP883AysBJqOAIzQnIvqnA"
  },
  "5h00yBBJJ5_QcedDkE-5CQ": {
    "date": "3/19/2019",
    "text": "Old school decor!  Popped in for the red curry lunch special. The soup makes it worth it! All the flavors for the dish are there and they're perfect. I was hoping for a bit larger portion but it was perfect for a lunch. YUM!!! I guess I'm just a glutton! I ordered medium spice but I think next time I'll amp it up. Service is spot-on. Location is quick and convenient. So now Cha Da Thai and Thai House are the two top Thai places in N. Scottsdale in my opinion. There's another Thai restaurant across the street. Don't EVEN bother. Oh and the to-go box is tasteful, re-useable, and microwaveable! Re-use it, people!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OXovMZGfirWCPzUYptSPSQ",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Red curry lunch. Dine in for the soup, or maybe have the soup while you wait? The smart to-go box is re-useable! DO IT!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OXovMZGfirWCPzUYptSPSQ/o.jpg"
      }
    ],
    "user_id": "F3xsFydNSwKWgLwGMO0NOw"
  },
  "JcEJsMo9JMal82k0RH5hHw": {
    "date": "6/25/2019",
    "text": "This place gets 5 stars all around today! Awesome service, delicious food (I tried the red curry with their house soup and an iced Thai tea). Great little lunch spot. Presentation was nice especially since I wasn't expecting that for a little family owned spot. Decent sized dining room. It gets packed at lunch but there were one or two tables still available and they seated us quickly, immediately dropping waters off (maybe to avoid passed out customers from this AZ summer heat). I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rO51ljbSwPyD2-1Wz-dBSw",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rO51ljbSwPyD2-1Wz-dBSw/o.jpg"
      }
    ],
    "user_id": "iZ5UFSqCxxiRSAtj3M4isg"
  },
  "5hnnX7lqG7lR-aBGk7WxQg": {
    "date": "7/29/2019",
    "text": "I've been here a couple of times. This round, I was craving the Shrimp Pad Thai - not spicy. It was made to order and the shrimp was tasty! I ordered only the meal instead of the lunch combo and still couldn't finish it all.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "sxAqe5Ae24sc-ZvJgPKuCg"
  },
  "rcvMxfqkPu3y2z4hWM5X7w": {
    "date": "1/25/2019",
    "text": "Came here with a group of coworkers for lunch at their request. The space is smallish, there are a few booths and tables available, although most are pretty close together. I don't usually go for Thai although I was excited to checkout the menu.   Service was friendly enough and prompt. The restaurant isn't anything special and it was a bit dim inside.   For lunch they have either plates ($9-$12) that come with soup or salad, or a lunch bento box ($13+) which comes with soup or salad, appetizer and drink. I just went with the sweet and sour chicken plate. You can pick your spice level for all dishes.   It came with rice and carrots, other veggies and pineapple. It wasn't horrible and you got a decent size plate but I just wasn't a fan. Perhaps this is either a personal thing or just not the best dish but I wouldn't return.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qfX1CCpgaV8h2tK7R_l1ng",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Sweet and sour chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qfX1CCpgaV8h2tK7R_l1ng/o.jpg"
      },
      {
        "img_id": "zrncpAu_Ntpl3lArA_YycQ",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zrncpAu_Ntpl3lArA_YycQ/o.jpg"
      }
    ],
    "user_id": "Lk70TsLeGBYSXsnr5q-cXg"
  },
  "DgcyM2nbHIGUfYX4EoM4lA": {
    "date": "8/11/2019",
    "text": "My wife and I where there last night aug 10.The  Place was very busy. The food was very yummy. And you got large portions of food. We will go back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ydUB9R078M0IgWqy_gGhA"
  },
  "dEyo3vVPevRqEPkaL8U7sg": {
    "date": "4/7/2019",
    "text": "I love coming here for lunch. They have great lunch plates and 'bentos' that come with less or more depending on how hungry you are. The first time I visited, I ordered the Yellow Curry with Chicken bento, and most recently (pictured) was the Pumpkin Curry with chicken. When trying a new Thai place, I always opt for medium spice because while I do enjoy spicy food, Thai spice can be a totally different level. I was happy with the spice level, but definitely opted for Hot this last time around. If you like spicy, then I'd suggest going for hot. Only order Thai Hot knowing what you're getting yourself into. I'll definitely be back here again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vPBkLEeLFs4PDS3pCct_Nw",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vPBkLEeLFs4PDS3pCct_Nw/o.jpg"
      }
    ],
    "user_id": "7nlff-VNnz_fEyNpMmr0NQ"
  },
  "rhg6mbAbkiJKhnBU42q55g": {
    "date": "3/1/2019",
    "text": "Came here on a Saturday night and they were pretty busy. But still had a table for us to be seated quickly. The Tom Yom soup comes in a pot with fire and it was really authentic. The satay was probably the best I have ever tried. It was moist chicken and very flavorful. My kid loved it too! The papaya salad was very good but a bit heavy on the dressing. There was one ribeye dish that was very dry and I flavorful though. Everything else was very tasty. The service was friendly, but every time something was dropped off at the table they would forget a component ( cucumber salad or a sauce that was listed that came with the menu item), so we had to ask each time for them to bring it. Otherwise, it was wonderful and I will be back to try more menu items and get my Tom Yom soup fix!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z9BBHzz9-HERj2gnWfwG5Q",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Tom Yom soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z9BBHzz9-HERj2gnWfwG5Q/o.jpg"
      }
    ],
    "user_id": "S_PvShsyfpTFqtqJLWlSQw"
  },
  "7lC7_lNq-5tPhDEEhVyeJQ": {
    "date": "1/8/2019",
    "text": "Great authentic Thai food here.. I promise! They really have a large assortment of items and their specialty boat Thai soup which is amazing. I highly recommend it. It's like pho... but with a Thai twist to it. Curry is good here too along with the pad Thai. They have different heat levels and can help you pick an item if you are new to Thai food. Staff is always nice and friendly but beware at lunch it gets packed so go early",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4m68MVNjlj-HTsUzmc3ASA"
  },
  "Vc2ldt91_1ho2TwA0p55nQ": {
    "date": "9/22/2018",
    "text": "Since the Thai place walk-in g distance from my house decided to add tips without my knowledge, I decided I had to find a new Thai place. Ya Daa, this is it. I walked in and it's super clean with great customer service. I had questions and wasn't rushed, the woman helping me was so friendly and welcoming. I got the pumpkin red chicken curry, amazing! I will for sure be back over and over and over again.  Thanks",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n19eZRI7LPK-wBvQkUSqcw",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n19eZRI7LPK-wBvQkUSqcw/o.jpg"
      }
    ],
    "user_id": "UFkZNdtjhOjs5K83_wC72A"
  },
  "PE5KbfVp0VPDsk80pRfVjw": {
    "date": "12/1/2018",
    "text": "My new favorite Thai restaurant! I can't believe how I skipped this place for years. I finally had a chance to eat there with my gf and the food was amazing. I know now where to go when I crave for authentic Thai food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OBJduGYWFfUjlXa5qcaNVA",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OBJduGYWFfUjlXa5qcaNVA/o.jpg"
      },
      {
        "img_id": "rzf6c_K8Njv3Bxcj2vKNbA",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rzf6c_K8Njv3Bxcj2vKNbA/o.jpg"
      },
      {
        "img_id": "VN4P1lo7AnCqfRBhXyPl8A",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VN4P1lo7AnCqfRBhXyPl8A/o.jpg"
      }
    ],
    "user_id": "rQI_AYZqSZErWU-rzOVRww"
  },
  "3HQOfUzzGkN-ZyQvyNiAIg": {
    "date": "10/25/2018",
    "text": "Friendly owners. Food comes out fast. 5 mins for deliveries at weekday noon- peak lunch hours! They took the time to curate vegan versions of dishes that would otherwise be made with meat and hard to find vegan such as larb mushroom and the vegan boat noodles. I haven't tried yet but that sold me on this place! Have yet to find another place with vegan boat noodles. Very excited to try.   Food was good. Pad Thai dish was hot n fresh. Not too saucy or greasy but had great flavor. I'm picky with my pad Thai. They use he super thin noodles which I don't prefer but the dish itself was made quite well as far as sauce to noodle ratio and was decent. They allowed me to substitute the meat and veggies for only bok choy which I very much appreciated! Also owner is white so everyone there speaks decent english! No wrong orders here!! Communication and English is important in non American restaurants since I can't eat meat and don't want to risk getting sick! They understood everything I said!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ZoaGfcb5U1RCZhBXpHYJBg"
  },
  "03pPROpeDOxBxrURx44rUQ": {
    "date": "11/3/2018",
    "text": "Cha Da Thai is the Thai restaurant closest to our condo, so when we want Thai food, we typically go there.  More often, we get take-out.  Most often, our take-out consists of their Fresh Rolls, which are shrimp and chicken with an array of incredibly fresh and crispy vegetables, and an order of the coconut shrimp.  While all of the dishes we have tried there are really good, these are certainly our go-to ones.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSPqrCZksOPvU3zY1je5Jg"
  },
  "pCKMrfMAV4n-yhVRBgdZVw": {
    "date": "9/29/2017",
    "text": "I come here most of the times during lunch as this place is near to my home and also to my work. They got very good lunch specials on their menu and the food is very authentic thai. Best thing here is their choice of spice levels , which i need to mention this because most of the places add some extra peppers or spices on top of the dish when prepared but this place i see they maintain the spice levels by the Thai chilies which is very authentic .   This place is a small tucked away looks like but they had good taste of maintaining their interiors with some decorative traditional Thai crowns. Also the staff here are very warm and prompt at their service . I recommend this place to my fellow yelpers to give a try.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "61YKTobdOM7a2pblOGhlMQ",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Red curry with Chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/61YKTobdOM7a2pblOGhlMQ/o.jpg"
      },
      {
        "img_id": "4HQt7yNkUGMocAl5aITJLA",
        "caption": "Photo of Cha Da Thai - Scottsdale, AZ, United States. Kra Pao Gai!! Best of it&amp;#39;s kind",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4HQt7yNkUGMocAl5aITJLA/o.jpg"
      }
    ],
    "user_id": "U8fdPp1kx-yd7Zvx9feGxQ"
  },
  "E52xS3Fmo3G7iL4O5GoBHw": {
    "date": "3/18/2019",
    "text": "This was some of the best Thai food we've ever had! We ordered the yellow coconut curry, chicken fried rice, basil chicken fried rice, and an order of pad thai. The curry was fantastic, both fried rices were delicious, and the pad thai was the perfect heat (we ordered it medium)! Definitely will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "H-t7FoTJfzoZSVduFoRzcA"
  },
  "tOLirTrPLwTvbSfdxjNj4g": {
    "date": "5/29/2018",
    "text": "I love this place! I go here for lunch when I'm at work.   They have a great little spot! Cozy inside and clean.   The owner is usually their busting tables and joking with folks. Real wise guy! Love him.   The lunch specials are perfect! Size and flavor wise they're spot on. I love the yellow and red curries.   Sometimes we drive from Gilbert too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gzIIogl9Z9o1qog1Ve8QSw"
  },
  "yVQvb5G62_MTlYF4YYKiEQ": {
    "date": "8/31/2018",
    "text": "Going to have to give this just 3 sears. They put eggs in my drunken noodle... that's a big no no. It also had a sweet undertone to it, so I wasn't the happiest. My friend had fried rice, they got that right. They also got the coconut soup right, it was so tasty! I'll go back and give it one more try",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_4nl1_JNiWj8PU2auSOrqA"
  },
  "y9RuYild5qhS8bWfpkcYfQ": {
    "date": "12/28/2018",
    "text": "We picked up food to go from here the other night. It took over an hour to get our food even with calling it in. The portions were on the small side and the overall taste was not there. The stuffed chicken wings were probably the worst I've ever had anywhere. They were dry tasteless and disgusting. The fried rice was soaked in oil. The meat was skimpy and overcooked. The panang chicken curry was okay but locked some spice and flavor plus they add the chicken after they cook the curry so the chicken is just plain chicken thrown in curry. We also got the peppered beef and shrimp which was lacking flavor and pepper. The steak was super thin and tough something you would get in a Philly cheese steak sandwich and the shrimp we're overcooked as well. The only thing that we actually really enjoyed was the shumai appetizer. The rest of the order we could have done without. Definitely will not be going back there. Many other places to choose from right in the area.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "KxGeqg5ccByhaZfQRI4Nnw"
  },
  "24G3pV7QmNcquY_ggmkwog": {
    "date": "8/22/2018",
    "text": "Postmates delivered; spring rolls great. Satay fair , dumplings good. Pad See Lee sucked. Beef was thrown in at end & tasted it. Pumpkin curry was average. Never again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nX55th0dv0MLodYjzuTDxA"
  },
  "jZ07fGrRSeIgBKwrIECeQg": {
    "date": "8/31/2014",
    "text": "A bit off the beaten path, but you'll find the best and most authentic Thai food in Scottsdale here. The Pad Thai is amazing, as is the pumpkin curry. The food is fresh and flavorful, and reasonably priced. Plus they make everything to your desired spice level. Service is friendly and efficient. The restaurant is clean and decorated in a cheery and authentic Thai style, with Thai costumes adorning the walls. Light lavender shades of cheerful go hand-in-hand with the service with a smile you will find at Cha Da Thai. The Thai iced coffee is delicious. I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "TzUbr6BiQwR1bNfVOuE4GQ"
  },
  "71g8Si0K1-ovpGMULKlpBA": {
    "date": "2/3/2016",
    "text": "Excellent Thai food I haven't had in a long time.  The service is great!! Very friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RAFGBGwZtsAz0xz165U9xg"
  },
  "jUoM28v2sG1bxD6RwUFXng": {
    "date": "9/18/2016",
    "text": "Everytime I write a bad review I get hate emails. I just gave a sacred restaurant some mediocre reviews so read this one and don't think I hate everything here in Scottsdale. This is the best Thai restaurant we have eaten at in 10 years and I wish I had found it sooner. It is very pleasant inside the service is excellent and the food is as authentic as I have found here. You know you are in a good place when there are ethnic people eating there and the family of the owner is helping out. The food is very fresh and every dish is prepared for you. Nothing is over salted as with many Asian restaurants who dumped soy sauce on everything and try to pass that off as Asian. The fresh rolls were very generous and you could split one order between 4 people or you could even make a meal of it if you wanted. My husband had the cashew chicken and he does not like terribly spicy but it was beautifully flavored with basil and other herbs so that it had a complex and lovely taste. I like spicy and I ordered the panang curry which was the best I've had in the valley. Warning this restaurant takes spicy very seriously. I like very spicy food and the owner recommended I try medium and he was right because medium was plenty hot. This food is not Scottsdale hot it is Thai hot so if you order hot don't whine to The owner that you can't handle it. The owner was extremely friendly and helpful as to which dishes were spicy for me and which were not so much for my husband. We will make this irregular spot in the future",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tJnY6lhStvS3aS5z07awpg"
  },
  "Xt2zLgJwQwSAx1cP2ZCpkw": {
    "date": "12/27/2013",
    "text": "Simply outstanding. The price is right, the food is fresh and tastes great. Update on 1/12/2018: As of late, service is falling behind, they seem overwhelmed. As a result, food quality falls as well, it's not what it used to be. The owners are no longer seen around and the staff looks overwhelmed. Too bad we have to skip the place from no on.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q0sysEQaKwOpV-Su4YARZw"
  },
  "KRk-dGw9HeGDxpNrEttoxQ": {
    "date": "8/22/2015",
    "text": "We enjoy the food here. The soups are very good and I really love the wild lamb dish. I enjoy the fresh rolls (meat and mint spring rolls) and the jade roll (add avocado) as an appetizer. The peanut sauce is decent after I add some ground red chile to it. The green tea noodles are very interesting as well. Their lunches are a really good deal and we usually get good service. I have trouble getting them to make my food spicy enough, but they see a Caucasian female and are afraid to put spice in the food. I hope that one day, they will start recognizing me and do the spice right the first time, or I won't have to make do with the little tray of add your own, which is not as tasty and I get really tired of having to do this. I love fresh Thai chiles and it is hard to get a restaurant to bring me any. We usually just drink iced tea when we come here, so I cannot speak to the bar selections.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "81NrUp80DRP8-r7ykDzGgA"
  },
  "cMuDdMtXesYtWBAwupX0Iw": {
    "date": "9/2/2015",
    "text": "This restaurant serves great Thai food. The menu is large and varied, from vegetarian to speciality seafood. Their prices are also very good. The staff is friendly and inviting and the decor is well done. It's a small restaurant at the end of a stripe center, but, worth finding. It is one of the few Thai restaurants that truly offer entrees from mild to Thai \"Hot.\" If you like it hot...it will come very hot. But, don't be scared if you prefer it mild, it will come that way, too. Ingredient were fresh and varied. It is well worth searching this restaurant out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZRL6bhD0ad-_dEXnqcKfiw"
  },
  "aqurCKQIMODZkI74Zcf5jQ": {
    "date": "2/26/2015",
    "text": "We LOVE this place! What it lacks in atmosphere it more than makes up for in flavor. We usually get the Pad Thai and Chicken Coconut Curry which always exceeds our expectations.  Recently we brought a family member there and she ordered the Eggplant- the flavor was outstanding. We asked the waitress what the sauce ingredients were and she was so nice. She actually wrote the ingredients down and took pics of the specific brand of items so we could find them at the Asian store. She went above and beyond. We like spicy but not too hot. We order between 2-3 depending on the cook but have learned its better to go with a 2 and add a bit of our chili spice than to order a 3 and it be too spicy to enjoy. We've never done take out, but from the amount of people that pick up every time we are there, it must be good. The place is a bit dark, decor is odd and the lighting isn't perfect, but for a casual meal that is consistently tasty, you can't go wrong.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f8cId_yg1efqkeg5eloIYw"
  },
  "kDHUlIegAap55RI0iOlKtw": {
    "date": "8/24/2015",
    "text": "Stopped in based off the other Yelp reviews and I too was very impressed.  I was craving Pho and low and behold, they offer the Thai Boat which is like Pho on steroids.  There was so much going on in that bowl that it is hard to describe, but it was delicious.  I'm thankful I found Cha Da and will be going back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sjhg0GkfPonubJnfJDt07A"
  },
  "zck9fPhZP9pDqvPgwgcm4Q": {
    "date": "10/22/2016",
    "text": "I eat here regularly as it was always a good place for Thai food right by the house, but the last few times have been disappointing. Tonight's meal made me decide I need to drive a little further for better Thai food. My pick up order was wrong. My food was greasy and burned. Overall it was incredibly disappointing. I hope they can get back to how it used to be.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-s0MSvN4gPtVaRt8w_a0Hg"
  },
  "zwPWx7MTDFkr5xCWccjF1Q": {
    "date": "8/15/2015",
    "text": "I ordered the Thai tea, pumpkin curry and coconut ice cream. Everything was amazing!! The portions are perfect and the prices are great. The coconut ice cream is made in house! I would recommend this place to everyone! True Thai!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MkgGon899uYucw36BDmp2A"
  },
  "SQGIqCLyFInsX8Du4rnIsQ": {
    "date": "8/14/2015",
    "text": "Food was great and quantity was plenty to suffice for two people. I would definitely go again...and again :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FMnQVa71Zk2QX-27ba1KxA"
  },
  "xuBrQCtBK0uemCLYvKnnRA": {
    "date": "5/27/2015",
    "text": "Best Thai food spot in Scottsdale.  They never disappoint me.  It's one of the only places that gets thai hot right when it comes to yellow chicken curry.  So often I am disappointed by the lack of spice in meals I order when I go to thai food places-they don't make it hot enough even when I ask them to make it extra extra spicy!  However at Cha Da, \"Thai hot\" gives me just the right amount of spice and flavor, great balance.  Love this spot so much.  Whenever I'm having a bad day, I cruise over here to cheer myself up with a good spicy meal.  Thank you Cha Da!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tollXvhR7KavmFJlJ_JHGA"
  },
  "ea3pZiTJPk5jaDISVQ0FnQ": {
    "date": "4/24/2014",
    "text": "The restaurant looks Thai, but the food is not....maybe it is suitable for american thai food.  The meat are dry (all white meat), curry are waterly and no thai flavor, the soup is salty, the service is slow, inside the restaurant is dark.  After this meal, I think I rather go somewhere...won't go there again for sure.  The one star I give to the servers, at least they have a kind looking!  I see this restaurant been changing hands 3 times for the past a year, the location maybe a problem..but the food is the real issue....",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "ejlB4FTP5Ir2VW4dT4_m7w"
  },
  "SNg8wrI3BcMMHRTeHWUVeA": {
    "date": "6/19/2015",
    "text": "So a year later from my first review- this place ia still AWESOME!  There are wonderful Thai headdresses and a small but plush waiting area. The food is extremely delicious and fresh.  Many Thai places are in the area, but none are as fresh and delicious as this place. The service is great, and they have take-out! If you're in north Scottsdale near Shea and 101, then it is worth a trip! Reasonable prices too! They serve beer and wine! Try this place! You will return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7DcJDzDD3Rb5fmrx39_6g"
  },
  "ltKTOxcOdZXYQNycv1UUQg": {
    "date": "8/29/2015",
    "text": "Unbelievable flavor! I always get the red curry with chicken, and I nearly weep with joy over the symphony of taste playing on my taste buds! The Pumpkin Curry is equally enjoyable. Run! Don't walk to this gem of an authentic Thai bistro!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rUlHiIuvyTCBok8k_gc74A"
  },
  "WdBVqROKbNpbzzEpWfAMoQ": {
    "date": "7/19/2016",
    "text": "Oh my goodness!  If you have plenty of time try this delicious place. I've tried several of the curry dishes and both have been phenomenal. The food and seasonings are fresh and very flavorful. The only thing is that service is slow at times. We've been there for dinner on weekdays, there's not a lot of people but it takes a bit to take your order. Try this place, it's a hidden gem just make sure you are in no rush.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bw2uDlm4IF7VpyANknivVQ"
  },
  "YfxuYkuRZQVC_Ja-uY9iWw": {
    "date": "11/3/2016",
    "text": "Delicious Dirty Chai and the Southwest Bowl was yum! If I lived here, I'd be going all the time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nwuVrnuNn1nU2AkTF4hFlA"
  },
  "AmZ1GQokA_AKkzuNe5kvyw": {
    "date": "5/2/2015",
    "text": "Consistently best Curry and pho. My bf and I come here often...its out of our way but totally worth it. Try the pumpkin curry or their take on Pho...its so flavorful bit be careful they are a but on the spicy side",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5EaKmH3_NeF2q3CsN09wJQ"
  },
  "0jUAJuy52BRYYCw-KpjGkg": {
    "date": "12/26/2014",
    "text": "The pad kee mao was on point, tasty and not overly oily or salty. The yellow curry was also quite delicious. Problem was the tom yum and the boat noodle dishes were seriously lacking in flavor. Both were so watery that we had to ask the server if it was possible to make the soups more flavorful. Not sure if it was only that day, but it seemed that not enough tamarind and spices were added to the initial broth.  I might give the soup another try to see if this was only an aberration but at least not everything was watered down.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kv_M01-Mz_D7HrO80S6zOg"
  },
  "kTZ3pHYY4Jugw9uI6t2RKw": {
    "date": "7/12/2015",
    "text": "This is the best Thai food we have had  since moving from California! We were spoiled there in the Bay Area with wonderful Thai restaurants so to say that this restaurant compares is saying a lot for us.  The service was excellent, friendly and very capable. The decor is just beautiful. The only suggestion I would make is to leave out the sliced chicken or turkey in the fresh rolls. It didn't add anything and the shrimp is enough. Fresh rolls are my fave so I always get them and these were pretty good, if maybe a little heavy on the lettuce. But at least I could taste mint. We also had Pad See Ew and Basil fried rice. Both excellent. We order mild and my husband puts extra chili sauce on his. We will definitely be returning to try more things.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TzOxI0ksoJXVab1D-H3teg"
  },
  "svjjtQiyIyUIak1P2pSxQQ": {
    "date": "7/11/2014",
    "text": "Great place for a casual dinner! The decor is warm (Thai theme) with comfortable booths and the service is great. There is no long wait to be served your delicious meal.   The menu has a good variety (beef, pork, chicken, fish, seafood) with 4 degrees of heat. The heat is real so be conservative!  I asked for medium/hot and would have been better with just medium. Iced tea helped calm my mouth so np.  You really can't go wrong with anything you order and certainly a go-to place for us.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "TnA_dItcQZDlpetnd5gnbg"
  },
  "AUI4Nl_84bxJ8mx_AhZ96Q": {
    "date": "11/11/2016",
    "text": "Excellent food, great service. Best pineapple curry and mango sticky rice I've had!   This place is absolutely fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HcFKzB-KuwIxUTXx0WdKzQ"
  },
  "POg5jW9Bdg-MBmO_RH_2Qg": {
    "date": "11/10/2014",
    "text": "Best Thai food and ethnic food in Scottsdale. Great portions, great quality and truly authentic. Service is slower than what you would expect but you have to think you are  visiting a restaurant in Thailand. Will totally be back again....  Only recommendation would be to lower the price of the appetizers and maybe minimize appetizer portions. Everything on the menu if around the same price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bL1WfC79oRhrZ4qATEJuBw"
  },
  "CC3zIC98SdMWq3QYe6G9Wg": {
    "date": "8/10/2016",
    "text": "Came in today for lunch and it was busy but not to bad. Took 10min till someone came to our table and another 30min before I had to ask the manager to check on our food and get it to go since my 45min lunch is about over. He offered no apologies. We took the food to go and ate it on the way back to work. It was ok but nothing compared to some of the surrounding places. I really was hoping this place was good. But it's not. Maybe it was an off day. I don't know. But I most likely will not be giving it a second chance. Nor will I be telling anyone else about it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqdgoNAY3pJEK6Q0q5jdog"
  },
  "BeSfQjVFXsbIVzQDxZAhxw": {
    "date": "11/18/2014",
    "text": "SOOO happy I found this place. It's the most authentic Thai food I have found so far in AZ (just moved here in 2013 from San Francisco. I spent 10 days in Thailand, and I took 2 months of private Thai cooking lessons. I'm a bit of a Thai food snob.  The food here is very tasty. The Larb salad was a bit fishey (heavy on the fish sauce) for my taste. The red curry with pineapple is divine! The papaya salad is really well done Pad See Yu (spelling?) is REALLY good pepper stir-fry is okay, very peppery (not my choice to order this) The eggplant stir-fry was half really good, and half under-cooked.  I'll be coming back here to try more of the menu. Service is also really good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6GvV1g1vuDq2IMatzqIDlA"
  },
  "SUfZzL_SYUK4nK_45hzP4A": {
    "date": "11/26/2016",
    "text": "Two thumbs up! Desserts are superb. Very homey atmosphere and nice staff. Can't go wrong with the coconut ice cream",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WpdxiEsCqKWOQdmyxYpJvg"
  },
  "P0w_QTi7E73yG6suRsB6eA": {
    "date": "10/26/2016",
    "text": "Our \"go-to\" Thai place in all the valley!  What can we say..the food is consistently flavorful and the portions are more than adequate (we always have left-overs the next day)...that is if they make it to the next day! We love this restaurant that is owned and run by a lovely family.  When they took over from the former Swadee, we really didn't know what to expect..but they have never disappointed us. We will gladly drive from Fountain Hills when we need our weekly Thai fix.  While we usually take out, the dining room is very comfortable and the atmosphere is authentic and pleasant.  We love the Spicy Noodle and any curry on the menu is a hit!  The Jade Roll is always a great appetizer and is quite hearty for a starter, so you'll likely want to share. Can't recommend this place enough!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O7GlREZp0_VC5ECKt1_LUA"
  },
  "C2-U2OUNsleFRCMSm-ajxg": {
    "date": "8/19/2017",
    "text": "Do yourself a favor and do not order the fresh roll.  It was too many layers of thick rice paper wrapped around a bunch of lettuce, one piece of shrimp and deli turkey.  Where was the vermicelli and chicken as advertised? No flavor at all.  This was takeout so I cannot tell you about the rest of the food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rQepa0pNnkT_k-V_zqiNmw"
  },
  "fkOWOBojcLENOQWZVUbhsg": {
    "date": "10/25/2016",
    "text": "Amazing Thai food. Chicken pad thai is the best Ive ever had.  Great for takeout.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tlXJJRofk9jFdo8pErGtcA"
  },
  "uBPn7hOhX_RDbv1vTJD_Uw": {
    "date": "6/17/2014",
    "text": "This is my favorite Thai restaurant in the Valley.  They offer far spicier options than other Thai restaurants in the area and everything was extremely flavorful and fresh.  I do think Cha Da Thai is a couple dollars more expensive than others (check my other Thai restaurant reviews), but it's completely worth it. A nice bonus: Cha Da Thai has the most Thai ambiance/decor of any of the Thai restaurants that I've been too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "BIyAXPpwbna8a6OxQ-WSnQ"
  },
  "RQrKZj36oIfbuyrR-F909w": {
    "date": "2/7/2014",
    "text": "FINALLY able to add a 5 star review ( been a while).   The strip center location is not the easiest to find so, I was surprised to see this quaint neighborhood eatery near capacity on a Wednesday night.  We waited 5 minutes for our table and were immediately greeted by a very enthusiastic server who took our drink orders and returned to answer some of our questions. She took her time to explain several dishes and cautioned us about the spice level.   We went with the pumpkin curry, steamed lemon fish and our old standby Pad Thai. All three of us were happy with the freshness, presentation and appropriate spice levels. The portions were good so, no desserts to report on, maybe next time.   This restaurant is very well decorated with art and sculpture from Thailand and,  seemed impeccably clean. I know it is more of a locals spot but, I highly recommend it for out of town guests wanting fresh Thai cuisine. It is very close to many Scottsdale hotels but, off the beaten track.    Thanks to Sha Sha for taking her time with us. Be back soon!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "WnwpWcNcJhHi39gdIUfJuQ"
  },
  "K2jtOEpkMg5xtF5hwN_VMQ": {
    "date": "8/31/2016",
    "text": "Solid Thai food. A hidden gem in Scottsdale! Loved the Panang curry bento box I had at lunch--highly recommend along with their iced tea which was excellent. Worth coming back for",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8orxgc272mI4iRqQkdt7Sw"
  },
  "81kDKRxZfdYhD1GQkWYoZw": {
    "date": "11/26/2014",
    "text": "My father was in town and he LOVES Thai food like me, so I jumped on here and did some research... thanks to all the previous reviews, I picked him up and we headed here tonight (11/26)  The restaurant was half full when we arrived and were seated immediately with our choice of table or booth.  Once seated, a young waiter came over and asked if he could bring us drinks, which he did and also included glasses of water too, good job!  My father ordered a basil fried rice entree and asked for \"Medium\" heat, I order a Kee Mao entree with flat noodles and asked for \"Hot\".  While waiting, we also shared some Satay stickers with peanut sauce, very good!  I felt the appetizer price was a little high (agree with Camelia D.) when compared to the entree prices... but still it was great!  There were three servers tonight, so drink refills were quick!  This was very good, because I didn't anticipate HOT being so HOT, but it was good!  My forehead and upper lip were sweating, haha!  My dad pointed out that his dish, while good, wasn't anything special and after tasting and stealing a few bites from mine he raved about the ingredient choices and blend from my dish and wished he had ordered the same...   The owner Kevin was in town and he stopped by and said Hello... turns out my father and him went to high school just blocks away from each other, which I could tell my dad enjoyed reliving those days... the two of them talked for a bit and it was good to see my dad enjoying himself!  Two families had brought their kids which were all well behaved and the couple behind us who were leaving ahead of us kept raving about the soups!  Overall, quite impressed with my first visit and definitely will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xh8lEEwdgXPD2DGunZP_zw"
  },
  "VgsZvRIwGwieOaTDaK-0Qw": {
    "date": "1/5/2017",
    "text": "Was a regular at this restaurant when it opened in 2013 and left a good rating. However After many visits I saw the consistency of the food go down and did not visit for over a year. On a recommendation from a friend I returned two months ago and was very satisfied until today. The food was not up to par and when the owner asked how everything was and I told him he just told me to try again. Food was barely warm when served and he seemed to not believe me when I told him. Would have been nice for him to comp the lunch so that I would return and try another time. I had been visiting there 2 times a week for the last two months. I will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yWVOL7Ay_MTk7stzXmIZ9w"
  },
  "qfc4ZVwBD5LggZdQJETiSg": {
    "date": "3/7/2014",
    "text": "I really have to force myself not to get take out from here every day for lunch.  They have this soup...aaah, it's so good!  It's kinda like Pho but you can order it at whatever spice level and with whichever noodle you want.  And it is so stinking good!  Yummy!  Oh, and they give a discount if you pay cash.  Pay cash!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "KPVIj30_PT6X8C_89pBrNQ"
  },
  "WGTm2VpSM_9dkRBIAIJH2w": {
    "date": "8/6/2016",
    "text": "Cha Da is fantastic! My wife who is Thai, is very fond of the style Cha Da dishes up their menu. Comfort food is how it's described. Larb, mango sticky rice, curry... is just like Mom's. Well, Larb did have grub worms but that's beside the point.  Dining in may take a little time, but that's expected with great food. Don't miss this great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p1LPAhBVTuMCnaq4o-ESWA"
  },
  "Gq9jAh50UX_5i4BPXsgNzw": {
    "date": "3/20/2015",
    "text": "Picked up to go from this place during lunch time. They were friendly and speedy. The lady told me my baby was adorable so that's always a plus! :)  I got the pad thai and it was just okay. I got the medium spice level which was just right.  The sauce was lacking really any flavor and the whole dish together just kind of tasted like dry peanuts. Next time I will try something else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iKsHXTj_mkptUjnNnowwpg"
  },
  "XvDUndjPwzG-Co2ol94v-g": {
    "date": "9/1/2016",
    "text": "Outstanding Thai cuisine with five-star service.  We ordered the Pad Preow Waan, Pumpkin Curry and Pad See Iew to eat family style.  Each dish was equally delicious!  Make sure to drink a Singha for the full Thai experience!  You can't go wrong supporting a local restaurant with food this yummy and an owner that is so kind!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qA4aVjffuI9KXMIQ6hzsOA"
  },
  "NyBSsUAaPlS172NpLScBtA": {
    "date": "4/5/2017",
    "text": "The last time my wife and I were here, it had a different restaurant name and owner.  We were here yesterday and the food are delicious.  I even found the \"Thai Boat Noodle\" that I love to eat, which I can't find anywhere in town.  Beside the food are delicious, the staff and owner were friendly and helpful.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VLyMRy4_yqHCBUg2mxDlIw"
  },
  "Epk624FBDnpGjutWDLysHw": {
    "date": "4/5/2016",
    "text": "Cannot tell about the food. Waited 15 minutes for some one to come by and take my order. There were 4 people working, but only one taking orders. It is just to slow for lunch.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hXiMdq-5AzZHbkPM2RsRoA"
  },
  "OTC6qX10TITn3E3kXnbFqQ": {
    "date": "12/20/2017",
    "text": "This is a comfortable, friendly place.  Friends who know much more about Thai food tell us Cha Da Thai has the most authentic menu and preparation of any restaurant they've found in the metro area.  All we know is that the food is fresh and delicately prepared, much like Vietnamese/French fusion restaurants we used to frequent in Washington, D.C.  We've been back twice and the food has been consistently great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u34PeIg7KayTcJqfDfmOIg"
  },
  "SBJNcdB4B_cjsZtA-6aB2A": {
    "date": "9/1/2015",
    "text": "Really enjoy the name as it is very unique to the area. The interior of the restaurant is very charming and has a cozy feel.   I personally thought it was a little on the spicy side and would have liked to have seen more ingredients incorporated in the curry dishes. I really enjoy when a panang, green or yellow curry has more vegetables like green beans, basil, zucchini, tomatoes, etc.    I did enjoy their pad thai however, pad thai is quite tasty.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "REsuTQfAG7IOIE2YgM5rrg"
  },
  "AhUSV4qTnpBCUOVky-SZTg": {
    "date": "3/21/2015",
    "text": "Congratulations, this restaurant makes the driest fried rice in the WORLD.  Don't know how so many people can give a good rating to this restaurant!  Thai food is great but not here!  The food is tasteless and the service is bad!  One star for having a place to sit!!!  Be careful giving a 1 star rating or you'll get a nasty reply from \"QUEEN NINA\" just like everyone else that gives the food an honest rating!  Also, check out the non 5 ratings as most of them had problems with service food, etc.  This is a family run restaurant whose family should be in another business!",
    "rating": 1,
    "rated": {
      "funny": 9,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "1mPiUKavJz5vg7djrIer7Q"
  },
  "x4kzNBOvU_smVmTacbNFLQ": {
    "date": "5/8/2017",
    "text": "One of my favorite Thai restaurants! Great food and atmosphere, you can't go wrong with any dish!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M7sozhOjUfVow_feDOALeg"
  },
  "UJNBcyLC1oxF9R2SWtjiCQ": {
    "date": "5/8/2017",
    "text": "Most of the reviews seem to like the food here.   I have traveled through Thailand before, so I have tasted the actual Thai cuisine.   I ordered the Pad Thai and it was the worst Pad Thai that I have ever tried so far. As I started to eat it, I noticed a distinct taste of the so-called curry Thai sauce. It wasn't a Thai sauce at all, but a Tomato sauce. I am not kidding. I was shocked, since no professionally trained cook would have dared to just mix in some tomato sauce into a Pad Thai dish.   I asked the waiter about it, and he said that, yes indeed, they used Tomato sauce in the Pad Thai. I was shocked! I was literally eating some Asian noodles doused in a tomato sauce. You don't need a cook to prepare that type of order.   I will also admit, that the waiter noticed my displeasure in the dish, and since I refused to continue eating it. I wouldn't be charged for the Pad Thai. This was cool. He tried to get me to order another dish, but I declined.   I have experience working in the back sides of restaurants before, so i know what happens to dishes when 'cooks' get offended over the 'customer marks' disliking their 'offerings.'   The workers were really nice there however.   But unfortunately, I came there to try the food. I will not ever revisit this place.   Also, there was a large TV screen blaring images from a back corner area of the restaurant, showing continual tourist junket videos. One tourist junket video was about Rome, another one about Venice, and then another long one about Havana, Cuba. What was the point of this? Is this restaurant run by Thais? The constant blaring images made it impossible to have a conversation with the person across from me.  I did notice a Latin American worker in the back kitchen area. Could this explain the mystery of the tomato sauce in the Pad Thai?  I think this is the state of eating out in the decaying Empire - just buyer beware. As for me, I will continue to prepare, eat and enjoy my own food at home.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7UZ5NbuVAxnIzNZg1A2U9g"
  },
  "-ZxFnEID1EBeFMOugvGTcA": {
    "date": "10/8/2015",
    "text": "I was in scottsdale for a business trip and I wasn't feeling so hot so I decided to order take out. I call Cha Da Thai because they advertise that they deliver, but when I called they stated that they had stopped due to lack of interest.  I ordered the green curry (it was OK, no where near as spicy as I hoped) and their hot and sour soup (I forget the actual name of it) but it was tasty. What I did not appreciate were the large chunks of vegetables in the soup which made it difficult to \"eat\" and the fact that it only came in a large size (I only want a cup of soup, instead I got enough for 3-4 people).  If I lived in the area, this would be a solid place to get some take out. I hope they update their website and yelp website regarding delivery and consider some size options.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hjiI_flwQL4Vw_8lbfT0Zw"
  },
  "3RrUaqjnihmImFDFGXrfOg": {
    "date": "9/16/2015",
    "text": "Great place.   The food was great. I ate at lunch time and had the lunch special panang hot curry. The flavor was awesome. The atmosphere is nice and appealing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V6tpdc1knkTTcRBtlPvx0w"
  },
  "KlPoFAQJB63PEvXfBifUKA": {
    "date": "1/22/2017",
    "text": "I wasn't happy with the quality of the food here. The beef was chewy and veiny and just not tasty. I have had much better Thai in Scottsdale.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r7roTXnAa5jrprlit6b-Eg"
  },
  "0h6IF-MXtPoGY6GpOGLGdA": {
    "date": "4/17/2015",
    "text": "Their boat noodle soup with bbq red pork (the #2) makes me happy. So happy. I like it so much that I find myself telling people about it then offering to go pick it up for us to eat so they can try it haha. If you like pho-type soups you'll definitely like this - much more flavor. You order the kind of soup you want, the kind of noodles you want, and tell them the spice level you want. I get the #2 pork boat noodle soup with wide rice noodles at their medium spice.   I usually get my food spicy, but just under where I'd have to slow down while eating it - so be warned that their hot conjures up sniffles and tingly lips, especially if you try to eat it while it's still hot (temperature-wise). I did that recently and it reminded me of the time I got the inferno spice on my crawfish at the Angry Crab Shack. (Not that I'm complaining haha; sometimes that kind of heat is what you crave :)  ). I haven't tried anything else yet because I just can't pass up the soup. Ordering it to go has been pretty convenient too.  \"What boat noodle soup?! I don't see it on their online menu!\" Yeah it wasn't online for some reason but it's there on the restaurant menu - I posted a picture of it so whip out your magnifying glass and take a gander.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "2_5pixk-jQllDCR0W4hDXg"
  },
  "cKwHbMv7FG-w_NO9tDUvpQ": {
    "date": "9/8/2015",
    "text": "Fantastic Thai food! One of my favorite restaurants to visit when I want a lunch special.  Highly recommend ordering food \"hot\" for best results! Customer service is also excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jKXbK5HzKMXf_9Hquel50A"
  },
  "5FncgMoG459clUpbudiz9A": {
    "date": "8/14/2016",
    "text": "The best service and food! I love a family owned restaurants! The Pho is the best I ever had! I will definitely be a regular here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hG4XyixOaYS59qUToXQeXg"
  },
  "mtW7IhWwGRUzoRsohGkfig": {
    "date": "8/16/2015",
    "text": "This place definitely has some of the best (and most authentic? I'm not Thai so I can't gauge this) Thai food in the Phoenix area.  The service is always friendly and well catering.  It's worth noting that my last trip here I was served tap water instead of filtered water for my drink so maybe their filter broke this time?  Either way, you'll end up spending $11-14 per person here, and I was also told that their previous deal of 10% off with cash is no longer being offered.    The regular dishes:  -Pad Thai: Probably one of the most \"Americanized\" Thai dish.  Never too sweet and the noodles are always very soft, but not soft enough to make it hard to pick up.    -Pad Sea Iew (I think that's how you spell it): This is the dish I look and try whenever I try a new Thai restaurant.  I've always enjoyed the flat noodles with the choice of Chicken, Beef, Pork, or Shrimp.  This place serves theirs with carrots and broccoli on top of the standard flat noodles and meat and some other Asian vegetable that I don't know the name of.    -Larb: First time I heard this, I was like, \"What?! We're ordering LARD?\" but it's really good ground chicken with rice and bell peppers.  If you like Chinese stir-fry dishes, you should give this one a shot.    Noteworthy Dishes:  -Papaya Salad: Not something I eat but my mom always orders it when she comes by so I think it's good?  -Green Tea Noodles: Very tasty and goes well with high level spice.  The noodle texture reminded me of instant noodles but it definitely doesn't taste like that.    -Thai Iced Coffee: Something else I look for when I go to a new Thai restaurant.  The one here is VERY sweet, so if you don't like sweet stuff, stay away! Although I'm sure you can request it with less sweetener.    The only reason I'm giving these guys four stars is because we were denied service once, when we walked in (party of four) ~15 minutes before closing.  We were asked to only order to-go, and ended up leaving empty-handed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qrkmU31BOow-tlrvV4DDGw"
  },
  "mAFuVcd-KH6KOMF7hN6-qA": {
    "date": "3/28/2015",
    "text": "Yay! I finally found a really good Thai place! I've had Thai up and down California and now a few times in AZ. This is by far one of the best Thai places I've ever had.  They have excellent beef larb, tom yum soup,  and pad thai. The flavors are very good and seasoning is spot on!   Tip! I asked for everything medium spicy and they are definitely heavy handed on the spice, so ask for closer to mild if you usually go medium elsewhere. Otherwise, food was excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oItpbkApDq4hMM6IKKmVgg"
  },
  "dSgmbFQ4M17n_M475Dbt6A": {
    "date": "3/8/2017",
    "text": "Seated and attended to quickly, moderate wait for food, good appetizers, chicken satay was excellent, the cucumber sweet and sour sauce was so refreshing, wonton soup is good - very earthy and not like a Chinese restaurant style wonton soup. Pad Thai is made with a tomato type of sauce which I did not expect and am not used to, was not for me. Staff very friendly and accommodating.and truly want you to have a nice experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oomdTBonePskZWhyi7iSMQ"
  },
  "dz8I5dI-cXH0CP4ChpEKLA": {
    "date": "1/2/2015",
    "text": "As a Thai food aficionado, and with this being so close to my work, I REALLY wanted to like this place more than I do.   I've never dined in, always gotten take out, and the service both on the phone and at the counter has always been great.   But the food isn't great. I've gotten food here numerous times, and I'm just not impressed.   One thing that irks me is that the lunch specials are not that special. I've gotten the Pad King Sod a couple times, and always end up kicking myself for not spending the extra dollar and getting the full-sized meal. Same with the curry. Tiny portions, 4 pieces of chicken. It's just not worth saving the dollar or so. The flavour is ok, but not the best I've had.   I've never had the spice level where I want it. Elsewhere, if I order something 'medium', I get it with a little kick. Here, if I order it medium it's like they just waved the spice over it, without actually getting any into the food.   My meal today is what finally prompted me to write a review. I ordered the Pad See Iew with chicken, medium hot.   What I expect with Pad See Iew: al dente noodles in a darker soy-based sauce, with broccoli and/or spinach or something bok choy-esque.   What I got was just not up to par. So light it was almost yellow, noodles soft to the point of being mushy. Not only was there no spice, there really wasn't any flavour. The veggies consisted of broccoli, carrot slices, and long ribbon/noodle like carrots and beets, which unfortunately turned parts of my food an unappetising pink. Pad see iew should never be pink. It should never be light coloured. It should have flavour.   This was just one more disappointment, and the reason I don't think I'll be back. I'm beginning to think that the people who gave this place 4-5 stars, calling it \"authentic Thai\" wouldn't know \"authentic Thai\" if it bit them. For me, this place serves up watered down, Americanised versions of iconic Thai dishes.   I'd have given it 2 stars if not for the excellent service I always get.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-pWt7EPsPotH-yQEOfqKQ"
  },
  "wBNlYJb-eX_JwTcURCQV4g": {
    "date": "3/28/2016",
    "text": "Authentic Thai, huge interesting menu and great food. I'll say this, my Dad's favorite food is Thai. He's a Thai food snob and 87 years old. Best Thai food he's ever had.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "P1NI5QCqsFskRjucA3FNSg"
  },
  "lCrayxFOByYbh4aUSFcDgA": {
    "date": "9/11/2014",
    "text": "Worst experience I have ever had at a restaurant, ever.   I ordered the Pho like noodle bowl off of their new menu and so did the person I was with. I ordered the version with scallops and prawns. We both ordered it \"mild.\" I normally eat everything spicy, from my sushi to my mexican food, I eat anything as hot as can be. However, this was the spiciest thing I ever ate.  The other person I was with felt the same way about theirs. It was too spicy to swallow, let alone enjoy. This shouldn't have been a problem as I requested some more broth to water it down. It was still too spicy, so I requested to return it and order something else instead. This is when I realized I would never be returning to this establishment...   I was told that it was because I \"CANNOT HANDLE SPICE\" and that they would \"NOT ACCEPT IT BACK.\" I was shocked. I have never heard of this happening at a restaurant. Isn't the customer always right? I asked to speak with a manager. I was told the manager doesn't speak English and I could not be helped further. I asked the waitress to speak with the manager in Thai. She said the manager would not take it back for something else after speaking with her. I said to return it anyhow then - I couldn't eat it.   THEN, the waitress brought it to the back and came back to tell me that the manager had said I was trying to take advantage of them since I had eaten 2 of 5 scallops placed in the bowl. This is A) the craziest thing I have ever been accused of B) who cares since they wouldn't take it back anyhow C) the pettiest thing you could ever say to someone at a restaurant (I cannot believe she actually counted them) and D) a bold faced lie as she actually exaggerated the number of scallops included (there were only 4).   I don't care if this place had the best food in the world (it doesn't), I WILL NEVER RETURN!",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 2
    },
    "photos": [],
    "user_id": "DQ5Szn4T14ddEd6F5jHHpg"
  },
  "mDtBmeB-59oOO19iPn-JTg": {
    "date": "4/28/2015",
    "text": "Excellent Thai!!!  Not to mention the only Thai place in AS I've ever seen that serves Thai Boat soup! This blows Pho away. Trust me, just try it.  Suggestion: boat soup, pad kapow Thai style",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m35ODBrr76JYr20nxoMg_w"
  },
  "PGoTF-hO17WOz-aJLXZ9tg": {
    "date": "12/7/2016",
    "text": "Very very good Thai food. Probably some of the best in the Valley.  Service is ehh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yiOWRZlIsXKQkA8LjWdKsA"
  },
  "8LEVOOxjd8NeDxcgu09ozA": {
    "date": "7/15/2016",
    "text": "service was great and friendly.  Food was just kinda bland.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FU7ixq6FwqHUhDC1PCt-Lg"
  }
}