{
  "WKiuR9AU67Gj-JDnpfc75A": {
    "date": "2/21/2014",
    "text": "Omg.... So yuuuummmie  Just moved to the state and I can't express how happy I am to have a Thai place so close to my home and have it be delicious. The staff is amazingly warm, I am always happily amazed when a restaurant has amazing service.  I have not one negative thing to say!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bZURgbxLW7VHiqk45cafLA"
  },
  "4b-oZyYgyPbgxfUOi5v8oA": {
    "date": "8/11/2014",
    "text": "It smelled overwhelmingly fishy upon entering, which worried us both. Once inside, the service was good but nothing special. The pad see ew was oddly spicy and overcooked to the point of being dry. The cashew chicken was excellent  and very fresh tasting. There was plenty of leftovers to take home. The mango with sticky rice was good but we have had better. We would try it again but I would skip the pad see ew.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Isf8G6HPbNqEisKDjmUlbw"
  },
  "PXMyTqItWvjp1gvZ9ue2Zg": {
    "date": "6/5/2014",
    "text": "Great food..great service! Been here several times for both dinner and lunch specials. Convenient call ahead drive thru too! Clean and nice and cool inside :) Closed from 3-5 p.m.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "db63XAl6SUtp24F3X2_cUA",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Pad se ew",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/db63XAl6SUtp24F3X2_cUA/o.jpg"
      }
    ],
    "user_id": "laWI6zgPXi14RO4sKs7l0Q"
  },
  "4V93TRcVzOOP6ameHcJkKQ": {
    "date": "4/30/2009",
    "text": "Rating: 4 Stars. Very good Thai food.  What I Liked: The Garlic Chicken!! The Chicken Rice soup they serve before the meal was also very good. Spring Rolls are good. I haven't had too many different dishes here yet--I keep going back to the Garlic Chicken. But, everything I have ordered and sampled I really liked.  Room For Improvement: Although the servers were very nice, the busboy was slow. We had to wait for a while to be seated not because there were no tables, but because there were no clean tables.  Overall: Well, as much as I'd hate for this place to get even more crowded, I do recommend Thai Rama...wholeheartedly. You will love it...just like me...and everyone else. Now quit telling people about this place or I'll never be able to get a table.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "MxmBXeihpvyaB6Auv7Ce6g",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Front",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MxmBXeihpvyaB6Auv7Ce6g/o.jpg"
      }
    ],
    "user_id": "lU_aNRWw8edBmIi5_NARmg"
  },
  "JwFbUets_cEyRADFtLZzJA": {
    "date": "1/15/2016",
    "text": "Here is the thing, I absolutely love the food here. My grandpa and I used to come here for lunch all the time when he was alive. Customer service when you actually go inside the restaurant to sit and eat is good. Take out on the other hand is horrible. They don't answer their phones.... EVER! You would think they would since they even have a drive thru for you to pick up your take out but since you can't even call to make an order, it's useless.  Every few months I when I get a craving for Thai food I try to call but they never pick up. I think in he past 2 years I was successful one time after spam calling them for 10 minutes straight. Then when I drove through the drive thru to pick up my order, they didn't come to the window for at least 7 minutes. I was about to just call it quits and just park to get my food but just as I was about to leave once opened the window. If they actually answered their phones for take out I'd rate this place 5 stars.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NOEeBryAxOWFJoTkmbkckw"
  },
  "URIhomgbbtnji6DuWhz8jw": {
    "date": "12/12/2014",
    "text": "I haven't been back here in a long time and the restaurant certainly aged so much. It's old and run down. The atmosphere was not pleasant. We weren't even acknowledged when we entered. We were just standing there waiting for a few minutes before the server came to sit us down and it's not even busy. The food was not what it used to be, dry and not flavorful. We have had better Thai food and probably won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "juSEtD2gZFUIKk3Exqq_uA"
  },
  "Di4flozSnoh4is87F26pEA": {
    "date": "8/10/2011",
    "text": "We went here the other day for dinner, as it's close to where my boyfriend gets his hair cut and we were really craving Thai food.  I've been here once before, and remembered the food as being very good.  When we got to the restaurant, it was pretty busy and there were only two server working.  We were seated promptly and the server took our drink order.  We ordered Yahm Nuea Nahm Tohk for an appetizer (meh, it was alright - but I don't think I would have really LOVED it anywhere to be honest).  I also ordered my standard when going out for Thai food, Paht See-iiw.  Yuuuuuuum!!!  It was great, just what I was hankering for.  I was not disappointed.  My boyfriend ordered the Evil Jungle Princess curry, and also said it was quite good.  If you are looking for a good Thai place in the Chandler area, head on over.  However, I must give a word of caution:  because it gets very busy and they are short staffed, you DO have to wait a bit for the food and refills.  This isn't a sign of bad service though, it's just that they need to have more people working certain shifts :)!!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "h_wlFdm9wDzpkYhJqeg4AA"
  },
  "bIdSg7CPKcfrLxW0b_VpCw": {
    "date": "1/6/2015",
    "text": "Never been disappointed in the food here. Great hot and sour shrimp soup with mushrooms.  Fantastic curry! I like how they will modify the spice level on all their dishes for you too. Service is hit and miss . Sometimes I feel like I'm being rushed, and other times I can't find a waiter to save my life. However, I go here strictly for the food and it never disappoints. If they could get the service to match their food they'd be 5 stars all the way!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AwpqssE05DqRA05K1hKYFA"
  },
  "AHQRQYkNzphH1uKZIuW0tg": {
    "date": "9/12/2014",
    "text": "This is our \"go to\" place for Thai food. The Panang and Green curries are fabulous, as is the eggplant dish. Tonight I tried the tom kha soup and was thrilled with it; the coconut milk flavor without the heaviness of a curry with loads of seafood in it. Will definitely order this again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-jX8AcyAzYCW4fLDJB_yHA"
  },
  "9TJlrbXWw1wEF_T62JxWlQ": {
    "date": "7/24/2014",
    "text": "The food is always really good.  Come early for a table as lunch is popular and busy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qvi0FDVlw8lKZzw5MH2rWg"
  },
  "xCy8vHGhfHQb9TfmnKP6EA": {
    "date": "3/30/2012",
    "text": "Ordered potstickers, larb and split a yellow curry.  Potstickers very good.  Larb (although the menu spells it Lahb...so I'll bite on how it's actually spelled), very good.  Yellow curry we ordered mild.  It was very good but I'm not sure how mild it was.  I'm not a big spicy food eater, so while this wasn't unbearable, but it was spicier that what I'd call mild.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Lyj3OLJOGkqnjq2ZApa1lg"
  },
  "9WFQjkGnZ9XQnmvhwOwuLw": {
    "date": "2/23/2010",
    "text": "I've gotten to the point there I come by here almost once a week. Yes, it's addictive.   Their lunch specials menu is not very veg friendly, and neither is their free soup you get around lunch.  That said, almost everything else on the menu comes with a choice of meat, or tofu and veggies.  I LOVE both the Tom Kah and Tom Yum soups; even the half portion is huge! The salad rolls are also a great deal for $3.  If you come when it's crowded, the service is a bit slow, but it is given with a smile, and the food is great; taste and selection.  Their lunch special prices are super good, but even the non-specials are on par for a Thai place. Clearly, I come back again and again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZW217qAFcBZIFYQleDnm8g"
  },
  "_H-WibZyXFD_dTdsNeg8qA": {
    "date": "6/29/2014",
    "text": "Really good Thai food!  We got a mix of curry, padthai and another chicken dish.  This is the first Thai place in many years where the food isn't over-powered by fish sauce.  There's still a hint (hence the four stars vice five) but not too bad.  We ordered takeout so can't comment on the service, although, our food was done on time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZwwtUAcTl8DqbwW731j5Cw"
  },
  "DQapZWS204YtQv9KL-g67A": {
    "date": "9/11/2013",
    "text": "One of the best Thai restaurants in Chandler.  The lunch specials are a really good. But, I have enjoyed everything I have ordered anytime I have eaten here. The ambiance is nice too.  Service can be a bit slow, but I typically don't mind because the food is always good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pn0bMP9sfRzG3lFhS-X23A"
  },
  "yRRbQoxO3QRBTQlxDTaPPQ": {
    "date": "1/20/2012",
    "text": "I normally don't like to rag on a place but have been coming here for a while because the food is excellent. Excellent. But, the service has been consistently worse and worse. I'm not one to rag on a family place for bad service -- normally I'm not expecting super fast highway food. But, this place is getting to the point of ridiculous. Took us an hour and a half for dinner the other night. Not terribly busy. One server who was friendly and one busser who was doing... what? We couldn't figure out. Also, as one commentor noted, they'll let the phone ring and ring and ring without picking it up if too busy. Drove my boyfriend nuts and definitely made for a less than stellar meal.   Will we be back again? Likely. The food is fantastic. But we'll probably only go when we have an hour+ to spare.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p0zRZ5Ddw4YJ99btdtauRw"
  },
  "8I3lBY_yXTthP-J1p7FMKQ": {
    "date": "10/16/2015",
    "text": "this place is really good! we have tried many thai places in the chandler and this one is our favorite! they are very good service is very nice but sometimes takes a little long to get your food but over all SUPER! Yummy totally recommend",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oL79sfFg0c2t8vRCXBHaCA"
  },
  "ifdAbVSJlwNqEXKqh8LIAQ": {
    "date": "6/21/2014",
    "text": "My father really likes the fried rice and my mother likes the evil jungle princess. The soup is plenty for three people so Id recommend ordering smaller portion. The evil jungle princess curry is not as thick as the other curry. It is more like a soup.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WH4ZnhKi_o-0dk-K3z_MJQ"
  },
  "3QtnNp33x2oJ7xbxs8RrxA": {
    "date": "6/21/2014",
    "text": "I had the spicy thai fried rice, I have had much much better but they were the only ones open on Saturday so it was good. Other than that the service was great and the restaurant is clean.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JIKu8-mAW8jsjfbl6VVZNg"
  },
  "gbJC3pQzM3DcduSHLnnCCQ": {
    "date": "1/9/2015",
    "text": "The food gets 5 stars.  The service only gets 3+. Service was friendly but they did not have enough staff for a busy Friday night.  As for the food....the Evil Jungle Noodles (Med Hot) were awesome.  The cucumber relish that comes with the Thai Toast might be even better.  Will be making a trip back in the near future for sure!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUaWsPui6vPnOPQ1JgvuuA"
  },
  "FJP5-yG78y4vZBCLWUkX9w": {
    "date": "10/27/2013",
    "text": "The number 18 tohm yan soup is the best around for soup and noodle lovers. Thai tea is great too, but it is powerful. Medium to hot spicy will make you sweat, they don't joke around when it comes to spicy here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xrvwu2XlBi_fbHAs_n3fkg"
  },
  "XwHqLUkXmNHXxyJTYVE6fA": {
    "date": "7/8/2017",
    "text": "I have been going for years!! Food is excellent.  Mom the owner rocks.  Her son Josh is a great young man.   My favorite.  Tohm kah soup.   Evil jungle noodles.  It's all good.  This place is priced right.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jWV1lYxlz-xWP-hKIlKDYg"
  },
  "_97yZJrUAjfSq_PqYYsmbQ": {
    "date": "7/5/2013",
    "text": "Thai Rama is one of my most favorite places ever.  The place alone brings forth memories of the first time I ever even tasted Thai cuisine.  It was love at first bite.  Thai Rama is an intimate restaurant with soft lighting and relaxing music.  The wait staff is always polite and nice.  The food is amazing, always.  I've had everything from appetizers to desserts and everything is always hearty and filling.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "zFYs8gSUYDvXkb6O7YkRkw"
  },
  "sgOzYCiyNG1WDggczZWt5g": {
    "date": "5/13/2017",
    "text": "Very good food, and great service! I had the cashew chicken and it was awesome, not too hot but spicy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AzqweS6zqQRW9u5fCW8QKA"
  },
  "UrKYmRLY-FVg0uvwmHcCmA": {
    "date": "12/4/2016",
    "text": "Have been here a few times. Never anything too bad, but not that great, either. Ordered red curry take out tonight (substituted broccoli for green beans) and it was almost entirely bamboo shoots. I mean, it was so bad I still have this chemical taste in my mouth, which I assume is from the bamboo?  Tasted nothing like red curry at all. Sitting here wondering if I've been poisoned after reading about the insect problems at this location. 3 pieces of broccoli. I mean, this was terrible. I plan on calling tomorrow for a refund and returning the remaining portion and asking the manager, or whomever, to taste. If I'm still alive!  So disappointing as I was craving red curry tonight.  I see another reviewer experienced the same thing with the red curry and abundance of bamboo shoots. What a terrible, terrible meal.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qkM0RTcyjdt33oy7vZMLhQ"
  },
  "7hTl4GncothMUOWLT1TqVw": {
    "date": "5/17/2015",
    "text": "The food is AMAZING. Period.  The three star review is the fact when I call to place a pick up order 7/10 times it takes 20+ back to back calls to get them to pick up the stupid phone so I can place my order. I have complained about this a couple of times and it doesn't get any better. On the rare days where they actually pick up the phone to take my order the service is prompt, polite, and delicious every time.  Really sick and tired of the staff not picking up the phone.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "MQN36iJy-ecvVvMhg8Hjbg"
  },
  "7FHKmPo48FK_H2GnvGD5Yw": {
    "date": "9/8/2013",
    "text": "My friend told me about this place and she said the food was amazing so my boyfriend and I came to try this place out. This place is only two miles from where we live so it was nice that we didn't have to drive to far to grab dinner. We were seated right away and the hostess brought our drinks out fast.  My boyfriend and I ordered the Thai Toast, Tom Kha soup, Pat Si Ew and got Sticky Mango Rice to go. Everything we ordered was delicious. I really like that they have you four types of chili sauce to accompany your food. Usually most places just give you the red chili paste but I enjoyed the variety. Although the food was delicious I'm giving them 3 star because our service was horrible! Our server was super slow , did not come up see if we needed drink refills and after we were done with our food, we waited almost 20 min before he asked us if we needed our check. We also asked for a bag to put our leftovers in and he totally forgot. We eventually had to ask the hostess for a bag instead. The restaurant wasn't that busy so I don't understand why our service sucked. I would recommend just  calling in your order and picking up the good. ( hopefully they answer the phone because we saw the server pick up the phone and just hang up when the phone kept ringing)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jFTOYofCGdWL_FmSqBgYYA",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Tom Kha soup, Thai Toast, Pad Si Ew &amp;amp; Mango Sticky Rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jFTOYofCGdWL_FmSqBgYYA/o.jpg"
      }
    ],
    "user_id": "dlOYCLB7XKORL-BE9lnPnA"
  },
  "0p_pdssb0es26x0uqhJgmg": {
    "date": "4/11/2017",
    "text": "My wife and I have been coming here for 4 years. One of our first dates was at Thai Rama and we still consistently go on date nights here. Not much has changed since our first visit.  Always great service and delicious food. My wife always gets Evil Jungle Princess curry and I have tried just about everything on the menu. We definitely recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OjvRwE2k5GPLbbndY9vRNg"
  },
  "_VAjYvsTFOIrpJm87TbE5g": {
    "date": "2/24/2017",
    "text": "Definitely a hole in the wall but they have some great choices. Pad Thai is always a good option. Fast and friendly service. Great prices as well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ovqtunN8zGdCbYi-MCTAQ"
  },
  "VAEZ5txG-0uxXaUs6Ni0Og": {
    "date": "8/29/2016",
    "text": "This place is great! Food is always awesome and prepared right! Best part is the drive thru! I love being able to call in and grab stuff on the go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E0umyz7tHFVSwNszqJ62OQ"
  },
  "Ze3-Bkhbh30EP3-R6SLF6g": {
    "date": "12/10/2011",
    "text": "I drove by this place after work in Chandler numerous times and finally decided to give it a try.   I love Thai food but am particular about the Tom Yum soup.  This Thai Rama location makes the best Tom Yum soup, and I have asked for specific veggies, and they listen and make it the way I like.  I have ordered a side of veg and rice as well, and it's always fresh and delicious.   I get take out, since I'm often on my way home from work.  I go in around 4p, so it's an odd hour for dinner, so it's not crowded then.  The service is friendly, but I haven't dine in so haven't had that experience yet.   The only complaint I have is that sometimes on weekends, I call and call and call, and I never get an answer, so I make the trek up to the Thai Rama Tempe, which is similar but not quite as good.  EDIT in 2016:  I have dined in with Thai Rama several times: quick service, fresh and hot food, and decent prices.  The Tom Yum soup remains the best.  However, I would say a major change to my previous review - the Tempe location is not so good at all. This location compared to the Thai Ramas in Phoenix and Tempe far outshines the other two.  I'm glad I am in Chandler every couple weeks to enjoy this place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UJJYM5ZFG0imgJU9wQUuEw"
  },
  "1C3J6t2wCnEf2J-BC40MjQ": {
    "date": "9/18/2016",
    "text": "I came here with friends.  I have never had Thai food really, wasn't my thing, so I ordered the Teriyaki Chicken from the \"specialty\" part of the menu ($10.25), and when it came to the table it looked lackluster and was lacking in both taste and value. Not exactly the best thing to order at a Thai restaurant. The staff was extremely friendly in allowing me to return the food and get something else from the menu.  So... as a responsible adult... I ordered the Chicken Tenders with Fries from the Kids Menu for $4.25. It was pretty good. I am guessing it wasn't custom crafted in the kitchen but nonetheless it was probably the best Thai food I've had in my life. It should be noted that they presented the plate of Chicken Tenders with Fries on what I assume was my old food plate, along with a healthy dose of Hunt's Ketchup packages, which was very fancy.  I left a $5~ and something tip because I felt bad about sending the other food back and then ordering Chicken Tenders with Fries from the Kids Menu. It was all good though.  Best Thai Chicken Tenders out there, hands down.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g2NmbbSpB9-dVUlY1VX2nw"
  },
  "3uADXkAtJmCswGMdP63lhQ": {
    "date": "3/13/2015",
    "text": "If you want to eat here, try to come during the dinner hours.  The staff during the lunch shift is so incredibly rude and has always made us feel so uncomfortable despite being multiple-repeat customers.   If here for lunch, I and my significant other are often rushed, pestered, pressured to buy more and stared down for the majority of the time making us feel so incredibly uncomfortable.  On one occasion we were in the middle of eating our lunch when the waitress came over to our table and actually told us very rudely that we would need to \"hurry up and finish\" because they needed to close to get ready for the dinner shift.  The dinner shift, although a much more pleasant and entirely different atmosphere - sometimes as equally if not just as rude servers/ hosts as day-shift.  Also, the last time we were here, my Fiance' found a thick little strand of jet-black hair in his pad Thai. We have since decided to stop coming here altogether, which saddens me because I have been coming here for years.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "r4XbnDy5H2RzRkplgs9sOg"
  },
  "SOdjbVi32HGOzb14N3MHyg": {
    "date": "6/8/2016",
    "text": "The food here is DELISH. They have really good service and it's fast! I love coming for lunch here because of it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "t7DWQuhGU--1ho1KtfXD8g"
  },
  "nOSPJhcEo8yMTMirEJ71Hg": {
    "date": "7/28/2017",
    "text": "This is our top favorite Thai restaurant in Chandler! We especially love the Evil Jungle Noodles, green curry, and Mango Delight. We always top off our meal with the sticky rice with coconut ice cream. We eat here at least once a week. The staff is super friendly and the service great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ejV2lkcTc2Td-0g7IK9zEQ"
  },
  "4ocC8-kKp4i6q_Dc3iJcoA": {
    "date": "4/28/2016",
    "text": "It was a Friday night and the family and I were headed out for dinner. Our regular restaurant had too long of a wait, so we found this place and thought we would try it out.  After we were seated, the hostess brought our drinks and took our order. There weren't many customers so I thought it wouldn't take too long for our food, I was wrong, it was about 45 minutes until we had our food. The food was very bland. The hostess that was supposedly waiting on us, rarely came by to fill drinks, or remove plates. When it was time for the bill a young man came by and introduced himself as \"Jeremy\", this was the first time we had seen this guy. when we paid the bill we noticed that they added auto 20% gratuity, which came to an $11 tip to a guy that never came to our table. I never have a problem leaving a decent tip, when they have earned it. In my experience when auto gratuity is added to a customers bill you can count on not seeing your waiter or waitress until its time for the bill. It's pathetic when businesses put the burden of paying their employees on the back of the customer.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "b4Ddo7zq9HJsiwZ1B6cfIA"
  },
  "_8F9WyYCSZM3bzenRDFSGA": {
    "date": "7/2/2016",
    "text": "Best Thai food in the East Valley!! Customer service is not the best but the food makes up for it. Best Pad Thai and Drunken Noodles!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H949jUB6z_M6cvK88em3xQ"
  },
  "mgh1nhBaDz03KX4tkMU4Pw": {
    "date": "5/24/2016",
    "text": "Every time I want to order from Thai Rama, no one answers the phone... So I've been frequenting other Thai places. The food here is decent, but the chicken used in the curries is not very good. I normally order beef from here for that reason. The drive thru is great for pickup orders if you can get someone to take a phone order in the first place, and I love the Thai iced tea (large to-go).",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SBFwL9OhG5VPWXuzMxm7bQ"
  },
  "SZQ0jUaPpxx8ebaOoBNlxQ": {
    "date": "11/15/2016",
    "text": "The food is excellent noodle soup and the red curry with green beans was enjoyable . great VALUE for your $",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5wOVUkOH5ftl5o1hk19aDw"
  },
  "DV6sZyMF9wHDJsknGrHO5g": {
    "date": "7/30/2013",
    "text": "I had lunch here with my team to send of a co-worker who is leaving. The lunch specials were a little different than what I am used to. I hadn't heard of a few dishes that were listed. There were about 15 of us and it didn't take that long for our orders. I ordered the pork with pineapple, others tried the pad see ew, curries and and pad thai. I could tell that the pineapple was not fresh but it wasn't bad for less than 8 bucks. The iced tea was very tasty and refreshing and I will for sure try the Thai iced tea next time. There wasn't an empty table in the whole place. All lunch specials come with soup and an eggroll, both yummy and seasoned well.  Take it for what is, a quick and easy Thai place to grab lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-8rSnT5ztVk6vmTDkxTqsQ"
  },
  "LQKPYebKDSvGX04zcWJmIw": {
    "date": "1/19/2017",
    "text": "Tried at lunch today. They had the best Thai food I've eaten in Phoenix. Big portion for lunch with enough for leftovers. Only downside was the time it took for them to cook & bring to the table, so I wouldn't go if you're on a tight lunch schedule.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ijg2bxA4lCiGnsgf0QDZ1A"
  },
  "sjZblzj7wJqmNqfamlK43A": {
    "date": "12/30/2008",
    "text": "The Thai place in the area.  I really enjoy the general feel of the place, the staff is very friendly and the remodeled facade makes it appear much classier. The color and lighting are a nice balance of light and dark, giving the restaurant a comfortable, private aura without appearing cramped or dim. While the dress code is casual, I'd feel perfectly comfortable coming here on somewhat dressy occasions. I've eaten here many times and have never disliked the food. Portions are generous while prices are low. Unlike many other places I've been to, medium here actually is moderately spicy instead of \"just short of our absolute spiciest\". The meat is always delicious whatever form you're eating it in, and the curries are spectacular. Don't forget to get some Thai iced tea with your food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fr5rftewEA5lVV5edJjCpw"
  },
  "IoTUp-RWbwIU-h__xIi8dg": {
    "date": "10/19/2011",
    "text": "This is my 2nd favorite go-to stop for Thai food, mainly because it's close to my house. We usually order take-out but occasionally dine-in. Our favorites are #43 Evil Jungle Noodles, #35 Panang Curry & #34 Yellow Curry. I agree with other reviewers that service here can be inconsistent. We've sat around clearly finished with our meal (we call it \"being held hostage\") waiting way to long for someone to bring us our check/boxes for leftovers. This is mainly the reason we get take-out, but the food here is  consistently good. Oh, and their iced-tea is excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SIu20enYXQozQ1vxOKICcg"
  },
  "tOaCyWMLcH9L8fJcCyHyJA": {
    "date": "2/19/2012",
    "text": "except for the pad thai and chicken satay, the food is very good. the chicken in the satay was gristly and tough. The service was very good. They must have seen the bad service reviews and gotten their act together.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j4fEYMhhpsfXHCHCrH25Gw"
  },
  "KLhfa5uitO3m1HQL_6WEew": {
    "date": "9/2/2011",
    "text": "My wife and i went for lunch last week.  The food was so so and the service was a bit slow.  We both got lunch specials that came with soup, spring roll and fried wontons.  The soup was not what I would call a traditional Thai soup, the spring roll was too greasy, and the wontons were bland.  My wife got the yellow curry and I got Panang.  I ordered mine \"Thai spicy\" but it was more like medium.  Next time we go for Thai we'll try the Thai Cafe which is just a mile or so away.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mm7Kxz3iOMueuS7yEp_DOw"
  },
  "BKX7Pwto1lUJopxE_NFQ4w": {
    "date": "9/15/2013",
    "text": "Yuk!  I tried this place based on seeing favorable reviews on Yelp, but this is not good thai food.  I'm not sure why people think this is good.  The food is not very fresh and does not taste like it should.  I guess if you have never tried good thai food, this might be good to you.  Don't waste your time and money if you are looking for a quality thai meal.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-iuUaoQXVoXJZNfEUKsQHw"
  },
  "NfJ4216JKHOUsoZq9FXIHg": {
    "date": "1/13/2009",
    "text": "I got on a Thai kick last summer and ate at this place 2 or 3 times a week for a month or so.  Service was friendly.    I tried different menu items each time and never found one I didn't like.  Consistantly good food and service.      They only had one Thai beer and that was in the bottle, bummer.  Atmosphere was OK.    I started using the take out window towards the end of my run and liked the convenience.  May be too convenient.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dc51eINRfoB6AXBDVCg-1g"
  },
  "H7-u37pK71TTsOHhk-OWXA": {
    "date": "11/20/2011",
    "text": "My girlfriend and I are Pad Thai enthusiasts - this place didn't measure up. I can't speak for the rest of the menu, but what we received was bland and tasteless. The drive-thru pickup window was awfully convenient, though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yiFriyYdT1QpLBnKr3uBcA"
  },
  "nFoUP0oG8nrAxh5NhR0tqw": {
    "date": "11/14/2013",
    "text": "Lunch specials are good! The garlic chicken/pork, bbq chicken and pad woon sen noodles are to die for. Get them medium spice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xp-94I_U60hiVdSA9hKctQ"
  },
  "qHLOrQQPG6864bKGG_tXoQ": {
    "date": "8/14/2011",
    "text": "The yellow curry here is unbelievable it is the perfect blend of spicy, sweet and fresh. If I could have this to eat every day I would be happy as a clam! Yes the service is slow, but you can't rush perfection!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "snzUv02J3cl-u0gk8iddpg"
  },
  "N3C7bd2hPGqoEBs1uXxvZw": {
    "date": "5/18/2011",
    "text": "Tried Thai Rama in Chandler for the 1st time.( Chandler Blvd/ Dobson.) The place is small, clean, nicely decorated and comfortable. I'm not very familiar with Thai food, but was feeling adventurous and was craving spicy... I asked the friendly Thai waitress for some suggestions and she explained that you can order most of the entree items with your choice of meat or seafood, or even tofu as your protein choice.  Plus you can order with different degrees of spicy and they have chili sauce, and red chile powder and jalapenos on the side, to \"add heat\".  I started with a  spicy grated papaya salad...EXCELLENT! Also try the Thai Jasmine tea. Nice subtle flavors.  After a few questions and the suggestion of my server, I also tried a wonderful curry dish called \"Evil Jungle Princess\". A creamy, red curry dish with veggies, served with rice (also available with noodles) and I chose tofu as the protein. I ordered \"Med hot\" and that was just fine , because I added the red chile powder to heat it UP to my desired level. (hint: You can't really tone it down if you order it too spicy, but you can always add more spice , if it's not)....The Evil Princess was absolutely delish! Anything BUT evil! I am still thinking about this sweet princess!  It was a very quiet night and the service was a little slow, but I was in no hurry.  The food was prepared fresh to order. and I really enjoyed the new dining experience. This locale has a drive up window for  phoned in to-go orders and I understand they do a booming biz for lunch. I WILL be back and I am bringing people with me! I think a big party could order different items from their vast menu, and everyone could try a little bit of this, a little bit of that....I loved this place and I encourage you to try it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fV96v1Tt8JzliIYe_PbXBA"
  },
  "5NhZA6g7y01hHvCB7p_14w": {
    "date": "8/17/2010",
    "text": "The chicken was stale and undercooked. This place was much better earlier, it seems to have deteriorated  over time. I wouldn't go back for sure .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O9irkLTJlrfzkbW7Toj5zA"
  },
  "WwcyOKR_qsfYshkHsreaVQ": {
    "date": "6/9/2011",
    "text": "If you've come to Phoenix from a big city that has good asian food, as I have, then you probably know what I mean when I say that it's really hard to find the same thing here.  I really love Thai food and Thai Rama is the best I've found in the Tempe/Chandler/Mesa/Gilbert part of the East Valley.   My two favorites with any Thai place are pad prik khing (available also on the lunch menu) and drunken noodle (listed under the Thai name at TR).  My third, \"once in a blue moon\" dish, is panang curry.  They do all three well, with the pad prik being the best.  I've come here 25-30 times over the last five years and never once had a disappointing meal, nor have I ever had poor or slow service.   As many a reviewer has mentioned, the lunch special is a real bargain that will fill you up.  I think they have ten items or so available for that, though it's not the full menu.  It's great to see that they've finally gone to seven days a week.  In the past, their only weakness was that they were only open six days a week (like so many independent places).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NFfR5mRdmKOd_Wd2R0D8UA"
  },
  "bdqwnhe20vkrxJwnZRJ1Kw": {
    "date": "8/7/2011",
    "text": "I heard about Thai Rama from several friends and have seen the parking lot packed several times, so my husband and I decided to try it. There were several buckets laying around the floor catching leaks from the roof. No, it wasn't raining, but the place looked dated.  Our waitress was nice, but not attentive. We ordered the Satay (6.55) for an appetizer and the Paht Pik Thed (Pepper Steak) with chicken and the Shrimp Snow Peas (10.95). It took F-O-R-E-V-E-R to get the Satay and another 30 minutes after that to get our entrees. I had already finished my Thai Iced Tea and half a glass of water, with no request for refills.   [Another lady across the dining room had ordered food to-go (before we arrived) and was still waiting. She began complaining after the waitress came out and told her they had only just started on her Mango Delight, while her Pad Thai had been sitting in the to-go box, waiting. She was not happy, to say the least.]  Despite the wait, the Satay was very good. Unfortunately, both of the sauces that came with our entrees were very watery and we had more meat in the appetizer than our meals. The sauce was so sweet, I could not eat the pineapples in the dish. The portions were also small for the price. Finally, I was asked for a refill after our waitress took our plates away. It took another 5 mins to ask if we wanted dessert. My husband insisted we try the Mango with Sweet Sticky Rice (3.95). Thirty five minutes later (yes, we timed it) we had our dessert. It was not bad, but I was done with sweet stuff for the night.   We set the credit card out on the table to be taken with the plates. Once again, we had to wait for that. The waitress finally took our plates away, then returned to tell us she would grab our ticket. The card was still on the edge of the table. A few minutes later, an extremely rude waitress (not ours) passed our table, threw the receipt book across the table, and gave us a dirty look. What was that all about and why the heck didn't she take the card?! She stormed back over to collect it, with the same look on her face. There were no words exchanged with this \"lady\" let alone with our own waitress and we were extremely patient and low maintenance considering the wait and quality of the food. We paid, and got the heck out of there. In the end, we had spent over 2 hours, $45 and I still could have eaten something on the way home. After that experience, I will not be back.  Overall:  Food was not worth the mood we left with.  Service was sooooo SLOW! Spent over 2 hours there for just two people!  Waitress never checked on us, I was asked if I wanted a refill after my meal.   No sense of urgency among the three waitresses and the seven full tables they had.  Phone was constantly ringing loudly and no one picked it up even though all three waitresses walked by it several times. Annoying!! Not to mention, for the person on the other side of the phone.  The table legs and feet were too bulky in the booth. No room for my feet and I'm only 5'2.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gxef_HOT0cmRGxUzFcZVIw"
  },
  "tr43BXf8UG0GlkaM1ABxmg": {
    "date": "3/8/2010",
    "text": "i am not huge fan of thai food.. but my friend wanted to try \"thai rama\".. well it exceeded my expectation!    flavor was intense!!  service was not the best.. but good enough for me to come back for more..   i will write more review once i revisit the place..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xiEcNDwKwrbcf5NaL21oew"
  },
  "ZubgToQzgywNPVSWPINZKg": {
    "date": "12/12/2007",
    "text": "A fine dining experience or a drive-through window for fast, delicious Thai food!  Everything I've tried on the menu is delightful!  My personal favorite is the Evil Jungle Princess noodles.  The chef allows you to select \"mild, medium or spicy\" for your entre.  The appetizers, particularly the fried tofu, are delicious and perfect for that short wait before your main dish is served.  Most menu items are under $10.  There is virtually no wait ever for seating.  They have several wines and beers to choose from, in addition to their enormous menu.  This is *five star* dining at *two star* pricing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "UihwIwmqO9TUfDHRXg8G2g"
  },
  "QS3w0ohfiVcnrRtNyhuY0w": {
    "date": "6/5/2010",
    "text": "Great Paht Thai! And I'm very picky about my paht thai. Also I loved the thai iced tea and the fact that they have lunch specials on the weekend that comes with soup and an egg roll. The tohm yahm soup was VERY delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RLlkdJ1ZGnNLEv1qATVQ7A"
  },
  "dok1QQHnEEmUnG2Fvj_mLQ": {
    "date": "5/14/2013",
    "text": "Delicious food and friendly staff! My new favorite spot for Thai food :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n7lZHi4Sfg9ohlS7ImZsuA"
  },
  "ODnUpkZdsL5CZY_X_aVNjA": {
    "date": "4/10/2008",
    "text": "i've been to thai rama off of camelback a handful of times, but i just recently found out about this locaiton. i live on the border of gilbert and chandler and i was thrilled that they had this locaiton.   oh my goodness...this is just absolute yumminess!!! i've been inside to eat once while a friend was visiting from out of town. it is such good food!! i ordered the yellow curry and she ordered paht se ew. both were excellent dishes!! the service was pleasant and we had a great dining experience.  since then my husband and i have ordered to go and we haven't had anything but wonderful dishes from here. it has quickly become one of my favorite new places to eat!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ZjasrJi5z-3BZ5DMGU9CxA"
  },
  "Y6fDpZ0vpHpVtR1tdSIPiQ": {
    "date": "2/28/2010",
    "text": "Thai food has been a way to escape Chandler and send my taste buds to an exotic land far away from here. I have always been interested in finding Thai food restaurants, and since my favorite location closed I decided to try Thai Rama. I have eaten at Thai Rama more times than I can count on one hand; that's how pleased I am with the food and service.   On my last trip to Thai Rama I ordered the number fifty-two with chicken, as it comes with your choice of meat, also known as pineapple fried rice.  It cost less than ten dollars for a meal that could be split between three people. I have never heard of adding pineapple to rice, but the explosion of pineapple against the spice of the dish was exquisite and worked quite well. The restaurant stays True to their heat specifications. Mild, being no heat, Medium only having a bite, Hot with a serious kick and I guarantee you can imagine Very hot.  A group of friends and I, all together four of us, entered the restaurant around seven and it was slightly packed with only a booth and table open. We were immediately seated with our menus and were soon visited by a friendly busboy who came and took our drink orders. He was back in less than three minutes despite how crowded the restaurant was. Our waiter arrived not long after and had no trouble waiting for our indecisive eaters and answering questions to appease our curiosity. The food was served efficiently and our waiter checked on us the right amount to see if we needed anything.  We split the check four ways, each of us paying less than ten dollars. For the amount of food we received this price was phenomenal. I would definitely come back to Thai Rama over and over again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yL22YkOIke18F0iKrP2Tpw"
  },
  "-TAwFWrl9JsacGloAby82g": {
    "date": "3/17/2011",
    "text": "Everyone loved the food.  Thanks, Yelp.  You helped us out on this one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TQiwGgtBfFXzTT_GiHK3wQ"
  },
  "8OxF7oLNoIiGAJtdU7rTdg": {
    "date": "3/14/2009",
    "text": "This is my favorite Thai place in the Phoenix valley. Never had a bad experience here.  Every dish I've tried has been great,  the prices are reasonable and the portions are generous. I always have leftovers to take home.  My recommendations are the Mussaman curry, the Phad Thai and wash it all down with a Thai tea. For desert? The mango sticky rice.  I think I'm going to have to go here for lunch today.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FlWVOSfv9k7FKPo4j_C1dw"
  },
  "Rpf_aiuTxpB3veSZHsnbyA": {
    "date": "1/12/2010",
    "text": "OK in a pinch but really very average when it comes to Thai food. Decent lunches but not a great Thai place like Lattitude 8.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8SSaCgmvsztEOg2CqeXxnw"
  },
  "CAZt4LkQGl6ArXOmvNhSdw": {
    "date": "7/3/2008",
    "text": "Went in for a take out (this seems to be a habit with me these days)...  Yellow Curry Chicken with rice Sticky rice & peanut sauce  Fast & friendly service, tasty food, nice atmosphere. I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fgXIN9dWamEPphjdcyDD_Q"
  },
  "QU0MzXnCNGVOoWuP-iuufQ": {
    "date": "7/26/2011",
    "text": "My coworkers and I come here a lot for lunch and we all really enjoy it. Their lunch portion is the perfect amount of food and comes with delicious soup. I've tried about 3 different dishes but mostly I get the Panang Curry (Thai Hot 1). They have like 10 different levels of spiciness with extra levels that are not even on the menu. I took some friends and family their for dinner once and my Dad got this crazy seafood dish that came out in an aluminum foil swan. He just raved about how delicious it was. I've never had a bad experience and recommend that you give it a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tcRgbLZkOL3gClNynlbPUA"
  },
  "KYD8LiCknhYy-4HOjIO74w": {
    "date": "12/16/2009",
    "text": "The best Thai in chandler by FAR! the jungle noodles will blow your mind but they are rich. great prices too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PhmneRPozf2cDIiFyGGlOg"
  },
  "A-CEb7N3jitXbfKlrhWXnQ": {
    "date": "10/20/2014",
    "text": "My family and I love Thai Rama.    The food is always good and they have take great pride in their service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "olXgBYjpxDEk1NEp6xFoAA"
  },
  "ebA5cB2H0w_ZJK7TcX6JYA": {
    "date": "2/10/2010",
    "text": "I like coming here because the lunch specials are great and filling and they are consistant.   Try an order of peanut sauce with the pad thai. Great combo! Love the soups",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fg_im0xZp7MhnV5RYD6Sag"
  },
  "hy4_uIBsWmtbjl-lAXUcdQ": {
    "date": "12/6/2009",
    "text": "This is a great place to get consistent asian food. Its not amazing, but always good. The decor inside is like every other Thai place you've seen, and of course has the mandatory paintings of Thai royalty.   I really liked our waiter. He was funny and he and my dad talked all about their new Google Androids. Our waiter even showed us how to put the protector cover on the android without bubbles. Sometimes waiters are annoying when they get all friendly like that, but this guy was cool. He was great about filling water, bringing requested hot sauces, and bringing us chopsticks too.   And the prices are VERY reasonable. Most of the non-noodle dishes come with rice, whereas at other restaurants you have to order rice separately.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wbwv4at33RscYwinLrxA4A"
  },
  "82kKK7hcfpB1QVmxTF3Zbw": {
    "date": "2/2/2012",
    "text": "Awesome Thai food here!! My favorite is the yellow curry.  We eat here a few times a month.  I will agree that the service isnt the best or the fastest but sometimes you can manage to get in and out in a decent amount of time.  We recently ate here for lunch and the curry wasnt up to par, so we pointed it out to one of the waitstaff, she offered to bring a new plate of it, but its all cooked together in a big pot, so that didnt really make sense. Then the owner, who is the cook came out and TOLD me that it is the same as it always is, and was actually irritated that I would even question her cooking.  The friendly waitress that offered a new plate even said to us that the owner was **** hurt that a customer wasnt happy.  If I owned a place, and my food was off a day, I would want a nice customer to carefully point it out and correct it, not argue that its how it should be. Of course we'll eat here again and again and again, because we have had many great meals here.  I just wish that owners and staff would recognize in this tough economy, that they should take care of their customers, and treat them kindly and recognize that sometimes people need to have quicker service because they need to get back to work, or just dont have a few hours to hang out waiting for the check.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YjOQIt2FLTwacAqrxug5gA"
  },
  "spMoDDoU2K9FVrbt8x57aA": {
    "date": "2/5/2013",
    "text": "While visiting, I checked out Yelp for Thai food in the area. Originally, I wanted to go to a different location, but it was closed on a Sunday. We came for an early dinner at 5pm on Sunday. No one was there probably due to Super Bowl. Shortly after we sat, five other families came in. I ordered their house salad and added tofu with their peanut sauce dressing to share with a friend. Yum! I loved their large chunks of fried tofu and their peanut sauce was super tasty.  For dinner, I ordered their #41, my favorite Pad Thai with shrimp but it came out with beef. I was little disappointed it had beef, but I was hungry. I wasn't impressed with the sauce they used it wasn't all that tasty but I was hungry and ate half portion. My friend order a beef pho, she thought it was okay. She thought the broth tasted a little funny so she asked the waiter for some limes. It seemed to help. She wasn't able to finished it all and good it to go. The service was great and friendly. Decor was good, a little old fashion. The game was on but no one was interested in it. Prices were good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "aBAaoY691et3-iHF2bG_qQ"
  },
  "lKheNSoNIxe2QYEas9Lgdg": {
    "date": "3/24/2014",
    "text": "Went here on a Monday night and it was empty, so the service was awesome! The food was delicious and just the right amount of spicy. I thought the prices were very reasonable and we'll definitely come back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sgquvluHhQSNnqXnGYsGGg"
  },
  "X2aFPPbkn57czm1fan_1Kw": {
    "date": "3/12/2014",
    "text": "Food is great. I love the evil jungle noodles. I'm only giving it 3 stars though because several times when I've tried to call in an order after 5pm, nobody answers. I guess that's because they are busy, but they really should have someone available to answer the phones.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uau2qBwFklWaS3Gdbf3Pow"
  },
  "g-2nZpRYd2f7pZZ7wNCJeA": {
    "date": "1/27/2009",
    "text": "I went with a group of women and we had a nice experience.  I ordered the salad rolls for an appetizer and was disappointed.  I didn't think they were very tasty at all and the dipping sauce was tasteless.  When my meal came I didn't get what I had ordered but was brought Pad Thai with tofu instead.  I didn't complain and very much enjoyed the Pad Thai.  I will go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bhJ6ivAuSpgXP4JiKWjSZQ"
  },
  "Rly3Dj8tJz9n4sWjUXv0_w": {
    "date": "7/17/2014",
    "text": "We had the Chicken Pad Thai and Thai Fried Rice and it was AMAZING! We've tried several different Thai restaurants, and this one is close to the best! Customer service was exceptional and best part about it, there's a drive through for pick-up orders!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gdgi3clJjCKtdUzifOLq6Q"
  },
  "VGvDLC69mdKq9F4DVWKolA": {
    "date": "8/4/2011",
    "text": "The best Thai food I have found in the East Valley!  Great staff, great decor and atmosphere, very reasonable prices, convenient, and fast service.  The spices and textures of their food is just right.  Lots to choose from and has good lunch specials too.  All the hip Thai places I've been to in Tempe and Gilbert don't compare.  My favorite is the Mamuang Himapan (#25) and the Tohm Kah soup which has a really cool presentation too!  Would suggest for dates, family night, special occasion, anything.  Love Thai Rama in Chandler all around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GO9GAnJySUSy3xCLTM1lxw"
  },
  "JLhjrY2Gqgyc7JJCXyzLGQ": {
    "date": "10/14/2008",
    "text": "The food was ok... wasn't very special.  My wife asked for \"Thai Hot\" ... got maybe a medium.  I asked for \"Medium Spice\" and got hot.   The service is still horrible.  I moved out of state for 2 years and during that time, the service didn't get any better.  I had to get up and ask for my check because the waitress was busy talking to a co-worker.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qOn1VFThKD5y5zrFEQXpGA"
  },
  "uRY_jVjLbRiLPJlXFV8mgQ": {
    "date": "1/3/2009",
    "text": "I've got a serious lack of Thai food in my area, so it's always a nice treat to come here. We do lunch here at least once when I'm in town.  Good quality Thai staples here - I almost always go with the basil chicken - and you do get the option of naming your spice level. The heat levels are just about right, but I never quite push it to the limits. Plates are a good size for the money, and everything I've had or tried has been worth it.  They are closed on the king's birthday, so that's a big plus on the authentic Thai scale.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G2JklQpWpyoCK-2N4hXw6Q"
  },
  "YtSxp_Md99OBjtc2JgH-GQ": {
    "date": "9/22/2011",
    "text": "I'm picky.  I'm real picky about Thai. This place is clean, has a good menu, dares to prepare spicy curry that has depth and taste. Has a great staff and the ambience and vibe is relaxing.  Just plain good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HiW9i_ZR6njGLphh8TlvpQ"
  },
  "MLhJXPnSnxQSP8ViQYNZ6g": {
    "date": "2/25/2009",
    "text": "I've been to the phoenix Thai Rama several times, but since I've moved this location is closer to home. I've never eaten inside, only done take out. Both locations are awesome!  I always get the  Tohm Kah soup and Kattiam Pik Thai, both chicken, and very mild cause I'm a whimp. My girlfriend gets the Paht Priaw Wahn, which she loves. Its not that we don't want to try other items on the menu, but these are so amazing its hard to try anything else.   The soup is this strange buttery coconut mix that sounds like it wouldn't be good, but after the first time you try it, you'll start craving it, its an addiction. The Kattiam Pik Thai chicken is juicy, and the portions are overly generous, same as the soup. The sweet and sour paht priaw wahn with chicken is to quote my girlfriend \"its delicious yummy and tasty, the chickens good, the sauce is good\" shes eloquent, lol. But getting her to love a food other than cheeseburgers is amazing, so this must be pretty damn good.   Theres a little drive up window just like a drive through, and its great, don't have to wait inside all awkward, but careful, the food is so hot it sometimes melts through the styrofoam containers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-8MACpGwGFRa-oyecgJRRg"
  },
  "1qUUuMSniELEzmh47TrvRw": {
    "date": "11/19/2010",
    "text": "Best Thai Restaurant I've tried, beats Thai Basil and Swaddee Thai in Chandler. I've only gone there for lunch, I love their lunch specials: soup, spring roll, Thai chips and an entree for under $8! You can ask for hot Jasmine tea as well - it's free!  The food is less Americanized than other Asian places I've tried. They are usually really busy at lunch, but I've never waited long to be seated. The waiters are attentive.  I recommend trying their garlic chicken or their sweet and sour chicken. There is plenty of white lean meat in all of their chicken entrees!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5gDUxxyjdEUxw4tF4z_fkg"
  },
  "VPIWtcLzdXFPUibJECStrw": {
    "date": "8/31/2016",
    "text": "They must really be doing well cause they pick up the phone for pickup orders about 30% of the time.   I can't tell you how many times I've had to change my lunch location.  Note: Food is great though.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I7yYnZmIfjHEMmi5MtLR1w"
  },
  "V_93hQYB7eeVV1_rIYWIuw": {
    "date": "6/2/2018",
    "text": "This place is good... great food, fresh .  Always my pick if I am in the area and craving Thai food.  Typical Asia restaurant, casual, quiet... love the food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GYo1Smj8SAtJE-PAkYAocg"
  },
  "pItpK9RP9lBAYdNlwvskCQ": {
    "date": "2/8/2017",
    "text": "Best economical thai fast food. Could improve decor and add more servers at rush time to improve service time. Food is fresh and healthy. Must try",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "filKZI7zLvE4XntdaWekIg",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Tom kapoor gai soup very good.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/filKZI7zLvE4XntdaWekIg/o.jpg"
      }
    ],
    "user_id": "YfJz5ObUA8HRIizDCxysXw"
  },
  "7c0rYyaqrb2eXAVDPEbxpA": {
    "date": "8/5/2017",
    "text": "The people there were very nice but my food was cold and the Pad Thai was nothing but noodles, had very few vegetables and was kind of bland.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UG2y54Iri9q2h4bZMyD1Qg"
  },
  "TSFASXdtqOq89mlMPKn7yQ": {
    "date": "10/7/2014",
    "text": "One of my two favorite Thai restaurants.  All the food is top quality, very tasty, and pretty generously portioned.  The service is consistently friendly and efficient here.  Price is good.  Love their spicy garlic (you can get it with any meat).",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "jzkbhkRdjWPwTIOgRGggIg"
  },
  "SV00fOfN-ZTYgx4GqINtpQ": {
    "date": "5/7/2017",
    "text": "Sad to say but this place's food quality has gone down considerably well since I first started coming here. Very dry :( I dont think I will be going back. Such a shame :(",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2KVkcCHRlubSCaPoBl1MGw"
  },
  "TL1ZEsAwDisgZsTLUB01sQ": {
    "date": "6/7/2017",
    "text": "This is one of my old favorites that I take my friends and family to.  I love the curry dishes here, especially Panang Curry and Evil Jungle Princess Noodles. They have brown rice, which is a plus.  The service is friendly, the owner will come out and talk to each table if she is there.  The Thai tea, both hot and iced, is well worth it.  The menu has something for everyone who likes Asian food in general, from Teriyaki Chicken, to very exotic dishes.  My friends and family always have loved what they get, the food has been consistently great over the years.  If you're in Chandler, check this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e0PZMZTm0-_lOEoUwPOQzQ"
  },
  "jy4JUr-yiyDxIdX4rjQ-wA": {
    "date": "7/7/2017",
    "text": "Came here for lunch on a Friday with my husband and toddler. We got seated right away and it was pretty busy. We sat for about 15 minutes before our waiter even came to take our drink order. We decided to order food at the same time. Our waiter never came to check up on us, drinks were never refilled, and we wanted to order additional food but decided against it because no ever showed up. When it was time to go (after waiting for 20mins after we were done with our food)- I had to flag down someone at the counter to ask for the bill. Our waiter walked by us multiple times but he never made eye contact and it was like he was speed walking so he could ignore us. We noticed another next to use who also waited forever to get his bill and when we got there he was already done with his food. The food was okay but I don't think the lack of service is worth going there.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q8ONScArmCfJvQ8W9IpWEg"
  },
  "UIt5lJuRik-vmPHKv2luXQ": {
    "date": "10/30/2017",
    "text": "This place is very nice and food was amazing our waiter Adam was great all in all we had a very pleasant experience i recommend this place to every one",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I0wxBv0oo4-6Yb8J7mbU6g"
  },
  "PRi3HqTaP551JMbu_sCbQg": {
    "date": "8/8/2017",
    "text": "Never disappointed when we come here. I've been to many Thai restaurants in the chandler area and Thai Rama just has the best flavor and consistency. It's always my go-to Thai fix. I eat there once a week. I highly recommend the pad si ew, I get it almost every time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HdaPyYRBmEQb7S0_WvG_Cg"
  },
  "1xr7jTEsOptATtHIF2rE0w": {
    "date": "8/5/2017",
    "text": "Love this place! The egg rolls and potstickers are the perfect appetizers. The staff is always so nice and helpful with making suggestions on what to order.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KMLWHIuh-8raR725DocxQA"
  },
  "xHw3XbRbQ6bs2AHzXmu3Fg": {
    "date": "5/17/2017",
    "text": "I recently visited Thai Rama during the lunch hour.  My expectation was that there would be a moderate wait time due to the lunch crowd, however, we waited at least 20 minutes after we were seated to even have our drink order taken.  We went ahead and ordered our food at the same time that the waitress finally showed up to ask us what we wanted to drink.  We ended up getting our food about 15 minutes later.  The food was good, but the wait time was excessive.  We contemplated leaving twice during our wait but decided to stay because the food is pretty good.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y2mb9NDdxCwphFrsa_ua_w"
  },
  "u4dGK7dT-KpFK_ctSu7FAQ": {
    "date": "8/5/2017",
    "text": "I use this place as my standard for all Thai Food restaurants. Sometimes its hard to get them to answer the phone if you are ordering for pick up, but the food is outstanding. I'm never disappointed in the quality of our meals. I prefer the Panang Curry. Ours kids like this place for their chicken strips and fries.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uJu3l3zr9JWii-KkbdbKA"
  },
  "woeXfYRD2y_1JlN9XwTMPA": {
    "date": "4/1/2017",
    "text": "Just moved in the area last night (was up moving allllll night up to 5am this morning) and was so excited to find a new Thai place near our house. We went through the drive-through since we placed our order over the phone which was super convenient. I ordered yellow curry with tofu and with tomatoes instead of carrots. When we got home I noticed the entire container was made up with mostly the onions (which are supposed to be supporting ingredient), only one or two pieces of tofu, and a tomato on the very bottom of the container. I put the food I poured out back in the container without eating it. Needless say, the last thing we wanted to do after such a long moving experience with just us two, was to have to leave the house again. I called the manager to let him know that there may have been some miscommunication and instead of offering some solution that didn't require us to leave the house yet again (we were thinking maybe a voucher for next time we come in), The manager was pretty apathetic.   My husband ended up leaving anyway to return the food and get his money refunded since now he had a pretty bad vibe about the way the manager was with me over the phone. Manager dumped the food on a plate in the drive though and ended up arguing that there were 4 pieces of tofu, not 1 (but I'm still pretty sure that it's Tofu yellow curry, not onion yellow curry. ) and then he corrected us and said there were two wedges of tomatoes, not one. Kept arguing longer and my husband just kept staring that it was not what we ordered/how we ordered and definitely not in line with their menu. SUCH a bummer since we LOOOVE supporting local business and wanted to make this a weekly visit.   Bummmmmer.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wu2JdXulqG0slUemcZZNnQ"
  },
  "fsgfLePX6TJnZ2Rdk-JcfQ": {
    "date": "2/12/2018",
    "text": "This is by far our favorite Thai place! It is always delicious. My husband loves their drunken noodles and I love their pad Thai or pad-see-yew. The have a drive through window for pick up orders you call in which is very convenient! I only wish that they delivered :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7lQCnsSgx2WjtVak1h8GOg"
  },
  "uXY3lu8b8gQBDjrQ0V9dZQ": {
    "date": "7/29/2012",
    "text": "Saturday 5:15 pm. Our first time here. Service prompt, very polite. Servers checked on us as a team, no complaints at all! Food all came out in good timing.   Egg rolls delicious, very crisp, fresh inside, not greasy. Chicken wings... tried them only b/c of the Yelp comments... They really are that good, nice & crispy, & the sauce that comes on the side is addictive! Thom Kha soup FANTASTIC, chose chicken in it, & as others mentioned, this places uses great white meat!  We both ordered Thai iced tea, sweet but not overly sugared. Then switched to hot tea which was unsweetened & surprisingly delicious in flavor, what the heck?!   Our appetizers were so shockingly fresh & good that we skipped an entree & simply ordered another round of wings & egg rolls.  WE WILL BE BACK!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tymXcLdCu4qoXnS-Jk-YJQ",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Interior Thai Rama Chandler",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tymXcLdCu4qoXnS-Jk-YJQ/o.jpg"
      }
    ],
    "user_id": "8gDUxptOAahGqeehpczxeg"
  },
  "W89zwkQNIsU0I7BfAsmJaQ": {
    "date": "10/1/2015",
    "text": "I used to come here for lunch and had never had a bad meal. So we decided to come for dinner.  It was bad, really bad. We ordered  potstickers. These were like the cheapest pre made potstickers you could buy at Samsclub. And they were cooked till they were limp and flavorless.   Then we got the Satay Chicken. Again something that started out frozen from a bag and cooked till it was rubbery and tasteless. Hands down the worst satay I have ever had.  Then I ordered a beef dish. Tough, chewy and stringy.  Not one of the 4 of us had anything we would ever say I'd eat that again.  For lunch I used to get the Shrimp Pad Thai. And I used to enjoy it. After a dinner like that though I'll never come back.  The service was good. That's it.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "NonCv-aBjvao13-QBeBqTA"
  },
  "-ryOSdNGSNx9QGEyjSiyfA": {
    "date": "11/23/2013",
    "text": "This place is pretty good when we don't want to drive to Ray and Rural to go eat and Swaddees (this place is the best). this place gets pretty packed during dinner on the weekends and service can be slow sometimes but the food is pretty good. tohm kha soup is good, panang curry, pad thai, and the hot and spicy noodles are pretty tasty too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "5BncEtK1C1eG4D18klxi4Q",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. hot and spicy noodles. there are a lot of veggies in this dish. noodles are the wide noodles and the dish is a bit oily but good",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5BncEtK1C1eG4D18klxi4Q/o.jpg"
      }
    ],
    "user_id": "0ibm06KpYdnGL8Ga55w5RQ"
  },
  "hBvvYXn1kJtpONEhZoaOeQ": {
    "date": "8/3/2017",
    "text": "This use to be one of our favorite places to eat. We placed an order for take out, when we got home and began to dish up our food the disappointment began to set in. The Thai Toast was more like French toast, the crab ragoon almost missed the filling, the entries where a big disappointment also. This is the second time we have really been disappointed. Don't know what has happened, one more try we will give it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "37Cah-J5Nc41dzIeZlQ1NA"
  },
  "RryJ2IHmuILzjfcYKADvwA": {
    "date": "4/11/2017",
    "text": "One of the worst Thai food places in chandler. This place is no where near authentic. I ordered a simple red curry that was supposed to be Thai hot, ended up with watered down whole milk. My significant other ordered pad Thai which was very sweet. Their prik nam pla was way past expiration dateI will give them this, their lunch special soup did have good flavor but I would never return just for this. If you are a Thai food connoisseur this is not the place for you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8_WSHy6Y3u3SaRgvXEoWg"
  },
  "1IZvqGUlDf4Q-Xfn98Mp5Q": {
    "date": "11/5/2012",
    "text": "The waiter spilled curry sauce all over me and didn't even offer an apology.  Not only did I pay for a crappy meal but I also had to pay for my dry cleaning.  Don't go the service sucks and so does the food.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PUDrgRuqAk3kS0BkpORewg"
  },
  "oLV5XNPM4Dst7ML90XDGxw": {
    "date": "4/8/2015",
    "text": "Ok so don't know where to start. I guess the bathroom would be a good start. I saw the biggest roaches since Vietnam unfortunately I ordered the food before hand so I had to swallow hard . I was trying to get a look at the kitchen but was stone walled so you know what that means. I ordered the pot Stickers and every time I bit into one a bunch of water squeezed out so I new they were frozen. It was like tasting something dank and wet ashtray comes to mind. I hope I don't get sick. If there was a zero star that's what I would give them.   Ps the water is from Costco Kirkland brand nasty as hell.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oEKqyEsSNaGmycaJ9EhMoA"
  },
  "N6SN3PIIZanY8FPrXEZ0TA": {
    "date": "1/1/2017",
    "text": "My favorite is Evil jungle Princess curry. The vegetables are never overcooked, always fresh, and full of flavor! I've never had a bad experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AhFTCuGLvdUgIGqNEP8KkQ"
  },
  "obJOeDCxKebprejhJdWCYg": {
    "date": "11/13/2015",
    "text": "Very flavorful and good quality at a reasonable price. Would recommend giving this place a try ;-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fYZzYY1yOsymUc1m5ZiSTA"
  },
  "A428uLKJyxIGgQelAaCn4A": {
    "date": "9/1/2014",
    "text": "The customer service is the worst. Both when your actually at the place or not. I was on the phone trying for almost an hour to place a to go order but it seems like they don't even bother. The only reason why I still return is that the food is good and it's closer to where I live.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-nxh-PAw8TcDR2CwPOIdwA"
  },
  "mQUxX53WMnFyDM0vJqqKtg": {
    "date": "1/30/2013",
    "text": "Visited Thai Rama on a business lunch and was absolutely pleased.   Had the Thai (marinated) chicken wings as an appetizer and they were just out of this world infused with flavor, not to mention the home-made sweet chili sauce that I could have drank shots of, as it's so delicious.  My entree was the Pad Thai, and quite honestly, the best I've had in the PHX Metro area.  The seasoning and spices were spread evenly throughout the dish, so there were no hot or bland spots that you normally find with Pad Thai.  I thought the noodles were generously sauced, keeping them from clumping together and found the overall portion size to quite generous for a lunch entree.    Sometimes it's the little things that catch my attention and this time it was the complimentary (which is standard for Thai restaurants) cup of soup.  The soup actually had ingredients other than just broth.  It was loaded.  It was substantial.    The wait staff was very pleasant and attentive, but not overly so.  Food delivery timing was normal for a standard lunch crowd.  Apparently the word is out on how good this place is as we arrived at 11:30 and by noon there were no available seats in the ample dining area.  Booth seats were comfortable and clean.  I would highly recommend Thai Rama and absolutely plan on returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vW0VLTgKJ1pLxoPxOg6qhw"
  },
  "MDRcO6iZeim8fBVMGLjwaw": {
    "date": "1/2/2017",
    "text": "Great food and LOVE that they have drive through! I am gluten free and their yellow curry has never bothered me. The curry does have about 50% onions, so I ask for the curry without it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2I5T1gC_YC-JiQH9xSjBtA"
  },
  "ZOfH-XEFciN7Hfsp7Wr0Tg": {
    "date": "8/28/2016",
    "text": "I love this place! Especially for lunch. I have Thai Rama at least 1-2 times a month for lunch. I can call in my order and go through the drive-thru pick up lane and quickly get my meal. I've never had to wait and it's always fresh and ready. Along with your meal you also get chips, a eggroll with sweet and sour sauce.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VuF_jSnqMluncDVMK6ZrHA"
  },
  "UWkMvLrd_FqPyCzCLLcedA": {
    "date": "12/17/2014",
    "text": "I went in to get a simple yellow curry for myself and my two boys.  Two were supposed to be no spice.  One mild.  They were too spicy to eat.  The rice was dry and had no flavor.  The Chicken was way over cooked.  I called and they could do nothing about the issue.  They offered to make a replacement meal but I couldn't drive all the way back.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DgUoLd61hAecdjAGKnt41A"
  },
  "z8uqcz7TZB2Bc5r_TmR7qQ": {
    "date": "7/23/2016",
    "text": "Love their food but they are really hit and miss on answering the telephone for pick up orders.  We have had to give up and just drive to re restaurant to order to go a few times too many.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ShqmZUHJ4ofxfiog8si0nQ"
  },
  "gY12pX3i5uBdNfNZ2da0Uw": {
    "date": "5/14/2012",
    "text": "Since I love their food 80% of the time I was nice enough to give them 2 stars but after tonight I highly doubt I will return. They are losing so much business now that I will not be promoting their outrageously poor serviced staff and making their food a million times spicier than what it usually sits at.  I ordered to go as usual and I had bad feeling about it since it was almost 9pm when they close. I called and the lady was oh so nice enough to say (we are closing in 5 minutes) No shit sherlock like I didn't already know i am not that dumb by boyfriend decided super last minute that he wanted thai (ugh!) so I knew they were going to ruin our food so badly that I am sitting here typing this instead of eating the delicious panang curry but it is so Damn hot that i cant even eat it and can barely stand even the underlying flavor.  This was extremely dissapointing because i love their food and now with the service and horrid food given the past two times I will not be returning, I can tell you that much right now.   I can bet anyone 5 dollars that with all the reviews regarding their downward spiral of bad service that the owner or manager doesn't give a rats ass that they are doing this bad now.  I remember when we went to the tempe location they have a white racist broad that used a different race as an excuse for the spice level (oh the other cook that made your food is mexican.) SERIOUSLY? what if i was mexican? I would have called the highest up manager I could get.  Completely and Utterly irrelevant. Just make my food the way it is supposed to be made is that so hard to ask for?! Honestly????   So as of 5/15/12 i give them only 1 extra star for giving me a brand new panang curry that was good enough for me. Only problem is there was a younger kid that drew a red heart around my new order slip and wrote his name on typed his name in the top right corner with a winking face. I noticed it as I walked out and just oh for gods sakes really?? I just spoke to this kid about how the food was unbearable to my Boyfriend and myself. Kids These Days.....",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F0M8nWuTwWHbY9NVV7DasQ",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. This is not normal for medium this is hot panang",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F0M8nWuTwWHbY9NVV7DasQ/o.jpg"
      }
    ],
    "user_id": "bxBR0vakC_OAU-5rCYCDsw"
  },
  "-1nD3KtNkXRcCTtL-6h4nw": {
    "date": "9/9/2012",
    "text": "I have ordered only peanut curry here, and it's pretty good! I like it with boiled tofu and no peppers.   The best part is that you place the order over the phone and you can pick it up in the drive through!   Great place for take out. The dine in is not my fav, but it's ok.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LnnYSUlw_MVdtoYUt4oZ5g"
  },
  "v7iNukksShSsMiLCcpVfHA": {
    "date": "11/21/2015",
    "text": "The food is good and comes out quickly. The staff is nice , but definitely do not go overboard to build a customer relationship that encourages a return of those who really enjoy their food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QQW99VhcP1Y6sXCzNCf4bw"
  },
  "LSxoBvj36AqBESZAKycDdw": {
    "date": "4/24/2015",
    "text": "Thai Rama is our most favorite Thai restaurant in the valley. Try the green curry or the evil jungle noodles.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "84texByXWGnsnXBTl_RKJg"
  },
  "FBWdIYY5E_ier_iRU6zKMA": {
    "date": "11/4/2014",
    "text": "The food is good which deserves 4 stars but the way I feel every time I pick up my food brought my rating to a 2.  It's like you are putting them out by coming in or going thru the drive thru. (Especially the big white guy with all the ink). It's a 20 minute drive from my house so allot of times I will go in to order take out.  Apparently they would prefer I call but that is pretty useless when they don't answer the phone!    I prefer to give my money to someone that appreciates the business.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "euFb0J3FDCDMQz8DweAyTA"
  },
  "bIzhN0oNjJmUln4zPYUD0Q": {
    "date": "3/24/2015",
    "text": "Should be 4 1/2 stars. Very yummy lunch place never had a bad meal here I always have enough to take home for the next day or dinner. Family owned place;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "62JJoUPxKxqb6snMJxi2ng"
  },
  "Cg2AgxKTglygnHuOKjtNYQ": {
    "date": "3/24/2015",
    "text": "Our favorite Thai place !! Especially since they have a drive thru to pick up call in orders. Def recommend the pad thai ,drunkin noodles and pad see saw those are our family's favorite !!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jHu59ZYIORPpHw2NGTnR9w"
  },
  "XgHxsL3VXJsAK_e3_qKlvw": {
    "date": "3/1/2015",
    "text": "The specialty steak dish was terrible. The steak was over salted and really tough. The rice that came out was the kind of rice that you have when you leave it in the rice cooker on warm for like 6 days. The service was good which is what saved one star.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yOi-FCRj92u2dGVQxNAWhA"
  },
  "7nbIM1PdYoBRJwK77IW4Og": {
    "date": "11/14/2012",
    "text": "Awesome food! I love the option of heat level on the spicy Thai dishes they have red pepper powder and pickled jalapenos On the side to turn it up a notch. It takes a bit of time for dinner, so don't be in a hurry. Take a few friends  and try a few different dishes! I LOVE the Jungle Princess dish and the Thai chicken wings are sweet and tangy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qd-KpERvN7gbmZWi6Xl79A"
  },
  "L9RUDoA5zCTSON-j_U2AVA": {
    "date": "10/15/2012",
    "text": "I'm not sure if I caught them on one of those days, but my first(and only) experience here was less than memorable.  I decided to give these guys a shot after my first choice was closed(it was a Sunday).  I found them on Yelp, and it said that they were open.  I tried the phone number that was listed several times, but all I got was a busy signal.  Since I was leaving work, I didn't have time to try and find another place, and this place was on the way, so I figured I'd see if they were in fact open like Yelp said.  The place was easy to find, on Chandler just west of Dobson.  I saw they had a drive-thru for call-ahead orders.  That'd be great if you could actually get through on the phone.  They were definitely open, so I walked in to place my order for take-out.  The inside was actually pretty nice looking.   It was nicely decorated.  Not overly done, the lighting was down a little, and it made for a comfortable atmosphere.  Not very noisy either.  Seemed like a nice little place to come and sit for a meal.  They were very quick to greet me and to take my order.  It was a simple order, as I ordered chicken paht thai, medium spiciness, and a couple egg rolls.  If you can get through on the phone, I highly recommend ordering ahead.  I felt a bit awkward standing around, with no place for those waiting on take-out to sit.  I ended up leaning against a small counter in the corner of the restaurant because there was no place to wait.  I guess you could have sat at one of their dining tables, but that's not my style.  The food was fairly quick.  Less than ten minutes and I was out the door.  Smelled great too.  When I got home, I quickly sat down with my wife, dished up a plate, and dug in.  The egg rolls were actually really good.  They were a bit smaller than what I expect egg rolls to be, but they still had good flavor.  The paht thai is where things went south pretty quick.  My wife and I love paht thai, and this is what we get all the time.  We just moved to Arizona, so we are trying to find a place that nails it down.  This wasn't it.  Let me start by saying the spiciness was right on.  It wasn't too spicy, but it still gave a slight burn.  Pretty right on for \"medium\".  That's all it had going though.  Overall it was very flavorless.  I was very disappointed with each bite I took, as I expected it to get better.  Unfortunately it never did.  Even at the very end, I grabbed a piece of chicken and ate it.  It too was absolutely flavorless and dry.  I would never order paht thai from here again.  Seeing a lot of positive reviews on here makes me think I ordered the wrong thing, however paht thai seems to be a pretty easy and common dish at Thai restaurants.  If they can't nail that down, it leaves me with little or no hope for the rest of the menu.  Plus, at $14 something for that and 3 tiny egg rolls, I expect a hell of a lot more.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9UxeiWdsL378DpCcHDMR0w"
  },
  "BU1n7KFVWqX2m4NOn8MguQ": {
    "date": "3/26/2018",
    "text": "We lived in the Thailand for years and this place is legit. Be warned: If you order the Thai Hot its as hot as it gets! This is not Americanized Thai, its the real thing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pscRzPa1cTZeyxccVBmoXQ"
  },
  "_EhiooVphNYGsl_Y3J-WIg": {
    "date": "9/21/2018",
    "text": "Food is good here again today however the biggest problem here is very basics of Running a restaurant which is long wait. We had party of 6 and we kept waiting for 15 mins without anyone acknowledging us. Reason is they are always understaffed even knowing their main business is lunch time. Another party of 5 showed up bit waiting area is so small it's a joke that they had to wait outside in hot. Always the same experience. Also no option for vegetarian soup which is again a basic mistake for ages. Either they're too stubborn to offer vegetarian soup option or they think they're too good for it. Hoping these 2 may change and we may come back there on regular Friday team lunches. Meantime we found our choice of Thai place now.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sX08VAsymo58k7YJpLq3CA"
  },
  "GPN0kAb_pxu_k1KimQg45Q": {
    "date": "4/16/2017",
    "text": "Good food not the best ambiance tho. Ok to grab a beer maybe while they make your food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bYzLZxneUNSUgMfooHlxiw"
  },
  "uzUrL3Cp0toOx9z0PZDBYA": {
    "date": "3/3/2017",
    "text": "I had such high hopes for this place! Perhaps I went on a bad day but I won't be returning.   We went for lunch on Friday. Tables were full which is always a good sign.  We were greeted right away, brought our drinks and lunch soup immediately. Then it went down hill......  After 30 minutes of waiting, I noticed a lot of tables without food.  After waiting 10 more minutes our food finally arrived.   I ordered pan and curry. How can you mess up Panang curry? Easily, there was no vegetables just chicken slices that were a bit dry and tough. I asked the waitress, is this suppose to have vegetables? Her answer, they are cut very small. I dug around my food and I found it!!! Just one and a piece of herb. Not sure if the herb was suppose to be there.    Then it continues down hill....  My husband got the red curry. Oddly it looked like my curry but his had vegetables, score!! He took a bite of his rice. It wasn't cooked all the way!! I'm Asian so we know what rice is suppose to taste like. After trying to make contract with our waitress, we found another one. We told he about the rice and she stared at us like we were crazy then offered my husband another cup of rice.  Maybe it was just a bad day? Maybe lunch time isn't their strength? Still not worth going with the poor food quality.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S_QTVUjDCns0FVNCyAqVoQ"
  },
  "OQzv26s5hPuZwO9MBFfqbQ": {
    "date": "12/23/2017",
    "text": "This place is always on point... great service and great food. Doesn't matter what we order - it comes out hot and very tasty! This is worth the drive across town for Thai food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mQPhKP0MiEvp6PoFG4cOPQ"
  },
  "TsURbG6qXteZrUMAdJNGeQ": {
    "date": "8/12/2017",
    "text": "5 stars, but only for the excellent tea, noodle soup, and dessert. I don't care for the other dishes, and I've tried many. But what I do like I can't find better at other places. Get their delicious hot tea. It's not bitter at all but if you like it sweeter with cream in it, get the thai iced tea. The noodle soup is not oily american noodle soup. It's real chicken broth with some tasty spices in it. My favorite dish here. I usually get it hot but if I'm stuffed up I get it \"thai hot\". I'm not crazy about their other dishes I've tried so now I just get this one. Every. Single. Time. I also recommend the mango and sticky rice for dessert on occasion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1mhB16iMuFUHX5M-GyzIfQ",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Thai hot noodle soup. With chicken and tofu.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1mhB16iMuFUHX5M-GyzIfQ/o.jpg"
      }
    ],
    "user_id": "k3x_G_qwGDywT6QIzE75xQ"
  },
  "WkDyJR2GcAzLcwMgt6LZew": {
    "date": "8/7/2018",
    "text": "We went there today for the first time and it was great. And the curry I had some of the best curry I've ever had. My wife had noodles and they were all so great. I asked for mine without any carrots or race and they were very accommodating. It's about half an hour from my home so I won't be there every day but I Definitely will be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q7QdOORcsYB1mlFiHRx-hw"
  },
  "9O8Ge5PiarxnL8Q6Me1CRw": {
    "date": "3/16/2018",
    "text": "This place has the worst owner she is so rude. The food is not that good. The service sucks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j4RuhBnqdx2FFbRL4aYkqg"
  },
  "pLwaeecG46B-wyFKWlw_wQ": {
    "date": "8/28/2018",
    "text": "Absolutely love this place. My wife and I have been here twice and both times were excellent!! The food is awesome and the service is impeccable. They really know how to treat their customers right. Love the Jungle noodles and the homemade coconut ice cream. We highly recommend this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xMhPrLZXQzNdmEOmwWAhGw"
  },
  "sJS1beNhR3oYwilW_IJWHw": {
    "date": "9/11/2016",
    "text": "Great comforting thai food!  What I l really liked: Friendly staff and great tasting food that made me feel warm and revived.  What they can improve: Might just have been me, but the booth I sat in was a little low for the table height so it was slightly uncomfortable.  The staff was very friendly and great with checking up on you and answering any questions about the menu. They were very excited about the customers being there and about helping you select a menu item that you will enjoy. I really did enjoy my dinner and look forward to visiting Thai Rama again!  I got the Vegetable Panang Curry which comes with rice on the side. I smelled it as it was being brought to my table and instantly started drooling! They have a wide array of menu items and they all sounded great. They do serve alcoholic drinks too if you are looking for an adult beverage with your meal. I did enjoy my meal and I think their prices are fair for the amount and quality of the food. It was $10.50 for the Vegetable Panang Curry and I took some of it home for another meal.  Thai Rama is located at the Northwest corner of Dobson Rd and Chandler Blvd by Safelite AutoGlass in Chandler, AZ. You can call ahead, place an order for takeout, and use their drive-thru for picking up an order that was called in for pickup. Their location is great if you are looking to visit the Chandler mall, Downtown Chandler, live or work in the area, or just want great thai comfort food. I'm definitely going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Vg4WbVBrlhpqVFH6qxABzA",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Vegetable Panang Curry!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Vg4WbVBrlhpqVFH6qxABzA/o.jpg"
      }
    ],
    "user_id": "5pJmCWpxtirxQwA5ovdvug"
  },
  "28rXs7q2z5Vx7-nHaqMMIw": {
    "date": "8/25/2018",
    "text": "Best Thai place I have been to in so long! The food is delicious, they have really good portions and cost, and the wait staff is always so friendly especially Josh! Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "87T24IiYuq2y25UBF0Zotw"
  },
  "DKEvA8e17kbjS5lxBWMCvg": {
    "date": "9/4/2008",
    "text": "Monkey.",
    "rating": 3,
    "rated": {
      "funny": 8,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "QuZbJquRtbY9O9JrB9NpxQ"
  },
  "qhnQJkF_9JQehV5dOKSemQ": {
    "date": "2/16/2018",
    "text": "Web site was down.  Called to ask for menu.  Waiter was too busy...manager said there are no computers to email menu and \"we are really busy\" and did not help. Last in house dining was OK food poor service.   Would not recommend despite convenience being local.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jj932LaRTHONJYqIG83vkQ"
  },
  "IUXlrpiMOXelDcO2oc0x2Q": {
    "date": "7/21/2013",
    "text": "Thai Rama was decent. I shared a pineapple curry and a pineapple fried rice with a friend for lunch. The curry itself had good flavor with a lot of vegetables and base protein (Tofu, $9.95). I was slightly disappointed that the vegetables were your standard peas and cubed carrot mixture bought from the freezer section though. The pineapple fried rice was excellent. It had deep, complex flavors that complimented the spiciness of the dish (Medium), and the sweetness from the pineapple.   Dessert was great. We had the mango sticky rice. The fresh mango, coconut sauce, and slightly sweet rice meshed well together.  Service was attentive and friendly.  While the decor for the most part is nice, we were seated at a table with duct-taped seats. Kind of a minor point, but it puts a damper on your dining experience when you are sitting on tape!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "u6-cECIeF9ijWbTUpGsSKA",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Pineapple curry with tofu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u6-cECIeF9ijWbTUpGsSKA/o.jpg"
      },
      {
        "img_id": "oSfmxJNCvDdjWv1gjyUh1Q",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Pineapple fried rice with tofu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oSfmxJNCvDdjWv1gjyUh1Q/o.jpg"
      }
    ],
    "user_id": "DK57YibC5ShBmqQl97CKog"
  },
  "F_Yy1SpYRKEde_oud8n9ig": {
    "date": "8/8/2016",
    "text": "Red curry lunch special was supposed to have chicken in it. There were two tiny pieces of chicken, 3 green beans and an over abundance of bamboo. When I asked why there was hardly any chicken, I was told they count 6 pieces in each bowl... This was not the case for me and I was told they will not give me anymore. Needless to say, I feel they handled the situation poorly.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N1Vy-1mN9b1ASb71FgD_jg",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Red Curry with TOO MUCH bamboo.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/N1Vy-1mN9b1ASb71FgD_jg/o.jpg"
      }
    ],
    "user_id": "A0vk6LeKbmyWWeYtPKkPyg"
  },
  "8aIoMkV1_V9H4n8UR-KAaw": {
    "date": "3/19/2014",
    "text": "The food is amazing here, that's why I went back and originally gave them 4 stars.  My most recent visit, the place was packed, I only had 40 minutes to eat.  Placed a small appetizer order and after waiting for 25 minutes they finally told me they were out of what I ordered.  Great food, poor service when busy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VYP8_iU2ltEASjgq8kOVng",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Best Thai in Chandler/Gilbert/Mesa...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VYP8_iU2ltEASjgq8kOVng/o.jpg"
      }
    ],
    "user_id": "iqpSkSV9MwscDuwBNMfTGQ"
  },
  "BqaYcQiU5TQMyq8a7vQcAw": {
    "date": "7/15/2018",
    "text": "This place is incredible. I crave their Thai hot 4 yellow curry probably every other day. I wish they hired more staff to stay open between 3-5 but it's worth the 2 hour wait when I'm hit with a drool worthy craving!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "utP9u5V5PXikpUO8GN0PBA"
  },
  "LvIHTJjaIBEjGCmCJz1uKQ": {
    "date": "12/8/2017",
    "text": "So.  Good.  Normally at a Thai restaurant I go for Pad Thai, but we wanted to try something a little different.  I had the Massuman Curry, which was good but less spicy than I expected. My wife had the Yellow Curry, which was spicier than she expected.  I got dinner envy and had half of hers - it was GREAT!!  The desserts were also great - we had the coconut ice cream (homemade) and fried bananas with honey.  The people were helpful and friendly, and while the ambience wasn't necessarily elegant I liked it.  Definitely going there again!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y0SeOMHnALDuEhEQyhHsLQ"
  },
  "xpl_ee8twSo7bkwKmHKRbA": {
    "date": "7/21/2016",
    "text": "Another favorite Thai place which is sadly underrated because they don't pick up the phone or other issues. The Mango Delight and Pineapple fried rice here are so delicious. I usually call ahead and pick up. It's always been correct to my specified spice level with great flavor and fresh ingredients. I know it's not \"authentic\" but I wish they offered shrimp puffs or cream cheese wontons like other Thai places, but I can't fault them for that.  If you love Thai food I suggest you try this place for yourself, as the reviews are pretty mixed here. Personally, I've never had a bad meal from Thai Rama :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qGGwCzLDw4Rut4j-58ZMng"
  },
  "ztNRWO8_1LDKd28PD5Hp5g": {
    "date": "9/23/2016",
    "text": "The food is okay. Not the best I've ever had but the convenience of the drive through for picking up to-go orders is nice. The portion sizes are very large.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6CP6hEn7YQeEuowKcRnoaA"
  },
  "0s2dpTKMI9LSmy0F3gfPGQ": {
    "date": "11/21/2013",
    "text": "I went in to order some take out and won't be back. Nobody greeted me. When I read the small sign that said to order at the register in the back, I stood there for three minutes while two members of the staff awkwardly looked at each other neither of them even acknowledging me.  I will not be back. Service and staff don't know what customer service is.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cOtSrAMiTgoGSkifORCcJA"
  },
  "s7jni6MegCjWNfFTB-c6GQ": {
    "date": "5/13/2012",
    "text": "I was really disappointed by this place and it really wasn't the food as it was the service.  I saw how it had some really great reviews and living right nearby I thought to try it out.  My boyfriend and I went on a Friday evening and that was perhaps a poor decision on our end.  We got there and were the second group in line waiting for the hostess to come to the front.  After a few minutes we were seated and then there was a lot of waiting around.  There was quite a bit of people there for dinner and it appeared only two people working the floor.  They also seemed to be going to the kitchen for quite some time, perhaps they were helping out there too.  Once we did get our food, I did enjoy it and there was a lot of it!    I'm willing to give it another try, but perhaps during their lunch hour or for dinner during the week.  I really don't think we'll be there again for a weekend dinner.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GQkTOj04hW7rbQCrnYo59A"
  },
  "Iyi-Pxq3b6nFQL-sh_wJBg": {
    "date": "6/9/2013",
    "text": "This place has pretty good Thai Food and is reasonably priced.  The Pineapple curry is excellent, highly recommended!  We typically order the food for pick up, as they have a drive-thru pickup window, which is convenient. The service inside is good, unless its busy, then be prepared for a little wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7a1n8zF7K24sYxJNNNRJow"
  },
  "qUM9jAlyzrp_P4ql2jJcPA": {
    "date": "8/9/2010",
    "text": "Red Chicken Curry  Chicken Pad Thai  Pork Fried Rice  ..majorly delicious!.. and thank you for having the nice waitress who explained the spiciness levels. Well done.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gAmmEZLSdj5KXvOlPUQRfQ"
  },
  "OpHtnavjr6wk0iULrsOw7A": {
    "date": "9/2/2008",
    "text": "This is by far the BEST Thai food you can get in Arizona.  The food is amazing. I have tried several different options here including the hot and sour soup, pad Thai, coconut curry with tofu, a noodle dish with egg and basil and a tofu dish with broccoli. I have never ever been disappointed!  The service is really good and quick, and the prices are right on par.  We used to come here for lunch about once a week when I worked closer, and I used to make a second trip with my roommate at least twice a month.  My old boss used to get a Thai Omelet... so if you are into those, you can ask for a special order!  OH YEAH... I forgot, they have window service so you can actually order take out and never get out of your car! It's awesome!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "rA97zeqOrUYuEM69n0Xn4w"
  },
  "FRJ6kzY1d7CPOfUxd-Kqjw": {
    "date": "10/10/2012",
    "text": "I love the Paht Thai and Yellow curry. The service is great and it's one of my favorite Thai places.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nz8lFc_Zu3CrreJoE46cbw"
  },
  "fIwQ-7Gtak1a9hkkm1OULA": {
    "date": "3/5/2012",
    "text": "We found a bandaid with the panang.  We ordered panang with chicken, not panang with bandaid.   When we told the waiter, he argued that it wasn't a bandaid.  I'm sorry, there's no mistaking a bandaid!  The icing on the cake was that they charged us for it!!!  If you like bandaid on your dish, this I the place to go!  Too bad yelp doesn't allow 0 stars. This place definitely was a ZERO.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZcCQ2JUVMroFueVkEOLpkg"
  },
  "wtKUNgV33DSIdYUNtlYfZQ": {
    "date": "1/15/2013",
    "text": "**ANSWER YOUR FRIGGEN PHONE!!!!** SLOW SERVICE.   Other than that, I love this place because the food is delicious. I always get the pad-see-eww with chicken and steamed rice (you wont regret it!) It has noodles, broccoli and grilled chicken with the best sauce and flavor ever)  Service inside and to go is slow. Even when there aren't many customers in the restaurant.  I was disappointed last week when I called them for 15 min straight (while driving) and got no answer. When I walked in, I noticed like 4 guests inside and the phone was still ringing and not one employee acknowledged it. Are they really willing to lose sales that way?? Crazy!! They're lucky I like them so much that I took the time to order it to go in person and still wait 15 more min for it to cook. I would have preferred to order it while driving so by the time I get there its ready. That's what to go orders are for. They even have a to go drive thru for phone orders.....soooooo answer your calls!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sW-_qR_8AMx3MM3AkznfVA"
  },
  "toCpricOwup6ClTuoqN_mA": {
    "date": "4/2/2008",
    "text": "I agree w/ Heather, the Evil Jungle Princess is a great dish.  My daughter gets it w/ the noodles, I get it with the rice.  Facility seems cleaner than the norm for most of the Asian restaurants in my area.  For dessert I like the fried bananas or Angel Sweet gelato (which is on the opposite corner).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4fNHV9nkjf84BmmKiP1Npw"
  },
  "w8hwpKnzvrUY11Ro-JstZw": {
    "date": "9/10/2014",
    "text": "I would give this place a higher rating if it was based solely on food only. I really enjoy coming here for the Panang Curry Chicken which is very tasty. I have been here a few times. I had no issues my first time here and looked forward to returning. The second time, it took the server 25 minutes to take my order and that was only because I went to the counter. I discounted this as an honest mistake and returned yet a third time. This time I was more observant. This time it took 20 minutes to take my order with me having to speak loudly to get my servers attention since my waves were not working basically because I was not being acknowledged. Since I was one of the first to arrive of the lunch crowd and one of the last of the early bunch to have my order taken, I have to say I was not very happy. No apologies were offered when I expressed my concern. They rarely, if at all, come back to refill drinks. It is great food with such disappointing service. Any ideas on where to find great panang chicken with wonderful service?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "atRMxUC6a4f_oSsi8XRLmA"
  },
  "S3VDA-_o4GzMm5RAzxOrsw": {
    "date": "3/19/2015",
    "text": "Made a big mistake by going there for lunch. The waitress was rude and unprofessional. Had to walk out with the ordered food in a box, will never go back again. They deserve a -ve star, Yelp didnt provide me that option.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NioiQok-kEg7dqNlpDrNQw"
  },
  "aF6VDWtk1wTqsQ8TBfSy9Q": {
    "date": "12/13/2011",
    "text": "I absolutely LOVE this place. Everything comes out great and the service is awesome. They make my food the way I order it and it comes out in a timely manner. I also take advantage of their order out and pickup window. I've become a regular here (meaning 2-4 times a month) and they know exactly what I order and I don't even have to restate my specifications, which is great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzArgPA976WMt8F-uPZg0A"
  },
  "FRNMDL_0CNHwwj_sim39CA": {
    "date": "9/23/2009",
    "text": "I'm not a huge fan of Thai food, but these guys do well.  Lots of choices and ingredients are clearly listed with the dishes - HUGE plus for a person like me who isn't very familiar with the cuisine.   Went in for a late lunch with a group and the service was excellent.  We lingered for a while and that wasn't a problem, particularly since the place wasn't very full at 3pm.  Server had no problems splitting the check up, which I find refreshing.    It's a little hard to find as it's in a shopping center you wouldn't really expect to have a restaurant - but it's worth sniffing out.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bdAwy-OUQAZFOEU-qso1Dw"
  },
  "wntqE-4SKs5Q-WIn0h3c7A": {
    "date": "9/25/2012",
    "text": "I've been here a few times and enjoy the food, usually a packed place during lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_d4cdg9UYu3bP4OYIExX2A"
  },
  "d-z5ih7kImkRsmVh76PFaA": {
    "date": "2/27/2009",
    "text": "Hallelujah! Nothing saves you more when you live in suburbia than fabulous Thai food!  The Som Tum appetizer is the perfect starter - raw papaya, chili, lime, carrot, cabbage...fresh and zesty. Their curry is superb but I stick by their pad thai, paht see iiew and kaprow are all you need...though there is something that is drawing me to try the evil jungle noodles.   Typical out of date decor and overtextured walls but all part of the experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "h3Iydnd3iXDD_cAln6HhlQ"
  },
  "cQj9du2KpW7ueYxSnNLV4w": {
    "date": "6/8/2009",
    "text": "I am an out of towner, but when I visit my mom, we always come here for lunch.  The lunch specials are a great value.  I love the basil chicken, it has bamboo shoots.  I order it hot at an 8 out of 10 on the heat scale.  My mom loves the beef and green beans.  My husband Joe also likes the basil chicken, but he doesn't order it as hot as I do.  The food is fresh and the service is great.    My mom just told me they renovated the outside.  She said it looks great, I can't wait to see it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "R37abL8vjxFn_uoyC7y4ig"
  },
  "6tiiDR_QoEkKX3ZD1_VP9Q": {
    "date": "1/30/2011",
    "text": "Yummy!  I was unfairly worried that the levels of heat here would correspond to the lack of spiciness found in Arizona, rather than appropriately Thai. Pleasantly surprised to find that they Thaied it up with the heat.  The drunken noodles (Kwediew Kaprow - phat kee mow) were YUMMY. The Ho Mok Ta Lay (seafood with red curry) was the perfect mix of savory, sweet, and spicy. I was a very very happy girl!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aYqFMx6zlirSGxaHEMKloA"
  },
  "uQxXGn55QaMu2XdWxf_oPQ": {
    "date": "1/29/2015",
    "text": "my \"place to go\" if I am craving panang curry.  The best in the east valley",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b7c8tbxz6uuDqoIC_Fk-lw"
  },
  "TKpVJeMzbV-mC9d2Taucwg": {
    "date": "1/13/2009",
    "text": "Awesome Thai food!  Lunch time is worst time to go. Try to be there between 11a and 11:30a or after 1p. The wait staff are pretty busy but the food is worth the wait.  The restaurant is tidy and clean. There was no food observed on the floor. It tends to get loud when there's more than 15 people eating. The acoustics weren't meant for a sit down restaurant as you will notice with their drive-thru.  Pricing is very reasonable for lunch. The portions are very big. Tofu was easily substituted for the chicken on the Pakh Thai.  Lunch for two of us with a soda came to around $15. Remember to ask for extra napkins should you order your plate Hot or above.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "O2U5kLpXDY-xjDppJ7d_Nw"
  },
  "m2BAECOHKlsAL1w2aFhzGw": {
    "date": "3/5/2009",
    "text": "I like Thai food. I couldn't tell you what particular dish I like, as my habit is to simply request that they bring me the best dish. I mean, why the hell would I take a stab in the dark. Not like I know how to make it.  I went to TR today for lunch. Being wise, we consulted Yelp and learned that we should get their early. I'm glad we did, as we slid right into a table -- no waiting. 15 minutes later, the house was packed and the line was outside the door. Yet never once did the waitstaff miss a beat.  The food? Very good. We ordered off the lunch menu, which always has a quick-serve air about it. But it was very good. Medium spice was just right, but some day when I'm adventurous, I may go up one level.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "isy4gf66dvSLbiItR9kERA"
  },
  "8K81mSFNqGLoGZOoHtR0Yg": {
    "date": "2/1/2011",
    "text": "I had the red curry for lunch and it was delicious!  I wanted it Thai hot and boy did they knock my boots off with the spiciness level!   They know exactly what \"Thai Spicy\" means, not like other wanna be Thai restaurants that don't know how to bring the heat!  I'm happy to finally find a place with delicious Thai food at an affordable price.  I can't wait to get my next dose of spice from them!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nk-j27XiwEQdN3Ob_gxirg"
  },
  "s6-yEH012Yz-FaUBiA7-Cg": {
    "date": "8/8/2011",
    "text": "Great Thai food! I had the spicy fried rice with chicken and let me tell you when they say spicy, they mean spicy. The flavors were so good and the spice was perfect.   I would definitely recommend Thai Rama for some great Thai food. Will eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "azhCL4HtQHGRCDboOp4-JA"
  },
  "FXsJiwoN4ny5iI-d3E9m2g": {
    "date": "10/24/2013",
    "text": "Its alright.... quite ambient and its good for business casual hang out. At least you dont have to yell across the table to get your communication going.  Food is ok. Its an americanized thai. You taste spicy and salty but hardly you taste sour and the thai spice and fragrance.  The real deal especially soup call tom yam served in thailand will stimulate your every bid of your mouth with ozzing saliva. Oh btw the way white tomyam is better than red once",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DUOHqFa8GPZdaEIxTJExQA"
  },
  "vzqU4OT0O8FXj8mnhXeypQ": {
    "date": "12/20/2010",
    "text": "We love this place! I always get the Evil Jungle Princess curry and hubski gets whatever he feels like in the moment. He only remembers the Thai tea. The service is friendly and the ambiance is cozy. Just don't mispronounce the beer when you order Phuket ;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2TAvvTz9E6AOYObB9OOjaw"
  },
  "DnUzlO28dATWyBX0_FTW4A": {
    "date": "10/19/2011",
    "text": "I'm a huge fan of Thai food, so obviously I love this place:P Even out Thai foreign exchange student said it passed the test! Definitely go for the \"scary\" noodles.  Oh, and the servers are always nice:)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lco3gaENgH96r-_EH2Uk3w"
  },
  "B3VMAm7WHgVz6lGb3AcNfA": {
    "date": "8/20/2012",
    "text": "On the plus side, they actually make it properly spicy.  On the negative side, the food just isn't that good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9sv6iZHZsJedxbSyBBJiA"
  },
  "v_THJtaC__EDT4ovxxIMQA": {
    "date": "2/14/2012",
    "text": "I love the food here but service is ridiculously slow and painful. I go there all the time but time after time, I am disappointed with how long it takes for service. I hate being a poor tipper but by the end of our meal I get so pissed with how unattentive some of the waiters are. It costs $3 an hour for waiters, hire more staff!what is the hold up when there are consistently horrible reviews on service!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VtLHfXQe_VUSP8_DJHpueg"
  },
  "P3Hmlmm4ka5_KinAwb2B8A": {
    "date": "6/23/2010",
    "text": "We have been coming to Thai Rama for at least two years.  They are consistently good, and while they might not know me by name, they certainly know me by order.    We normally do take-out and have only eaten in the restaurant a handful of times.  Those times, the waitstaff was friendly and attentive.  We have a standard order (egg rolls, fried rice, paht see-iw, silver noodles) and then add in an entree or two - the kai yang, the steak thing, the garlic chicken, ginger chicken, the veggie stir fry...  The only food complaint I have is that their curry base is made too spicy for me to have.  I've got a total kitten mouth (and tummy!) and can't deal with any spice.  They cut their spice level, it seems, with additional coconut milk, but they can only cut it so far.  Additionally, I eat wheat-free (which most people parse as gluten-free).  I'm not amazingly sensitive, so I can handle the amount of wheat/gluten in the soy sauce, but for the most part, that seems to be it as far as wheat goes.  Some day when I go in to the restaurant, I'll have to have a chat with someone and see what the real low-down is, but for now, it's quite acceptable.  For a time, we went once a week, for about three or four months.  Each time, it was great.  Some weeks are better than others (haven't been able to pin down why yet), but it's never been anything less than good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e9jwsUCdpRIffZCEfDUZXQ"
  },
  "V3sa41xBI6f83vgmlxufCQ": {
    "date": "11/23/2009",
    "text": "Decent food, good service, good lunch prices.  I liked the fact that when I told my waitress I would like to opt out of the deep fried foods that came with the lunch special, she immediately offered a larger portion of my main dish.  Nice touch.  Lunch special got me a nice cup of soup, a decent, but large, plate of fried rice, and a cup of hot tea for $6.54-ish.  A good price for a good meal.  Their fried rice wasn't the best I've ever had, but it certainly wasn't the worst.  I would go back and try another dish.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "eK6FpEPv2urKpEjWwR45QQ"
  },
  "iLexesIPD7kT_UPeShlc_w": {
    "date": "2/1/2015",
    "text": "This place is always great!  Service and food were very good.  I had the pad kee Mao which was outstanding.  Cooked perfectly and lots of great flavor.  My husband had the yellow curry which was also very good.  We went on a Friday evening and every table was taken - service was still great and we got our food in a reasonable amount of time.  Will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wPlKwH-i0P2ve3uFBhoNrA"
  },
  "y3qEQssNB1HmmHM1DWpifA": {
    "date": "11/28/2010",
    "text": "Wanted Thai food near Chandler tonight but realized few are open on Sundays. Here's how the morning's research played out:  1. Great reviews for Thai Rama on Yelp but no hours of operation. Strike one. 2. Look for hours on restaurant's web site. Strike two.  3. Call restaurant. No voicemail greeting after 34 rings. Strike three looking. 4. Discover Facebook page, which despite having just 85 fans does include hours of operation, as well as some nice feedback from patrons. 5. Will try Thai Rama tonight with unfairly high expectations. Hope the food is worth all the effort it took to get the most basic information.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfKHh1RbkXNMoAZuFXa1rA"
  },
  "Etzrb6WBHBlQ6ROodK7xYA": {
    "date": "2/2/2010",
    "text": "I met a friend for lunch here today, and it was pretty good.  I've been here once before and remember the food as being excellent.  I would give just the food 3.75 stars and 2.5 stars for the service.  The restaurant was about half full at noon, and although our food arrived fairly quickly, the waitress disappeared and my friend resorted to tracking down a pitcher of water in order to refill our glasses.  Spicy Thai food = a need for plenty of water.   I ordered the Mango Delight which is chicken stir-fried with a chili jam, bell peppers, mangos, onion, broccoli, mushrooms, carrots and basil.  It's served with a nice cup of soup, steamed rice, fried wontons and a spring roll w/ sweet/sour sauce on the side.  The sauce was more watery and less spicy than I remember.  She ordered a mild version of Yellow Curry with coconut milk, chicken, potatoes, onions & carrots which she said was very tasty.  She made the comment that since the place was filled with mostly men (and many attractive ones, I might add), the servers were probably more inclined to offer them more attentive service since they tend to tip more.  I would have to agree.  I will try this place again, as it's in a good location and I like their lunch menu. I think that next time I will definitely order my food to go.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2NkH5JgebO9z4ZhsONtlTw"
  },
  "WC1mvPppSetOklVnci1S6Q": {
    "date": "3/1/2012",
    "text": "I have lived very close to this Thai-rama in Chandler for years, and finally started going there about six months ago.  The food is absolutely wonderful.  Always fresh.    However, I am only giving them three stars due to the service.  As another reviewer mentioned, the service is getting worse.  The first time I went there, it seemed okay, but my last visit for lunch a full hour.  The restaurant was crowded, but there were only 3 wait staff.  After about 10 minutes, our first waiter asked us what we wanted to drink. 15 minutes after that, we still didn't have our drinks. Another waitress came by and asked for our drink order.  We told her the other waiter took our order and she replied he is busy, so she will get them. By that time, we also knew what we wanted for lunch, so we placed our food order.   After about another 10 minutes, the waitress came around with a large tray of soup bowls.  They pretty much served half the restaurant soup at the same time.  Finally, after another wait, we received our lunch.  By the time we got the check and paid, it was an hour since we had walked in the door and sat down.    Again, the food here is wonderful, but they really need to work on the service aspect.  Although the restaurant is not too large, when full, they should have at least 4 servers.  I felt bad for the people sitting next to us.  Although they ordered their food about 10 minutes before we did, they didn't get it until about 10 minutes after we received our lunch.  I could tell they were not very happy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "KdY2Ke3R9Vs5wKSCa8-Ofg"
  },
  "rc1FjQFvzl3vJPXr4SxaMw": {
    "date": "11/1/2009",
    "text": "YUM!!!!!  This is one of my favorite Thai places - especially at lunch! My whole company (4 people) can eat here for like $30!   The pad Thai lunch special is insanely tasty and leaves me full for the rest of my work day. If you like Thai, give this little place a go!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "4SeXADCmqLg1W0qTVaEkXQ"
  },
  "eOxEYty0yFPHea_KnJZXWw": {
    "date": "1/6/2015",
    "text": "Lunch specials are reasonably price. The wait can be a bit long but the food is good. The pad Thai and the yellow curry are my favorite!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V6yoKv21yEWL2ncMXBMsjw"
  },
  "nfeiZewnSkOeJ0RR-agSvA": {
    "date": "6/7/2010",
    "text": "I went here on my lunch break (only 30 minutes, not such a good idea!) I got the lunch special with the paht thai, and it was very good. The egg roll that came with it was also good. I'm sure I would have enjoyed it more if I had more time to eat it. This is definitely not the spot to grab a quick meal, not that it was exceptionally slow, but they cook the food to order so it takes a little while.  I will definitely try it again when I have more time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rNqGeXne5Ump313cxOoJMw"
  },
  "DD0Mqb0TG94tk3ZTDAcL4Q": {
    "date": "7/5/2013",
    "text": "Food is ok. Service sucks. Took forever to get service and the check. Looking for a new place for Thai food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tiNcEno55PqMzDjyGFjIag"
  },
  "KMk9zCCgUPk9h5-0cVnXTQ": {
    "date": "10/25/2012",
    "text": "We are big Thai Rama fans... from the Thai BBQ Chicken to their several varieties of curries to their wonderful Pahd See Ew, Thai Rama offers outstanding food at excellent prices. On top of it all, the friendly staff makes sure everyone enjoys not just their meals but their visit, as well. It's not only a regular place we visit, but a \"must do\" place we take family and friends when they are visiting in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "APIUJS8icFPV30zlprhp6Q"
  },
  "hPGieduPwa2fLV4SSz9RCQ": {
    "date": "11/4/2009",
    "text": "WOW. DELISH!  I will absolutely be coming back here.  For their food, not for their service though.  The busser was horrible and we had to ask for things numerous times, but the food is worth it.  I had the garlic chicken, medium to very spicy, and it was unbelievably tasty!  I'm still full right now but if you put a plate of it in front of me, I would eat it all.  Went for lunch, got there at 12pm and got a table right away.  Lunch prices are great - about $6-7 for the whole meal which includes soup & spring roll (both tasty).  I will certainly be back, but maybe try for a less busy time (not peak lunch hours) in hopes of getting better service.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "juLlBJ6SQMyMLxPLczZxNA"
  },
  "cu6dkrbzunFemMRHm3QyRg": {
    "date": "12/30/2011",
    "text": "My colleagues LOVE this place!  We seem to go once/week.  I am no Thai expert, but I have to admit, of those we have tried in the Chandler area, this is the BEST.  It's always packed, and that is the first sign of goodness!  For lunch, you get a lot of bang for the buck: soup, tea, wonton, and then the main meal.  Service is average, however...nothing special...but not slow.  I am not certain I would ever choose this restaurant for dinner because I am all about the atmosphere, but this is a great value, and anyway...I like to spend time with my colleagues outside of the office!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yks-zWhYKVV-S_luTu3dNQ"
  },
  "zmMd5mGFpYKp1ISXnIHqKg": {
    "date": "9/22/2018",
    "text": "Hands down the best Thai food in AZ. Get the Paht Thai,  Khao Paht Saparoat and Evil Jungle Princess. The staff is extremely friendly and they will help guide you through the menu if it's your first time to eating Thai food. My wife who basically only eats American food went out on a limb to try it and now she wants to eat here every night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rMXE92SZxodT8bzag_J6sQ"
  },
  "IjdV5wuwWhEQJz4cduvGTw": {
    "date": "2/23/2019",
    "text": "Terrible service. The food wasn't as good tonight either. The flavors were off so they may be changing their flavors or using cheaper ingredients? The waitresses that we red us tonight gave a lot of attitude. One of them rolled her eyes when I asked her opinion on a platter and the other one gave me attitude when they brought me the wrong food. It was as if she expected me to eat the platter they brought. Also, they include a 18% gratuity in the check which is BS because they definitely didn't deserve %18 today.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ho5NP4Fcc324SQmzkVQFzQ"
  },
  "Xj_zUd_vYBshGh2gmHYNMQ": {
    "date": "3/12/2019",
    "text": "Not bad Chinese food. Orange chicken was spicy with a kick, fresh steamed rice. Very good",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GQIbCZIIeLlnW0QLEYvoIQ"
  },
  "VDRqTLOLOsLmTeBbCwZQ5A": {
    "date": "7/7/2019",
    "text": "This is the best Thai food I've had. Reasonably priced, friendly staff, DELICIOUS FOOD. The staff is always friendly and helpful. Lunch specials are such a great value!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JVW4D1y1Ac7rKU9QRUyP3Q"
  },
  "nc_j5DFtbw5M-5QtfyulSA": {
    "date": "2/19/2019",
    "text": "Great Thai food, good atmosphere!  I ordered the salad rolls as an appetizer, don't get these confused with spring rolls!  They were okay at best, the peanut sauce saved the rolls.  I ordered the evil jungle noodles for my entree and that was really good.  Staff is super friendly and very accommodating!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f8pYdhWFw3A1Y1JoTHcQRQ"
  },
  "H3slloKmLxjUunr0v-DqpA": {
    "date": "1/12/2019",
    "text": "Great food. Always nice service. If you go through the drive thru with your pups they usually have dog treats for them. Just wish they would invest in another phone line for busier times, sometimes have to call repeatedly or get a busy signal during peak ordering times.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ul9NzORnCotfmOt37FFt3Q"
  },
  "DvmGz2HesLsVoH_xNQBCkg": {
    "date": "9/3/2018",
    "text": "I'm willing to stand in line for how ever it takes for the food even though I have so little time for lunch break! And when a place is busy no need for bullshit, you can see that they are busy and try to get to you soon as possible. Be patient people, the world does not spin around you. This place is amazingly good. Taste of real quality Thai food. It's perfect.This is the best place after what I tried in L.A.! Yes it was crowded, but you know what that means? That it's worth the wait! I've tried so many Thai food places in Arizona and so far the best tasting one. Yummy. Will be back even for dinner, driving from N Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gD0STG5biwSaZr3Eqq5VOQ"
  },
  "Y-C-A-u8BOVpqJWdCNuxrg": {
    "date": "8/13/2018",
    "text": "This is best Thai restaurant in the valley!! We have tried so many of them over time, nothing beats the same great tasting delicious food every single time!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-LyrqVTH75oozN7aEmGu4g"
  },
  "J0zNrh5pC5rN6llbnh5QDQ": {
    "date": "6/17/2019",
    "text": "i will not be coming here again. the food was good, however there were many tables open and not reserved, and we were seated right at the door. except for two dishes, everything and shellfish. the bathrooms were very dirty and reminded me of a gas station. the waiters all had several nose rings as well, which were very distracting. we ordered lunch sizes, however they were still very large.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5DlALZK4HnuzVhdtndVYg"
  },
  "Rqd8vFNOp3XDs_XSn_9GEg": {
    "date": "9/1/2018",
    "text": "I've been coming here for over 8 years.  Thai Rama serves delicious food and the waiters and waitresses are very efficient and friendly.  It does get extremely busy during lunch hour, but that's to be expected.  The only downfall is that they turn their phones off for any call-in and to-go orders during their busy time, which can get a bit frustrating.  But overall, I'd recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g5KSwpALUwg4bC0oH1ruHA"
  },
  "lR_VEN5mr4lMG6SV6U5G0Q": {
    "date": "2/26/2019",
    "text": "I like this place. The yellow chicken curry is great although it usually tastes better when I pick up and take home as opposed to eating there. Weird. The call ahead and pick up window is fantastic. Rarely have to wait once I get there and the food is always ready.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6xd8vPBv4_wtS0wm_n-40A"
  },
  "2KYJbmBKzGd_6_9pTOoN2g": {
    "date": "8/21/2017",
    "text": "Food is okay but service was absolutely frustrating and inconvenient. I attempted to call in to make a to-go order at 12:30 PM on Monday and no one picked up the phone. That makes sense, restaurants can get busy. However, I tried calling multiple times for the next 30 minutes and no one picked up. Ever. Not once... I can understand if you are busy but do not straight up ignore a call for half an hour.   I went instead in person to order and when asked if they even had a working phone since I tried to call in, the staff said \"yeah but we've been busy so we couldn't answer. Sorry.\"  I looked around and about a quarter to half the tables were taken and as I waited for my food, they just sat around doing nothing. This was really offensive and I will frankly never go here again.   If you are really busy, I can understand not picking up the phone once but ignoring it completely, not even putting me on hold is ridiculous. To make it worse, to lie straight to my face that you're busy and couldn't pick up for half an hour is sad. If you can't learn to pick up a phone for an order, maybe you shouldn't be working in a restaurant.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "VxV5Dwboan9hR429clvHZw"
  },
  "NV5iRpm8KGPvVEhvf81eYQ": {
    "date": "4/15/2018",
    "text": "I wonder if Thai Rama's management team knows that they take the phone off the hook and set it on the counter during busy hours. This leads me to believe that they may be understaffed. And maybe they're missing a lot of business. I was on hold for about 10 minutes I was told that they would be back in a second or two. The guy never came back. After 10 minutes I hung up and called again. Busy signal. No surprise. Easy way to lose customers for life.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bf9A1fpDk43LIZijSNxrOw"
  },
  "FvkmF4f6sYr3KMTqP5Yzjw": {
    "date": "12/9/2017",
    "text": "Excellent food and reasonable prices. I love the drive through pick up window very convenient!  Medium curry hotness is perfect flavor not too hot and not bland . I would highly recommend this restaurant",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mmEdumtQjtbS0WaEgdmQ4A"
  },
  "SRAlwJPif1ZlQZ5KE6z-JQ": {
    "date": "11/6/2017",
    "text": "I had the red curry, which was a bit weak on flavor. I didn't really think it had much taste. There were only a few green beans in there with some chicken and lots of bamboo shoots. I think people who like bamboo shoots and not much flavor would like this dish. The red curry came in a little bowl on a plate with rice, a small eggroll, wonton chips, and a dipping sauce. I thought that the dish was a bit small compared to other Thai restaurants I have been to. Since I went during lunchtime, it also included a small bowl of soup at the beginning. The soup was very salty and flavorful. I think the soup was mostly a strong chicken broth with a garlic flavor and it had some rice in it. I also had some of the pad sew-ew, which was strong in flavor, which I liked, but it seemed a bit greasier than expected.  The overall vibe leans toward Americanized Thai food rather than authentic Thai.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BsdxzBDkjbUEC_AAk1aVHg"
  },
  "kAy1jhtRuCjGi5GYiZYYww": {
    "date": "7/1/2018",
    "text": "Went in for the first time and ordered to go. The wait was less then 15 min after ordering. I ordered a chicken and green bean with a red curry sauce, with an order of spring rolls. Everything was really good! They give you a really big portion of rice, and a pretty big portion of the main entree. I would definitely  go back to try something new!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I8-X4gnQS807o9_-jkcbag"
  },
  "UQ24zKvmdN8eDV2jd3Dcdw": {
    "date": "6/1/2018",
    "text": "We used to frequent Thai Rama, but stopped after we witnessed management refusing service to a woman in a Hijab. That's not the sort of vibe we like with our dinner.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9lUytT0ds1melt9pJCHkkg"
  },
  "FIxnj1pEw6ZBxMRJy6_TWA": {
    "date": "3/9/2017",
    "text": "I wrote a review about my experience and food in Thai Rama. It was yummy.   <a href=\"/redir?url=http%3A%2F%2Fitsmesteph.com&s=474f99ed401138b111f3012d72096d7a3e0a4fc39c654ea790a95f5290d4697b\" target=\"_blank\" rel=\"nofollow\">itsmesteph.com</a>",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7M_fANVL4ftDu5-vv1iGtQ",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7M_fANVL4ftDu5-vv1iGtQ/o.jpg"
      },
      {
        "img_id": "Ru-fRURD7BmTg1pqE1MKHg",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ru-fRURD7BmTg1pqE1MKHg/o.jpg"
      },
      {
        "img_id": "xSVRkw0GKM6W6PaemhjQxQ",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xSVRkw0GKM6W6PaemhjQxQ/o.jpg"
      }
    ],
    "user_id": "S9bpJfcUYKH2xCrYkWjx2Q"
  },
  "aeImEAqB75osq1vt6R4k4g": {
    "date": "10/30/2018",
    "text": "When I head back to the Chandler area I will definitely be hitting this place for lunch. Food and service was excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQLWcN-gRpmDhxHrH8K8kw"
  },
  "ECrsYzcGxtUN8Prd0S3yrA": {
    "date": "7/16/2014",
    "text": "My favorite Thai restaurant in AZ!! This place has a drive thru to pick up your food!! This is so convenient when doing take out!  Friendly  owners and staff. You can customize dishes by meat (chicken, beef, shrimp, tofu) and by spiciness. Favorites are:   -Paht Kee Mow with chicken noodle dish mixed with stir fry variety of sprouts, carrots, onion, and broccoli.  -red curry with chicken with bamboo shoots, broccoli and other veggies. -seasonal mango over sweet sticky rice and coconut milk to dress the whole thing for a sweet treat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "jXeiG30PyUdNFXMXBLnixg",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Jungle curry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jXeiG30PyUdNFXMXBLnixg/o.jpg"
      },
      {
        "img_id": "2OdsHxczOuqJl6wrilrZ1A",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Paht Kee Mow noodle dish with chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2OdsHxczOuqJl6wrilrZ1A/o.jpg"
      }
    ],
    "user_id": "ia5kvJxYR8gPItl9O4W0Mg"
  },
  "JrBRc31Qndb7rjdTFQopBg": {
    "date": "7/5/2011",
    "text": "Thai Rama is our regular Thai place. We get it regularly (usually do takeout) and we pretty much always order: Evil Jungle Princess (curry) and Kwediew Kaprow (better known as pad kee mow), both with chicken.  Intrigued by a name like Evil Jungle Princess, aren't you? This is a fabulous, creamy, coconut milk-based curry, loaded with veggies. The sauce is so good you'll drink it off the plate.  Kwediew Kaprow includes the flat rice noodles, lightly spiced, but a real delight...one of the best pad kee mows I've had anywhere.  Prices are roughly 10 bucks a plate for dinner, and even cheaper for lunch. This place makes a great lunch up to 6 or 8 people if you're in the area. Highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bkbso-0_8Ep1gZUpJVw6tw"
  },
  "D1KuNyXl0nK9zvHkPNSO-g": {
    "date": "9/11/2010",
    "text": "Food was good. One of the best places for Thai food I've found in AZ so far. We ordered Pad See Ew, Pad Thai and Red Curry with Thai Teas to drink. The Pad See Ew looked a little mushy when it came out but when I tasted it... it was very good.. I liked how they used regular broccoli and chinese broccoli in it. They also use a lot of garlic in it. Pad Thai was decent. It wasn't my favorite, but it wasn't bad either. The Red Curry was yummy! It came with bamboo shoots, green beans and thai eggplants. We ordered it with medium spice and it was perfect. They didn't overdo it with coconut milk. Thai Tea was decent as well.   It's slightly pricy for Thai Food in my opinion since I'm used to prices of Thai joints in LA ($5-8 range all day... no price hike up for the same dish just because it's dinner time, why do they do that here in AZ???) But portions were good so I guess it's not that bad. Only one thing though... service was so    S.... L.... O.... W..... I know it was a Friday night and everyone and their mom is out for dinner but wow... there was only two of us and we were there for almost two hours and we both are fast eaters.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qgbRvkZ8tUiAtNAM34YBzg"
  },
  "iBWfhN0e1wgZYJnbVAkzYw": {
    "date": "11/17/2010",
    "text": "Went after the lunch rush so service as slow. Friendly but slower than one would expect. That's why only 4 stars. The Panang curry was awesome, I requested mild spice as other yelp reviews said they were on the spicy side I could have gone one more degree but delish non the less. The chicken Satay came served different than I'm use to but it was awesome as well. I will definitely come here again and try the Tom Yum soup (they spell if differently) . =)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EsQAYXO-p8bM542mjZmLoQ",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Panang Chicken Lunch special =)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EsQAYXO-p8bM542mjZmLoQ/o.jpg"
      }
    ],
    "user_id": "8MoMISpYDkyLEs5Wndi8hA"
  },
  "xjnaflcF50kfrPX7mOugEg": {
    "date": "5/27/2013",
    "text": "Great food . Be prepared to wait for a little while though. Friendly staff, they are just slow when it's busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IXeZNndab2G-CW0ANzt4cA"
  },
  "G0QM6op0jKfwmb0Hkt6Xvw": {
    "date": "12/2/2015",
    "text": "Food was very ordinary. Despite asking for  a spice that was one level above \"medium\", the food was barely spicy. Very little crowd in the restaurant. Many other Thai restaurants that have better food. Service was efficient, but not particularly attentive.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "To-H3Ocn10HPHog4DAav7Q"
  },
  "pBnB8kMFCgv2zV2nr0HV-Q": {
    "date": "7/26/2013",
    "text": "Yellow curry was excellent. Moved here from CA one year ago and finally found legit thai. Thank you, will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rM53cdFIvcmakcPl5Ei4kQ"
  },
  "u5nEwh0U0OMlU12YWtqs3g": {
    "date": "11/15/2013",
    "text": "The worst Thai food I've had. Greasy and over cooked by an staff who appears to hate their job. I've tried this place a few times as it's close to home but I have always been disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzZ7EN6-f8Yo4qe5fcENiQ"
  },
  "KBGQfLw3Go-WAevKGSEMuQ": {
    "date": "8/21/2010",
    "text": "- the waitress was friendly, bland, and close to useless - the food was bland and way beyond expensive - the restaurant is in a great location (close to the freeway) - the bill was stunning for what the 6 people in our party received. - the place was empty, except for one other table (with a couple)  I'm not sure how this place has stayed open for several years, since they have so little traffic.  I'm thinking that it's a mafia money-laundering front, and I would recommend that my friends/family stay away.  Bottom line:  don't bother",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "80tKqp4yaRjGpcZQ3-U9DQ"
  },
  "GuIIcx2ujfrKEyjSdCAcVg": {
    "date": "7/28/2010",
    "text": "\"My tea is good\" according to my friend.  Aside from that; I thought the food was okay.  I eat a lot of Thai food and nothing really popped except my taste buds burning......yeah it was spicy!  \"The tea here is really good\" noted friend!  Decor of the place was nice and and low key; starting to wonder if all Thai restaurants use the same Interior Designer.  \"This is good tea\" yes, my friend I know :).  Our service was also good and nothing to complain about.  My water was always full and our waitress was attentive.  How's the tea?  Well I think you know the answer to that - enjoy!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kjeX2RXvW7RhBbD2QLd5jA"
  },
  "b5SAUBZREEXEpH8QZjQ0Lg": {
    "date": "3/27/2013",
    "text": "Delicious Paht Thai. Wish their menus had pictures.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gIWzYF7HQ8FPhPZ8e1xhuA"
  },
  "7b9vRcVb8vPADKGsKZA66A": {
    "date": "10/15/2011",
    "text": "If you like Thai food, Thai Rama delivers the basics. I wasn't blown away but I will be back for the convenient drive up take out option. Simply average Thai spot.   Busy at lunch, which is a good thing. Service was unorganized but courteous. Over all average.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4kJYQR_cnKadGPvzCBh1fg"
  },
  "AO8eueLrmN0nmm8eaOjL6A": {
    "date": "8/3/2013",
    "text": "Whenever I have extra time at lunch, I cruise over to this place. I love the spicy coconut soup with added veggies or the peanut butter chicken. Service was great as well. I have no complaints about this places so i gave it a 4 star.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CwB2vZ2HytT2rvXLh5_XSg"
  },
  "qMskQg7tqzFM2OOrD1yOyg": {
    "date": "8/11/2012",
    "text": "Great food, the curry evil jungle noodles and the mango delight were fabulous! However,when you charge for another bowl of rice for two people I have a problem. I would have given it four stars if it wasn't for a mere 1.75 plus tax.  I think it's more out of principle than substance.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4fsHIBIsqYCoc2uAHpXXcg"
  },
  "d_QLT2Xv3vCT7wq8udkyEA": {
    "date": "11/9/2012",
    "text": "i walked in today and walked to what looked like the to go counter. I asked the woman if I could place an order to go here. she said sighed loudly then said yes but it was going to be a looong wait. I asked how long. she sighed again and pointed to the line at the front door. I asked her again how long is long. she said 30 min. I asked her even for take out. she proceeded to explain that there is only one kitchen, not two, theres no special kitchen for take out, and that just bc I want take out doesn't mean I get to cut in front of everyone waiting. very disappointed in her communication. I would not be writing this if she would have just said, \"yes, you can order take out here. it'll be about 30 minutes until your food is ready.\" oh, and done without the sighs and condescending tone that made me feel like she was speaking to child.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RQpmy2blvmLCZXKtDny53Q"
  },
  "35CHuexBn5E-nZLYHV_OnQ": {
    "date": "7/16/2012",
    "text": "This is my favorite Thai food place in Chandler. I always hit it up when I'm in town and always order the Pad Thai. It's consistently good. Their lunch special is a pretty decent deal. You get the Pad Thai along with soup, an egg roll and a couple of friend won tons for 10 bucks. I'm a fan!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "z4iln5ZW8NAVUG_WSaeFow"
  },
  "nzHTlXYo-ld2Q23zGXBAaA": {
    "date": "3/21/2011",
    "text": "I love this place. Their chicken panang, thai hot, is perfection.   The only reason it doesn't get 5 stars is the service can be a little slow and it gets pretty echo-y inside. Not my first choice for an intimate dinner since you can hear other patrons conversations.  Also, they do take out!  If you are waffling on trying this place: TRY IT!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yA12PRMaFUtweoVjYtlHOw"
  },
  "z4oHCyzmeG4VymX72_3a_g": {
    "date": "4/10/2011",
    "text": "I have been going to Thai Rama for several years. Up until a few months ago I would have given them a 5 star rating. Since I moved to Central Phoenix, I make special trips to this location though I have a Thai Rama closer to me. However lately I have noticed a shift in customer service. It seems to get worse every time I go in.   Last week was just strange. I went in for lunch after the lunch crowd had left. I placed my order and that went fine. However after that I saw no sign of the waitress or anyone for that matter. The servers were in the back kitchen talking and after I finished my meal (minus a refill on water and tea) I waited patiently for someone to come out to ask for my check.   And then I waited and waited and waited. Finally a young woman came out from the kitchen (not my waitress). I walked up to the register and asked for my ticket. She was incredibly rude. I handed her my credit card. She ran it and then tried to stuff my card and receipt into a receipt book and hand me that. I pulled it out since I still needed to sign it. I was thinking \"Why in the h*** is she putting this in a receipt book when I am standing right here?   Then I asked her for a to-go box. She stared at me blankly and then walked off. I had no idea what she was doing so I waited by the counter. She came out with a to-go box. I reached out for her to give it to me. Instead - she veered around me, walked all the way back to my table with me following her in utter confusion. Then she threw it on my table. It was to be one of the weirdest interactions I have ever had with wait staff.   Just then my original waitress came out of the kitchen and asked if I wanted to pay my bill!   While the food is still great, the customer service has really gone downhill in the last few months. Too bad - this place used to be one of my favorites.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uEqRU_VRdktB6nB4LNtKhg"
  },
  "ivRhA75uVLfmgJC52Agnww": {
    "date": "3/21/2011",
    "text": "Hello!  Yummy! Double Yummaaaaaaaaey!  First I have to thank Amber \"did someone say chipotle\"W for guiding me to Thai Rama.   I have had thai in the past but I have to admit it isnt all that often, and I dont even know if I remembered what it tasted like to be honest. Until now. This was an amazing meal. We both had the same thing  Evil Jungle Noodles. A tounge tickling adventure made from curried coconut milk with tofu and vegetables. Holy uncow people this food is effin good OK! Usually we split our lunch just to save the calories, but this time I am uber glad we did not. I am already drooling thinking about the leftovers. I cannot wait to go back and I have not evenfinished what I got today!  Review time  Curbage: 7 or 8  Kinda plain but nice Seating time: 10 Wait time: 3 It was busy so it took a few for help but that is ok it took us a few to contemplate the munu on our first trip. We also had a long delay for our food to arrive at the table but for this kind of taste I will wait until the cows come home to live peacefully forever. Food: 10  P factor: I dunno   Awesome job Thai Rama!  Late! Gordo  ps: Dont forget to try the Phuket beer",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6UR0kNe3C-ivlF2x1fPHNQ"
  },
  "oNMAIephkCcgzd_UjrxZGA": {
    "date": "12/29/2010",
    "text": "This place is pretty good and the price is excellent.  Nothing amazing, but solid Thai food, consistent and yummy and clean atmosphere. I was hoping for a tad more authentic, but this is my go to place for soup when I am sick! :-)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mq8Su0PZC8D4EaJrLJOhYw"
  },
  "BPJNmotSzm8uQ4TIbBvLZQ": {
    "date": "3/10/2011",
    "text": "The curries are very good. I was impressed with the pa-nang curry more so than the pineapple curry. Has a bit more flavor and more meat. Could have just been the evening that we got it, but that was my experience.  The spring rolls are not particularly worth it because it's basically a salad in a rice noodle. It leaves something to be desired, certainly.  As far as the pad thai. I am typically a very big fan of Pad Thai, unfortunately the first time we tried it, it tasted and looked as though it had been cooked much earlier in the day. Even when we got it a second time and it was fresh the taste was ho-hum. I would stick to the curry.  The staff is kind and friendly as well as prompt. We ordered take out twice and I think they have a drive-through window. I would take an extra 5 minutes on top of what they tell you, but the food has typically been done in less than 30 minutes even when ordering at peak hours.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wiDwDZldbPfE3DDbk1z2Nw"
  },
  "xWkf1MDigDg2aOCPwPHBgQ": {
    "date": "8/22/2019",
    "text": "Ordered to go last Sunday and we got lucky when the waitress said the owner was cooking.  Everything we ordered was delicious from the garlic chicken, basil noodles with vegetables, fried rice everything was delicious! We all enjoyed our meal. Hopefully our next visit we get lucky with the owner being the chef!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j4KaTVeOxUyIRjdRO3vl0Q"
  },
  "hLaQ-e0qJBeoYTP52uNDiw": {
    "date": "6/29/2019",
    "text": "This place is a gem for traditional Thai food. The selection is fantastic and we love the Thom Kai Gai coconut soup so darn much. Order a dude of rice with it and perhaps some Thai chicken basil or the perfectly spiced curries as well. It's hard to decide what to get because everything is delicious, flavorful and they'll make it custom to your liking if spiciness. Have a sinus problem? No problem, request Thai Hit. Yah buddy.   The service is great, wait staff friendly, fast , gracious and stay on top of everything. The prices are low for such amazing food. Can't get enough of this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3jXynTL8oxin8c9IDDJjvA"
  },
  "4zxHLyKFL2WXWSpngEbOCA": {
    "date": "5/2/2019",
    "text": "Wish I could give a better review, the convenience of a Thai drive through is worth a Star by itself. Ordered by phone, food was ready when I drove up to the window. Green curry pork, average.  Thai papaya salad, consisted of a big slab of cabbage, some shredded papaya, some tomato. Insipid, compared to others in the area. Pad Thai with shrimp was a problem. Shrimp were not fresh. Tried one and almost gagged. No excuse for sending out ingredients past their prime! This tells me that the kitchen doesn't care about it's customers, and that's scary. I really want to like this place, but I can't.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 9,
      "cool": 4
    },
    "photos": [],
    "user_id": "RO4Pfma9IUPG9SEPoW3VxA"
  },
  "BJpJR_DeylGwLCK9lj46cg": {
    "date": "8/21/2019",
    "text": "The staff always stops what they are doing when you enter to acknowledge you and seat you.  They are friendly and attentive.  The chef(s) are amazing.  Every meal I have had here was cooked to perfection and promptly.  They offer military discount with proper ID!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "NMpKbj6L4mwLBpbZuFPw8g"
  },
  "4LUxCE5m3pPWlfLeuLZawA": {
    "date": "4/19/2019",
    "text": "Ordered panang curry with tofu (Thai hot) as to go. I guess I was given a lunch portion of the curry for a dinner take out (around 8:35pm).   I read other reviews mentioned that their portions are huge so the small container kind of disappointed me as I usually get the tall containers each time I order curry at the other Thai restaurants around. The price is similar to others in the area and so is the flavor - nothing wrong nor outstanding (I would pay the same price at another restaurant to get more quantity). Also, the quantity of rice is almost double from what we get at other restaurants. So the ratio is definitely off.  The ratio of tofu was kind of more than the actual amount of curry (not complaining about more tofu but some more curry would have helped)  Might return if the portion size improves orelse I'll probably pass..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eK34teWITpT_SAeA2OGxmw",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Panang curry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eK34teWITpT_SAeA2OGxmw/o.jpg"
      }
    ],
    "user_id": "A2UXTirzw8j6ifwZx2klTA"
  },
  "9l4-3eBusn9wzYnhiRLiTA": {
    "date": "8/2/2019",
    "text": "Great food and they make it extra hot like I ask. (The hotter the better!) My usual dish is the Panaeng curry but I've had others that were also amazing. Great service here as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M3xJSfg2xkpbQaRajbiJYg"
  },
  "DSy3_NQqinoEN_HhnQbLdw": {
    "date": "2/23/2019",
    "text": "1st there was a hair in my green curry.  Ordered take out and ate 2 bites of the green curry (which basically tasted like a spicy coconut milk) and found the hair in the picture. Also wasn't given any utensils or napkins for my take out order which was quite annoying as I'm staying in a hotel and don't have quick access to utensils. Would give negative starts but can't.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xxQZPNk_xCQFAFI_qYm-Fg",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Green curry with hair in it.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xxQZPNk_xCQFAFI_qYm-Fg/o.jpg"
      }
    ],
    "user_id": "lfqqDh_LQRdKwjSOIwZB-w"
  },
  "kOwZTtOGi5KhdcUgDVOsRw": {
    "date": "7/1/2019",
    "text": "I have ordered here twice for pick up and I must say food is always piping hot. Everyone is friendly and most importantly my food is always right. It's a little bit pricey but I don't mind because the quality of the food is amazing. Please try the pepper steak and fried rice you won't be disappointed. There is also a drive thru to pick up your order so you don't have to get out..!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "61UwGr9kOy3tk8sG4m8UkA",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Chicken Fried rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/61UwGr9kOy3tk8sG4m8UkA/o.jpg"
      },
      {
        "img_id": "Fk8h8eBs5dBHOLXQbnj9dA",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Pepper steak",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Fk8h8eBs5dBHOLXQbnj9dA/o.jpg"
      }
    ],
    "user_id": "9zDJ2fjv_wWOTZ4ZggBMyA"
  },
  "l623KSuExAy4QDN4WGEqZA": {
    "date": "7/29/2019",
    "text": "The food here is really good, but what we love the most is the drive through. I usually call right when they open @5, pick up my kids and then stop by to pick up the food without having to get out of the car...love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DMNWi_WyUhB63AJwnfMJ-w"
  },
  "Rls58OssZgsjnBz5tLnTtA": {
    "date": "8/10/2019",
    "text": "My experience today was absolute garbage. I had to wait so long I forgot what I had ordered. I've been here for about an hour and after I got my drink and my order was taken I was not checked in with as to where the hell my food was. Normally the service here is okay but today it was trash. Seriously, all you have to do is say, \"thanks for waiting. We are a little backed up in the kitchen.\" Can't recommend coming here if the owner isn't here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-18xARoLFdaHkygG0fsLIA"
  },
  "vnwM8wRWpOxVBg205vOCLQ": {
    "date": "4/29/2019",
    "text": "Had the yellow curry and drunken noodles, both were delish. Service was good and had good suggestions. Would come back again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bO4-QsniYAzxEcQuuOV35Q"
  },
  "hfmlbR7heVgHAxYNk4FspA": {
    "date": "9/4/2019",
    "text": "What happened!! This use to be a weekly spot for lunch, quality of food preparedness has dramatically fell off, this is the third time felt the other times were bad days I guess not... I'm done",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t967lawoXxu2ajQqyjPW1A"
  },
  "GGAj3C509DGIBefHrLjIfA": {
    "date": "3/2/2019",
    "text": "The food was very delicious and they give so much food we've had leftovers for years it feels like! Which I'm not complaining about because I love Thai food :) nothing to complain about here",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "SUM9TSbFqeuQeQaCgaJtig",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Ho Mawk Ta Lay (basically seafood curry)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SUM9TSbFqeuQeQaCgaJtig/o.jpg"
      },
      {
        "img_id": "cS7kqzW86Om84bzgEgPaiQ",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Yellow curry and Paht Thai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cS7kqzW86Om84bzgEgPaiQ/o.jpg"
      }
    ],
    "user_id": "nmOfbgSZ2GexuNzZlR3O9g"
  },
  "Rwa50xJ6IZGd7tzTDnDpCg": {
    "date": "7/22/2019",
    "text": "Outstanding!  The lunch specials are a great deal and the food is amazing.  Service is very good, but come early at lunch because it does get busy.  Garlic chicken is the best I have ever had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Sk_EFDEf6vqrI0Ab4YDmA"
  },
  "_R3_pLTPbC5Ds-B09rq6yA": {
    "date": "2/20/2019",
    "text": "Meh. I have certainly had better all over town. The lunch special was priced well, but the soup is too salty, and the pad thai was forgettable. Sorry...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2-XLTj0Cfd81_XlmHo02Aw"
  },
  "sMdmTjn9Ab8As_sPLiXyzw": {
    "date": "6/17/2019",
    "text": "Hands down the best Thai restaurant in AZ. They have my loyalty and never fail us. Everything from the Thai tea to all the authentic dish",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BS_QS5sSSmC3djw3i8p3nA"
  },
  "WYNLDxBBLSUYCKxD7O8pgw": {
    "date": "6/11/2018",
    "text": "This is a good spot for lunch.   Their special comes with a cup of soup, a small egg roll, some wontons and an entree.   I use yellow curry with chicken as my Thai litmus test.   They spiced it right (I went with extra hot), the flavor was nice, good proportion of chicken, onion, carrot and potato.   My only issue was the consistency of the potatoes, some were slightly underdone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S0gfs96eYD664Ov5aFW3Ng"
  },
  "VwxJZ3_-zjgQqnkOavJTxw": {
    "date": "9/14/2018",
    "text": "I have had some really good lunches here.  You can usually come here during lunch and get seated in a booth right away.  The lunch menu is pretty straight forward consisting of specials that include soup, wontons, and a main dish.  The curries are good and filling and so is the Pad Thai.  This is also a very convenient location off of Chandler Blvd in a building close to the road that is hard to miss.  The waiters and waitresses are efficient and pleasant to deal with.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pnxh4gT-cE0uVA0wkNYx_g",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Pad Thai for lunch",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pnxh4gT-cE0uVA0wkNYx_g/o.jpg"
      }
    ],
    "user_id": "dR7g_NsmLL3ju0OJqkfQRw"
  },
  "nIqBoiIxMuWQuCtjJhihug": {
    "date": "8/12/2019",
    "text": "If you are looking for high quality Thai food at a good price this is the place to eat.They are fast and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "drqHYTjeXjT2M90kXrJPeA"
  },
  "-ArJ6XQFCKHnJRSKxp2LIQ": {
    "date": "9/16/2018",
    "text": "Still my favorite Thai restaurant in the valley. The Evil Jungle Noodles are outstanding, and the service is always great. I also like the drive thru takeout window. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZD5GF9cO4-TN1Jawx3XQrA"
  },
  "D6CBREBMWwE5iPMO0d3TGg": {
    "date": "10/14/2011",
    "text": "I want to like Thai Rama. I do.  I'd eaten at Thai Rama's Rural & University location for years (dating back to when the establishment was still called Char's!), so I was excited when a location opened up relatively close to my apartment. Their food is actually decent, but their service is so consistently bad that I actually have to dock them three stars for it.   Every time I seem to go there, they seem constantly understaffed - there's often only one (sometimes two) waiters working the floor, so it takes the staff forever to make it to your table, be it to take your order, refill your drinks, or even hand you the receipt. The waits for meals have been similarly atrocious - in my last few trips there, fifty-plus minute waits for meals have quickly become the norm. I'm really not sure what the situation is in their kitchen, but I'm sure it's less than optimal.  Oh, and the fact that their portions have shrunk over the last few months certainly aren't helping their case, either. It's disappointing, because they're really capable of so much more than this.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D47zehsquBAdfjXDSAIntQ"
  },
  "hYyTAPG7cGQo8CL5sZwANw": {
    "date": "7/16/2014",
    "text": "Everything was excellent and very flavorful. Just the right amount of spice in everything. Highly recommend the Papaya salad and curry. Service was great. Glad to have found a good Thai restaurant in the east valley! Our kiddo enjoyed the egg rolls and squid appetizer.  Atmosphere is good as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yBQ25yXfqxgB0JGFXou2Mw"
  },
  "NGg8s69QUVyc95vGJ1tm3w": {
    "date": "9/8/2014",
    "text": "I'm giving this four stars for the following reasons:  I've only ever been here twice, today being the second day. First, the food was just as good as the first time. This time I ordered to go, really wished I could have called in a head of time, but I didn't have a menu handy and I couldn't find a menu anywhere on their site - I could have missed it. But either way, grabbed one on the way out as I'm certain to be here again. And also, they have a drive thru which makes it a quick spot to stop by on the go. For me personally, its basically around the corner, less than 10 minutes away. I expect the third experience will be just as pleasant as the previous. Now if only they served duck...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QJiry-4nKHl71fv703LKpg"
  },
  "9aNTiazSi-2FjgxvMKmpGw": {
    "date": "9/8/2014",
    "text": "Best Thai place I've found since moving to AZ. My husband and I have gone here maybe 6 times and every time the service has been great... The servers are very fast and friendly. Everything I've ordered here has been fantastic and I highly recommend the satay. They also have a drive thru for take out which is super convenient.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xy7lBKzg_TpJ5GCNvOkKmA"
  },
  "uyhoM0WT_6gpCWay1CxWGA": {
    "date": "7/8/2012",
    "text": "Pros:  Just stopped in due to I had just left the eye doctor and had those blinding eye drops added.  Glad I found this place... Service was good and our waitress recommended dished for us that was very helpful due to me beeing half blind.  The wife had the Thai Tea (de-lish) was her response (to bad that did not include free refills)  I had the fresh brewed tea and started with the wings as an appetizer (they were really good and that sauce was fantastic) wife ordered the Thai Noodles  (nice) I had the yellow curry chicken and as a chef I must say I was not expecting the potato that  were sliced corrugated and the carrots were as well with a corrugated fine peeler and the sauce was real coconut milk and heavy whipping cream the chicken was fat free breast meat (it's the little things that make a Great food spot) and they have that here I forgot to even taste my wife's dish so I'm limited to speak on it, but it looked really good too.    Will I go back? Yes! when I have that graving for yellow curry chicken done right when I just don't have the time to do it myself!  Bon Appetit...  Cons:   Okay here is where they lose a point:  ambiance also ambience  (mb-ns, a-byas)  N.   The special atmosphere or mood created by a particular environment:  Yes it looks like a Thai restaurant but who is in charge of caring for the upkeep in your restaurant such as updating chipping paint, cleaning the glass windows and doors, uneven tables and chairs, dusting etc.  (we both went to the restrooms and I can say the men restroom was clean and as for the ladies restroom shockingly my wife said to go in with a HAZMAT suit!   The chef may be the owner and a male, that could be why his restroom was so much cleaner...lot's of male owners never check the ladies restroom.    They should!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Lf1SLmAORSEnvM1V6F-AKQ",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Yellow curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Lf1SLmAORSEnvM1V6F-AKQ/o.jpg"
      },
      {
        "img_id": "cUdnjLx8L-Pqr7vtfMUwlg",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Ojai thsi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cUdnjLx8L-Pqr7vtfMUwlg/o.jpg"
      }
    ],
    "user_id": "5BuJFeRfmSPFAV_ZBoaktA"
  },
  "jPFSx6qIgu7-1AUczdkQZw": {
    "date": "10/23/2011",
    "text": "My wife wanted to eat something spicy for lunch, so she said let's hit some local Thai.  We had never eaten Thai in the East Valley, so we went onto Yelp and read some of the reviews.  This restaurant is very close to my office, so we decided to give it a shot.  Service was so-so, but it was a lunch crowd, so I think they were doing the best they could.  Our order was taken after a bit of delay, but our food came out in decent time afterward.  We both had Pad Thai noodles on the lunch menu, which came with a small soup, some fried wonton skins, and an egg roll.  Have to say I was pleasantly surprised.  The noodles were exceedingly tasty.  We set the heat at \"medium\" but probably should've bumped it up a tad.  However, at medium it allowed us to savor the flavor.  For the two of us, the bill was $15 (we had water), so it was extremely inexpensive, and there was plenty of food.  Quite happy, we will definitely eat here again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rtXTMJyT3mNWB8AEXoq8bA"
  },
  "9xYB9hWBGPmQpP8aVwKttw": {
    "date": "1/4/2011",
    "text": "You can't beat the lunch specials here.  For just about $7 you will get your entree, rice, spring roll, wonton crisps and soup!   I of course got the red curry with tofu. The curry was wonderfully thick and creamy, almost velvety, and even though it only had green beans and bamboo shoots I loved it! I've never experienced that consistency before.   So far marking very high on my list of favorites!  I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 11,
      "cool": 9
    },
    "photos": [],
    "user_id": "pQdIIsbV5dGOVz_kWfMRTw"
  },
  "qCUG_8qCtg5K_4oEMomScw": {
    "date": "2/16/2014",
    "text": "I've been driving past this place for years. From the outside, it looks like a fast food place with a drive through. I was pleasantly surprised that they serve up some delicious Thai food. I had the Panang Curry and it was delicious. Portions are ample and I will be eating the leftovers for  a couple lunches.. I'm pretty happy about that!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r-TcndRvbpZH2_7dVy1AAg"
  },
  "-4NNh6qgxk8KHOI79ezb6w": {
    "date": "5/30/2011",
    "text": "One of my favorite Thai restaurant in AZ, everything is so original and not americanized. My fav gonna be Pad See Ew, the famous rice noodle cuisine that I always eat from time to time. It was so delicious and you can really smell the fried rice noodles aroma as they cook it out for you in their kitchen. The next best thing is gonna be FBI - Fried Banana Ice Cream served with vanilla ice cream and honey which I love the most. Tad Hoo Tod is my recommended appetizer. A fried silk tofu that was melt in your mouth and you got to order peanut sauce that compliment the taste. So far, I'm a very happy customer everytime I went here and I'm crossing fingers that they will keep the original taste cause it's superb!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7FSfeV72WImyyvCI6jXOQA",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7FSfeV72WImyyvCI6jXOQA/o.jpg"
      }
    ],
    "user_id": "lC7eMQdOE8ZUKBs3J_2NYQ"
  },
  "PEE6qZfuhd8cG3mOTjJ5Iw": {
    "date": "7/8/2016",
    "text": "Ordered red curry and papaya salad(some yum) for those of you who knows what authentic Thai food are this not all authentic traditional Thai food. My curry was plain taste white color and all I tasted was coconut (coconut milk drown in it) my papaya salad was sweet not supposed to taste sweet at all with 2 shrimp in it. I also ordered desert sticky rice with mangos, look so unappealing and unappetizing. I am shock they wouldn't invest more in their dish and taste. I am Asian therefor what Thai Rama served to their customers are all cut corners another words we called that American eyes food. I make my red curry and papaya salad I can say 10 times better than Thai Rama. I wouldn't mine paying for their food but if you're going to charge your customers an arm and leg I suggested you put more investment  and thoughts to your cooking. I am very disappointed I had to pay almost $50 bucks for something I call it lazy and being greedy serving food that only the people that doesn't know what authentic Thai food actually taste and looks like. And of course to them its delicious. Will never go there again. I will cut my lost. And give them 1 star.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5sn1dxqCxsXqdz4Q9XIfdQ"
  },
  "wTioJ5I_esGdQWojONVlqg": {
    "date": "8/12/2014",
    "text": "Love this place! Food is good and so is service.  Friday lunch service can be a little slow but only because of the large groups that show up. Friendly owner and staff.  Delicious food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oCMtINWMnTP0DgNQjHzg6g"
  },
  "95dSrB71h2onxVCgz3T2aw": {
    "date": "1/10/2012",
    "text": "This restaurant has delicious Thai cuisine! The pricing is reasonable and food is savory. The interior of the restaurant is a little outdated and needs improvement. Hospitality was decent, but the food service is particularly slow.   Overall a great place to grab a casual bite to eat. Mango sticky rice is to die for!! I make sure to eat here everytime I'm in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i2jY60BnzhB7ctAynO-z9g"
  },
  "JS_ntiRm71vVUC5IHAFgfA": {
    "date": "2/6/2016",
    "text": "Made the biggest mistake by going there for a family lunch. One of the waitresses were so rude taking our order and overall being unprofessional. We called waitress twice to order more food but she wanted us to wait for 10 min because she was busy fixing the computer. Will never go back again. They deserve a no star but Yelp doesn't provide that option.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OIt5BCIEdVMaFJ6AFsDNOg"
  },
  "iWDqkIE4VLb_6lFc6wFeSw": {
    "date": "5/2/2015",
    "text": "I love Thai food,  and would always return,  but one of there servers has a rude demeanor! Every time I go here she talks to people very very rudely,  I came in with my sister and friend to get our Thai fix that I had been craving,  she greeted me at the door and told her that I wanted to do a take out order,  she rolled her eyes at me,  and told me to go to the counter,  I did and placed my order with a very nice younger guy.   He offered us waters and I talked to him about a different Thai restaurant that I worked in,  VERY NICE YOUNG Man.   But as I was waiting for my food the other girl that was there was Rude beyond belief,  as she was talking phone orders I heard her,  it was not nice,  I felt sorry for the other person on the other end of the phone.   Who talks like that to people? Oh I forgot,  she does! I wanted to stand up and just yell at her for being so rude to people,  THAI RAMA CHANDLER needs to get rid of this girl! You are going to continue to loose customers!  Other than this,  the food is always on point and really good! I will continue to go back but will request for a different server other than her!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f--FwYb6D3Mh7_mS1tocGQ"
  },
  "xFUHQXg6OVE4TNpU8Bv1BQ": {
    "date": "12/24/2013",
    "text": "Love the Tom Yom, Phat Kaprow and Panang Curry. I'm convinced they'd do a heck of a better take out business if their phone line wasn't jacked half the time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "56ArjKCNyaFODlVlx3qAOQ"
  },
  "U6QFuLtZVbyYl12PdUoVTQ": {
    "date": "10/19/2013",
    "text": "I have no idea what happened to this place but both the food and service has gone downhill in the past 6 months or so. Now I have come to expect slow service like no one checking on if you need drink refills and inconsistent spice levels like tonight where I got the tom kha and panang both mild but the soup was bland and the curry spicy. But the best part was getting ONE tiny piece of bell pepper in the panang. Really?!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0lzNXsqV_Yh6p7Uba0wc-Q"
  },
  "qVSgJyi5jCkr1iVSK4rqxQ": {
    "date": "8/2/2010",
    "text": "Continuing on my kid free week, I decided to get some thai food one night during the week.  I had been by Thai Rama a few times and had been wanting to stop.  I was greeted upon walking in and told the woman I wanted to order to go.  She gave me a menu and offered to let me sit down at a table to decide.  She asked if she could get me a drink as well.  She prompty returned with my drink, took my order, and asked if she could get me anything else while I waited.  That's pretty darn good service for a to go order.  My food was ready in a flash and it was nicely packed and still hot when I arrived at home.  The pinapple fried rice was not the best I've had but it was good.  The yellow curry was delicious!  I will be going back here soon.  The service and the food were first rate.  And it's close to home which makes it grate in my book!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "-_vcdcTeTYp70lNsHrHljA"
  },
  "TwCBGnJVyqknjEJDmqYZag": {
    "date": "3/18/2014",
    "text": "I ordered the lunch special and spicy hot.  Most Thai food in the Phoenix area is never spicy enough, but this had the right amount.  I had the yellow curry with chicken which had great flavor.  The onion and carrots were sliced thin and cooked crisp-tender. I also ordered ice tea which had a great somewhat sweet flavor.  My only complaint was that the egg-roll was a bit over cooked.  The staff was attentive until they got slammed with a lunch rush.  There were only 2 servers, so I will cu them a break on that one",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4vyajTkbx2XTnO0gKrwmZg"
  },
  "LtO830WasSP4y4Tli7UoLg": {
    "date": "6/18/2013",
    "text": "Went back for some more wonderful cuisine.  Had the Chicken wings which were amazingly tender, sweet and perfectly cooked.   Unfortunately,  I have to drop a rating star for the following: We also ordered the Larhb, which I envisioned as a dish similar to chicken lettuce wraps.  When it arrived to the table both of us were completely blown away by the powerful odor.  It looked beautiful.  There were small pieces of white white chicken piled next to a wedge of pale cabbage.  Small spears of red onion stuck out like cactus.  But the smell was overwhelming- and not it was not good.  It reeked with a sourness that I assumed was just an element or spice that I had not ever experienced before.  I thought, if this is a \"bad\" smell as if the chicken had expired then why was the server seeming unmoved?  I tried removing the onions thinking perhaps they were the culprit, but it did not help.  The putrid fumes just would not stop-literally causing me to gag.  I felt horrible when I tried explaining to the server that it was not what we were expecting and apologizing for asking him to please remove it from the table.  He was very polite and offerred to make another without onions.  It was too late, as we were unable to remove the smell from our memory.  The rest of the meal was deliscious as usual. Still wondering what created that sulfuric odor.  Black Beets?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "93ZaU3GfaXSr-RjabsaQ2Q"
  },
  "7vytb3q9-8pNoEHXIEHihw": {
    "date": "7/11/2012",
    "text": "This place has very good thai food with a bunch of stuff I haven't seen at other places.  Probably my second favorite down here in Chandler.  The Evil Jungle Noodles are one of the best thai dishes I have ever had.  It is a thai noodle dish with a spicy coconut milk/ Curry sauce. It is pretty difficult to eat since they come in a very compact bowl that seems to hold them steaming and hot for a very long time.  I highly recommend them and hopefully you are less sloppy than me when eating noodles.  They also have a very good Pad See Ew which is my usual goto for thai food.  I always get medium and it's got a fairly good kick. The Evil Jungle noodles seem much spicier, but that could be related to the temperature of being very hot and stays that way.  The tables and booths are a bit worn, and it takes a bit to get your check, but that's not really a deal breaker for me as the food and is very good and the staff has been very nice on my visits.  Try: - Evil Jungle Noodle - Pad See Ew - Salad Rolls",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "rhE4gLtM0gb3XLwSz6HPCw"
  },
  "XIk1KrRnYJ7NZ8c43IDIVw": {
    "date": "8/22/2012",
    "text": "The restaurant staff are extremely friendly and are basically ready to serve you once you walk into the door (there arent many people there...sadness). We ordered and the food came out AFTER the people next to us got theirs even though we ordered first...this may be our hungry stomachs talking but that is unacceptable hhaha jk...but yeah, we were kind of like wtf at the time. The drunken noodles (pad kee mau) was pretty good. a unique sauce and thinner noodles than other thai restaurants. This could be because of the amount of oil they add to it though...look at pic for reference. Otherwise, it was a delicious dish. Green curry was filled with green beans, bamboo shoots, and other vegetables which made me a happy camper. next time, i may stick to the currys just so i dont feel so gross looking at an extremely greasy plate.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KRTF9XbMM6x-faugu5rNVQ",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Greasyyyy:/",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KRTF9XbMM6x-faugu5rNVQ/o.jpg"
      }
    ],
    "user_id": "w10NhKC5FShn8iZzm6QfmA"
  },
  "4f2LTQ7P7LY54u0bL3kjvA": {
    "date": "9/20/2013",
    "text": "Had takeout from Thai Rama CHandler this past weekend. Their Chicken Panang is delicious. And gluten free! As is their Pad Thai! I was tickled to get yummy gluten free food from a restaurant.  I've had food from here multiple times. It's always good!  And the gentleman who helped me and my 20 questions (about what is gluten free and what's not) was very patient and helpful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "HZNNzxRWxnTAFGKBaty3FQ"
  },
  "wvPyJUcrF20g8RzSU-8Dsg": {
    "date": "12/18/2015",
    "text": "My husband and I finally went to this place on a Friday evening. It wasn't busy at all. We waited several minutes at the hostess stand before anyone even acknowledged us and showed us to a table. Their sign clearly says \"please wait to be seated\" or else we might have sat ourselves. Once we were seated, it took another 10 minutes for a waitress to take our drink and food orders. We started with the egg rolls, which were clearly frozen egg rolls they just put in the fryer. My husband ordered the mango beef and I ordered the chicken fried rice. Food came out quickly- mine was better than his but we both said the meats were not fresh and tasted like they were re-heated from being frozen. Very underwhelemed with the service and food. We will definitely not be returning.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2U5VJvQ17FtB0wAmpaMowA"
  },
  "Bdhb5fl6G0qz4R3C-lN_NA": {
    "date": "10/11/2015",
    "text": "Lunch portions are extremely small..for almost $8.50 , there is barely anything .. These guys need to understand these are adult servings and at least need to have enough food for $8.50.  11/01 Ordered Masaman curry..ended up getting a combination of boiled water , little coconut milk and steamed veggies.. Chef..have some conscience.. For $11, atleast add some spices and salt to the boiled water and coconut milk..Ridiculous quality.. Other two curries were good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TwErSmI2nOF0UqXZ2tUDfQ"
  },
  "8O_lMpFla3z5F486GCq6cA": {
    "date": "1/2/2015",
    "text": "Our FAV Thai place! Service is friendly and things are made to order - so it can be a bit slow, but WORTH IT!  Lunch service is quick if you order off the lunch menu. I am a huge wimp so I always order mild. Soups are yum, my fav thing on the menu is PadThai mild with shrimp, extra sauce. Hubby loves the Panang Curry medium.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dlws23sSmB2z_QWaPXpCvQ"
  },
  "IvVJy9fY5AIYeLRq3Ojn1w": {
    "date": "5/15/2015",
    "text": "Best Thai food I've ever had! Literally started a Yelp just to give Thai Rama the rating it deserves. My favorite dishes: pad see ew, spicy eggplant, and tom ka soup.  Also have had the yellow curry and pad Thai. Everything I've mentioned above is easily better than any dish of those I've had anywhere else by far. The spices and flavored in these dishes are excellent! Staff has always been friendly. Nice call in/drive thru pick up feature as well which I've done every time and orders are always on time. Recently had the jungle noodles too just due to reading reviews on here. They were good as well but I prefer the other dishes mentioned above. I always want to try new dishes but the ones I'm used to are so good it's hard to stray, lol. I get the fried tofu with all the dishes. It's been excellent every time. Keep up the great work Thai Rama! When my family comes to visit this is the first place I will take them :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "MnmWBotqS220qtNmz5dvmw"
  },
  "0z2ML7zR-ysXEBkJ_OKzbw": {
    "date": "12/1/2011",
    "text": "Stopped by for dinner.  Food was good but the service staff came across as painfully shy.  Our waiter talked so softly, we had difficulty hearing him (the noise level in the restaurant was low).  Our glasses of water sat empty for a while before someone came over to refill.    Our appetizer dish (chicken wings) came out quickly.  It was delicious.  But the main course took a while to arrive.  It was hot and tasted good.   Overall, the food was what we expected, but the service was very slow.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bHzZ3shHF1PzBbqB47Ax0Q"
  },
  "tRjZ-fattqbygULGxkBhOQ": {
    "date": "7/26/2015",
    "text": "I had lunch at this restaurant twice and I really like the place. The atmosphere is nice. The lunch menu, prices, and portions are reasonable. What I like the most about their lunch is that the it has a soup and egg roll included with the entree and rice. Love the Thai tea! A must try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NeyLM_AbHbExOw3YnLHiKA"
  },
  "cdQbw1EKWApiFnjZESpH3A": {
    "date": "12/5/2014",
    "text": "Ordered to go to eat at my work desk. Delicious red curry and tom kha gai soup. Lots of chicken in both. I ordered mine extra hot. I didn't notice the heat, but I was sweating! I noticed they have FIVE levels of Thai hot after extra hot! I've had Thai hot before at other places and that's pretty much the limit for me. I knew the coconut milk would mellow things out and I wanted SOME heat, so extra hot it was. My order was up in less than 10 minutes. Why isn't this a 5 star? The tom kha gai soup wasn't delicious ENOUGH (I won't say who I'm comparing to) and the portion of the curry could've been a little larger but for the lunch special (you get a roll and wontons too) it was adequate. Oh and I'm taking home some of the soup.  Did you think I could eat all that?!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F3xsFydNSwKWgLwGMO0NOw"
  },
  "w_mpjDdN_vn6MijZguhXdA": {
    "date": "7/19/2016",
    "text": "So I am seriously bummed out to be writing this review because I loved this place and WAS a regular for several years.  There were even a few weeks my sister and I would eat here a few  times.  Last night we took a friend who had never been there and we were RAVING about how good it is and how much we love it there.  As we are all eating our dinner my sister and our friend say...\"what is that?\" they turned around and a dinosaur sized cockroach is climbing on the back of their booth!  we were all horrified and jumped out of the booth!  The owner was sitting near the back and asked us what the problem was.  When we said it is a HUGE ROACH!!!  One of her servers ran over and scooped it up but her only response was it is summer time and they like to come in!  ARE YOU SERIOUS??  The sarcastic me wanted to say yeah so do homless people but that isn't ok is it???  We were not even offered an apology, different booth or any sort of discount or comped meal.  To say I am disgusted is an understatement.  I'm sorry Thai Rama I loved you but we are breaking up and no it isn't me It's definitely YOU!  All I wonder now is what is happening in your kitchen where my food is prepared :(",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kdiaj_3wCZnourVz3b27Jg"
  },
  "JQhXXXwNfIdyQ10YD9qK4Q": {
    "date": "7/23/2014",
    "text": "They have delicious food, every bite is packed with flavor. Personal favorites are the garlic and cashew chicken, but the curry is excellent as well.  The lunch special is from 12-3, and it's a great deal. I highly, highly recommend stopping by!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TRSlMZEUG5a4D_wjx0pG7Q"
  },
  "MntwdPfqMOZ8ny3XzCLiZg": {
    "date": "8/22/2015",
    "text": "Glad that I found this place. I moved from California where there are a lot of good thai restaurant and I've been to many thai restaurant here in AZ and the food are suck. This restaurant is the best that I found compare to any other thai restaurant in the valley. Good service, good food and clean. Must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mOkO1JFFw2Iskgg30mJABA"
  },
  "YAWlLsHCKmWrvr95O0zXgQ": {
    "date": "7/19/2016",
    "text": "Met my 2 girlfriends here for dinner last night. It was my first time there.. They frequent it often. They raved about the food. Service was fine. We had veggie egg rolls as an app. I ordered the coconut chicken hot pot soup. It was a good flavor. Friends both got the same thing. I think a # 25, which they get often.  Mid dinner I noticed something moving between us and it was a HUGE ROACH on the back of the booth. Scared the hell out of all of us. We all screamed and jumped out of the booth, making a scene. Everyone in the place was staring at us and the owner was sitting towards the back of the restaurant eating. She asked what was wrong and we said there was a huge Roach on our booth. She remained seated and said, oh that's because it's so hot outside. They like to come in! That was it! No apologies, nothing! She didn't even get up from the table and kept eating. Needless to say, we were done eating and just wanted to leave. They didn't offer to comp our meal/meals, give an apology or anything. They just plain didn't give a crap! I will never go back and will be calling the health department next! Don't go to this Roach infested place!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "W4mRS3NiswJh4UF0xBdd-w"
  },
  "kYFxlACTsDtixOI0n7IVUA": {
    "date": "9/1/2015",
    "text": "The food is amazing, the atmosphere is charming and clean, but unfortunately the service can lack at times... All in all a wonderful place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qmfHMOIJ0KlenaFmMKTSTg"
  },
  "EjCdeCMVdAzM463ZYUi3hw": {
    "date": "1/5/2013",
    "text": "Food has been very good the few times that my family and myself have ben here.   However : Each time it seems like there is some type of issue with the servers or how long it takes etc... Its ok... I will eat here again, just not when its superbusy ...",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "0DtYzXkkX2LkZ9h6ToP9wg"
  },
  "yS18i5Sn6_hFvhXFUOZKtg": {
    "date": "1/31/2013",
    "text": "Still spot on for my favorite Thai food. The lovely and I are both ardent admirers of the panang curry and last night we wondered out loud why we'd been gone for so long!! Still delicious, unctuous curry with fresh ingredients that has yet to be matched elsewhere. Having said that, we have not been disappointed by anything we have tried; we took my vegetarian older brother on a recent visit and he swooned.   Service is always kind and attentive; the food arrives hot and promptly. Added bonus? A kid's menu that accommodates the less sophisticated, chicken tender-needy kiddo. Complete with delicious waffle fries and a very reasonable price.  This is a very relaxed, clean place, with takeout and a liquor license. We want one closer to home!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_y54HcEDbKSnFo8QZcKvqA"
  },
  "SN-MdPrZXb9HNIQ-z40S9A": {
    "date": "6/24/2015",
    "text": "Lunch special! This place is awesome two drinks and two meals for under 25$ and everyone seems friendly here. :) food is great. Alittle spicy ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KqmBH2snWwpGj6q2EHo_Tg"
  },
  "FCE-_cgJN6uZ-yvTQtOjeA": {
    "date": "3/28/2015",
    "text": "I've been here a couple time and I never like the male cashier. It feels like I was there asking for free food and they are so annoyed taking my orders. I usually order around $50 worth of take out and I should spend that at another place. However, Thai ice tea and beef salad is good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZFJ74aq65K0ReL5zZqzfig"
  },
  "rt3G4oaMDe71JZHRaj0TVA": {
    "date": "9/27/2012",
    "text": "The highs? $66 pre -tip for dinner for four adults and one child, including beverages and three appetizers.  The waitress was phenomenally sweet.  She was just a ray of sunshine... and I am not being sarcastic.  Really, I hope this place recognizes how good their servers are!  The lows?  Is my tolerance for heat so unbelievable when I go to Thai restaurants?  I asked for my dish Thai Hot, just like my mom and DH.  Still, I would rate the heat level at \"black pepper.\"  I added a teaspoon full of red chili paste just to get some more heat into my dish.  I felt their white rice could have been rinsed more.  It was kind of starchy - and not in the usual way.  Then again, I rinse my rice until the water runs completely clear and it is SUCH a waste of water.  :)  I was also not a fan of their sticky rice.    I felt confident coming here, despite the recent B rating on their most recent health inspection.  I generally won't go to businesses that are rated below an A, but my parents and DH have come here quite a few times with no issue.    Would I come here again?  Maybe.  It is not OFF the list, but it isn't anywhere near the top.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "_jjbwHWLFA5GjWFWGLj4ZQ"
  },
  "sdehxWqoEBM4kUxX0SnOSw": {
    "date": "1/15/2016",
    "text": "We have gone to Thai Rama for about 15 years and still love it. Love the Garlic chicken. Love that you can go from mild to hot to Thai hot. The owner is really friendly. They also have a drive through for call in orders.  Love taking family there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tDD6pgikuhqta_7AoTFkrg"
  },
  "ju8h_2wKPDeKQlQgVCiOVw": {
    "date": "3/7/2015",
    "text": "Cheap, fresh, delicious!  A friend of mine introduced me to this little Thai place and it's awesome. I'm definitely coming back. I had the mango chicken and our was so incredibly flavorful! Next time I'll get medium though...mild was too mild.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VF9AT21mJNGGC6xAoq-N5Q"
  },
  "hmjYwUvSZ0d9H3Rf_jooZQ": {
    "date": "7/28/2017",
    "text": "Service is very slow, wait 15 minutes in front desk to get table, nobody come to front desk and they should hire more waiter/waitress. Many other review also mentioned slow service. Food is ok though. It is not a god place for lunch particularly if you have to be back to work after lunch",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HYDkraSDGJb14D2av8trwQ"
  },
  "OVlY_Hi2BrA0CtNaq6D7BQ": {
    "date": "9/11/2014",
    "text": "Best Thai good I have ever tasted. I usually order the # 6 lunch special extra hot with extra chicken. It is the same as the #24 on the dinner menu. It is the best I have ever tasted. They also have very good soup. My favorite is the chicken with rice soup which is the lunch soup. If you are ever in the area you have to try this place. You can't go wrong!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "6urS-vMeMNMw1ogB577H7w"
  },
  "Cv-ewj4i8wX1Omo8AM-bHA": {
    "date": "6/14/2015",
    "text": "I've had a lot of Thai food over the years so my standards are pretty high. We ordered the Pad Thai and Yellow curry 3 stars. The Pad Thai was really sweet and way over spiced which I know was a mistake. However, I love spicy and only order 3 star in consideration for my wife. Setting aside the misfire on the spice, the pad Thai just fell short.  The yellow curry was probably one of the blandest I've ever ordered. Thai restaurants tend to not cook this dish properly, the potatoes being not fully cooked is not uncommon. This dish was cooked properly, it just lacked myriads and seasoning in my book.   It's too bad because they have a sweet drive through which makes pickup really convenient.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0BRyeXju2YedcTr5-6FwVQ"
  },
  "lfHVFjodimeix3bP6KdgnQ": {
    "date": "7/27/2012",
    "text": "The eggplant was great! The flavor was closed with my hometown tastes (even am from Indonesia :) ). I would like to go back to try other menu!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AQ3uj9DEagyk9hKb06QMEA",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Eggplants with steam tofu.  Strong flavors,  kinda salty, but reduce if you eat it with rice,  Duhhh! :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AQ3uj9DEagyk9hKb06QMEA/o.jpg"
      },
      {
        "img_id": "d-L90AnP8e6VCN6-54aEcQ",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Eggplants with steam tofu.  Strong flavors,  kinda salty, but reduce if you eat it with rice,  Duhhh! :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d-L90AnP8e6VCN6-54aEcQ/o.jpg"
      },
      {
        "img_id": "dytovTQ5lOKtkjG7iaG8Rw",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Spicy Squid with lime, basil, &amp;amp; mint. Woohooo! Sour, spicy, &amp;amp; fresh!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dytovTQ5lOKtkjG7iaG8Rw/o.jpg"
      }
    ],
    "user_id": "tM84r9rP7XTjX4SnRzviMA"
  },
  "WlC7fXxE6CIJ9uuuwdfZTA": {
    "date": "6/23/2014",
    "text": "I love this restaurant! Food is delicious and service is quick and friendly. Some favorite dishes are the tom kha soup, chicken Panang, and yellow curry. The portions are large enough to share and are customizable with your choice of meat and spice level.   I would give this restaurant 5 stars, except they NEVER answer their phone. Many times my husband and I have called to order dinner (to go) and the phone just rings off the hook! Very aggravating! We would order out more often if they had a reliable to-go system.   Other than that, highly recommended!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y72ODywxtfrusjDmQiGrNg"
  },
  "kyrw_aVPPO2L0-LWOg8icg": {
    "date": "1/23/2015",
    "text": "Waffling between three and four stars.  I am going to go with three since they've been cutting costs by doing things like switching from cloth to fancy paper to cheap paper napkins over the years.  Yes, customers notice.  Don't order the crab fried rice - it has shells in it.  The chicken and tofu fried rice choices were fine though.  The won ton appetizer is very tasty and usually  not too oily.  My usual order is the chicken noodle soup, which usually has some nice pieces of chicken (though they seem to be using more \"scraggly\" cheaper and thus tougher cuts lately).  Be warned that different chefs/cooks seem to have different ideas of what \"mild\" means.  Some will not spice it at all, while sometimes it will have a touch too little or just enough heat.  My solution is to ask for the spice tray.  I use the red chili powder mix in particular, but only add a little at a time or you'll add not heat than you want.  Blame it on being from Hawaii, but I also enjoy ordering a side of white rice and using that to supplement the noodles in the soup.  The service isn't bad, though sometimes they get slammed and the few servers working cannot seem to keep up.  My family enjoys it here, so I am sure I'll continue to come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mvq6mTZBd3mdDg_bZRWiuQ"
  },
  "2R_9xCZt-VzNBlpdCqhjlw": {
    "date": "8/12/2017",
    "text": "We arrived 9pm for some late night Thai, and even though it was empty and near closing they were very welcoming. Our server had great personality, and the food was outstanding. I had number 19- sweet and sour. Fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rWK-QU46SG6k8qEMdjhtLg"
  },
  "qbmx6XLAHUcSw_oU_9_EgA": {
    "date": "7/12/2016",
    "text": "Still love this Thai restaurant! Loving the yellow beef curry. I like to eat in the restaurant and also order in and pick up. Best place hands down",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HGuZxJylwcq3aAp3iBf4tQ"
  },
  "Gs5Y0vW-GtQQ5iwkpS8jGA": {
    "date": "3/16/2014",
    "text": "I love the food here at Thai Rama, but it's been awhile since I ate here.  Everything I've ever had here was very delicious.  However, it's far from where we live and not so convenient to dine here.  Periodically I have come here with my extended family and food is good, but service is so-so.    Although this is bad to say, I think if you're really Asian and going more to an Asian restaurant, although this does have an American flair to it, we don't tend to get great service.  Not sure why that is, but maybe it's a part of the culture.  Maybe if we were a bunch of white folks, we'd get better service, but then, maybe the food would taste different.  Authentic Asian food tastes better than the Americanized versions.  Thai Rama is like 50/50 and that's fine with me.  The Asian population is very spread out in the Phx area, so it's hard to do super authentic Asian (whether it's Thai, Chinese, Vietnamese or whatever) because most likely most of your customers will be more accustomed and want the American taste of Asian food, so I don't blame them.  Thai Rama is about my favorite Thai place and it's reasonably priced.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "53JHz4dbMg9JfuzakOZK4A"
  },
  "4eLGAs-XkHMpCcUaTmsBOA": {
    "date": "10/8/2016",
    "text": "We come here at least once per week for lunch.  The panang curry, garlic chicken, and pad thai are all excellent.   If you are looking for a more authentic/spicy Thai dinner the Tom Kha is an excellent soup choice, watch out for the pieces of ginger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "423V7_mtSiPE3vc2GWdh6w"
  },
  "aoL94vhOp15H_BY5GvVSFg": {
    "date": "8/31/2017",
    "text": "Love this place! I order the Evil Princess Curry usually & it's so delicious. When I order in for pick up they have it ready. Portions are a good size to. My goto Curry spot",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5M16W5IxKPe2v_enXiHvXA"
  },
  "O_lrZd2MBRvvO9MRQirjvA": {
    "date": "6/4/2016",
    "text": "Always good! I love  the tom Lang soup and the green curry.  Lettuce wraps are another favorite. I wish I could go there more except my husband doesn't care for Thai food so that makes it pretty hard to get him to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SdgzyCHJjyJEgndQC_my1w"
  },
  "rnPpOY3TKK0idaZh68yzGg": {
    "date": "11/14/2014",
    "text": "Disclaimer:  I've been to Thai Rama 3-4 a dozen times, and this review is the combination of those experiences.  Food:  Good.  Honestly probably too many choices so it becomes a bit tough to decide what you want.  Would like the option of brown or friend rice up front (all dishes come w. sticky rice).  I'm a green curry junkie, so I'm biased when I say that is quite good  Ambiance:  Relatively casual.  Tip #1:  The food is properly spicy, so expect some pretty serious heat for 4 stars and for f5 stars, watch out!  Service:  OK.  They tend to be a bit on the slow side and the waiters are not very familiar with the menu, so they are not very helpful when it comes to making recommendations.  They are all relatively pleasant though.  Prices:  Mid-range.  ~$12/person.  Net:  This is a solid lunch place when looking for something simple and not too difficult/complicated.  I'm a bit on the fence between 3 and 4 stars.  The big pro is the price for a mean is quite cheap for decent food.  Service is on the weaker side despite being nice.  Food is good but not great.  I gave Thai Rama 4 stars but it's on the weaker side of that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aOcxDGNIuJCIbtouQ4NCig"
  },
  "ND1hT3xdQTiFpu-Okofoyg": {
    "date": "3/24/2016",
    "text": "I love this place. 5 years ago I use to come here for lunch and for dinner, but I had moved to a different state and I sure did miss me some Thai food from Thai Rama. I moved back to Arizona back in September and when I got the chance, I went back to grub on some delicious Thai food at Thai Rama. I sure did miss their food. Pad Thai was amazing, their chicken satay was SOOOO good. Everything was amazing. It how I remembered it being, so flavorful...so YUMMY!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dsenccft0ii83bjgpKBqoQ"
  },
  "SSF1T9QucgTsinJz2-hJPQ": {
    "date": "12/14/2011",
    "text": "I had wanted to go to this spot for some time now... I went for lunch and entered to an empty restaurant it seemed to be a trend for me... I was seated right away and was greeted with a smile from my server very helpful as well... I ended up going with the Panang Curry with beef lunch combo... I rate the experience as followed.  Panang Curry with beef - B Staff - A  It was a good meal but it was not spicy enough for me... I would say this spot is very much like Thai Basil so you're in the area it's worth the stop.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RRS_5jqwMQMEQkVkc6CHpw",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RRS_5jqwMQMEQkVkc6CHpw/o.jpg"
      },
      {
        "img_id": "pNJ-duO5MDpHxNmrDMyfOw",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States. Soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pNJ-duO5MDpHxNmrDMyfOw/o.jpg"
      }
    ],
    "user_id": "PNx1x8x3wjTIjrjhaNiVAQ"
  },
  "Bx-UBtd51qFU-iB7b7ZNZg": {
    "date": "6/23/2008",
    "text": "Exotic aromas teased my palate upon entry.  The dining area was bustling, but the one waitress (who also served as hostess, cashier and table busser) operated most efficiently.  The lunch special prices are agreeable, even to the most penny-pinching niggard in your party, at under $7, and come with soup, an egg roll and a couple of fried won-tons.  Their phad thai portion was about twice the size of their curry specials.  This place gets busy around 12:30, so be sure to arrive before 12:15, or stroll in after 12:45.  I watched heartbroken as a strikingly tall blond, sporting intriguing body art, turned and walked out the door once she realized there were no open tables.  My outward demeanor was sullen, while inside I was screaming: \"You maniacs!  You blew it!  Damn you!  Damn you all to hell!\", as I pounded the table with my fists.  Great food, but can get a little loud.  I highly recommend Thai Rama, even if you have to endure the grating vocal stylings of an insecure nit-wit who feels compelled to laugh at every insignificant comment uttered from those dirty apes she strolled in with.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "rMsB82tk9uOB6JumPMgczg"
  },
  "SletCOtUY8GgfXLEGMo-mw": {
    "date": "3/22/2014",
    "text": "Just so everyone knows, when you order pad thai with medium spicy, be prepared to drink an entire gallon of milk with your order. I've never had anything so hot before. My boyfriend, who loves Thai Spicy, couldn't even stomach his order of medium spice pad thai either. Maybe I'll order NO spice next time. If we go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UZdvRPwRD6J1WIj21joaPg",
        "caption": "Photo of Thai Rama - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UZdvRPwRD6J1WIj21joaPg/o.jpg"
      }
    ],
    "user_id": "QZfJ7UulkIQJR--4Bduj6g"
  },
  "8N_R2tksFMNEaWB4iGmGsg": {
    "date": "8/1/2016",
    "text": "Generally speaking, Thai Rama is very good.  My wife and I have eaten there a handful of times over the past few years, and I think -- at some point -- the kitchen staff / chef must've changed as the food was markedly better than what we had remembered.  (That's always a good sign.)  Occasionally, it's been very busy (Friday nights, early Saturday evening), but we've never had to wait for a table, and the service staff have always been friendly AND helpful in making recommendations.  While Thai Rama isn't our favorite Thai restaurant, it's still an appealing choice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ROPMbvTDGVL0ErkUK9H7w"
  },
  "i1Mr9thqrtVc__SZlo-gzw": {
    "date": "2/10/2014",
    "text": "Excellent food!  The tom kha soup was some of the best I've had.  Service was a little slow, but they were very busy and seemed to be short staffed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "r9tjKaqLvLKF7PvDnUsFnA"
  },
  "vSbvcX3DykSJYU-p7BAG0g": {
    "date": "9/21/2008",
    "text": "You can't beat the lunch deals.  15 different options and they are all good.  Most are $6.25 as of this review.  The lunch specials come with a really yummy chicken soup with ginger and a egg roll.   Both are good.  It is sometimes tough to get a group of 6 or more a table at peak lunch time (11:45).  If you have a big group get there by 11:15 or come after 12:15.  I haven't been there for dinner.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XrsyfOHI940MroW6MFoJIw"
  },
  "PZiVJWYL_HiNCCSmPCRyYQ": {
    "date": "6/21/2009",
    "text": "Poor welcome. Poor service. The phad thai came without tofu!! The lasy at the entrance didnot even have a smile. The waitress seemed in immense hurry and even forced me to talk when I have foof in my mouth!Aas if we are here to impress them!!! Quantity is way too less for 12 dollars!!No soup free no salad free nothing!!! The people in the neighbouring table were beavhing like wild animals and talking loudly but nothing was doen to stop them I promptly rewarded them wth ZERO tip!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DY6llzCOzhz2BngG2H-NlA"
  },
  "niDNzDvN8NbMOyrfLFBImA": {
    "date": "4/1/2010",
    "text": "I'm with Shanna K on this one. I'm so addicted that I'm there almost once a week. No wait, I'm there EVERY week at least once!  I was never a big Thai food person, until I tried this place. Now I can stop eating their food.  Although I also have to agree with some of the other review that service can sufer during the lunch rush hour.  But worth the wait every time.   My usual?  the egg rolls to start, chicken curry to get the party started... and for dessert; the mango sticky rice, to cool things down.  aaaaah",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dPt4wFFCoJa14YW_vjNwDw"
  },
  "JUFX36sQokrSISwidLw2Ow": {
    "date": "4/17/2009",
    "text": "I'm no expert on Thai food.  I just know I love it and of all the places I've tried in the valley I like this place the best.  Great yellow curry and my wife and kids who like to keep it bland and simple can get the teriyaki chicken.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WE-rwcYHCY4zBarjB8OnEQ"
  },
  "MfNIuY2pESvfpsUKyoSLww": {
    "date": "12/16/2011",
    "text": "Originally loved this place when we were only ordering take out. Then we decided to eat there... Horrible experience! Food and portion size are good but the service is poor and the dining room a mess! We waited 20+ mins after finishing our meal for anyone to come back to our table and there was water dripping from the ceiling tiles. Definitely order take out... Our experience ruined this restaurant for us and we will not be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8WB8vyXCRgZ6-azLxVXkfQ"
  },
  "Qn9Ykapqj_8FJSvhxeM8aA": {
    "date": "1/14/2009",
    "text": "This is one of the better Thai restaurants in Arizona.  Their Pa Nang Curry is addictive and I have to have it 3x a month.  The restaurant is generally busy and the wait staff is a little slow, but they consistently make good food and are priced very reasonably.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OaD9Lhdz9YAeRuiUAUuDoA"
  },
  "DlKUL0Vt99tsRejIFZ4lOg": {
    "date": "12/29/2011",
    "text": "Their Pad Thai was one of the worst I've ever had. It was bland, dry, and cost $10! Although their serving size was descent, I hardly ate any of it. Hot sauce wasn't even able to help save this dish. Very disappointing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2UQYJh4fz5JS3v4yBq3JRg"
  },
  "-DneWGAjAYSZLGb17_4RBA": {
    "date": "9/16/2011",
    "text": "I was craving Thai food and always drive past this place so I decided to give it a shot. I ordered the Phad Thai and Thai Ice Tea. It wasn't the best I've had but I would probably go back. The ice tea was definitely not sweet enough, but overall not a bad place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IgxvS0Rbhah6qwOlMpZbUw"
  },
  "c8klu839fqAejT3cMfjsqw": {
    "date": "1/29/2011",
    "text": "I'm sorry.  We went to Thai Rama in December (before Christmas) and the smell was so foul we couldn't stay (not sure if they were having a plumbing problem or if it always smells that way).  Maybe we'll try again some day...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jtXz3kSJA4LX98tJoBJ6QA"
  },
  "703N8GBnhs_oTe-K0RaObA": {
    "date": "7/11/2011",
    "text": "I have been to what feels like every Thai place in Arizona. This is definitely one of my favorites. This place has pickup and is reasonably priced. My only complaints would be that this place is a bit dingy and old.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2OFNl9UTZLD9G9uNCsd-rQ"
  },
  "TNEf3etWgZjMppA7wRHLiQ": {
    "date": "6/18/2012",
    "text": "For the last few years this has been my favorite Thai food restaurant in the Phoenix area, but it is starting to slip. The food has been so good that to this point it has overcome the poor service. As much as it pains me to say, I am not sure how long that will be the case. I rate the food a 5, but the service a 1. My favorite dishes are the Pad Kee Moa, Evil Jungle Princess, and the Panang Curry. The food has great flavor, with just the right amount of spice. My wife's favorites are the yellow curry and the noodle soup with chicken. The owner and her staff are very nice, but the service is poor to say the least. It can take a very long time to get seated, even when they have many tables available. It can also take a while to get your order taken. Once you get your food, you many not see your server again until it is time to get the check. Overall they are not very attentive... but the food is amazing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3xUCUUefn9mq0gTzw-axlg"
  },
  "77aq25uNbMJjha59fXfTbw": {
    "date": "8/3/2010",
    "text": "i went here for lunch and i was very disappointed.  The food was very bland and was served on dirty plates.  The wait time was okay, but the waitress was very rude and wasn't very attentive. The food is decent priced but the food was not good. The tea also had a cigarette smoke after taste. The water was not clear (maybe from the lemons) but the water was tap and tasted  very bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U9qEIyRqGmsERH93XZxR6g"
  },
  "XLUxf8zvtqkB7CXJKxinfw": {
    "date": "2/28/2010",
    "text": "I'm not a big fan of Thai food, and when my friends decided that we were going to visit one on our night out, I was a little concerned about how my selective palate would fair. Upon perusing the menu for something edible, I found the Kids Menu section, under which there were three delicious sounding options I would be able to handle. I was ecstatic to find these, to say the least. I hadn't had macaroni and cheese or corn dogs in quite a long time, and I was eager to treat myself to some embarrassingly amateur dishes. I ended up ordering chicken strips and fries and a large glass of coke. I expected a comment or a \"seriously, chicken strips?\" look from the waiter, but I received none. The service was quick and even patient when one of my companions couldn't decide on what to order.  The food was delicious and set up in an appealing manner. There were three pieces of chicken and two handfuls of waffle-fries, plus a decorative little bit of shredded carrots and a green vegetable I couldn't recall the name of. I didn't ask for any ketchup, but it was given to me, along with a separate bowl to squeeze the ketchup packets into. I was thankful for this, because I hate mixing foods and getting ketchup all over foods it doesn't belong on. The chicken alone could send your taste buds a-moaning. Crispy on the outside and juicy on the inside, it's absolutely delicious. The Colonel can only dream of making chicken this scrumptious. The waffle-fries are another story. They were seasoned and cooked to absolute perfection. I was utterly addicted to their taste with the first bite. That, plus the the right amount of ketchup and my tastes were lost.  Overall, the food was excellent, perfect for those who are hesitant in expanding their palatial horizons and want to stick to something a little more familiar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TpNpabiltNWfRXOOFjXSpw"
  },
  "hzjQsUgVU8M5JStXsnj9MA": {
    "date": "1/19/2010",
    "text": "The food here is amazing! My boyfriend is Jamaican so he is a huge fan of curry and has always wanted me to try it but I always thought that it smells funny. But Thai Rama has amazing curry its one of the better things I have ever ate especially the Panang curry which taste a lot like peanut sauce. Don't forget to odder chicken satay as an appetizer it is one of the better things they serve there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iw-RWqC_w1oZM0zffx3I1Q"
  }
}