{
  "DCbr85ANIhT7-43EfYzeZA": {
    "date": "5/2/2017",
    "text": "We were out shopping in the area and turned to yelp for great reviews on sandwich shops close by.  AZ Bread Co. came up and we decided to give it a try for take out.  We ordered the El Pavo: turkey breast, bacon, avocado, tomato, lettuce, and it was supposed to come with pepper jack, but it was missing.  This sandwich was very dry and tasteless.  It had no mayo or other condiment added.  It did come with a small side of coleslaw that was also bland.  Our second sandwich was the Carne Adovada.  This was also very bland.  I definitely didn't taste any chipotle mayo!  We chose the red potato salad which was also flavorless.  While the customer service was very friendly and our order was ready to go quickly, we were extremely disappointed with the taste of our lunch, especially for the steep price tag!  We will not return for lunch and do not recommend.  I did notice when I went back and actually read the reviews, that most were for breakfast.  Maybe that's how they received so many stars.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bq6Q5J5zQvHC1hi4w0yxxw"
  },
  "rgz63dvzuonTDP5K7pKVvw": {
    "date": "12/8/2011",
    "text": "Went for our 2nd time on Sunday.  The place was P-A-C-K-E-D yet they were able to get our order to us quickly.  The servers get the tables cleaned very quickly so there wasn't much of a wait for an open table.    For the second time, I got the egg sandwich on ciabatta and it was fantastic.  I'm not used to ciabatta being so soft and chewey - normally it's toasted until it's rock hard.  This is soft enough for my 18 month old daughter to eat (and she calls it \"balabala\".)  My husband got the carne adovada again and it was amazing.  Spicier this time than the last.  It's served with toast... some of the best wheat bread I've tasted.  My mother ordered one of the wraps and was very pleased with it.    My only gripe is their coffee is weak.  But then again, I like a strong cup of coffee and it's extremely rare that I order coffee outside of my home - nobody makes it right - you eather have it too weak or it's burned to a crisp (ala Charbucks).    This place is close to home so we will return.  P.S. - there's interesting local art on the walls.  I've been meaning to ask if any of it is for sale.  I love supporting local small businesses and artists.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "P4z8peS_XFNFKhWcdDuHyw"
  },
  "HMIsy8pepeXe_mOGgpOruQ": {
    "date": "5/12/2013",
    "text": "Went here for brunch and was pleasantly surprised by the yummy food choices. I ended up having the Phoenician. Friendly staff and fast service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "h0_8BlajnY99QlQxmmeJRw"
  },
  "K5A2Y4WciZY8hzky1G-JoQ": {
    "date": "7/13/2011",
    "text": "Very happy with our first trip here.  Fast, friendly service.  The food was better than expected.  I had the carne adovada breakfast.  Wow!  The meat was moist and tender and perfectly topped with the jalapeno cheese sauce.  Before this I would never have thought to have pulled pork with breakfast.  Yum-my!  Ice cold inside on a hot summer day.   Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D1sFmPCZvbCJaHDWlkNLgw"
  },
  "WYnBWhtKMCQTYBhKecsl_w": {
    "date": "7/5/2011",
    "text": "I came here for lunch and I would like to come back and try something else and maybe revise my review but this first experience was just so blah. I wanted soup because, honestly, my office is so stinking cold I needed to warm up. I was torn between two soups: the tortilla and the chicken chili. The woman at the counter was very nice and gave me a taste of both. They were both fairly bland and average. I decided on the chicken chili and ordered it in a bread boule.   The soup was just so bland. It was salt, some corn starch to make it have that weird gelatinous texture thing going on and it was lacking in substance. Some little shredded pieces of chicken and that's about it. I wanted some green chilis!! Or anything really to add some flavor. The bread was ok. Not great, not terrible.   Overall, I was fairly disappointed but I would be willing to give it another shot and try something different on the menu. The menu is pretty varied, which was a good thing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rSWQ_yu3xgVaTCyUdspBkA"
  },
  "Ii5QoEPa3cSa_oR5DXgWkA": {
    "date": "11/10/2010",
    "text": "I recently stopped by the AZ Bread Company for a quick lunch while out running errands. I was hoping for a really great salad, but their selection was pretty unimpressive. Instead, I went with the turkey avocado BLT wrap. I had high hopes, but was sorely disappointed. It was super bland and boring, and I think that's tough to accomplish with a BLT. There was way too much turkey, so it totally overpowered the rest of the ingredients, and the avocado didn't seem very fresh. The only redeeming part of the meal was the red potato salad which was actually pretty good.   I probably wouldn't come here again. The menu overall seems pretty unoriginal, and the ingredients just weren't very impressive.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "XF3ho4jKNzFy9PInhRbBWg"
  },
  "QRlX07iGfzDZdPwzL0XDIg": {
    "date": "4/9/2011",
    "text": "Better and better!  I make it to Phoenix about 4x a year and always make time FO this place.  Great food and coffee and wifi and patio and did I mention the FOOD?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_2JgE8cVRekdtorBIO2w2Q",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_2JgE8cVRekdtorBIO2w2Q/o.jpg"
      }
    ],
    "user_id": "Xc4dHzJ1sC4NHPqh8wAj8Q"
  },
  "f-gepe9xJmNSwIj4fmPTjQ": {
    "date": "4/16/2011",
    "text": "This place was great! Great food and good service (the owner seems to stop by every table to make sure everything's good). Stopped here for breakfast with my girlfriend and although it took a little while to get our food (20 min. but the place was PACKED because of a local cycling event and Pat's Run) it was well worth the wait!  I got the Carne Adovado and it was delicious! The pork was seasoned perfectly, VERY tender, and the jalapeno cheese on top kicked up the heat just right for the dish! My girlfriends sandwich was pretty good too but she stole a few bites of pork too because it was so good!  The potatoes were also great, and seasoned very well. The only thing that was slightly disappointing was the eggs. Not very fluffy and no flavor to them hardly at all. Perfect for pairing together with bites of the rest of the plate though I guess.  Portion size was great too, we both left completely stuffed! Definitely give these guys a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4R4B2F13LhfUdmS_e8wGew"
  },
  "Tbk2ie5b-L6wkmMHXTMydg": {
    "date": "4/13/2013",
    "text": "The place started out well, a young woman at the counter offered to help us, before she could take our order, the phone rang. She got involved in a long order with many questions, the man at the counter finished helping his customer, glanced over and walked away without saying a word. We had never been there before, so he couldn't have had a bad experience with us, but that's how he acted. Maybe we resembled someone he hated. He wandered aimlessly around the restaurant while we waited. Ordered the Wrangler, the eggs and potatoes were standard quality, the pure pork sausage seemed good when hot, but as it cooled down seemed to be full of soy filler or something. The sourdough toast was good, although I suspect they use margarine, not butter on it.  There were tables outside, as we left someone was smoking there. First and last visit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rcl6sdC9n_Z0gb8k7K7RrQ"
  },
  "EIy_CcoEsAhmo_ZJJdKbxg": {
    "date": "2/26/2011",
    "text": "The AZ Bread Company definitely hit the spot! Located in a strip mall, it's easy to find and there are plenty of tables outside. It's set up so that you walk in, place your order, receive a number and seat yourself at a table. The decor is bright and cheerful, and the facility can accommodate large groups.   I had a frittata with spinach, mushroom, red pepper, onion and feta. I couldn't even tell that I had ordered it with Egg Beaters!  I really appreciated being asked if I wanted butter on my toast; rarely do breakfast joints even provide that option.  I chose the honey whole wheat bread and the portion size was incredibly generous. My frittata was accompanied by diced potatoes, which were in need of a little salt and pepper (I'd rather have to salt my food than have it come out overly salty, so no complaints here!).   My friend had the eggs Benedict, and he loved it. He couldn't finish half because it was on the salty side.  When we were wrapping up the meal one of the owners came by and asked how our food was.  I'll definitely come back to try their French toast--it looks incredible!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "owt0p6Z4iZ6ylvbMWIO-qw"
  },
  "eSoEeWRHoxlgsyD2OHVN9g": {
    "date": "1/7/2013",
    "text": "Yelped this place for breakfast one Sunday morning and my bf and I arrived at around 8:30. We were surprised to see a ton of people there enjoying breakfast already, including a large party of about 15 people. We got in line and I ended up ordering the Rancher (two eggs, bacon, bread, and potatoes). My bf ended up getting the same thing with sausage. We grabbed a table and our food was out after a few minutes. The eggs and bacon were pretty standard - good. The potatoes were really good, seasoned nicely, obviously made fresh. The bread. You know, I'm not sure what makes bread really good, but there bread was really good. I had the sourdough and bf had the rye. We both enjoyed our meals, the owner came by to check on us, it was a really good way to start the morning. I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wJgtf18VKKZq9A6ZQUybQw"
  },
  "U16ZdGWvW_RVsGVVVb1QPw": {
    "date": "2/5/2016",
    "text": "This is our go-to restuarant for the very best fresh waffles, french toast and hot, interesting omelets. The Carne Adovada omelet is the best; lots of moist, flavorful pork atop fluffy eggs -hmmm, heavenly! The service is quick and attentive. It means a lot that Carol takes the time to get to know her customers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V-ilXT5qHW6HUeGZF6MvDA"
  },
  "Uy5b5v9E0x4EfHuVsTXb5Q": {
    "date": "10/4/2010",
    "text": "Had a few lunches here, meeting with a good friend to talk some business. This place is good for that - lots of tables, lots of outlets for your laptop and of course, free wifi. The sandwiches are pretty okay, too. Overall, it's a good place. It's a bit out of the way for me - and I'm not a raving fan just yet, but it's a good solid casual lunch place, with the menu items named after Arizona landmarks/cities.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "uAcWvAT1JaqRlxF3bfIwPA"
  },
  "4D4FhJ6hfs6WNb0Rv746Kg": {
    "date": "11/22/2015",
    "text": "1st time and unfortunately the last time.  Wasn't fresh and the soup taste watered down...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t7SKC77X-iX15dB7dC0b2Q"
  },
  "ewYZXi0cHEa9O_c5o4llDQ": {
    "date": "11/4/2013",
    "text": "Fresh ingredients. They bake their own bread, which is excellent.  The pick 2 is the best choice for me since I love the Sedona sandwich and Potato Cream Cheese soup.  They don't skimp on portions, the half sandwich looks more like 3/4!   Great staff and owner!    The only downside is going at lunch.  The computer register has a small problem when entering the pick 2 so sometimes you spend much more time than you'd expect getting rung up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "02Z0sSGvQRm2rgQwUmNAJQ"
  },
  "yiUQgKD5UAbodWdhOhEqvA": {
    "date": "1/22/2012",
    "text": "Potatoes and coffees were good. Carne Adovada was highly anticipated coming to the table but was little more than pork slow cooked in a lot of  sauce covered in a white quest sauce. My GF got the ajo wrap said it was very greasy. I must say the toast was excellent with homemade bread but I was little dazzled by the rest of the meal.  Recommendation: get coffee and some challah and be done with it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x5W1IOD1Eflww35t0ms3zg"
  },
  "Q7t30fqb5Ehrrt0gNAujaw": {
    "date": "11/5/2015",
    "text": "Great food however the owner (assuming) is very loud and constantly nags at her staff. Went there this morning and was a little uncomfortable while eating and listening to her constantly nag at her crew to do things even though they were obviously busy while she was just sitting there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gRsKrloI3HAnDLZbCCtQsg"
  },
  "p-JQFNPeUiGnWJ_uCS_u_g": {
    "date": "1/25/2015",
    "text": "Let me preface this by saying 7/8 times that we have been here has been a great experience (friendly staff, great food, great prices). The most recent visit today was the worst restaurant experience I have had. 35 minutes in my girlfriend mentioned it seemed it was taking a long time. I jokingly said they were getting the chorizo shipped from Mexico. At that time the owner came out to apologize for the long wait that it was at the end of a long rush. Okay...understandable-ish. We then saw the three tables that had all been cleared and sat again around us get their food before getting agitated. Don't apologize for a long rush and then serve the three tables around us while we have been waiting for 40 minutes. At minute 53 a younger man came to the table and rudely dropped one of the two plates on the table without saying anything about the other. Exactly what I wanted, crusty hollandaise sauce and soggy bread on my cold eggs florentine. Minute 55 the second plate arrived with a thick crust over the cold cheese sauce. Terrible way to start my Sunday morning. Needless to say I won't be going back to AZ bread co.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FTQ-REpjOcu97yG_YtqXDw"
  },
  "L5L1BSTcrIVcq3SdM_Jy0g": {
    "date": "8/30/2013",
    "text": "The ideal breakfast place.  Quality no nonsense breakfast food.  The owner Carol and her staff make every customer feel like family.  All the items on the menu are solid but I prefer the Amanda burrito with chorizo.  For lunch they serve great soup and sandwich combinations.  Try the potato cream cheese soup it's awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nok3ek_DmENWLLyZUTaDyQ"
  },
  "-wNIhQI03VX1QU-ytK-Vvg": {
    "date": "11/1/2013",
    "text": "New favorite breakfast spot. The service was great, the food was great and who doesn't love not having to wait for refills? The owner came over and asked us how everything was, I was impressed. The menu had plenty of choices and the food came out in no time. Very nice place to sit down and relax. Whatever you order ask for a side of the jalapeno queso dipping sauce, soooooo good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8_4IKGbtQU-jm5_QK9Rrew"
  },
  "J9r6OSPTzb61aaovsA8yiQ": {
    "date": "4/5/2015",
    "text": "Saw an article in the paper about this place. Tried it out. Eggs and bacon were great. Waffles were very also. Food was fresh but was delivered pretty quick. Noticed that many customers were regulars and known by name by staff. Tells me it must be good and a very friendly place. Staff was very nice and helpful. Will be back again soon. Would like to try them for lunch also.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JjfjMISJdrdx-gvSKvlY3w"
  },
  "ah68rkcGqtQb7J9M4ejbHA": {
    "date": "9/13/2014",
    "text": "Love the potato sour cream soup. Didn't care for Tuna Melt aka Monterey Sandwhich.  Tuna salad was dry and wanted less Tuna and more mixins. Everyone else meals looked great and service was friendy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Va5G0uEVx20hdd1aJR1iqQ"
  },
  "C_PHhOyk54m9XpGYrUV0XQ": {
    "date": "7/10/2016",
    "text": "We love this place for breakfast. I always get the Montoya Skillet - yum!! Great, friendly staff. They now have gluten free options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eV7fAqomz3Dw57Jsixki-Q"
  },
  "yqolvek2Ck3fo8lATfUehA": {
    "date": "2/19/2014",
    "text": "Would never have seen my self going out to lunch with a client to a restaurant that did not have waiters / waitresses . . . but was glad the client chose this place.  I ordered the Sedona Sandwich and the Jalapeno Queso with Chips.  The food came relatively quick and was warm and very tasty . . .  the sandwich had a great balance of flavors and very enjoyable . . . while the queso had just the right amount of kick.  The place was clean, and the staff was nice and friendly . . . my problem is that I have trouble giving a restaurant five stars if it does not have a wait staff . . . but this place was very, very close.  this place is definitely on my return list.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "LTWwc5SMKVd5UHN7Y-sxsw"
  },
  "Bgi4jd0i4d1JosaSm4vpAQ": {
    "date": "8/5/2016",
    "text": "I ate a breakfast burrito with jalapeno queso sauce and it was excellent. The main reason I'm giving it 5 stars is because of the service. Everyone was very friendly and put in extra effort to make sure our family had a great dining experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FLRFVyKQ0AWi23d-nVuPvg"
  },
  "yyoIUG6Z2ugVxFMxv2q9lg": {
    "date": "10/22/2013",
    "text": "I was hungry and this place was close. I expected a franchise, even though I do try to avoid them as much as I can - but found out that AZ Bread Company is NOT a franchise.   I had the Carne Adovada even though it was little too much pork for the morning, but I cant complain. Nothing was spectacular, but it sure was what I came here for. The service is nice, our food came quickly and everybody seems to do everybody's job. It has a nice atmosphere in here.  It will not become a place I frequent regularly, but once in a while when I feel that I deserve a huge breakfast and I don't want to cook it myself. Yes this place probably will be the place I choose.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7nI_9eRz1YKnaA0AYTLiBw"
  },
  "YJzs5Zquw1HPQnqvvqeW_Q": {
    "date": "12/8/2014",
    "text": "Just moved to the neighborhood, so I thought I would try this spot for lunch.  NEVER AGAIN. I had a 1/2 sandwich and soup. The Scottsdale and corn chowder poblano. The soup was just ok, usually a chowder is creamy but the soup was watery. The potatoes used in the soup very definitely a freeze dried potato or previously frozen, they definitely do not use fresh ingredients.  The sandwich was downright awful. The bread was grilled and left on the grill to long as it was burnt. The roast beef was a grocery store lunchmeat that was tough and chewy. The sandwich didn't have any red peppers on its as advertised, and the meat was a little blob in the middle of the bread. I was really disappointed as I love a great 'Deli\". Unfortunately I will never eat there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u4l6I2NAdUxwGOYRQXtKJw"
  },
  "WyMMGnRZsxRoJgYMfuSYRg": {
    "date": "6/25/2016",
    "text": "Great local neighborhood breakfast and lunch place. The omelettes are excellent with local queso sauce made fresh. Pets are welcome on patio. Very friendly staff and great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QnmcsVtUEqfl3YoRRB9sQA"
  },
  "U_crxu0vjDrwy1ulkboouw": {
    "date": "3/13/2014",
    "text": "Think Panera, but local.  This place has a lot of good choices including a \"pick two\" combo for lunch.  I liked that they had 4-5 soup options along with several interesting salad choices.  I went for the combo with half panini and tortilla soup, and it was quite good.  I wish they would allow a small specialty salad and soup as a combo option, but it appeared on the menu you can only get a small garden salad or caesar.  The workers here are super friendly and the food came out super quick.  If in the area, I definitely would come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fkawweeCwxO7cWq8EgEkFw"
  },
  "ouk6YPaFHL0EpTNXKElsWg": {
    "date": "2/12/2015",
    "text": "Great conversations with the ladies next to me! Went to breakfast by myself today and it was lovely! Got a latte and a breakfast wrap. It was my first time in as normally I drive by in a rush! Great service and place to grab a bite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TWODCnV3iZDMQMCcRS2mhw",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Yummmmm",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TWODCnV3iZDMQMCcRS2mhw/o.jpg"
      }
    ],
    "user_id": "doS0TxGDhAGC1e9qQBw0oQ"
  },
  "ANzzeVWXq_9r3GIVrsZejg": {
    "date": "5/3/2016",
    "text": "I have been to AZ Bread Co. several times and each occasion was excellent.  They have wonderful breakfast dishes from french toast to omelets. They are also great for muffins (I just had the carrot cake muffin - excellent!  Not too sweet.) smoothies.  This is a convenient location if you are out biking the canal.  The staff and owner are very friendly and helpful.  I highly recommend them for breakfast and lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OwEtqmoceIW-n1j6nhoNRg"
  },
  "c2fK26-sIT2p91nfJlKGTQ": {
    "date": "12/6/2016",
    "text": "I come here once in a while when I want something healthier and quick. One of the reasons I like it is because it's a small family owned business.  I ordered a half turkey sandwich, bowl of soup and soda for a little over $11. Not the most inexpensive meal for what it is, but that's ok since the ingredients are fresh and normally the food is pretty good. However, I ordered a chicken noodle soup and it came out with literally with maybe 5 small noodles. It had definitely 90% broth and when I asked if I could get more noodles, they made me feel like it was a ridiculous request as I could overhear them in the kitchen. I think when I order a chicken noodle soup for a premium price, it should have noodles. The last thing I noticed is a sign by the napkins/flatware. It says they provide a quality napkin so please only take what you use so they can keep the same prices. Why not just serve the food to you with one napkin vs having that sign up? I have not seen that anywhere in a restaurant before. So I guess their goal is to save money on noodles, napkins and use of styrofoam cups.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "26BzcuwVGx3dFYeqY86QHg"
  },
  "ZZ6HhepqNTuV44dY-SCAng": {
    "date": "2/11/2014",
    "text": "Great little breakfast spot right around the corner from home. Delicious baked goods and decent lattes. Their egg dishes are also good. They have 3 or 4 specials of the day posted at the register....and I have never been disappointed. They have a few outside tables, but they are right on the sidewalk and you are looking at the parking lot. No views to speak of. Very large and clean inside and you order at the counter, and they bring it to you.  Ordering 'to go' does take quite awhile if you are ordering anything from the kitchen, but it is easy to grab a bagel/muffin and coffee.  The owners are also very involved in the community, and always sponsor a food drive during the holidays. I recommend that you support this local restaurant!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HL-cdf_goIdOhH0uAOD-5Q"
  },
  "N3zkBIwTpy2nF7AuyTECiw": {
    "date": "3/10/2013",
    "text": "A great place to have a sandwich or breakfast. Portions are large, the ingredients are high quality, and service is fast and friendly.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "DK57YibC5ShBmqQl97CKog"
  },
  "EQlY2ovVsn_Kw26feKkn9A": {
    "date": "11/24/2014",
    "text": "When we walk in to the AZ Bread Company, the employees recognize us and ask us if we're getting our usual. For me, that's the Amanda Burrito: a breakfast burrito with eggs, onions, chorizo, some jalapeno, and cheese. The burrito is served with a side of queso and I consider it liquid heaven. The queso - whether dipped up or spooned on top - is the figurative icing on the cake. I try to get different things but always come back to that burrito.  The staff is so friendly and the owner a very sweet lady. I always feel welcome. It's great to be a regular here.  Also, just as a side note, the passion berry tea (which we drink iced) tastes like waffles with berries on top. Not kidding. It's unsweetened and seriously tastes like dessert. We love it. And we love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Elvom4LP-21FUP9WDAoUiA"
  },
  "JVzN35yf-9u1o4J2MRfesg": {
    "date": "4/3/2016",
    "text": "Great food and friendly service.  My husband and I have eaten here several times and always loved our choices.  Today we had Montoyas Scramble and the Strawberry Blitzes and both were delicious. My Mocha was perfect and a work of art. Plan to come back soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YhAYOXAI34LoxGFIMlrSKA"
  },
  "ZSxUPvs1mSqDkeWrgBixTg": {
    "date": "2/28/2013",
    "text": "A while ago I was in for a lunch salad and I remember that it wasn't very...well, memorable. I drive by this place every day and I've never been enticed to come back and try their breakfast.   Until recently, that is...  Wonderfully hot, healthy and very tasty,--not to mention reasonably priced--breakfast wrap (happily made with my requested egg whites)!  Owing to the fact that I was \"in and out\" in about 8 minutes, AZ Bread Co. is now on my list of places to stop once a week for my \"breakfast out\" treat.   I also appreciated the friendly smiles from all employees!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "gYjP8zOIJaXh9MrhqqzwRg"
  },
  "IeWaROtl8oGBx8IfT34jyA": {
    "date": "1/23/2013",
    "text": "This place has great breakfast, with a menu thats not too big and complicated and some pretty nice creations of their own.  The bread they have is unique for sure, duh, its called a bread company :).    I shall thus point your attention to their omelettes and other creations.which is though not as full as Crackers Cafe down the road, nor overloaded like the good egg or us egg, it does have a certain amount of creativity and uniqueness.  For example, do the az omelette which has a nice creamy hollandise like sauce over the omelette.  Else do the carne adovada, :)  no elaboration needed with a name like carne adovada.  I am gonna go out on a limb here and assume their lunches and breakfast sandwiches are equally good.  I don't know cause I have only been here twice for breakfast and twice I like the casual atmosphere, friendly staff, good breakfast that has not disappointed and overall feel of the place.    Come here and U will like it :) Its not everyday that I find a spot as good as Crackers and Co :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "oBYbYmIPe2ny6W99aSMzlA"
  },
  "YPWUoIoNcWZcQklwtRN2GA": {
    "date": "12/30/2016",
    "text": "Great food and great service! Our new go to breakfast place in Chandler! No complaints! It was nice to see the owner,Carol, in action.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7daayUrQBS24mtcBBKkA5A"
  },
  "c4m5kx1ZpAdzH_vd6M-t3Q": {
    "date": "9/19/2013",
    "text": "Favorite breakfast spot! Fast, friendly and still reasonably priced. I love both breakfast and lunch, The Wrangler or Rancher for breakfast and The Sedona sandwich for lunch.   It's a local spot with the same cast of characters each weekend. The owners sincerely care about your visit, food and beyond the experience to your life in general.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ax3x2-trTyNVkc3XN49F9w"
  },
  "omiLYyAMea_mMCAwOAICkw": {
    "date": "10/30/2016",
    "text": "We came here on a Saturday morning for the first time. The place was clean and had ample seating both indoors and outside. While waiting in line we started a conversation with an older couple who were long time patrons. They forewarned us that the cyclist crowd would arrive soon, and soon they did. We got there perfect time but the wait to order at the counter was a little long for this set up style restaurant. The owner took our order and she was super friendly and kind. The food came out in time and was delicious. My husband had an omelet and I had the chicken fried steak. Everything was decent portions as well. The patio is dog friendly, and inside had a flex table arrangement that accommodates large groups. They have an espresso machine and to die for muffins in the pastry tray as you wait in line. They also have sippy cups with bendable straws for kids drinks, which was a bonus in my book.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1WMkREeVSBvXZ6QON44ucA"
  },
  "-rPmphL-vlJQKvLbdhcD0g": {
    "date": "3/29/2017",
    "text": "I can't comment on this place for breakfast. Many of the positive reviews seem to be about their breakfast. Maybe it is much better than their lunch. That's the only reason they are getting three stars instead of two.  I ate lunch here one day while getting my oil changed across the street. To me, the place seemed like more of an older crowd cafeteria or something very similar. The place is pretty dated and the food was extremely bland. Like something you would get at a retirement home. Also, the space is pretty small with no outdoor seating. I would not come back for lunch. The service was good and the prices were very fair for the portions.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hZ4BMWTEirMxhOQv-tjDEg"
  },
  "_u-Rgaa37GjvpjseGzRqrw": {
    "date": "2/13/2016",
    "text": "I love this place! Best breakfast burro around. It's called the Amanda. What makes it so good is the jalapeno cheese dip that comes with it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NTEZppHLTXMAwyKevZQ2XA",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NTEZppHLTXMAwyKevZQ2XA/o.jpg"
      }
    ],
    "user_id": "4xr47ziKdq28IJm702Om_g"
  },
  "7BZVfCpozPDHeeJ2h9Zpew": {
    "date": "7/30/2015",
    "text": "AZ Bread company served me stale bread that had the consistency of frozen bread that had been reheated.  Atmosphere is cool, restaurant appears to be clean.  My big pet peeve: they don't cook their food fresh.  Why can't you cook chicken to order for salads?  My chicken was dried out and tasteless... If you took a few more minutes and cooked food to order and it improve the experience so much...why do restaurants think they can get away with this?",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FbRFpZPoz0ZnQsrIhc7VHQ"
  },
  "Iwbek4lvCxYzDeMN7uj5ng": {
    "date": "2/21/2017",
    "text": "Great place to grab a quick bite to eat.  I had the Arizona chicken sandwich and I was very impressed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7znOCLWM4zfUDarOmANvxw"
  },
  "cQNoq8RCkwUH-w6ADSHwvg": {
    "date": "9/10/2016",
    "text": "This place is always super good. My wife and I came back today after long hiatus(I no longer work near here) and it was just as good as we remember. Good sandwiches, salads, soups, and their staff is super friendly. *love the challah rolls!*",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "u37uclGUgy2a7NIdvJrkIw"
  },
  "J3kvzmI83JXexpCGoNxkXA": {
    "date": "8/27/2016",
    "text": "Cold, no vibe - it's just \"a place\".  Food was okay, coffee...really?  Just buy Folgers and call it a day.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "blRGmC49-WB5_PQCLwqQXA"
  },
  "ZjCyTQvb6rR4fyY5L16RAg": {
    "date": "7/13/2015",
    "text": "It's been too long since I have updated my review for AZ Bread Company.  This place is fantastic. I have been coming here since I moved to Arizona and it just gets better and better. They have some of the freindliest people working in this restaurant that I have come across. They always say hi, remember you, and are very cheerful.  They food is really great in general from the French Toast to the Egg Salad. I have a fondness for the Green Chili Quiche in particular. It's really good, comes out fast, and unique to their restaurant. They actually are extremely quick to bring out the food even when they appear busy. We always wind up bringing my nieces and nephews here since it's very child friendly. The staff is always happy to see them and take the time to see how they are doing.  This place is a True hidden gem and I for one am glad it's so near my house.  Try : - Green Chile Quiche - Strawberry French Toast - Egg Salad Sandwich",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rhE4gLtM0gb3XLwSz6HPCw"
  },
  "RROxvr8EywVn4-qnH5ndhA": {
    "date": "1/15/2017",
    "text": "Ordered the Scottsdale with potato salad. Both were excellent. Service was quick and everyone was helpful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bdA91ZklSbkJuJn9bomigw"
  },
  "Z9AewIifU_tfgnZFoiqeSw": {
    "date": "6/15/2015",
    "text": "The food here is so consistently good. The neighborhood-feel and welcoming vibe is so appreciated. I love how the owner wanders through the cafe all morning visiting with diners and thanking them for their patronage. We've had a couple different delicious breakfast items over the past few visits namely... the Eggs Benedict Florentine with fresh spinach, perfectly poached eggs, and a creamy Hollandaise that is not too salty or overdone. If you like a little heat, you may want to try the Arizona Omelette with a kick in the creamy sauce. For a sweet treat try the pistachio muffin - green on the inside in a good way! You'll find a crowd here on weekend mornings and a bit of a wait, but it's worth it. Our server did have a teeny-tiny bit of a bad mood on her, and that is a disappointment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2-XLTj0Cfd81_XlmHo02Aw"
  },
  "gezlgq6-lyZ6uOvI-Echiw": {
    "date": "1/27/2015",
    "text": "I have been coming here for years and the place has been here for years so that says something. I love that it is not a chain and the breakfasts are very good, not greasy IHOP food. The owners really care about their customers. Our favorite dishes are the Montoya Skillet, the Peanut Butter Chocolate Pancakes, the waffles with FRESH strawberries. The side of potatoes are amazing! (order two!)  For lunch, I love the veggie wrap. Also, they have frequent diner cards.  I love the patio and the fact that they allow dogs. They even provide water for them which is a very thoughtful touch after a hike.  The two things I would change are definitely the bathrooms and the coffee dispensers. Only one person at a time in the bathroom. We are big hikers and the bike clubs frequent here as well. When a group is coming to breakfast from a long hike or ride, you really need more stalls! So if they would somehow reconfigure the bathrooms that would be great!  My other issue is that the coffee is always cold. Good but cold. We always get there later in the morning so maybe they just need better warmers in the coffee dispensers.  Overall, this is one of my favorite places. It's clean, comfortable, good food with healthier choices and the staff is amazing. It is a something for everyone place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rP8uWN7SWEdPpw443QpaIQ"
  },
  "qH-brEib-MnJYD1A-R6A_g": {
    "date": "8/15/2015",
    "text": "Pros: home cooked food, nice staff, lots of options. Authentic tasting cappuccino. Cons: feel rushed to order every time I'm there, I wish I could sit with a menu first to completely see everything they have to offer.  *Will try again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oTn3-d9ydAfjeDLDS1A7kw"
  },
  "7WBdh71PmxbbBPJIlJjBUg": {
    "date": "9/4/2015",
    "text": "I was in Phoenix for work, not knowing the area I was in search for breakfast place and found AZ Bread Co.  Very nice place, very friendly service, they make you feel at home (even the owner came out to make rounds, greet everyone and had conversations with the regulars).  As I was eating my breakfast, as I saw them bring food for other customers, the food looked so good I wish I had ordered that ... and that ... and that.   I wish I lived here, if I did I would be here everyday. Its hard to find such nice places these days.  On a side note, amazing choice of colors, very nice and clean place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C5zveTz_xK46QF88a1uTbg"
  },
  "gSp8MCIjQKG6VSWtcrTG0Q": {
    "date": "4/10/2016",
    "text": "Our first time here. We got the amanda burro (with turkey sausage instead of chorizo) and the pb chocolate pancakes. Both were perfect! We had the potatoes, too. Delicious!!  We'll definitely be back and are looking forward to trying some lunch items.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o44rYplgwPgsHGMiEhsSyw"
  },
  "suUCJ665YlHvjH7VZK4IPw": {
    "date": "5/29/2012",
    "text": "Been here twice now once for lunch and the other for breakfast. I don't remember exactly what I had for lunch but I remember it was good and I was happy enough to try again. The one thing I remember from the lunch was that the staff was really friendly and super helpful. This continued when I went back a few months later for breakfast.  I got the french toast on challah bread with strawberries. I also got an egg and bacon on the side for a couple buck extra. The food was great and really stands out compared to the lunch which I basically forgot. i didn't want to eat all of the french toast but it was so good I couldn't stop.  I can't say lunch here is thrilling but breakfast is very good, decently priced and the staff is very friendly and helpful. If you are looking for something simple but good for breakfast go here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1jP20TYxHb9jHRhG3NRjLA",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Yummy challa French toast with strawberries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1jP20TYxHb9jHRhG3NRjLA/o.jpg"
      }
    ],
    "user_id": "wAqiSluTMo_2T-dTN4Bozg"
  },
  "xxGh0PpwS6rJo8jM-NWmxA": {
    "date": "3/15/2015",
    "text": "Ate here today for the first time in over a year. I used to come here often but got sick of not being able to find a seat even though most of the tables  were emtpy but reserved.  Today I ordered my usual , the Montoya Skillet. It was as delicious as I remember it. I just wish it came with a tortilla on the side. My husband ordered his favorite, the Amanda burrito and enjoyed it as well. We didn't see any reserved tables this time and the service was quite good. We ordered muffins at the end of our meal. I didn't care for them warm but my husband may have requested them that way.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YrmdXrtMDK2Y9DDtgOpYhw"
  },
  "bW-QBF-ohuhZ1zp43xHBAg": {
    "date": "8/7/2016",
    "text": "Delicious food, really quick too. Everyone is really friendly! The Sedona panini is fantastic! Blitzes are also excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wZkg5jRVFLTMv6JYEYfMVw"
  },
  "k-Pkd6y6Zt8yvN2MMddlLQ": {
    "date": "6/13/2012",
    "text": "Super quick service when I stopped by for lunch to-go. Good salad with LOTS of chicken!  Only complaint was the measly amount of bread that comes with a salad....suggestion, buy a roll.  Thanks Carol!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "yis0tDX83YnFLzUbKZ_KFg"
  },
  "ROj2jj0m8OFqezhp0i4lIQ": {
    "date": "12/18/2014",
    "text": "This review is only about their treats of sweet deliciousness. I wanted to do something nice for my work team and thought I would bring in scones and muffins for them.   I was greeted by a sweet guy who was friendly and helpful with my questions. (I had many, I'm sure he was annoyed, but never showed it) The prices are fair for what you get. I have made a mission of mine to go back and have lunch there at some point because the menu looked pretty good.    Everyone at work raved about how good these treats were. I raspberry scone was by favorite. It wasn't too sweet where you'd get a bunch of cavities from eating it, but sweet enough to enjoy with some coffee. You must try their pastries!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xVdchFi3vgmPYxkiXYHmZw"
  },
  "V__0j2GfAegFo6ocQCkmJA": {
    "date": "7/3/2016",
    "text": "This is a great local place and the food is very good and healthy. I would recommend it for sure. Carol the owner is awesome and the staff has the best customer service around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PWWuvwKa3sUnBIjTar4dEw"
  },
  "y-ZYql2-HvbRtkvsp1wphw": {
    "date": "12/22/2015",
    "text": "I just came from this place. I have been going here for the past year and a half. I have always received good service and good food here. Now mind you this review isn't about the food as it is excellent. I had a really bad experience just now at 9:30 am. I stopped in to get a vegetable Frittata for breakfast. I walked in and the cashier named, \"KATE\" didn't greet me first of all and acted as if I was an intrusion for her (to do her job). She was very curt and cold to me and wouldn't even let me finish a sentence. She continued to act very disinterested in my order. Now mind you I didn't think about her attitude until  after I made my order and paid for it with my credit card, and sat down. I happened to glance back over and saw her flirting with an older white dude. It was obvious that she has an issue with people of color and didn't want to take more order in the first place. As soon as the white dude walked up. She was in his face, going the extra mile with customer service and standing there continuing to flirt and talk. it's obvious that Kate is more interested in using her job as a dating service and not actual work. My other was ready and another older lady came over to give me my order and she was wonderful as always and I asked for the cashier's name. She gave it to me and that is why I'm writing here and giving such a bad review. Get rid of Kate. She will continue to earn you bad reviews for your wonderful restaurant. Not sure if I will return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3FKKzugEwCM1gGMjR_AXTg"
  },
  "t1yQTiWqa4CTn6Hq_y1Pxw": {
    "date": "7/12/2013",
    "text": "When you're in a bread company, you expect the panini (sandwiches) to be awesome. Mine was barely toasted, not cripsy. My friend's sandwich was also limp, and in addition, it was too salty.  The service was good and quick. The whole place was spotlessly clean. Their record from the county health dept is excellent.  The side salads look/taste like what you can buy at Fry's deli. Yawn.... I would compare this to a lunch at Subway. Not bad, but not something to go out of your way for, either.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XjXTWkTDBFrKPoWYi5LgRA"
  },
  "8l33GYAwxTrOTgGTbcupXw": {
    "date": "4/27/2015",
    "text": "The Amanda Burrito is soo good with sauce on the side is the best. Mango smoothie was great too. Will definitely come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sc0imX9h_S1PkVYjKOo60Q"
  },
  "073T5yIYSbQJZx2ghltlcQ": {
    "date": "9/29/2008",
    "text": "I just happen to drive by, I would have never know about it otherwise.  It's kind of in a funny spot (business/commercial area)  I had planned on getting a sandwich until I walked in and saw the special \"Green Chile and Corn Quiche with zucchini and tomato\" YUM!!!  I had to get it! To my surprise it was a crustless quiche so I no longer felt guilty for eating it and let me tell you it was Absolutely Delicious!! (see pics)  Even though it was technically a breakfast item The girl told me the quiche could be served all day unlike the rest of the breakfast menu which ends at 11am, and Lunch begins at 10:30.  I would definitely vote for that to go on the permanent menu.  I also ended up getting a Tuna to Go. Simple Tuna here, just mayo salt and pepper, then add toppings you like. Comes with a side, I chose the pasta salad (see pics)  It was a tad fishy but was still really good flavor wise and the soft Challah roll was a great compliment. I also like the pasta salad.  A great menu of breakfast and lunch items, seemed more freshly made than most counter establishments. I will definitely be back to this privately owned single location in the valley!  Check it out you wont be disappointed!! Oh Ya~ They have Free Wi-Fi!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "eHz43PW5116oJopcXkpsZw",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Tuna on Challa with pasta salad To Go",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eHz43PW5116oJopcXkpsZw/o.jpg"
      },
      {
        "img_id": "nTS5smRSnkApdxpEucAAhQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Green Chili and Corn Crustless Quiche",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nTS5smRSnkApdxpEucAAhQ/o.jpg"
      }
    ],
    "user_id": "pQdIIsbV5dGOVz_kWfMRTw"
  },
  "12XD-6fvCJxSUWY6C5NZlg": {
    "date": "7/6/2014",
    "text": "My husband and I have been here many times now for breakfast. The queso is the best, tasty bacon and potatoes. We enjoy the outdoor seating when it's not too hot out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DTWt1D5VpnOldjbVl71wPA"
  },
  "5VhEq3VNa2rjx8esgYjQRQ": {
    "date": "11/5/2008",
    "text": "AZ Bread Company is one of my favorite lunch spots, and not just because it is a mile away from my office.  They have amazing, fresh bread, delicious sides and high quality food.  I normally always get the egg salad on Challah roll, but I have also had the egg salad stuffed tomato in the past. PS, they have amazing egg salad!!  One of my favorite things about this place is the patio seating, especially since it is now fall (I can say that since we have two days in a row at 75 degrees for the high). Also, the interior is fun and brightly colored with a ton of windows making it full of natural light.  The staff is always really friendly and you can often see the owner popping around making sure everyone is happy. I always feel... happy.. when I am here  :)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "nRBycbiy0YXv6DgN9E0UCg",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nRBycbiy0YXv6DgN9E0UCg/o.jpg"
      }
    ],
    "user_id": "rA97zeqOrUYuEM69n0Xn4w"
  },
  "uUVnjySF8WZywDtYGzIvlg": {
    "date": "9/8/2013",
    "text": "I absolutely love this place. I wish I could give it 5 stars but I haven't tried everything on the menu. I come here every morning literally for bagels or their challah bread, so damn good! And their service is very fast and the staff is overly friendly. I love it. It's also very clean in there. However, their sandwiches (which I didn't try) were pretty expensive but I'm pretty sure it's worth it. I will def try in the near future.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 6
    },
    "photos": [],
    "user_id": "n9RM5dQs7DEbUNZR2AAPVw"
  },
  "DI2mstIEE3EhtJEXQlj9Ww": {
    "date": "9/20/2014",
    "text": "I go to AZ Bread Company almost weekly with my mom for brunch. The food and service are always great. We love the family atmosphere-- all of the employees know all of the regulars, and it's really friendly. It's just an all-around great breakfast and lunch place. I also really like that they have a punch card where you can earn a free meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_k3o_AKj-S9JD0q6AhSXdw"
  },
  "coxMAs6pY1-G1mNnK3hOfw": {
    "date": "10/12/2014",
    "text": "This restaurant is a long time favorite of mine. I'm a little embarrassed that I always get the exact same thing. But I have to say I often crave it. The veggie frittata with feta, home fries, and delicious toast. It's a real treat. The owner is so lovely and always really kind to us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UK2DsID5q3MCqYX23S6xXw"
  },
  "wrbaNI0UA-jottR2IM9ICg": {
    "date": "10/30/2012",
    "text": "we've been going to AZ Bread Co since they opened, and we love the owner Carol. Hubby and I used to take a long walk on Saturday morning and then go split a carne adovada breakfast. Yum!    Most times lunches are great here too -- great soups, good sandwiches.   on occasion, service is a bit slow, and no recompense made for \"lost\" meals, but this has only happened a few times over the many years we've been there.   note: AZBC used to have wi-fi and many regulars went there to work over lunch (like me today).....alas, they got rid of it due to service issues with their provider and currently no other utility serves the area.   if you find yourself on this side of town, stop by for some excellent breakfasts, great bread and good lunches. patio in nice weather is lovely.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xh22UvQTvQOyuzL6Z7tXDg"
  },
  "p6TulMAV2082sdUiAHYpqg": {
    "date": "8/13/2011",
    "text": "Awful.  When my lady and I feel like breakfast, we usually just go to Denny's.  I know the food is sub-par but we're attached to the chain  because each of us hung out there frequently, with our friends, when we were younger.  This morning, I wanted a really good breakfast.  I 'yelped' and this place came up.  I don't know where the rest of the reviewers have been eating but this place is terrible.  The staff isn't friendly.  Just a crew of apathetic 20-somethings.  The guy at the register seemed annoyed that I had to look at the menu before I ordered.  A girl filling up those little jam baskets took the one from our table and replaced it without so much as an 'excuse me' or 'hello'.  Not even eye contact or a smile.  I ordered pancakes.  It's all I wanted and I wanted good ones, badly.  They were the worst pancakes I've ever had in my life.  I'm not saying that with exaggeration.  The worst I've ever had.  Rubbery, tough and devoid of flavor.  Like eating a lid to a tupperware container.    I eat everything I pay for, bad or not.  I managed to choke down only one of the three.  It took forever to do so because cutting through them was such a chore.  Words just can't describe how bad these were.  My lady got Challah French Toast with a pecan praline topping and it was acceptable.  Coffee was pretty good, honestly.  That's all the good I have to say about this place.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "RSpWZSdBox2Sc71Mmq_MKA"
  },
  "bdIy3hoK53aKmQ7-qeQ1fQ": {
    "date": "5/17/2013",
    "text": "Love this place.  Used to come for lunch, but I've found the quality of the sandwiches have gone downhill a bit (was VERY disappointed the last few times I ordered the pastrami).   That said, I DO love to come for breakfast.  The AZ Bread Co omelet is my favorite (::heart:: the queso) and the home fries are awesome.  Service is usually pretty good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jyHwSRAW_xq3k-xJqiv0Ag"
  },
  "155anplHxUNi1f2ekFZybg": {
    "date": "4/1/2014",
    "text": "AZ Bread Company is good.  Its not bad, and its not GREAT... I enjoy it in the morning for a bagel.  Some co-workers of mine have gotten some salads from them.  I have also had a wrap.  Its not somewhere I have to go, but it is somewhere I enjoy near my job :) Check it out if youre in the area, maybe I just havent had the right menu item",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5PmBcpjzJWR60KXAUhjZsg"
  },
  "SR9WudoOzgT7AZiASLtclA": {
    "date": "12/17/2013",
    "text": "I was in the area for a work meeting and a coworker recommended this place. I had the El Pavo signature sandwich with a side of tortilla chips and salsa and a regular drink. It was a turkey sandwich with bacon and avocado on a specialty roll. The total came out to a little over $10. The sandwich was good and I suppose $10 is a decent price point for it, I just don't think I'd be a regular here if I wasn't able to expense it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6zSL1ujPqMiXL10ena2G3Q"
  },
  "1mbrUcYTBYyixo3TNrE59Q": {
    "date": "4/3/2014",
    "text": "Good place to study, free wifi and spacious. Sandwiches and soups are pretty good. Employees are fun and friendly!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "k9kH0iUtzJv3R-lFJeHCjQ"
  },
  "JSjicHcBQi6SwrFmaoHkfQ": {
    "date": "11/11/2014",
    "text": "Love this place! Every time we come in the owners are so kind and welcoming, not to mention the food is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JnQouUEo3klMuXo-luWU5w"
  },
  "OxRWT-0XHAQrAGW8Wq_QJw": {
    "date": "10/17/2014",
    "text": "We LOVE THIS PLACE!!!!!  Carol had made a lovely little joint feel cozy and like a family. You can go study. Or just run in on your lunch!! It's just not open long enough!  Lol",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z0z-pn7-0tUv6tWdN8BL9A"
  },
  "BH-u85MMSkwFIaPhF7_CTQ": {
    "date": "3/2/2014",
    "text": "My Girlfriends and I met for Breakfast.  The  restaurant was clean and it appeared to be busy. The food was delicious and the service was great.  I would highly recommend to friends and family.  Thanks Carol!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WVexGjZHmo030ZS8pjH2RA"
  },
  "riUA0Rz27XONsJbZe74REA": {
    "date": "6/19/2011",
    "text": "First of all, if there is any indication that this place might be busy, turn around and find a new place to eat. It's not unusual for the wait for your food to be up to 2hrs!  We ordered a salad and a sandwich to go and waited over an hour for it. The salad came out within 15 minutes, but the sandwich took so long that by the time I was ready to eat my salad it was a wilted, slimy mess. The owner was not helpful at all and we asked her to check on our ticket she just said, \"Yeah, it's up there.\"   This place has a small kitchen and when there is a large crowd it is just possible or them to keep up with the demand.   Crappy service, high prices, and a flaw in organization has lost them a customer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "VF9AT21mJNGGC6xAoq-N5Q"
  },
  "EZmM5P_QnSDw3jMyZlGH4A": {
    "date": "9/24/2013",
    "text": "Great food, super friendly staff (when's the last time your cashier honestly seemed to ENJOY her job?) and it's not a chain. It was my family's first time there, and the owner even noticed that and stopped by our table immediately to check in and introduce herself. We'll definitely be back! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DKhTztMYqvP77jX7ua3A8Q"
  },
  "pMkTBzsJASZaUJhgG2vY1A": {
    "date": "12/4/2016",
    "text": "The food is delicious and affordable and the portions are huge! Staff is very friendly and accommodating. What more could you want?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KaYukl9swlpo71HupJrUWw"
  },
  "4yggPcvlIym3XUsuawuAhQ": {
    "date": "5/21/2017",
    "text": "Awesome food with a friendly staff. I love the carne adovada - so good I pretty much just get this every time I'm there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pcKWD61e2BqqubuNxZcxcQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Carne Adovada",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pcKWD61e2BqqubuNxZcxcQ/o.jpg"
      }
    ],
    "user_id": "Y-Iq18dTYDPvjzkn5VAIQA"
  },
  "cvVf5K7VI2eko1DnXNdRwg": {
    "date": "8/11/2015",
    "text": "During my yearly pilgrimage to Arizona, I usually try to make it a point to try something new while I'm out there. This time, AZ Bread Company caught my eye, thanks to Yelp, boasting fresh ingredients and friendly service. Did they meet my exorbitant expectations?  For the most part, yeah, they did. The environment was welcoming and the people seemed friendly enough. I kept it simple with a half BLTA and broccoli cheese soup, while the wife took a grilled sandwich of some sort (I sadly can't remember which sandwich it was, my bad). I remember the sandwich having a fresh, clean taste, with the bacon being crispy and flavorful and the avocado and sprouts (which I added, free of additional charge) really gave it that extra taste dimension that made it stand out. My only complaint regarding the freshly baked sourdough bread that I had on my sandwich wasn't toasted. I assumed that it would be at least a little toasty, but alas, my assumption, my fault.   The soup on the other hand was a little lackluster. Although it tasted really good, it came to the table on the \"pleasantly warm\" side as opposed to a more appropriate \"hot and satisfying\" temperature.   Overall, AZ Bread Co. is a nice little place to grab a sandwich and be on your way. It seems that they pride themselves on fresh ingredients and house baked bread. Their employees are cheerful and helpful, but just a few minor adjustments are needed to get this place that elusive fifth star in my book.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "aUzNUbuo-ltrn9-GAfLbEQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. BLT on Sourdough with broccoli cheese soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aUzNUbuo-ltrn9-GAfLbEQ/o.jpg"
      }
    ],
    "user_id": "QNb1ffvoWAJIdF0hF5B5DA"
  },
  "wfrokJVXtEJsY8JdInTGqw": {
    "date": "11/30/2016",
    "text": "I eat here frequently for lunch.  Close to work, great soups, vegetarian options, and good breakfast too.  Service is fast so you can order and run or eat in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LrBIu9YXxXBZ1AXwKW1tew",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Verde veggie wrap.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LrBIu9YXxXBZ1AXwKW1tew/o.jpg"
      }
    ],
    "user_id": "jjyGFopTxx9oWIs62hWR8A"
  },
  "N3VW9EdTtHFOMYe_235Cfg": {
    "date": "12/9/2017",
    "text": "Great local spot.  Food is great and fhs service is spot on.  I had the wrangler with turkey sausage.  Order a side of queso with it to dip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hb85F7wgB-ibS55BVXBInw"
  },
  "mnTfdr78JEQC45SUzmUP3w": {
    "date": "9/7/2016",
    "text": "I've never had anything I didn't like here. Awesome breakfast wraps! Lunch is OK. I do think it's a bit overpriced for what you get.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oHewXSQBveJFVgQzN302AA"
  },
  "uKwAc_Zioz0tRRr36gqUxA": {
    "date": "8/7/2016",
    "text": "This restaurant is a great place for a relaxing brunch with flavorful food and a nice ambiance. The friendliness of the staff and the open glass windows certainly contributed to my five-star rating. The Carne Adovada is killer, particularly due to the jalapeno queso topping; the strawberry French toast is also a good griddle order but nothing out-of-the-ordinary.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dlwVjRfbTP9IrZvkJuKyUg",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dlwVjRfbTP9IrZvkJuKyUg/o.jpg"
      }
    ],
    "user_id": "-4pGdGL_M0zGctI5jeqjAQ"
  },
  "6el-vVioyZSY6QMwvEaQmQ": {
    "date": "8/12/2016",
    "text": "Great sandwich shop in the Tempe/Ahwatukee area. One of the better tuna sandwiches I have had in a while, not too much mayonnaise and not sweet. Just a great classic sandwich the way it should be.  Simple and Good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XHZ-VuOVfWyeVfhQ0wEcqg"
  },
  "J7JjnF-2gBS3GyYZJ3a9uA": {
    "date": "7/27/2017",
    "text": "Breakfast and Lunch place.  Food smelled good.   I was there for a bagel.  I got the Everything Bagel.  Bagel was good and toasty, they put a lot of cream cheese on the bagel.  It;s just the everything bagel had no seasoning, no onion, no garlic, no poppy seeds, it looked like there were some things on it that fell off.  It really was a plain bagel with an attempt at seasoning.  Go there for breakfast, not for the bagels.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KFgHqDWKLigqOOdQ1o3J0A"
  },
  "KGiZ96jy9KZ17ffLXWZMCg": {
    "date": "7/19/2017",
    "text": "It was ok. Nothing special. I had the chicken omelette and my son had breakfast burrito.  Very mediocre. Probably would not return. Lots of other places to try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jAVtSgE5L-Dt6_I5FIiVGA"
  },
  "iQ1Jrj4xE5ry7sikTKxQWw": {
    "date": "1/2/2015",
    "text": "What great service! If you've checked some of the other reviews on here, then you may notice that this is something that echoes throughout the whole establishment. That, and the quality of the food, stand out particularly here. I ordered some oatmeal-expecting nothing really special-and what I received was way, way above average: candied walnuts, brown sugar, and perfectly cooked oats with an image fit for a commercial. If they take such time with the little things here, than I'm pretty sure you can imagine how the rest of the food is. I recommend coming for lunch also. You can't go wrong either way! :)  Update:   I came back and tried a few more things after my first visit. Breakfast is where its at! I had the Montoya Skillet, and it was delightful. Check the picture out. That is jalapeno queso on top. Once the fork pierces through the egg, one's tastebuds are treated to chorizo, green chile, and onions on a bed of breakfast potatoes. Hungry yet? :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wDUhf4R7ugq9A7ndg4Fx-A",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. The Montoya Skillet. Jalapeño queso on top and filled with chorizo, green chilies, and onions on top of breakfast potatoes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wDUhf4R7ugq9A7ndg4Fx-A/o.jpg"
      }
    ],
    "user_id": "YPUD0e4ZVCxf6mp98h3hWA"
  },
  "BcXNxRtbWw4gOlCwq0TnSA": {
    "date": "8/16/2014",
    "text": "Went for brunch and was delighted with the food.  The only downside was the guy groaning in the locked bathroom for 45 minutes (literally, I timed it). Turns out it was an employee, so thankfully he was in there while our food was being prepared. I can only assume he was hungover as the restroom did not suffer from a lingering \"odor\", but that was definitely not a good image for this establishment.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6_1USU2K-88wNgGyksi4xA"
  },
  "cHm6SYCgHL27q6kvzAbkzQ": {
    "date": "12/5/2015",
    "text": "This place seems like it would be phenomenal for breakfast, but the lunch we tried was good, nonetheless.  My hubby ordered the Pavo sandwich with a side of potato salad.  He is a potato salad connoisseur, so him saying that it was amazing at AZ Bread Co is a big deal.  I had a half chicken sandwich with green chilies. The chicken was incredibly thick and juicy.  I had the cheesy tortilla soup with it.  It was a little too fake nacho cheese flavored for me.  I would have liked it more if it had tasted more like natural and not processed cheese.  I would most definitely try this place for breakfast because the burritos look delicious in pictures.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "siVtjO8xrSxbrK-zqXCGew"
  },
  "9mV3qIdjW0jgEeVM3nxVZw": {
    "date": "7/17/2014",
    "text": "I was a little skeptical about eating here because of the location.  The area is a little industrial and barren for my taste.  However, I am glad I stopped in. You place your order at the front and sit down and wait for your food to come out.  There are workers that come around and ask if you need anything, much like a restaurant where you have to leave tips for the servers...but here you are not expected to!  I love that.  I hate dining out because it is so expensive to begin with and then you have to leave a tip on top of that.    Anyway,  I had the pecan waffles for breakfast, AMAZING!! It was very sweet though so you must have a sweet tooth.  The homemade mango smoothie was awesome as well.   A few cons... This place needs more bathrooms.  Only one stall for each gender.  My husband waited our entire stay because one guy was hogging up the bathroom with probably the largest load ever.  My husband could not wait any longer and had to sneak into the woman's bathroom while I stood guard, haha. Also, they use Styrofoam cups.  I shed a tear for the environment that day ;(",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NsYNI_NqDeERp8sR4TMilw"
  },
  "d_EHXUBI70Cfqe_AxvqTTQ": {
    "date": "1/18/2015",
    "text": "Great place for breakfast, friendly atmosphere, delicious food and great prices.   Ownership is there most the time to greet you and engage in conversation, the staff is courteous and fast.  A little local gem.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x10J6_49PK5fBewaCsLhuA",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Carne adobada breakfast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/x10J6_49PK5fBewaCsLhuA/o.jpg"
      },
      {
        "img_id": "WVJtPjesmUknRxI1tRXoKw",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Great place for breakfast!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WVJtPjesmUknRxI1tRXoKw/o.jpg"
      }
    ],
    "user_id": "dtIJc0ad9HFjZFiKDxu2UQ"
  },
  "vm4Sif4kN0Lx8ANOb3J-7w": {
    "date": "3/31/2016",
    "text": "Such a cute place! The employees are kind and friendly and the food is scrumptious! My daughter and I split the soup and salad lunch special and it was the best chicken caesar I have ever tasted. #cleanplateclub The chicken noodle soup was savory. Tastes homemade, but better!! Slurrrp!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UtVMz1X_6yqhswO009zyZQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UtVMz1X_6yqhswO009zyZQ/o.jpg"
      }
    ],
    "user_id": "k4_9Eb3upQbvyKA3ZGX6ZA"
  },
  "2Nic83KgSdB9nlowbyJ2qA": {
    "date": "4/25/2014",
    "text": "Stopped in for a weekend breakfast.  The food was good and served quickly.  There seems to be some sort of weird local vibe going here.  People were filling up cups they brought from home at the soda fountain.  I found that strange.  Whatever.    It is very casual.  You order at the counter and they'll bring it out to you.  This would be a good spot to go for breakfast if you have a few brats to take along.  Also saw some people on the patio with their dogs.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sOudRDE_R3VYni0rEYFkSA"
  },
  "R5QRuvG3Z_9-rU_9njk6nA": {
    "date": "2/5/2017",
    "text": "This place has THE best breakfast in town. I wish they served breakfast all day. Love their eggs, French toast and just everything!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLAJZCXS1CEjBOl9aEQENA"
  },
  "L1J8noE_6yGTYp1ibukNUg": {
    "date": "8/9/2015",
    "text": "Planned to go someplace else but they were too crowded, so I came here with two friends. AZ Bread Co had been a favorite Place for Sunday Brunch for years! The food, as always, was very good. Service was fast, too. Deducted one star because the cashier was rude - refused to honor the Yelp Check-in offer for a free coffee! He said it wasn't for this restaurant, but for someplace in Scottsdale with a similar name. This, despite my showing him the Yelp screen that showed me checked in HERE.  anyway, the food came fast and was good, as usual.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "g7cGZafyd-njNOTMsZGAsQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. AZ Bread Company Omelette - very tasty with the Jalapeño sauce on top!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g7cGZafyd-njNOTMsZGAsQ/o.jpg"
      }
    ],
    "user_id": "e0pVHbAZE3B_iwRenLfImA"
  },
  "NLYqc7BorvF4Bony9JYlOw": {
    "date": "2/1/2018",
    "text": "Stopped by due to proximity of where I was going, and so glad I did!  The food was great, tremendous portions, very fresh and flavorful.  The place was clean and bright, and you can tell they have a regulars in the restaurant.  The server was very helpful and went over the menu and let me know what their popular items were.  Overall a great brunch place at a very reasonable price too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0CtgiVRycAI3HTOfK79bEQ"
  },
  "NeyuStEgqBHdYXWzI9jr6w": {
    "date": "8/6/2010",
    "text": "A new favorite, thanks to fellow yelpers!  Generous portions and good coffee, though a tad on the pricier side.  Awesome early morning date, though!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F9XBQX5B_Pq14xyfl_foBQ"
  },
  "dGbPBM-pbhTk5x-GziwvXw": {
    "date": "5/19/2007",
    "text": "The Strawberry, AZ waffles are a favorite, and can be protein-enhanced by making it a \"combo\" with an egg and bacon, ham, or sausage.  Bright colors and free wifi make this a cheery place to visit.  Takeout, or counter service delivered to your table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gbgO-yfMpOtqJu2U1mFMsA"
  },
  "KoVPed-FQOOmGQVUprcA3g": {
    "date": "3/13/2009",
    "text": "This place is fantastic. Though we've only been there for B'fast, we've had no complaints. Carol the owner, when she's there, which is often, takes the time to check in with everyone to make sure their experience and food is perfect.  When we first discovered this place we used to go every weekend. As our schedules changed we don't do that anymore.. ;-(.  The food is unique and flavorful. The coffee is great. Baked goods are fresh.  When she first opened, Carol was open to suggestions and feedback regarding the drink station area. This is the type of place where you place your order, gather your cup from the order-taker and get your own flatware and take a seat. At first that \"station\" was a bit unorganized but with customer feedback became very efficient. Carol would even Thank whomever provided a specific idea if she used it. They have free wi-fi which is great if you want to have a leisurely b'fast or lunch and enjoy yourself for a while. We even made a menu suggestion she added! Thumbs up all around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "iNT2aMMZF_tjrt9yDxINSg"
  },
  "3sIsMnRnwfMJujYaFIo6Pw": {
    "date": "7/21/2010",
    "text": "I like this place more and more every time I go there. The lady that must be the owner is always so friendly and spunky. The food is awesome and we have never had to wait more than a few minutes for it. I've only ever had lunch there, but you can't go wrong with any of the sandwiches or salads.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qWIYbwO5mxyr7lHa810hFA"
  },
  "n6hHZ_lOY9wSZIsVHQXFDQ": {
    "date": "9/30/2012",
    "text": "Great food, quiet outside. Gluten free options!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC-BbCjtBuS0HxxTQeFGpg"
  },
  "xf1QPYpxcWNtzytbeLoHOQ": {
    "date": "8/19/2012",
    "text": "Let me tell you that the food is great and if the owner can remember your name that is even better. but can some one tell me why is it when I go in there they try to make me feel like I do not know what they are talking about. I order the same breakfast sandwich I have been ordering for the last 5 years, that I have been going. Classic Breakfast Sandwich - this how I order it, 3 eggs, turkey sausage, American cheese on a spinach tortilla. now I understand they charge me a $1.25 for the third egg. so her is my problem, for the last year or better yet the last 6 month they do not get the price right. one day it is $5.49 the next time it is $6.49, well today 08/16/2012 the owner charges me $7.49, why is it they can not get the price right? then when I say something they want to get an attitude when I say something about the price? I not rich, I work hard for my money, but there is not one reason at all a customer should ever feel like they are in the wrong. correct the matter and move froward. my point is that you should not be treat this way no matter what, and I understand that they need to make there money, but how many other people are they doing this too? I know my little $6.00 bucks does not mean anything to them, but it does to me. like I said I have been going there for 5 years because the food is great, but do not keep take my money and act like I am the one in the wrong when I question the price, when I know what the price is, because this all I ever get from there....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PtnbcDIr8csUnUzmxXppZw"
  },
  "vqViE4mLRJuKwpjrfmoMCw": {
    "date": "8/5/2009",
    "text": "Ok, this is my first yelp review, so I hope I do this right.   I am new to Phoenix (4 months) and have had some of the most wonderful dining experiences. As an east coast city girl I know great food and the valley of sun has great options.   I have visited AZ bread company for lunch more than 5 times, it's right near my office and the salads are really great. I've thought it was a bit overpriced, but not grossly so.   This morning I stopped by for my first breakfast experience. I asked for a bagel with egg and cheese and brown mustard (sold other places for $3-3.50. What I was told is that I would be charged for a breakfast sandwich with no meat. I assumed this was some kind of deduction from the price of the full sandwich. With a coffee my bill was $7.11 after tax. When I asked why it was so expensive I was pretty much given a \"sorry.\" On their menu a bagel is $.99, an egg is $.95 and I can't imagine cheese can be more than $1. I should have been charged $3 not $5. I mentioned this to the cashier with no luck. What I was handed was a bagel with American cheese (YUCK) and an egg and honey mustard (the wrong mustard). I should have been asked what kind of cheese I wanted.   In this economy gouging a new customer and then handing them the wrong food just doesn't fly. Sorry AZ, I won't be back. Kind of a shame...loved those salads.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "unLCymmp2cQPK79KVfpxJw"
  },
  "OsQyQMfKYpz6zR4Bm4CPoA": {
    "date": "1/23/2012",
    "text": "Thanks to yelp, we ended up choosing this place for brunch. We really like the breakfast sandwich. The sesame bagel was very fresh and the chorizo was really good. You order and then seat yourself wherever you like but there are servers who bring your food. They have plenty of seating indoors and also outdoor seating. They were very friendly and asked us how everything was. Would recommend this place for breakfast, brunch, or lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8eK7PlT3MAun8t0ZJRBCXg"
  },
  "ujciSqy-YK5g17g1xEEeRw": {
    "date": "5/17/2010",
    "text": "We saw the great reviews so figured we'd check it out.  It's an understated place that feels like an einstein's bagel location, not necessarily a bad thing as we go there too.  Ordered a couple of eggs with pork sausage, and 9 grain toast.  The sausage is very tasty.  We also had their green chili corn quiche with pepperjack cheese.  Very good.  The strawberry waffles were pretty good but not great.  Not trying to be too critical but I eat breakfast at a lot of great places and these are good but in line with what many good places will offer.  On the other hand, there are some places that have incredible waffles and french toast, not necessarily in AZ.  Either way, the staff was very good, food came relatively fast, and I would probably go back for a bite.  One little beef is that they should use butter or oil when cooking their eggs.  They use what I like to call fake butter or margarin.  You can always smell it when it's used in cooking eggs.  I know it's cheaper and lasts forever but frankly the other alternatives are just better.  Go check it out and make your own opinions known.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "C4OkiPljZ3z2XUa7onmihQ"
  },
  "YcMuFLgF09ys01dhQrfXSQ": {
    "date": "2/23/2010",
    "text": "Food is great, service is great.  Met the owner awhile back and she's real friendly.  My office used to be down the street but unfortunately we moved to Chandler, so I don't get to eat here as much as I used to... I've had almost everything on the menu for breakfast and always satisfied.  Keep up the good work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "VIfu9Kd4f-5bVLHciXbo_g"
  },
  "VIQr2v1OisyLsygTlOIGUw": {
    "date": "7/25/2011",
    "text": "We have enjoyed everything we order here.  It doesn't have the best location so hopefully good reviews will having people looking for it.  The people are really friendly and there are some great alternatives to the usual lunch places.  Definitely check out the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLNiT2hsm8-I9JT5-NqgLg"
  },
  "Q9-vpVd7EcUVobLllclCWg": {
    "date": "2/3/2010",
    "text": "I love this place! The food is great, and the service is wonderful! I've had both the breakfast and the lunch and have always had a great experience.  I am just amazed with how friendly and helpful all the employees are, even the owner stopped by our table today to ask how everything was, amazing! Such nice people, and good food, I really love coming here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8lSyuE8UUP7IymowMwevsg"
  },
  "DuPnqhCWW8FXUrP2rkeJ4w": {
    "date": "7/26/2013",
    "text": "This restaurant advertises that it allows dogs.  I went there to confirm this and was told that they are allowed  to with you when you sit outside.  I went to the restaurant with my dog and we sat outside.  I ordered a bagel with cream cheese and a cup of hot tea and paid for my order.  I waited outside by the table.  The waiter brought the bagel but no tea.  I didn't want to get my dog and my stuff and go back into the  restaurant while I was eating so I waited until I was finished.  I went back and told my waitress that I believed I paid for the hot tea and never received it.  She said I did pay for it.  The waiter told me I needed to limit my time in the restaurant with my dog.  The owner came and asked if she could take my dog outside. I asked why they say they allow dogs.  She said that I have to bring someone else with me and they can stay outside with the dog while I order my food. First of all, I would not have had to come back into the restaurant if they had gotten my order correct and given me what I paid for.  Second, my dog is a puppy that I am trying to socialize and get used to people.  She does not bother anyone.  I left without my tea.  I believe that dogs are allowed outside ALLrestaurants.  This restaurant is nothing special.  I will never return.  The customer service is awful.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ziGNe8HDWb1Hx_-ay9oHw"
  },
  "utH2JzPvJu3EVOs4Tbxiog": {
    "date": "6/16/2010",
    "text": "Was in Tempe for trade show for work. Great place for quick breakfast with no wait. I had omletes and the French toast which was very good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "QaD5a31uPoQxeKfzpaLjcA"
  },
  "EgdsHwCgg23FvRHYzt7k_w": {
    "date": "1/12/2011",
    "text": "simply freaking delicious. yup, thats the right way to describe it. i just finished the most fantastical sammich ever: The Carne Adovado. oh yes, this this is tastiness sitting on a delightfully sweet french bread roll. the carnitas meat is seasoned to perfection. its juicy, lightly spicy and just coats your mouth with tasty goodness. that sounded wrong but i dont care. this thing is awesome.   oh and i have been here for breakfast. i got the az bread co omelet which was also damn tasty. covered in this nacho cheesy sauce, the omelet is ginormous and filled with sausage, mushrooms, cheesy goodness, and a variety of other things i cant remember i just remember that i couldnt stop eating it. the side potatoes are also great. they are like nicely fried french fries that have been cut into manageable little squares. i was pretty addicted.  so yes, i guess ive found my go to sammich place for when i need some delicious pork.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5cd9IdAV9Dce3BdRDh9qCQ"
  },
  "eOPvzu3kXKh1i9cgi1yjYw": {
    "date": "5/22/2011",
    "text": "So I finally got a chance to go here for the first time, and YUMMY is the word to describe this joint. My advice get the challah French toast.   My Wife got an omelet it was really delicious too. I need to come back and try the Amanda Burrito.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eajtHoDsqjqvbwYg_u_UTg"
  },
  "7l55urEv3-7smLtuYsPuKw": {
    "date": "4/1/2011",
    "text": "Liked it, the owner was very nice.  Fresh food, little pricey.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XLGgliAown151yxQxAOOWw"
  },
  "YgZwZB-m3lFxQPyRZ0CLhQ": {
    "date": "8/5/2010",
    "text": "The BEST bagel I have ever had. Way better than Einstein's.  Ordered a wheat one with butter and cream cheese, and who knew that a simple breakfast could've been so tasty.  This gem of a cafe is easy to pass by, but stop in and give it a try. I had some of everyone's orders at my table....my friends' Blueberry Muffin (amazing!), strawberry french toast (which was delicious, considering I don't like French Toast and never order it), and the hashbrowns/breakfast potatoes also hit the spot.  Can't wait to go back...this is a great little joint to go to for a weekend brunch when you don't have to be on your diet. And, the prices are just right. MMMM I want a bagel right now.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uSpdLr9MNIhGjrFd0gK5nA"
  },
  "tLZkxkFbkE27CLP-McweQQ": {
    "date": "2/26/2011",
    "text": "Great friendly locally owned place for breakfast. Unique and tasty breakfast menu. If you like a little spice in your life try the Montoya Skillet!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dTps7HZuXROToHYQ_B4r3g"
  },
  "mzdOfpZsMMQoE2RixFbaSQ": {
    "date": "2/15/2010",
    "text": "I wish I could eat breakfast here everyday. Everything I have eaten here has left me only to want to try another breakfast. The sweet and the savory choices are equally delicious so just take your pick. The pecan french toast melts in your mouth, the eggs benedict's hollandaise sauce is amazing, and the vegetable frittata or the ajo breakfast wrap will certainly satisfy. Did I mention the large portions and the side of mouthwatering potatoes? I also like to try to be a little healthy, so the choice of egg beaters or whites is appealing. Finally, the owner is always around and she is super nice. She runs a great business, and its great to see her involvement with the diners. Oh and did I mention... ITS AMAZING!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPuTCCL4W3u5sxrbBFu9YA"
  },
  "k9oQQ6lop7ZL_CAmEsvFog": {
    "date": "10/28/2013",
    "text": "Really! This was not a nice place. I was ignored then treated rudely and don't know what the problem was. I finally left without getting anything.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PgWXMFD4uS-n4i6n_o-RBg"
  },
  "1MLL6De4ciFS1zEMKRBiZA": {
    "date": "3/31/2010",
    "text": "The food was excellent, the staff was friendly, and the place is clean and inviting. Helps they have wifi too! I will most certainly be returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7FN6aCyvhByS7YJhFG-CQQ"
  },
  "bWqGXoqYokWY7YJAAJCepQ": {
    "date": "4/17/2011",
    "text": "YiOur favorite breakfast stop after our club bike ride!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1zWINjU_0ym9HaXaM0KbTg"
  },
  "oCPUXZNoeVG65-xAtY4pLw": {
    "date": "3/10/2010",
    "text": "We just ate here yesterday and it was wonderful.  I had the strawberry waffle combo and it was delicious!  The portions were out of control, the berries were very fresh and the food was very hot when served.  The rest of my family enjoyed this meal too.  The kids meals portions are also very large and both my kids loved their food.  The owner/manager was so nice.  I loved how she new many customers by name.  I only wish they had one of these in our home town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ks62c2PV83WH8-C0R-p50A"
  },
  "6wSajDzXUO6VBIWKfxtcAg": {
    "date": "3/8/2010",
    "text": "This place is so good it's almost not right. Every thing is good, even the water!! The mornings that we eat at AZBC remind me of home made breakfast feast that my parents would make on special occasions. I love the Carne adovada and the Ajo breakfast wrap. The kids french toast sticks are so good they should be made illegal. The price is small for food so good. The owners are nice and will talk to you like your a good friend of the family. I love this place. I just wish they had a dinner menu. (hint hint). Get there early, get a seat and get ready to eat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JTXdcFLk4rz24jQcqfE7xQ"
  },
  "xSttSQV-IxSn42eIH2Ibuw": {
    "date": "8/30/2013",
    "text": "Always awesome food, wonderful staff and fantastic prices.  This is one of our favorite places to eat.  So many choices - some very gourmet items for breakfast.  A truly great place to start or spend any of your day!  We have ate breakfast all over the Valley and this place is tops.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n4f9GPwWTns-8UFgoMX6kw"
  },
  "I8aU2ujyr31s-S5E6ynzXg": {
    "date": "11/14/2010",
    "text": "Delicious eggs Benedict and friendly service.  Order when you walk in, then find a table and wait for it to come out.  Male sure you grab silverware and napkins before you sit down.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I0l7yBP_q6H05ZWRvJt6pA"
  },
  "7XKqc7ZVtL4_B2n-_s7-YA": {
    "date": "5/30/2012",
    "text": "I have stopped in to the AZ Bread Co before for a quick breakfast--some toast and coffee, or their acceptable French toast. Nothing special. I was running errands in the neighborhood and came in for lunch. I ordered the carne adovada sandwich at peak lunch time, about 12:15. It's a big sandwich on a French roll and it was just plain bad. The roll was microwaved and tough, chewy. I mean, you put the word 'bread' in the title of your restaurant. Yikes. The meat was over stewed and over salted by a long shot. The only other component of the sandwich is an equally salty and processed-tasting liquid cheese sauce. Nothing fresh on the sandwich at all? I was starving but couldn't bring myself to eat any more of it. I took it home to my husband because he has a deep, abiding love for any sort of slow cooked pork dish and even he wouldn't take more than a bite. They need to take a look at the dishes they're serving and inject some life into them. It should be better--and it wouldn't be hard to improve.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MLGznCv-49ZbG9ZWW5Iu1A"
  },
  "XFW5e5RzmNuLlV4Kxxyvbw": {
    "date": "3/8/2013",
    "text": "We've been coming here for 2 years, for breakfast and lunch. The blueberry muffins are amazing, the best I've ever had. For breakfast, we always get pancakes, the wrangler and a muffin, and share between two adults and a toddler. For lunch, I love the Sedona sandwich with potato salad, or I get a half sandwich with a salad. The potato and cream cheese soup is also yummy. They have so many delicious options! And the service, staff, and owners are all great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZnbSuNtVMYfVq_BOboHzJA"
  },
  "9EaaHtPBy6MESNulgo2fFA": {
    "date": "2/20/2011",
    "text": "I found this place one morning while I was studying for finals n I needed something to eat to continue the process of cramping my brain full of accounting n economics. I called an asked them to make me something good n healthy n I'll pick it up. They laughed but said they new exactly what I needed. When I arrived my food was ready an I was greeted with a warm smile n a hot cup of coffee. When I got home I began to pick the eggs n patoato fries. It was amazing, n I go back for every midterm an final I have.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gONy4PxBbfyWyv86mZNOig"
  },
  "zD4joQ_0idGaz5oS0cM9cA": {
    "date": "10/29/2010",
    "text": "I love AZ Bread Co! The staff is great, the food is excellent, and it's a very relaxing atmosphere. My favorite thing on the menu is their Grilled Chicken Sandwich. All of their soups are great too. This is definitely a favorite that I visit often for lunch breaks from work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d8G1W648S6UeHehQUdBqfQ"
  },
  "Pil0tBb-Qmh9e6q074ayTg": {
    "date": "10/24/2010",
    "text": "I had the carne adovada breakfast. All I can say is, aside from what I would consider a delicious breakfast, don't over-order. The portions are excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ai6q_8isGNZtZosCC422OQ"
  },
  "UZyW6qhCzZdaYAN_jye-lg": {
    "date": "10/2/2009",
    "text": "I work fairly close to this location, and I'm happy I took a chance and drove past Subway. I stopped in and was greeted very pleasantly by the girl at the counter, and she helped me pick out the special of the day, the green chili tuna sandwich. It came with a pickle and chips/salsa. Everything was excellent and I really was impressed with the salsa. Also, I had my first FUZE drink with my meal, also recommended, and I loved it. I grabbed a to-go menu and will definetly try to make it back soon. Overall, it hit every item on what I judge a lunch spot by with flying colors. At first I thought the location was a bit out of the way, but I now view it as a destination, rather than a good meal while in the neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "xPpqpudzcB2EwyHhIsAjlw"
  },
  "JFtSDT-TtSz5rQeQOqKzMg": {
    "date": "1/16/2017",
    "text": "The food is good and I used the check in offer from Yelp, so a free coffee. Nothing super impressive, but I would come here if I am in the neighborhood for breakfast or brunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d-RsrgXIafEz2DW5yYWbng",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. AZ Eggs Florentine that coos to perfection. Love the AZ potato!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d-RsrgXIafEz2DW5yYWbng/o.jpg"
      }
    ],
    "user_id": "yUngqxBzqCgcdL4heo4Heg"
  },
  "LWbtaC3sBfp-Q_7e5VrxYQ": {
    "date": "9/5/2018",
    "text": "Found my new breakfast spot. M-F special $4.99. Eggs, potato, & meat. Everything was cooked perfectly. Besides this being reasonably priced they had frillier breakfast and lunch things. Nexttime I want to try the cajun shrimp omelet. The have a million different hot sauces and ketchups. Staff is friendly and atmosphere has a laid back Starbucks or Cali kind of vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZRmKNCeDu-H4pZF3dBL9bA"
  },
  "zuggE5EsZJS3gJO36QsJBg": {
    "date": "1/23/2019",
    "text": "The Carne adovado is the BEST BREAKFAST EVER! Great breads and pastries too. Our favorite local breakfast place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RFGlrlpsFAVG7jPg0ALQ8A"
  },
  "BAfD3JnXpe13ILX6nyw7Aw": {
    "date": "8/4/2018",
    "text": "The food is delicious, and the pricing is great. What's not great is the staff looks utterly miserable. No one smiles or even looks happy to work there. I watched them as they went about and everyone just seemed miserable to be there. Perhaps something bad happened prior to me arriving for breakfast? Not sure. The food is absolutely great and largely portioned, so come hungry! I would come again! The chefs did a fantastic job! Everyone's plates looked stunning. Perhaps management could provide staff with something to help lift their spirits. The service was good you could just tell they were unhappy. AZ bread co. treat your people better, maybe they'll smile more then.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XfUQzzbneP-o-IUpZiIx9w"
  },
  "Ud6W59hJfNKW9oZySsQ8Nw": {
    "date": "1/3/2017",
    "text": "The workers are very friendly and service is fast. Homemade soup nicely presented and tastes great. The Cesar wrap was fresh but wish I would have gotten the spinach wrap. More dishes would be great. Parking easy and convenient.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QHe70d28TLlnGZ2W4F-WwQ"
  },
  "YNRqdPeRS85DvM8SpYDySQ": {
    "date": "9/23/2016",
    "text": "Came here for a meeting and dined in. The service was fantastic, especially the employee bring the food and checking on us.   There was nothing overly impressive about the food, but it was good.   Not something I would go out of my way for, but if it was my only option, I would go again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "N6ZTMIue-2b30CJv2tyPGg"
  },
  "ejKlM1GV2_gta-QoPqMQkQ": {
    "date": "12/13/2017",
    "text": "This is my favorite weekly breakfast joint. Sean is fantastic along with the other staff, cooks included! I'm a picky eater and they work with me every time. Always consistent, always delicious and I am always left happy with a full belly.  Suggestion:  carne adovada w/ scrambled eggs  P.S. please serve breakfast all day! ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "61McVyqk85S0mF5oYaN-dg",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Chorizo breakfast burrito with cheddar and mozza, egg and potato",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/61McVyqk85S0mF5oYaN-dg/o.jpg"
      }
    ],
    "user_id": "fDwHsYh9JUKkzFT0j74UDA"
  },
  "rthl9MztmMpCpNs3ZF40uQ": {
    "date": "2/24/2015",
    "text": "Was out looking for a new place to me to try for lunch, and another coworker was raving about how much she liked AZ Bread Co, so I thought I'd go try them out!  After checking out the menu, I went with the grilled chicken sandwich, it came with cheddar cheese, green chilies, lettuce and tomato but what really sold this sandwich was that it was on a Challah roll. Challah bread is one of my top 5 favorite bread! It also came with a side, and I picked a red potato salad.  The potato salad was ok.  The sandwich was a good looking sandwich full of color, it had yellows, reds, greens it just was a pretty looking sandwich. It tasted even better than it looked! The Challah roll, man that was delish, I'm sure I could have easily eaten that without the sandwich stuffing haha.  Glad I finally went to check them out and now they are on my lunch time eats list!",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 10,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "btfYL-cP7rryUf1tTtljCQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Grilled chicken sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/btfYL-cP7rryUf1tTtljCQ/o.jpg"
      }
    ],
    "user_id": "bpgbVPJcG-wQ4cNBcPPIxw"
  },
  "5QOKC8Z3jJfOjM1cgW20CA": {
    "date": "6/26/2015",
    "text": "We came here to meet up with family before leaving phoenix,  AZ to head back home to Hawaii.  This place is very quaint.  The food was good as well. I heard the Chorizos are very popular to try in Arizona & Las Vegas area so I wanted to try there chorizo wraps.   I ate it all. Lol!  It wasn't that bad at all.  There customer service was great too. Everyone was so nice and very helpful.    We also got a few more sandwich wraps for the plane ride home and that was sooo delicious.    Food is very tasty!  Perfect to hit the spot and comfortable",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MySeUWDYrZRdm23qqhGHUQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. My first chorizo wrap with their ono sauce. .kinda spicy but,  not that bad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MySeUWDYrZRdm23qqhGHUQ/o.jpg"
      }
    ],
    "user_id": "VBlsn1We7Jn9OGgXRRmlwA"
  },
  "wH3X_zImLq-9ygGuuS-nUQ": {
    "date": "3/4/2018",
    "text": "Worst breakfast experience ever. This place is pure Chios. Terrible service for a first time visitor. I had the strawberry waffle and it tasted like cardboard soaked in syrup. Thank God they didn't overcook my egg cause thats all I ate from my plate.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1PsxLafjkWbvx2UhDAOM9A"
  },
  "QUi9xaCiimLLhaifxWJA9A": {
    "date": "9/10/2017",
    "text": "I've come here a few times as it is in my neighborhood.  It's a pretty good breakfast place. Usually we order off of their special menu board rather than the actual menu. All the items we've ordered have been great.  If you're looking for something fairly quick and yummy, this place should be added to your list of great breakfast spots in Tempe. They have an indoor and outdoor dining area and are dog friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3lVLT3IbXB8s1KAgR9NpDg"
  },
  "EEFEdzran2FizUpgMMp6cQ": {
    "date": "3/29/2018",
    "text": "1st time here and it was so delicious! Breakfast was fast and cooked perfectly! I got the Amanda burrito and my fiance got the carne adovado  they were both awesome! We switched plates 1/2 way through so we could share in the amazingness lol Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eMQ9eM9SG-c-lS_e4noVzw"
  },
  "ucAreTgEn69dyhTrhWJYaw": {
    "date": "4/11/2018",
    "text": "One of my favorite places!!! Food is delish and staff is awesome! Anything i order off the menu is great plus they have decent portion sizes. Can't wait to go back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NHqyjGvzH-yVp5j2MWcUQA"
  },
  "SHAXwdAhP4lPTPrPH0XqYg": {
    "date": "10/8/2018",
    "text": "Going downhill. I have been eating at AZ Bread Co since it first opened. Carol, the original owner was so personable. She greeted everyone and always had a smile on her face. It was a cute little neighborhood place that was great for a Sunday breakfast or weekday lunch. Since Carol sold the place it has been in steady decline. Staff has no personality and questionable training. The place is cluttered. The food quality is not near as good as it had been. If you don't remember how great AZ Bread Co. used to be you may be OK with it. I think my days dining there are numbered.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fHWYdro49mbfIdFAzDj8lA"
  },
  "sPW6QxE10jJ8rWWg0n745Q": {
    "date": "3/25/2018",
    "text": "Ordered the pancakes, they sat on the counter for a few minutes while the staff visited with each other, playing around, ignoring food ready to go to the patron. Well, my pancakes should have sat on the griddle longer, so undercooked. So disappointing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w9E372p9nBV4OpjxmYZ4Ig"
  },
  "aHpLvRVPMYdwcvbtmpED3g": {
    "date": "2/12/2018",
    "text": "Do not get the New York Cinnamon roll!   You will become addicted and your blood sugar will rise to unsafe levels.     So far that's all I've tried.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VZTduOMexIwc5ymN935kLg"
  },
  "px8g_3sxT7jPKmrvKTLyVA": {
    "date": "1/8/2017",
    "text": "So, the salsa served on the side with the Tonto breakfast wrap is for sure some straight-outta-the-jar Tostito's. Not sure whether it was Chunky Mild or Chunky Medium, though.  But this place still gets five stars because the Tonto was delicious enough to not even require any extra condiments and even if it hadn't been - the salsa was free. (I know how you Yelpers like free shit).   But for real - good food and five stars.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7uKsMyLaE-fsQy3hKUHf4g"
  },
  "i1eePUtGBvnheBQIPtYIBQ": {
    "date": "2/28/2016",
    "text": "FAMILY OWNED, GREAT CUSTOMER SERVICE, DELICIOUS FOOD, BIG PORTIONS, WELL PRICED This is the first time I've been here. I always thought it was a chain restaurant, but it turns out it's a mom and pop restaurant owned by a very nice lady, Carol. She's genuinely friendly and checks on her customers. I noticed she knew her regulars by name, was bussing tables herself, holding open doors for people and checking on the customers. When she came by to check on me, she cleared one of my plates, and we chatted for a bit. She even asked my name. When I was talking to her, I found out she was the owner.  ATMOSPHERE - Friendly, Casual, Indoor and Patio Self-Seating You order at the counter, and they give you a number. You can sit inside or out side on the patio area wherever there's an open table. You put your number on the stand on the table and they bring your food out to you. Maybe it just happened to be the day, but the customers were also super friendly.  DOG FRIENDLY PATIO I also noticed people had their dogs on the patio. One of the girls that works here went up to a table and asked if they wanted some dog treats for their pup.  FOOD - DELICIOUS, LARGE PORTIONS, WELL PRICED I ordered the Strawberry French Toast, an egg sunny side up and a side of potatoes. Good thing I brought my appetite! The food was delicious and it came out faster than I anticipated, especially with it being a busy Sunday morning. The food was delicious. The egg was perfectly cooked, the potatoes had a great flavor, I didn't even use ketchup or hot sauce with them and the French toast was amazing and the strawberries were really fresh. The soy latte with caramel was awesome! I may have found my new favorite coffee place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PyTRCoF35nKdKOYWXig0vA",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Soy latte with caramel! Delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PyTRCoF35nKdKOYWXig0vA/o.jpg"
      },
      {
        "img_id": "HzpgUo26497LyFIyAhF2kQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Egg and side of potatoes cooked perfectly! The potatoes had a great flavor, I didn&amp;#39;t even need ketchup or hot sauce to go with them.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HzpgUo26497LyFIyAhF2kQ/o.jpg"
      },
      {
        "img_id": "7racmPKa9ubEMfwco4bveg",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. The Strawberry French Toast was delicious. The great flavor, consistency and the strawberries were fresh! The portion was huge!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7racmPKa9ubEMfwco4bveg/o.jpg"
      }
    ],
    "user_id": "snbjen-glyV_5ndooJE7zA"
  },
  "aVxzNcDKtNBlFDnk0A791g": {
    "date": "1/14/2018",
    "text": "First time here and will be coming back. Food was great portions for the value.  Might be one of the best breakfasts I have had",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dK1-RZPuUXSHYMWE09zxbg"
  },
  "T8JJXfRiXwPDZw5kOQVlxg": {
    "date": "9/27/2017",
    "text": "This place is okay, great if you need a quick bite, but not something to drive to. I work in the same parking lot and was very excited to have a restaurant in walking distance, however, after a couple of trips of consistently being unimpressed I wont be back. The food is okay, a little bland, and pricey for me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pvJOFT-w_oVD-EafUnh9ew"
  },
  "NGGpyZn-QLrLehbG8yMT5A": {
    "date": "11/30/2012",
    "text": "Holy cow, we had an incredible breakfast today! LOTS of food, excellent bread, the meat was juicy,  potatoes were hot and tasted fresh and not like a reheated afterthought! We will absolutely be eating there again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nvl8U2rJGwCeHk9q3Y8UlA"
  },
  "cpEK-yzVSkf7Gia70QNVmA": {
    "date": "4/18/2015",
    "text": "Love this place for our weekend breakfast!  Right around the corner from our house and never though about eating here since the shopping center seems so dead.  But since we've tried this spot we've been going on a regular basis.  Great personable service, love the pancakes and waffles, and great coffee too.  Very dog friendly restaurant which my daughter loves since she always gets to pet one of the customer dogs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ES2ljebqigHoTnBFl7VMdg"
  },
  "3tMHP6ho6Fkh8jUTn4Xo3Q": {
    "date": "3/16/2009",
    "text": "Love, love, love this place!!!   Food is fantastic. I usually get the \"Pick Two\" and get a turkey sandwich with all the veggies (cucumbers, sprouts, onions, tomatoes, lettuce) on the 9-grain bread and a garden salad. The salad is fantastic! Spring mix lettuce, carrots, peppers, mushrooms. Not your ordinary side salad! And the honey mustard dressing is fantastic.   I have also eaten The East Coast Panini (pastrami, sauerkraut on rye), The Scottsdale (roast beef, red peppers on sourdough) and several other sandwiches. All top notch. Their red potato salad is also fantastic.   The service is stellar as well. The counter people are always really friendly and quick. Your food comes fast and I've never had a mistake in my order. One of my favorite AZ places!!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "IVk7V7MbknQI4QCGrPavJA"
  },
  "IVAEBVqjDWCxDJ4RRNAVyA": {
    "date": "12/13/2008",
    "text": "I wish this place wasn't out of my way for breakfast or lunch, or I would be there more often. I went in there today for a last minute lunch idea...I just love how friendly the staff is.  The owner seemed to know everybody there, or just was really good at acting like it.  She even made me feel all warm and fuzzy inside.  I usually go with my staple, the grilled chicken sandwich.  I usually get this when i am in the mood for heartburn, since it comes with cheese, tomato, lettuce, and my heartburn favorite, Green Chiles....yummy!  I love it that they serve it on a Challah role...  I always polish off my meal with their chocolate chip cookies, that are out of this world.  Will update when I go there for breakfast.  I just wish that they were open later than 2pm...my only negative thought about the whole experience.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "7SFUWbb33dOR8lmO51h3dg"
  },
  "qghvAXz5moTE4qeeLXktfQ": {
    "date": "3/29/2013",
    "text": "Great spot for breakfast, try the Ajo burrito. Go Angels in 2013",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U8-EwhqqTBXi878_pPHRVg"
  },
  "AcX1Ehx5KTchc7EeNPU3Pg": {
    "date": "7/13/2011",
    "text": "In Tempe for the first time ever and were looking for a quick place to eat. AZ Bread Co is located in a nondescript strip mall, right on the corner w/plenty of parking spaces all around.   I ordered the Amanda burrito with a side of queso and my husband had his usual, ham and cheese omelet. Our food arrived quickly and piping hot. You pay at the register and then take your number and go sit down in the spacious and very clean dining room   The joint is beautifully decorated and much of the art on the walls is for sale. Of course I purchased one and it truly is lovely. The restrooms are beautifully decorated and very clean. The staff was not overly nice but neither were they unfriendly, pretty much just doing their job.   There was an older man working there whom I felt really sorry for because he looked as though he was serving out a life sentence.   We both ate for a little over $20 including drinks and if we lived there, we would def be customers. There are many tables and chairs outside if you're brave enough to eat outside and as always, I would much rather give my money to a family biz than some big restaurant chain...maybe when you're a regular there friendlier but the food was wonderful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2xT2ekjhxi0PhF3_ueiVkw"
  },
  "gvFfILUWltw-ITsEZKMHkg": {
    "date": "4/1/2012",
    "text": "I have been thinking about trying this restaurant for awhile, and when the BF and I couldn't decide on breakfast this morning, I decided it was time to try it. We got there around 10 and it wasn't very busy, we didn't have to wait long and easily got a table. So I wrestled with what to give this place star wise. The lady who owns the restaurant was really nice, she even came by our table and said hello. Additionally, the employees were nice. The food was just meh, not terrible by any means, but not good or memorable in any way....so I had to go with the 2 (sorry guys). I had the eggs florentine and, though the eggs were cooked perfectly, the hollandaise sauce was not made correctly. It was very acidic and tasted not good, which kind of put a damper on the whole thing (as it covered all of the food). The bread was good, but it got soggy quickly (which is why I think they traditionally use english muffins). The potatoes were mealy and not crispy at all. I barely ate any of them because they were that meh. The BF got the strawberry pancakes. The pancakes were flavorless....like puffy white bread, but with less flavor. I figure a place is fairly meh when their pancakes are worse than those at Ihop. I even said to the BF that if this place were the only breakfast place in town....I would probably just cook at home. Now, it could have been an off day, and I would like to give them the benefit of the doubt, but I probably would drive out of my way to go here again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "d_TBs6J3twMy9GChqUEXkg"
  },
  "nEwyGDoOWdh-lMy8FXAlpw": {
    "date": "9/3/2012",
    "text": "I've been to my fair share of breakfast places, but this one takes the cake. Excellent service, fantastic food, warm and welcoming ambiance...I was really blown away.  I ordered the veggie frittata with a side of salsa, which was excellent (I do recommend the side salsa, though - it adds a lot more flavor), and my companion got the strawberry French toast. Really excellent food.  So happy to live close to this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q8w-tbX2OrdnLtmizfltMA"
  },
  "qjCwQp-x4SO9_plOUj3rDA": {
    "date": "5/12/2011",
    "text": "Great place to eat.   The food is great, service is excellent, and the owner is always pleasant.  Its a bit of a drive for us, but very worth it. Love the Montoya Skillet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c0rnmJmT8bZKELMapa2tew"
  },
  "_AMkabKcaTqwA28AbWiWWg": {
    "date": "6/1/2010",
    "text": "Came here w/a girlfriend for breakfast a couple of weekends ago.  Saw the great reviews on Yelp and we girls love doing breakfast on the weekends  :)  We got the Carne Adovada & the French Toast and thought the food was pretty good but nothing special nor memorable.  I prefer my french toast a little lighter and fluffier and I also thought the syrup that was put on it a bit on the heavy and thick side (it crystallized and harden up towards the end of my meal).  The pork in the Carne Adovada was nicely seasoned and really tasty...but my scrambled eggs were overcooked and a bit too hard and dry and my potatoes undercooked (so they were a bit soggy).  I also liked the jalapeno queso...but there wasn't enough of it to enjoy w/all the pork that was on the plate.  Overall, it is a very cute place w/nice atmosphere and the one lady who came outside (where we were sitting) to check up on us was very nice and pleasant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "czpjHPLH8P2zkI1x78UJGQ"
  },
  "9_N3vysUPgQy2CLGuYjSoQ": {
    "date": "11/7/2011",
    "text": "This is the first time i have ever been here. My boy and i came here for brunch on Sunday morning.  It is very clean which is nice, however, i did not check out the restroom,so i cannot rate it. The food was excellent. The breakfast potatoes were really good.                                                         I had the fritata which was fabulous with spinach inside and crumbled feta cheese on top. My boyfriend got the Wrangler, his was really good as well except the bacon. He said they used to serve better Bacon and this was a cheaper version of something eatable.                                       Other than that though very good. I liked the coffee it was quite strong. The pieces of bread that they give you for Toast are huge, also very good. They don't have coupons which is a bit of a bummer. However, If you are looking to splurge this is the place. It was a little loud in there because, there was a table of children.                                                                                But, hey , what can you do??? Kids are loud!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7GVA958q4zs5Z8cdHauU5Q"
  },
  "jedMScJXT1OrRpWsIfVZxw": {
    "date": "11/14/2009",
    "text": "I would like the place more if they were opened past lunch hours.  I don't work in the neighborhood and only get to go on an off-day.  Their sandwiches are delicious and they have a solid variety.  The sandwiches may look simple on the menu but you can add a bunch of veggies to really flavor it up.    The style is a seat yourself, and wait for the food to arrive type.  I like the laid back style, nice decor, and fresh and delicious food.  Owner is super friendly and appreciates the customer.  Each time I have gone I wonder why I don't go more often, then I realize the hours.  I only give it 4.9 stars for not staying open long enough to allow me to eat there every meal!  Fresh bread, and meat and veggies.  What more can you ask?  I can't wait to try new things on the menu.    To the person who complained about the price of a bagel-egg-cheese sandwich I would like to remind you that it is a BREAD COMPANY not a bagel shop!  I would have charged you $10 bucks for being silly enough to order the bagel.  2nd of all, no one ever asks you what kind of cheese you want on a bagel, it is always American by default, even at a bagel shop.  If you wanted something different then ask, they do not read minds.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ykY7aVvXlNgKpnbNjhUciA"
  },
  "iGwSM41oPBhs_uEwVtf2uQ": {
    "date": "8/30/2012",
    "text": "Great food. Warm and friendly staff. Fast service with great quality food. I had the carne adovada and was NOT disappointed. Found the restaurant on yelp and have to agree with all the positive posts :) The owner even came around and made sure we were ok. Definitely coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FcjzfgaXgBPf01mBMkSELg"
  },
  "Sl5PbK-uhd-bJnXF0oZFaQ": {
    "date": "6/21/2012",
    "text": "Very good food but lacks consitancy. The food is either amazing or great but recently saw chicken being microwaved and served.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XIDY5pJ9muNGxEXxNjgWHA"
  },
  "eAZf3L_5PIcPPKkEuOpkuA": {
    "date": "2/20/2012",
    "text": "yes still rockin fast ,hot ,great breakfast , always tables avalible, good service",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nGoKau64-PtetuzfcRW3jA"
  },
  "4QRQTDakvc3c9TwF3IA27g": {
    "date": "7/7/2011",
    "text": "Fresh and fast.  Good smoothies.  Right sized portions for kids.  Great way to start a Saturday.  Now if it wasn't so bloody hot in this state.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lh79mB6ltknecUnIe6D23w"
  },
  "MHLP5-gKTHPrAUasLF1QDg": {
    "date": "3/5/2011",
    "text": "It is a good breakfast place. They give plenty of food and the environment is nice. What topped off the dining experience is thar the owner greets everyone and makes sure the food was good. Excellent customer service! I would come back again if I'm ever on this side of town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "uegNuvRUU-z4FwFo2aJpcw"
  },
  "vl8UX97mtCeDsQGtHawUSA": {
    "date": "9/11/2011",
    "text": "The soup is delicious here. I have not tried anything else in here, but so far I'm happy with their soup. Ive only been here twice and during those 2 times I've got soup. The chicken noodle soup and Itailain wedding soup, which both are good. The atmosphere and decor is nice also.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oisnn5J3m4Mq2otVd1LGZw"
  },
  "9bfouvP3t6hTh0StSOSq4w": {
    "date": "8/10/2011",
    "text": "Definitely 2 thumbs up for the french toast!  It was absolutely delish!  My friend had the waffles and they showed up covered in whip cream and strawberries!  Yum!  She said they were delish too!  This place is in a good location, with lots of parking.  My only gripes are that they don't serve mimosas (or any alcohol) during brunch, and they don't serve any fresh squeezed OJ (only the yucky bottled stuff) which is why I couldn't quite give them 5 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "an-ijVpGQxgiOBX9qTBOyQ"
  },
  "nmNj-V0VZiRGtu6DqPi-kg": {
    "date": "3/6/2011",
    "text": "I used to go here for lunch all the time when I worked out there. The food was spectacular and the service was always friendly and quick. I always got the stuffed tomatoes with chicken salad which came on a bed of greens with their non fat raspberry dressing. It was amazing! The prices are a little higher than your typical sammich shop but definitely not as high as some (yes I am talkin to you Paradise Bakery). Make sure you try this place if you are in the neighborhood!!! You wont be sorry.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F10QJk-i3IrUxKcJI9CF-g"
  },
  "HzPM_2PzEAGnj8-sbAG8Jg": {
    "date": "3/23/2019",
    "text": "Clean Fresh Delicious Nice staffs Price is reasonable Nothing to complain Became regular customer here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2Mr7_H_J9d8c16PhzHb0uQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Three sides order",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2Mr7_H_J9d8c16PhzHb0uQ/o.jpg"
      }
    ],
    "user_id": "KAn5eCKgVSUsIuzLGPw8Qg"
  },
  "Hd3L6mQTxtPsJhihQ5BamQ": {
    "date": "4/16/2019",
    "text": "Very unpleasant experience. Maybe we hit it on an off day... The lady behind the counter was rude and far from helpful :(  The food came pretty quickly after our orders were taken, but it was absolutely inedible and highly disappointing. We left most of it as it just wasn't pleasant. Cold eggs, burned bacon, soggy toast.  I would not recommend this place.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EKP4HMYFOPKInouw-0vdVA"
  },
  "oxm-FE29xdERBU4O6iwrug": {
    "date": "1/7/2019",
    "text": "Came here for a quick bite for breakfast with my girl. Everything sounded really good on their menu but I decided to go with the southwest chorizo Benedict. & my girl got the carne adovada with over medium eggs & her choice of toast. Food came out super quick! And both dishes were pretty amazing. The poached egg on the Benedict was cooked to perfection. Each dish is affordable and the portions were a pretty decent size.   Upon walking in, they take your order at the counter. You get a number and choose your own table. Dont forget to grab your utensils after paying before you sit down! They have a shelf of sauces you can choose from to enjoy with your meal. After you are finished eating, you can leave your plates at the table and staff comes around to pick it up. This place is very clean & organized!  Only reason why I knocked a star of my review is because I feel like their customer service could have been a little more friendly. Upon our arrival to AZ Bread, my girl and I checked in on yelp & noticed that they offered a free drink via yelp check in offer. The older lady behind the register was like \"just give them the drinks, I guess\" with an attitude and gave us the side eye. It's just a drink, wasnt a big deal. If they didnt want to honor the check in offer coupon then she could have just said so and we could have just purchased them instead.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LjP_Y7YKOiFZ5V_2eHSK8Q",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Carne adovada with sourdough bread &amp;amp; over medium eggs. 1.6.19",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LjP_Y7YKOiFZ5V_2eHSK8Q/o.jpg"
      },
      {
        "img_id": "eyRPB1LM2WKnsyCegSLW6g",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Southwest Chorizo Benedict. 1.6.19",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eyRPB1LM2WKnsyCegSLW6g/o.jpg"
      }
    ],
    "user_id": "uhYUuzBbz1q_uPeTj4-I2g"
  },
  "X0bVrAfLxQ6fVF8rbU-keQ": {
    "date": "11/17/2018",
    "text": "This pains me to do as I used to be a regular here and live around the corner. I used to eat here 1-2x a week and would often grab breakfast here on the way to work. My most recent trip will be my last.   I have a pretty severe dairy sensitivity that was recently diagnosed. Some things aren't as bad as others, but for whatever reason, cheese will ruin the next 24 hours. I always order my breakfast burritos here with no cheese. I normally just grab it on the go and eat it at work. At least half a dozen times, they load that bad boy up with cheese. By the time I notice, I am already in the morning sales training I lead for my reps. They probably love it since once a week someone gets a free burrito as I can't eat it.  This most recent time, it was a weekend so I actually had time to bring the burrito back after they messed it up. It's frustrating because the ticket definitely says no cheese, but as you can see from the picture below, it's almost like they are trying to spite me. That much cheese is absurd even if it wouldn't tear me up.   I get home and get ready to eat and see this cheesy monstrosity. I call them and say they screwed it up and ask them to make me another since I cannot eat this. I get in my car and drive back and am waiting at the counter unacknowledged for a good 5 minutes. Finally, a younger girl comes over and snaps at me, \"Yeah we know. We're making you another one.\" Great customer service. I offer to give them the burrito back since I cannot eat it and she responds, \"Just give it to one of your friends.\" LOL OK. Have probably been here at least 50 times and will absolutely never be back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y-27Me6UHh_KpH5hvF3Jfw",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Special Prep- No Cheese Apparently",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y-27Me6UHh_KpH5hvF3Jfw/o.jpg"
      },
      {
        "img_id": "xKRlEZq5CvU8esVm95a8cA",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Well at least they put the order in right",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xKRlEZq5CvU8esVm95a8cA/o.jpg"
      }
    ],
    "user_id": "r3WkvAjmHZpDvW5rmBJSpA"
  },
  "vRHLnh4ulmDfXH1N207mPQ": {
    "date": "5/28/2019",
    "text": "Been here twice tried their veggie omelette and shrimp omelette. Trust you will not be disappointed and you come back for more. Staff a very friendly and enviornment very welcoming.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HOGlQA_VuvFIreboyVJJLA",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Shrimp omelette",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HOGlQA_VuvFIreboyVJJLA/o.jpg"
      }
    ],
    "user_id": "_LCP6ShdQtCF145MzVE5_g"
  },
  "rbjKbQfdSgNApCv71aWCyA": {
    "date": "7/30/2019",
    "text": "The lady up front with glasses and short hair was very rude that day. I came and asked did they have muffins and she replied very short \"yup they're put up.\" Mind you I was the only one waiting in line. She then was stared at me while I was looking for the different kind on the menu, I asked where on the menu are they?..\"Oh they're not up there\"..I replied \"well what kind do you have??\" Cranberry Blueberry and pastashio. I got the cranberry (very good btw) she brough the muffins cold and I asked to warm them up for to go. It seem like a inconvenience to her and she just had a bad attitude.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9k_ZxcLUGZSXV6fmfigUew"
  },
  "DyTnjooPreu5p6XmEtkpCA": {
    "date": "7/21/2019",
    "text": "I have came here for breakfast for over 3 years. The food is great & the service WAS good as well but after my experience today I will never come back. I had interactions with 3 different employees and they were all incredibly rude. This was so surprising to me because I have never been treated so poorly & I am not easily offended. Upon arriving the lady taking my order was rolling her eyes at me, I asked her questions & she was just shrugging her shoulders at me. When the second woman brought out my food I asked her for cream cheese & she completely ignored me & pretended not to hear me after I had asked for cream cheese when I ordered my bagel & it was forgotten & she just walked away. I got up to ask her AGAIN for the 3rd time now for 2 cream cheeses & the man in the kitchen gave her one & I said I asked for 2 & he rolled his eyes & said \"TWO?!\". I ordered something to go after finishing my food & stood there for over 3 minutes when One of the cooks finally helped take my order & he was the only nice one, a young guy. When my burrito was done the lady that was rolling her eyes at me taking my order the first time handed it to me & didn't say anything just handed it to me. My sister was also treated poorly, she ordered right after me & received the same \"customer service\" from these shitty people. When leaving the same nice young guy told us to have a great day on our way out then as I was getting in the car the rude cream cheese man yelled out for us to have a great day after being extremely rude as if he was making fun of us. Horrible experience overall & I will never be back here. Also, the silverware was disgusting. I had to go through multiple forks to see one that looked the \"cleanest\"",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f_nruPbrh2r1mXoKkPa-8w"
  },
  "FNoKRnXMBgyrZGpK2NtWNg": {
    "date": "6/21/2019",
    "text": "The food is and have always been good here. That's not the issue. The issue is the rude staff. I don't know why you hired this one girl back (she currently has bright red hair).. She is rude. What's funny is she picks and chooses who she is rude to. If Carol is still the owner I hope she reads this and other posts and sees the same issue and does something about it. You are losing loyal customers.  I won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SAIPY9ecpPKzBABfpATYqw"
  },
  "7wcUnUCRag7UD9g-6WiJrg": {
    "date": "2/8/2019",
    "text": "So we go here a lot since it's really close to home and our work but last last few times we have come here the lady at the register is always grumpy. She makes us feel uncomfortable and unwelcome. I don't know her name but she's an older gal with black hair. She wouldn't even look at the menu to see what we were talking about, instead just told us she didn't know what we were talking about and made us go all the way to the front to see the specials again to get the exact name of the French toast. Then was very rude when we didn't understand what she was trying to say about a mug or to go cup, like dang women calm down. And if your thinking maybe she having a bad day FALSE she rude to my co worker all the times she has come. Food is great and the prices are amazing but just the customer service needs to be a lot better. Like ALOT better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_A3TLvxzTlMWzMtu1M0mQ"
  },
  "FGdaZ7ofmhdUJ1qUhR8D7A": {
    "date": "3/23/2019",
    "text": "What's great! Called in order was ready when I got there, woman at counter really friendly and the pork nachos were bom",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nhGkzc-DZqxbM6GSsNF0aQ"
  },
  "9g0zf7Xlzw-wNdSs9jleVw": {
    "date": "9/26/2018",
    "text": "Food is delicious! Had no idea this place was here and glad we found it. Will definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cemGtz3DqA46Jw4mP4iG7g",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cemGtz3DqA46Jw4mP4iG7g/o.jpg"
      },
      {
        "img_id": "V5bRbaviyS-88bkxZYQ50A",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/V5bRbaviyS-88bkxZYQ50A/o.jpg"
      }
    ],
    "user_id": "sd2L3NqJvdUVKcOEXlxu-A"
  },
  "tc7esB5lB3tlFfiNNy4yVA": {
    "date": "10/26/2018",
    "text": "Sliders, shrimp and chicken quesadilla, and nachos. Great flavors, the homemade queso is creamy and delicious. Lots of shrimp and chicken in the perfectly crispy quesadilla. Angus beef sliders were perfect on toasted, soft bread. The coleslaw was sweet and crunchy. What a great new find.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "g1nvSyyoysx59GDzaw8r9A"
  },
  "vLmRzK3PbXqYaR3juuATww": {
    "date": "2/19/2018",
    "text": "I recently started a new job in the Tempe area and I'm more than happy to try all the restaurant in the area for breakfast and lunch.  One of the first places I tried was AZ Bread Company for breakfast.  I am so, so, so glad I did.  I love a good sandwich, breakfast, lunch, dinner, doesn't matter. I love bread! Hungry and wanting something new, I searched Yelp for breakfast near me.  AZ Bread Company popped up with 4.5 stars.  I looked over the menu and decided to give them a call and place an order.   There were tons of options for sandwiches I've never heard of.  I like originals - score! I decided on The Phoenician.  The Phoenician is a sandwich that has scrambled eggs, honey smoked bacon, roasted tomatoes, sauteed onions and cheddar on a grilled ciabatta roll.  I'm not a fan of ciabatta rolls at all so I asked the person on the phone what other bread did they have besides white and wheat.  He answered with slight irritation, you can have any bread in the store for your sandwich. I politely told him I've never eaten here before and the bread options aren't listed on the breakfast menu (as they should be IMO).  He sighed, and told me my options.  I went with the Challah bun.  Great choice!  The sandwich was nothing like I expected.  I expected a layered breakfast sandwich with eggs, bacon, roasted tomato, cheese and sauteed onions. The sandwich came kind of omelet style. Everything was all cooked together then put on the Challah bun. Still delicious!  The roasted tomato was a really nice addition to the sandwich. My job is located about 11 minutes from AZ Bread Company. When I placed my order he said it would be 3-5 minutes.  Wow!  Next time I won't order ahead of time, there's really no need.  AZ Bread Company has a check offer.  If you get a free soft drink or coffee on them.  I checked in and redeemed my order.  The man that took my order was also the man at the cash register (I could tell from him voice and his non-friendly demeanor).  I told him I'd like to redeem my check in off and get a hot cup of coffee.  He gave me a HUGE soft drink cup, maybe a 20 ounce cup.  I opted for Dr. Pepper instead.  I'll definitely be returning!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "9pNcdrQLWWrX0vEGGJlEbg"
  },
  "eBFOuwsDQAlGNpGWAixaRQ": {
    "date": "10/7/2017",
    "text": "This place has been my favorite Arizona breakfast place for a few years now. I would always make it a point to come here when I would come visit before I moved here! There service is great and the food comes fast :) the breakfast is always fresh and made the same and just how I like it each time! My go to for breakfast is the Amanda burrito. It comes with some amazing queso for dipping. The carne adovada is also delicious! Egg whites is a option. And of course that have so many baked goods on display when ordering! I would highly recommend checking this place out :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ErZQCAlaxJNVA2_lkkZsmg",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. AZ bread company!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ErZQCAlaxJNVA2_lkkZsmg/o.jpg"
      },
      {
        "img_id": "KP_CaqzTQvZ4D9YTd5UvJw",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Patio :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KP_CaqzTQvZ4D9YTd5UvJw/o.jpg"
      },
      {
        "img_id": "571_YRMrhe_5KZCMFtyMMA",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Amanda burrito!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/571_YRMrhe_5KZCMFtyMMA/o.jpg"
      }
    ],
    "user_id": "rhZb4MbRweF0qVYUoKv_AQ"
  },
  "IYuqBibv3NVdd12qsppXjQ": {
    "date": "8/27/2017",
    "text": "We decided tp try a new place tisthis morning. Walked into a nice atmosphere. Went to counter ordered food the guy at counter was nice. Food came out fast. But as I sat at the table I notice the A/C wasn't working if it was even on at all. Which made me look up and see so much dust on the balls hanging from the ceiling, and we all know that means it coming down on our food. And then a fly came and landed on my plate and I was done eating at that point. Clean the place up and I may come back, because the food was good.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8B7ECGg60PGuBjTZ4S8GTA",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Az omelet",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8B7ECGg60PGuBjTZ4S8GTA/o.jpg"
      },
      {
        "img_id": "guE-HxXksa08d_ini-pJnQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Morning at 10 am",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/guE-HxXksa08d_ini-pJnQ/o.jpg"
      }
    ],
    "user_id": "hbs9bY2xbMicWoNmFthh0w"
  },
  "Stya3krjMxQdCxd_ZevLow": {
    "date": "4/25/2016",
    "text": "If u are in Tempe, it's a must to try az bread co.   Their breakfast is amazing. I loved the whole milk cappuccino. We ordered strawberry French toast and garden omelette. They just nailed it.   We chose to sit outside considering the cool weather, don't ever do that, a big no no. There are flys and bugs around irritating you. They keep sitting on the food and coming in ur way while eating.   Huge concerns on the hygienic ground. Please get ur outdoors pest and insect free.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XbEer0lgVGJ2uU86zGt4TQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Those strawberry French toast is a must try",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XbEer0lgVGJ2uU86zGt4TQ/o.jpg"
      },
      {
        "img_id": "Da9o9jdsmBwuEmxsZE32tg",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Garden omlette, one of the best I have tried",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Da9o9jdsmBwuEmxsZE32tg/o.jpg"
      }
    ],
    "user_id": "McLm1kVpQUcSKzxJt8Vqhg"
  },
  "1rEveUdgCiWwz3Bd0H_OSw": {
    "date": "10/23/2018",
    "text": "My sandwich was $14 dollars and it was about the size of my fist and looked like it was stuck in a microwave for 5 minutes. The bread was cold and stale and the chicken breast tasted unbelievably disgusting. Overpriced and under quality. The older lady working was nice though.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXNfmgYotr8mDOu7R7Uy1A"
  },
  "DeasxeL8GO9kzAkKjQjhmQ": {
    "date": "2/19/2017",
    "text": "Food....awesome! Perfect pancakes and waffles.  The potatoes with the breakfast is delicious. Service...fantastic! Friendly staff, and they move fast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uy__JVd-bnQY0OGDH_bRvw",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uy__JVd-bnQY0OGDH_bRvw/o.jpg"
      },
      {
        "img_id": "99TfYuAP2X3gKNW2Jt06pw",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Strawberry waffle combo, I asked for extra whip cream YUM!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/99TfYuAP2X3gKNW2Jt06pw/o.jpg"
      },
      {
        "img_id": "tv-QyQ1E_hP_7s0kP1jN2w",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Chocolate peanutbutter pancake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tv-QyQ1E_hP_7s0kP1jN2w/o.jpg"
      }
    ],
    "user_id": "Zu4WUgirT2DFjES0mv1Zgg"
  },
  "uoyNLXfe2RRnCjlwl_ZkTw": {
    "date": "3/19/2017",
    "text": "Came here for the first time with friends who highly recommended it. The location is not far from ASU campus, the staff and owners were very friendly. Food was delicious, and portions are reasonable.   The server continuously asked if we were doing okay and even asked if we needed a refill. Will definitely come back here.   As for the food I ordered my own omelette with turkey sausage and mushrooms. Very yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SGobMWMf7xwbOYHL6WMXyw"
  },
  "HFKXFOypqYOzCJwtXHwzlA": {
    "date": "3/7/2019",
    "text": "Good for a quick lunch but it wasnt that fresh. Pasta salad tasted like it came out of a jar and Turkey on my wrap tasted very processed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hzlGZqH7MtU9ZTVd6rxMOg"
  },
  "wzLlt4w1pej2hacv7ctONg": {
    "date": "3/6/2011",
    "text": "Clean, bright and colorful are words that I would use to describe this Restaurant.  Tasty, flavorful and Yum are descriptions of their food.   This is my new go to lunch place! I am also extremely happy that it is 5 minutes away from work, that makes it so convenient as well.  I have tried the following items:  -Turkey Avocado BLT wrap. Even though they forgot the Avocado, which was a bummer, but the wrap was still really good. You can really taste the freshness of the ingredients.  -Fireman Ruben, excellent warm sandwich, they do not skimp on the turkey, it is almost too much, almost! -Carne Adovada, EXCELLENT! Although a touch too salty, otherwise just a simple well flavored sandwich and very fresh bread.  I highly recommend AZ Bread company, and I can't waiting to continue to try their different items on the menu. I am also looking forward to trying breakfast there one day.   It is nice to have a healthy filling option for a quick and/or relaxed lunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VYqRk78kesHn86jPngPUXQ"
  },
  "E-_NtEsnwxrMfqb5_vIW3Q": {
    "date": "5/26/2012",
    "text": "Took my 7 and 10 year old there this morning. 3 separate patrons brought dogs and all 3 let my boy pet them. I only mention that because the whole place seemed filled with happy, and child friendly folks from the neighborhood. The reviews that talk about fast service are spot on. The food and coffee was good, and my most prestigious critics, my kids, said it was better than their favorite place back home. I only give it a 4 because of the lack of gluten free options outside of the standard egg dishes, and the person who took my order didn't seem very knowledgeable about GF diets. Its not all their fault. I was hoping for better options for my daughter who has celiac and yelp had this place listed under Gluten Free.  Good breakfast, great service, and nice neighborhood eatery atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "c1r_BOJ1WHp_8Yx-RGO-Cg"
  },
  "rwBc2WrOEBcrrfYChQh_mA": {
    "date": "5/4/2010",
    "text": "This place is located on the SE corner of Kyrene & Elliot.  After reading the reviews, I was not let down.  The service & food were very good.   The only thing I wasn't thrilled about was the thin crappy bacon.  A place this \"good\" should have a nice thick cut bacon.  Other than that our food was great.    I got challah french toast w/ eggs & bacon and DH ordered The Wrangler.  Their breakfast potatoes are great.  I would love to return, but it's a little far from my house.  I will definitely go back if I'm ever in the neighborhood.  I imagine their sandwiches must be good too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "6U7rvw5thhbrW-bdDslDZQ"
  },
  "9bDagyuMKwT2xh8OMdHEKw": {
    "date": "1/27/2010",
    "text": "This place is simply amazing!  I wish every breakfast place would model themselves after AZ Bread Co!  This place is ultra bright and cheery, which is so perfect for the morning.  There are tons of tables and chairs, so you'll be hard pressed to not find a seat.  The ordering system is perfect for breakfast, you place your order, get a number, and sit down.  The drinks are self serve so it's really nice to not have to wait for any servers when you are STARVING like I always am at breakfast time.  Everyone who works here is quick and efficient, running like a well oiled machine.  Now the food....  Do yourself a HUGE favor and get over here on the weekend!  They advertise a pecan waffle, pancake, or french toast special here on yelp.  I decided I would have that.  BEST DECISION EVER!  It was so amazingly good.  The waffle was fluffy and sweet and the pecan compote was dreamy.  Just imagine loads of caramelly sweet crunchiness covering an already perfect waffle.  Are you in heaven now?  You should be.  I promise it will be mind blowing.  I kind of love this place, as if you couldn't tell already.  I am going to be trying to find excuses to make our way down here more often!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "XNSyl47aXuPsvC5zXm5uhw"
  },
  "G-x5eb5cRRN5EyJbCUzHUg": {
    "date": "2/2/2010",
    "text": "Whoa.  Rarely...RARELY!...is there a breakfast place that I give 5 stars.  It has to be as good as Matt's to get five stars from me.  That is not an easy thing to do but the AZ Bread Co has been successful.  This place is a jewel and should be in every major city.  To start, the setup is perfect.  A long counter to order your food at with pastries visible from the entrance and a large menu.  They take your order and you go sit and wait for it.  No stupid cluster of people in the entrance like at Scramble, so waiting for tables like at Matt's - you order and you wait for your food.  If the place is packed, you can sit outside.  No room outside, get it to go.  You can eat the stuff in your damn car if you like.  They have a soda fountain with Coke and if that doesn't deserve an extra star, I don't know what does. But all of that stuff becomes inconsequential when you start talking food.  The pecan french toast is one of the best breakfasts I've ever had.  Their chalah bread is killer and makes the perfect french toast.  The pecan topping is so rich but oh so good.  I've also had the strawberry pancakes.  They are not covered in a strawberry sauce like most places do it.  Just pancakes, fresh cut strawberries, and some fresh whipped cream.  Yum.  The pancakes are perfect as well. There isn't anything I can find to complain about this place other than - it is far away.  Maybe one day they will open one downtown.  Until then, I don't mind driving 15 minutes to get there.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "m77tEJVLHSyuq3j_cCR3EQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Chocolate chip &amp;amp; peanut butter chip pancakes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/m77tEJVLHSyuq3j_cCR3EQ/o.jpg"
      }
    ],
    "user_id": "-RhRXVW9z9fs5zzxhFfnHg"
  },
  "WWMC6hlJvyj-BgMe6BEalw": {
    "date": "6/9/2011",
    "text": "We LOVE this place. The owner is SO friendly. She remembered us froma year ago. It was chance that brought us here. Or maybe good karma draws us back :)  The food is good, the service is great",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pamMAc_e8H5eVr_C6MeR3g",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Garden frittatas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pamMAc_e8H5eVr_C6MeR3g/o.jpg"
      }
    ],
    "user_id": "7eQI-igrcITOF13sR_7O6Q"
  },
  "H1H_Y_aKr2x8kK3BM0bFLQ": {
    "date": "1/24/2014",
    "text": "I was in the area and had time to kill before an appointment. I asked the girl at the register if there was ham or bacon in their potato cream cheese soup, she said no so I ordered it. When it came, I started eating it and found there to be ham in it. I didn't make a big deal out of it because it's just a preference and it tasted good. I didn't feel the service was at all tremendous. The girl that brought my food sat it down and said the silverware is at the front. Not sure why they didn't tell me that in the first place or she didn't get it for me. My food came quickly which was the best part. The food was fine. I was going to use the bathroom before I left and the girl was cleaning it. I just said \"oh you're cleaning.\" And expected to wait but her response just made me want to leave. She just said \"yeah\" with a rude tone. These are small things but overall my experience was only okay. I would much prefer wildflower or paradise over this place. I won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "7bqipu_K3xy82TDACpKWig"
  },
  "9_xC82X07-B2H03CCLWV0A": {
    "date": "5/9/2015",
    "text": "Great breakfast wraps.  We found this place using yelp and enjoyed a very good meal.  Definitely would recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3M9EiZIXYfpPMNu8RhoIUA"
  },
  "9jacRZVvZ-qmzSOzZeT-pg": {
    "date": "5/9/2015",
    "text": "I don't know how this place got 4 stars. I ordered a grilled chicken sandwich. The bread was refrigerator cold, chicken was dry and had no flavor, and the coleslaw was prepackaged and I couldn't eat it. Will not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6BByS4xsT14UmsEAoqif7A"
  },
  "a15FO4RTcw7wa_nLJx3ejA": {
    "date": "7/27/2013",
    "text": "One word.  YUM!!!  I love eating here.  When I walk in it is bright and cheery and the staff greets me with smiles and hellos AND the food is DELICIOUS!    Here are some of my favorite must try's:  BREAKFAST:  If you are feeling decadent go for the Pecan Waffles.  Oh my oh my how they call my name.  It's like waffles meet sticky buns! If you're feeling like a classic the Wrangler is the way to go:  three eggs, bacon and crispy potatoes.   And when I want to spice up my life I order the Ajo Breakfast Wrap.  It's scrambled eggs with green chili, bacon, onion and cheddar cheese all wrapped up.  So good.  LUNCH recommendations:  The Carne Adovada Sandwich is bomb.  Get it with a side of the chips and caso, this stuff is addictive.     If I'm in a light mood I'll go with the Asian Almond Salad or sometimes they have a gorgeous strawberry salad on the specials board. A great classic: The BLT.  I like to get it with a cup of yummy soup.    So yeah, I really like eating here.  A lot. I like the people, the food, oh and they have a dog friendly patio so you can bring your furry friend and eat in a nice shaded area outside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1U3-vvnJssAC07BfaYp1CA"
  },
  "OEjl8ow88hqw15oacvXFQg": {
    "date": "7/22/2012",
    "text": "Great place to hang out on a weekend morning.  Many great choices.  Good muffins to go if you are in a hurry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wiz1_ro72aIJ3s06ctxzTw"
  },
  "aQZnmkRHOZhWLWOA9j4dJw": {
    "date": "12/3/2009",
    "text": "Five stars for so many reasons.  Upon my first bite, I put down my sandwich and signed onto yelp to write a rave review. However, I thought this was pretty pre-mature and perhaps I should wait, finish my meal, experience the after-taste and then analyze and review.   With the  help of the very friendly employee, I chose the Pick Two - getting a half chicken salad sandwich and a cup of potato cream cheese soup. I waited for maybe, three minutes for my food, when another employee brought it over to me and I was ready to go!  I went again today for breakfast (yogurt swirl and a banana nut muffin) and with these trips I feel qualified to give a meaningful review.  Other than the the friendly/helpful employees and speedy service, the other highlights include -  1) convenient location to tons of offices (one being mine) and next to my bank (Chase),  2) and easy, likeable menu,  3) tons of soups - honestly, sometimes for lunch all I want is soup... and tasty soup at that! 4) FRESH bread - I think people take bread for granted!  Um, okay, so that's it. But seriously, so good. Will be a permanent lunch option for me",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "jVuzlpwKJeslRyc2IpYBoQ"
  },
  "Tprv01ALjDBslOvcpUPNTg": {
    "date": "5/8/2012",
    "text": "Great locally owned restaurant. The owner came by to talk to us and was very friendly. Carne Adovada all the way! French toast was good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bv6M-zBHexwWBiIz-DFK3A"
  },
  "dkweOI22RaFb3Z_-hae12w": {
    "date": "10/18/2010",
    "text": "I'd have to agree with most reviews.  This is a nice little breakfast joint.  I had the Ajo Wrap and a side of AZ Potatoes (home fries) and paid $8.54.  Very reasonable price at a time when a good breakfast in Phoenix can easily add up to $15 per person.  They were both tasty and fresh.  The potatoes had some little pieces of green and red bell pepper mixed in, so that added a little extra to the overall flavor.  The wrap had a good bit of chorizo and the eggs tasted fresh.  The atmosphere has a good vibe (other than the one family in there eating among which there existed one or more of them who needed a shower.  I think that was the exception, not the rule, however.)  I'd definitely rate this among the Top 15 breakfasts in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jfGevhcYLxY13Fa3drpzoA"
  },
  "NwwHtxoKRuwp2yAYHX6KOg": {
    "date": "7/21/2012",
    "text": "I took my mother here for Mother's Day. This is a big deal for 2 reasons A) My mom is a vegetarian and it's hard for her to find things to eat out, and B) She's really picky about quality & service. I had never eaten here, but chose it out of 6 other places I was considering! The main thing that clinched it for me was that it had different breakfast items that most places don't have, and that they had a lot more vegetarian friendly options. So, the day came and my mom ordered the Garden Frittata, which she was so excited to see on the menu and she loved it! I ordered the Strawberry Waffles, which were so good I have really been dreaming about them and looking for an opportunity to go back, and one egg over medium (which they cooked correctly). My Dad ordered a breakfast sandwich, which he liked very much, but said he wished he ordered the Strawberry Waffles once he saw mine!   We went over there at noon to miss the huge Mother's Day crowd, that proved smart because it was not crowded at all.   The only cons were that the people who work there seem terse and not very friendly. It's something I can put up with because the food was so good, but I wish I wouldn't have to. When we chose a seat my mom politely asked a nearby person who worked there to clean it off since there were no clean tables. They seemed affronted at this request. She had also wanted to push two tables together but the person who worked there didn't want her to do this and was kinda rude about it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0fUZqBOTPnILQsaewgt1Q"
  },
  "yV4zRKDRPBqvvRwEyHACKQ": {
    "date": "8/16/2015",
    "text": "This is our go-to breakfast place, and has been for several years.  The owner is very friendly and involved and always comes over to say hello.  The food is excellent.  We always get the Carne Adovada breakfast - it's delicious and you will not be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oT_IwIRyPCTdfYF6ybIcOg"
  },
  "zwDjZwax3CixRMHwWaiKOQ": {
    "date": "2/25/2010",
    "text": "Az Bread Company is as tasty as breakfast gets! You go up to the counter, order your food, grab some drinks, and seat yourself. That is, if you can even grab a seat during their busy hours.  The prices are not bad at all for the quality and quantity of food you get. For 8 bucks  I had 4 strawberry pancakes, turkey sausage and a scrambled egg. I finished my plate because it was so good, but  I ended up being so mad at myself for doing so. Their coffee was good, and they also provide flavored creamers.  They have a wide variety of food from savory breakfast plates to sweet pancakes. They even serve lunch. Unfortunately, they close at 2 pm. So if you want to go and try this place, the best time might be around 11.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TFki-Ix6DroRXaYGUnlMrw"
  },
  "0AoXctYXprpMey25On6nwQ": {
    "date": "5/26/2010",
    "text": "I recently ate here for the first time and I was really thrilled about the menu selection - it took me a while to pick something out for lunch.   I was also intrigued by their list of artisan breads...kalamata olive sourdough? Yes please! The owner, Carol, told me that you can order a specialty bread over the phone and pick it up the next day. It's hard to find freshly baked bread in AZ since we have very few markets, so this was an exciting discovery for me.   Attention tea lovers: Have you ever heard of an iced tea infused with vanilla and blueberries? Call me a glutton but I had 3 glasses of it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lGL3EgeERodFgoXYQfsb7w"
  },
  "9_HcAE1wL6zlipcuLzO_ZA": {
    "date": "5/15/2015",
    "text": "Love the strawberry waffle and coffee.  The AZ potatoes were good too.  We will definitely be coming back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LfvPoL2-m8PbCYyc7MNQ_w"
  },
  "cbaaQTUkzrcYlAESOJECBQ": {
    "date": "5/21/2012",
    "text": "Like everything else in Phoenix, this little place is tucked in a bland strip mall so it looks like just another chain. But don't be fooled by looks -- the food was great and the service amazing for an order-at-the-counter joint. I ordered the breakfast wrap with eggs, ham, and cheese, and it came out in five minutes flat. Eggs were perfectly scrambled, and the diced ham was sweet and smoky. My only complaint was that I wished it had some of the tasty breakfast potatoes inside. Luckily, I was able to steal them from Hubby, who gobbled down his hearty three-egg breakfast almost as fast as the meal arrived. We'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NzXBd2Jol8ZRQkLXv3YoBA"
  },
  "jBjMN8VC2ZuHquu-h3HE0w": {
    "date": "2/22/2013",
    "text": "I came over for breakfast while visiting a friend in Mesa and I was happy I did! The restaurant is bright, clean, casual, and easy.  I ordered the Amanda Burrito which was a chorizo and egg burrito with peppers and onions and a side of the jalapeno queso. The burrito was a great size and it was delicious. The jalapeno queso came out with a film on the top like it had been sitting for a bit before coming to the table. I politely pushed the film over to the side of the bowl and enjoyed nonetheless. The staff was friendly and attentive and we were checked on multiple times to see if we needed anything. I would definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gCWN7s-Qk0mPMjV-0cph7Q",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. Amanda Burrito and the Wrambler",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gCWN7s-Qk0mPMjV-0cph7Q/o.jpg"
      }
    ],
    "user_id": "tvrW0zMsjQgHtTlRP5gBFA"
  },
  "dp1VMHv919Gmv7vUrTg0Ag": {
    "date": "11/7/2015",
    "text": "We Just had breakfast   everything was perfect   as usually  and they are dog friendly so we could Bring our pet with us   they were so nice they brought Him some water  while we dined  on the outside We patio   thanks !  Scott ,Carolyn  and Louie the Chiwiener",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w3mMvCxufj_wZ46UefaDxA"
  },
  "cV2Awgzkx2qLBJsxmXvjHw": {
    "date": "4/6/2010",
    "text": "After reading other Yelper's reviews, my expectations were built up pretty high.  AZ Bread Company is a great place, no doubt, but I somehow feel let down.  Everyone talks about how friendly the owners are and how they've been approached by them to ask how their meal was etc.  One of the owners was out cleaning and bussing tables and he talked to about three families right next to me but never came to ask me how my meal was.  Whatever.    The place is set up like Jason's Deli or Chipotle in that you line up and order your meal then fetch your own drink and finally seat yourself.  They give you a laminated number tag that you can place at your table and when your order is ready they bring it to you.  They don't (or didn't for me, at least) bring your silverware to you.  I thought that was kind of lame.  They didn't even offer upon delivering the food and noticing that we had no utensils to eat with.    The food, however, was definitely way above average.  I had breakfast there with my daughter and she had Strawberry French Toast and I had the breakfast special which was a breakfast burro with eggs, chorizo, cheese and a couple veggies.  My daughter had a bottled cranberry juice and I had coffee.  The total ran $18 which is way more than reasonable for breakfast of this quality.    I like drink stations.  I like being able to get a half cup 'warm up' and being able to get up and look around as I get my drink.  The big windows here are great for the ambient light they lend to the experience where you're eyes aren't hammered having to adjust to artificial light in dimly lit places.  The place is really colorful as well which is very inviting and festive.   All in all, it's a very safe place to bring your old ass grandparents and sketchy inlaws where you don't have to worry about freaking anyone out with a bad breakfast choice.  This place screams 'www.stuffwhitepeoplelike.com'.    You probably fit the demographic, so go there.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "HpJtDEot0t_zIMS3_yBUfA",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. strawberry french toast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HpJtDEot0t_zIMS3_yBUfA/o.jpg"
      },
      {
        "img_id": "cwQG8iIhdNKRTI-h1MQZ7g",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. breakfast burro",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cwQG8iIhdNKRTI-h1MQZ7g/o.jpg"
      },
      {
        "img_id": "HbZS4CAx9gY8WZfs7ZY9NA",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States. coffee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HbZS4CAx9gY8WZfs7ZY9NA/o.jpg"
      }
    ],
    "user_id": "aEb5K81mux5hl_b8dex2rg"
  },
  "eOKnW8_yv65K4wu90XDUHA": {
    "date": "5/19/2014",
    "text": "I never been here before, even though i work two block away (at a different breakfast/lunch restaurant). I like to go to breakfast restaurants on my day off to see how they stack up. Az bread company is a solid breakfast provider.  Its an express style place, you order at the register, pay, they give you a number placard etc. There are a few healthier choices, my wife got the power wrap, spinach, mushrooms, eggwhites in a spinach tortilla. They also have traditional breakfast staples. Skillets, omeletes and the like. Its a smaller place, in a strip mall suite, with lots of windows and natural light. And every table has an electrical outlet. Seems inviting to people interested in using laptop or tablet. Not sure about wifi, i didnt ask. In summation, az bread co. Is exactly what they advertise, and all the employees seem happy to be there, and those are my requirements for a 5 star review , so there you have it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "3I-OTb3ElEiJHEUhOfQIZw"
  },
  "fJX2V27jt-Dl76ixe5mpDA": {
    "date": "5/24/2015",
    "text": "The food was ok. The Rueben was very salty. The customer service was excellent. A young lady named Reece was outstanding. If you look at my review, you'll see that I'm big on customer service. If come back to this place because of her service. I noticed she was a cashier and buser. She was actually scrubbing the sides of the tables to make them cleaner. I hadn't seen that before.   Check the place out and you should enjoy it",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k3L2XLZLRZBdP_kEICx9Hw"
  },
  "AEGqOiNYCuVQforcGn7BXg": {
    "date": "10/11/2014",
    "text": "Every time I go here the staff is always so warm and friendly. Great soup and sandwiches. And the pumpkin bread was legit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9GG6PqSK3HmmA5CTYNfC7g"
  },
  "dDZ_zf0ZeywrUYSlQLjf1A": {
    "date": "7/24/2016",
    "text": "My husband and I have been going here for awhile now and until today there was no real trouble. After this mornings HORRIFIC experience I doubt we will return. After placing our simple order, we sat down and waited. after 20 minutes and a table of folks who came in after us being served we inquired where ours was and we were told you are next. Another 10 minutes and more folks who arrived after us being served so inquire again and told next again.... after the fourth table being served and 45 minutes we had enough and just wanted our money back. no one ever apologized for any of this. Then while waiting for a manager to apply the refund the expo person, who I suspect lost our order, approaches us and begins verbally assaulting us to \"leave her store with our attitude\"... attitude? no attitude given just frustrated and hungry!? 45 minutes for eggs and already prepared carne adovado and queso... wow is all I can say",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWFhAAYDiaewDBHfRBiJPQ"
  },
  "1KbOQYipQKIYyMoi5r4BuQ": {
    "date": "7/31/2014",
    "text": "I ate here 4 times this week due to its close proximity to where I was working. I tried the strawberry french toast one day and the classic breakfast sandwich with bacon another day. For lunch I had a salad and a soup/ sandwich combo another day. The only thing I didn't love was the egg salad sandwhich. It was rather bland. Otherwise,  everything was very fresh and tasty.  The staff recognized me after my first visit and were friendly and helpful. A nice spot for breakfast or lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cU2DhDCjG5g_Mst776eCow"
  },
  "dfBKpLJgtEQ_jVextVBsJA": {
    "date": "8/17/2016",
    "text": "Great stop after church! The twins loved their French toast sticks that were HUGE! 1 is perfect for them. Hubby had some meat infused omelet with pancakes which he cleaned his plate and I did potato cream cheese soup and Caesar salad. Excellent!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "85hdryxB5oct0UJwRWnUWw"
  },
  "-FKlsL-QvK2G38FWaf2FrQ": {
    "date": "5/12/2015",
    "text": "So I found a new spot to frequent regularly. The garden frettatta and strawberry waffle were amazing. I was shocked at how good everything was. I want to come back just to try everything else on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8GKODV2omcrux2tpHuTtQ"
  },
  "07DmvG2rQ-ZsAaSUE_CShw": {
    "date": "8/13/2016",
    "text": "We showed up just before 11am for breakfast and the fairly rude order taker told us that they would not serve us breakfast becuase they stop breakfast at 11.  When I mentioned that it is not yet 11, she said we don't want to make any more breakfast.  She was not even nice about it, clearly lazy and did not want to be bothered by another order.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "se-ymSdZ-soHDfVNJ7DKXw"
  },
  "Ap2hEp0LKAOzyfU6YIFGoQ": {
    "date": "4/25/2015",
    "text": "My boss brought some for breakfast. They actually tasted better than Einstein Bagels. The only advice I can give is the containers used for the cream cheese is to small, and they don't pack it all the way full, a lot air pockets.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DwQaWHNL_CYrf4WavIEMVg"
  },
  "BFvcWNAiKqBNcs-dqmjaGw": {
    "date": "9/6/2016",
    "text": "Always great food, outstanding staff, outside seating is nice too. This is my favorite light breakfast spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l9_S9BX1SxilOAbq755f7g"
  },
  "FdlLI9kLQT5CvAjUABHplg": {
    "date": "6/27/2015",
    "text": "Three stars for the effort. Limited vegetarian options, no vegan options (and a limited knowledge of what is vegan). But they tried to figure out something. None of their breads are free of animal products, so just trying the bread at home with our own daiya wasn't an option. :(",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nBQUz8htNY258o0LQos1PQ"
  },
  "9G7xaSmkJ9s_JiYv65EGEw": {
    "date": "3/26/2012",
    "text": "Cute little breakfast place in a strip mall in Tempe (side note - why is everything down here in a strip mall?).  The atmosphere is open and airy, and the staff friendly.  We went for breakfast and while the sweets were tempting, I chose to go savory - I was very pleased with my build your own omelet, but I confess I was eyeing my friend's challah french toast as well.  He said it was good, and the eggs florentine also got a good review.  When I find myself back in Tempe, I'll be headed back here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tBBogzrotUdkTwmiOXWtNw"
  },
  "YUHjMVWgAoVRCNmIUzEt1Q": {
    "date": "12/11/2014",
    "text": "We love this place we live right around the corner and at one point was eating here every weekend. I love their Eggs Benedict with spinach!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y4gTzn-C86iJ_3HUN0eCGw"
  },
  "fWTJeC_HSwv1JX6HuQ6O_Q": {
    "date": "8/20/2016",
    "text": "My daughter and I visited this great breakfast place in Tempe this morning for breakfast and it was great!  They had gluten free bread so I had the French toast with fresh strawberries.......FABULOUS!  The staff is warm and friendly.  I will be back the next time I am in Phoenix...what a gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zYDBklBf8cF8KnjtWSchRQ"
  },
  "TcKGfjxbqfD6SV1bvACTCw": {
    "date": "7/19/2014",
    "text": "Ten years of amazing breakfast memories!  Wonderful service,  never disappointed in the quality and consistency of there menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GQcVhdO27tvsYzeWl6Jj3A"
  },
  "7S94QCPXq3vkEf71Qzn_WQ": {
    "date": "7/18/2015",
    "text": "This place is delicious!! The atmosphere is general cafe typeish but the food is amazing! Fresh foods, excellent service. And truly caring staff. Amazing. Try the egg fratatta!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aINTEtxnpg2GEztCYLi0-Q"
  },
  "8Ctc0AQWM6FcVE2Rz3nv1w": {
    "date": "7/13/2014",
    "text": "Great food. Great service.  Great prices.  We always go there for our special occasions.  We've tried various dishes and we've never been disappointed.   Also dog friendly and great space to hang out with friends snd family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "weyBuHAxl5ltGeGnyF9B4g"
  },
  "EHmSXuE6p7T3488yaDmp6g": {
    "date": "11/5/2015",
    "text": "Such a nice and friendly staff! I walked in 3 minutes before closing and they were kind enough to take me and were more than accommodating. The manager/owner was the nicest woman. I had a cold and ordered some soup and she was very sweet and repeatedly told me she hoped I felt better. The chicken noodle soup I ordered was great and definitely homemade. I will come back just for the staff!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "73glAiJwJwBMOGQo1CuZYg"
  },
  "lklpwH9W3lYGm7nddtcDuA": {
    "date": "12/12/2012",
    "text": "I really like this place but wish it didn't close at 2 pm- I'm not always good about taking my lunch at a reasonable time.  I've had several sandwiches and wraps as well as their ceasar salad and I've been satisfied each time.  The service is usually very friendly.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "pvphI9tOMc8wEmJLZe5VjQ"
  },
  "uOPAdYEutVIEclHh5x7TPg": {
    "date": "6/30/2014",
    "text": "Super tasty breakfast, super fast and excellent service. Cool spot and family ran! Would eat here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ly7Ve5G0qYy9m0W7sGEpJQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ly7Ve5G0qYy9m0W7sGEpJQ/o.jpg"
      },
      {
        "img_id": "UT0jULBN-KV6mcWWcVd5nQ",
        "caption": "Photo of AZ Bread - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UT0jULBN-KV6mcWWcVd5nQ/o.jpg"
      }
    ],
    "user_id": "vgyhcCAzOz8N5hD_lYLZTQ"
  },
  "Z0FI0AS-q5b2sZeq0G5WYw": {
    "date": "9/2/2013",
    "text": "This is our favorite place to eat breakfast. We eat here every other week or so. The food taste great and the staff is super friendly.   It's also a great place to take young kids. We take our toddler to eat, and we likes the potatoes. This is a pay first restaurant, so if our kid gets cranky we can leave whenever we feel like it.  AZ Bread Co is highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dvGYIN5LCj-Rwd8Wps2aWw"
  },
  "MVqzf-oEC2B4dmHZS4RFoA": {
    "date": "12/4/2015",
    "text": "Been there twice so far.  I've had turkey, bacon, avocado on Chiabata bread and tried the potato soup.  I really liked both.  I thought the turkey tasted like it had been roasted right there but I don't know.  Most places use processed turkey.  Any way sandwich was delicious and soup had a wonderful flavor but could have been a bit thicker.  Potato soup is supposed to be thick and hardy.  It was delicious though.  The owner is very nice and friendly.    I'll definitely come back and try breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vH5LDtOcYfP85gnsjhwRQw"
  },
  "aAhst6kzzvzD3dxkklChYw": {
    "date": "11/4/2014",
    "text": "I wanted to like this place and I hate writing bad reviews for local establishments. I work a couple of blocks away at university of phoenix and thinking this place is the same as the az bread company that comes to the downtown farmer's market I recommended this place to everyone. I had never been here but figured it had the same quality. it does not.  I come for coffee sometimes and first of all if you are going to do specialty coffees and compete with dutch brothers and starbucks learn to do it right. I don't mind spending 3-6 bucks on coffee depending on what I get but it for sure needs to be good. I got a couple of their frozen drinks during the summer. They have little coffee in them. When I asked for an extra shot I was informed it is $2 a shot. Um again dutch brothers on rural and guadalupe. Go there instead and it's $0.50. Now back to the coffee experience. I went again today thinking how bad of an experience can a basic iced coffee be? It's about $2/60 for an ice coffee so not that badly priced, flavor is extra. I asked for a large. They don't do large except in hot coffee. So if you want iced, which is plain coffee dilluted with ice and water you can only get a 10oz coffee. Excuse me???? I asked for pumpkin flavor and either they charged me and only put in half pump or never put it in at all. I asked about it and the lady says 'oh well you wouldn't be able to see the flavor.\" mmmmk but in a quality establishment I should be able to taste it right?? I call foul here. Terrible place for coffee.  Ok so now onto the food...  The sandwiches are lackluster. My friend got a grilled cheese and a drink which was almost $10. The grilled cheese was soft and not grilled at all. Do we see a problem here? My bagel was grocery store quality. Another co-worker reported getting an iceberg salad. I just don't understand how this place survives with so many good places in this area.   If you want coffee go to dutch brothers. If you want baked goods go to the croissant place down the street, and if you want a good basic sandwich go to the safeway a little further down. But skip this overpriced 'bakery'",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ViNWM8Iwoe92cU_p1-2GeQ"
  },
  "Jxqi8_z7fxQLtdpy1XFS8g": {
    "date": "2/7/2017",
    "text": "I frequently dine here and the food is great for breakfast and lunch. The patio area is nice and pet friendly (water bowls for dogs are available). The service is great most times. When the place is very busy it seems the rush puts the kitchen staff behind and there is a very LONG wait for food. Page and Reese are great staff members and always make sure you are well taken care of! The owner is also very engaged to ensure guests are satisfied with their overall experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aI6wIAzUKw9-B0ZbYwtcwg"
  },
  "8APeTIVTdICsqmxzutEiVQ": {
    "date": "2/11/2013",
    "text": "I rarely take to Yelp to complain but today is a little different. I ordered the Tempe panini and Tomato Bisque soup for lunch today and prepaid via Living Social. I was there to pick up right on time but it looked like my food had been sitting for a few minutes on the counter, not being kept warm. My panini is cold but the soup is hot. Not very impressed with the flavor of the sandwich but the soup is very good as always. For a $5 sandwich, I also expected a little bigger.  So, one star knocked off for the panini. Another knocked off for the service. The first time I called to find out what the soups were, the girl couldn't hear me so I called back. The man who helped me was gruff and short on the phone (I thought it was a reasonable question since the soups aren't posted online but oh well). When I came in, the line was long so I was patiently waiting til I saw the \"ring bell if you ordered ahead\" sign. I rang the bell. Quietly, without demand or force. I got no reply. I wasn't going to ring it again even though I assumed they didn't hear it since there was no acknowledgement but someone else in the line commented that since the staff didn't say anything, they probably hadn't heard it. So I rang it again. A little louder but not slamming my hand down on the thing.  The man responded \"I heard you the first time!\" as if I were ringing and ringing and ringing in a rude manner. I was taken aback but not surprised; the service here isn't that great but that's why it's a counter and not table service, I reckon. I did not expect, nor did I appreciate, a side of chastisement with my lunch",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "r_AMHUIn6XhXcit90Axb7A"
  },
  "yhD-QkSbaGevyPNfI99MUQ": {
    "date": "2/17/2013",
    "text": "Excellent food and excellent service. Totally affordable. Convenient to I-10.   All of the people were really nice and very helpful. There were so many extra appealing menu items and the ones we chose were Delicious!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ox_68nj1ByJxTSUuY0p3tg"
  },
  "KvDZnD5PmXa2Hiw3zLLf_A": {
    "date": "11/8/2014",
    "text": "I decided to try this place and I am happy that I did. The man who took my order was very helpful and made an awesome suggestion for my friend and to try the Jalapeno Queso and chips. We both agreed it is delicious. I had the \"Scoop Salad\" man, was it delicious the veggies were very fresh and the dressing was amazing. The next time I went in I had the \"Sedona\". It was amazing. Give it a try. A co-worker brought in some muffins from here one day and those were so delicious and very moist!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "hRfveuuUwvGX9K-TIapbKA"
  },
  "lMSqJnn6wKhYlBdS1_bfDw": {
    "date": "8/20/2015",
    "text": "This place is awesome, I have had their sandwiches and they are amazing. The surprise was their burrito, with cheese sauce. Maybe you have to be an Arizona native to understand why it tastes so good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JHa6QhwsnQ3tBfoHwz9pJg"
  },
  "iD6QLXrCe5RosLtWrkHTVA": {
    "date": "10/9/2015",
    "text": "On my way to work I would stop in this place to get a muffin. Pretty decent apparently made daily. They also serve pancakes and waffles. Twice I've ordered scrambled eggs and cheese and twice I got sort of a omelet with no cheese kind of brown on the bottom. I like omelets when I want one, but I ordered scrambled eggs with cheese. You can cook eggs many different ways, scrambled eggs should not taste or look like omelets. So google how to make a omelet or do a 2 hour how to cook a freaking egg class. The home fries are deep fried cubes no onions, peppers or herbs, basically French fries but tasteless. Sometimes on Friday I treat myself to my favorite meal of the day, breakfast. From here on out I will only buy their brand muffins. 2 stars because staff is ok. Who ever owns this place should put more care into their kitchen staff.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LHeoCkV4TKvn4TOqgUedJw"
  },
  "BozhGvRon8WiQSJd3_SohQ": {
    "date": "12/10/2014",
    "text": "High quality breakfast food at a reasonable cost. The Amanda burrito with chorizo is my favorite.  The burrito includes a spicy cheese sauce for dipping.  During my first visit the owner introduced herself and asked if i needed anything.  Good service and good food.  I recommend this place for people who want solid breakfast food without any frills.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5Ovmzw7yPhOKkpKylB8iSw"
  },
  "7DZemeA9FHg5bs9WqNz8NA": {
    "date": "8/14/2015",
    "text": "Had a chicken sandwich for lunch and it was pretty flavorless.  I may come back for the breakfast in hopes that it'll be tastier.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EdtyNDmF-0dkXrI9dToG6Q"
  },
  "TQqCdUMB10DUGamXN3KCpQ": {
    "date": "10/6/2015",
    "text": "Its an awesome place, staff are very friendly. and they took good care of my dog as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CwprQwBGgC6wIAzomOIJYA"
  },
  "Y9G-WYuA08XEuevYoKj53A": {
    "date": "6/25/2014",
    "text": "I stop by here for breakfast every once in a while and it is always decent, but not great.  It is quick and tasty though if you are no able to sit down for a full meal.  If you have time, head down the street west a couple of blocks to Crackers.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "BqE21d_vGACZFU2U8dCRSw"
  },
  "xo6mEuE_bGJNPfBtZOIe0g": {
    "date": "7/20/2015",
    "text": "Visiting here from SD and decided to yelp a breakfast place that is affordable and delicious, well this place IS IT. The Garden Fritata and Choc Peanut Butter Chip Pancakes are a MUST TRY........Yummy! The service is great too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WGIKwbBu1jiARMs4Y3r2DA"
  },
  "KW9N_J-R0HBXuoodv6DQow": {
    "date": "7/12/2015",
    "text": "This was my first time here, and the experience was excellent!  As soon as I walked in, I was immediately greeted and it made me feel good about my decision to try this place.  The staff is very friendly and welcoming.  There's plenty of seating as well!  I tried the Amanda Burrito.  The burrito itself was already tasty, but the side of queso that it came with made it perfect.  Beverage refills were conveniently accessible with the fountain machines not being in the kitchen.  Pricing was very reasonable (approx $9 for a burrito and fountain drink).  I would most definitely be coming back here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "He-rUJzLjcFQaa_xPcJrQQ"
  },
  "gr-kwUefc-23VwXc_ySsoQ": {
    "date": "7/10/2013",
    "text": "Great food at a great price and always with a smile. The atmosphere is bright and friendly. I have been going to AZ Bread since it opened and there isn't a better breakfast or lunch place in the Valley. It just doesn't get any better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0uT9dQk9WpqqmJRb8qzBmg"
  },
  "0skr5ObWq4y9HJKTI0xuuA": {
    "date": "11/15/2016",
    "text": "We come here every weekend for breakfast and the food is always good. It is served fresh and fast and with a smile! The only reason I gave it 4 stars instead of 5 is the girl at the register on Sunday mornings is very rude. She is a young girl and just looks annoyed every time we come in. I know they were training someone else when we were in last time, so hopefully they put her in the kitchen away from the customers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ueQno8k90_0VCet6XQ-k3A"
  }
}