{
  "QK0g-5DXry2oanrnrmS-dQ": {
    "date": "12/22/2012",
    "text": "Like other reviewers I find many of the waitresses rude or ill informed, but the bartenders are awesome and the owner seems like really great guy.    Can't say much about the food as I always have a pretzel, but that is yummy!    My favorite part is that the beer selection is always changing.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GhkEWFB3k-6e9Bipf2Vd2w"
  },
  "NXpXje-0avkBAs2X2XBVtQ": {
    "date": "3/15/2012",
    "text": "Nice little strip mall bar & grill. Has a great craft beer selection, good food and very good service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "6bcScVQIVishxonzoBN6sA"
  },
  "5lpd2_uqbT9AlrXlo1tGOQ": {
    "date": "9/21/2015",
    "text": "I would not recommend Flannys for anything other than beer. Make sure to go during happy hour as their beer is incredibly overpriced. Do NOT make the mistake of eating here. Also I've been multiple times when their Tap Hunter app was not up to date and the beer we came for had already blown.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FIAgEDH98ajFWagDDxiznw"
  },
  "NuCjdminXx2KEFhTrt0Q_Q": {
    "date": "1/20/2013",
    "text": "Flanny's is a great neighborhood pub. Most pubs you worry how clean the kitchen is, the bar crowd is cliquish and the decor resembles a basement bar. Not Flanny's. Flanny's is a clean, modern welcoming local pub with high def TVs, great staff, craft beers and bar, table and soft seating. My favorite aspect of Flanny's is that they support live music.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1DXeKkpX_dZ4MvjCU0hrGQ"
  },
  "hwJTEuctd3Vb3pRQBFNu4g": {
    "date": "9/21/2013",
    "text": "The owner is not personable whatsoever. He does not care of recognize returning regulars. The staff he hires are all super rude, and don't want to help or serve you.. Every time we go in there , there is an issue. Horrible service,and  horrible owner. Do not waste your money there, its not worth it at ALL. Go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_uLie1T5FHHrLe3DBtfgKA"
  },
  "o1nLRX8FR11pQMi9wJQhDA": {
    "date": "11/24/2012",
    "text": "You can depend on having interesting beers on tap at Flanny's.  I really like their \"flights\" since you can try six different beers without having to get full glasses.  The food is good, I do love the sweet potato fries.  Its a great place to go after work, or meet a group of friends.  Usually not too noisy, and they are always willing to accommodate a group.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIUkBU0f0proUUVp5qtL2Q"
  },
  "rPEc-Zk19bvRNQl1g-3xjQ": {
    "date": "8/2/2012",
    "text": "Great beer, good food and a amazing staff. I don't get in here as often as I'd like to but every time i'm in Jon has something new on tap. If you are in south Tempe, this is the place to hangout. Try the fish and chips, it's still my favorite dish they serve.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "H9g0ztsdJ5dAIk8ea9YSkw"
  },
  "Eaybdi7B1N8G8c1FPvd5tg": {
    "date": "1/8/2012",
    "text": "What a pleasant surprise.   Great and ever changing beers on tap.  Nice open decor and decent bar food.  Flanny's has become a go to place for a quick bite and a brew.  It's a whole lot nicer than the last few occupants  at this location.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "r5_CTQSAVfhIo8IUSsFRpA"
  },
  "E5DXNDUsVeR6Yk0mqscmZg": {
    "date": "5/20/2013",
    "text": "Servcie is kind of lacking. but the atmosphere and food are very good. Lots of beer selections and menu items to choose from. We will be back again for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TDJs2eyQaEzIn_q3iBKDgw"
  },
  "-iIEbQRGThMaN12LCbVWuw": {
    "date": "9/18/2014",
    "text": "I absolutely love this hidden Tempe gem! Great burgers, but I wish the fries were  thicker. (I understand they recently changed them.) Otherwise, good stuff, excellent service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hauLZrTzO0BenlGqepjRUQ"
  },
  "gU3PAvdRRHA_El8Mk9pERA": {
    "date": "8/2/2013",
    "text": "Awesome craft beer selection. Try the odell double pilsner",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oMP23bOBPL-ZwV8qRSx5gA"
  },
  "OlJiTmNyhuzD3isb9zWgBQ": {
    "date": "2/18/2012",
    "text": "Flannys we're back in love again. I've sulked back to you on a few occasions...and you've always treated me right. Your beer selection is all that and your wings are straight up the bomb.  Your bartenders are attentive and take care of me, whether your packed or not. So, Flannys, I'm back, will ya have me?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oFNrutUnH52gaDi4ax0WXA"
  },
  "wYHhIqXnngaSb0DVRiAQDw": {
    "date": "8/8/2012",
    "text": "Second time coming into Hanny's tonight and it was superb! The place was packed when my husband and I pulled up, but we were seated right away. Both drinks and food came out super fast! My husband had the barbecue bacon burger and I tried the chipotle chicken Mac and Cheese. Both were delicious!! Will definitely be coming more often! Saw a a sign that they had trivia in Wednesdays, so will probably come check that out!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3n4A_CmCbWcCwe_ilqb9cw"
  },
  "yTlP-34MlmnO6-z-utfkdg": {
    "date": "4/5/2012",
    "text": "I love this place. Possibly another new favorite place of mine! Jason and Lindsay were amazing servers. They have trivia on Wednesday nights and the place was full!!! I tried the beer sampler which was great and fun. Also tried the nachos they weren't really anything to write home about. Had a great time here!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EDJCkHCWKZO5rO5uEjokVw"
  },
  "bEco6JPvSppTiH_2OdlgBA": {
    "date": "5/19/2016",
    "text": "Normally would never rate this low but the owner is an ass.  Food is ok and Beer is good but we've always felt this weirdness whenever we patronized the establishment.   Today I now understand.   My 8 yr old daughter and I went in at 6 pm for dinner.  I told the hostess that we were meeting a friend in 10 minutes.   She proceeded to sit us in the back at a 2 top and explained when our friend arrived she would move us to another table.   There was an event going on and the owner instructs her to do this    I complied and was ok with it until 2 minutes later she sat a couple that walked in at a 4 top 2 tables away.  Inquiring with her as to why the couple was just sat at a 4 top and my 3 person table is sitting at a 2 top was apparently not appreciated by the owner, Mr flanny.   He saw me talking with the hostess and proceeded to tell me I had an attitude.   I'm sorry mr flanny.  I think you are the one with the attitude.  It was rather incredulous to hear.   Listen, the beer is good and some food is ok.  But atmosphere really needs work as does the manners of Mr flanny.    You lost my business and anyone else I can convince.  Long story short. I took my daughter and business elsewhere as I would recommend you too as well.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xx8QVBlz99uvJHPnpN5uGA"
  },
  "ObF3P_0ZALYErfqnfZiu0Q": {
    "date": "9/5/2014",
    "text": "I had been contemplating between 4 and 5 stars when it just came down to this: I have NEVER had a bad experience here!! The food has always been fantastic, the beer is always incredible, and the service has always been great! This place has never let me down and I always leave happy. I love Flannys!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "F_vpwqK84dm7vx43ZZK6pg"
  },
  "8vwFs2vyHkap4r1p_ffUEA": {
    "date": "12/20/2013",
    "text": "this place isn't terrible, but it's not good. my beer connoisseur cousin came into town, so I took her here and I feel really embarrassed. the beer selection was super limited because there was a tap takeover the night before. I had the turkey blta, which was the most bland sandwich I've ever had. we also had the flanny's favorite burger (lured by the sunny side up egg), but the yolk was almost entirely cooked (what's the point in that?). the fried pickles were mediocre, as well as the chipotle aioli that came with it. maybe I had a pretty bad impression because of the live music, which i could best compare to a vacuum... it was loud and it sucked.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "waGF8nY6Enpjg4KOAZJWAA"
  },
  "1nXBKsJNw7SV3sevaDFQbw": {
    "date": "2/7/2011",
    "text": "Flanny's leaves a bitter taste on my tongue.  I have never heard of this place, but after being there, I prefer to experience a momentary lapse of amnesia and forget that this place EVER existed. I am not complaining about the food...my focal point was a couple of drinks, and then partaking in a huge buffet of sorts...but I have a personal vendetta against the service that is offered in Flanny's.  So, picture this: a large table filled with people, sporting their Packers jerseys, some indifferent towards the teams playing in the Superbowl, and one very determined Steeler fan. It is all chaos and nonsense, with people yelling and hooting, drinking, glossy eyed with the mouth watering prospect of their team winning the game. Then, I enter. So, immediately, I decide to order a Long Island and I don't gulp it down, but I nurse on it. And after I finished, I ordered a second one and proceeded to finish that one, as well. The thing is, I didn't completely finish those drinks. But that isn't a matter of importance. Then, a good friend of mine arrives, and since our table is full, we find a small table that is directly adjacent to the table I was previously at, and we order a round of shots. I wasn't buzzed at all. Honestly, I have a high tolerance, and the terminology that was best suited for me was erring on buzzed, but more tired than experiencing any direct effects from the alcohol consumption. Then, I proceed to order the next round of drinks, and the waitress tells me that under the order of her boss, I'm cut. What? I was walking fine, enunciated my words with a crispness that I can't acquire in my sobriety, and I was being cut? Then this witch of a waitress tells me that her boss will come to talk to me, and then explains that, with my stature, the amount of drinks I consumed (1 and a half Long Islands, and a shot of Sex on the Beach) would be impossible for me to handle. I immediately had a dreadful vision of being led away in handcuffs, but after that twinge of fear, I realized that I didn't do anything wrong, and I was pissed. She put a damper on my Superbowl experience. Some of my friends were upset. I was upset. We quickly moved to the Vine, and I can honestly say that what Flanny's lacks, the Vine makes up for it. I even complained to a few people about Flanny's. Revenge is sweet.  Flanny's, you have lost a lot of clientele. It wasn't only my experience, but amongst my crowd of friends, several of them complained about lack of quality service. I was tempted to chew on a piece of bubble gum and leave that as her tip. So, take that!  (I stole this idea from a couple of close yelpers of mine, that bestowed this punishment on a waitress that didn't deserve anything.)  /end rant.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 10,
      "cool": 3
    },
    "photos": [],
    "user_id": "HxTg2mFLBkrKmnE4tK0wSg"
  },
  "Wp9LvJ-g549qEZhV_gk5ZA": {
    "date": "2/18/2013",
    "text": "So we are new to the area and were out and abt bar hoping on a Sunday. We came across Flanny's. While I will give them a positive on the beer selection ( certainly not the biggest, but ok for a strip mall bar) they are on the pricey side, I mean 8.00 bucks for a beer could add up! We where there along with maybe 7-10 other people, so it wasn't busy, but it was also 3:30 in the afternoon. Upon entering we also noticed 5 toddlers running around while their Dad was sitting on the couch in front on the TV...not really the type of place for little ones in my opinion! We ordered our drinks from the bartender, whom seemed to have a major attitude from the start. We had a few questions abt a couple brews and it seemed like we were bothering him for an answer. Like I said it wasn't busy. Got our drinks and the hubby decide to play some songs on the Touch Tunes player. Played 5.00 worth. So his song choices might not have been everyone's choice of music, but lasted I check the Tunes player was sitting on the wall for public to play, right? The music was not loud at all, more background than anything. Half way through the song, the bartender turned it off and the waitress said, oh thank god you turned that crap off, it's shit music! I politely said I am sorry you didn't like that but my husband just played 5.00 bucks worth of music to listen to while we drink our 20.00 dollars worth  of drinks. Not a second later she came over with an attitude and THREW the 5 dollar bill at my husband and said nothing! I am aware that not everybody like the same music, but the attitudes of the bartender and the waitress( who by the way was just sitting there doing nothing) were uncalled for! You listen to the song and move along, if you don't want people to play anything other than the soft indie music that's playing don't have a Touch Tunes player. We asked for the bill, did not leave a tip and left and went to Boston's. While it  may be a dive bar, I would rather sit at a place that people aren't so uptight! Get over yourselves Flanny's your a strip mall bar with bad food and a few good beers!!!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "akbXeYDnw1IsdKm7tAI0hg"
  },
  "w8wqggIuLS27-gp-WbLHWA": {
    "date": "6/3/2011",
    "text": "The best neighborhood bar in South Tempe.  Great beer list with regularly changing options, many on tap.  Knowledgable and polite bartenders.  Good variety on the menu, and the few things I've tried have been good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6lirR6xs_79DSLNUscBSg"
  },
  "YgnGznwfl-K6WUuv1WWEvA": {
    "date": "6/15/2014",
    "text": "Beer Mecca! What a great little locally-owned business with a kick ass beer selection!  The staff is well versed on beer and the food is high quality and interesting.  My personal favorite is the Chipotle Mac and Cheese.   P.S. Great people watching and super friendly crowd.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "SqSj-Qi4j8nWA451A5NxdQ"
  },
  "jvKB0SZf3IJwvUOQns_SHg": {
    "date": "3/5/2012",
    "text": "Packed.  The beer list was great. Food: eh, it was bar food.   Staff at the bar: awesome.  Waitresses: terrible. Granted, it was busy, but i have friends who have been there when its dead and had the worst waitress experiences.  Sit at the bar.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "vPOkQJKahhR13LQ2ElSFGg"
  },
  "hPvNGq7AwaE9kKqJvhYfow": {
    "date": "3/12/2016",
    "text": "We were looking for fish & chips tonight and found Flanny's on Yelp.  The pics looked yummy, so gave it a try.  We couldn't have been more please with you visit!  First off, LOVE their focus on beer.  So many options...will get a 6-beer tasting next time.  Secondly, loved our food.  Salads were fresh, dressings tasty, salmon on my Greek salad grilled to perfection, and the Fish & Chips were A-mazing.  The batter is flavorful and watch are dipped to order.  It came with deliciously crisp fries and some cole slaw.  Love that they have a Make-your-own Mac & Cheese nights on Tuesdays and Tap Takeover Third Thursdays.  Staff was attentive and helpful.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1dpc-M_ZtuE9f4k9DY1dpQ"
  },
  "tpBtrVhDgvYX9zlMdOycaQ": {
    "date": "4/29/2014",
    "text": "I adore their tap takeovers. And they always manage to have some tasty craft beer when we drop in. But the food is not good. The hummus is all garlic. Sandwiches use frozen chicken. We always head over for Yupha's Thai after our yummy beers. Would love a menu makeover to go with the next tap takeover! Even a few fresh fun items would help.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SohYMDVg5Dr4lL1-H2c6SQ",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Bells Two Hearted IPA.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SohYMDVg5Dr4lL1-H2c6SQ/o.jpg"
      }
    ],
    "user_id": "UK2DsID5q3MCqYX23S6xXw"
  },
  "oA9inkvAh07ybhu9Z6T6yQ": {
    "date": "8/12/2016",
    "text": "Great local place to grab dinner. Kid friendly on most nights (a little busy on trivia or tap takeover nights).  The kids love the mac and cheese.  Great selection of beer and good food.  The wait staff is always very attentive and on top of refills.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wV4A3rgg0g0URU_dRjweHw"
  },
  "tLcTV_O1taqCN-FGEPyI3A": {
    "date": "5/6/2016",
    "text": "Wow! They were friendly, they were fast. It was clean, the beer pull collection is super cool. And oh my goodness the food was amazing. My husband had the macaroni and cheese with bacon and blackened chicken, let's just say his yum noises were awesome. His entree came with a beautiful mixed greens salad and the in-house made bleu cheese dressing was so good I liked it! Not a normal occurance. I being on a low carb diet #babiesnotbread got the bacon cheese burger no bun and plain with sauteed broccoli. Mind you the burger was yummy but oh that broccoli! I would go just for it! Desert was cheesecake mini chimmis with vanilla ice cream and caramel sauce. Hubby gave Meg Ryan a run for her money when he ate that. Lol Now these plates came to us prettier but we got so excited we ate before stopping to take pictures. Thank you Flanny's for a great 4 year anniversary date lunch with my sweetheart.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oUMlwt6GFr319Ka2rAw_uA",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Desert, I let myself have one small bite. We will be coming here on my diet cheat day. Lol no but for real...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oUMlwt6GFr319Ka2rAw_uA/o.jpg"
      },
      {
        "img_id": "8k9UeqmR5x7258-Gftbd9A",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. I know it looks sparce but they were great about modifying for my dietary needs. Oh! That brocolli!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8k9UeqmR5x7258-Gftbd9A/o.jpg"
      },
      {
        "img_id": "-XFU40SltGGAK6Gd6nsw8Q",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Husband&amp;#39;s plate, he loved it and he is a bit of a macaroni &amp;amp; cheese snob. Lol",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-XFU40SltGGAK6Gd6nsw8Q/o.jpg"
      }
    ],
    "user_id": "eW7KbOA61ef5j4rUt_njzQ"
  },
  "cUaF-SOvprBOIQkoB5gChg": {
    "date": "4/7/2016",
    "text": "Nice neighborhood spot with a rotating selection of draft beers. There is usually something on tap I have never tried before. Getting a sampler of 6 different beers is always a good time (share with a friend!).  The food is also great. I recommend either a burger, or the fish and chips.   I'm personally not a fan of the trivia night. I would like to be able to talk to the person next to me without having to talk over the PA system.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qIUMf1HMuKSrEHXq1GBQSQ"
  },
  "gVT1WRWw1BAGvfzS_Fq7Cw": {
    "date": "1/14/2017",
    "text": "I've been coming to Flanny's for years, and it's my absolute favorite spot in the neighborhood. Excellent food, beer and service. The owners are amazing! You won't be disappointed if you come here - it's the best!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bAcGpKTTLiBw1OAOirgIuw"
  },
  "B9wZywmrc3wg_jYyZPnVQQ": {
    "date": "8/31/2013",
    "text": "I'll agree with another Yelper, pretty unfriendly - and I am a pretty laid back person.  I don't start trouble at bars, I just go in to have some drinks and usually to pass the time.  I was across the street at a service station getting the oil changed on my car (I don't remember the name of the place, but they have a great, on-going price for oil changes, just throwing that in there).  The place was pretty empty but I am assuming because it was 3:00 pm on a weekday afternoon.  The bartender was short and curt.  I don't mean short in stature, I mean in her attitude.  She had some \"favorites\" that she was hanging out with, but with me and a couple other people it was just all business and a pretty sour attitude.    They do have a large selection of draft beers - even Moose Drool on draft - that's a plus, but the 2 margaritas I ordered were not good at all.  There wasn't much alcohol in them, either, nothing like what they make at Applebee's or several other places.  The flavor of the margarita was bad, it just plain didn't taste good. It's just the bad attitude of the bartender that really got to me.  As if I were imposing on her to ask her to get me another drink.  I don't know how the owners/management of this place think they are going to get new people in there with attitudes like that.  Maybe they think they already have enough regulars and don't need anymore.    Undecided whether I will go back the next time I get the oil changed in my car - probably will try a second time and see if it was just a bad day for her or what.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "cJXU9S5G0pKZPNHM3fY_Tg"
  },
  "LsPfaMKU7rrWtoAITgDLfw": {
    "date": "5/5/2017",
    "text": "First and foremost, the restaurant is lovely.  The bar has beautiful counters and the place was pretty spotless from what I can see.  A lot of seating, also a plus.  The Owner greeted us and welcomed us to his establishment, another plus.  Now to the food.  I tried the poblano burger with added bacon and onion rings.  Food was great!  My sis ordered the steak quesadilla and gobbled it up (it was so good) and didn't even offer me a taste.  :)  The only thing that I had a problem with is the deep fried pickles.  I LOVE pickles, but I tasted more batter than pickle.  It would have tasted much better if they would have cut the pickles a bit more thicker, instead of biting in to it wondering where the pickle is. Another issue that I have was the beer.  A 16 ounce canned beer for $4 is a bit high for my taste.  Instead of drinking out of a can, I requested a glass that wasn't even chilled like most places.  I probably won't be back for drinking, but I will slide through to pick me up a burger from time to time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hTCN6HTFhYAZ7unwN1INRg"
  },
  "1LNqmjAq0F1Q7DpArz8mzg": {
    "date": "8/13/2013",
    "text": "Flanny's is my favorite hang out spot in Tempe! The beer selection is fantastic and it is the place I always go to watch the big game. The owner and his son are very friendly and knowledgeable about the beers that they offer. All of the staff recognizes who I am and makes for a very enjoyable and at home experience when I show up.   LOVE their tap takeovers that they have every 3rd Thursday. If you like beer, then this is where you need to be!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "0DiH6t81Z74q7DZMZV--IA"
  },
  "L9BQrjfcP9bn32i4H2b9uw": {
    "date": "6/2/2013",
    "text": "This is a great place to hang out with friends and grab a meal or drink. I've been here and had dinner once. I ordered a burger and fries - it was good quality for bar food. I've also been here a few times to just have a drink with friends and hang out. It's convenient to walk over after eating at Yupha's or watching a movie at the Pollack. I like that it's not loud and they have a large selection of beer (even though I'm not a beer drinker, my friends seem to appreciate it). It's kind of odd that they close at midnight though.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "Q6Dcxo3_lNCzkqK7J3FL7A"
  },
  "bXtMaxOiar7_Prtpawy_Ww": {
    "date": "3/25/2013",
    "text": "Flanny's is an unassuming place located in a strip mall. I would never think of coming here unless someone took me. What makes Flanny's are the people, oh, and the craft beer. This place is buzzing at night with beer geeks exchanging ideas and talking about the latest and great in beer. When I was there I actually had a chance to meet the owner of Bells. How cool is that and how often does something like this happen? I was impressed with the beer selection and the clientele. I had something to eat but the entire beer scene has blocked my memory on what exactly I had! ;)",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "v-HcprOKPC1_F5_15t4JDw"
  },
  "oIbysz2HPM_dJDm4lWHkLg": {
    "date": "7/31/2015",
    "text": "Well, I did not get a picture of the burger. It did not last. It was that yummy. Portion size was HUGE. I had enough left for a very delicious (if not picture perfect) dinner. I had the blue cheese and bacon burger and I have to say I was very impressed. I'm always leery about ordering this kind of burger as it seems like most places either over do it or under do it on the cheese. Here they had it just right: creamy, tangy, and a little bit salty, but not over powering or funky. The fries were another high point. They were light and crispy and just down right yummy! As a side note, my boss upgraded her ordered to include the sweet potato fries and she swears by them. I myself can't stand sweet potato so I'll have to take her word for it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "tx3FokVDVvKeJe-NIypvvA"
  },
  "jm6Je5MVHDzfJ-dcfpvWPg": {
    "date": "7/30/2014",
    "text": "I've been here a few times, and I am never disappointed. The food is great; one of the best burgers in town, the appetizers are all delicious, and they have an amazing salmon salad.  Of course, if you don't come here for the food, you're here for the beer, which there is a huge selection of on tap or in a bottle.  The customer service is better on the weekends than during the week, and if that was more consistent, 5 stars!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2HMeOwfD12G_cCDkhCi0BQ"
  },
  "9U_QkDFCWn9r376JZaGY1g": {
    "date": "4/20/2017",
    "text": "This place is terrible...wait staff is rude and slow, the food isnt good, and the drinks are expensive. Atmosphere is depressing and so are the locals. Dont try to have fun and laugh out loud in this place, the staff and locals will give you bad looks and even kick you out! I will never go back to Flanny's and dont recommend it for anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4p6CG_-t9Cx_mZ-EG65nUg"
  },
  "sgNoVM5gETtM4JkPdB5PCQ": {
    "date": "4/19/2017",
    "text": "This place sucks and is INSANELY overpriced. Apparently, you're not allowed to have fun here. We were laughing too hard and told we couldn't have more drinks because they don't serve \"six packs.\"  I've been in the restaurant industry for 20+ years. That's not a really thing. The owner mops around like a sad loser and the regular give you funny looks for having fun. This place is doomed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lY_f2oG01CS5BCurS1xnAA"
  },
  "PAv_N9Fr6S34jnr7KDEO4Q": {
    "date": "6/22/2013",
    "text": "One of the first bars I loved (not just tolerated) since moving to AZ from WI.  The best part about Flannys is their ever-rotating and expansive tap selection. I love that there is a new array of hoppy deliciousness every time my fiance and I go there. The bartenders are very knowledgeable about their selection, too. Tap Takeovers are fun as well.  The food is good-- a step above \"typical\" bar food; not too greasy, but also nothing that trumps their variety of brews. I've tried a variety of items on their menu and have never been disappointed.   The owner is a great guy. He noticed that we had been coming in every few weeks, remembered us, and asked how we liked his establishment. Friendly and personable.  (Awesome side note: he looks EXACTLY like Leah Remini's dad on the summer resort episodes of \"Saved By The Bell.\" :D Look it up. <a href=\"/redir?url=http%3A%2F%2Fcoeursderequins.free.fr%2FSbtb%2FSbtb%2FActeursplus%2F59-carosi.jpg&s=cc3b3c4f0b759f632ccee60f46d7d3267ea5617282cab2728b01f695ba0e91af\" target=\"_blank\" rel=\"nofollow\">coeursderequins.free.fr/...</a>)  My fiance and I actually went here to celebrate the day we got engaged! The Bears played the Packers, and we couldn't think of a better place to enjoy Flannys' giant TVs, hospitable atmosphere & (of course) great beer. Bottom line? I'd recommend this place for sure.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hWiB0HdQr-ayAxcryQ7BPw"
  },
  "Wt7zTH8JWG6Y05m5ClDRvg": {
    "date": "10/20/2017",
    "text": "Flanny's bar and grill was a sobering experience. To go to a bar and NOT get served alcohol was something new to me. I ordered alcohol and food, and then when I ordered more alcohol, I was denied. The waitress then asked me if I still wanted my food (blackened chicken). There was an insinuation in her voice that the only reason I was there was to drink, and ordering food was an afterthought. That's exactly what I like to do, dick with waitresses and make their jobs harder than they already are. I am being sarcastic, but why would I order food and not want it? I would have to pay for it regardless, so why the query on the food? It was strange. Bars serve alcohol, but apparently not this one, mainly due to a stuffy manager with P.R. Skills that definitely need to be brushed up. After arriving sober without the plan of driving, getting denied alcohol at a bar with questionable service, I would give them 3 thumbs down if I had an extra thumb. Ive never been treated this way and I cannot recommend this place to anyone. I am a bartender myself and I know the laws. I will never be back and encourage anyone else to seek out another watering hole.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mpx4IFxuEssYtQa-YAtQlQ"
  },
  "8jEjax71_FAiGMQFa3lNXg": {
    "date": "2/4/2017",
    "text": "Went here on a whim for a Friday night beer and a burger and was not let down...happily surprised in fact!!! Even though it was packed (usually a good sign) the staff bussed a table and we were quickly seated. Beer list was diverse and the food was quick and fresh!!!  Couldn't have asked for a better Friday night with friends food and beer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J_Vpm9Ias7sfL7-_7hzyUA"
  },
  "L_FM9hIA8Sv0O57Wxu_icg": {
    "date": "3/31/2017",
    "text": "I love flannys. I go there all the time. That said, one of the main reasons I go is it is crazy convenient to where I live. Also, my kids love the mac and cheese. It's an easy place for my family. Tons of beer to choose from. Three stars because I've tried most of the menu items and there's really nothing that makes me go YES! Spinach and artichoke dip is super bland. The sliders are good not great. I do like the Cobb salad but it would be great to have another good salad. The chicken sandwich is another one with potential but it's just boring as is. I love flannys and would love to see some tweaks to the menu!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IM0UJ0JCBypnvihiPQMMkw"
  },
  "kZLZRw_Sxf4ckWoAjanuQg": {
    "date": "6/1/2016",
    "text": "Flanny's is our neighborhood bar and we love going there! The beer selection is great and the food is very tasty. I love the atmosphere and there are a lot of TV's to watch a variety of sports.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "U9IQumldnS5wGqqNhDPGPg"
  },
  "jOxyAqpQWw8kf8pV0HJlSg": {
    "date": "10/30/2016",
    "text": "My 1st visit and it definitely won't be my last. The food is homemade, and it's delicious. Their craft beer selection is amazing.  You won't be disappointed.  This is gong to become my new local hangout. Cheers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5lNLkvT_s8PpXjD3QwFaig"
  },
  "UdmQGUVO05HUsk7IS79lrA": {
    "date": "3/6/2015",
    "text": "Great folks providing great service with fundamental knowledge of beer. New menu of great bar food. Be on the watch for events.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5bnOwDji4zPKv2l_ZJg4WQ",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. The taps.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5bnOwDji4zPKv2l_ZJg4WQ/o.jpg"
      }
    ],
    "user_id": "pK_KiAQDo6byOKst7db1eQ"
  },
  "oueVSoAYgVk5157speW88A": {
    "date": "1/8/2017",
    "text": "Went there at 6:00 and wasn't impressed on any of the service. My wife ordered a Captain & Coke and when she asked for a lime the bartender stated they were out, and because they were closing at 9 they wouldn't cut any more up! I could almost understand if it was 20 min before closing but almost 3 hours when there were other people there, that seems like a lack of training on basic customer service. The bartender didn't seem like she wanted to be there and it showed. Definitely would have rather spent my money elsewhere and will not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U1L3YHnChis27KgsDQKklA"
  },
  "FkCUTwX0b-nR3PSIgL7F6Q": {
    "date": "12/6/2016",
    "text": "Great selection of beers and rotating taps, so very fun place to go for unique brews.  Food is good as well.  Only issue I have is beer events; no samples, no flights.  The samples I can understand, however, the beauty of a beer event is the variety and option to try multiple beers.  Last time we went, most of the featured beers were in the 10% range and one was 13%, so the option for choosing more than 2 is unlikely; subsequently, we missed out on 3 or 4 that would have been fun to try.  Owner is always there and told us we can come the next day and do flights, samples, etc which we will remember next time an event happens.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nr9wlvgrCokgz5rJlN7RKA"
  },
  "k_RlCIWDyP9WNgE3L2lIbw": {
    "date": "8/20/2012",
    "text": "Excellent craft beer selection with 22 taps. Third Thursday of every month is tap takeover with 1-2 breweries invited to bring in their brews. This is a good way to experience some hard to find beers. I attended the Lost Abbey/Port Brewing Co. takeover last week. $6/draft. Some available earlier in the day but most start at 6:30. Good establishment to try something new.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "QUjXjZTe46OhEobi0AKCGw",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. One of my favorites: Stone Imperial Russian Stout",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QUjXjZTe46OhEobi0AKCGw/o.jpg"
      }
    ],
    "user_id": "3xORNxbKdd08LUf0tclx3A"
  },
  "tspl5D-wMDOnlIqFeRPsgg": {
    "date": "9/2/2017",
    "text": "Flanny's is consistently good to me. Service is quick and friendly. Food has always been great. Large draft beer selection. Usually you can get two out of those three at a sports bar, but Flanny's always does it all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E_7dyOnqK63-sWshGjhpSQ"
  },
  "0nAk0-F_7DXUiNaIDDtnkw": {
    "date": "8/21/2016",
    "text": "Well Yelp reviewers, you let me down. I'm not a local here, but if I was, I wouldn't be going back. It's your typical local hang out - loud. We wanted some beers on the menu, but they were out. The food was below average in my book. No flavor in the flatbread and the burger had a bun they didn't make it after the first bite. Slow service. I guess you gotta try it once when it gets good reviews.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WbKLXpHENnI1FfXzclSrwA"
  },
  "9uAx2HnfOM6JKBqPzU25yg": {
    "date": "6/12/2015",
    "text": "Burger: good soft bun, meat was cooked as requested. Burger was 7/10. It was seasoned well but was a preformed, probably frozen patty.   Fries: coated shoe string fries 6/10  Pretzel: We didn't prefer either sauce. Pretzel itself was meh. 4/10  Mac n Cheese: cavatappi noodles with homemade rich, milky cheese sauce. 9/10  Fish n Chips: 3 thick moist portions of white flaky fish with light coating. Excellent tartar. 8/10  Accompanying salad: quality greens with excellent blue cheese dressing. 8/10  Cole slaw: midway between dry and creamy. Very slight fruity flavor. 7/10  Iced tea: Fresh and tasty (important for me since I rarely drink anything other than water or tea). 9/10  Service: Very good,friendly and helpful   Ambiance: laid back, friendly and very \"Cheers\"-esque.   Will we be back? Most likely, especially for Seahawks football since they play all football games!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Isf8G6HPbNqEisKDjmUlbw"
  },
  "XlnNw3EsILcUm8W6wHrVNQ": {
    "date": "11/4/2016",
    "text": "Arrogant bartenders , bad food even for dive bar standards. Owner and son are rude and unfriendly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4-267YIRqK2C1ryhDJnGxA"
  },
  "yS_5eWlpf5AGNZItaPmDQA": {
    "date": "4/22/2015",
    "text": "This is a really cool place if you like local beers, or just craft beers in general. It is right near my office so makes it a great place to grab a quick beer during lunch, or a slow beer after a long day... or many beers after a long day.   Food is pretty good, usually just get some appetizers or pretzels but everything seems to look pretty good. Will be back, Cheers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "P2Wv8TSU7-Lc57LDKZOy_g"
  },
  "ryReM3YoZrcRbDkmcPt8mA": {
    "date": "12/22/2014",
    "text": "No patio.  No late-night happy hour.  Three TVs behind the bar are very small and you sit VERY far away because the bar area is so deep - wasted space. Only 2 TVs in the rest of the dining room, both of which are small.  Good beer selection. Friendly service...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ygWZ_gXF8qTm0bY95JJqA"
  },
  "TU2oId1RKIhfDCezufH_bQ": {
    "date": "2/18/2015",
    "text": "I stopped in here for dinner with my son before a chess match. He ordered the Mac n cheese and I ordered the Pub Salad. First off, I am sad I didn't get the Mac n cheese because I tasted my son's and I could have easily eaten an entire pot!! The steak on my salad was seasoned and cooked to perfection! I even exchanged some words with the manager whom was extremely polite. My server was a man of few words, but nonetheless, on top of things. The thing that stood out the most was the cleanliness of the establishment. Usually pubs have dingy smell, especially the bathroom; however, I didn't get any of that from this place. Keep it up, Flanny's, I will be back, but next time without child to try out the beer side of things!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lh-lnAt_J_nZC5m81sHCSw",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. One if my favorite local beers!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lh-lnAt_J_nZC5m81sHCSw/o.jpg"
      }
    ],
    "user_id": "CdO9H6wtMYuYclvRqS_B3g"
  },
  "0bY5sRgLyyz7QQxuHuacLA": {
    "date": "10/19/2014",
    "text": "First off, I don't typically enjoy or dine at sports bars. As soon as we walked in, I knew this going to be an exception. The hubs really wanted to watch the cardinals game and since we were out running errands we hopped on yelp and found this place. It is CLEAN. Do you hear me ladies? It's spotless. The hallway to the bathroom smells slightly like bleach, which to a germaphobe like me - is heaven. Bathroom is very clean. Service is wonderful, very friendly staff and super kid friendly - lots of families here and we have a 5 month old. We were asked by two employees of we needed a high chair.  Food is good, beer choices are phenomenal.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TwSgyP30tvZu3M9dymVCXg"
  },
  "j__G9JsPYAjJOigPEBu06A": {
    "date": "2/7/2015",
    "text": "Best fish and chips hands down!! We used to go to Four Peaks for their fish n chips and theirs is always rubbery. We order there fish n chips and southwest eggrolls. The egg rolls come out hot and crispy with a side of enchilida sauce to perfection. The Fish, you can tell its fresh, its flaky with a little crisp. Each time I cut it in half you see a little steam, that's how good it is.  After trying Flannys this is the only place we go. I have no problem driving 25 miles to eat here. We love sitting at the bar....the bartender talks to you and there friendly. The food gets served fast and it always comes out nice and warm. Its a nice size bar with t.v's. This bar reminds me of the bars back east. Its a neighborhood pub!! If you want a overpriced fancy bar, go to N.Scottsdale, where the startenders won't pay attention to you.  The staff knows their craft beer and have great recommendations. My husband and I are craft beer advocates and love checking out new places, and right now Flannys is our #1.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PnSGgbQC_qqqmVt5n8OFMQ",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PnSGgbQC_qqqmVt5n8OFMQ/o.jpg"
      },
      {
        "img_id": "L4S12lbRvSHcfWNNGFiUHg",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Fish n&amp;#39;Chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L4S12lbRvSHcfWNNGFiUHg/o.jpg"
      },
      {
        "img_id": "cxNm4fYIRPj7gJKQPtMpxA",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cxNm4fYIRPj7gJKQPtMpxA/o.jpg"
      }
    ],
    "user_id": "5_gq1q-ggQC7Mb5DFaYXew"
  },
  "AHRLvtjJJ-p0G2JVvXLrxA": {
    "date": "11/21/2016",
    "text": "First time visiting, didn't have a beer all day, bartender cut off my friend and I after 3 beers! SMH! Asked for a cold glass and they acted like it was ridiculous, every craft beer bar or regular bar I've ever been too chills there glasses in a fridge before pouring! Apparently, that is a new concept with these people! Regardless, customer service needs work, beer list and availability need work, amongst everything else, especially attitudes. Never going back again when there are several other bars on the area that are of a higher standard",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MhKWKhUkMGWLKp3tTt2H3Q"
  },
  "_O0zuCs-Wq3a9jG2Sj9KVw": {
    "date": "9/15/2014",
    "text": "Great Burgers!!!!!!! No typical swill beer, only craft beers.. Good atmosphere very small",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "68CF-c9LAf_V1y7OzV7aYw"
  },
  "UJqbL0WoOmmdVZ9Bh0JUeA": {
    "date": "8/1/2015",
    "text": "Great food, great beer, amazing staff... What more could you ask for? Their staff is very knowledgeable on the craft beer and make great recommendations!  I had the buffalo chicken wrap and can easily say it was the best I've ever had. I will definitely be returning here frequently.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bkw-y_cYO9cWGd_6Sy458A"
  },
  "LBHveF6g6H4AAuWUxDuvHA": {
    "date": "7/22/2017",
    "text": "Found this gem on a whim.  Cute little bar eatery where the owner was hands on and talking to everyone. Staff is fabulous and food was excellent,  large portions, the wings are 2.0 pounds before cooking and my husband loved them. I would 5 stars but,,,,your happy hour drinks are a bit pricey.  Whiskey and 7up $4.50.  Though, such a homey place, I will definetely be back often, as I think this is my favorite bar in Tempe.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f4EfohFmapdUsXEUXN9t4Q"
  },
  "lZYIfuNo54YcOKVvFjPHAQ": {
    "date": "10/10/2013",
    "text": "Had the grilled chicken wings and they were awesome! Great beer selection and friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IGqBFYvlBTGVG0r33DkTLQ"
  },
  "bM7OrE1xnyQpxPMwlTo83g": {
    "date": "5/13/2014",
    "text": "First time here. Great staff, great wings and great beer!!!  Definitely coming back when I am in town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n6-up6DFta7uabEfe7xePg"
  },
  "plAW9J-3PxrWLZJoIKeA5A": {
    "date": "2/22/2014",
    "text": "Good food. Good beers. Had some live music last night which was entertaining too.  Would've preferred some more options on the food menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PiSCokd01nxdMkVQRV_R7A"
  },
  "sol7JtjNQ59ax2Y720wb_Q": {
    "date": "6/13/2014",
    "text": "Definitely will be recommending this place. Carolyn was a fantastic waitress and very attentive. On the ball with the condiments and boxes and was an all around delight. The salmon that I ordered came out beautifully and my boyfriends philly cuz one that finally shut him up. Next time I'm in Tempe, I shall be coming back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTnUz1OXZhqJrh0I0ZJimg"
  },
  "ib7fzy5cDAn1JbLtjTZ15w": {
    "date": "11/27/2011",
    "text": "They have a great beer selection.  We went in with a large group (~10 people) and were immediately told that the kitchen was closing in 10 minutes (9 pm on a Tuesday in a bar??).  We were also told that after the kitchen closed we wouldn't even be able to get ranch dressing or anything.  It was a little strange.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gwkIQbxOhbtM2YMKvvYVgg"
  },
  "kdtbYCVil47C_Tck3XbVdg": {
    "date": "5/8/2015",
    "text": "What a great place. Family friendly without being cheesy. Live music, great food! Service wonderful.  So fresh and not prepackaged. Beers, great selection.  Been here twice. Had the California flat bread, Yummo! Kids had Mac n cheese. Wish I got that  too. Hubs got the fish not chips. Amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Y094XQewAxsBbua9yqgmQ"
  },
  "0IZsZbHZ2qsFjyscKsdAKw": {
    "date": "7/12/2013",
    "text": "Flanny's is a great spot to really indulge your tastebuds into a craft brew. With a rotating tap selection, you can go in 3x a week and never drink the same beer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eSMmU_lSLk8o-pe1Z0ozww"
  },
  "vUujilKP7upxfq1sITwWEg": {
    "date": "12/27/2013",
    "text": "Not sure what some peeps are complaining about as far as customer service...I've never had anything but friendly,  top notch, and well informed people taking care of me. John Senior, and John Jr. are both quality people, and more importantly, know their way around a beer list. This is by far one of my top 3 favorite places to grab a beer. First it's always a great, dynamic selection...and two, the people (at  least John & John) know what they're serving you. They might not be vapid, 19 year old hostesses promoted to bartender by some horny over-aged manager, regardless of the fact that they don't know an ipa from a stout...but they're good people who know their product. You make the choice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OYh-kpdScQMaqaIFwNxxZQ"
  },
  "mOQONCkLNOyALH0HLTEqJg": {
    "date": "7/12/2013",
    "text": "This is what I call a classy local tavern and restaurant. With the two owners on premises and what I call home made classic food you can't miss.  I enjoy a beer or two and love that they have more than just the standard brands. Music in on certain nights classic and not too loud so you can't enjoy a conversation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LyC-vQOr_myOwFxfpx1a6Q"
  },
  "qVWSItcVjnFOxe3PQCsftA": {
    "date": "5/22/2015",
    "text": "We typically go to Flanny's once a week for a growler. Every time we've been there, the bar tender cleaned our growler, whether it was dirty or clean. Tonight, we went and our growler was not clean and the bar tender told us he \"wouldn't put a good beer in a dirty growler.\" That was it. No offer to clean or anything. Maybe he was trying to get us to purchase another growler; I don't know. This was outside our normal experience there. There are plenty of places to get a growler. Since we had to go home to clean the growler out, we went someplace else afterwards. We want to support local business, but they need to be consistent and not crappy to their customers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LQC_djumWD5qkoInU8Od6w"
  },
  "1ElEWdz3fZUsCQzO4RBtog": {
    "date": "10/21/2013",
    "text": "Very good food and great beers, if you like craft beers. The chipotle Mac had Cheese is one of my favorites. And they also have this great thing call tap take over every third Thursday, where the have beers from one brewery on as many taps as they have. They have growlers and beers togo with an awesome selection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Bz8KQh-xzQGYN7XMK-CRQ"
  },
  "a4-YL-7a1lCdCqeEEMHBhA": {
    "date": "3/8/2014",
    "text": "Great beer selection.  The food is standard fare.  Prices are fair.  The owner is always out and about and making sure every one is taken care of.  However, I've had a few experiences where the servers can't seem to keep up.  When, there's a beer event, forget about getting service or a seat unless you get there very early.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fV9dnQcFDdA0nAQ-Aa9QTA"
  },
  "MIwVHRZyiRW8JnjsqhpQqQ": {
    "date": "4/17/2014",
    "text": "Owners attitude makes this place awful, he was the greeter and what a turn off to walk into. We were told we had to sit at a table for two only, server comes over and we had to give plastic  to order, problem with deadbeats I guess, or customers met the owner and said screw this place like I should have done and not paid. The service by the staff was good, food would have been better without the owners attitude when we came in, fish and chips by the way. I did mention the problem to the waitress (Margreta) didn't seem too concerned only that we are gonna get real busy and the boss was concerned, but the wife would be in soon and it will get better, I can hardly wait to never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nk6LUYVffBHgDb5DTfOBdg"
  },
  "-qJm77c1m7XEHxCmb6F5Cw": {
    "date": "1/3/2013",
    "text": "This is the perfect little bar and grill.  Every time I have come here I am so happy I did!  The food is excellent!! There is not a bad appetizer on the menu (I know because I've ordered them all).  The meals are delicious and reasonably priced.  There is also an excellent beer selection for all of you beer snobs out there. The last time we were here there was even live music.  Just a simple acoustic guitar, nothing intrusive or too loud and lots of 90's cover songs. Another great thing about this place is location.  It is right next to the cheap-o Tempe Cinema making it the perfect spot for dinner and movie that won't make you go broke.   This is one of my favorite Tempe spots :-).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MlXWEHFygj13lofK5KC8A"
  },
  "gBYovsKueHtBJ4viGmU-6w": {
    "date": "10/29/2011",
    "text": "Met for a few beers last night.  My nephew loved his burger.  Fried pickles were pretty good.  Live music was lame - good thing we were leaving when the singing started (at least I think it was singing, maybe a dog with its paw stuck in the door).  Probably will go back - nice place, friendly wait staff (but still learning what all the beers are that they serve).  It took a while for the waitress to understand 'red lager' means red lager, but she must have been new.  Decent crowd.  Good horseshoe bar set up with some decent screens for watching the games.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "pNOST_hTkcZzr4nsx_oYQQ"
  },
  "wEqrYevBPlOZ53BIBkY3dg": {
    "date": "9/11/2012",
    "text": "if something on their draft list sounds good, go drink it. NOW. they usually only get one keg of a variety of craft beers, and when they're gone, something else shows up in its place. they have a lot of delicious things on draft, and a selection of delicious beers to go. food is ok but everything has meat in it. even all the salads. boo.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "m4KhJ-IRbrpXPEYDWxkQqA"
  },
  "E-Mn-TS1Sw59d4t9eBES9A": {
    "date": "10/18/2011",
    "text": "Nice little bar with a good draft beer selection. I like the setup inside. You have seating around the bar, bar high top tables and even a section with a few lounge chairs and a couch. TVs are all around as well.  We only tried the hummus and it was not my favorite but not horrible. The menu has some decent choices from what i saw but we were on a beer only diet, the hummus just helped stopped the rumbling :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LWinqJdSeptUcP2jPvryhw"
  },
  "Pdz-VOqzlKMlucyujYwHRQ": {
    "date": "3/21/2012",
    "text": "I love sitting at the bar at Flanny's and enjoying a few craft beers. They have a fantastic selection of unique and rare beers on tap, as well as a solid draft selection. I can't speak to the quality of the food here, nor the service away from the bar, but I've repeatedly had excellent experiences and must recommend this place as an excellent beer bar. They also have a full liquor license, in case you have friends who don't enjoy craft beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "Vmsmf4i096q9feBgp4CuXA"
  },
  "0Km6HEHPtMKcUAbA6BjJdw": {
    "date": "9/10/2012",
    "text": "This place is good in theory, but the food is so-so at best and the beer situation is confusing. If you go to their website, there is a list of beers. However, when you get there the beer on tap is different. Huh? The service is good and the staff is mostly friendly, but I need some consistency in beer selection and the food needs to be ramped up.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dTTFAM66wF5_b_ANM8rEHA"
  },
  "dvSYLjjM52lzTHdwjPMu3w": {
    "date": "6/1/2016",
    "text": "My husband and I went into Flannys to get our growlers filled. We are from Montana and it's a very normal thing to go into a bar and get your growlers filled so we were very excited when we heard of Flannys here in Chandler. We called ahead and made sure we could bring in and fill our own. When we got there the place was dead and there were numerous servers just standing around staring at us. We asked for a beer they had advertised online and they were out of it.... No big deal..... They then told us one of our growlers was shaped weird so they couldn't fill it? I am actually incredibly thankful now that we only got two filled. We asked for our beers very generic nothing exciting and when we got the bill I almost had a heart attack. Our bill was $59. Let me do some math for you... They charged us $35 to fill one of the growlers. Each growler is 4 pints. That is $8.75 per pint..... Are you kidding me? The next growler was $25 that is still $6.25 a pint.... For a beer I can buy in a 6 pack at the gas station for $12. This place is more then a rip off and when we questioned it the manager and server just pointed to the menu where the prices are conveniently hidden. Our fault for being incredibly excited and not paying attention to the price however I would not recommend this place to anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B9I7ZvAQzfvhFScvXEH9dw"
  },
  "qsfAidpkeJrJbXFOuXzk7A": {
    "date": "10/4/2017",
    "text": "Great atmosphere, great beer, good crowds. Always please for a good neighborhood bar/restaurant. Trivia night is fun, but they close immediately after :/",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b8xTIkCoFs-b9I66sG0lgw"
  },
  "XG3GWRmUS3GnJNdIT7JIyQ": {
    "date": "8/11/2017",
    "text": "First time here!! Awesome service, great food and beer choices! The Black Swan sour beer is awesome, same with boneless swings and fries. John (I think the owner) introduced himself and was great! Good neighborhood bar! Will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZ5uVnJ3lL0LgenApZn2Dg"
  },
  "lijgEBm1YDdufO0Nv6su8A": {
    "date": "9/17/2014",
    "text": "If you want something fancy... walk away. This bar is 4 stars for being greatly neighboorhood centered, local driven  Its great, the beer is all local (and semi local)... they don't even have blue moon or Guinness here. So have fun and try some new stuff.  One complaint - If you are sitting at the bar is it necessary for the waiter to make a receipt for every transaction you make? Aren't we wasting the bartender's time and paper. Come on..  fix the processes here!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "42UKAXCq_SSXKVj3R4jaxw",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Pretzel and fried pickles.. awesome",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/42UKAXCq_SSXKVj3R4jaxw/o.jpg"
      }
    ],
    "user_id": "Y-aeqCKNf7RQvVBZw6oCkQ"
  },
  "rxUyJnZR3XbSddmaXeOOuA": {
    "date": "7/13/2016",
    "text": "I really liked this place!   Clean, friendly staff, really good food.   I got the Cobb salad and it was SO SO SO GOOD. Fresh veggies.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DfX-b5e8WsA5pZ7ltxrnzQ"
  },
  "tf6Ff-l9iWuUh5N6nyRAMA": {
    "date": "6/10/2016",
    "text": "Always great service and good food. Family friendly. Whatever you are in the mood for- Flanny's has it.   Tuesday- customize Mac & Cheese night Wednesday- trivia night Thursday- tap takeover night  My favorite menu items- pork sliders, all of the salads, buffalo chicken wrap and flanny's burger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wqr11gnxhtkXsI_06iqZkw"
  },
  "GFsmQCnjEeaCDEJoOf2KLA": {
    "date": "7/17/2014",
    "text": "This place is a craft beer lover's paradise!  The selection is forever changing and it's always interesting to see what they'll have next.  The night we were there, the rep for New Belgium was there and gave us some sweet goblets for trying one of their beers on tap (which turned out to be a great easy drinking summer beer).   The food is better than most bars, but we didn't come here with food at the forefront of our minds.  It's all about the beer!  Trivia nights here are super fun as well.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "siVtjO8xrSxbrK-zqXCGew"
  },
  "81BS8BFHTl6AgObqyHreSQ": {
    "date": "3/22/2018",
    "text": "There ain't nothing wrong with this place. The service was great, the food was top-notch, the restaurant was impeccably clean, and the beers were exceptional.  Great for a date night or a family dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RwW9GKA9SOL2PiO0yJRo3Q"
  },
  "1rNm7Ww5rcx8dYrywNUdOw": {
    "date": "2/13/2018",
    "text": "If you would like to go eat mediocre (at best) food and have an iced tea, great. Try it. If you want a few beers go elsewhere. Read all the reviews, they police their alchohol unlike any I have ever seen. They like 80 year olds who like one beer and have no taste buds for food left. Good luck",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "49BKfYyGytqVo9TR3sP4sw"
  },
  "zzHbxnV-yIw_Ibqvqv06fA": {
    "date": "4/9/2017",
    "text": "Great menu in both food and beer! Met the owner - awesome guy! Decent service even though they were busy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "s0KPBwkPkVBDg-Y0oc3JWA"
  },
  "fu6cG1u7qtrrwpBDJ_bciw": {
    "date": "9/7/2017",
    "text": "I had them at a 5 star but tonight is totally a one star. The bartender is super disrespectful and I can't get any service. Last time I go there. Sorry",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R3fz3e2r85XoBl7gzyXRAQ"
  },
  "YP4Hx1Y_z0ukEvb2LQOUtw": {
    "date": "2/17/2017",
    "text": "Flannys has wonderful beer.  They always have tap takeovers and the atmosphere is great !! John, the owner is always around to make sure everything goes smoothly. We have been going there for years. They have great food too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HPGWGwZT_iGJTRXbD7nbDw"
  },
  "vZGuivVVgko9z8ypm5mBnQ": {
    "date": "6/1/2017",
    "text": "They have a good beer selection but the beer list seems to be always outdated. They had a lot of beers out. Food is good but a bit pricey but is worth it. They are kid friendly but they have one of the most expensive kids menus ($7) with very little to offer on it (3 items). This is the only reason I'm not giving it 4 stars. In addition, the kids menu offers only soda no milk. For $7 I would have liked to not pay extra for milk. Overall I'd come here again but expect to spend some money. More than a typical sports bar with craft beers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvNojOox0sN2M_5fUl6djg"
  },
  "SEiKXs4p-fj3i6QQ0KpHjw": {
    "date": "2/28/2014",
    "text": "You can never go wrong at Flanny's.  Definitely one of the better selections of craft beer on tap in the east valley.  They also do growler fills and they have a limited, but good bottle selection to go.    The food here is consistently good.  Everything I have tried on the menu is fresh and tasty...I would suggest the southwest egg rolls!  During the day, Flanny's is family friendly and there is a kids menu for the little ones.  Service is great when there isn't a beer event going on.  Typically, every third Thursday night there is a tap takeover of some sort, and depending on the popularity of the highlighted beers, it's not uncommon to find this place packed to capacity.  Service is as good as you can expect when there is an event though and the bar is three deep in beer geeks.  Family owned and operated, this is a great neighborhood pub!  I highly recommend it to anyone who cares about the beer they drink...and anyone else just looking for a cool little spot with good food on the east side.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CF8Zy3RCbJ_6VLmKJCc9FQ"
  },
  "wrez7xbrmr0rYn9J7ZENHQ": {
    "date": "9/12/2016",
    "text": "I was very surprised by this place. Went here with friends and from the outside, it looks like a neighborhood bar but the food is amazing and so is their beer selection. Food was very fresh and of high quality. I don't remember last time I ate at a place that served such good lettuce in their salads. Not one piece of ice burg, it was all spinach and Italian greens. Burgers were huge and juicy. Service was great! I will for sure be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "RPlNdMPaljxmD_f5Ayxv6w"
  },
  "tyV4VOwtzudvZoWmPlI9QA": {
    "date": "6/1/2017",
    "text": "My husband I go to Flanny's regularly, and we love it so much that we often bring our family and friends when they come to town! Great beer selection, love that the beers are always rotating! Steak tacos are my Fave! Wings are great and meaty! Burgers are husband approved!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TZ3s0qZ6OEi6tbiFSI00-w"
  },
  "_TxFEkBmYoCgctBfex2ugw": {
    "date": "5/4/2017",
    "text": "I wish I could give Flannys more stars as we like Tuesday night trivia.  But, the flatbread was atrocious and they were out of the Hess Scottsdale Blonde.  On other occasions, we have tried various menu items that were a solid \"Meh\".  Lower the prices and this will not be an issue.  Flannys should not be running out of beer on the most popular night of the work week.  I'm disappointed, but we'll see if the food and service can improve.  Oh, the little \"wine\" fliers on the table are sad - just stick to the beer as wine lovers will order wine regardless.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ep1MhBB6X1xtJEKxvwl1TA"
  },
  "GbPzaVOAgu2uHKLRmBN2YA": {
    "date": "11/16/2013",
    "text": "Flannys is hands down my favorite place in the valley to grab a beer, a burger, and hang out with friends at lunchtime.  I can't speak for other times of day, but it's generally quiet at lunch.  They have a constantly changing beer list with something for just about everyone, and the menu is moderately eclectic for bar fare.  Yes - the staff can be a little gruff.  But they are never rude, they haven't messed up anything we've ever ordered, and all the food is better than it should be.  I highly suggest stopping in, grabbing a flight of random beers and some street tacos.  Always seems to work for me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9Dgn-8gZ3075U3CYpKKHdQ",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. flatbread - yum",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9Dgn-8gZ3075U3CYpKKHdQ/o.jpg"
      }
    ],
    "user_id": "058QfVQzPoOaSX4CW_zC9A"
  },
  "56illBGKYwwPIyGDisU_zQ": {
    "date": "12/19/2015",
    "text": "I LOVE Flanny's! One of the best kept secrets in Tempe! GREAT beer, GREAT food. They've obviously upgraded the menu and it shows! If you miss Flanny's, you're missing out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o5mqgyx-InajhrqgbMwCtg"
  },
  "Zncd349FqOOIw4m5-oHQ2A": {
    "date": "3/29/2017",
    "text": "This place is a solid craft beer bar with a good menu and plenty of room in a nice space.  What more could you need?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvG-WuNJkrq77TSlEGue2Q"
  },
  "-L54928uRsSx5Vli5HW4jQ": {
    "date": "10/3/2015",
    "text": "Service was excellent and food was good.   I do think it was a bit pricey, but the burgers satisfied our craving. Total bill was just over $60 for 3 burgers and 2 appetizers. Only problem with the burgers was the HUGE bun. It was a little too much bread for my taste. I like the onion rings a lot though, they were cooked perfectly so they were nice and crispy.   I'm sure we'll be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5NyIWwFIuGHFrFLXcsIpyA"
  },
  "NTQMB0JmTyU9TXY1bMmWVA": {
    "date": "2/19/2018",
    "text": "Aside from the craft beers and the local live music that they bring in this place is awful.  It's been a while since we have been there, admittedly, but we stopped going because we thought the service was terrible and the food was disgusting and way overpriced!! Maybe it's gotten better but I doubt it.  Our friends got kicked out before they even went in because he had a beer in his bike basket (unopened)!  It was ridiculous.  Rude management and it's not a nice modern place, feels more dumpy.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "H_PWwDFMxViTxPFwLFjW1w"
  },
  "gqqgEZmmM7k3NPQyoKvcSQ": {
    "date": "10/15/2014",
    "text": "Well, I'm glad I went back and can most definitely add a couple of stars to the review.  Last time was so awful.  Chatty Cathy bartender reminded me of my brother's baby mama who never shuts her piehole.  I mean never.  I think the Bob & Tom song, \"She's Talking Again\" was written with her in mind.  ANYWAY, our return visit was perfect.  Great beers.  We had a couple of pints and also tried a sampler.  They had so many choices it was hard to decide, but no worries, I can always come up with a good beer to drink.    We shared an order of BBQ wings which were fried perfectly and had plenty of tasty sauce to get all over ourselves and suck it off our fingers loudly and make the couple next to us with small children nervous.    Then what?    Oh yeah, more tasty beers and then Mr. M had the pulled pork sandwich with onion rings and the sandwich reminded me of Rudy's pulled pork.  Very nice!  O rings were good too.  I had the fish wrap and am still thinking about that.  It was so simple, but so good.  The fish was cooked perfectly and not greasy, and then was surrounded by fresh vegs in a soft tortilla.  Loved it.    Our service was perfect this time too.  We had two people who kept an eye on us.  I lost track of my main receipt, but the sampler receipt says Katy, and there was a dude walking around helping out too.  I can't remember his name, but I want to say Jason.  The dude with the beard who knows a lot about beer.  He was fun to talk to.  I like to see servers helping each other out.    They also had some drool-worthy choices on the weekend breakfast menu if memory serves.  Something like bacon chocolate chip pancakes or French toast.  I don't know.  Better go back this weekend and find out.  Check their website to make sure I know what I'm talking about.  Overall it was great and now I definitely won't wait so long to go back.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "50KJGHVfZulUpTkPlDN2TQ",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Our beer sampler.  Grand Canyon raspberry was subbed for the Epic raspberry.  It was the only one that was not delicious.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/50KJGHVfZulUpTkPlDN2TQ/o.jpg"
      },
      {
        "img_id": "0hxJVQLZW-5HPOID0ZIqWw",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. And you guessed it....delicious beer sampler.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0hxJVQLZW-5HPOID0ZIqWw/o.jpg"
      },
      {
        "img_id": "_p2l-gWO-_Ny8hMvAn4l6w",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Delicious fish wrap with side salad.  $9.50",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_p2l-gWO-_Ny8hMvAn4l6w/o.jpg"
      }
    ],
    "user_id": "BA9SDRZGyRcUMxTdUTVhmw"
  },
  "y6bojNXqt1-q8mKl-RP0nA": {
    "date": "7/27/2018",
    "text": "My experience was a turn off. Three stars for the food. I went in after work and it was around 4. There was another person there and it was pretty slow. I ordered the spicy potatoes, vodka soda and a shot of Jameson. Did my shot of Jameson and sipped on my drink while I ate my potatoes. I took my time eating and drinking my one drink. I finished both potatoes and drink so I ordered another round of drinks and a burger and fries. Once again I did my shot, sipped my drink while I ate my burger. I was there for over a hour and a half. When I wanted to close out I figured I'd order one more vodka soda while I wait for my ride. The bartender told me she could not serve me anymore because her boss who I believe was the owner said I had too much. Two drinks and two shots in over a hour and half while eating and drinking water doesn't sound like much to me. It wasn't like I was slamming my drinks or slurring my words. It was a huge turn off to be told \"I can't serve you anymore\" knowing you did nothing wrong. I don't think I'll be back again.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LUubofJ7OiBQDFDTnv7TlA"
  },
  "ZxIYm3mjjxlN12Yu2xe9zg": {
    "date": "1/11/2018",
    "text": "Great little spot that head a steady flow of traffic. I was able to try the dogfish 120 min and was happy to get that chance. Just remember it's a 5oz size which they were nice enough to remind me but was worth it. I enjoyed the wings with a buffalo flavor. The color appeared pale but were actually not bad. Look forward to stopping back in for more",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2n2qOXWhJUVJfCodg1lLlA"
  },
  "pzsmU01-XZUr3qHwGL9Mew": {
    "date": "10/1/2017",
    "text": "Food and service is excellent.  First time here but I'll be back.... great little find in Tempe",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gjNvr8vhdwXfnlGJZXtLCA",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gjNvr8vhdwXfnlGJZXtLCA/o.jpg"
      }
    ],
    "user_id": "CBYlr6bksWM1WA_pTumeeg"
  },
  "Xf3JUQPmyBBqMLtMO1NCSA": {
    "date": "12/20/2017",
    "text": "I stopped in today for lunch for the first time.  Tried the fish and chips, man those may be the best I've had.  Very clean place and my waitress was very friendly and helpful.  I will be back with some work associates.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "uxKw6UVujNd30OHcftE7jg"
  },
  "gptdssdYC3AiI-QFzFzDSg": {
    "date": "11/2/2017",
    "text": "Came here strictly for beer with my wife during a Great Divide Brewing tap takeover event. Wait staff was friendly and full of humor which made the event fun. GD beer was on point as always, and it was really fun getting to speak with the head brewer and learn more about the art that is homebrewing. We didn't try any of the food while we were there but it looked pretty awesome and I could see myself stopping by again for dinner some time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "ZcwLnR_VGfgLmuJ_7tnAjQ"
  },
  "EYIavWSbyEZvMDpfuQ77aA": {
    "date": "12/10/2015",
    "text": "Went for the Boulevard tap takeover on a Wednesday night, which also happens to be trivia night at Flanny's. The place was packed. Every seat was full and no one was moving.   We drank some delicious Boulevard beers (bartender was very attentive and we had little to no wait for a drink) and waited patiently, and finally a large table with two seats to spare offered us a spot as long as we were part of their trivia team.  Even though our waitress was slammed, we received water, beers and food in a timely manner and with a smile. We both had the fish and chips and found them to be fresh and flavorful (enough to make me want to come back and try the rest of their menu OR come back and have the fish and chips again).  Team Trivia was fun and the whole place was involved. Flanny's on a Wednesday night turned out to be way more fun than expected. Can't wait to try it on a non trivia / tap takeover night to compare, but I have no doubt the service and food will be just as great.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "fnc9EtmvOQ-HQoqWdtpziQ",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Packed for the 12/9 Boulevard tap takeover and Wednesday team trivia, great crowd",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fnc9EtmvOQ-HQoqWdtpziQ/o.jpg"
      }
    ],
    "user_id": "XCcugBozVHU4OWGFlGb6mg"
  },
  "BiW5ouwizUl7rNn72wVCvA": {
    "date": "6/12/2017",
    "text": "Love Flannys! I've been several times now and it's one of my favorite spots to have a beer and good food. They have a rotating tap list of really good beers! There's always something new to try, and usually some of my old favorites too. Flights of beer were also added recently, so you can try 6 different beers, and they are also always happy to pour you a splash of a beer if you just want a taste before you order a full one.   As far a food goes, the spicy potatoes are a must every time I go in! The burgers are good, buffalo chicken wrap delicious, salads, mac n cheese also yummy. Just had the wings last time and got them grilled a s they were so good! I also really love their fries.  The staff has also been really good, and the owner is really friendly.   If you like good beer and trying new beers as well and good food to nosh on, I would definitely recommend giving Flanny's a try!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HbdLNBdysY9ToiyrHYGgSw"
  },
  "-fMhDFiiP3MUwoIrtlaG2A": {
    "date": "5/30/2017",
    "text": "Great beer selection!. Besides that..... needs some help. Food is boring and sub-par, not to mention about a dollar or two more expensive than really what you should be paying. You don't come here for food. You come here to get drunk and watch sports center. But if you're smart you only come on tap takeover nights.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xqWooJxvTdm4hAjYnu3PEA",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. It&amp;#39;s a beer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xqWooJxvTdm4hAjYnu3PEA/o.jpg"
      }
    ],
    "user_id": "SPpi90VMif7du5eW5qLj3w"
  },
  "nenSc0Lt3BIMnpiBO7Whqw": {
    "date": "8/2/2018",
    "text": "This is my very favorite neighborhood bar. The staff is extremely friendly, the service is excellent, the food- stellar. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JQ47IloLwOd1rJ0tQ3ev2Q"
  },
  "EIlsDi_SC41Bumk_LR73Kw": {
    "date": "12/26/2017",
    "text": "I have to say that  Flanny's is the best. I have to say that I love the Mac and Cheese, the Wings are awesome, the bartenders are spot on and the owner John is amazing. Thank you for always being  the best. Happy New Year! You know we will be back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eqcYTiqZEa9nzJaq0tIDQw"
  },
  "KnxBvEaGukuPfIchLpKb7Q": {
    "date": "2/19/2017",
    "text": "I attended an event at this local bar recently and was very impressed.  They were extremely busy, but the staff made sure everyone was taken care of and did not have to wait for service.  They have a fantastic selection of craft beers on tap and more in bottles and cans.  The staff was very knowledgable about all the offered choices.  They also have a great food menu.  It was difficult to find a seat with the crowd, but there was plenty of room to stand around the bar and chat.  I will definitely be back for future events, or just to enjoy a beer for happy hour.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "h1ovyYne78jKZPo8gFVM8g"
  },
  "bgCm5b6a6Frx6qRocecemA": {
    "date": "1/28/2018",
    "text": "Flanny's has the best beer selection in the valley. John really appreciates getting one barrel of something special from a brewery versus getting the most popular barrel--though they have this too. I had an unfiltered Sculpin from Ballast Point and it was the best thing I've ever had. John then took ten minutes to explain to me what unfiltered beer was. If you want to drink great beer and get a free education on all things brewing, this is the place. Flanny's recently redid the entire menu. I was a little disappointed--it's still just decent bar food. The shrimp tacos are delicious but on the spicy side. I'm a fan of the buffalo potatoes--also super spicy. My partner loves the fried pickles (yuck:). I'm a fan of the fries but the onion rings are great and worth the upgrade. The veggie options are somewhat limited. The veggie wrap is good. The grilled cheese dippers are decent too but I wish their was a sandwich with fries option. I also wish there was a veggie patty option for all the burgers. The service durning the day is great. At night or during tap take overs it can be a bit hit or miss. This really is a neighborhood bar--you can watch the game or bring the kids for dinner. I'm a regular and will remain so.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sC1zh2QPFcvTBXYnLAtX8w"
  },
  "nFXPYnOHZ-dspOXtCEyiWg": {
    "date": "11/25/2017",
    "text": "Love this bar.   Make your own Mack n cheese.  And trivia night.   East coast style in the Valley",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7CJW-ZzX25j33pTz_hT-Ew"
  },
  "w0TKGZlzSZb-1Wq1xwDdNg": {
    "date": "9/19/2016",
    "text": "I used to love this place l. Until they charged me 3. 50 for one scoop of Ice Cream for my baby. Any place else will give you a scoop for free, especially, when you spend over 40.00  Also, do not appreciate the judgement or dirt looks from staff. Will not be back!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "aUWRuE5V5FjqbOUgUPf47A"
  },
  "D-yQcc170aW1Uqa0YBjUDg": {
    "date": "3/29/2015",
    "text": "So it's been a couple of years since I wrote my last review, and I come here enough I figured it was time for a update.    Flanny's is still my goto neighborhood bar and grill.  If I'm after a drink with a friend, dinner because I don't feel like cooking, or a growler fill of some craft beer.  Flanny's is my first thought if I'm starting out at my house.    The food is consistently good, some minor tweaks to the menu over the last year or so seem to be perfect for the bar.   The bar tenders have completely changed over from the names in my last review... you know what they are still awesome!   I think the thing that impresses me most about Flanny's is that on any given night you will see John and his wife working the floor with the servers helping to keep things going.  And when they aren't helping John is almost always talking with the customers, if he doesn't know your name he will know your face and almost always come over and say \"hi\".   Since my last review Flanny's has gotten involved in events for the local craft beer scene between outdoor beer gardens for special events (no patio so they have block out part of the parking lot) and the consistently excellent \"Third Thursday Tap Takeover\" Flanny's is as close we get to a \"Cheers\" type experience in Phoenix IMO.   Do yourself a favor, call up a friend and have them meet you at Flanny's you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "pXmXIHAqrre4XdUWo9QUDg",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. California tap take over... Mike Hess brewing hooligan Irish stout",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pXmXIHAqrre4XdUWo9QUDg/o.jpg"
      }
    ],
    "user_id": "GyCsL9LN7UE3YcfIOpj9wA"
  },
  "ZDDlf-t1du5c1ojgqDBKhA": {
    "date": "1/2/2015",
    "text": "2.5 stars  Kinda lame experience, food was a little bland and underwhelming, service was mediocre at best. Ordered the Flanny's Favorite Burger with egg, bacon, etc and it was lacking in flavor. Everything was fresh but severely under-seasoned. They should train the cooks to season the meat before they put it on the grill (and the egg too!).   I felt the beer list was a little lacking as well. Lots of choices but many were similar. Only 1 IPA and 1 Pale on the entire draft list seems a bit low in my book. I know it changes frequently so maybe I just caught it at an off time, also 2 beers were out. Would have liked to see more choices of these. Also a more extensive bottle/can list would have been appreciated. I did enjoy the mac and cheese though, it was yummy. Service was just ok, our girl was friendly but at times absent. I dont think I would return",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "snDjs1hdh7JOWv4jjbXPDw"
  },
  "YA-YlQ-6j7lpevK2NItRzA": {
    "date": "10/28/2017",
    "text": "This is a pretty average place, lots of beer and wine selections and the staff is very good. If I'm in this area I will stop for lunch. I've been here a few times for dinner as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5_YkZMphwEzSKy35jDxr8g"
  },
  "Iq0mK_w3hAMQRJew5YedxQ": {
    "date": "9/8/2018",
    "text": "always enjoy the atmosphere and friendliness of the staff, with good variety of beer and food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yG1bQCwcONvBNpX-xXIHkA"
  },
  "9fqSU1sVSeWwsyndiDDiHg": {
    "date": "8/17/2012",
    "text": "Pretty decent bar food.  Atmosphere leaves a lot to be desired. ust lacks any personality.  Just looks like your typical sports bar with lots of free beer signs that they get from the distributors.  I applaud them for having a nice selection of craft beer but the food is just such a major let down.  Can tell they cater to the regulars and tend to ignore those they dont know.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kgmvv8Y7WJLNOvbIiKHCoA"
  },
  "bz_g3v8I3LFBFfOnbY4wEg": {
    "date": "3/1/2013",
    "text": "decided to try this place out on a Friday night but walked in and the place had an odd smell. Thought maybe it was just by the door so found a seat and sat down. ordered a drink and realized the horrible smell was through the whole restaurant. It smelled like rotten eggs and could not order anything to eat because the smell was so distracting. Drank our beer and left. We won't come back here!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1dn5WsKxUptnUQZB1xeLsg"
  },
  "zZ9EFYE-OuYZp53cvp8eWQ": {
    "date": "1/21/2013",
    "text": "service was good, beers were good, and the food is ok. but what's up with the owner? I was in there a few weeks ago with my fiance and noticed a big, grumpy fat guy with a permanent scowl on his face.  he was pacing around the floor, obviously irritated and in a foul mood.  At one point he was raising his voice at around the waitress, and I even heard cursing(he dropped the f-bomb) at the staff. Because of that I only left one star. How unprofessional. There are plenty of bars in this neighborhood-- we won't be returning to this one.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zVBPGAkMMh9lk1DDkKsmmA"
  },
  "TF1luUQ-eYcgAi1eIBd3mQ": {
    "date": "12/31/2010",
    "text": "We have eaten at this neighborhood Bar about 5 times since it opened.  We really like it!  The food is fresh & the bread/hamburger buns are about as good as it gets.  We've tried everything from chicken & hamburgers to salads, fries, soup...all good.  We found the staff to be very friendly & the prices very reasonable.  I definitely would like to see them succeed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "cYXNBwJWla3VZyB6b4Wttg"
  },
  "P9SxBUi1crRRFw7-Wo6COQ": {
    "date": "11/4/2011",
    "text": "Expensive. Horrible music. All dudes in there. Didn't try the food. Lots of different beers, but at $5.50-$7.00 a pint, you rack up a nice sized tab quick! I'm good on this place, maybe if they had better specials, I'd go check it out again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GN-RjJFQ8GpcotTMR_Hwfg"
  },
  "NU1v9Mu7zcRdvxw9nn1KDA": {
    "date": "11/20/2010",
    "text": "You want a new neighborhood bar, Flanny's is the place for you. The verity of beers on tap, in bottles, and cans is just great! They have just about any kind for whatever mood you're in. The Staff as well as owner (John J. Flanagan) are friendly and ask questions to guest on how they can adapt to accommodate their surrounding neighborhood. As for food, I am a huge wing fan, I've had crap wings and I've had good wings. I've had the wings at Flanny's about 6 our of the 7 times I've been there. How do you think i rate them? I've also had the chicken strips which were not the greatest, still weren't bad. They also do sandwiches and burgers which I'll have to try when I choose to pass up the wings. Now the good stuff, the beer! This place has quite the selection from sleepy dog on draft and $2 16oz pabst blue ribbon cans. I also never had moose drool in a can, and they had it, so i had to try it.  I give it 2 thumbs way up if you're looking for a nice local place to hang out, eat, drink, watch the game, or play Golden Tee and silver strike.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JLuip-9Wuw1vz_4wdKi1YA"
  },
  "5FjqIw735w8qBuh7oDM_-g": {
    "date": "3/3/2019",
    "text": "My husband got an email that said Flanny's closed last week. Bummer. This was our neighborhood bar and we will miss it. It looks like a sandwich place is taking over the space.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 6
    },
    "photos": [],
    "user_id": "DvDEccGguYTxxPDNU35y8w"
  },
  "Hqs07_MQEJJOUD4gpPohNg": {
    "date": "3/6/2019",
    "text": "So, John just refused to serve me at Flannys  I had worked all day wiring a 20-amp circuit to my tack room, and rolled up to Flannys on my BICYCLE holding my first can of Coors Light.  My first - on a bike - exhausted and clearly sweaty from working all day  He saw me throw the empty can in the trash can out front, then walk in  He intercepted me and told me I wasn't going to be served because he has no idea how many beers I had had before walking into Flannys (one 12-oz can of Coors Light)   Interesting management style, especially to a customer who spends $200 a week there and has for 7 years.    I'll be saving a lot of money.    This is the 6/7th incident, and there are plenty of great food and drink places within a 2 minute bike ride.     Later Flannys, you had me, and you mistreated me and my friends too many times.  Good luck.    It is with great happiness that I report that Flanny's has closed permanently, and that it will be replaced by a group of folks who actually give a crap about their customers.  Good riddance....",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "egFlfG7tDD_y_WK1Lvq0jQ"
  },
  "T1LAIXGAy8Pa2Nk100dfFQ": {
    "date": "1/8/2019",
    "text": "Our favorite local sports bar and grill. Great place to  meet with friends or bring the family to. Flanny's staff is friendly, the food is better than the average sports bar fare, and the bar has a great beer selection on tap.   I haven't been to a tap takeover but I hear it's ridiculously crowded. The owner is also extremely knowledgeable about beer. Wine selection is nearly nonexistent - limited to like, two reds and two whites, but its more of a beer-oriented place so I don't hold that against them.  Our toddler loves their mac and cheese and coloring on their kids menu with provided crayons.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "S1NQi8H3qo4eEyfwcILXfQ"
  },
  "36_8haOx2Gpl9vbRp-smIw": {
    "date": "1/25/2019",
    "text": "They have really good food, the only reason they're not getting the whole 5 stars is because the speaker system for trivia on Wednesday's, which I LOVE, isn't great. I wish they'd have one of the TV's have the question on it. Besides that they've got tons of different domestic beers on tap, some I'd never even heard of...  Take care y'all This is Sam, peace!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "5LQdkKOwpwsBikhAYYGIag"
  },
  "ZTxVAWs2_slHvikRGPjw6Q": {
    "date": "10/22/2018",
    "text": "So I'm not a really big burger person but they do have pretzels and these pretzels were big and soft and chewy and tasty and the best I love pretzels and I got to try with marinara sauce and cheese sauce and even a little bit of us salsa mix so it was pretty good also I like the chicken wings course I'm always a sucker for chicken wings got to come out and try it",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "qURtaMkkiSUEKm7Fy_1jtg"
  },
  "VyGkeSPKfm0b4WF4ZIbY_Q": {
    "date": "4/21/2018",
    "text": "We wandered in one a Friday afternoon after a friend recommended the place. This little stop is everything I'd hoped it would be. I was excited to see great beer options, a large selection of craft beers in cans, and went for a local lager on tap. The service was quick and although our waitress wasn't the friendliest of gals, most people in there were quick to check on us and keep everything topped off.  I was so excited to see the grilled veggie wrap option (for us non-meat eaters out here, hehe), and the additional side of sweet potato fries! So good. As the sun set they opened up the blinds and the place had a great open, friendly feel to it. So glad Flanny's is so close to home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5Lp_JTuD5BZdJ1Hpi2_VLg",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Grilled veggie wrap and killer sweet potato .",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5Lp_JTuD5BZdJ1Hpi2_VLg/o.jpg"
      }
    ],
    "user_id": "t9EFLbZjnVd8biIMGw2WzQ"
  },
  "nXED_mm8BwArhCCX1zrO2A": {
    "date": "1/24/2019",
    "text": "Awkward. Just a weird feel sitting at the bar and the owner(s) is standing doing nothing but watching the bar patrons and the front door. Go do something! He looked depressed with both hands on his head sitting down and then getting back up. Go clean something, go walk around and talk to your patrons. I almost guarantee you that if you are interested in your patrons, they will spend more money. I was there for almost two hours and the guy did not move but a couple of times. I don't want to have you watch me drink my beer on every gulp.  The bartender acted like she did not want to be there. Yes, provided direct service but no personality. The red car in front had more personality. I was going to order additional food that totaled $24.00 but decided to keep my money in my pocket. No talking, no thank you's, no welcome in, no take care, nothing from Sam.   For a first timer coming in that would've made this place a regular visit now,don't think I'm coming back. The issue I see was the place was dead when we walked in. I don't understand why these folks would not want me to spend more money in their establishment.  Little things go a long way. I don't see this place being in business much longer if others feel the same way.   Btw, $12 for wings and $1.50 for grilled. Pretty much $14.00 for 10 wings? You realize this is Tempe right, not Paradise Valley?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "0QdbsMs4xgVG9IITbywm5A"
  },
  "Ik24zWV2r-g83Ss5uF5u2Q": {
    "date": "11/5/2016",
    "text": "We had a mini high school reunion of sorts here, reconnecting with a friend we hadn't seen in years. Flanny's offers a daily happy hour from 3-6 every day and all day Sundays with discounted drinks and appetizers so we came here to take advantage of the deals.   We shared some fried pickles, hot wings, Southwestern egg rolls, and a pretzel. I didn't care too much for the excessive cheesiness of the egg rolls but I did like the crispy fried outer layer with the chicken and pico de gallo. The pretzel was soft and came with brown mustard, the wings were nicely hot and the fried pickles were lightly crispy with good flavor. I also shared a poblano burger which was cooked more medium well than medium but was overall good. It came with roasted poblano pepper and I liked the little kick of heat in it.  Flanny's, however, is most well known for their unique craft beer selection and today's selection was indeed uncommon and impressive. The most unique beer I saw was a New Belgium Ben and Jerry's Chocolate Chip Cookie Dough beer. It tasted pretty good! It didn't have a lot of cookie dough flavor though, just a hint of it towards the finish of the beer.  Service was friendly and drinks were refilled as needed.  Overall it's a great place for unique beers and a good hangout spot. We laughed and reminisced about our school days and had a wonderful time catching up. Thanks Flanny's!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 10,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "IkBfBRE8r83aU9BBibdoHA",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Poblano burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IkBfBRE8r83aU9BBibdoHA/o.jpg"
      },
      {
        "img_id": "cK1jez32XvgFmeFycvpyVA",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Southwestern eggrolls",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cK1jez32XvgFmeFycvpyVA/o.jpg"
      },
      {
        "img_id": "ZYED1hjFocP-s4PAqW4BUw",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Hot wings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZYED1hjFocP-s4PAqW4BUw/o.jpg"
      }
    ],
    "user_id": "DK57YibC5ShBmqQl97CKog"
  },
  "jCs6TV_SdwvJAph9xgPeKA": {
    "date": "5/3/2018",
    "text": "A favorite spot for food and of course- beer! They rotate their beers often which make each visit exciting! Not pictured is the buffalo chicken wrap, that they kindly let me swap the chicken for their spicy potatoes(give it a try!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cxQJu4za6wupWZp1PdkU2g",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cxQJu4za6wupWZp1PdkU2g/o.jpg"
      },
      {
        "img_id": "HIsgyWx3gvtaRheVMl1pAA",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HIsgyWx3gvtaRheVMl1pAA/o.jpg"
      }
    ],
    "user_id": "5kSvUN2bVshdHJmU8UZPaQ"
  },
  "TEbv4PK4VjPd0BozimE9ZA": {
    "date": "1/19/2017",
    "text": "Went to Flanny's tonight for Third Thursday Tap Takeover (Odell). We came in and were seated at a small two-person table between two large groups of older gentlemen (read: very very loud groups). A little disappointed to be seated here with several other open tables available - the two of us were practically yelling at eachother to be able to hear and having to repeat ourselves the entire meal.   But anywho....ordered a couple beers which were delish. The fried pickles were hand breaded in house per our waitress - good flavor but a layer of grease at the bottom (we had to take 2 napkins to blot the bottom layer of pickles before they were edible). My blacked chicken had great flavor - yum!  Overall, id come back but not at the top of my list in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CSufOIoMtIbzwf3tb6g4Qg",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Blacked Chicken Entree (w broccoli)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CSufOIoMtIbzwf3tb6g4Qg/o.jpg"
      }
    ],
    "user_id": "jQjuysPsJRdeUGkvSEIOcA"
  },
  "EqjNOnvBAN9QOYpvr67Aeg": {
    "date": "12/7/2018",
    "text": "5 BEER MAXIMUM. Not posted, not mentioned but you will be cut off after 5 beers.  I am not a small man: 6'5\" well over 250lbs and had 5 light lagers 3.9% in 2.5 hours and could not have a 6th when our wings arrived.  If that's your business model for a BAR (eye roll) so be it but it should be posted or at least mentioned at some time so the customer is aware before being surprised.  I'll NEVER return, nor will my friends. Bad business practice (not necessarily the limitation but the failure to inform)",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RReCPCskkByTvAvk62OSQg"
  },
  "nTg70ApmUYNYfhRbBb1X8A": {
    "date": "5/2/2018",
    "text": "Sometimes you're seeking a good lineup of beers and you're at a loss on where to go since no one in the greater Phoenix area seems to have consistent taps.  Well, try Flanny's at ANY given time and you'll be satisfied if not elated! John, their owner, is a great guy and he's always willing to shoot the breeze with you about beer, whiskey, life, and the pursuit of happiness.  Take a moment and check out Flanny's - they have stellar food, excellent service, and hidden gems they're waiting to tap that other places would KILL FOR!  Case in point: John tapped Deschutes'  2015 The Abyss keg last week and NO ONE has this in the state - it was bold and DELICIOUS!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "74K_YHQTFTO1ELs7wRhVcw",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Deschutes The Abyss 2015... On tap NOW!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/74K_YHQTFTO1ELs7wRhVcw/o.jpg"
      },
      {
        "img_id": "2uTTvtev49FXPwCkjHF1Ig",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Firestone Walker and Pacific Gravity Homebrew club collaboration... PGH Weizenbock... Do it!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2uTTvtev49FXPwCkjHF1Ig/o.jpg"
      },
      {
        "img_id": "-h1XNdR7PvENF0l1XGVP2g",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. La Cumbre Project Dank",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-h1XNdR7PvENF0l1XGVP2g/o.jpg"
      }
    ],
    "user_id": "YYZA6spy8x5W4sd6Tbqqog"
  },
  "G1z9Zg7oumShHCn_f4FZ0Q": {
    "date": "8/3/2018",
    "text": "What a gem!  My family came here for dinner on Friday night and we were pleasantly surprised!  The previous Yelp review do not do this place justice. Jacob was our server, he greeted us quickly, we had drinks within minutes.  The food was great, hot and arrived very quickly.  The beer menu had a great selection. We each had a flight, something for everyone with our diverse beer likes.  We had the street tacos, BBQ burger, pulled pork sandwich and triple decker.  Everyone gobbled their food.  I would come back again!  In a heart beat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dtGjBp4_AOm033Le5qxAlw"
  },
  "gs9m8ExIgGYV4v261bXJDA": {
    "date": "9/15/2018",
    "text": "We stopped in today for an early lunch. The first thing I noticed is how clean this place is. Secondly the staff and owner are very friendly. Thirdly the food is amazing and the beer selection very nice. We really enjoyed Flanny's and will highly recommend it to all. The nicest part was the tab was VERY reasonable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yjtld1UtMe0mnzZkueHz4w"
  },
  "xhZ8QyO1OvdlUM7MEd3_sg": {
    "date": "7/15/2018",
    "text": "Honestly, I cannot believe we are only hearing about this place now! It is the coolest little spot. Their craft beer list is so solid, their food is AMAZING, and their staff is super friendly! I have literally nothing bad to say about this place. We had the chipotle Mac with bacon, buffalo chicken egg rolls, and the flannys burger = 10/10. Our server Robbie gave us great suggestions and told us about the specials. He was super great! We will be back very soon and if you haven't been, you definitely should. The atmosphere is really nice and their music playlist is on point.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lzf7NsjgMOIecyzKD9eRSA"
  },
  "w64ZnRwJyeEEbpyIfa8Wfw": {
    "date": "8/12/2018",
    "text": "Hands down the best local spot for a craft beer. Great selection and they're always changing. Decent burger too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o5_-_4iqFd-a4e2dizZHYw"
  },
  "hnIliMBcjLQiKpEs-BdZew": {
    "date": "2/21/2018",
    "text": "Captains Log.....Star Date: today.....coming into Flanny's was an epic and a rewarding experience. Have to give the best shout out to Team Awesome, consisting of Cassie, Ashley, Diana, Teshya, and Sawyer. This combination of customer service, and making sure that everything was on point, just made the overall experience even better than the last.   Under the direction of Team Captain John who's leading the charge this evening provided overall oversight making sure everything went smooth and according to plan.   I have to ask the question, why are you not here enjoying all of this fastasticus eventificus......so get down here and enjoy absolutely everything.  Thank you to Team Awesome and Team Captain John for making everything stay in Epic status.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kLoQn9yZePRkiGVGGuUCYA"
  },
  "oLHijjGTDRSkQbsjfsLI0Q": {
    "date": "12/27/2018",
    "text": "I've lived in chandler and one day I was driving and thought I'd try this place. Very good, the flannys favorite burger is awesome. Today, I'm a small vacation and stop by to fulfill my craving....just like before always good to stop by and have my favorite, esp with the craft beers they have.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVfjNvtCJAmKSXZ1hmghMg"
  },
  "kWDwX3vPBj1IiknwD0kcxg": {
    "date": "7/6/2018",
    "text": "Food and drink selection are as good as it gets. However the service couldn't have been worse. Took 30 minutes to get a beer, server had to be flagged down to get a water refill and hopefully you got in what you needed before she speed off because once she turned around she stopped listening. After having enjoyed happy hour here many times and this was disappointing Makes me question going here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SN2uzOXzNszSx_f-eN2UYQ"
  },
  "fmyNX_2Fpj7FUhNXO9pAZg": {
    "date": "5/30/2018",
    "text": "I gotta say that, I'm very disappointed with this establishment! The waiter was AWESOME(the 1 star is for the awesome waiter) but, I had the worst experience with attending Trivia night.   Attending Trivia night, your team's are allowed to pick a team name which is cool, however, the team names should be approved by Management prior to being announced due to being inappropriate.  There were a group of people who picked the team name \"Ambien makes us racist too\"! This is inappropriate, as well as, should be unacceptable... considering that there were a few people in the establishment that were minority. (Hispanics as well as, a young black lady).   I can't imagine how they must've felt hearing this name being mentioned several times!!!   If you want an establishment that is welcoming and inviting to all backgrounds then you should probably monitor what is being represented and announced!   I will NEVER go here again and advise anyone who is \"not racist\" to avoid this place as well!!  There should be a zero tolerance for this type of behavior PERIOD!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7wzmYrxrjXPaLQhK2mTNNg"
  },
  "m6utG9QQx9Ixr_aWE399wg": {
    "date": "5/29/2011",
    "text": "If you love beer, you will love Flanny's. Part of the management homebrews, so they have a beer lover in the house. They are always ready to pair you up with the right beer for your tastes and the selection is extensive. A full bar seems overkill (says this beer hound), but is appreciated by many. The service is over the top - so, I suspect that the negative reviews are due to the reviewer. I am new to the Phoenix area and was referred to this place when I mentioned that I love crafted beers. In other words, I have no connection with Flanny's - other than being a raving fan.  They seem to have a great relationship with the local breweries, so the locals are well represented. They go through so many types of beers, that their tap beer often changes. I'm guessing that there is around a dozen taps. The taps do tend to favor hoppy beers, but - truley - there is a beer here for any palate. If they don't have what you desire on tap, it is probably in the cooler in a can or bottle. Coming from California, I appreciate that they have some of the best small breweries represented from there (particularly San Diego County), but well crafted ale from the entire USA is present. Their selection is largly American - which suits me fine.  The food is above average for a pub. Lots of folks order the burgers, which are good. I really like the ribeye steak they offer. Everything I have ordered was tasty and fresh.  It is a good sport bar with several TV's and an accomidating staff. Pricing is reasonable. I'll keep going back...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOczuGZ6EVDOHF97jp_EgQ"
  },
  "iFznymZ-woUGn_g0C12w-A": {
    "date": "9/11/2012",
    "text": "Bad service, mediocre food, long long wait times.  We specifically ask for wings before our meal because for some reason, servers think a person will enjoy their dinner to be cold sitting on a table while we eat an appetizer.  Was no different here, waited 25 minutes for our appetizer and then receive our actual meal 2.5 minutes later, yeah I was being exact.  What the french toast?!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EPtsM7ROO1HKXfMv51ebNA"
  },
  "89cSntKi1pEb_ntSUXOyEQ": {
    "date": "7/1/2011",
    "text": "Seriously......does it get any better than this?  I'm back in Phoenix for business, and I stopped by Flanny's again.  I left my beer selection to the bartender (they have craft beers I've never heard of, and an amazing 22 of them on tap!) and ordered one of their killer burgers.  The beer and the burger were the same.....delicious!  And by the way, fantastic fries. One thing for sure, next time I'm in Phoenix, I'll be at Flanny's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IBb0-vMhLpP17wTWD-eTIQ"
  },
  "kwZIy2nEPH06GitFFoLg4g": {
    "date": "4/1/2011",
    "text": "Nice selection of beer on tap and try the Mac & Cheese--its sinful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "O2GWjl6VJM9kOdljxolLmQ"
  },
  "1QpbJNpGPasVvTu3hTR_2w": {
    "date": "5/30/2013",
    "text": "We all need a pub to relax and wind down after work and be able to shoot the shit about whatever the hell we want - whether it's which co-worker is about to overdose on the boss's dingleberry dust or who's dipping the pen in the company ink. And this is a great place for it. Food is pretty decent and definitely several tiers above standard bar food. They always have different beer to choose from than the week before and once in a while there are promotions. Once I got a free pint glass with a brewery logo on it and a bunch of stickers of various beer brands which were all NSABS (not safe as bumper stickers). I always feel at home here - service is always good and people are cool. That is, the clientele and people working there are cool. Once, I must confess, I brought a friend who should have been left back in his mom's basement in hindsight. Yeah. You know. We all have that friend. The one you can't take anywhere. And it cracks me up that on the list of beers for the week, Flanny's always has the one choice with the least alcohol content from the Anheuser-Busch brewery - the beer of kings. And that is what said friend pre-loads on before we go anywhere so that the night is \"cheaper\". Well this time around he decided to go for the higher alcohol percent - 10 percent. Whoa. Shoulda stopped him. Next thing you know he's seeing Dungeons AND Dragons as well as black helicopters and False flag terrorists in every pot under everyone's bed. Then when we were ready to leave for the night he lost his mind over the fact that the waiter gave us pink pens to sign our credit card receipts. He decided that the fact that the pens were PINK was some sort of coded message from the waiter that he suspected us all of being part of the LGBTOMGWTFRU community. I had to convince him that they were pink not because the waiter thought we were fifty shades of gay (not that there would be anything WRONG with that of course) but rather maybe those were the ONLY freaking pens they had - it's not like they had a box of 64 different colors (like we had crayons in kindergarten) and they specifically picked out pink. I told him if he were that insecure about his masculinity he should just buy a muscle car or monster truck and that would well make up for perceived lack of length, girth, radius, circumference, or whatever other dimension was getting him down. So yeah. This place is not really for EVERYONE. Take those folks who won't drink anything they can't pronounce to the Sand Bar instead.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0d7gFJUi4cV3I7j1dHn9fQ"
  },
  "9P678o0JKcUhDaKoYMXDhA": {
    "date": "12/16/2010",
    "text": "I would love to see this bar succeed.  I think a couple of things I feel they could do better.    A couple of criticisms -   Food:  Flatten out the chicken for the chicken sandwich.  Makes it a lot easier to eat and stays on the roll better.    Service/Waitstaff:  Although I think the service is over all good.  They aren't that exciting.  Often times I go in there and other than my order, I literally say 3 words to the bartender.  It's the bartenders job to keep people coming back.  They need to strike up conversations to make the visitor feel that they are important and create a fun atmosphere.  Also you will never get the night crowd if most of your waitstaff at night are men.  It's sexist to say it I know, but this is reality.  Zipps is crowded for a reason.  It's not that they have the best food in the world but they have a nice looking waitstaff.    Atmosphere:  That Jukebox needs, I stress NEEDS to be on at all times. Music is the key to conversations, mood, and attitude.  Without it, it will suck the life out of your bar.  One of my visits there were with 3 people at the bar and no music playing.  No one was talking. No one looked happy.  I threw in a couple of dollars in the jukebox and saw a transformation that you wouldn't believe unless you were there.  All of a sudden you have people talking, laughing and when other people came in you could instantly see them digging the vibe.   Flanny's is pretty big concrete and airy.  Meaning there isn't much to deaden the sound.  So if there isn't any music playing it's awkwardly silent and all you hear is a sports game on the speakers.  I guess you could say, well put some money in the jukebox then.  Most people are not confident enough to be that first person to enter in their song selection.  So in reality by not having the jukebox playing you are actually losing commissions on your jukebox sales.  Assuming they are getting commissions.  Either way people will leave when they are bored.  I will keep going back to Flanny's for sure. But it would be nice to see them continue to listen to their visitors.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "M_bfyWDahnp8XJKfxvrRaw"
  },
  "gd8X6B0Qd-pVbleRBmJLMQ": {
    "date": "3/10/2013",
    "text": "Started out pretty good at this bar we spent around 130.00 for a party of 4 then I made a mistake on the type of beer that i ordered the bartender chelsea refused to take it back and replace it with what i wanted and the attitude she presented just ruined the entire evening....So take a good look around because this place will never ever see another dollar from me or anyone that i know that is thinking of going there",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "VUlcQmCju0eLaxWiFN95ig"
  },
  "I63YLa79kuipEkF6nz1z6g": {
    "date": "6/21/2011",
    "text": "Suburban strip mall bar that is small, with a focus on those craft beers.  Quasi-sports bar feel too.  Service was hit and miss, and our bartender seemed like a manager or owner, a fortysomething with big gut, normal legs, and 80's short haircut.  Trivial chat with other folks took priority over us having empty beer glasses for nearly ten minutes, with somewhat spicy food in front of us too.  Never got that ice water I requested earlier as well.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Q4Qfu-3vYtL1LRm2X1b0Gg"
  },
  "FVViNVVsPVxZDgaYh9Ro5g": {
    "date": "5/24/2013",
    "text": "this place is NOT a sports bar. don't let the 4 large TVs fool you. we went to watch college football games this saturday and we had to BEG to have them turn the sound on for the ASU game. the bar is IN TEMPE!! they kept telling us a band was coming on and we told them that 1/2 the bar was there to watch the games and if a band started and the game's sound was turned off, we would all leave. this did not deter them from turning off the sound during the white knuckle 4th quarter and having \"the band\" take over. \"the band\" was a chick on a stool playing depressing girlie music that was just about the worst thing you can imagine listening to when you're yelling at vontaze to rip somebody's head off. the only reason they get 2 stars is because my brew was delish.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "MCojnaKWl8FOG3E5trS5jg"
  },
  "xX74Ue23ITOwDKvmt3UZKA": {
    "date": "4/13/2012",
    "text": "Great beer selection, and upscale fancy bar food.  Friendly staff.  I think the best part is all the craft beer on tap.  WHICH they let you sample!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mq6Ik-CAPyVUNn-T0R0CSQ"
  },
  "frJfL9yTgHk2I1Jq63T-zw": {
    "date": "5/16/2014",
    "text": "I always have a great experience here!!! Fish and chips...outstanding!! Great service...great beers. People that give this place bad reviews should just stay home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZC42c9nkQFYkhXMiFofGw"
  },
  "iAUSNoOiBbTIJY--icH7yg": {
    "date": "2/16/2012",
    "text": "Wow, what a horrible experience at Flanny's.  I guess I should have paid more attention to some of the 2011 negative reviews of this establishment.  Food is very average.  Beer selection is extensive.  Prices are reasonable.  Service is atrocious.  Atmosphere is bland.  The location has potential but unless management decides to sit in the back office and allow employees like the bartender \"Steve\" - the guy is one of the best bartenders I've ever met - to be the face of operations, I'll never return.  It simply has too many other flaws and competition to overcome poor and rude service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Zc4iHV1i4t0xqiy_-Nezw"
  },
  "rPwoXMgM8tjpywK9zVDO7w": {
    "date": "4/26/2013",
    "text": "I live in Henderson, Nevada, but this is my new favorite place when I'm in Tempe. I've lived in the neighborhood for over 15 years and this particular location has had a lot of turnover. Stopped by about a month ago, and was disappointed that I hadn't been coming here since they opened two years ago. I can be a bit of a wine and beer snob and this establishment meets my beer expectations. Great craft beers on tap or available for purchase in their \"special\" refrigerator. Great bartenders and the owner Jon is extremely personable and knows his beers. In addition, the food is great. Large portions and tasty. Had their fish and chips a couple of weeks ago. Four large pieces, not greasy and ordered the sweet potato fries. Yummy! Their burgers are huge and their Cobb Salad could feed a family of four. I'm heading back to Tempe in May and Flanny's will be my first stop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WN8JmvMhHwBB3Q95UCuSsw"
  },
  "yASW_tD11PMZa7-yJE0wyA": {
    "date": "9/16/2013",
    "text": "Talk about rude & mean.  This place is awful!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "geLMAmA5sNjZn3aYYkzcuA"
  },
  "R4QGK2cL97KnSEDN_JDIHA": {
    "date": "7/15/2011",
    "text": "Went in last night for dinner with my dad. Chris, the bartender, was very nice and attentive but the place was pretty empty so I can't speak for staff on weekend nights. I sampled two different beers and finally ordered one of the specials off the chalk menu (a light raspberry brew I now cannot remember the name of) on the wall along with two appetizers ($1 off for Happy Hour!). The Loaded Baked Potato Fries were pretty good - a plate of battered & ranch-seasoned natural cut fries topped with cheddar, bacon, sour creme, and chives. Also had the Pulled Pork Sliders which were mediocre but not bad - three small hamburger buns with barbecue pulled pork. The sliders could use some toppings like a sauce or cheese, but the bread was good. Dad liked his cheese steak but I didn't try it. On the desert portion of the menu, it says to ask about that week's special desert. It was turtle cheesecake but they were out of it (by Thursday?) and the other options are not interesting (float or \"pizza\" cookie). There is a huge beer selection that rotates with availability and seasons and free samples of those on tap before you commit to a full glass. Friendly bartender and owner were on hand to answer any questions about the beers. Neat collection of tap handles all around the restaurant.   Overall, nothing really special about this place besides the beer selection and live music (M.T. Rox played live classic rock on a beautiful Ovation for the duration of our stay). There are a handful of flat-panels around the building for game watching with plenty of tables, bar room and a few leather sofas. If I was into sports, it would be a great place to watch a game and have a beer with friends. For someone not into that, however, it's just a place to sample some new beers. I would go again to try their house Mac & Cheese and new beer selection if I was in the area but I wouldn't go out of my way.   Service - 4 stars, Bar selection - 5 stars, food - 3 stars, ambiance - 4 stars. Prices are reasonable. Give it a shot if you live in the area and enjoy drinking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "94HchNwPr69BdrF0On9uKQ"
  },
  "Qw_kT9tmL1f2SHYynSr4uw": {
    "date": "2/6/2015",
    "text": "OMG one of the best experiences I have had in a long time. My girlfriend and I are in the restaurant industry and all we do is go out and try new places but this was the first place that truly impressed us in a long time. The atmosphere is really laid back and as soon as we mentioned to the server we had never been here before the owner quickly stopped by. He took time out of his busy day to talk with us for a while about everything from how the restaurant got started to craft beers and upcoming events. He seemed genuinely interested in talking to us. Next they have an amazing selection of beers on draft and aparently they are always changing wich is great for someone looking to try something new. Last the food OMG the food all we did was split a bunch of appetizers but each one was better than the next the wings were perfectly cooked and the house made sauce was so flavorful I would come back just for the wings if nothing else. The pretzel and the sliders were amazing too. We live 40 miles away but we will definitely be back again. Thank you for everything everyone at flanny's you guys truly are the best!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "k-rJ5oLLPl21sHcem7gwww"
  },
  "BzC-IRvWjFf4FHVK2t7h8A": {
    "date": "11/5/2011",
    "text": "Terrible. First impression- walked in, approached a table and a gentleman stormed up and stated \"you can't sit here, you need to leave this table\".   Ok.   Confronted him after a short while and apparently he is one of the owners?  John?  After an amory of excuses, (so stressed out, bad night, etc) he offered to buy us our first round of drinks and I accepted the offer.  Bad idea.   The evening progressed and our friend approached us telling us he was leaving.  What?   He had been \"kicked out\" by a bartender who believed that our disabled friend, who had an accident several months prior and couldn't quite walk properly was over the limit.  Unbelievable.  This upset me and I started crying!  After confronting the owner \"John\", he stated that there was nothing he could do, so we were invited to leave.  Unbelievable again!   I will never go back to this establishment.  Being in the hospitality industry myself, I was greeted with noting but excuses and fabrications that would never fly in my industry.  Please note that this review was written after having the exact same number of drinks that my \"overly intoxicated\" kicked out friend has had.  I will never go to this establishment again nor will I ever recommend to my friends.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "SfYKj-jX0lUgSKDSEr6EQg"
  },
  "CghUX4JZfb1XW34iBp9OWA": {
    "date": "9/10/2012",
    "text": "Flanny's could be a real good watering hole for locals. They have a lot of different beers on tap. Just don't ask to sample anything because the owner will not allow it. Even if you have spent hundreds there. The biggest problem there is the owner. He needs a class in customer service. Or just don't show up. He's there all the time and you can tell he is micro managing. I went there with a group of people to watch the Sunday night football game and he wouldn't turn the sound on because there was a table of 4 people eating. The way he handled it was poor. He basically said leave if you don't like it. We were going eat as well. I don't think the other table would have minded. He could have even asked them. But we were polite, got up and left. Went to ZIPPs to watch the game. No wonder they were almost full and Flanny's was empty. It's a shame that I won't go there now unless I have to. And I don't.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i2J1sI3vHR3GlXPFPClBTQ"
  },
  "02PMLh4R3rPK76-MaoZ9Jw": {
    "date": "11/2/2010",
    "text": "One of the best neighborhood bar and grills that I have found. Great atmosphere, upscale bar grub, super beer selection, and quick attentive help. Not a full fledged sports bar but plenty of TVs and games. They have all the ingredients to be highly successful. Clean and bright, very inviting feel, I've been back and it just gets better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9mMBTNlTGZAtaCzZM0k5sA"
  },
  "8ncSbSMmXMfnzhSUSJbP7w": {
    "date": "11/12/2011",
    "text": "Love Flanny's. Great beer selection, and the food is amazing. You have to try the chicken tenders, fries, and mac and cheese. Rarely do I find a bar that also had good food in addition to a great beer selection. Great service as well, always has a very welcoming and gracious atmosphere. Recommend it to anyone looking for an affordable, delicious dinner in a welcoming environment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "OF5diAGp8jU34vcjdkWJuw"
  },
  "7eU8CKFwXA0X9Gc0ExR4-w": {
    "date": "8/16/2014",
    "text": "Nice dive bar. Food comes in large portions, typical bar food, beer selection is nice. Service is good. Specials are even better which brings it from 3 to 4 stars for dive bars!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uAZ6Sp3uaH3TIztZqqtmPw"
  },
  "S9Q1-tJ3UJYhlwczFB-gjA": {
    "date": "10/10/2014",
    "text": "This is an ideal bar. The food is good (bar food) and the drinks are reasonable priced. I came here after a funeral with a large group of friends. We all ordered some appetizers, beers and shots. Everything was spot on. It's not going to blow your mind with flavor but it's exactly how you would like bar food to be. Very happy we came and might be back if fate ever takes me that way again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n5TbOFpspfiZKHuk5kdqnA"
  },
  "_5UyQB77JA5ApqWbc9DcDw": {
    "date": "12/3/2013",
    "text": "We've only been here once and it was for take out. When we got home everything was still nice and hot and tasted fresh. The staff was friendly and there was a fun band playing while we waited for our to-go order. We'd definitely make our way back here again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "v8QnvfWXCf4651Bxg2vvIw"
  },
  "BQl1aIeqLpAb9IsHwAslVg": {
    "date": "12/10/2011",
    "text": "I love, love, love this bar! With a great selection of beers at a decent price, this place is a must if you're in Tempe. Plus the owner is amazing!  We went on Friday night and enjoyed the live music and beer tasting they had going on. When the crowd dissipated, we sat back and enjoyed the company of friends at their expansive bar. We ordered several appetizers (those cheeseburger sliders are amazing!) and enjoyed all of them.   I can't wait to go here again!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ao7VufaimxISRa16MigJDA"
  },
  "g_adk5J_ts4Lg9ef-V5ygg": {
    "date": "9/1/2011",
    "text": "Nice neighborhood pub with plenty of regulars. They have good food, several TVs, and a solid happy hour deals. They fill up for lunch, happy hour, and on the weekends. It's also a good place to catch a game. Flanny's is really really clean - not divey at all.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "hq222DfEtM7kcyR22Kf7lA",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hq222DfEtM7kcyR22Kf7lA/o.jpg"
      },
      {
        "img_id": "9vFOi4gScRNmKekHRbkPng",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9vFOi4gScRNmKekHRbkPng/o.jpg"
      },
      {
        "img_id": "TIh50Gd8GaV554N9dF7O3A",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TIh50Gd8GaV554N9dF7O3A/o.jpg"
      }
    ],
    "user_id": "PeLGa5vUR8_mcsn-fn42Jg"
  },
  "87VGBnZHJG_oEj7xR3nFrg": {
    "date": "5/19/2014",
    "text": "Flannys is a great neighborhood bar within walking distance of my place. They really do have some tasty choices on the menu - such as the very lemony hummus - but the real draw for me is the beer. They have these great events every Third Thursday where they have a tap takeover from an awesome brewery featuring specialty beers and they are always a favorite during Beer Week with the Firkin events. I wish the prices were a little cheaper, especially for the local beers that are on tap a few blocks away at the source for a fraction of the cost. But its really good service and a nice atmosphere, i recommend it - especially for their events!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "no2kFt4TEEzZDVaM8haSDA"
  },
  "QzhtzQK6B1C1NeODgTsg_w": {
    "date": "10/29/2014",
    "text": "Five stars for the entertainment and food, and staff..a two for the management!  I love going to Flanny's on Friday nights because of the entertainment.  Last Friday night Gerry Mora was performing and as usual was excellent.  I was so distracted when the owner was making hand gestures to Gerry about lowering the volume....how disrespectful!!  John if you want to keep quality performers and customers stop treating them like crap!!   I'm done with Flanny's.  There are plenty of other places to go in the area....",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pQHGPWFX9QpmN48qaLdFpw"
  },
  "UdHiq-585h5P-ELhNsU2Jg": {
    "date": "12/4/2011",
    "text": "Went to this Flanny's place last night to meet up with a few fantastic friends that I have known for...well...let's just say a long time. I was the first to arrive, and had some time to get to look around and get a feel for the place. The first thing I noticed was all of the beer handles (not sure of the official jargon) around the top of the bar near the ceiling. It was at this point that I knew we had a pretty neat place. The bartender was very friendly and up front. The food, although it is bar food, was actually pretty good. But what I was most pleased with was the variety of brews available. I got to try some ales and IPA's that I never would have known existed, and they were all brewed within AZ.   Will I go back again, absolutely!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "vm0ARUhu4gOCGR1yOsxnhg"
  },
  "g3pOKAxLlr7ruqTAlQzodQ": {
    "date": "6/6/2011",
    "text": "I go to Flanny's on a fairly regular basis as it's close to home & always  maintains a better than average craft beer selection.  With only 16 draft handles I'm always amazed at some of the unsusual & hard to find Craft Beer that can be found here on tap. Examples include Stone Levitation, Sculpin IPA, Voltron & even harder to find brews from The Lost Abbey & Bells.  Moving on, the Ambience is quite comfortable, I can tell you ALOT of money was poured into remodeling this old sports bar before they opened their doors. Its a nice place to be. With such a great selection of Craft Beer & a posh interior, I expected as much thought to be put into the menu. Not So. Some creativity abounds w/ the sandwiches, however, the frozen chicken breast, the very same sold at Burger King really lets the team down.  On my last visit I had the Buffalo Chicken sandwich & just couldnt stop thinking how much better it would have been w/ fresh poultry.  The Hummus doesent taste home made(its so easy to make) & even when not busy can tend to take longer than it should to arrive at my table.  Note: the food over at @ Hungry Monk is by no means ground breaking but always seems to come out in a flash.  At end, I would love to see Flanny's put on their game face, bring some imagination to the food menu  & begin embracing our growing craft beer community.  Posting on FaceBook w/ Beer On Tap updates, beer dinners or perhaps special events that show us their passion.  Flanny's deserves 3.5 stars and is absolutely worth checking out.  I'd love to see them reach for 5 stars, I Think They Can!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-Sbcdh12BL82CswXT38GZA",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. 22 Tap Handles ay Flanny&amp;#39;s!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-Sbcdh12BL82CswXT38GZA/o.jpg"
      }
    ],
    "user_id": "5kWLbT_Rs6SnskEIo4NpMw"
  },
  "uSATqv4aAwh-LkQO4xwjgQ": {
    "date": "5/16/2011",
    "text": "I seriously can't find a single problem with this place. Except that maybe enough people don't know about it yet. They're family owned an operated. The staff is super friendly. The food is delicious with very generous portions. The beer selection is amazing. The atmosphere is totally chill, like a great neighborhood bar should be. Seriously, what more could you ask for? It's a bit off my usual path, but I have no problem going out of my way to return to this place. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "4GoS7G_fyGEHGMjcQ4msLw"
  },
  "GWJqG3LMlvPRrjhovrWFFQ": {
    "date": "6/19/2014",
    "text": "Another go to spot for a very large and wide selection of craft brews on tap. Occasionally have Tap takeovers by different breweries which is a nice feature.  Haven't tried the food but beer is great.  Bar feel with touch of sports bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wE-EJtWoLAZJSKDDDC368Q"
  },
  "Ob16fcawrdOtnr0clGWcwQ": {
    "date": "5/29/2013",
    "text": "Flanny's is a breath of fresh air in an otherwise congested craft beer industry! The atmosphere is inviting, no matter what type of person you are. The restaurant is very family friendly, unlike alot of other bar/restaurants. The food is second to none in comparison to almost any bar in the tempe area. For the quality of the food, you would expect a much higher food cost. As far as the craft beer selection goes, this place is absolutely awesome. Not only are there dozens & dozens of rare and quality beers to choose from, but there is always a unique event going on every month which always makes me feel like I'm some sort of officianado!  The best part of the bar is that there is never the beligerant, aggressive drunk that you would expect to find at some other tempe pubs. Everytime I have walked into flannys, my family has been greeted by the family that owns the restaurant. It is truly the definition of a family owned business that has put their heart & soul into making this a very succesful neighborhood bar & grill.  I would be remiss if I did not mention how nice the entire staff is! There is not a sour face in the place! I am so glad that this awesome business has found a home in my neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 5
    },
    "photos": [],
    "user_id": "B68LxrxXQotuQPG2a_tyPw"
  },
  "gK_DhCseSYPnITLNiM9LWw": {
    "date": "5/1/2011",
    "text": "Went here last night with a few people.  It was a Saturday night at about 7pm and surprisingly the place wasn't very crowded.  I guess it wasn't too crowded because this place looks to be a sports bar and there weren't that many sports happening on the tube.  Anyway, it was nice that it wasn't packed.  This place has a fantastic beer selection, good service and reasonable prices.  We only stayed for one beer so I didn't look at their food menu or notice any drink/happy hour specials, but my beer was excellent.  This is a great place to stop before a movie at Pollack Cinemas which is a few doors down.  I will return.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "8959F5stCzJWI_I7dgxurg"
  },
  "Ra9tsesN2cU5m6uAclY9vw": {
    "date": "2/14/2014",
    "text": "Great neighborhood bar, the way they should be.  Great atmosphere, food, and wonderful selection of beers. Located just down from the theater, great for a date night",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xK3LfgHZuV8-Ps4Qkr4Hvw"
  },
  "4ulf3zVXbJ1dQ_7hUXVidA": {
    "date": "4/17/2014",
    "text": "Great rotating selection of beers and good food to boot.  Nice friendly bar atmosphere that isn't too hard core bar-y (more every day folks not a heavy drinker bar).  Food options are fairly typical, but quality is definitely a notch or two above normal bar fare.  They even offer some healthy options or you can stick with fries which are always a winner here.  The food is fresh, well-prepared, and prompt.  Grilled chicken sandwich with avocado and bacon is excellent!  Love the awesome selection of beers and the owner takes the time to check in with everyone to make sure they're happy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IYht-Fws_thGedV4g2o6yQ"
  },
  "_PvBDRkzuYlODBEI_UJChg": {
    "date": "8/17/2013",
    "text": "Extraordinarily unfriendly.  We came to have a goodbye party for a friend and not only would they not let us share a cake because it was outside food, they yelled at us for using their knife to cut it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eTvhF6seFdSLGciS2hX3Hw"
  },
  "EQF_RL3eQpEI6osUT2Vo2g": {
    "date": "1/31/2011",
    "text": "For a sports bar, I think this place is great. They have interesting, seasonal beers, and a solid sports bar food menu.  The food suprised me, and I thought it was very tasty and really well done (as far as sports bar food goes).  Am excited to go back and try out other beers/food items.  And I rarely feel that way about a sports bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "OPN-dDUBkH7uH-G8nOnskg"
  },
  "nJoLsygvdH4XsMpMge4b7Q": {
    "date": "9/24/2014",
    "text": "Close to home and love their craft beer selection . Staff is friendly great place to watch local sports.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7OHLAwF9qav0fyofkTmcpA"
  },
  "e_nEuAGUGf7ueS7LHjk_4g": {
    "date": "2/25/2014",
    "text": "John jr told me to leave his bar because im black.So if your white you might not have the problem i had,if your black or Latino forget about it.The thing is,if your a person whos prejudice against other races,you have a problem within yourself and that will translate to bad service to those of his own race.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NA7ot3bEWELiGrD6hbvM6g"
  },
  "2yEe7ddCESQeLYQLwn8Anw": {
    "date": "5/15/2014",
    "text": "Flanny's always has a wide selection of delicious craft beer. Food is a little to be desired for but they are working on it. The beer more than makes up for it though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xRNEdytBlAol1hXnhlqJNg"
  },
  "HAM2Jc8iDfSgNOE_xUBweg": {
    "date": "1/20/2015",
    "text": "Sat at a table w just myself. I was the only one to walk in. The entire wait staff watched me. 3 tables came in, sat, got menus and ordered. The older server walked right by me twice. Took the next table menus. Am I invisible?",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "DVSjDsxntq9Qms3JAfHF4g"
  },
  "zJlZA4aMekutsItLksAnkA": {
    "date": "11/15/2015",
    "text": "Great selection of hand crafted beer's. Had the fish and chips and a cheddar burger with fries, portions are plenty and very tasty!! And excellent service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "p22kTkjpZqPFoBxns2rkDQ"
  },
  "Z_VVTemt-jtgKKU3ltFXzg": {
    "date": "12/10/2012",
    "text": "Quite surprised by this little neighborhood pub...  the selection of beer is always rotating and I always have a hard time choosing from their unique lineup.   By far my favorite thing about Flanny's is the monthly \"tap takeover\".  Gives you a chance to try brews that you'll rarely see in Arizona.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "IdA-rNU2ml_xHfNRfnyrkA"
  },
  "C-miNt0kx0J7YvxNxlJYww": {
    "date": "6/28/2015",
    "text": "Let me tell you about this place, wow!!! Just wow... I had the cheddar cheese burger ( add bacon to it), and fries. Well cook, delicious flavor, and good service. Love the my burger it was good. My daughter had the chicken pot pie, she liked it. She gives it a 7 out of 10. My girlfriend had the Southwest Burger she said it was yummy. So if you're in the east side of town and want some good tasting burgers this is the place to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "x3ZixlyFGfDdM9jG1ETObQ"
  },
  "szohW3OZTfOSIRKWu0_Bkw": {
    "date": "9/24/2015",
    "text": "Horrible customer service, small beer selection, overpriced and the owners a prick, Avoid at all cost! Hit up San tan instead",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ORz2xC8HHUhlJTvOTMPqUA"
  },
  "7XWc1BgRT2kWWaw9EJ4aeQ": {
    "date": "4/6/2015",
    "text": "My cousin and I were craving wings so we ordered take out from here. We called in and they had out food ready in just 15mins. The pub has a light ambiance and everyone who worked there had a smile on their face. I will definitely have to come back and order a beer! Seems like a great neighborhood bar and their honey chipotle wings are awesome!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "DRu0auflF6C3erFM00vFXQ"
  },
  "eyl710f0sAIaEJM6IPto5Q": {
    "date": "9/3/2013",
    "text": "I wish I could give 3.5 stars.   I've been coming here since the beginning and as far as beers go, awesome. They always have a good selection and the owner is nothing but nice and will take some time out to talk to you. The cons of the place are the overall menu and marketing. There are almost never any changes to the menu and most of the food is just meh. I love the chipotle mac and cheese but that's about it. I wish they would update their beer list. They used to back in the day and then for some reason, nothing. It's usually a few weeks behind. Nothing sucks more then to go to the bar for a specific beer and find out it's out and was out 2 weeks ago.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "16W020T9namN2DLNuWuQOA"
  },
  "EIugPpJdclB8WtJ8p8Hhrg": {
    "date": "9/22/2015",
    "text": "Went to this bar for the first time the other day after driving past for years. I wish I wouldn't have. The food was not bad, beer selection was alright, but the service was terrible. I was 'served' by a tall, dark haired girl, who clearly did not understand the meaning of customer service. She was extremely cold and uninviting right off the bat, and it only got worse. A couple of young kids were there, who were clearly friends of hers. She completely ignored me to hang out and socialize with them. Huge dissapointment. Very frustrating.  When I finally got her attention, I attempted to ask a couple of questions about the beer list. She clearly had no idea what was going on. She mentioned that she was still pretty new, but I just wanted to suggest maybe she should study up on the beers rather than having social hour at work. She was very rude and had no personality. How about a smile?  Easy to say, I will not be returning until they do something about the service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M6D_iLkQE5ZpfNnlxkNing"
  },
  "QXrL6XZ-7SAhAMT9ilTZPA": {
    "date": "9/27/2012",
    "text": "What can I say?  I live behind Flanny's (no, not in a dumpster), so I spend a lot of time there.  Love the tap selection.  It's hard to beat.  Plus, they rotate the beers there and do all kinds of other promotions so it's never the same thing twice.  The bartenders, Jon and Jon Jr are all great peeps.  The only reason I don't give it five stars are:  the terrible sun that comes into the place in the late afternoon; and the the food is GOOD, but not great.  Still, minor flaws here.  The beer tab can get expensive if you're not drinking the specials, so watch out.  This is not a sports bar, and Jon doesn't intend to make it one, so if you're looking for UFC, boxing, or other sports, you may want to think twice.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "UsucD3-Gj56PKmigVxP2aA"
  },
  "fwcAaP4QL4Ga0y8RKsaQgg": {
    "date": "8/8/2012",
    "text": "Wow. A gem near my house. I'd never been there til a friend wanted to meet up. We're craft beer drinkers and there was a ton of draft. It was late at night and the one I wanted was out, but they had a ton more.   I'm also a burger guy and the burger was awesome. They gave me exactly what I wanted, and bartender/waitress came by just enough to be attentive and not annoying. I felt very welcome here, got exactly what i ordered, was offered a sample of a few beers before I bought, and was able to watch four large screen HD tvs showing the ball games and Olympics. Great place ... I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "X0X3hiKv5CigUec1XYi_pg"
  },
  "Qw4GxXAT13XVHEhmUcnDig": {
    "date": "3/31/2015",
    "text": "Great food. Good beers. Close by my work so easy place for a quick lunch and secret drink ;) Never been at night but seems like a pretty cool atmosphere to meet for dinner and of course more drinks",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "h8K-RHYoRMSgyBqGix2KTg"
  },
  "x5M11qwNJ4UhJ8tWobVYlA": {
    "date": "10/27/2013",
    "text": "Wow Flanny's - you have upped your game considerably. I know you're listening and reading these reviews because the food was perfect, and your bartenders/servers were on their game. Thank you for restoring my belief that a neighborhood bar could be all that I hope for. I can now heartily recommend you to all my friends. If you're reading this try the rotating tap selection of great beer and the grilled chicken wings. Dynamite combo.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2-XLTj0Cfd81_XlmHo02Aw"
  },
  "Il-dijkwzcktwO44tGPMNg": {
    "date": "11/19/2012",
    "text": "Flanny's isn't close to our home, but we are willing to make the drive when they put on beer events. We've been there twice now and both times, we ate and tried beers from their excellent selection of beers on tap.  The food is better than your standard bar. We've had the chicken quesadilla, burgers, and my personal favorite, the buffalo chicken wrap. Finally a place that uses a hot Buffalo chicken sauce instead of this wimpy stuff masquerading as buffalo sauce at other joints. It was delicious!  The service is usually great unless they are packed. In which case you may have to wait to see your server or get your own menus.   We'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RRhJUH7p5TKs66ufVXHkzw"
  },
  "Jnv4ujoxryShb5PJmEqL2Q": {
    "date": "6/25/2014",
    "text": "One of the best local businesses to grab a craft beer at! Not only do they have a wide variety of options that is constantly rotating, but they host monthly tap takeovers with different breweries from around the country, as well as local ones like Four Peaks and SanTan. The food is pretty good, too, and is much better than your average bar fare (my favorite: chipotle mac and cheese with grilled chicken). Plenty of TVs to catch the game and just enough seating where it doesn't feel crowded even when it's full (unless you're there on a tap takeover night, then you want to get there early!). The Flanigans are wonderful people who support their local community, so make sure you stop in and say hi.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "eB8iObpSJyeqwj7Mg-iHeQ"
  },
  "kQzXoVo8GNEhmApEt6CYYg": {
    "date": "9/1/2014",
    "text": "Awesome locally owned spot with great selection of beer! We tried the sampler because there were so many choices new to us! The pretzel is so good, we ordered one to go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Unml4ldjhjPRSM6NfSf-Bw"
  },
  "rkFLZCsXtq7pAFy0SKjXPQ": {
    "date": "6/2/2014",
    "text": "Nice clean bar with a ton of beer options.  Full bar as well.  I didn't order any food, but I saw a burger come out that looked pretty good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "BqE21d_vGACZFU2U8dCRSw"
  },
  "HtjiK-rfl03xT6Y9AsCV0Q": {
    "date": "8/11/2011",
    "text": "Nothing bad to say. Good sweet Potato fries. Good beer selection. Not what I'm used to on the east coast where every bar has 60 beers on draft. Great friendly service and live music.   Nice place to grab a beer after work!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sb46NmcAuu_ExPIBeSE3WQ",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Dogfish Head Namaste",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sb46NmcAuu_ExPIBeSE3WQ/o.jpg"
      }
    ],
    "user_id": "sACphtnStLwYBHZVhI45GQ"
  },
  "pH-C6H_fkFvGKX6VAcfjzg": {
    "date": "10/19/2013",
    "text": "We come here ALL THE TIME. Probably once a week at least. The servers are great, the beer selection is huge (and unique), the vibe is chill (no bros or divas - crowd is generally more mature), and the food is phenomenal to boot.  We are huge fans of their chipotle mac and cheese. The chicken breast that comes with it is REALLY GOOD... perfectly grilled and moist. Get a side of broccoli instead of the salad, it's really good.  The only menu item I remember not really digging were the southwest eggrolls... they were just meh.  Also, I have gotten flat beer a couple of times, but the servers will right any wrongs. They will bring you samples of any beer you'd like, so ask if you're not sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zpmpuyj-BgOVGu0C4Z8zgg"
  },
  "Lwcetu7RZb-c9bmArTdRnw": {
    "date": "7/27/2012",
    "text": "So I was looking for a new place to hang out. Whether it be a sports bar to watch tv  for my favorite upcoming football season, or to chow down some really great bar food and drink some good beer/cocktails. When I first walked in it was a bit quite but it got busier of course as time went on. The bartender was awesome! Super personable and knowledgeable about the bar itself, the beers, food, etc. And of course I enjoyed the drinks, food, atmosphere, etc. The atmosphere is nice to hing out and enjoy great conversation whether with the bar staff or the other regulars that hang out on a daily basis.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nNBxADWam-OwvZs__Uk4cA",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States. Fried pickles!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nNBxADWam-OwvZs__Uk4cA/o.jpg"
      },
      {
        "img_id": "iP1_xtCRGdZRnJIy2Sr3uw",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iP1_xtCRGdZRnJIy2Sr3uw/o.jpg"
      },
      {
        "img_id": "eX8et8febGLISFNGPnDFcA",
        "caption": "Photo of Flanny's Bar &amp; Grill - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eX8et8febGLISFNGPnDFcA/o.jpg"
      }
    ],
    "user_id": "kycD78Z75r167eiSG8X6Ww"
  },
  "2cli2isTSu3a5GapD99ezw": {
    "date": "8/10/2012",
    "text": "This was a kind of cool dive-ish bar/restaurant place. It was actually a lot larger than I had expected. They had live music going, that wasn't too loud. Pretty fun atmosphere, tbh.  The food was just 'eh' for me, typical bar food. But they had a great beer selection.  Decent place to go if you just need a close, chill place to hang :)",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TKel5cyUQOWx0NAn5gR-pg"
  }
}