{
  "y6t0ee-f8X1v11CNiQANsw": {
    "date": "3/12/2016",
    "text": "We just had our first dining experience and loved it!!  Not only was the food excellent,  but the service was as well.  Raja was our server and he was gracious, friendly and professional.  Would recommend to anyone looking for delicious Indian food!!   It was also helpful that the entire menu is vegetarian, and mostly vegan.  Can't wait for our next meal at Ruchi!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XHXfke60Lh13v_wipaWDkA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Amazing Indian food at Ruchi in Chandler, AZ!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XHXfke60Lh13v_wipaWDkA/o.jpg"
      }
    ],
    "user_id": "6rG3-v-x45q1CPZ2zn2LkA"
  },
  "1L99GVThLwpmwcMOdsZKyg": {
    "date": "9/15/2015",
    "text": "Terrible food and service not just by the chef but also by the owner Nataraj or Natarajan. Read the review completey to understand why i say that.  Inspite of clearly mentioning to the Owner that we have a last minute impromptu party and the Kadai paneer we are going to order is the only option for Vegetarians , they made it extremely SPICY that it was UNEDIBLE ( inspite of also clearly mentioning medium spicy only ).  We had a  not so good experience with them many months ago , but we still decided to give them one more chance with detailed instructions as mistakes happen with everyone. But Time and again they not just dissapointed us, but literally ruined it for us as vegetarians in our party had no other choice that day.   Its one thing not making food tasty , but its a whole different thing ruining it. Hopeless Service.  Will never be going there again and will never recommend it to anyone.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "BdOemFYUp7HnGJ8V_X_giw"
  },
  "Savxsv6a32hdLPPnzkqKVw": {
    "date": "3/30/2017",
    "text": "This restaurant was so good. I wish I would have come here before. If you have not tried Gobi Manchurian, you need to come to this restaurant and eat it. The prices are extremely reasonable service is fantastic and as I said, the food is delicious. I highly recommend this restaurant to my friends and even my enemies.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o88Y5kKUC-va6sJ3n-guaQ"
  },
  "eom3V8vofG9a8Lt04nUtHQ": {
    "date": "5/10/2018",
    "text": "I really wanted to like this place after reading the good and unfavorable reviews. I was craving dosa and was surprised to see a south Indian restaurant nearby. I visit Chandler on occasion for work, live in a location where there are a few authentic South Indian restaurants and have eaten in a village and large city in south India. Unfortunately my experience was that the spring dosa I ordered was not authentic bc the spices were way off, the vegetables were in such huge chunks that I couldn't pick the up properly with the dosa, the coconut chutney was really watered down and the tomato chutney taste like socks. Old to be more exact. The dosa was also too thick. I was so disappointed. The food didn't taste fresh and bright like South Indian food should taste. I didn't get sick thank goodness. But it is the first time in my life that I couldn't finish the meal because it was so unappetizing. Perhaps their cook had a bad night.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5WB2nCw4smxqblZSkvk1Lg"
  },
  "gHGahxZrmCXj1bNkR5-fqQ": {
    "date": "4/22/2017",
    "text": "We tried Ruchi based on the Yelp reviews. We ordered partha and garlic naan which were both pretty good. The naan was a little less chewy than I like but had good flavor. We also had the Navratan Korma, Chole Peshawari, and Gobi Manchurian. Everyone loved the Gobi Manchurian which reminded me somewhat of orange chicken. My favorite was the more mellow Navratan Korma. It had lots of tasty veggies. We ordered carry-out and they gave us plenty of rice which was a plus. We will definitely go back. It is not my favorite Indian restaurant but it is very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7iG8293Ltce8WYftC61tmA"
  },
  "aehcuctKLTRb2iWXthslYA": {
    "date": "9/1/2015",
    "text": "Had the lunch buffet today.  Was very pleased with the large variety of vegetarian dishes. I could not name them if I tried.  I wish that the signs also had the English translation to make it easier to remember.  Food was great and I truly enjoyed trying things I might not have off a menu.  Service was phenomenal.     Only complaint was the Corona beer sign on the wall and that the bathroom was not quite as clean and stocked as I expected.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "PT4Uypesw4AGBJ3PIzE92A"
  },
  "uDkH8dywIMky9LKpdenncA": {
    "date": "7/22/2017",
    "text": "Awesome service and good! Ask for raffi! He comes to the table and explains all the food. Order the samosas and veggie cutlet for appetizer then the dessert with paste made of almond, saffron, and sugar served with ice cream on top. Too notch service and traditional food. We live nearby and can't wait to return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0CeR3wb2Nz9ewnzqmJjkrQ"
  },
  "2u9n39WfLqKIjjIKGTCWbg": {
    "date": "12/10/2016",
    "text": "Our first time eating not frozen meal Indian food so we were not sure what to expect but it was amazing! We came at lunch and did the buffet which is the way to go because you can try a little bit of everything and you also get a potato filled dosa to go with it. I'm gluten free and vegan and they only had a few things I couldn't have but still had a big selection of things I could eat. They even made me a gf dosa! My favorite dish was the dhal curry and the pongal. Also the service was amazing by a young man who took the time to explain everything to us and continually checked in on us. Loved it and can't wait to bring others back here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ZtqYY6BZg53MJd7qoYT0g"
  },
  "Z6SZSH8AqweUs2pFt2a-7A": {
    "date": "3/4/2017",
    "text": "This is an awesome place!! Came here for Saturday buffet. The gulab jamun is awesome! The pulihore, upma and all these items are awesome!! I'm coming back definitely. The service is great. I'm a vegetarian, this is an awesome place to go for vegetarians.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O13zfPSP6PfObK-299YoNQ"
  },
  "IPfACMl2uG0UoqjA_eTvuw": {
    "date": "8/12/2017",
    "text": "Worst ever Indian food in AZ. Pls do not try and waste money . Appreciate if all can give True feedback ...even not worth for 1 star or even a single items was even OK type. Sambar was like in a pre stage before getting spoiled. Platter items were horrible to the core with just oilllllllll ONLY ....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "pCzvct_jnU-slNrjISRv2A"
  },
  "eFg4TmqWbYic8wdlCv9PTQ": {
    "date": "4/12/2017",
    "text": "Amazing delicious food and extremely friendly and helpful staff. Love this place so much would give 10 star rating if possible!! Super vegan and gluten free friendly! Lunch buffet is amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2kdg-CFZ-jRYvT-KjVYeag"
  },
  "wPUKhOObKI173C2I1i1ZSQ": {
    "date": "1/25/2017",
    "text": "So good! So many options! Owner came up and taught me how to best pair foods, being that I'm a newbie to Indian food. All the staff and owner were very attentive and friendly! Very vegan friendly. I personally am not a vegan but it was great to know I can recommend a great restaurant to fellow vegan friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6A-bMNeeNvX4i825byOGQg"
  },
  "8anfNiSWEaJEqo_QtjEmfw": {
    "date": "1/28/2015",
    "text": "Wow. Just Wow.  So this place is owned by the previous owners of Udupi. It is completely vegetarian and for lunch they have a nice buffet with all of your Indian favorites.  Now, best parts of the meal: Dessert - The best Gulab Jamans in the world are made here. Yes, they are fabulous \"Bread\" - If you are an Indian cuisine frequenter, you must be accustomed to getting naan for eating. Well they topped that. Masala Dosas for each person at the table! So good.  :D",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "Y-aeqCKNf7RQvVBZw6oCkQ"
  },
  "V3b6A3Y4ihhoyTMTC_UXfA": {
    "date": "9/6/2017",
    "text": "We went here because of the deceiving number of stars and thought it might have promise. Wrong. First the decor and ambiance is sort of crappy. Just feels slapped together on the cheap and not done well. The bathrooms were gross too. Also it feels like they use swamp coolers in there. I was hot and humid. But most importantly the food- not great. I'm a sucker for some good dahl (lentils) and all they has was one kind with a description including mustard a few other things which did not sound appealing. Big disappointment. When we asked about it they told us sambar is the same thing. We ordered it and got soup. Not the same thing. I ordered the vegetable vindaloo and they used frozen beans which did not impress me. It wasn't great. My wife ordered something that was a number 1 in one part of the menu (forgot the name) and it was bland and tasteless. We could not even identify one of the vegetables. It was somewhat like a potato in texture but had no taste (like the whole dish). We had to ask 4 people to help identify it before we were told it was a plantain. It did not taste like plantain.   Nothing was good about this place even the rice was subpar. Save your money and try Curry and Scoop for a treat or Chutney's for really delicious Indian food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U0U-YlztRYoAWl3eqIf_TA"
  },
  "iDHsxOa-zCZg0eCipG_6Wg": {
    "date": "9/24/2016",
    "text": "Best Indian food I've had in Arizona. Everything we ordered was excellent, and the service was fantastic. They were very accommodating of our two year old as well. We will definitely back often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7X1tuiu3QicsoH8SWDSC5g"
  },
  "O95dSe2aL5lCYVuqH5lDkA": {
    "date": "1/31/2017",
    "text": "Our meal was absolutely wonderful! We are not familiar with Indian cuisine, didn't know what we were ordering, but every single dish was just fabulous! We will surely return and take friends there for a great meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-aY0DZZNHndDaX-BjFFgGA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-aY0DZZNHndDaX-BjFFgGA/o.jpg"
      }
    ],
    "user_id": "b66w1mLlFGy3_PzchDOMTw"
  },
  "kcvQKv7f36dOxNNxrqSxLw": {
    "date": "3/9/2017",
    "text": "Super good dosas. The variety of types of dosas is enough for anyone's taste. The dosa was cooked perfectly, had the perfect crisp!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IcyFTJFDnWVchLsxq3qZWw"
  },
  "v29z5jILoEATCp5OYPFnWw": {
    "date": "2/15/2015",
    "text": "I went to Ruchi for lunch with my wife on Saturday.  We had the buffet.  It was pretty good.  Found the food to be a bit salty though.    I am of South Indian background, and was raised on food similar to this.  I had some utthapam, dosai, and idli, along with some curries.    My wife, who is not South Indian, liked it also.  The only thing about South Indian food for me these days is the fact that it is hard for me to want to go to a South Indian restaurant often.  I do go, but for me, I can make similar styles of food at home, and something that is definitely comparable.  My wife and I have done this.  I guess my tastes regarding South Indian, have maybe morphed into a more fusion approach, but this is not the forum to explain.    I would definitely go back.  This time I will definitely order off the menu, and get my dosai fix.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jqyS91iI63nyztPAvRk1AQ"
  },
  "yiaUCxUjEYHl3yeMNM0HrA": {
    "date": "9/24/2016",
    "text": "Idli! Sambar! Comfort food plus beetroot curry and all the usual picles, chutneys and curries. A bit pricey for buffet compared to nearby competitors but none of those places had fresh idli on the buffet. You know it's good when you see tables of single Indian men eating here...",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1ZeQG_N_NeGewd_Byhefsg",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1ZeQG_N_NeGewd_Byhefsg/o.jpg"
      }
    ],
    "user_id": "90vUycx9ch-q2wVlRPBcYw"
  },
  "iqdRgclh9KIvuOV5GCrCog": {
    "date": "11/10/2017",
    "text": "Wow!   So impressed!   This restaurant is a treasure.  Raj is a wonderful host.  He helped explain and educate us on the menu and traditional way to eat the meal.  My husband had the mango lassi drink and loved it.  We each had the dinner special which included the soup, appetizer and dinner.  We were so full but could not pass up a dessert because everything we had was such a delight.  We were not disappointed with dessert.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Wq7mhB6h_csSQLheg0C0w"
  },
  "en735V6HmXh2VlLuP3BveA": {
    "date": "6/6/2018",
    "text": "I went to this place for the first time  and had a very warm welcome b6 Raj . We actually went to Woodlands but it was closed and hence here . I am glad we did. The food was really good and very generous amount. I had the South Indian meals and my husband had the idli,vadai and both good  . I couldn't finish it and felt bad I couldn't goody bag it . We went back a second time and got the same wonder service . Raj is an amazing  person with great PR skills and totally enjoys his work .  I will definitely go back and recommend anyone to this place again  Wonderful experience",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PP1uqRnAAEX9H-L4V4qeeg"
  },
  "n4BV6M0kMIN5OyZFSUv-kg": {
    "date": "11/22/2017",
    "text": "About 90% of the menu at Ruchi is vegan and the other 10% is vegetarian but the food is so tasty that anyone would enjoy their food. Just know that it is a simple restaurant (nothing fancy about the atmosphere but it's nice, clean and friendly for sure.)  The owner/chef is engaging, funny, informative and more than happy to make recommendations if you'd like. Or if you'd like to be adventurous you could order all kinds of dosas, biryanis, curries and naans from their vast menu and enjoy every bit of it!  Must try this place for yourself.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IZyzvijYPZrFJmG1TJq99Q"
  },
  "tvEggcZROp18B8RYe3IcUw": {
    "date": "9/8/2018",
    "text": "Wonderful service, great food, easy parking, excellent prices. The owner ensured we were happy and made great suggestions. We will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O-3rV3aFdKLnVbPBOneqhw"
  },
  "Uc85Z5tVe52vI4iHDRWjuQ": {
    "date": "5/13/2018",
    "text": "Found this little gem on Yelp. Being vegan, I'm always stoked to find great food that I can enjoy while traveling. Excellent food and excellent service. I would call the restaurant directly to order instead of online. A more personal touch...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "O0C0LR235Bim1SUcptpR1g"
  },
  "ufvQrURklcrUnDeGnjmoaA": {
    "date": "2/28/2019",
    "text": "I love their idli vada and sambar combination. It had the authentic Tamil flavor in it. The host is very friendly and treats you very well. I have been regular to this place and I would definitely love continue going there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AwzJlgN-LHvppskondA_WA"
  },
  "hETFfH8PD8526tH3UTQDcA": {
    "date": "11/30/2017",
    "text": "Love love this place. Amazing vegan options and an amazing lunch buffet. They have vegetarian at the buffet, but I'd say it leans more into vegan dishes.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0MEPdoC5XcphVxesfCnmPg"
  },
  "w02GDuOfGJZny9SGmSsK_g": {
    "date": "7/7/2018",
    "text": "LOVE this place because they have tons of vegan options!! My husband also loves the food even though he isn't a vegan. It's win-win for both of us. The food is so delicious, they have large portion sizes, and they are kind to their customers. We always order to go, and our order has been perfect every time. Also, I've been to tons of Indian restaurants all over the world and all over the valley and this one checks out. It's crazy delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X-QwYqxHImYsalk4nW5TBQ"
  },
  "wmL33KjVZXWiXqgkkKRm4Q": {
    "date": "8/10/2018",
    "text": "Everything is so yummy! Love the menu and the buffet. Been several times and great every time! The owner is so nice and attentive. TONS OF GLUTEN FREE VEGAN OPTIONS! Great for groups, families or a date!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-UL91n7QIE61crlfyFagew"
  },
  "TrhtVa5rFPrFvpPUWuJ_hw": {
    "date": "9/3/2017",
    "text": "Food is Meh... to say the least. Pay and eat crappy Indian food, here is your place.  I went here for a to-go buffet, boy I was taken for a royal ride. I was told instead order separate ones (so not everything is mushed up together). From the menu,  1. Sambhar - 2.99 + 4 other items from the buffet The bill came out close to 4 buffet price. I quickly told him, all I am looking for his separate boxes (no extra items).  Ended up giving me a watery sambhar and a watery avial (with foot long vegetables in it no pun intended) paid 15.50.  I understand, how some people in the name of buffet to-go take the restaurants for a royal ride. While I was trying to be honest with the restaurant, I was taken for a royal ride.   My last time to this place where there is no transparency, dishonest to say the least.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "yLcROv7XBEgH5tL47kkQKg"
  },
  "ukRBbhquj19LvylXk53GXg": {
    "date": "4/23/2018",
    "text": "This food was beyond amazing!!!!! We dined in the first time and ordered off the menu. We tried the buffet the second time and now definitely continue going to enjoy this place! Lots of Vegan options! Simply yummy!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9se9RaSb0DFu0NUjyiHJ-Q"
  },
  "56KQFGDK_M6KxGuj2PbCsg": {
    "date": "2/15/2017",
    "text": "We found this place because they were at the vegetarian food festival. Their food was amazing there so we had to check it out. I'm glad we did!  It was empty when we got there but people slowly trickled in. The menu is huge and everything has a name you can't understand so you really have to read it. I got the vegetable manchurian and it was phenomenal! Everything we had was amazing and authentic! The best part is they let you know what is vegan and everything is vegetarian! Dream!! The staff was super friendly and even gave us a free desert to go. I highly recommend this place and we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oOR3LKopr54KQFY1-jbc8w"
  },
  "i-DL2aa_2fQAyiOpjiJySw": {
    "date": "9/20/2017",
    "text": "We tried Ruchi for lunch today.  We're vegan and love Indian food.  This lunch buffet was so freaking good!!  There was so much that we were able to eat.  The options were varied and delicious and the staff was super accommodating.  We also got the pleasure of meeting and chatting with Raj while there.  He's a good dude serving good food.  It's a little out of the way for us but we all agreed we'd happily travel the distance to visit again and check out more of the menu.    P.S.  The water was delicious!  No skunky, dirty line tap water here.  Only the good stuff!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "OwZeEP36kpsMp03yj72FGw"
  },
  "T0cYA-VyX8dLt8PK0dPfDQ": {
    "date": "5/11/2015",
    "text": "My first time here was on a Saturday afternoon and it was fairly empty. There was a lunch buffet, but they also allowed us to order from the menu.  Because it was my first time, I went for the buffet so I could taste several items to see what I did and did not like. I had some very tasty dishes (apologies for not knowing the names of what I got; some items were marked, others were not. Then it all got mushed together on my plate, so..), and the owner was very friendly and helpful. He pointed out everything that was vegan-friendly, which was most of the buffet. I think only 1 or 2 things were non-vegan (but vegetarian). He did the same thing with the sauces, so I wouldn't pick out anything with dairy in it. Then he gave me suggestions on items to mix for a yummy dipping sauce for the dosa, which comes with the buffet. Very nice!  My DD (a non-veg*n) wanted Aloo Saag. It's a spinach and potato dish which we were accustom to eating at our fav Indian restaurant in St. Louis. It was not on the menu here but they agreed to make it without any thought or hesitation. DD loved it!   We returned on Mother's Day and we both ordered Aloo Saag. DD got the regular version and I ordered the vegan version.  (FYI - If you want to try it vegan you should specifically ask because this dish is made with cream/dairy unless you request it vegan.) It was so delicious!  Perfectly spiced and excellently executed for a non-listed menu item.   I got Poori (vegan deep-fried bread), which tasted great with my Aloo Saag. DD got naan, which she loved as well.  The owner did seem a little peeved this time that we didn't eat off of the buffet, but being that we got what we wanted AND it was delicious, I won't hold that against him.   My only concern is that I don't know how much I paid for everything because there was no detailed receipt. I spent $32 and some change for our 2 entrees + 2 orders of breads (poori & naan); we had water.  On my first visit we paid $9 for DD's Aloo Saag. The breads are @ $3.99 each, so I feel like I was over-charged for something.  Next time, I'll be sure to get a breakdown of everything.   Delicious, flavorful food. Clean restaurant and restrooms. Attentive, helpful, and friendly staff and owner.  I will go back again.  (Re directions: My iPhone map had me going in circles. If you come from the 101 and are traveling on Warner, it will be in that strip mall to your right, before you pass the Dobson intersection.)",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Po3mr6o054CSLSskCBWSvA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Garlic Paratha",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Po3mr6o054CSLSskCBWSvA/o.jpg"
      },
      {
        "img_id": "bNTHTDiWHjSbaH1Hna0nVg",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Aloo Paratha",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bNTHTDiWHjSbaH1Hna0nVg/o.jpg"
      },
      {
        "img_id": "XkuXIAnc0AMREHOxqvXUPQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Gobi Manchurian (carry-out)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XkuXIAnc0AMREHOxqvXUPQ/o.jpg"
      }
    ],
    "user_id": "rRrFcSEZOTw6iZagsIwTFQ"
  },
  "thd_mAYRFdW5Nhs6BXF-bg": {
    "date": "5/23/2018",
    "text": "Excellent food & service!! You can tell all the food is made from scratch. The flavors are wonderful. You don't have to be a vegetarian to enjoy this place, anyone would love it. Also, the owner is super funny & welcoming. We will be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7aij9Izy0VByqbE3YlgYlQ"
  },
  "77-M4woVTDXDKNaFvRGmsw": {
    "date": "7/11/2018",
    "text": "1rst review on yelp ever... I just had to sign up to say how good our meal was... I'm so excited to find this vegetarian spot!!! The food was delicious and they even threw in some extremely flavorful soup that I will defiantly have to order again!!! Absolutly excellent!!! Thank you. I'll be bringing in people for the buffet soon!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qA2i0fX4DMsOGwgQY7yyEg"
  },
  "YfWKfR98wNvm9icXbluQvA": {
    "date": "2/15/2018",
    "text": "This  is the worst Indian restaurant in town..looks like they use old vegetables  and the prices are too high for the quality they supply..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KGsoFELwd-x2zGwlkwAYpw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. The vegetables look spoilt",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KGsoFELwd-x2zGwlkwAYpw/o.jpg"
      }
    ],
    "user_id": "tHSS7aaSOT7U9EvpNOD0WQ"
  },
  "Nc4YcCHf9NbFCL0mseikTA": {
    "date": "10/16/2017",
    "text": "My favorite Indian restaurant! The owner is so incredibly friendly and always ensures that the food I am ordering is vegan - such a great feeling knowing so much care is put into my meal! I'm in love with the Aloo Gobi and Samosas (of course!!) - big portions too so you'll definitely have left overs!   Vegetarian and vegan heaven!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3ETISxC9Kj45Up126VRqqQ"
  },
  "RlMCb42OLoFj4tbzzotImw": {
    "date": "5/10/2018",
    "text": "Really great food, the people are friendly. I love that it's completely vegetarian and they have a huge menu.  Some of the plates are really spicy! All made to order. Never tried the buffet but I'm sure it good too. If you are a vegetarian in the east valley check it out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QnIGXzVhn7y2HnpDIAPISw"
  },
  "AYrPxHx4jgTaN_y8GIg6eQ": {
    "date": "9/15/2016",
    "text": "Lovely little restaurant tucked in the corner of a shopping mall. I came for the buffet (as i have heard many great things about it) and boy was i happy! Even though it is a vegetarian restaurant, they have lots of vegan options that are clearly labeled. It may not be the healthiest food, I'm sure, it was all delicious and full of flavor. One downside was the regular rice was dry, that is something I wasn't necessarily surprised about (and I'm sure they would have given me fresh rice if I asked.) Nonetheless, I left absolutely stuffed..without a nasty heavy feeling!(: the staff was also wonderful as well. Always smiling, they showed me food combinations that worked together and made sure I always had a full drink. All for $12, after 20%+ tip! To say I enjoyed myself is an understatement. I will be back for sure!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l-aAGduOSp5LiaeGHYRBlg",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Plate #2 from the buffet. So delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l-aAGduOSp5LiaeGHYRBlg/o.jpg"
      },
      {
        "img_id": "XUyXXRuUr0B3SxZBKsthsg",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. What I am eating I couldn&amp;#39;t say; but, it was delicious!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XUyXXRuUr0B3SxZBKsthsg/o.jpg"
      }
    ],
    "user_id": "cz8kD4un4ldMHJotLy8EFw"
  },
  "EsenjIP1xZeeZqpQiXXGfw": {
    "date": "6/14/2018",
    "text": "Took my stepdaughter (who's vegan) for dinner last night -- it was delicious!  There were literally dozens of vegan options on the menu...and the owner graciously recommended several favorites.  Great food, great service, huge portions, perfectly priced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c87B3gVQveflH85JPXpi3A"
  },
  "44DXrsTM_OoqbJ1XdJFS5w": {
    "date": "8/29/2016",
    "text": "Always good food and excellent personal service by Mr Nagaraj. Both South Indian and North Indian food is delicious, good size portions and arrives on time and together. I have had issues with other restaurant where the food arrives at various times and your naan goes cold by the time your curry is delivered to your table. This location have had lots of different owners change restaurants but looks like Ruchi Vegetarian is here to stay. All the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZvhczYKC5wiOTp1vCVd7qA"
  },
  "GuyPIbvE8RyOdkIA5xvHkg": {
    "date": "7/16/2016",
    "text": "Stopped in for dinner and so glad I did! The food is great, the owner is extremely helpful explaining different foods, spices, etc. will definitely be back! They deserve much success, give it a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Grk809sxXhubOORSZGafHw"
  },
  "CQa1c9LsleMaLCw34dK-6A": {
    "date": "8/15/2015",
    "text": "I have found my favorite Indian food place and plan to return many times. There is a fabulous selection of mostly Vegan dishes, chai tea is included with the buffet and you get complimentary crepe-like bread stuffed with seasoned potatoes. Feed all your Indian food cravings at Ruchi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cnyPDjujNazS1L0nu84DkQ"
  },
  "v0LOEBF0yHsrYDKBV3eJQw": {
    "date": "2/13/2015",
    "text": "Simply amazing! Great service and a buffet that makes you fall in love with Vegetarian food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4IallVocu9hhTVH3_uuP0w"
  },
  "qIYGnyG1IvooKxnB1EJUQw": {
    "date": "4/30/2016",
    "text": "I think this is by far the best South Indian restaurant in the valley. Food was delicious and the choices are mouth watering and loads of variety. Most places I have tried have been ok and since I am a diehard South Indian food lover I was so happy I found this place! I loved the idly, dosa, vada, sambar was delicious! Gobi manchurian is excellent! Didn't get a chance to try the buffet yet but can't wait to head out there again very soon! Also loved the Falooda drink, it was amazingly delicious! great fast service and friendly staff makes this place top on my list of favorites!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ww8usyt1SKlMd8cCsYDYOw"
  },
  "FPKRwHVNmnEPVP53gF8SFw": {
    "date": "11/1/2015",
    "text": "Food was not great. Service was slow. Their best item was at the most \"okay\" if compared with other restaurants in the area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7SkJDzaUPUTu6MdJWagqUg"
  },
  "vK37oOLw1-ouA7qiMYTVsg": {
    "date": "11/1/2015",
    "text": "Some of the folks have written bad review. I am not sure any of those guys understand the difference between south indian vs north indian food, the two flavors are miles apart. This restaurant is south indian.. Try the crepes and other south indian. Dont order Kadai and other north indian and complain that it is not as good as other north indian restaurants. I would say their coconut chutney is as good as you get in the SFO and NYC south indian restaurants. Sambar can be better but has the udupi flavor of excess Tamarin. I hope Nagaraj starts making Tamil Nadu sambars instead of Udupi nonsense. Dosas are really good well cooked. I would say at the moment the flavor of food is better than Woodlands and this is probably the best south Indian restaurant in town. I hope this one survives unlike the predecessors in this location. Like I said above.. Try South Indian food here.. not the naan and roti..  Note of caution - South Indian food is spicy..that is how it is eaten.I sweat all over when I eat those...if you cannot handle spicy food, just make sure you order correctly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TwErSmI2nOF0UqXZ2tUDfQ"
  },
  "1ncdv7iEf784KCleTnEoVw": {
    "date": "8/1/2015",
    "text": "Amazing food, service, and I love that they have so many options to eat there for vegetarians.  They fill their crepes with much more food than many other restaurants. We always end up with lots of delicious leftovers to take home and eat the next day.  They also serve kingfisher beer which I highly recommend as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iel8gu1KyzVikiY0xfCIoQ"
  },
  "EhBCz5B98FNVW3MLFXfrXw": {
    "date": "1/19/2016",
    "text": "OMG this place is amazing! My friend had dined here several times for dinner and loved it, and spoke very highly of the food and the service, so on a trip back from the Phoenix airport he suggested we stop by for the lunch buffet. I was skeptical and worried that there wouldn't be enough things for me to eat (I'm vegan). Much to my delight, the food here is amazing!!! The lunch buffet was absolutely huge, it had at least double if not triple the amount of food one typically sees at an Indian buffet. In addition to numerous entrees, almost all of which were vegan, there were two soups, salad, about 8-10 sauces, naan bread, desserts, coffee, and more! I had originally considered just ordering off the regular menu, but the staff encouraged me to try the buffet and I'm so glad that I did because that way I got to try many different things, all of which were wonderful. The service was top notch as well, super friendly and helpful staff, the place was very clean, and I really just can't say enough about how good the food was! I live in Tucson but I will definitely plan to come eat here again when I'm in the Phoenix area. I wish they would open a second location in Tucson!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k2kx9xXNslSVTxvQ8ZBVPQ"
  },
  "JlzRuuRCs4cM82DJGJkxuQ": {
    "date": "10/11/2015",
    "text": "The five star ratings that pull Ruchi's average rating to a 4.5 stars are absolutely well deserved. Our party split a biryani (basic vegetable), a dosa (don't remember the name but the last on the list), and a curry (veggie vindaloo), somosas, naan, and poori, and TO AN ITEM everything was stellar and TO A PERSON our party was blown away from the entrees themselves to the chutneys and sambar that accompanied them. The servers were super friendly (which anyone who reads my reviews knows is really important to me), and if I had to ding then on anything it would be the anemic and almost un-Indian decor and blah lighting. But truly the food and service MORE than make up for the less than perfect aesthetics. In short, go go go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IMuXEXsl_Qzw1Vya9FF7Tg"
  },
  "15yO_RzIXXZjxK0pBsI_9w": {
    "date": "1/17/2016",
    "text": "Warm and delicious food. We had bisibela bath and Veg.Briyani both are awesome. We will visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HP2UngG7nSfKs9YditLm8A"
  },
  "MZ_ypM67pjfSNva33JJnog": {
    "date": "9/8/2015",
    "text": "Went for buffet on a Sunday. Great food, a tad bit on the spicy side but no complains. Favorite was the dosa and the potato filling. Only the vada was not good,  everything was up to the mark. Will be back for sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rwf75p0aGZQ6P1FndkDjfA"
  },
  "SMskwDoH09NaPKeKJPoZqw": {
    "date": "10/16/2015",
    "text": "THIS PLACE IS A MUST. Great food, great flavors, and the owners were so helpful and friendly. I will definitely go out of my way from I-10 to eat here again. If you don't know what to eat just ask and their suggestion were right on.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vdFYisRqzMA5TgRcgf5yOQ"
  },
  "MC_cb4GyMSfQORHByZzIPQ": {
    "date": "4/8/2015",
    "text": "Excellent food.  Lots of vegan options.  Great service.  Loved the dosai and the palace paneer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SBKD2RoWsNrfsI9IFeZhzA"
  },
  "w7bc6XbzpDc0JzYcM19kKQ": {
    "date": "6/9/2015",
    "text": "Every little detail is carefully mastered here, papa dams, teas, dishes, service. Hands down best indian spot I've eaten at for the longest time, and trust me I've had few.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hSYQAsy-2ht_O4xWH98oDQ"
  },
  "oer5Ugin4MdeAySP73tMmw": {
    "date": "9/26/2015",
    "text": "Awesome thaili. Authentic vegetarian food from Tamilnadu. The idlis, dosas and vadas are really good too. Try the platter for appetizer. Was in Chandler for a week and ate dinner at this place 3 days. Did not feel like trying out other indian places in the area since i was more interested to try different dishes on their menu :D",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nW-fdmACjN_7t2I5e3LISA"
  },
  "0zOv_Vml7x7xL4UxPsFN5g": {
    "date": "7/14/2015",
    "text": "Great service and great food! Owner checked on us a lot during our dinner. Chole bhature and the dosa were great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yXVcZ4YK0G704keNq3tu1g"
  },
  "nZe2d2ZLMtKU1mQtpndE7w": {
    "date": "5/6/2015",
    "text": "The food is amazing and beautifully presented the service is awesome everything is made from scratch and the prices are very reasonable what's not to love?  When I asked if there was cabbage on the menu the chef made me something from scratch and it was wonderful.  I will definitely be coming here again and again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YbO6cOCsODMICgtWUKSfzQ"
  },
  "q45Vgji_rC4qssJTT74ffg": {
    "date": "7/11/2015",
    "text": "Another great dinner at my favorite Indian restaurant. Great food. Great Service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nTY2CasjEcWNmID_U9F4mg"
  },
  "VBHpik4oHfIgV_AH1CWRdw": {
    "date": "12/29/2018",
    "text": "This restaurant is great. It's suitable for both vegetarians, vegans, and those who are gluten intolerant. The hospitality is something I haven't experienced In a restaurant before. The owner personally greets every customer that walks in and finds out your dietary needs and personally takes you through the buffet and not only shows you what is okay for your diet but then shows you what flavors go well together and how to even eat some of the dishes. The service is great throughout the experience. The food is delicious. Everything is priced appropriately and the music is great as well. Added to the list of places to frequent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sGHpLz-v4xe7Ab13eauFzA"
  },
  "-HmKtvFQgwPPRFHzBIIUmQ": {
    "date": "3/1/2019",
    "text": "You can't go wrong at this place for South Indian cuisine. I have been here at least five times and I always love it. I see the owner every time and his service is impeccable. I will keep coming back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IjdvfHpr7xEgXjMbr7OEmQ"
  },
  "vmCeX1z0LZVJrP-CHLP20w": {
    "date": "5/6/2019",
    "text": "Very basic South Indian food. The paper dosa could hardly be chewed, it was very dry. The Idlis were soft were breaking in the hand. The rasam was so spicy, had to leave it behind. Have tasted better food elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PDvAqCKiFI26_LdszGLggg"
  },
  "vJxSAtCoIc_pRRePx4-AsA": {
    "date": "8/13/2018",
    "text": "I love Ruchi! There are a wide variety of vegan options, as is common with Indian food. We typically get carryout and I appreciate that the food is packaged in a spill safe manner.  They've not once let me down. If you order carryout, be sure to find out which dish is which. Only 1/3 of the family likes spicy food, so I typically taste test to ensure I don't burn any bridges (or tongues) with the family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "U2WT10sjQmXCwk_WGj7eMQ"
  },
  "DnZshluBsmU-4bcHdBfLjw": {
    "date": "4/20/2019",
    "text": "Spring masala dosa was not so great - full of cabbage! Papri chat was too spicy. I would not recommend this place",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9zAtH5uGkXOfOsYR8mP9yQ"
  },
  "Pb-wMeQVNypKrE83yne-Ig": {
    "date": "7/29/2018",
    "text": "From the moment we walked it, we felt welcomed. The music is nice and the eating area is clean and inviting.  THIS IS WITHOUT A DOUBT THE MOST DELISCIOUS FOOD THAT HAS EVER BLESSED MY MOUTH!! This restaurant is a True gem in Phoenix. I will come back and save this as a place to bring my family when they visit from out of town.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aGggZo8Y0SW3vVoEuqjiNw"
  },
  "AlKySqisfuZM4W3lQMQZLg": {
    "date": "8/9/2018",
    "text": "I love this place. It has to be the best Indian vegetarian/vegan buffet I've ever been to. Great selection. We always eat too much. It's so nice that they bring out dosa for you. The food off the menu is great as well. Everything tastes so good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TNcDcjCZYjg7oZl84UgTYA"
  },
  "NO1S4LALqRJ7aZ-xBA3r_A": {
    "date": "2/18/2016",
    "text": "Ruchi has a tasty vegetarian and vegan lunch buffet (South Indian style) from 11-3 for $9. I sampled a few of their items including a palaak/spinach dish, rasam, sambar, idli, cabbage curry, and tofu curry. Fresh dosa is made per table, and desserts include payasam and gulab jamun.   Overall the buffet items were pleasing to the palate and satisfied my craving for Indian food without needing any meat. Most of the items today were vegan, with a smattering of vegetarian dishes. My favorites were the dosa, vegetable rice and the cabbage curry. The rice was flavorful, colorful, and had a lot of different vegetables in it. The rice was well cooked and tender. The cabbage curry had a coconut milk base which gave it a slight tropical flair and had a delicate flavor. The dosa was excellent, lightly crisp, with a wonderful potato mixture inside. Most of the dishes had a bold, spicy punch to them. The spinach dish was my least favorite since it was too salty for my tastes.  Service was exemplary. The host was friendly, very engaging and warm. They probably have some of the best service that I've encountered at an Indian restaurant.  The interior is spacious, with a lot of tables. The buffet was nicely presented and well organized.   The buffet for a weekday (Not sure if the price changes on the weekends or if it offered then) was $9 and the total with tax came out to be slightly under $10. Not bad for a buffet!  I'll come here again for the great service and lovely vegetarian and vegan items.",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 21,
      "cool": 18
    },
    "photos": [
      {
        "img_id": "ZGSC7k5O1zW2PWikZjReuw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Mmm dosa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZGSC7k5O1zW2PWikZjReuw/o.jpg"
      },
      {
        "img_id": "DnH4DsmjjEcJPWUu25kQCQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Plate o&amp;#39; buffet",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DnH4DsmjjEcJPWUu25kQCQ/o.jpg"
      }
    ],
    "user_id": "DK57YibC5ShBmqQl97CKog"
  },
  "I59KibzCvm2AFVFhp3E0vA": {
    "date": "10/18/2018",
    "text": "This is a very good vegetarian restaurant. They offer buffet at a very reasonable price. They give delicious Masala Dosa as a bonus. Please become vegetarian & save this world. Please practice meditation few minutes everyday to witness god within you & to lead a happy life.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KWiq2Xo2_HsVuA0aM_yeJw"
  },
  "SxVK5N7jftmY1zzqikG7rg": {
    "date": "9/26/2018",
    "text": "The owner is so kind and hospitable that it transcends into the recipes. Once experiencing this place you'll feel fulfilled to the point that your will to live only for Ruchi's food will be a hard feat to overcome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zDKTPTQ9hBAGOebk8y8xFQ"
  },
  "TlszExWKB4mQVrb9R-dlOQ": {
    "date": "7/13/2018",
    "text": "I love this place.  I can't say much about it.  Very welcoming, friendly, really good food and if you're a vegetarian or vegan - this place is your paradise.  The owner is so flexible too: if you like something like chicken butter masala, no problem - he will make it vegan using tofu and skipping butter!  Also, now that this place accepts/works with grubhub, I order from them twice a week.  Yes.  It's that good.  My husband and my 2-year old toddler loves the food as well.  Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BaI2r65st1iP7lvM794-RA"
  },
  "Cttogxv6R-ge1DIbO_M5-g": {
    "date": "3/12/2017",
    "text": "Ruchi is a solid vegetarian South Indian restaurant in Chandler. They offer a buffet during lunch, but also have the regular menu if you choose to order off of that. During dinner, you just order off of the menu.   So let's get down to the food. The lunch buffet has a variety of food items and you can request dosa as an addition to it as well. Be warned: if you do not eat onion or garlic, aka you are looking for jain food, the buffet does have many onion oriented dishes. I would recommend that you order off of the menu and make modifications as necessary. Our server was very accommodating about the no onion request and helped us work through the menu. Dishes that I personally tried include the Thiruneiveli Spinach Dosai and the assorted appetizers place (medhu vada, masal vada, veg samosa, cutlet, and pakora). Both dishes were pretty good though I liked the assorted appetizers a bit more than the dosa. Portions were quite large and I could not get through the dosa to be honest. I did try some of the madras coffee at the end and it was pretty satisfying.   Service was good overall and I got a good South Indian meal like I wanted.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3ABugfXekKDaV4F1iBg0TQ"
  },
  "nKkvhlKMwvjFdJV8yfy2uA": {
    "date": "9/15/2018",
    "text": "Thaaru maaru South Indian veg food.  Owner is amazing as well and friendly.  This is one place I would keep visiting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2tcWLD50J4N-0HipQOgTiA"
  },
  "7vxNU68aiR_hUWaXoG44qQ": {
    "date": "7/8/2018",
    "text": "We absolutely loved this restaurant! The first 15 minutes of conversation revolved around how this is the best Indian food we have ever had. Everything was excellent. The owner and chef doted on us, explaining what everything in the buffet was. Such nice people and clearly so much love in the food. The decor isn't fancy but the cuisine is fit for royalty! YUMMMMM",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oHPmATg0WMHBGqt6eh6Vdw"
  },
  "Q9wdx95uGNxeCOmswguM3w": {
    "date": "1/11/2016",
    "text": "I ordered a plate of their food at the vegetarian festival this past weekend.  Their food was an excellent value, for $5 I got a plate of rice and lentils, lentil donut, chickpeas in sauce, potato thing(?) and dessert. I enjoyed the rice and lentils, had a creamy and nice texture.  The lentil donut was not my favorite, bc it was kind of flavorless and had a pretty tough texture.  It tasted better when I dipped it in the sauce the chickpeas came in.  What was most notable to me was the DESSERT.  I wish I knew the name of it!  I have had Indian food many times in my life, but I have never ever had an Indian dessert that I liked.  I really liked the dessert they served!   It was an orange cake/pudding type dish.  It looked like cake, but it was very very very moist, almost like a pudding.  It tasted slightly gingery and was just really delicious.  I would like to try their food at their restaurant some day.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "PNMHNF16x2QKFQlLO2YDGg",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. At the vegetarian festival",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PNMHNF16x2QKFQlLO2YDGg/o.jpg"
      }
    ],
    "user_id": "Q6Dcxo3_lNCzkqK7J3FL7A"
  },
  "CYdJ7oofOXuhHIGjCEI94w": {
    "date": "2/19/2017",
    "text": "Carnivores, omnivores, vegetarian and vegan, it matters not, try this place.  The food is excellent and I don't agree with $$ associated with this restaurant, $10 for a vegan entree is more than reasonable in Arizona.  The entire meal was excellent, perfectly wrapped for delivery and fresh.  The vegetables tasted like they picked from the garden the second our order went through.  The garlic Naan was best we have had in this state.  I actually feel the food was better then the vegan restaurant right by the Hindu temple in San Diego.    We ordered a good portion of the menu in order to have left overs for lunch.  The dolsa was excellent, crispy and delectable.  The chutney was perfect complement to all their offerings.  The Naan was flavorful, moist and the perfect consistency.  I can't wait to try the rest of the menu. Alley was in love with the peas in the Naan.   I decided to try them on Amazon because I am too ill to drive.  The delivery was prompt and polite. Word of advice, make sure that when putting in a special request on an order call the restaurant to ensure they receive the request.  They are wonderful people and happy to fix any errors that are made but avoiding errors is always best which I truly believe is their goal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jwzo_uLsB-4njvL2q0aUMA"
  },
  "oP696ZOH9pekFqSAbiNKFQ": {
    "date": "2/10/2017",
    "text": "As someone who has never had Indian food... The menu was uh... a bit overwhelming. Add in that I am on a lower-carb diet and this was a task. I had actually tried their food at a vegetarian festival so I knew they had some good stuff.  I was upfront with them that I was a n00b and they helped me out. I ordered the Gobi Manchurian and the girlfriend (a vegetarian) ordered the Vegetable Manchurian. To note, everything they serve is vegetarian. So, rejoice vegetarians! We also ordered the Vegetable Namori. I will say that everything I received was spicy (I'm a wuss though). The Veg Manchurian was the bomb. I loved it. I liked it more than the Gobi. Texture was amazing, and I'm a weirdo with texture! The appetizer was also awesome!  I also had a hot tea, which is unlike an american tea. It was kind of a Thai tea, coffee, and tea mix. Not my favorite but a good change. I also had a Mango Shake which pretty much heavenly. You could skip dessert with a drink like that!  The service was stellar. Very attentive to my slew of drinks (hey I was drinking a lot due to spiciness) in always keeping them full. Very nice to us new people to Indian food. To boot, lots of food and not too bad of a tab. They even gave us a dessert to take home and try.  Bottom line, I'll be back to try some more items on this new and interesting menu. There is a reason they have 4.5 stars on yelp!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1DsuFRjdW0gDA23Xswzoqg"
  },
  "5MLqujiSuSgojOAXm4o3Zg": {
    "date": "1/24/2019",
    "text": "Hands down the best Indian restaurant I've been to! The Gobi Manchurian is definitely a MUST try! In addition to the food being delicious, the customer service was also great! Definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_nMeDmkexVsOaC2QLqJv8g"
  },
  "FFi9ECxEhtskeYpJM6NNMQ": {
    "date": "6/16/2016",
    "text": "Thanks yelpers! I saw this establishment next door to the dim sum place I went to recently and checked here to see what it's about.   I have always wanted to try Indian food but was scared  to order the wrong thing.  Now I got to try a plethora of amazing  dishes,  all at once.   The owner was super friendly and  explained everything with out making us feel silly.   Will definitely return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oqP0RnSE_nZJu7NCZdFp-A",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oqP0RnSE_nZJu7NCZdFp-A/o.jpg"
      }
    ],
    "user_id": "y_4UdLKpt9nsojhndcE45g"
  },
  "mDqWw16o5IQyrqNeaTRgBw": {
    "date": "5/27/2018",
    "text": "Literally the best tasting Indian food I have ever had. This is place is amazing. The owner is so welcoming, accommodating and genuine. The quality of the food is really clean and super accessible to my food allergies. Will be coming back regularly.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Disp7JiYA1oCjTURS77TGw"
  },
  "8Kzykq-9BcjFvWE24_QDKQ": {
    "date": "6/7/2015",
    "text": "I came here for lunch recently and was very impressed by the hospitality I experienced  at this restaurant.  When we first walked in, we were warmly greeted and told we could sit anywhere.  We decided to have the lunch buffet and got up to walk over to it. A man who I assume to be the owner of the restaurant kindly walked with us to where the food was and gave us recommendations for sauces with certain dishes, which we greatly appreciated and have never experienced at an Indian buffet before. He was so warm and welcoming, and even went to the kitchen to get us fresh stuffed Indian crepes (pardon me for not knowing the technical name for these...)  There was another woman working there who made sure our beverages were always full and that we had everything we needed, coming to our table just the right amount.   The food was delicious and although it is all vegetarian, my meat-loving boyfriend enjoyed his plate as well, and even got full off of it - which he never thought was possible.   I would definitely recommend this place as the food was great and the hospitality was off the charts. Just a very positive experience here that exceeded my expectations, and I will be coming back again =)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7bBgr2J8hJl06-TPC9oB7w",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Lunchtime!! Stuffed crepes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7bBgr2J8hJl06-TPC9oB7w/o.jpg"
      }
    ],
    "user_id": "oODdR03ogUfQ6JUV412K9w"
  },
  "P4h5W74jOWJmSAixEXYIpA": {
    "date": "7/26/2016",
    "text": "Amazing Traditional South Indian Food!! Staff was very helpful, owner especially came at the table and discussed the menu and served us dinner, Very down to earth man. We ordered food outside the menu and no complains. It was fresh, hot and as per the expected taste. The dessert, almond halwa and ice cream combination was a blessing. I been to 100s of South Indian restaurants but dessert was incomparable to anyone.  Incredible service and mouth watering food!! A must go place for Indian food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-8ym_U5M9FAVg2YQb4l3Og"
  },
  "XkZ2KhbOkKPcLtuC5S4Wsg": {
    "date": "8/22/2017",
    "text": "Best South Indian food in Arizona. Period. We went for the lunch buffet and there were so many options! It was the closest to authentic South Indian food ever. The sambhar was delicious and so was the payassam. The owner was really nice and he asked to make the dosas crispy as we like it! Would definitely go back here! And it's a completely worthy price for a buffet! Must try!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W0KuD99fIGJViNoMuwMZIA"
  },
  "uCpf5DUWgCZaGvmd2QuMYg": {
    "date": "11/8/2017",
    "text": "This is one of my favorite places to get dinner at in the valley. The food is amazing and different, the chili gobi is my personal favorite is like the vegan version of chicken wings. The owner is great and always makes you feel welcomed. Fast service always fresh and great price for the amount of food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e82mhCFKtSFSn3kywTmBgw"
  },
  "mLRworYZCY7CPaxnH0FXOQ": {
    "date": "5/3/2018",
    "text": "A must try to vegans and vegetarians. The owner Raj is terrific.  Try the Chilly Gobi - it was delicious. Highly recommend, even for those that don't seek out vegan options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ugp6qjjpIy7vqcLTPeesDw"
  },
  "qAqBEgmuj7FaLMGJkC-Ayw": {
    "date": "7/20/2015",
    "text": "If you like food. If you like being treated well. If you like a good value. You will like Ruchi.  Lunch, dinner, whatever the meal and whatever the dish - it has all exceeded my expectations. The spice level is plenty high - hardcore heat lovers may think it's too low but I love me some heat and it's at an enjoyable level.  The staff is welcoming and goes out of their way to make sure you have a great experience.  Just stop reading and try it. You'll like it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hg4AyAMgmQGO2tx6kjo8yw"
  },
  "ujqxYc0DSYNxEfJyPbfOCQ": {
    "date": "8/6/2017",
    "text": "Service: 5 stars! Our main waiter was extremely charming, congenial, and helpful. I should note, my husband and I have minimal knowledge on authentic Indian food...but, for our taste buds we thought the food was very satisfactory. We ordered the delux south indian thali dinner and the spinach dosai as per recommendation of our waiter. Also ordered some garlic naan and king fisher & taj mahal beer. I absolutely loved the savory \"crepe\" (dosai), it paired so well with the filling and my taste buds were loving the complex seasoning that was used for this dish. The delux dinner came with just enough rice and flat bread to eat with so that extra orders were not necessary. We were stuffed and so pleased with our meal. Definitely will be returning to try out the buffet! Oh, and everything on their menu is 100% vegetarian with a huge portion also being vegan. That is a HUGE plus in my book! Thanks Ruchi!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DlkbXmez19iNaa9gYFtyng"
  },
  "8x13a_lH1oN4S0w3B_qdMw": {
    "date": "4/25/2016",
    "text": "Been here numerous times for the Indian food fix... and the owner, Raj, has always been responsive and helpful in making suggestions. We will bring our 18 month old and they are always very accommodating and helpful with the timing of his meal and surprisingly he loves it!  For Indian food in our area.. this place is it!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xNl9bOQ0cgW8nenwm815LQ"
  },
  "2cvobB3CXi0NmZPRhesZSA": {
    "date": "4/15/2016",
    "text": "Im going to start this off by saying that because of my ethnicity being of South Asian descent, I go in with high expectations of any Indian restaurant I dine at. With that said, Ruchi has been the only Indian restaurant in the valley so far, that has made me feel like there is a South Indian Paradise going on in my mouth with every bite I took!  First off, the restaurant is very clean and has a very nice ambience. The staff and owners at Ruchi were amazing! They were so attentive and polite and over all just really friendly.   My husband and I ordered vegetable cutlets to start with a mango lassi. ( The mango lassi is on point) We ordered the Ruchi special, garlic naan and a mysore dosai for our meal. All the food was AMAZING! The dosai is crisp and huge! The garlic naan was so flavorful! If you like things spicy, definitely go for the Mysore dosai! The flavors were exceptional and spiced to perfection! The chutneys that were brought to the table were to die for and complimented all the food so well.  Overall, if it were up to me, I would eat here all day, everyday!   We will definitely be going back to try out their lunch buffet!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9P424S1sOkPJEC7TKezo_A"
  },
  "ds1WBgHMq0720W3LXRB_Wg": {
    "date": "2/16/2017",
    "text": "If my boyfriend would eat Indian food everyday with me, I would be here everyday. Ruchi is the best South Indian food I have ever eaten. Its flavors far exceeds anything else I've ever tried. They're a vegetarian/vegan restaurant, and they are able to make off-menu items for any other special dietary restrictions a person may have. They'll make you most anything you ask, such as less butter with the dosai or more spice to the food. The service is fantastic. Raja, his dad, and everyone else always make me feel welcome. They're also very quick with bringing out the food. It comes out hot, and it seems freshly cooked! Although I wish the interior decoration was updated, the flavorful food and service exceedingly compensates for the interior design. Ruchi is awesome. Come try it if you're looking for some great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "uQ8n0xWLk-heB9D4NmqQgA"
  },
  "pdO4_OjAhmON0EqyMr7vTA": {
    "date": "1/29/2018",
    "text": "The food here is good , very authentic would recommend . I've eaten here dozen times and good every time .",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ekSFzN7BAycZ4DgBpTShoQ"
  },
  "aHKYWIUl6BXj49pvo6mKOg": {
    "date": "1/23/2016",
    "text": "The one start is for the service.    I had a special dosa and gobi Manchurian for take away. It was nearing closing time in the afternoon one Saturday.  The dosa was burnt, the chutney tasted stale. Had to throw away the food. The Manchurian was comparatively good.   It maybe a one time occurrence since there have been many praises for this place. Will give it another try and may change the review.   Nothing personal!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ju3NibnYqDPBH8-wZ9IAWg"
  },
  "Q_Su5jOuZ7FOV1G3dUNj4A": {
    "date": "11/23/2017",
    "text": "Came here for dinner with my white colleagues. Quite an unsatisfactory experience, as they were disgusted at the way the food was handled by the waitresses. No serving trays were used; in fact the waitresses would carry bowls of food in their bare hands, with their thumbs dipping into the dish they are carrying. The far more disgusting part is that these same waitresses were cleaning tables and dishes just before carrying us our meal, after which they returned right back to their cleaning. The lack of hygiene downgraded the good food, and made everything feel quite unpleasing. I would give the restaurant another chance if the owner Mr. Raj corrected this improperness.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2d1dasfNvdH01ec9R_59Lw"
  },
  "FveOIRRlbJmfJ4blfnruAQ": {
    "date": "7/15/2016",
    "text": "Very good S Indian food, and one of the very few in Arizona for S Indians like me. When crowded can get a little messy but it reminds you of India!  The sambar is generally good, chutneys are fine. I enjoy the variety of vegetable curries/thorans that appear everytime I visit. I also like that they have pongal, avial and adais (these are generally cooked a little differently where I'm from and more crispy).  The basic idlis, vadais are all good also and you get tea with the buffet. Have not been to a sit ala carte meal here.  Have seen a variety of desserts here and some are good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rqDdPgYD1O5rtXZIW0qqyA"
  },
  "WRXoVjihzyyHnfuS77sL1A": {
    "date": "5/7/2017",
    "text": "Best food I've eaten in all of Phoenix, authentic, delicious. Satisfying.   Thank you, look fwd to another meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BQyzCf31T6kYSlG2DatSSQ"
  },
  "44eV-FqQRPCrfaJGFpZdTw": {
    "date": "3/17/2016",
    "text": "This is the best palak paneer I've ever had. I also had really good cauliflower dosai, super yummy garlic naan. Wonderful service - real hospitality. They took great pride in how happy I was with the food.   I came back later to get take out and the same kind, warm, friendly gentleman escorted me to a seat at the bar, offered me some water, and handed me a real menu to order from.   There really is no meat on the menu, and I'm rather carnivorous, but I choose this over any meat-offering Indian restaurant in the valley.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WkCwXgntA9uneqXrLOesug"
  },
  "6qz3acdHbwufIP-8_c_kWw": {
    "date": "7/17/2017",
    "text": "The food is fresh and fast here! I had my birthday dinner here and a lot of my nonvegan friends and family LOVED the food! The staff is so nice, I love coming here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sjEPWN3qhN6mOKhYw4djnw"
  },
  "Qru4yxTDJneeUOJUtdrcgg": {
    "date": "6/10/2017",
    "text": "Surely the best south indian food in Arizona. Best dessert too (they make everything from scratch, incl the Badam halwa which is not to be missed). Very nice and friendly owner. Would definitely return here when in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V7mse7x5RZKXkQsmU9tqJg"
  },
  "padzfxtNEYh-HBckmkhbEg": {
    "date": "7/12/2017",
    "text": "Love this place! Delicious food, large portions, and very reasonable pricing.  Samosas are the best I've ever had!  Love the garlic naan - SO good!  Many vegan options available.  Super friendly service, highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ancvpInZnozbJGW1DfP-Cw"
  },
  "j9xN3XX6v-aC1EYcZ3DgdQ": {
    "date": "2/22/2018",
    "text": "Raunchy, food was ok, a little too spicy and caused an explosion through the back door",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6o7RCr4iY4CZB2ZcA4Rgqw"
  },
  "CPCJpb4NCnjIPPADDRs4lQ": {
    "date": "8/1/2018",
    "text": "I've eaten at many Indian restaurants throughout the western US. I had no idea how good Indian cuisine could be until I came to Ruchi's. I was blown away by the freshness, the variety, and the flavors. Plus the people there are friendly and interactive, showing authentic ways to mix and taste. The chai was amazing, as well as the mango lassi. Every time I go to Phoenix (~2 hrs away), I will eat here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4aFD7rVWLXTCVwIfG1oYDw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4aFD7rVWLXTCVwIfG1oYDw/o.jpg"
      }
    ],
    "user_id": "DtuFzGEwdYI5E3vTOMSOsw"
  },
  "LetBzH2iLwAmhPwI11xj1w": {
    "date": "6/8/2018",
    "text": "Step back all other Indian Restaurants for this one will put you to shame. Being a vegetarian with a side of sometimes vegan, this place is amazing. It's tucked away next door to another buffet but pass on that place and come here instead. BUT if your here for buffet, it's only available at lunch 11-3. This review is for dinner, no buffet.   The flavours are amazing, rich, deep and beautiful. To start, we had vegetable samosa which were HUGE! The levels of flavours was anything but bland and yes place the sauces on that beast that bring out to enhance the experience for your tastebuds. Next, I took our server advice and ordered Gobi Manchurian. It was just the thing I needed in my life. Think of buffalo wings (with meaty pieces of cauliflower instead) but then make them better and I requested a little more spice and oh Lord, my life is complete.  It wouldn't be a True meal if you didn't get Naan and so we went big and got garlic naan. I don't think there's a date nor vampire that is safe from this, it was just the right amount of garlic. My friend got Panner Butter Masala and that too was just a feast for your mouth!  Trust me, this place is one of the best!  The ambience is meh, but once you look past that and keep your eye on the prize then you'll be glad that you stopped by. The service is top notch!  I am looking forward to going to this place very soon and making it a regular visit during the week!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "X180VamQl9twSxzAL2wm_A"
  },
  "-HN_UKcZuQG7JvxAK4JwRw": {
    "date": "7/12/2018",
    "text": "My tummy is SO HAPPY right now! The so many delicious vegan options! I was wishing my stomach was bigger so I could have one more dosai. First time here and it's definitely going to be the first of many visits. The staff is super nice, fantastic service, great price, and don't leave without trying the golden lentil dish and vegetable curry. And the chickpeas! Basically, it's ALL delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bDCBNHBe87Z5QAOiglfpDQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bDCBNHBe87Z5QAOiglfpDQ/o.jpg"
      }
    ],
    "user_id": "pxzP42MHwDD4fM6kKU7m9w"
  },
  "XMO5Fv-Puzh5jxTXKFeIbQ": {
    "date": "5/24/2018",
    "text": "Exemplary service :  We dined here for the first time last evening.  The gentleman who served us delivered  an outstanding experience.   He was phenomenal in aiding our culinary choices and selling us on the unique value proposition of dishes that are not served elsewhere in the valley.  The ambiance is clean but far from decadent yet the  service will make up for it.  As an additional bonus, they have vegan options for every dish on the menu.   We look forward to our next experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "63A_tkR2JLH_MPPD2XooEg"
  },
  "hwfxDMicyCfZ8KqCZA5frw": {
    "date": "6/16/2019",
    "text": "I love this place because of the many vegan options they have. The staff is friendly and very accommodating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YKe6Qm2-q3Uv5Twns8ZYtg"
  },
  "KVXxgzen6X2dbFJ4FE1xfw": {
    "date": "3/2/2019",
    "text": "I love love love sambhar at this place, well to many it may not matter but most of the places either serve water like sambhar or really thick almost like daal. This one is just right. I love the dosa, onion chilly uttapam is my favorite. Anytime you go the idlies are always fresh. The owner Raj is a great host, making you comfortable right when you enter.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yg9SV3BpogxvAY5F8LicvA"
  },
  "tzJXnLGFkjdCoJDSCA5U6g": {
    "date": "6/15/2018",
    "text": "I've been here 5 to 6 times within the last 30 days. Amazing flavors with reliable staff who also label all buffet and menu items vegan/ gf/ veg. This place is where nourishment can be found.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hj_Bs1xlUj_gDEuwMtaAfw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hj_Bs1xlUj_gDEuwMtaAfw/o.jpg"
      }
    ],
    "user_id": "Bt3wx3kf6XhaRxRnAq7xcw"
  },
  "fdye2vFvwMi7nXdhqZBJ5g": {
    "date": "7/8/2018",
    "text": "Amazing! We spent the entire lunch buffet mmmming and talking about how amazing our meal is. The owner and chef walked us through the buffet to make sure all our allergies were addressed and told us what we could and could not have. With gluten, corn and nut allergies we all had incredible options. Gluten free dosa- my new fave! They even brought a special dessert so we could all have yummy sweets.  I can't recommend this place enough!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r2n1Erkb2iV4K58ARsAabQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r2n1Erkb2iV4K58ARsAabQ/o.jpg"
      },
      {
        "img_id": "j0j3xN2heP7U4t6-a_C7tA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j0j3xN2heP7U4t6-a_C7tA/o.jpg"
      },
      {
        "img_id": "b296taAMQ_JkQS9kSShH7w",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b296taAMQ_JkQS9kSShH7w/o.jpg"
      }
    ],
    "user_id": "28rAn7MyJR4JcFf2GfwDOg"
  },
  "_JCxuANBGzaK2NtYbzQLWw": {
    "date": "3/10/2019",
    "text": "We had the lunch buffet today, I am absolutely in love with this place. The staff is amazing and very helpful as I am unfamiliar with the Indian culture. The food is so incredible!!! If you want a new experience, with amazing varieties of different foods, this is the place. The prices are extremely affordable. I would give more Stars if I could!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OHrGorkSjkba9uZVp4qbew"
  },
  "A3I3qjPtRe5Sg36Xeg1oWw": {
    "date": "4/27/2018",
    "text": "Yummy vegan food! This was my first time and the lunch buffet was 90% vegan delightfulness.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9CjTYfWOYTtQVdgO7miapQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Delish! 90% Vegan Lunch Buffet.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9CjTYfWOYTtQVdgO7miapQ/o.jpg"
      }
    ],
    "user_id": "DoY-DY1QlN-Sztkbs7UQzw"
  },
  "3TvQvRak-YFDY09KSm0AjA": {
    "date": "4/30/2018",
    "text": "This is my favourite Indian restaurant in town. Plenty of vegan options, everything is rich and flavorful. Servers are friendly and polite. I often dine in and also order extra to go for later.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0pshpEmQCpatjH0axrkR0Q",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0pshpEmQCpatjH0axrkR0Q/o.jpg"
      },
      {
        "img_id": "i79WM3NM0wS2j1-cRa-L_w",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i79WM3NM0wS2j1-cRa-L_w/o.jpg"
      }
    ],
    "user_id": "YA6p0pfEr6lMa1TsQudtUg"
  },
  "lUJzW-HxRj6M1npK9u10ZA": {
    "date": "1/12/2019",
    "text": "Excellent food and service. Usually afraid of buffets but this was the best we've ever had, fresh hot and delicious. Definitely check this place out great for vegans!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EcuDxm1lTVWFrCKBEnkHgA"
  },
  "0Fl9Zizvqe8KMWJYo1OvSQ": {
    "date": "2/16/2019",
    "text": "I had delicious lunch today and my two kids enjoyed the food .!! Best part was the hospitality from the hotel staffs...!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G9hNhaW0OVrBPi5x5ZpoLg"
  },
  "qTzAruulZ5-3aVjHl4B1BA": {
    "date": "3/25/2018",
    "text": "I somehow missed \"vegetarian\" in the name, but as a vegetarian was very pleasantly surprised. We ordered the veggie pakora, the paneer butter masala, and poori. We both felt like the pakora was a little heavy. Paneer masala is my go to for Indian food. I didn't love the \"butter\"--it was a very strong ghee flavor. That said, I was craving the dish the next day and devoured the left overs. The service was friendly and attentive. I will probably order different things next time, but I will be back:)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "sC1zh2QPFcvTBXYnLAtX8w"
  },
  "9wvq312l48ObePWcuV_3mA": {
    "date": "9/26/2018",
    "text": "WHOA!! I just discovered this place. I am a huge fan of Indian food, and being a vegetarian/vegan I am always searching for new great places. This is now at the top of my list of veggie Indian restaurants in the Valley. Their food is delicious--not too spicy, incredibly flavorful, and consistent. Their $10 lunch buffet is out of this world--OUT OF THIS WORLD. You must go, vegetarian or not! I took my coworker here who is much more culinarily astute than I and who eats meat, and she LOVED it. There's so much seating--a perfect place to have a party or bring friends for lunch. Just tell them they get as much various, scrumptious vegetarian Indian food they want 11:00am-3:00pm for $10.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xKj1SOZjJGcyEzT-hOH_1A"
  },
  "y3tOEwF-f_TyQCetkVEnAg": {
    "date": "2/3/2019",
    "text": "After liturgy Mr P and myself wanted a Vegetarian Indian buffet. We searched & found this authentic, family owned spot. The buffet food was fresh and spicy, to the point where Mr P broke into a sweat. A good,  moist brow is the sign of happy customer. A new rug & cleaner bathrooms were the only obstacle to a 5 star rating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PMsP9ExQaS7XyKhz9HREuA"
  },
  "X27Gxig6Z_ng0eHheoTlyg": {
    "date": "11/10/2017",
    "text": "This is the first time in 25 years that I've been to an Indian eatery. But being a vegetarian eatery, my wife and I had to try it.  We were greeted by Raj, the owner, as we walked in and he sat us immediately.  As he was giving us the the menus, we asked a few questions  since didn't have a clue what we were looking at. He totally went through all the different types and how they are to be eaten. Awesome guy and very helpful for us first timers. We had a spicy soup that was excellent. Sorry, I can't remember the name of it. Then I got one of the crepe wraps that was huge and excellent as well. Then we got the Curry eggplant that was rich and so tasty!! And the beetroot halwa is my favorite desert! Such excellent food, I'm amazed there not more people on a Friday night! I just wished this place was closer to East Mesa...",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SmC0_2ShDAuKZbhWCT-hkg",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SmC0_2ShDAuKZbhWCT-hkg/o.jpg"
      },
      {
        "img_id": "XNoLn_gEZ-kSvnftVXUyUQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XNoLn_gEZ-kSvnftVXUyUQ/o.jpg"
      },
      {
        "img_id": "p8h9MRMTKjpsB4OhF4B_FQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p8h9MRMTKjpsB4OhF4B_FQ/o.jpg"
      }
    ],
    "user_id": "X-GCi4fX928Cr66SeqDrzg"
  },
  "A8jlECOVisdaU5vJttThVg": {
    "date": "10/24/2018",
    "text": "This place is so amazing. The owner is super sweet and helpful, especially if you're like me and have no idea what you're doing. The lunch buffet exceeds my expectations and if you decide to take this route, you will leave full and happy with zero regrets. If you don't make it to the buffet, you have to try the samosas, they're to die for. But if you do go here, be careful because you will forever be trying to find a better spot to get Indian food and you won't.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rz44cw31pOMyEDWVgqQs7A"
  },
  "QroP0dHxenY0L5Ci83-mYQ": {
    "date": "11/22/2018",
    "text": "Unexpected good authentic South Indian food. Chef Nagaraj made sure we had a good time.Highly recommend it for vegetarians.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2FOGE-6mINyiyImy3WWbSA"
  },
  "SHdV4MBSb-qIEMg0TE_y_g": {
    "date": "5/31/2018",
    "text": "What a great meal. Raj is very personable and will cater to your requests. I love their Gobi Manchurian,  garlic naan and other well prepared entrees presented in large portions. You will depart with \"people bags\" to go.  Well seasoned and mild enough for the sensitive tastebuds but spicy when desired.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hiry-Io9eaLONq-7w5bSBg"
  },
  "IqdKS-aOY2pAj4ExC3gxWw": {
    "date": "7/10/2015",
    "text": "My boyfriend took me here and I completely loved it. We got the Gobi Cauliflower and Thiruneiveli Spinach Dosai both were delicious. Gobi is amazing though and I could of just made that as a meal for myself. The service is amazing and everyone is so nice and polite. Can't wait to go back and to recommend my friends to eat here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P_tOYa-1IIHxuCjxt-LPfA"
  },
  "owbF-0cLqQC3P31jis2lBQ": {
    "date": "2/8/2015",
    "text": "It's a new restaurant in town. A month old may be. They serve good food. It misses out a 4 star from me as they don't change their menu regularly. I like to see at least a few different dishes when I go back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "XCanqaeQftuDcM6mkd0_cw"
  },
  "PFWWuwKM6A-yO5r6RznbQQ": {
    "date": "7/13/2015",
    "text": "I've been in Arizona for 2 years now and I can't believe I hadn't heard about this place. It's amazing. I love how warm their staff is. We ordered Mysore Masala Dosa's which were delicious. Way better than any others I've tried in AZ. Vadda was good and their Gobi Manchurian was amazing! Try their halwa ice cream and you won't be disappointed. I'm definitely going back next weekend for their lunch buffet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xyQ5EdLfIbltKUTOE3NrQw"
  },
  "F-vvalXb448wUEs7NmUfdQ": {
    "date": "7/7/2015",
    "text": "My first time here and after trying so many places- I think we finally found the one. This place is amazing and both my husband and I loved it! We had the samosas, dosa, mutter paneer, naan and they were delicious (even my meat-loving husband loved it). When we walked in we were greeted and seated immediately and the owner was super friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q8ONScArmCfJvQ8W9IpWEg"
  },
  "0CfFXmUAwJ89aV6nIPKfKw": {
    "date": "5/21/2015",
    "text": "Excellent. We're new to Chandler and being vegetarian have been looking for something like this. Had the extensive delicious buffet. Owner helped my husband choose dishes that weren't too spicy. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z1u78__0bWHQaCnsq_F4Lw"
  },
  "pVIFR6SGCjsBOEywdyDkQQ": {
    "date": "9/15/2015",
    "text": "Sitting in here now and can I just say it's absolutely amazing!!! We started out with Samosa and Vegetable Cutlet. Both wonderful! Now we had some Indian bread with peas, house specialties and some of their crepes. All fantastic!! Service is great. Everyone is friendly and refills are on time. Everything is naked for vegans and gluten free folks. Thank you for existing and making my dinners so enjoyable!! :D LOVE IT",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G6FtDb3Y5JxeCS3TIywmWw"
  },
  "_LEVEifutdgEuaagKuXMCQ": {
    "date": "5/19/2015",
    "text": "I found this wonderful Indian place while I was out with my wife promoting our business. It has the best menu I have seen for a buffet. It changes daily and I just love eating Southern Indian cuisine . The owner and staff are super personable and friendly and the food is always fresh even up to close at 3;00 I  am sure the dinner menu is just as wonderful and will comeback some evening for dosai Happy Hour!  I cannot wait to try everything. BTW the mango lassi are to die for.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "QQW99VhcP1Y6sXCzNCf4bw"
  },
  "jpeuB_qxh7VCTCfnQc7GnQ": {
    "date": "11/23/2016",
    "text": "Drove in from Vegas to the best Vegetarian South Indian Cuisine I've had in ages.  Ordered both special dinners and wow tons of food.  Everything from the bread, soup , main coarse was super tasty!  Prices are awesome also.  The staff was very friendly and prompt.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UFAIy2Mqh2N5qKAftOx7BA"
  },
  "AzsAHLNH8-ySXF2d5x9WgQ": {
    "date": "8/16/2015",
    "text": "Went here last night, the food was out of this world and the service was even better. You won't be disappointed. Can't wait to go back and try the lunch buffet!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZhJcv_CETAo3OqazRoGxqQ"
  },
  "gylpvI6Z15j4MR5m3OPg4A": {
    "date": "6/6/2015",
    "text": "This place was amazing. I've been transitioning into a vegetarian lifestyle and this place is god sent. It was so delicious. There were so many choices. Who needs meat?? It was clean and the service was wonderful. I will definitely be back and would recommend this place to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mRi0eaHs7td2UNuBe6joxw"
  },
  "emotGA8DCfFcUQPNPM6KQA": {
    "date": "9/20/2016",
    "text": "Even though there was another South Indian vegetarian restaurant right up the road from our hotel, it lacked a liquor license so we drove 10 miles to Ruchi on the basis of uniformly good reviews. We're glad we did, because the food was outstanding (and the beer & wine were welcome). We're not all that familiar with southern Indian cuisine, but the owner was very friendly and helped us make complementary selections from the extensive menu, and we enjoyed pakora appetizers, spinach dosai, mushroom & cauliflower curry, and tamarind rice. Portions were generous and left us enough for the next day's lunch. It was a bit disconcerting that we were the only customers along with one other solitary diner, but we arrived just after they opened on a Sunday evening. We hope that lack of patronage doesn't adversely affect their business, because we look forward to eating there again the next time we're in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Po7E4PyBwQlWk369J2i-nA"
  },
  "FHelUdI2N7RsvJ-xF9SQaw": {
    "date": "5/29/2015",
    "text": "A few word to describe this place: Excellent food, plenty of options on the menu, just the right blend of spice, prompt service. I have rarely come across an Indian restaurant that serves good North Indian and South Indian food - this one is on the top of my list here. We tried Gobi manchuri, avial,  masala dosa, uthappam, masala vada ... All of them were very tasty! Tip: try their cold coffee :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O9Z5q3qct8pIEv3NxbImrg"
  },
  "CTjL5y523RT_fSLWCcW8Bg": {
    "date": "10/31/2015",
    "text": "This place is incredible. The service is top notch, the food delicious and the restaurant clean and efficient. We love to go to the buffet on Sundays. I also love that they label which items are vegan and which items are not (even though most are). The food is incredible and fresh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j_rVsVCPSDhFlH7lg_wvjA"
  },
  "9GujkGislM1B5LnGihGKlg": {
    "date": "7/19/2015",
    "text": "Best service ever! Awesome food! All the recommendations from the owner was absolutely amazing. The owner is so passionate with what he does and the Indian cuisine. We enjoyed coming in and we would come back again even though we are not vegetarians. Great place for dinner! Will come back to try to buffet next time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nYuMLOohkMIVCZcRDnh6XQ"
  },
  "PTiJS-y5tLsBzxsxY4UlSQ": {
    "date": "9/4/2015",
    "text": "Love this place. Discovered it a few months ago and have been there at least 6 times since, taking family and friends to check it out. Very nice, helpful staff, they are helpful and accommodating for us because we eat gluten free and vegan. Th ey have many options and help us find dishes that we can eat, even preparing things especially for us if we ask. Their lunch buffet is excellent. Reasonable prices, very happy to serve their guests, friendly and generous. Huge portions and nice atmosphere. Highly recommended! !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "29QNz78TUSkE5_uenGzW1w"
  },
  "68fbTnNbqYvKXStF7eWA9Q": {
    "date": "8/11/2015",
    "text": "This is my new favorite place. As a vegetarian, it is so awesome to be able to go to a buffet and try ALL the things - and I did ^_^ The dosi (potato crepe) was great, but as we stared at it, perplexed at how to go about eating the huge crepe that mostly closely approximated a ginormous burrito, the owner came by and showed us how to eat it with the proper sauces and accompanying soup. I will say that a meal could be made just out of the dosi + soup. The eggplant dish was awesome, the butter sauce was great. The only things that were just average were the naan and pankora (fried vegetable appetizer). Still, I will admit I actually came back and got take out the next day, too, because it had been 24 hours and I missed it all so much.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xPstnqgx3BQjvHVOz05f4g"
  },
  "anIr2eSc0uugHpmu6vlcbg": {
    "date": "8/6/2015",
    "text": "I love this place! The food is delicious, fair priced, and it fills you up. So many vegan options, as well as vegetarian. Even if you're a meat eater, you won't be disappointed. And the owner is soo sooo nice! He was our server, very attentive and kind. I'll be going back for the lunch buffet!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mqVJbdVr9Mr8AZWFr8oO0A"
  },
  "vmynItROnb-bp-J6Efw1fw": {
    "date": "8/9/2016",
    "text": "Another great restaurant in Chandler with vegan options. The food is really spicy and there is a desert with whole wheat and cardamum that is fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xj-kqXSAN4ctZytmgxsPKA"
  },
  "Uf49FZVhp1xkxTUskjdmfA": {
    "date": "7/3/2016",
    "text": "This place was absolutely amazing. Went for my birthday dinner, and to introduce my dad to Indian food. We had a big party and were treated very personally. The food was delicious, best Indian food I've ever had. All the staff was super friendly, and when they heard it was my birthdays, they brought out a huge dessert for us all to share, even with a candle. We're from out of state and will be back whenever we come out here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1KN5adaUmbkxroNqvVf1CA"
  },
  "Kft27BV1lj5ed1XMFtGgDw": {
    "date": "5/23/2016",
    "text": "Great food! All vegetarian friendly and delicious. Great customer service too. Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j0d1BopeFZ0pvitaNA3Vpg"
  },
  "bxViYf2AtFFc160eBEantw": {
    "date": "6/19/2015",
    "text": "The Service is nothing short of spectacular. The host not only wants to feed you out of the goodness of his heart, they actually care a lot about how much people like their food. My gf has issues with hot food but the host was so nice, offered her remake her food but didn't have to because it came out perfect just like she had ordered. The food is so amazing, this will be my regular go to Indian place. I grew up in Chandigarh so I am from Punjab but this place makes better Punjabi food then most places out there. Only one thing they are vegetarian. Another thing I love about these guys. Polite, excellent food, very hospitable, just simply amazing.  Foods to try: Gobi Manchurian, Any DOSA, vegetable biryani, so and the desserts OMG it making me hungry just thinking about it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "e3HEJViXvKZIUYSTgAnkJw"
  },
  "XCxNjMY6yQObw_9iqC04Dg": {
    "date": "8/25/2015",
    "text": "Based on yelp reviews decided to give it a try. Got the vegetable biryani.........it was pathetic. It wasn't even near to a biryani. An over rated place I guess. Not recommended at all.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fR4hq0UlIpp4lDXKxmHhGw"
  },
  "HsSvIiVPcqjI78rhEPnzHQ": {
    "date": "8/19/2016",
    "text": "My partner and I have been all over the valley in search of good Indian food. Coming from Ann Arbor, MI there is no shortage of fantastic Indian restaurants to choose from. After literally years of searching we finally came across this gem. The meal started out right. The dosai was amazing: crispy, light, and loaded with cheese and fresh veggies. The vegetables vindaloo were cooked to perfection, no hard potatoes or carrots or mushy beans to be found. The sauce was flavorful with the perfect amount of spice and heat. The same can be said for the palak paneer, you could smell the fresh roasted garlic - delicious! Importantly, the rice was cooked perfectly, hot and fluffy. When the rice is off even a little bit it can ruin the experience - not here! The owner was attentive and seemed like he really cared. He checked with us to see how our meal was and the staff worked hard - we got our food promptly and had our water refilled at least a half dozen times. It's located in a strip mall, so the parking is bountiful. We drove from downtown Phoenix and will be making the trip again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "L93tniG7WmLnU5dKkLFApg"
  },
  "uWwTf7475u0C-EmY6UT5rw": {
    "date": "4/1/2015",
    "text": "This is becoming one of my favorite restaurants. I have been here for dinner and the lunch buffet. Both lunch and dinner were excellent. The service has been great.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "4QfuerBgvb05u1JG0NRRmg"
  },
  "aTNcJVZB6xGdAwliCbhJ_g": {
    "date": "2/5/2017",
    "text": "What a great place! My friend is a celiac and the owner was so amazing to cater with gluten free dosas and walked us through the lunch buffet. Excellent variety and flavors!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6_6XIVpehlOTyvYyg0wlnQ"
  },
  "hkbAkE1q2_4YIhQ6WEHo1w": {
    "date": "6/27/2015",
    "text": "I took my husband here for a pre-Fathers Day dinner and we walked in to find we were the only non-Indian family in the restaurant.  Bonus!! This is a True vegetarian Indian restaurant with so many great items. The vegetable vindaloo was amazing and the garlic Naan was to die for. The different curries, soups and sauces were equally as fabulous. The staff was incredibly helpful and so personable. Our family walked out talking about how full they were and we had boxes to take home. Definite go to in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8VFrQWx-JOi6swgP4aYi2Q"
  },
  "PfDZSrzmxicV5DhpteE9KQ": {
    "date": "10/6/2015",
    "text": "Stopped in to check out the buffet for lunch and I was not disappointed! This is some of the best Indian cuisine I've had and I've been to several restaurants. The staff is VERY friendly so if you e never had Indian food do not be afraid to come here because they will help you! A nice gentleman recommended sauces or chutneys for me to try wit the dishes I selected from the buffet and I'm so glad I listened to him! I enjoyed everything I ate! Highly recommend!!! Also, I am not a vegetarian but I really enjoy vegetarian Indian cuisine so do not assume you have to be vegetarian to enjoy the food here. A+",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y_v7p8iC_VDE1a6QthlCvg"
  },
  "aV5Is7eUecEhuPZPqiUeRQ": {
    "date": "8/29/2015",
    "text": "Visiting from NY and my mom & sister are veggie lovers so I found this place on yelp and decided to give it a shot cause of all the great reviews. Service was impeccable, food was delicious, but the place was absolutely empty on a Friday night. The manager helped us decide what to choose. He was very friendly and made us feel at home. Water was refilled frequently which was good since most of the food was spicy. It was like Indian comfort food in the west coast, so 4 stars it is!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mVJTiAURmfWVmMyLRFJuvw"
  },
  "I_ZhgqB8X2DspSBS6OeLuw": {
    "date": "4/15/2016",
    "text": "Delicious!!!! And inexpensive. Very tastey, authentic Indian food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6MxRI28jcyYK4DpU2ap7FA"
  },
  "smflKioKY6qpzPmtYe-Zsw": {
    "date": "3/18/2015",
    "text": "I'm a big fan of Indian food, so I was glad to see a new Indian restaurant open up so close to where I work.  I went in for lunch today, the food was delicious!  I'm not a vegetarian, but with flavors this good I did not miss the meat at all.  I had the vegetable vindaloo which was really good, the spice level was pefect and they give you plenty of food.  I also had a garlic Naan bread which was excellent.  I'm not normally a buffet guy, but I had a look at what they had on offer and it looked really fresh with plenty to choose from.  I will be trying the buffet next time I go.  This is easily the best Indian food I've had in Arizona. Woodlands is good and I love India Oven and Guru Palace but I think this place beats them all.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "NbZVY_CPtiDeAidFhnPrpQ"
  },
  "8SUgePFz2X5NMiK7Zuk8zw": {
    "date": "4/8/2016",
    "text": "We went for the lunch buffet with our son & daughter in-law and friends last Saturday.  This place rocks!!!  Both the food & service are great!  The best compliment I can pay is with a return trip - which we intend to do the next time were in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9OrG6hDTU1zSc5ICQRic8A"
  },
  "bZ8xZtvVYxckrJf0v2auYw": {
    "date": "10/3/2015",
    "text": "We dined here after going through so many positive reviews. But the food didn't match the promise. Service & friendliness of the staff was good , but some of the food items weren't prepared the way they're supposed to be.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WbCLfzFpJFwC5AEhPdCPZA"
  },
  "eB1iyyj_Z6O7neYMzTVErw": {
    "date": "8/20/2015",
    "text": "I am not a vegan or vegetarian, but I really enjoyed the food!  Excellent flavor and perfectly prepared!  Definitely a great spot for Indian fare, especially if you're a vegan or vegetarian.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5jEEo7SoLGMUq1FuRW182A"
  },
  "6ASwj44jBV8I5mW48qgyUQ": {
    "date": "2/7/2017",
    "text": "The staff is always pleasant and helpful. They have many vegan and gluten free items available. The veg biryani and tomato dosai tastes wonderful and the chili pakoras are delicious. They are always so happy to serve their guests. I feel great about supporting a place where customers are treated so well and the food is so yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kToJpoliLYgTj4VkHjd4dQ"
  },
  "gP2QV-fve4BN5549JgF5XA": {
    "date": "4/25/2015",
    "text": "We ordered Chettinad curry and masala dosa. Delicious food ! Probably one of the best South Indian food in the valley! I really hope they do not reduce their quality like most of the other Indian restaurants around here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "GRIfC4ooNcs4IvOJaTBjWA"
  },
  "53bnrBBuVbOJUvb5lLmxZQ": {
    "date": "7/8/2015",
    "text": "I was pleased to know that this restaurant is vegetarian and vegan in some regards, but sad to say that I've had better Indian in other places in Gilbert, Chandler and Scottsdale. The portions were generous for the sample platter, and a variety of flavors were offered in metal containers, along with rice, plain naan bread and a drink which was nice, and for about $13. On a more positive note, the garlic naan I ordered separately was probably the best thing I had there. I enjoyed trying this place, but it didn't measure up like I was hoping in the gustatory department.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kqNJmVQDXyHoi8bXmhx2CQ"
  },
  "eTagNcuGpsh47O0-QhjDhg": {
    "date": "9/30/2015",
    "text": "Food is good, excellent lunch buffet pricing, all vegetarian though so sorry carnivores ... I'm not sure why it's so hot inside though but the atmosphere is not comfortable because the AC doesn't seem to work well, but anyhow good food good service at least during lunch buffet, only complaint is it's too hot inside every time ...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "J_YUW5WkPmf8UCnQyoSjkA"
  },
  "x0gOm-_fa3JRbXYGeknfmA": {
    "date": "7/5/2015",
    "text": "Mmmmmm if you're a meat lover like me, you'll be surprised at how much you'll love this all vegetarian buffet! There's a lot of vegan options mixed in, and everything is delicious. The lunch buffet is good quality food for about 12$ a piece! Free Indian coffee and dosas (if you don't know what that is, it's a crispy thin bread with potatoes inside. It's lovely!) and delicious desserts. Super friendly service too! It's a good place :) try it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IXeZNndab2G-CW0ANzt4cA"
  },
  "kKy2BVoKhrcjmDaUTpzS3w": {
    "date": "6/1/2015",
    "text": "Finally an Indian restaurant I like.   As a rule, we run from Indian buffets as if they were the plague. So I was dreading lunch when my husband oddly declared he was craving indian and insisted on weekend buffet lunch.  We'd never heard of Ruchi before but decided to try it as it was on our way home. We walked in to see a familiar face - turns out that it is the ex-owner of Udupi. They were friendly and attentive, the place was tastefully decorated (no placemat that looked like it had been through the wringer since 1649) and clean. We walked in at 11 and were surprised to see the buffet ready! (Granted, I haven't been to an Indian place in ages, so the habit of setting up the buffet 1/2 hour after open time and staring at you while you wait uncomfortably might have died along with the recession). Good sign. Also catered food was ready to go when those people turned up, which was also a good thing.  We were surprised to see the variety in the buffet. There was a generous mix of north and south Indian, and best of all, none of them tasted like they had made up volume with corn starch. My husband who had declared he could eat a whole bear for lunch was full before he could even sample all the items. Again, my attitude could be ancient, but we were impressed by quality and quantity.  Finally an Indian restaurant I like.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YqbxuF6zFuBtWSaeNyQ74Q"
  },
  "d_wQIi1wx3lvBntmmnbaUA": {
    "date": "3/17/2015",
    "text": "I had always wanted to try Indian food, and really wanted to try a buffet so I could sample a lot of different dishes, but most restaurants that have a buffet are not vegetarian so most of the dishes would have been off limits for me.  Not the case with Ruchi!  An entire buffet of vegetarian food!  It was like a dream.  I tried almost everything...and everything was really good!  The young guy that served us, was so nice and helpful, and after telling him it was my first time eating Indian food, he explained what things were, what chutneys go with what, and how things are generally eaten.  I really can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "l5x4wzz9VOcQ22XMthU6uw"
  },
  "zT_vk5yaR07K7sx5hl0-8Q": {
    "date": "1/24/2019",
    "text": "There's really not much I can say about this place cause it's all soo good! They have a really nice and yummy vegan menu I didn't give it a full 5 star just because the service was slow and limited but it could have been an off day for them but the food is good I would def recommend  the samosas. I'm upset I didn't get to take a picture of my food but trust me the food is good! You Must be a spicy lover too cause it's spicy I'm Sure you can order it how you like though. Over all a great place",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "oL79sfFg0c2t8vRCXBHaCA"
  },
  "0grMBf3lEH946eAKHpvUpw": {
    "date": "3/24/2019",
    "text": "Had an amazing dinner at Ruchi! We were visiting the area from out of town and I searched Yelp for the highest rated vegetarian/vegan and came across Ruchi. Really lived up to the hype.  Everything was absolutely delicious. I especially loved that we could get vegan garlic naan, usually made with butter or ghee at non vegetarian restaurants. Went for classic dishes, I got the aloo gobi, but honestly it was better than I'd had anywhere else.  The service we received was so warm and welcoming. I imagine I'd eat there once a week if we lived in town. Soooooo good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oElyweWIOr88DkgX35tuow"
  },
  "PtAHqF3j4d35SXvSXc01Cg": {
    "date": "4/14/2019",
    "text": "Server very helpful. Staff was excellent. Food amazing and everything we hoped for. Truly a South Indian restaurant worth going to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yQJMgRaeiCOZVVyirqaw3A",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yQJMgRaeiCOZVVyirqaw3A/o.jpg"
      },
      {
        "img_id": "DdAej2QwT46ni-hGP3C4gw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Chana Batura",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DdAej2QwT46ni-hGP3C4gw/o.jpg"
      }
    ],
    "user_id": "SYobCNQouiYhtA-SHpIQ7Q"
  },
  "thJZNVbEDExGnS4vlNdjng": {
    "date": "6/23/2019",
    "text": "Amazing!!! The lady in charge does an amazing job making sure All the customer are happy and enjoy their food and experience. I normally hate buffets but this buffet was amazing and the dosa was fantastic and unlimited",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UoAZz8uhfb2BnjigOEmf7w"
  },
  "PeWksVYkHP3Dzx-Pswptvg": {
    "date": "12/21/2018",
    "text": "I finally found a place at a fair distance from home which serves good South Indian food. The Idlis and dosas are exactly like how it is served in Tamil Nadu. And don't miss the uthappam! The first time I went in was for the lunch buffet. They had decent meals with a large variety of options. You also get the traditional aamai vadai (dal vada- lentil fritters ) here. The second time was for dinner. We ordered the tiffin combo in which rasam was served as a soup, 1 idli, 1 medhu vada and 1 uthapam/ dosa. I chose the vegetable uthapam. The veggies were cooked crisp and it tasted fair. 1 point to note down is the spice level in rasam and sambar. I eat a fair amount of spice so it didn't bother me much, but make sure you confirm your spice level if you aren't tolerant enough. I would definitely go again for idli/ dosa and uthappam!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Icl6FPyBNFm6VREuL32XEA"
  },
  "32qxOx696RIlCbtGUXNOMg": {
    "date": "6/8/2018",
    "text": "This was a hidden spot i didn't know existed! My friend convinced me to go and i didn't realize i was in for a treat-especially since im a meat lover!  Amazing service by the owner,  delicious food full of exploding flavors! We ordered various items to try. My 15 mo old who has been on a food strike devoured the crepe w curried potatoes! He wouldn't put them down!  Def a new favorite spot! Highly recommend! We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7Zh39ayam-GBQSA5fYGJXg",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7Zh39ayam-GBQSA5fYGJXg/o.jpg"
      },
      {
        "img_id": "cLRnnU4fQBu_8yiJaUFaiQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cLRnnU4fQBu_8yiJaUFaiQ/o.jpg"
      },
      {
        "img_id": "6Dg66ouldkW_Ik2TS4Wv2Q",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6Dg66ouldkW_Ik2TS4Wv2Q/o.jpg"
      }
    ],
    "user_id": "WPEZrwh_2qkzxCl9CMswIg"
  },
  "LFPsr5sv8QRqFn5M3P2Wzw": {
    "date": "6/2/2019",
    "text": "I love eating vegan and Indian and I'm so glad I found this gem. I've been twice and I believe the first time was on a holiday of some sort, definitely try to go in on one of these days as they have mango lasso and a larger array of dishes as part of their buffet. The stand outs for me were the dosas which are a nice starter touch and they have a variety of sauces and salsas to dip these in. I really enjoy their dal, paneer butter masala,Chana Masala,vegetable pulua, and the beetroot dessert.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rWbelwRG6DNYRxq82BEXow"
  },
  "lyQeF0fuHrOwa4Q5QWC1GQ": {
    "date": "6/2/2019",
    "text": "Dessert and dosa were good but the rest of the food tasted old and some of the things that should be crunchy like pakora were soggy and stall tasting. Maybe they had a bad day.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Sr6NJcjjX2DLv8UwAqWYw"
  },
  "lQ0HdUjDrjYpeTLp9fYpDw": {
    "date": "10/28/2017",
    "text": "Ruchi is our go-to spot for Indian lunch buffets. There are Indian restaurants closer to our house, but Ruchi is our favorite and worth the trip. It's 100% vegetarian and probably 90% vegan.   The items on the buffet vary, so it's a great way to try new things. They always have a few staples like channa masala or dal. There's always something great and we come away stuffed.  The heat level ranges from very mild to extra spicy, depending on the dish. The buffet makes it easy to try a sampler first, then go back for the ones that suit you. The buffet also comes with dosa. The ones we had today were a little sub par (potatoes weren't cooked well) but are a nice mild palate cleanser between spicy dishes.   Another highlight is the wide variety of vegan chutneys. The mint chutney is my favorite.   They also have an interesting variety of desserts on the buffet. Usually about half of them are vegan, which is a nice change from most places.  The service is always spot on. A regular flow of ice water is required, and they are always on it! Sometimes the A/C needs to be cooler, but that could also be because of the heat in the food.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "26A6XRkrV5MXl9kl4pgmmA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/26A6XRkrV5MXl9kl4pgmmA/o.jpg"
      },
      {
        "img_id": "Xw10iwiVDAWifeXwm4VTFw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Xw10iwiVDAWifeXwm4VTFw/o.jpg"
      },
      {
        "img_id": "O4PN7hJxZk4WxE-DR8R1iw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O4PN7hJxZk4WxE-DR8R1iw/o.jpg"
      }
    ],
    "user_id": "1WREwRWD4sHHObFXmCCgyw"
  },
  "x78oDP5R-eUyYnlxYLm5xg": {
    "date": "9/10/2017",
    "text": "The best part about dining at Ruchi is that if you are vegetarian or looking for a meal without meat, you don't have to worry at all here -- everything is 100% vegetarian! Big shout-out and thanks to the lovely Tigra C. for organizing a fun Veg Night Out here.   I'm a fan of Indian food but I am more familiar with the northern style dishes so I jumped at the chance to get acquainted with some of the southern fare.   High on my list of items to try was DOSA! And it did not disappoint! I ordered the Masala Dosa which was filled with a potato mixture. I did not know what I was in store for... When the dish arrived the dosa itself was larger than my whole forearm!! It was GINORMOUS!! And I was thrilled!  The food was amazing, had very generous portions and I took a lot of leftovers home to eat the next day. Tigra was kind enough to let me sample some of her Aloo Saag, which is not on the menu but should be because I've been craving some ever since! It was so gooooooood!  Service was friendly. Though I wish checks were done different. Pretty sure I was charged for an item I never received, but it was too difficult to tell so I just let it go. Also I picked up a discount code to use for ordering delivery from the restaurant but upon a closer look, it turn out to be expired. Darn it, don't tease people like that!  Overall, I definitely want comeback to try their lunch buffet someday or get take out in future.",
    "rating": 4,
    "rated": {
      "funny": 22,
      "useful": 36,
      "cool": 37
    },
    "photos": [
      {
        "img_id": "1aE2KOvylBTSPO3Uvhb6NA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Rose Lassi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1aE2KOvylBTSPO3Uvhb6NA/o.jpg"
      },
      {
        "img_id": "1dKrMnAJIMhlnbe72xekSA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Masala Dosa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1dKrMnAJIMhlnbe72xekSA/o.jpg"
      },
      {
        "img_id": "CrpaXGx91iI7wOChzL37SA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Aloo Saag",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CrpaXGx91iI7wOChzL37SA/o.jpg"
      }
    ],
    "user_id": "5ylIKMA-zoXZvH_-X26YOg"
  },
  "WSXczXYnyg0L75CXS3pDfg": {
    "date": "3/17/2018",
    "text": "Was here for an Sunday buffet. Saw a good crowd in there.  It's a buffet, so you get to eat all you need. Food was fresh and options were many. I don't eat meat and I would totally recommend this place for wide variety of options. Personal favorite is upma with coconut chutney. Unique dish is mushroom bajji, never heard / had this before..was yummy though.  Totally worth a try for the price you pay.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "YpVvSMuQWQiRCHbbUjFzag"
  },
  "ERd_Vtwi3avfhczDO-i3VQ": {
    "date": "12/22/2018",
    "text": "A lady had recommended Ruchi it to me a while back and my boyfriend, and I decided to check it out today. From 11am-3pm everyday Ruchi has a lunch buffet.   We were greeted right away and the lady asked us if we wanted water or anything else to drink and then told us we could help ourselves to the buffet. We tried a little bit of everything and the food was delicious. The owner was very nice. He saw the confused looks on our face  when they brought out two very large dosas stuffed with potatoes to us. He made some great recommendations on what soup and sauces we should dip the dosa in. I highly recommend this place, especially the palak paneer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CoXFHxUxfJuRwpdVvlipBw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CoXFHxUxfJuRwpdVvlipBw/o.jpg"
      },
      {
        "img_id": "7CKqRj6UznlpWmPiDsPLVQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7CKqRj6UznlpWmPiDsPLVQ/o.jpg"
      }
    ],
    "user_id": "snbjen-glyV_5ndooJE7zA"
  },
  "pNodygrc2IqTLGUT9Bd9UA": {
    "date": "4/7/2019",
    "text": "We ended up here purely based on reviews and the restaurant and food did not disappoint. It was moderately crowded for a Friday late dinner. The owner came out and chatted with us for a while. The dosa's, Pongal and aloo paratha were all super delicious. We ordered more than we can eat but will end up here again if we go to Phoenix again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lvH3WUYrh3Mz8uVf5I0iYQ"
  },
  "PNxpMVJT4M4G13gc8savuA": {
    "date": "4/7/2019",
    "text": "Really delicious food, especially the dosas. Service was awesome. The owner is very hospitable. My entire family had a great time.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KtUSS0sZbcz_u8fNSDixlw"
  },
  "iykPoChkBv07u-sb4CCMhQ": {
    "date": "6/23/2017",
    "text": "Went here last night as part of a non-Yelp sponsored event called Veg Night Out. It's organized by this lady Tigra and we all get together and eat yummy vegetarian/vegan food. So glad I found this group! How cool!   Aside from meeting some really awesome people, the food was delicious as always. This time I ordered the lemon rice instead of the vegetable briyani,which is what I usually get. The lemon rice was a generous portion with exotic flavors and cashews, which added crunch and a unique flavor. It was delicious. The guy sitting across from me let me try some of his pancake thingy that had potatoes in it and OMG it was a burst of flavor. So amazingly delicious.   This was my first time dining in the restaurant. The service was great and the ambiance/atmosphere was authentic. Some things to keep in mind: their water is just normal tap water, not filtered. Also, their iced tea is sweetened and they don't have unsweetened. I wish they did.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "KbxsSVFuxBrVNgztudhqWw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Lemon rice. So flavorful!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KbxsSVFuxBrVNgztudhqWw/o.jpg"
      }
    ],
    "user_id": "JVM2ebglqYyxyCB0hlr5sw"
  },
  "KVngZfcUGu6L-hiZ148yEQ": {
    "date": "1/5/2019",
    "text": "Fabulous food! Warm and inviting atmosphere and really enjoyed speaking with the owner, Raj. When he opened this restaurant in 2003 he was the 3rd Indian restaurant in the Phoenix metro area. There are now over 75 Indian restaurants but what makes Rucki unique is that it is genuinely vegetarian and is committed to fresh ingredients. The food here is made from scratch and the flavors are amazing! This family business is a True labor of love and definitely worth visiting!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4BO2nxeVaMnbopVvZ2_jYg"
  },
  "AzfuAoyYy1s7TTr2JkNe4w": {
    "date": "6/9/2019",
    "text": "Very expensive.. too small quantity ..and tasteless.. In fact very few indian restaurants in phoenix tasted worse than this. Carrot halwa was uncooked .. peas paratha and garlic paratha was also uncooked and tasteless..Not sure how this got 4.5 ratings..either everyone's tastebud is dead or the reviews are fake ..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8S5aJAB1Uy2Y47bpQITEkg"
  },
  "BXD1G1zdm8X3bxfeXDATRg": {
    "date": "9/14/2018",
    "text": "Never had Indian food before but it was hot and cooked perfectly. Gobi Manchurian was spicy and soo flavorful. Chole Peshawari curry was okay. Specia Rava Masala Dosai is really good, not salty, greasy or buttery. Just right! I will be eating here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NyEOhr74IHmH0ysi4xFCWQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Specia Rava Masala Dosai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NyEOhr74IHmH0ysi4xFCWQ/o.jpg"
      },
      {
        "img_id": "p_vvhY-PQPjCHQHDf1OtqQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Gobi Manchurian",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p_vvhY-PQPjCHQHDf1OtqQ/o.jpg"
      }
    ],
    "user_id": "nn--A7UnuUNERb1C9XPXVQ"
  },
  "OP7utXKiM2LTOfxG_uo3qg": {
    "date": "2/1/2019",
    "text": "Just wanna say that I DID take the person I thought about taking to this restaurant, and he DID really enjoy it.   This was only my second time at Ruchi for the lunch buffet and I felt a bit bad b/c we got there only a half hour before the buffet closed, which I know is often annoying to restaurant ppl, BUT, on the flip side I can say that the food was still warm and plentiful on the buffet.   Plus, the selection of items was totally different than it was the last time I went? Like, diff vegetable curries, different rice, same papadum though, which is great b/c I LOVE papadum. The standards of plain rice, rasam, sambar, chutneys were all there, but there were also a mushroom masala, squash and lentils, potato bonda, mixed veg curry w/ like okra and onions and green beans. There may be more specific names for these things that I neither know nor remember but what is important is, they were extremely good. The dosa was also still very good, the chutneys also - very good.   I'm honestly - I live like a 25 minute drive from Ruchi but it's absolutely my favorite Indian restaurant here in the broader Tempe area, and almost my favorite Indian buffet ever. The only problem is really that the taps in the men's bathroom sink are kind of weird - like if you turn it too far in either direction it won't turn off, but that's NOTHING, esp b/c the bathroom has two stalls and a urinal, is clean, and also has a fun automatic paper towel dispenser.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fnFhRNs4Jt6Z9mP4ZXxNsg"
  },
  "5mkvE9-aZrFftgqPf274rg": {
    "date": "3/22/2019",
    "text": "Can't believe I've lived next door for 3 years and never tried the place.  Came for the buffet... the palak paneer with spinach and homemade cheese looked amazing. I LOVED the dal, kari, tamarind chutney, onion pakora, naanm The dosa came out hot and deposited on my table.  Come try this wonderful mostly Vegan buffet!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5j0iuaFe8IrfOTJzkCIyLg"
  },
  "ruTRTKO6Ik5-CqOFXvUXJQ": {
    "date": "11/29/2015",
    "text": "Some of the best Curry Ive had.  They had tons of Vegan options.  I was craving Yellow Curry.  I read that it had Yogurt, and asked if it was possible to do without.  Owner came out and reassured me anything is possible.  He was a stand up gentlemen, and you can tell they really care about the food here.  It shows.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "HPfCDZ_fAeB-zyHqz-plHg"
  },
  "Xq3vLj4IIWbyPYMuiOEEgQ": {
    "date": "6/23/2015",
    "text": "This place rocks!! The foods amazing, the people are friendly! I don't even know what I ate but it was sooooo freaking good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cHbuOuCDrHu5BzmQ4N0fMQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cHbuOuCDrHu5BzmQ4N0fMQ/o.jpg"
      }
    ],
    "user_id": "MYsLEREp1I_cY3zskQkB2A"
  },
  "S6b_2GgII1XelnNZanQhHQ": {
    "date": "2/18/2016",
    "text": "Not sure if you want the best Indian food in Arizona? Just keep on driving by. I swear this man has Vashnu and Shiva in his kitchen as inspiration for this divine treat.  His service is not to be under estimated. There is an uncounted time I've been here and it's so perfect each visit. Every time! Try his good food at both the vegetarian festival and the Indian festival. Come in for the buffet. These things will blow your mind. Try the tea. He brews a soft delicacy of lassi and more. You will never run out of water here so don't be shy and try the spicy stuff. I recommend the deluxe dinners if it's your first time. Talk to him, he will suggest something for exactly what you are craving. His deserts are unique down to the spice to clear your pallet at the end. There are beer signs all over. Yes he serves good stills too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJ2Vwjnn772f0bBJrLtTJA"
  },
  "j__CgUMbfqG9SWX43qaQlw": {
    "date": "6/4/2016",
    "text": "Absolutely love this place. This was my first introduction to Indian food and it was phenomenal! Everything is so flavorful and hearty-you leave feeling like your tummy is getting a nice warm hug. Everything is clearly labeled vegan and the owner is beyond accommodating. He even makes special gluten free items if you just ask! The ambiance is a little lacking, but the food (which is what really matters) more than makes up for it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3yGrWvX8Et2qG_I-Ff1RDA"
  },
  "_nVyegP1MS_cJz-EZmIG5g": {
    "date": "1/3/2016",
    "text": "Went after reading great reviews but was very disappointed. First of all they gave tap water to from as is. The lady was not not even smiling. Masala in masala dosa was very bad. Chutneys were good. Vada was little hard.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9SiUVn598z2GUpR2pSPvDQ"
  },
  "ISG0Pr0dpa03q0OuLwlFHQ": {
    "date": "6/14/2016",
    "text": "Thought we loved Indian food before, but now we are crazy about it! The staff has always been so kind and caring, giving us vegan desserts, vegan mango lassi, and helping our one year old enjoy too. Actually, our one year old eats like a champ every time we are here. Don't go anywhere else, go here! Try out lunch buffet to have a little bit of everything. Vegan items are clearly labeled on buffet items and in menu. How awesome is that :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kSnc3C9_eDFwZ0B-X92TMQ"
  },
  "1HZkQS8Io91egxfPrEhJSQ": {
    "date": "1/5/2016",
    "text": "I've come to their lunch buffet a number of times... fantastic if you're vegan because everything is labeled. The sambar and chutneys are lovely and they make a great dosa. Service is attentive and friendly.  Oh and one tip... wait to get your chutneys/sambar until they bring out your dosa because last time I ended up with double of everything!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "shfUvQ_vwnvCgfYaB1gb1A"
  },
  "XsaqAeNWrSTHaAwqkfWQ6w": {
    "date": "4/8/2017",
    "text": "I love this place. I always order yummy curries from here. (Love Bhindi!) They make special order for me, make it mild & with less oil. And the customer service is great. Thank you All for great food! Thanks to the very kind owner & the very accommodating chef. Keep it up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ESy342WfZBiDZHhFf8QEg"
  },
  "v_5zQzpzO-xWJczmiCtl9Q": {
    "date": "6/11/2017",
    "text": "Great service! Tasty food! My first time here and was very impressed, will be a regular. I tried chili ghorbi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XE0GIs7KkGz1WZurajbsdw"
  },
  "8ZEXJVyzr6fN5DdmfTUdYA": {
    "date": "1/22/2017",
    "text": "V had idli, rava masala dosa and bisi bele baat. None of them were  good . Taste not authentic .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRwc4SXliereFkhcvM-C3w"
  },
  "0y8l5n2g5kBKTmQ8-rV7Qg": {
    "date": "5/5/2016",
    "text": "This place is as authentic as it gets. If you've ever considered making the move to vegetarian or vegan, this is a great place to start that experience. I went right at the start of lunch time around 11:30 AM. The bright flavors and aromatics of the food here Plus the endless combinations possible with the multitude of flavorful chutneys make every visit an experience. I've never eaten beet root before but it was absolutely delicious andI can't wait to go back for more. All the dishes have A fresh bright  eye appeal. Complex flavors marry bold Currys, mint, coconut, tamarind and/or turmeric and cilantro with subtle earthy flavors like saffron, onion, tomato,  cauliflower, eggplant and root vegetables. Each dish is unique and there are plenty of mellow items on the buffet such as naan bread, rice and a crunchy dosa to balance everything out. The desserts are never overly sweet and everything is clearly marked vegan or non-vegan in case you need to know. The owner, Raj, is gracious and passionate about his food and flavors. He will educate you on anything especially if you ask about his feelings regarding Indian food here in the US.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "onLtOnDRWGJZGcH38QKcZA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/onLtOnDRWGJZGcH38QKcZA/o.jpg"
      }
    ],
    "user_id": "wHW3_jqfzWEcLS-55Xct5w"
  },
  "KulGdrhxd4-x1ATvJxuFSQ": {
    "date": "7/18/2016",
    "text": "Sooooo so good. The food was hot, flavorful and delicious with a lot of options at the buffet. The service was excellent. The restaurant was clean and inviting. I think I have found my new favorite place to eat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Afo3lWitV3i6Ft2LON-l6g"
  },
  "PGrDfbdYHwBbOn2tYHll2A": {
    "date": "7/3/2016",
    "text": "I gave Ruchi a five based on delivering vegatarian and vegan dishes as advertized.  Our meal selection inculded several entree's soup and naan.  Absolutly fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R03Nf_93q9ERfvtPQxiOPA"
  },
  "nbKjoMxCabhhZ-oITDgb4A": {
    "date": "7/22/2017",
    "text": "#boomtown if you live for corporate American restaurants that are boring to eat at find somewhere else. If you want a soulful experience with the owner serving you..you found the right place. Try the Dosas and #6 and #15. Amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kROwB1_G5yfsiMesnb-YOA"
  },
  "ORenbyrHLFGd8fomEr29Zw": {
    "date": "6/23/2017",
    "text": "We adore this restaurant. So glad we found it! Amazing food, friendly service, and the BEST Gobi Manchurian we've ever had. We try something new each time and have yet to come across something we don't enjoy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6zJ2L_eIXuK_Vs5e92Luw"
  },
  "T8A1qHx3MpofCH7Pkrgjag": {
    "date": "6/7/2015",
    "text": "Ruchi is amazing!  We stopped in for the lunch buffet yesterday afternoon on our way the Lee Lee's market.  The buffet has a great variety with many vegan dishes to choose from.  We tried almost everything on the buffet and we loved everything!  Everything was seasoned very well.  The owner checked on us multiple times and was very friendly.  We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "g9KzKQHuHfUE85nnUPCKfA"
  },
  "nAd9yErvQmSc2DVf6e91Ig": {
    "date": "3/1/2015",
    "text": "This is absolutely delicious, fresh, quality Indian food.  My husband and I had the buffet. A generous spread of variety for exploration.  Perfectly seasoned food. Love the heat!  Just enough spice to pleasantly warm your mouth and lips. Mango lassies are freshly blended & fabulous.  A great compliment to the curries and spices.   The service was gracious and attentive.   Wonderful restaurant for vegans and vegetarians who enjoy large selections. Ruchi is a real treat!  Superior preparation of South Indian Food. This gem is tucked on the corner of Warner & Dobson.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VRe5bHccczPuJNlOgwGK7g"
  },
  "INT3l_tulgi72b70XrLkmA": {
    "date": "5/29/2016",
    "text": "Great vegetarian buffet! A variety of vegan and vegetarian dishes with a combination of north and South Indian food.  And all for a great lunch price. Tip: Ask them to make your dosa crispy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C7oHIj3bpizoahKVGc0suw"
  },
  "Eyxf2g6v0XhnTeenhinrDA": {
    "date": "5/24/2016",
    "text": "Fantastic restaurant.  Good service, good food, and reasonably priced.  Will continue to go there and recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yiZrpOZo2gN8otYKCc71Mg"
  },
  "Y4T0heIc8DLL6qjXQ0y9hw": {
    "date": "2/5/2016",
    "text": "Everything is amazing including the service and prices! The best indian cuisine I've ever had in the SW. Warm and friendly atmosphere and service. All the food is super fresh and such a great vegan selection, so tasty and prepared with love!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rc-eUOuaPQMV-RXNFlJ_Aw"
  },
  "fyj9KYivlxvbfGj7FV0RcQ": {
    "date": "4/21/2019",
    "text": "What a find! I love indian food and was looking for vegetarian/ vegan food whilst down in the valley on business and this place popped up I was on my own and so only sampled one item which was a dosa with 3 delicious chutneys. It was amazing and all the other food i saw people eating was mouth watering. The owner and staff were all super friendly and the clientele was a mixture of indian families and foodies I cant wait to return to sample more!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ldJmBodPKr9gT7bsuJikMw"
  },
  "_u_yzfCDcDhbd8FfUbETtg": {
    "date": "5/9/2019",
    "text": "Oh No!! I love this place and the food has always been very good, but the recent health/food inspection has me taking a pause. I hope they get their act together.   <a href=\"/redir?url=https%3A%2F%2Fenvapp.maricopa.gov%2FEnvironmentalHealth%2FFoodInspection%3Fp%3DFD-41683%26i%3D4487215&s=45d727a59b24bf5d076d95482a9aa44c6302d8cbb3991061dbda21776012cf5d\" target=\"_blank\" rel=\"nofollow\">envapp.maricopa.gov/Envi...</a>",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZ1G7zfl6hZiHoyV4mpjYw"
  },
  "LYzvQBAHD6qCkafHwkeZ4A": {
    "date": "4/14/2019",
    "text": "Ruchi serves some of the best South Indian food and is my favourite in US so far. They serve delicious, freshly made, variety of vegetarian food from southern India and give you a much needed break from Chicken Tikka masala and Naan !  Breakfast, lunch, afternoon snack or dinner - Ruchi has something for any meal of the day! Each visit I got a pleasant surprise and something new to try and absolutely loved it.   They serve a variety of dosas, my favourite is the masala dosa and mysore masala dosa. Their idlis are soft and fluffy, and Medu Wadas are crispy yet soft inside (and not oily). Sambar and all chutney's are delicious. We had their Bisibele bhath (rice prep) twice. It was pretty awesome, just like home-made, however spice levels were inconsistent. Nevertheless it tasted good both the times. Their south indian coffee and chilli pakoras will bring back your memories of India. The best surprise was however Rose Falooda! To be honest, I was not expecting such an amazing falooda at a south indian place. The best one I have had so far was in NJ at Dimple's but Ruchi's falooda beats it and is number one on my list.   Their lunch buffets are a treat to the vegans and vegetarians.  Save your appetite and treat yourself with a variety of both south as well as north indian food, delicious desserts and hot indian tea. The food was steaming hot and the quality and taste was as good as made-to-order food, something that is not always guaranteed in buffets.  Owners and the servers are very welcoming and friendly. Any special requests were always entertained. Service is great. Prices and portions go hand-in-hand.  I really like the simplicity of this place and the way people running Ruchi's bring out the Indian culture and flavors from south India. My honest 5-stars to Ruchi's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "PCV04ODwYx8cchf97Tj7Pw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Bisibelle Bhath",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PCV04ODwYx8cchf97Tj7Pw/o.jpg"
      },
      {
        "img_id": "yt6aU58OQSl-1hhFo-e3SA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Lunch Buffet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yt6aU58OQSl-1hhFo-e3SA/o.jpg"
      },
      {
        "img_id": "HuIIoQBePwEHwGUNnFytjg",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Chana Masala",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HuIIoQBePwEHwGUNnFytjg/o.jpg"
      }
    ],
    "user_id": "880oNqoWLYv7f_eo0Cgsmg"
  },
  "9NZmMDdDAYm-k8wGo3OxXA": {
    "date": "4/24/2019",
    "text": "Went to Ruchi with a party of 4; we ordered 4 unique items, shared them, & loved them all! Mushroom Cauliflower Chetty Nadu, Mutter Paneer, Vegetable Vindaloo, & Chana Batura. My favorite was the Mutter Paneer curry--flavorful vegetables & paneer, along with creamy, dreamy sauce.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bVwsfgvuArx06-InvoZfKA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. So many delicious options",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bVwsfgvuArx06-InvoZfKA/o.jpg"
      },
      {
        "img_id": "DEPDY6U-gj5fj6w4w3iFYg",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Storefront",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DEPDY6U-gj5fj6w4w3iFYg/o.jpg"
      },
      {
        "img_id": "YtkRPuTO7quB7kFuL6PDBQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Customer parking available",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YtkRPuTO7quB7kFuL6PDBQ/o.jpg"
      }
    ],
    "user_id": "N00oh4zDwN2HM1OZC50UUQ"
  },
  "-z6GbtElmTFivHzTzhF1YA": {
    "date": "10/23/2018",
    "text": "I absolutely love this place! This is a vegetarian restaurant and everything I have tried from here has been amazing! I think the best way to experience Ruchi is to try the lunch buffet. It is a wonderful opportunity to sample different dishes. There are always a few main dishes, rice, vegetable pakora, naan bread and an assortment of soups and chutneys. Buffet also comes with masala dosas, dessert and chai tea, such a treat.   All this for a reasonable price. We drive out of our way to eat here and it is definitely worth it! BTW my guy and I are not vegetarians, yet this place always hits the spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "MuSxT2NQ5Y59QO6DbgHYjQ"
  },
  "JOk6Gij9Si9kJzIEdXTOww": {
    "date": "3/14/2019",
    "text": "My friend and I were craving some good old South Indian Cuisine and discovered Ruchi on Yelp. I am so happy I found this place!  Service: Amazing! Our server was very sweet and welcoming.   Food:  Dosa- We shared the spinach dosa, which was huge! Even when splitting one dosa, we still each had half left to take home. It was delicious. The dosa was served with coconut chutney and tomato chutney.   South Indian Thali- and each had the South Indian Thali. We both love spicy food and the vegetable curries were pretty spicy, just the way we like it! I'm pretty picky when it comes to rasam and sambar (because I think my mom's is the best!), but Ruchi's was pretty great =).   We thoroughly enjoyed our meal and had leftovers for a couple of days. Indian food leftovers are the best.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "FarPmshtbUI9o9bAXplCIA"
  },
  "DhGzFFPm2UVj05QT62uNWA": {
    "date": "8/18/2018",
    "text": "After eating at Udupi for years I stumbled upon this gem thanks to Yelp. Ruchi is a fully vegetarian restaurant with most of items being vegan.  We went on a Thursday for lunch buffet which is priced at $10 the place is clean and well maintained we were seated right away no waiting the host/owner of the restaurant is friendly and warm.Through the course of lunch I saw him visiting every table asking for suggestions and feedback which is a great sign.  Lunch buffet is not very extensive but the quality and taste are on point.They have idli,dosa,veg fritters,curd rice,sambar, rasam,coconut rice, tofu curry,lentils,different types of chutneys.For dessert there was Kheer and carrot Halwa.  I loved the masala dosa that was made to order brought fresh to the table potato filling was nice.The sambar is very good.I honestly ate one too many dosas and will definitely be back for more.  Cheers!",
    "rating": 4,
    "rated": {
      "funny": 12,
      "useful": 21,
      "cool": 23
    },
    "photos": [],
    "user_id": "IQ8JZGg2po5YrcYqCBQQrw"
  },
  "CJRM_iJAiuytChz_SSaK0A": {
    "date": "8/31/2019",
    "text": "Worst indian food I ever had. Curry was no less than water. And paneer was hardly 3-4 small cubes. They just sent me water curry.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HFjMB7oFX_coqu6_KPDNWg"
  },
  "cUXOZsTnqg8U9mVQ-xWAoA": {
    "date": "12/20/2018",
    "text": "Just had lunch here with a friend. The food is delicious and the service is great.   Decided to try the buffet so I could taste a little of everything and I'm so glad I did. My taste buds will thank me later. I really enjoyed it and will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "RKXHzBt10pF3REqUOWnx5A"
  },
  "SwqgDP56nMdjVh2j2Rlydw": {
    "date": "12/20/2018",
    "text": "Ruchi is South Indian Vegetarian restaurant, perfect for those wanting more fiber and vegetables in their lives!   Everything on their menu sounds amazing, and it was so hard to choose just one thing! We began with the: Dhai Vada: a fried lentil donut dipped in yogurt with a side of sweet tamarind chutney.  For main entrees, we also got the: Thiruneiveli Spinach Dosai: a large crepe with potatoes, veggies, and spicy chutney. I thought the spicy chutney was a little bit too spicy, but I'm definitely going to try the other dosais!  We also got the: Gobi Manchurian, a classic South Indian dish where the cauliflower is marinated in a semi-spicy chili sauce. I would definitely recommend this if you're trying Indian food for the first time!  And of course, we had to try a curry, so we got the: Mutter Paneer, a creamy vegetable curry with cottage cheese cubes, and it was great!   Will definitely come back to try all the things on the menu!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1psM9gV2t1LpJ-z-tStOZw"
  },
  "MB2MgdhZY63AvD4bLS5d2Q": {
    "date": "1/16/2019",
    "text": "My wife and I took our visiting vegan friends to Ruchi this afternoon. We could not have been more pleased with the food, the prices and the attention given us by the owner. An overall good experience. We all decided to have the buffet because the variety was excellent and spanned two hot stations. When you select the buffet you also are served an order of Masala Dosai (Crepes filled with potatoes and onions). We'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jF9MzTNqvNaMUnDTb8saSA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. I especially enjoyed the home made cheese (Paneer Pakora) with besan sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jF9MzTNqvNaMUnDTb8saSA/o.jpg"
      },
      {
        "img_id": "-sVnHHi2_KmgkuWlxTn5tA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. One of two hot stations",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-sVnHHi2_KmgkuWlxTn5tA/o.jpg"
      },
      {
        "img_id": "AdahW1s2LxTfw35cyvWAig",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AdahW1s2LxTfw35cyvWAig/o.jpg"
      }
    ],
    "user_id": "PoV8TjKg8ph_KcciY8aftw"
  },
  "YhV3dWp9T7WGlwUQb9ZBfQ": {
    "date": "6/21/2019",
    "text": "I got to agree with another reviewer about the health code violation. I love the food here, but getting a \"D\" is a NO NO.  <a href=\"/redir?url=https%3A%2F%2Fenvapp.maricopa.gov%2FEnvironmentalHealth%2FFoodInspection%3Fp%3DFD-41683%26i%3D4487215&s=45d727a59b24bf5d076d95482a9aa44c6302d8cbb3991061dbda21776012cf5d\" target=\"_blank\" rel=\"nofollow\">envapp.maricopa.gov/Envi...</a>  For those of you that do not know, more than a decade ago, this owner used to own at least two other Indian restaurants in the Phoenix area, where even though the food was great, the health code violations forced him to either sell or close down the businesses and move somewhere else for a while. Unfortunately, it seems he has not learnt from those experiences. But for me, I have had enough :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "RtXUU6wCX8HHgYCfUXxWFw"
  },
  "LztUjxBmq3rqns1adVQmhg": {
    "date": "4/5/2019",
    "text": "I really wanted to like this place based on the reviews. I drove an hour to get there and brought my parents. We were very disappointed and I don't understand the positive reviews, especially from other Indians.  We walked in just after 5pm and nobody greeted us. We stood there waiting, finally a man who was tending the bar pointed for us to sit anywhere. The entire restaurant was empty, we were the only people there. We sat for a good 10 minutes before anyone brought us water and menus. Not a good start.  A lady finally brought us menus and took our order. I couldn't wait to try their vegetable samosas. THEY WERE OUT OF SAMOSAS! WHAAAT? An Indian restaurant out of samosas, is this a joke? We ordered the vegetable pakoras instead. They were so nasty... all dough, no vegetables, and nothing like the pakoras that are actually made in Indian households.  My father, who is Indian, ordered the idli sambar. He received two dry idlis in a bowl and about 1/4 cup of sambar which I probably could have measured in tablespoons. This is NOT how idli sambar should be served. The idli should be floating in a generous bowl of sambar, not come dry in a bowl with barely enough sambar (in a separate bowl) to just make the idli wet when you put it on top.  I ordered the masala dosa, which was good, but there was only about 2 TBSP of potatoes inside. Extremely disappointing. I've never in my life had so little potatoes inside of a dosa.  We ordered three curry dishes, which were just OK. The okra curry was so oily that you could see your reflection in it. I wouldn't touch it. My baigan bartha (eggplant curry) had zero smoky flavor like it should. I don't think the eggplant was roasted, but instead blitzed in a food processor or blender. The flavor was ok, but it wasn't baigan bartha.  My husband ordered the Avial, which has coconut milk, and it made him sick. He had diarrhea and headache for two days after eating his meal. I tasted his curry when we got home and it had a sour milk taste. I had half a mind to call the health department. There was obviously something very, very wrong in the kitchen.  All of the curry dishes were supposed to come with raitha and lemon pickle. We didn't get any. I asked the lady who brought out our food, she quite literally said \"I don't know what you're talking about\" and walked away. When I asked our waitress, this was her response: \"Normally our customers don't like those side items and so we don't serve them.\" I had to tell her, well, it's on the menu and we want those items. The raita was, of course, watery and bland beyond belief. Perhaps that's why their patrons don't like those items, because they taste terrible?  Oh and our order of naan didn't arrive until we were halfway through with our meals. I wish this review weren't so long but there were so many things wrong with this place that I could go on and on...  When it came time for desert, we ordered the rasmalai. Guess what? THEY WERE OUT! I'm not joking. And you know what it means when an Indian restaurant says they are out of something? It means they buy those items frozen or in bulk and they did not receive their shipment, or they did not pick up from their supplier. You go to these restaurants for fresh cooked food, not reheated frozen or factory preparation.  Based on my family's experience, I must say the reviews are totally misleading. We left around 6:30pm and we were still the only people there. Bottom line: Skip this place. There are other, better Indian places to eat in the area. You'll find one of the best in Tempe, though I'm not sure if I'm allowed to mention it here. It starts with a D and ends with an A. :)",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "u_rrlKWJk5_t-RW9S6G5zA"
  },
  "YxVivderizH2stIFV4wPGQ": {
    "date": "4/7/2019",
    "text": "I've searched years for a vegetarian or vegan Indian restaurant and it's finally here! I had the lunch buffet and enjoyed everything I had. They have naan, but also offer numerous gluten free options besides just rice - and it's all labeled!   The woman who waited on my was very friendly and interested in my experience. All in it was around $12 - very affordable. Ill definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "swZF2dFS_rW49tnpQ0G1yg"
  },
  "_oi_1-ax5jzlBG_zPNGmLg": {
    "date": "3/23/2019",
    "text": "On Wednesday a co-worker and I stopped into Ruchi for their lunch buffet. I have been trying to get to this spot for at least a year but just hadn't had the time since it is not close to where I live. Well the wait was so very much worth it. They take care to label clearly what is vegan and gluten free. The food is well seasoned and delicious. The Dosa and Dal were my favorites and the assortment of chutney was a delightful. Having had the option to pick items from the lunch buffet I know know what to order for a dinner visit and cannot wait to return.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "mkRI07cv5f1gObpkSiPwZA"
  },
  "ndI4PzPhV_qnQryaO88qXw": {
    "date": "4/11/2019",
    "text": "The buffet here was a nice size, and fresh dosas were delivered to our table, too. I loved that this place was entirely vegetarian so I didn't even have to think about what I could eat. The price was extremely reasonable, too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o4QP_zxs2j24Q5sW1CyC2w"
  },
  "1l5zaIwzQ_omJQu3BakmIg": {
    "date": "6/13/2019",
    "text": "I'm not Indian, but I've tried a lot of restaurants and have eaten homemade traditional food by Indian friends.  I didn't enjoy the buffet and I felt it was overpriced for what it was.  My partner and I won't be back.  The place seemed dirty, unkempt, and not kept up.  There was a strong odor that wasn't from the food either.  That other reviewer posted a health code violation, and that's not surprising given my experience.  I don't know how this restaurant is so highly rated.  Won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vV7PAaSHB6m__NOY0HHPUg"
  },
  "7QIbaLCFjISa4hX6VQDaag": {
    "date": "8/17/2018",
    "text": "Heads up: This is a south Indian vegetarian restaurant (not sure how we missed that). With that said, I HIGHLY recommend it if you're vegan, vegetarian, and/or has gluten allergies!   We came by this spot for lunch on a Friday. Although it's located in a busy area, we didn't have any issues finding parking or getting seated. When we walked in, we were immediately greeted & seated by a very sweet man(maybe the owner). He was super attentive to us and even showed my significant other how to properly eat a dosa! He was super nice and seemed sincerely interested in building a relationship with each client.  Once seated, we realized there was a buffet going on...so why not try, right?! Well, the buffet was only around $11/person and includes a dosa! Yes, they brought us each a dosa! The buffet had a huge selection( idli, sambar, pakora, achar, pappad, aloo, paneer, naan, laddu etc.) and everything was absolutely delicious!   The restaurant also has a small yet cool bar area. We didn't get to try any \"real\" drinks as we came from work but we'll be back!  If you like home style south Indian food, you have to come here!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 15,
      "cool": 13
    },
    "photos": [],
    "user_id": "iMZ5b31T7KMkWgiEZYLf6g"
  },
  "GCK4HdTTYPhbnI3fkv2Ljg": {
    "date": "7/20/2019",
    "text": "Very delicious authentic Indian food. Buffet was $13 and had many options, only a few were not vegan, but everything was vegetarian. They also have a very large menu that clearly states what is vegan, gluten free, etc. They have several drink options, including wine and beer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Agrg9YueonK4srMFpuGgwQ"
  },
  "RNqxnu5B5N8oS2Cgi9X7ow": {
    "date": "5/12/2019",
    "text": "Extremely disappointed.  Besides the paneer everything was bland and the sweets all had too much sugar. Took my family for Mother's Day and felt horrible how disappointing everything was.. and I know Indian food very well being an Indian and raised in NYC on Jackson Heights restaurants. Even the lassi was watered down and tasteless as well. Wish I could have gone in the kitchen to show them how it is made.With many other better options in Desi places - I definitely do not recommend this one even as a one time option. Sorry",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z3f18R_BlWxPkkdUC2efdA"
  },
  "LHdggxUDEJiJ3ZQAexdrag": {
    "date": "2/4/2015",
    "text": "It may seem like it is overkill to say one is teary eyed at the opening of a restaurant but this was exactly what happened tonight as my husband and I paid or first visit to Ruchi.  As committed vegetarians it means so much to us to have delicious all veg food that is such high quality that it actually feel therapeutic to eat.  The environment is beautiful and relaxing and the food is simply off the scale good.  Although it is over a 20 minute drive (thank goodness for freeways) we will return regularly because there simply is no other restaurant like it anywhere in the Phoenix Valley. Make sure you don't miss out! (We are searching our address books to figure out all the friends we can think of to take to dinner here! Seriously!)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "H2Qgk1-N5myYfjUNWu5CFQ"
  },
  "V_Xg0hwhhdEZnWae2rDeBQ": {
    "date": "1/27/2015",
    "text": "Great lunch experience today trying this new Vegetarian-Vegan restaurant. The extensive buffet contained specialties I have never been exposed to. Most items were full flavored and a bit spicey, but delicious.   The owners were present to greet me and explain the assortment and suggested food pairings and sauces. I would highly recommend this establishment!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "c3yx9RVt8KLHnLprKXnVGg"
  },
  "vfuy4_06gxULIZRHoz_V6Q": {
    "date": "11/25/2017",
    "text": "Absolutely GREAT!!! The best vegan and vegetarian Indian food in town. Highly recommended, casual atmosphere, great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CCLHQ2nvMJ57TMV6v07U7A"
  },
  "QTysovc6vICKjPxGgf8JMg": {
    "date": "10/14/2016",
    "text": "What a great find!  The owner is super sweet!  Couldn't have had a better meal!  Wish I lived closer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HcgP-r2kUusXQDK46KTUTw"
  },
  "38_LIrVZ-mVAdAs0pNEYwA": {
    "date": "8/9/2017",
    "text": "Switched my lifestyle to Vegan food.First restaurant to get my experience on vegan. Must say DELICIOUS! I had the Gobi Manchurian oh my god it was one of the most delicious foods i ever had my entire life! I had no clue vegan food would taste so good. Im glad im not eating meats, 1 less of a person to slaughter animals for. Thank god i came to my senses and thank you Ruchi for making my experience with Vegan food that welcoming and delicious! Definitely 5 starz will be back again hospitality was great!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m2bJBieJBGY3aWTmnXL11w"
  },
  "hnhvbl8V7w4Aj2nl58Lydg": {
    "date": "8/17/2017",
    "text": "We went on week day lunch and opted to go with buffet. We had good option. We were also served hot masala dosa. The dosa came bit late than I expected but we went as a group of 15 and I under stand it will take sometime to prepare for all. The curd rice was very good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-1pSHA2Gj0GGYoISamrvw"
  },
  "8VRSCFMhnVfVCddtzp13zQ": {
    "date": "10/18/2016",
    "text": "Not the typical Indian restaurant but perfect for vegetarians. The food was slightly different than I have had at Indian food spots but all was very flavorful and plentiful with lots to choose from and dosa served with your meal. I really enjoyed this place and will go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KZADR-3kU0BqyzNzwsEv1g"
  },
  "Gc5sUUNkVX9Cq3hlBqdekQ": {
    "date": "8/28/2016",
    "text": "I am in love! They had a great vegan spread, and everything I ate was super flavorful. Service was outstanding, and they are very accommodating. The only down fall was my boyfriend can't handle incense and it was burning super hard the whole meal. I did fine, but he became a little sick and had to go outside after he ate. He said the food was great though!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NftDx7ER0iz2o8zP9jpkyA"
  },
  "onddl6fiCiSbAa3KsN3jUQ": {
    "date": "10/11/2016",
    "text": "Excellent vegetarian choices and even many vegan choices! Food always tastes fresh and seasoned perfectly. They actually spice it up enough and it is super tasty!!! I come here frequently for the lunch buffet and highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GUus1mg5tMxE1fDk6qo9cg"
  },
  "8zEQvHOkzLq8_RFG9ALA8A": {
    "date": "4/17/2016",
    "text": "Great service and great food! The owner is wider and great to talk to. He makes you feel like home while there. He is the one that brought South Indian food to the area and I can't thank him enough! Definitely a must try if you are in the area!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RD6t59vaRxvRDKSHkSBYTg"
  },
  "eD-CnOg7bFn_KD6-MU9Giw": {
    "date": "9/24/2016",
    "text": "The ambience is good and clean. We had the buffet on a weekend and got fresh idli, wada, sambhar, rasam. The dosas were authentic. Over all the food was good and better than other restaurants in Chandler. I will recommend this place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9fnsYYqv9VubgFVzPMmUNw"
  },
  "18xx4xcAl5kG8mI6CKHfyg": {
    "date": "10/11/2016",
    "text": "I love this place. The food is fresh and tastes home cooked, with none of that canned or stale flavor that some restaurants have. The choices are all vegetarian, and many are vegan if that's important to you. The dishes are well-balanced and flavorful. Try their lunch buffet, it's awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JdUtLfZbo5IvqM6ziNLJSw"
  },
  "SJqgJ0awL-YYpXmZguxBPA": {
    "date": "6/2/2016",
    "text": "Absolutely my favorite Indian food I have ever had! Reasonable pricing A+ service, someone even helped me carry my food to my car! I feel so fortunate to live so close to this amazing vegetarian Indian restaurant. I have also dined in as well and it was a calm peaceful environment to eat in. Highly highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IGgqlFAsBuMWdgY_TWsLlw"
  },
  "IOjc3dvwdKogAWwPq6HJhw": {
    "date": "10/11/2017",
    "text": "Having recently converted to a plant based diet my husband and I were thrilled to find a date night restaurant option. The food was excellent! Raj the owner was very helpful with choosing dishes and pairings. We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nPK7YBmbQqzCW5hQyDgfGA"
  },
  "VTm1g0Q2VA8gvNAKt0wCjg": {
    "date": "7/23/2016",
    "text": "Visiting from CT but this place would easily become a favorite if I were local. Yummy, fresh, and very friendly. Gluten free options available as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WHs6lOM0YbSbh_t3Q5Vo_g"
  },
  "WtsUERR6sMnAisFwEncqgw": {
    "date": "2/26/2016",
    "text": "Best Indian food and vegetarian/ vegan food in Phoenix. This place is always consistent. The service is always excellent. The lunch Buffett always has something new to try so it's not the same thing every time. I love all the vegan options they offer. Especially the curry. Usually there is more vegan options than vegetarian options. This place deserves praise for being passionate about the quality and taste of food they prepare. It's very authentic. The spices and flavors are delicious. They truly care about making healthy food and the prices are very reasonable. This is easily my favorite place to eat. I am a vegan and a lover of Indian food. Ruchi has the best of both. Wow. This review was long over due. I've been eating here once or twice a week for over a year now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Nxis-pKOrtvPBYlThQplSw"
  },
  "vPpCZwMavrLm_L0RWngGGw": {
    "date": "1/20/2016",
    "text": "This is, by far, my favorite restaurant in town! Everything is vegetarian-friendly, and there are a lot of vegan options clearly marked on the menu. The staff is very warm and welcoming, and the owner always makes an appearance to make sure everyone is well-fed and satisfied. I've honestly never felt more welcomed at any other establishment like I do here at Ruchi.  The food is phenomenal. If you're looking to treat your taste buds, look no further. You can't go wrong with anything on the menu. From their curries and dosai, to their delicious bread also known as paratha or naan, everything is packed with a lot of flavor and a lot of passion. For someone who does not normally willingly eat spicy food, I just can't help myself when I sit down to eat here. It's simply too good to pass up. (Let me add that this is coming from the same person who thinks mild is spicy.) I've recently moved away from Arizona and the saddest part about that is not being so close to my beloved Ruchi, but you better bet it's the first stop I make when I'm back in town! There's no place I'd rather sit and eat, even with a runny nose, than here. Thank you, Ruchi!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "-XmviUBOpUdPp29tnwDQ0g"
  },
  "wZa4ReMUHhcGuSaIjyveuQ": {
    "date": "10/14/2015",
    "text": "Ambience was good  Tried their poori and onion Dosa . The poori and curry was extremely good and i wish the dosa was not so overdone but it was ok   Will go back again if I am in chandler",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0tZrYidJ8-kxiBP7-7xETQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0tZrYidJ8-kxiBP7-7xETQ/o.jpg"
      },
      {
        "img_id": "7TG8bf1pEQ-KUFeO7S7sWw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Poori",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7TG8bf1pEQ-KUFeO7S7sWw/o.jpg"
      }
    ],
    "user_id": "VgZLWRqoY_1lg66hjisMJw"
  },
  "sNCAmYkSX-b7G2GChnfI6w": {
    "date": "7/16/2016",
    "text": "I wish I could remember what I had but it was a recommendation by the owner.  It was a spicy dish with peas, potatoes, curry and came with rice.  The portion is large, enough for 2 people.  I also ordered the garlic naan bread which was delicious and one bread is also enough for 2!  I'm so lucky to have this place one block from my house.  I will be a frequent customer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2TJMH6R0IHAWq2lgpOc2JQ"
  },
  "zHWUvH0kGaZJpNceeSIpCw": {
    "date": "9/15/2017",
    "text": "We order the Gobi Manchurian and and absolutely loved it! The Butter Masala Dosai was good.  Atmosphere was comfortable. We would go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgo89KVWgFnOfjslexoIFw"
  },
  "V5Pyl1r1x4NFVr80_bK_Cg": {
    "date": "11/28/2017",
    "text": "One of the best indian restaurants I have ever been too! the service in inexplicably amazing. The owner is so involved and makes your experience one of a kind. All the food is Rich and full of flavor and undeniably delicious! You will never be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WpM43mFMMVWH2v8SMRyd-g"
  },
  "11bvW4pgSeZWeox74Ysk0A": {
    "date": "4/15/2017",
    "text": "We stopped in for a quick beer, and wow were we happily surprised!!   This is a fantastic family run restaurant with amazing flavors.   We had appetizer 6, which is a spicy cauliflower dish with onions, peppers and lots of complex flavors.     It is a must have if you get a chance to go there.  Looks like they have a very large lunch buffet for those interested.    Also tried three sauces - the mint, a tomato and a coconut all of which were some of the best flavors that we have ever had!  We will definitely be back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5Pzsg73Xf-Jb90Cszobm4g",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5Pzsg73Xf-Jb90Cszobm4g/o.jpg"
      },
      {
        "img_id": "wBjf2Mii8sGGlcyvYPNtJw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wBjf2Mii8sGGlcyvYPNtJw/o.jpg"
      },
      {
        "img_id": "X1WSa5Lo-hljMKoBwMCb0g",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Cauliflower appetizer.   Amazing!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X1WSa5Lo-hljMKoBwMCb0g/o.jpg"
      }
    ],
    "user_id": "b1lXGbpFZbUTHxfUWmdDzA"
  },
  "vto4UHm8ldC9JTUkESumZg": {
    "date": "5/13/2018",
    "text": "Not much variety for a $15 buffet. Also taste is ok, nothing to come back for. The masala dosa had 5 tiny pieces of potatoes in it! A bit disappointed since we drove several miles to try this place. I wanted some South Indian breakfast items on Mother's day. Idlis were not bad. They don't replenish the food much, so may end up not getting the items you want or get curry with no veggies in it. Desserts were ok. They ran out of the dumplings in the rasmalai and veggies in sambar. Mango lassi was good and hot chai. Owner was friendly and animated.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wDrCkEsru6mMJAgrWaibqw"
  },
  "Lcjt9ulP9PCRrN3pJELZmA": {
    "date": "12/24/2017",
    "text": "Wonderful service. Came here late on Xmas eve. They accommodated us without hesitation and smiles throughout. The food was outstanding. Recommend this place for authentic South Indian vegetarian food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KK_4_p4nVtbRAHJEchGJkg"
  },
  "_kDRQZu6zfmPDNDlnj7wQA": {
    "date": "11/27/2016",
    "text": "Delicious food! I absolutely love this place! I can eat anything here, which is amazing when you're vegetarian, and the food is superb. I like to starve myself before I eat here, just so I can eat more of their food.   Service here is fantastic, good, friendly, prompt. The owner is a very kind person and his staff are all nice as well. My family and I enjoy going here to eat together when we can. They are also understanding of little ones and their sometimes pickiness when it comes to food, or the fact that not all of them can sit still. Great for groups, great for the family.  My favorite thing here is the buffet. Then you can eat tons of different foods all at once and it is fantastic. I recommend yellow curry dhal any day as well as aloo gobi.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aVrU8knKR3oZ9v9K8IjFbA"
  },
  "p9A23s4x6YCchDE9n-EWiA": {
    "date": "9/24/2016",
    "text": "The food here is outstanding, and the service is friendly and prompt. What struck me the most, however, and will have me bringing my family here time and time again, was the kindness that the owner showed towards all of us, especially my little one. This is a very, very welcoming place.  I'll say it one more time, though... the food here is OUTSTANDING.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "MuhASxDs3_tYe809yfqDgA"
  },
  "w6IMIUjmC_T65AqEWal3kw": {
    "date": "12/30/2016",
    "text": "Seriously, how did I miss this place?? I've lived down the street since it opened 2 years ago, whhhaaaat!? Great food, great service and the location is what I've been looking for in a killer Indian food place.   Let's start out with the samosas; perfectly flakey outside with the right amount of chewiness and the filling was seasoned to perfection!   I tried Iddly for my first time and it definitely won't be my last! They were warm and fluffy and the moist texture allowed for extreme dipping in the sambar along the the side!   Next, Chana Butura, my absolute favorite thing to eat when deciding on Indian Cuisine, it never lets me down and Ruchi definitely nailed it! Piping hot puffy bread and chickpea curry, I mean come on, does anything else sound better?   Lastly, Paneer Shahi Korma - listen, I don't even like cottage cheese, but if this is what it tasted like all the time, you've got a friend in me! Served over rice and I had some puffy bread leftover for dipping, SOLD! To Ruchi for stuffing my empty belly with an amazing meal!!   Until next time...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CdO9H6wtMYuYclvRqS_B3g"
  },
  "eB8VuMBIb42XFFJTUNB-CA": {
    "date": "8/22/2015",
    "text": "Note: This is a vegetarian restaurant.   We were greeted in a nano second and seated in two nano seconds. They had a huge variety of mango, rose, Indian drinks.  They brought one of the drinks out blazingly fast but forgot the other two drinks. When we reminded them about the drinks, they brought my seven year old a drink in a beer glass.  The menu is expansive and had something for everyone.  The utensils and napkins were super cheap and not appropriate for this level of restaurant, but the plates were better.   The food was wonderful.  That being said, I must disclose my wife is Indian, so we do expect a lot.  It did not taste mass produced, the veggies were not soggy, the portions were super huge, the spices were not compromised for non Indians.  They did not scrimp on the fillings either.  Our water was filled no less than 10 times, I kid you not.   Dishes were quickly cleared.  Were were asked half a dozen times if we needed anything  Two appetizers, three main meals, two orders of naan and three drinks were more than enough for four adults, and you will have leftovers.  The cost, $75.00 not including tip.    Overall, with the caveat that Phoenix is not a mecca for fine Indian food, and minor quirks aside, this is easily the best Indian vegetarian food in the Phoenix area with the best, friendliest service.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "U30-NpUyd0KUqDEC6EQxuA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Partial Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U30-NpUyd0KUqDEC6EQxuA/o.jpg"
      },
      {
        "img_id": "XQdvB7ZqKAY6y4Hn2gmzSA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Beverage menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XQdvB7ZqKAY6y4Hn2gmzSA/o.jpg"
      },
      {
        "img_id": "wU435rIL_h8QptDu3OQKtg",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Entry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wU435rIL_h8QptDu3OQKtg/o.jpg"
      }
    ],
    "user_id": "MVvWOlVgOfRAtP41-A-g2w"
  },
  "A8k2ne1ugmMiGxEzQBLQoQ": {
    "date": "2/14/2017",
    "text": "LOVE this place, sorry I waited so long to try them! They are super nice and hospitable, the staff will make sure you have what you need and provide explanation if needed on ANYTHING.  Amazing, go visit! You won't be sorry!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uu0EOiM_eyIhd_8dNR9-w"
  },
  "7lN4Ikb7UM5x5PMvLwr6-A": {
    "date": "11/11/2017",
    "text": "I truly enjoyed my visit today.  This was our first time, and the staff was amazing.  The food was incredible especially the potato Manchurian and the rice dessert with cashews.  The lunch buffet is a great value and I would definitely encourage everyone to try this restaurant.  If you've never had Indian cuisine... Don't let it scare you the staff totally helped us out!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GCdYhvificyfsuB2ao48Cg"
  },
  "HXAGa-gttmuRwTGa1mXNdQ": {
    "date": "8/7/2016",
    "text": "BEST Indian food ever. We have never had a restaurant where we liked so many different things. We usually order the same thing every time in most places but this place gives me an anxiety attack if I have to order just one. That is why I prefer the buffet. Different every day and always has excellent variety of dishes (ALL DELICIOUS).   We were considering moving to another state and we made a pro/con list of why we should leave Arizona. Not being able to go to Ruchi made the cons list. That should say it all.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_GjlE2X__OFax_IrrpWoQ"
  },
  "Vt1-BTzaO-znExGksXceQQ": {
    "date": "6/26/2015",
    "text": "Love this place!!!  Food is amazing and staff is so nice every time we come in!  We often come for the lunch buffet and I didn't even want to come any other time.  Well... Came tonight and, as usual, Ruchi did not disappoint!!  Yum yum and more yum!!  We order all vegan meals.    Tonight we tried Gobi Manchurian, Dahl, Pongal, and Garlic Naan.  Everything was so delicious!    A must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "WbmvtdA3sazHpP6JViQuqQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. A lil bit of my lunch today.... Don&amp;#39;t worry that isn&amp;#39;t all you get in an order... Shared a couple entrees",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WbmvtdA3sazHpP6JViQuqQ/o.jpg"
      },
      {
        "img_id": "C9YXNtZ_9LZii5DnIdG89Q",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Dinner time!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C9YXNtZ_9LZii5DnIdG89Q/o.jpg"
      }
    ],
    "user_id": "5fd8ZYZEvLdQVre5a-_rdg"
  },
  "JaElBp3WKzjVvUW7_EVJgQ": {
    "date": "12/19/2017",
    "text": "Great service. Great food. Unbelievable I will come here often. Every single dish was just right. The service was very friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w0l1jgODa1VZrHiokeZzTA"
  },
  "EbrxpkOI8rZ_H4qnxQOfZw": {
    "date": "7/3/2015",
    "text": "Vegan vegan vegan! This place has so many options!  The ambiance was comforting, the owners and staff were very welcoming, and the food was delicious! The menu is clearly labelled with vegan items and we were informed that some of the other items can be made vegan if desired.   My husband had the samosas and masala vada appetizers and said both were great. For his entree, he had the special vegetable curry and enjoyed it. I had the spinach dosai and it was very good. The chutneys had more depth of flavor than other restaurants I've tried.   I'm so excited we tried this restaurant and will definitely be back! There are so many more dishes to try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0D5UTJN-k4oBT-QcjWN7tw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Samosas and masala vada",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0D5UTJN-k4oBT-QcjWN7tw/o.jpg"
      },
      {
        "img_id": "j36v7TlhxiydZQ7XampoWQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Special vegetable curry.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j36v7TlhxiydZQ7XampoWQ/o.jpg"
      }
    ],
    "user_id": "I9mQKo_M6mvGUscog57QCg"
  },
  "3AQUZ0LMYOuuqybr0KT8BQ": {
    "date": "1/14/2017",
    "text": "What a pleasant delight. Went with the husband and kids and had a great selection of mostly vegan food. The staff were so courteous and attentive. Will definitely come back. Please go I promise you won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xlYa4QrxJRzUhSiO4PFVDw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Vegan Indian food",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xlYa4QrxJRzUhSiO4PFVDw/o.jpg"
      }
    ],
    "user_id": "iK2VsRJdu8IpwwD1u-G41Q"
  },
  "jFtyIX5jVC-Orao7LKyYjw": {
    "date": "5/13/2018",
    "text": "The husband and I shared a papdi chaat and a ruchi plate, which included rasam, vada and dosa. All of the food was so so do delicious!! Best dosa I think I have ever had!! The service was great, the owner is super nice and you can tell he takes a lot of pride in what he is doing/the food. If I lived closer, I would come here all the time! SO GOOD.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e7Qa7qdCz-Lpe38rYRw1ug"
  },
  "XXVzhoIjVGno67p7IZwKBA": {
    "date": "9/17/2017",
    "text": "This is the best Indian food I've ever had!! I try other places to make sure I'm not missing out on something better, but this place can't be beat. The flavor in the food is incredible. It elevates any Indian food I've ever had. Really great customer service. The owner is always friendly and makes sure our experience is good. It's a family friendly place without being obnoxious about it... which is good for us because our 3 year old is usually with us. I totally recommend this place. I'm obsessed.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kMBr_3hQhzY_x5jLpJ7EYg"
  },
  "e7P9l9XpMfyXMt12RRkaDQ": {
    "date": "5/29/2018",
    "text": "Amazing food, wonderful people!     Thank goodness we ordered a lot of food because everything was so good we were craving it the next day and ate our leftovers for breakfast and lunch!   The Gobi Manchurian is OUT OF THIS WORLD and the best thing I've ever tasted!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SSWiXtahhcGpohO4QU6vwA"
  },
  "ftZYJKkK8S-IUUSZ0K10QQ": {
    "date": "2/20/2017",
    "text": "I absolutely love and adore this place! This is the place that got me to find a newborn love for Indian food and culture. The owner is really nice and I feel like every one that works there together is family, they have extremely sweet customer service. I appreciate how they are so welcoming and receptive to people who have never had Indian food and come there to try it for the first time! Every time a newcomer comes by they are always so sweet about telling them what is the best and how to eat the dish correctly.   I go here often, It can be kind of pricy but it's all worth it with the amount of food you get. I recommend this place to every one and go there as often as I can. Beware of spice if you are not one for spicy food, but that's a given for all Indian food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wYM1WttItDtwYqofXzpKFg"
  },
  "REIEQ7cgjqE-fVNZ6RvQag": {
    "date": "7/6/2016",
    "text": "5 stars is an understatement. The owner here sincerely cares about the customer experience, checked in our table every few minutes, was very kind to our toddler, and even made a special vegan gluten free dessert for us. Wonderful experience and the most delicious Indian food I've ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "T4GTMihA_ZyAo1IwZ_s8QQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Vegetable Vindaloo and Mint Dosai",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T4GTMihA_ZyAo1IwZ_s8QQ/o.jpg"
      }
    ],
    "user_id": "h29UevxISRUNIisS_d8w7w"
  },
  "SpeVTMIqez5BCflkutnK9A": {
    "date": "11/1/2018",
    "text": "We drive all the way from the west valley for Ruchi Indian food. The cauliflower delight (I forget what this is called) and the paneer tikka masala are the best in all Phoenix area. Would highly highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3-fHfM-v3uDN3BDrJIrecg"
  },
  "KGbrt5lbSGErjZcDu8qnZw": {
    "date": "8/27/2016",
    "text": "Ruchi's has been and will continue to be my favorite Indian Restaurant. We ALWAYS feel welcomed and the food is continually prepared to perfection. We have tried other South Indian restaurants and we always find ourselves right back here. Simply the BEST!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lnOF3pE5UIjtmytjZvVOPQ"
  },
  "Rff7Vk18RKX2sJqQHnLREQ": {
    "date": "4/29/2017",
    "text": "Went for a lunch buffet with zero expectations and the food was ordinary in taste to other Indian restaurants in the valley. Nothing popped out. I saw couple of discrepancies in the naming of the dish which was disappointing because it was like they were trying to fool Americans. One read as medu vada but it was actually pakoda both entirely different dishes. Another read as Nan bread but it seemed like a paratha.   Sambar was good but would have been better if it was not too watery. Chutney had the same issue - too watery. It was like they didn't prepare enough so added water to increase it's quantity. Papad or appalam is seemed to have been fried from an old oil as I could taste that. I love papad a lot but this was the worst papad I had ever.   In the desert section rasamalai was made from milk that was spoilt so could not eat that. Biriyani was decent enough that I could eat whatever I had on my plate. Dosa was crispy and good. Idly was hard and thick which is not how a idly should be.  Overall not an authentic Indian restaurant. If you need one then go to restaurants in San Jose CA because I am yet to find a good one in the valley.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "4oTUo9_a4pxKstYc6aV8FA"
  },
  "wPpNePZ6Uf28O7AfTmzCTw": {
    "date": "3/9/2018",
    "text": "The first time I went there me and my wife liked it. we are omnivores but vegetarian is ok. We have been travelers with my work almost 10 years so I know what is good Indian food. We tried the idly's It was dry and assuming our taste buds are use to the flavors. We tried a dinner over there for the 2nd time. I ordered a thali , a paper roast and a poori. The thali was not good the dishes seems like defrosted so it was very disappointing but the paper roast and the poori was nice and crispy. The owner walks around the restaurant so when I address the matter he was offering free dessert and stuff. the flip point was  I found a body or facial hair on one of the curries. It is hard to notice since the atmosphere is darker in the night. not sure where it came from. That is the last I went there. Maybe they have improved. Because Indian food is always good when it is made out fresh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nx5PdL0hQ2hesneV41Kj9w"
  },
  "EWNI57xJw9qCk_z--Vn0Kg": {
    "date": "4/16/2017",
    "text": "Best place in Maricopa County;the food is amazing,healthy and most of it Vegan. We come here at least every couple of weeks,the owner is phenomenal and super nice,always ready to help you with food choices. Sunday brunch is AMAZING,prices are very good . So happy we had found this wonderful restaurant.  Two thumbs up and 5 stars are the least we can do . Keep up the great work",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "BBf-wI8mvsLSRNdV-wtcFA"
  },
  "Czgu6Sddv5_I5oC883EwhA": {
    "date": "5/19/2018",
    "text": "Had a pickup here two weeks ago, Didn't have time to write a review before, but just wanted to say, the owner and staff were extremely friendly and welcoming.  I was there picking up an order for a customer and spent my time waiting chatting with two other \"first time\" customers.  The owner came over, chatted with all three of us (making me feel welcome and equal despite the fact that I wasn't a customer), and I observed him making some good recommendations to the two customers I was talking with.  He also went way above and beyond what most places do as far as being hospitable to food couriers. Not only was he friendly and treated me well, but he even treated me to a Mango Lassi (my first ever) while I waited for my customer's order. That was very tasty and a wonderful \"pick me up\" for me during my shift. It was a really nice gesture by the business owner who clearly cares about people feeling welcome and enjoying themselves, even if they aren't direct customers.  Also observed the staff being very friendly and nice. The food smelled amazing too and the couple I was chatting with clearly loved the dishes they were being served. I can understand why they gladly proclaimed they'd be coming back.  10/10 A+ customer service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5sERHA3dHvKnnpTVhqK3dA"
  },
  "yz5Z-NfIVoWXCNcBm-i6Uw": {
    "date": "7/28/2018",
    "text": "The BEST Indian food in all of AZ. I could eat here every day! Service is awesome, food is consistently amazing. Nice work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zR0V50HXG-zEzW4GyR5FWA"
  },
  "Ke7kMs8p39Iykv3HabJ0xQ": {
    "date": "9/20/2018",
    "text": "As I've grown older and more conscientious of my diet, I've taken to a mainly Vegetarian diet, on both choices of health and of moral conscious of meat products. I've been eating here once or twice a week for over a year. The Chef is fabulous and the traditional Southern Indian foods are spicy and delicious. Raj, the owner, is a longtime Restauranteur here in the Valley, and after discussions with him, I found he owned another earlier location near ASU that I used to enjoy. The Saturday-Sunday afternoon Buffet, is wonderful! It's a larger selection of foods and the most interesting thing I've experienced there is the multitude of Family Celebrations held there by many of the Indian community. The upper lever is larger and accommodates extended families. As an Old Gringo, from Arizona, I'm taken with the beauty of the Ladies of Indian origin or ancestry in beautiful, bright colored traditional wear. With gold accents and embroidery. And the Gentleman in traditional Indian men's wear. Most of whom are professionals from the East Valley and a few of whom I've had as Medical professionals. They're elegant and graceful, and I enjoy being an observer of an Indian festival or Wedding ceremony. I'm always amazed and appreciate one of our Earth's, Oldest continuing Cultures. It's a place I enjoy to eat the foods, and be a casual observer of the people there. Lunches are daily Tues-Fridays and always a mix of daily selections. The support staff are all kind and attentive. One lady that's been working with Raj for many years is Natalia. She's always there to greet you with a smile and to seat you where you chose and take care of any of your needs. It's become one of my favorite haunts to eat and visit with family and friends. If you're looking for the best Vegan-Vegetarian Indian restaurant in the East Valley, I highly recommend Ruchi's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YPYK21SBcmY4VEuc9hM3xA"
  },
  "-k_drs058CDN7xp5BNBhVg": {
    "date": "2/14/2018",
    "text": "This was one of the first Indian restaurants that I went to when I was attempting to transition to a plant based/vegan diet & I'm glad that it was! The owner has always been pleasant & genuine to me, along with his staff & the quality/tasteful food that they offer has yet to disappoint me & I highly doubt that it ever will lol! Their food is so palatable that I would recommend it to carnivore's, vegans, & everybody else in between!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ndYyxpO2wr5AcrizrSydJA"
  },
  "zxmr8u7zSu4vECpd6VjE6w": {
    "date": "12/10/2017",
    "text": "Overpriced for small, unspecial portions. Ordered the Chana Masala(#2) and samosas. They didn't put the potatoes in my order as it said on the menu and the accompanying sauces were okay at best. Will not be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YgnkiWDi4vXeX1aKVF2I7w"
  },
  "79q-p-8QYThYVz1mhVkBoA": {
    "date": "12/3/2017",
    "text": "worst restaurant I have seen so far. Staff is very Rude and prefer others over Indians. Plates and spoons were dirty. Drinking Water smells like glasses never washed. Food was no so good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rr2rafujtB17wuT2JRgSoA"
  },
  "5Df7brOQQr66znNVWcdc1g": {
    "date": "11/19/2017",
    "text": "great place, Chris H. from Yelp actually recommended this place to me and wow great food.  iam sure I looked a mess as I went in very hungry.  they actually had a vegan type buffet going which was great and right up my alley (it's a vegan / vegetarian, restaurant drrr Steve..lol) the buffet allowed me to sample several things and see it while reading what it was, i like that allot as sometimes the word descriptions are too short and don't do much for me.  iam not always a fan of buffets but this was fresh and very good.  the guy that waited on me was super nice and kept trying to get me to eat more haha probably due to i looked like i was staving by on super hungry.  I'll be back as I live close and now kicking myself for seeing this place and never stopping.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "al6fcKCjouj7OP5mRu_NMw"
  },
  "Wns2GdmAtL6WZDOzOz7L6g": {
    "date": "5/29/2017",
    "text": "After reading the reviews here on yelp, we couldn't wait to try the buffet. At first it seemed so delicious, but as we began to enjoy our plates, we realized that the spice used in one dish was also used throughout. Everything began to have one note. Although the food was quite tasty and good, it left me somewhat unsettled in that I'm used to having a little variety. One thing that was really cool, is they serve a crepe to each person who purchases the buffet. The crepe is so large it hangs over the edge of the plate. It's incredibly thin and crispy and loaded with some kind of potato filling. I am pretty positive they use yogurt to make the dough. It was very different and quite tasty. I did like the food, don't get me wrong, I just Think I was looking for a little more variety. But that's my taste buds, and next time I may decide to just order a few dishes off the menu instead. Besides, the people in the restaurant were very friendly and accommodating. It always helps to get good service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "F4pO5aZcLqFV1Cp7_EsGmA",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Inside Ruchi.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F4pO5aZcLqFV1Cp7_EsGmA/o.jpg"
      }
    ],
    "user_id": "1viszljzsa8W7VnYPuWosw"
  },
  "_QOtwHYMlXA3GU9So2VWDA": {
    "date": "4/21/2016",
    "text": "Ruchi is a wonderful place to go for a nice, casual,  sit-down lunch or dinner that is affordable and  delicious.   The decor is nice and spacious, and everyone who works there is extremely friendly. (The bathroom wasn't in great shape aesthetically, but it was functional.)  Many of the appetizers are good to great, but my favorite is the Vegetable Samosa. The soups are also good and filling.  I haven't been disappointed in anything that I have tried here. I love many of the dishes,  but the one that keeps me coming back (often!) is the Mushroom Cauliflower Chetty Nadu. The ingredients are simple but the spices are just amazing! And the portions are great-I always leave with leftovers for lunch for the next day!  I hope this place is around for a long, long time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dRVZ6x5vrPC4fAlrtuKQRg",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. I absolutely love this place!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dRVZ6x5vrPC4fAlrtuKQRg/o.jpg"
      }
    ],
    "user_id": "c0jjNGglULKrDxz9xYKTdg"
  },
  "5XaRQv8uPqMNkofwajL8kA": {
    "date": "1/20/2018",
    "text": "Fantastic Indian food. Most of it is vegan and there is a few Vegetarian options. It's our favorite go to spot for Indian. The lunch buffet is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FOeoMRd0b_v04qR-Dg4j8Q"
  },
  "gWtOUZ6QxhChe5ohEEFK4g": {
    "date": "12/31/2017",
    "text": "Very nice owners! The food was very delicious and nourishing! And chia tea was on point. Lots of vegan options too.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G-hhyipd3p8XoJMiBcaucw",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/G-hhyipd3p8XoJMiBcaucw/o.jpg"
      }
    ],
    "user_id": "a8UIkgiygFC95OtTN8qbIQ"
  },
  "v_J2Zgl1paQFxv4xgh4f9A": {
    "date": "12/12/2017",
    "text": "Excellent food ....i was nervous because I'm new to vegan cuisine but this was great and you can't beat the price of 10.85 so please try it out",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGBIjALe4Jr12kHTcZineQ"
  },
  "F4mpfgk4SF1Rh63nWKMHmg": {
    "date": "7/28/2018",
    "text": "Delicious. Owner is amazing and makes it a point to make sure every guest is personally greeted by him and that they understand the name he and enjoy what they are eating. Exceptional service world class food. I will be a frequent patron.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clxfJbhriXtfYMVkR87iTA"
  },
  "FYw6S7hqphGg797hfibRhA": {
    "date": "7/25/2018",
    "text": "We are so lucky to have this incredibly blessed chef in our area. Our entire experience from being welcomed to education through the meal and then that dessert. He takes care of everyone as if you were in his home. The food is amazing and so well balanced with the herbs, spices and sauces. Prices are very reasonable, lunch buffet and you bet we will be back again and again. Make the drive you will be greatly rewarded. Gourmet vegetarian only excites here. Blows other Indian restaurants out of the water. Why are you still read and not in your car....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GHYOi-vbghxoIUCq2NoKPA"
  },
  "p37MBowNkRYmHOQ3kr7Krg": {
    "date": "6/12/2017",
    "text": "I always come here for the lunch buffet, which allows you to sample a variety of wonderful dishes at a reasonable price. The food tastes freshly prepared, not as if it's been sitting out for too long like at some buffets.   One reviewer complained that all of the dishes had monotonously similar spices, but I feel like there is plenty of differentiation between them. They serve a nice variety of curries, chutneys, and rices, most of which are rotated; you won't come back to the same exact array of food on each visit. The cuisine is entirely vegetarian, and most things are vegan as well (everything is labeled!).  Complimentary dosa is served along with the buffet, and the owner and staff are very kind, making this one of my favorite and most easily recommended restaurants.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qFQAYv9ToZ-BIBVq6ZK5sQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. Potato-filled dosa served with the buffet (one whole, one mostly eaten showing filling).",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qFQAYv9ToZ-BIBVq6ZK5sQ/o.jpg"
      },
      {
        "img_id": "MzWNIdf57b8JunMJAol-IQ",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. A plate brimming that day&amp;#39;s buffet offerings.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MzWNIdf57b8JunMJAol-IQ/o.jpg"
      },
      {
        "img_id": "v3lTmxkUp8HGiavb3faAvg",
        "caption": "Photo of Ruchi Vegetarian South Indian Cuisine - Chandler, AZ, United States. One of buffet tables with bread, rice, and two main dishes.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v3lTmxkUp8HGiavb3faAvg/o.jpg"
      }
    ],
    "user_id": "A8l75Uk6I0D2pSuNfkbpLQ"
  }
}