{
  "Skhr9A1Eh2KpT_jJzehxcw": {
    "date": "7/15/2016",
    "text": "Very happy with the food and service.  All orders came perfectly cooked and served in a comfortable environment.  It would be hard to find a better local restaurant than this one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J_QvoitEIL6ndAgyruU-_A"
  },
  "nM271qngIkAXv-RUq9R75w": {
    "date": "11/12/2016",
    "text": "This has long been one of my favorite restaurants but our last visit was especially great.  The waitress Maryellen was phenomenal in every way and made sure we were completely comfortable and happy.  Excellent experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jQBkiand1RnRB2ZdVYFunQ"
  },
  "xj5YiMw_fFLI5MDj37W11g": {
    "date": "2/14/2015",
    "text": "Good menu and bar.  Have eaten here a few times.  Food is very good and well presented. We like this place because we can a great meal in an upscale environment. Prices are reasonable and the service was good. It is a place you can relax and feel comfortable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xa7CkIIGnTB2HbFO0TlR6w"
  },
  "q_Qfm0jE6vZxgwAxPrCPCg": {
    "date": "9/22/2016",
    "text": "Our favorite go to date night place.  The atmosphere is great and the food is excellent.  I love the salads. My new favorite appetizer is the shrimp cheese thing (can't remember the name].  Perfect lunch or small.dinner.  also love the fresh fish and roasted chicken.  Their chicken picatta is excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wu9X1NOPhKKl8lgZ3vDpsA"
  },
  "dPpUUe_ATyrrFLkW0bIvyw": {
    "date": "10/6/2017",
    "text": "THE  best restaurant in town. Great consistent service, and excellent food. The fillets melt in your mouth!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FIYE2Mm5eqQyoxlP9EaVSA"
  },
  "QQFN8DoIWzT9UtbPjppOJQ": {
    "date": "3/1/2015",
    "text": "I have nothing but glowing things to say about Charleston's in general, but specifically the Ray location. We have dined here at least 30 times and it's always consistent, always good food, and great service.   We have our go to entrees, we always start with shrimp cargot and a basket of croissants (soooo good) and then we get the ribs! The ribs are fall off the bone every time. I would truly say the best ribs I've ever had. Finish that off with the bread pudding and you can die happy. Thank me later",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kd0t_9hFm8T6MGH6zBjG5g"
  },
  "4cys2cGbHJB8rsLNWDYyyQ": {
    "date": "5/4/2015",
    "text": "Great food, great service; recommend the roast chicken and ribs dinner and the key lime pie desert, yum :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Qd9nLBveCMw3fh549W3mA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Key Lime Pie, big enough for two and delicious :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_Qd9nLBveCMw3fh549W3mA/o.jpg"
      }
    ],
    "user_id": "UUzU2mV6-mqepz8alTsZTA"
  },
  "0QqA7BgqC3nCRhrrSI8nFA": {
    "date": "10/28/2016",
    "text": "One of our favorite places, we both had the filet. One baked potato and one garlic mashed potato plus a side honey carrots. All were great followed by coffee and the brownie &  ice cream dessert. Seems to be always good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KODS1wXairJYcFtc8aSAgA"
  },
  "xtIjhmWZfE9yXGbh--YelQ": {
    "date": "1/4/2015",
    "text": "There were five of us on this visit to Charlestons Restaurant in Chandler.  The service was perfect and so was the food.  We all ordered different items off the menu and everyone of the food items were cooked to perfection and delicious.  Nope .. it does not get any better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a8Yu6dm8ptckNlW2LDUbZg"
  },
  "A9jodo_WkLi1VAb0mhjxCg": {
    "date": "2/7/2016",
    "text": "Always love going to Charleston's at Ray Road and I-10 in Chandler and taking friends there. Their spinach artichoke dip with salsa, sour cream and tortilla chips is the best of any restaurant I've ever been to! The Loaded Baked Potato soup is amazingly good! (No calories, right?!) The food is always top quality and the service there is always impeccable. When you have a half glass of iced tea remaining, your server immediately brings you a new full glass. The honey drizzled croissants that come with salads melt in your mouth. The atmosphere inside of Charleston's sports wall sconces and is very cozy. Whoever I go there with, we're never disappointed. It really makes for a pleasant dining experience--which is rare these days--when you don't need to constantly flag your server down to ask for beverage refills. If you've never been to Charleston's before, wait no more! Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UXzuE4jVuKyvw-o3HukJ_w"
  },
  "cp1BKhwUQpLSR2AD8WaaNw": {
    "date": "4/18/2014",
    "text": "I liked the atmosphere.  This was my first time going to this particular restaurant. So I played it safe and ordered the turkey burger which was good.  I really enjoyed the fries as well.  The wait was short and the wait staff helped each other out quite a bit which was awesome.  I was really impressed with the food and the service.  I will definitely try this place again.  I would have given it four stars but the music blaring kind of ruins the mood.  They should really think about changing the music choices.. Maybe upbeat jazz or something.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3_rc8afGuL-rokhks0lcqA"
  },
  "DgDvowEO4GQIMaUOC_S3wA": {
    "date": "2/8/2014",
    "text": "First the bad: Atmosphere was dark and intimate, however the loud pop music playing in the back round was a bit strange for such a dark and elegant restaurant. We felt like the music belonged in an Applebee's.   The water that was served tastes like it came out of 50 foot garden hose. I would expect at least filtered water in such an upscale place. We had to order a bottle water.   The Good: Menu had a great selection, we chose a $13 salad and a $20 chicken n ribs platter. Then we ordered the clam chowder for an appetizer. Soup was AMAZING! More meat than potatoes. The salad and the dinner entree was a nice size and tasty. We asked ahead for a half order but they would not accommodate :-/  Service was excellent from the moment the doors were opened for us until we left. Waiter was very accommodating and nice.   Overall nice place...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "IGMFSVrLeYVJpUNgsugRzQ"
  },
  "H5fXi4H20xKt7gG2Wkic7Q": {
    "date": "8/4/2016",
    "text": "Food for everyone in the party was decent.  Nothing special, but not terrible either.  The ambient noise level was awful.  Even with the restaurant half full we could barely hear one another across the table.  As the dinner crowd began to fill the place it got even worse.  We finally gave up and left.  DON'T GO HERE IF YOU EXPECT SOME CONVERSATION WITH DINNER.  Oh, and my Corona beer was completely \"skunked\".",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3dv-r9n3921kIOcgzpM_qw"
  },
  "ynae1uvVeYq4b8isvI0WVQ": {
    "date": "7/4/2015",
    "text": "We ordered the chicken club salad and shrimp scampi.  Both were surprisingly good.    Only complaints are that I found the menu to be a little short and the fact that they want $5 for a salad with an entree.  Oh...almost forgot...the booth we sat in was a tad odd.  I'm not a short person, but sitting in the booth the seat seemed to be so low that the table height was right at chest level.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lyj3OLJOGkqnjq2ZApa1lg"
  },
  "BMkQRLJZZM0mLof8YRdtsQ": {
    "date": "3/20/2016",
    "text": "This was my second visit to the Charleston in 2 years and our server/waitress, Victoria, remembered our group, after a small game of 5 questions, and was just as friendly and helpful as she was during our first visit.  Menu choices were sufficient, but I was disappointed with my menu choice, Bison Burger, which was a new menu item.  Description of Bison Burger included mustard, cheese, and pickles, and that was it. No other toppings or garnish, i.e. lettuce. I liken my Bison Burger to a McDonald's 99 cent value burger, a piece of meat slapped between two pieces of bread, nothing more.  While I will dine at the Charleston again, I will not order the Bison Burger again.  I would give a higher rating for the Charleston if it were not for my dinner",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ekgkRxICStZ43cPDmPvLMg"
  },
  "5wL2XE0OuEJmXYXV0Z_KMA": {
    "date": "7/12/2014",
    "text": "Went to Charleston's last evening and had an amazing dining experience.  The food is consistently good, the service was great and even though there were small kitchen hicupps the waiter and manager more than made up for them.  If you have not tried their Chicken Piccata you need to.  It is tangy and lemony and the capers and artichoke hearts make it amazings good!    I would highly recommend this location and like usual- they did not disappoint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mCduEqZvHV5FvuIkaYM1Ow"
  },
  "Kts87tttZfEd1JFT3w7Svg": {
    "date": "10/17/2014",
    "text": "I've always have had consistent quality with service and food. The rolls are delicious. Not anything to critique; background music is up beat to help motivate patrons to get in and out! Atmosphere is more relaxed than the pace of lunch service. I need to come back for a dinner service and see what pace they have at that time! Anyway a good meal, little on the $$$ till you see the portions (soup and salad combo).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-AkZkFH_md2-2kaSsvgrkg"
  },
  "TLMcKbWMBI6zy_AAcCv-rA": {
    "date": "8/18/2014",
    "text": "I love charelstons! 5 star service and food at 3 star price. Its all about the ribs and chicken, its amazing. Also the lobster soup is a banger as well.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sDD_YfBO3uh0Z-HuTu0-pw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Ribs and roasted chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sDD_YfBO3uh0Z-HuTu0-pw/o.jpg"
      },
      {
        "img_id": "tR_7M3LfY3CghZq7ZjdA9Q",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Perfect Margarita",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tR_7M3LfY3CghZq7ZjdA9Q/o.jpg"
      }
    ],
    "user_id": "9i4Vn-8O5wzS1A7YDITO6w"
  },
  "pewynGJwIVLNi5sbdJv_sw": {
    "date": "5/10/2015",
    "text": "Celebrated Mother's Day at Charleston's this evening with my family. As usual, the food was solid. Shrimp-cargot, prime rib, and key lime pie? Yes please.   As with most dining experiences, the service can make or break the deal. We were fortunate enough to have Mikaela as our server; she was great! Despite the holiday crowds, Mikaela was attentive and gracious, and made all of us feel comfortable and welcomed. It was a great time for all of us, and we'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YDBjHlfEuolAXMDIqIC9JQ"
  },
  "lwQc-zFrv7i-L9jsnNxoCg": {
    "date": "3/29/2016",
    "text": "We arrived a little late like 840pm, and were seated immediately. We ordered slow cooked prime ribs and they were very well made, taste perfectly with J Lohr wine. Service was great as well; Nick took care of us very well, he explained everything. We enjoyed the wonderful dinner and will come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Ln6e1wi4eqQh28H3EXExw"
  },
  "NkEk0mOcpG2IsTaVllZzyA": {
    "date": "5/14/2016",
    "text": "We had lunch at Charleston Chandler Az. First time there. Very impressive ambiance. Ate in the bar. Very comfortable leather seated booths. Very pleasant atmosphere with friendly staff. I had Chili, Rueben Sandwich and Cole Slaw. Food was tasty and welll seasoned.  Aaron was our waiter and he was very attentive and friendly. Refilled our drinks regularly and cleaned table of finished dishes.  Impressed with their luxury ambiance and comfort. Good fresh food with friendly service. Will return again no doubt.. :-)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gOLDq66kCTsEhmQgAFTTXw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Lunch at Charleston Chandler Az",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gOLDq66kCTsEhmQgAFTTXw/o.jpg"
      },
      {
        "img_id": "pSu4sXM_IKdFF6mUq8dg1Q",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Lunch at Charleston Chandler Az",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pSu4sXM_IKdFF6mUq8dg1Q/o.jpg"
      }
    ],
    "user_id": "lXEPwm3S6iILKljoeYmWiA"
  },
  "Qk0sY08g6McLxWtdjLojMg": {
    "date": "3/22/2018",
    "text": "Absolutely awesome place to eat. My wife and I go there almost every Tuesday night for a \"date night\" to get out together from the Child at Home. The food is just amazing, I have eaten almost every item on the menu and have not been disappointed. The waiters know us, there is never a wait for a table, and if so, it's for 10 minutes max. I really recommend the Prime Rib with Burgundy Mushrooms, they are to die for. Go there!!!...try it, trust me you will not regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M2JVgEt8rCep8hK8pJDl4Q"
  },
  "iukvmTuWpYnD_L4uomUCcQ": {
    "date": "2/5/2017",
    "text": "Some friends of ours invited us to this location for dinner as we were just arriving in town. It was about a mile from our hotel, which made it nice and easy to find.   When we arrived we were sat at a table very quickly, the server came up to our table just as quick to make sure we had a drink orders. The server made sure to give us plenty of time to scan the menu. We have plenty of time for conversation and to make our pics for dinner. The server took our orders and within about 20 minutes our dinners were hitting the table fresh and hot.  Of course we had a chance to order dessert but after our meals we were completely full. The bill came and much to our surprise, the cost of our meals were very affordable.  So if you're in the area this is one of those restaurants you have to come too. The menu has a good variety, they have a great bar, and plenty of seats for everybody.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 6
    },
    "photos": [],
    "user_id": "PsQE8GI6ZybxZDUxOmrLSA"
  },
  "d3bUzqjbWur0fC-a8XUdLQ": {
    "date": "3/4/2018",
    "text": "Unique place. Local. Friendly. And decent prices. Worth one evening trip over. I would try again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U9QzZouvAmZXaw7wMUxu1w"
  },
  "2hXQPW8LEa6iKEaprN0xgw": {
    "date": "6/15/2016",
    "text": "Made a reservation but when I got there they didn't have the reservation so a bit concerned about that but thankfully they didn't have a problem accommodating our party of 7.  We were seated at a large round table which was great because it facilitated large groups connection and conversation.  The table itself was lopsided though, which was weird and a little awkward but not the end of the world by any stretch.  Everyone we encountered was friendly and helpful.  Our server was great!  The food was very good - from the appetizers to our meals to the dessert that a few folks at the table shared.  There were rave reviews about the coconut shrimp and the brownie with ice cream, which isn't on the menu but apparently an option.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z3nwYQzDUimoUl8LNDIxjQ"
  },
  "Ku6BGIW2AuL6aCJbaj5p3Q": {
    "date": "3/29/2016",
    "text": "Tried Charleston's for the first time on a Friday night. Called ahead to put our name on the list so we wouldn't have to wait long. We were seated immediately upon arrival which was nice considering it was 6:45pm on a Friday night. The restaurant was packed! Our server came and took our orders and was prompt with our drinks and appetizer.   We ordered Prime Top Sirloin for my husband which he swears tastes like its from Mastros or a place like that! It was cooked perfectly. I had the Prime Rib with a side of fried okra which was devoured quickly by my 4 year old son. My son ordered the catfish off the regular menu. Portions were plenty and tastes was top notch! Our drinks were refilled constantly and despite being busy, our server was very attentive. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "clEE8q-e99TGR0Q3H55MLw"
  },
  "M0A4--Dm1DBWNsyl4iAIrQ": {
    "date": "7/14/2017",
    "text": "Fabulous meal and excellent service.  First-time and I'll be back. Wine, coconut shrimp and grilled chicken salad with a tasty croissant all delicious.  Prefer my chicken hot but I know to ask next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zh-CyUct62GLX-rToQxITw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Zh-CyUct62GLX-rToQxITw/o.jpg"
      },
      {
        "img_id": "vKi47kvI5peWQJbWPN8IBg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vKi47kvI5peWQJbWPN8IBg/o.jpg"
      }
    ],
    "user_id": "CBYlr6bksWM1WA_pTumeeg"
  },
  "IezUQBn5R6kFHCpQtJWM-Q": {
    "date": "9/2/2017",
    "text": "I always want to get the Reuben here, but last night I wanted to eat healthy so I ordered the kale salad with the pastrami and sour krout on top. The waitress had never had an order like that but it came out perfectly. We were too full to get the bread pudding so we got it to go. She made sure we knew exactly how to heat it up later to get the same delicious experience.  Great food, great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ql8pnKY4yh_8NWnxAn0k2A"
  },
  "D7xa0pKbENPw9TR5xCYELg": {
    "date": "4/25/2017",
    "text": "Julie, the bartender, is always extremely friendly and attentive.  Food is always great and consistent. Great for lunch and happy hour.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XPTsmTZqvWbvlMwboks7Hw"
  },
  "TROdZ5cQ1k9wPaT0wTPvlQ": {
    "date": "2/19/2018",
    "text": "We went here for lunch, the place was busy but we still managed to get a table.  Food tasted amazing! Everything came quick and we were surprised by how little they charged.  Will definitely be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MWEKVZ6usOogWY7NkIJNTg"
  },
  "IOshcGT23Ai0cmzyN3d07Q": {
    "date": "12/4/2016",
    "text": "I was very impressed with this place and I'm usually not a fan of chain restaurants.  If you go here, I recommend anything wood fired or smoked. I had the short smoked salmon and it was the best salmon of my life!  It was that good!  Great relish and cucumber condiments to go with it.  I will come back here just for it!  One of the other guests ordered prime rib sandwich. I was secretly jealous I didn't order it.  Other people ordered salads.  They looked okay but nothing spectacular....you are better off with sandwich or meat entree.  The ambience is very nice and our server and the wait staff were terrific.  Thanks for a great lunch! :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "6zxPHDdLUNhCSLSeHlCVNg"
  },
  "7Nbkj7e7l-TuuOuwUyvgFA": {
    "date": "9/23/2017",
    "text": "Had dinner at Charleston's last evening. Ordered the shrimp scampi dish. When I ordered I asked the waiter to please have the pastor served El Dente. I had ordered that dish before at this restaurant in the past it was overcooked and mushy. The waiter indicated that he would put the order in just that way. About five minutes passed and a man who I believe to be the manager came out to talk to me. He told me that unfortunately they wouldn't be able to meet my request and serve the pasta El Dente because something about it being pre-cooked. So basically what I was told is they would not be able to serve the dish properly and that it would be an inferior dish with mushy pasta. Really??",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l45_Ws-Tk32tWu81NNipzw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l45_Ws-Tk32tWu81NNipzw/o.jpg"
      }
    ],
    "user_id": "X0ClNlPMree9OPwReCWJBg"
  },
  "S7kW5dNnKdaH2WSveV-CZQ": {
    "date": "12/11/2016",
    "text": "Server Nick was fantastic! Very nice and funny and attentive in the good way (he checked in on us but did not interrupt). Prime Top Sirloin was fantastic! I highly recommend the Cream Spinach Dip, its soooo good.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1e7vy-vPZshPtcJB-QysmA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1e7vy-vPZshPtcJB-QysmA/o.jpg"
      },
      {
        "img_id": "XjF_awC5qU3kJf4k3Z6LHA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XjF_awC5qU3kJf4k3Z6LHA/o.jpg"
      },
      {
        "img_id": "VNOyIBRuLBIATyV3wwq4Vg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VNOyIBRuLBIATyV3wwq4Vg/o.jpg"
      }
    ],
    "user_id": "GlTBlePE5O3KiU7qZ06tew"
  },
  "wC-s309OUIzqDW_uQ0C1fw": {
    "date": "1/29/2017",
    "text": "Good lunch menu .. Kake salad is off the hook. Add a protein ( shrimp , salmon ) and step it up! Very consistent and service is good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9kylZkQveOTSBeK-lZ7Idw"
  },
  "ohw1eYZAgk5IK2XSq4dDww": {
    "date": "2/24/2017",
    "text": "We ate here twice while in Phoenix on a 3 day work trip from Texas. (Lunch and dinner). Both occasions, the food and service were great. I had the Top Sirloin and baked potato on visit #1. On visit #2, I had the Walt's Champagne Chicken Salad. It was amazing. Their pizzas looked delicious as well. I highly recommend visiting this location!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x-RGSvscNTtwJw8YxKt-RA"
  },
  "I9QyQoS459ohE8vibc5utQ": {
    "date": "2/14/2018",
    "text": "While celebrating our anniversary on Valentine's Day we drove from Tolleson, Az at 3:40 pm to Mesa for our reservations at 5:00 pm, it was rainy and there were so many accidents we got stuck in traffic and were not able to make our reservation on time. At about 5:25pm the restaurant called me to see if I was still coming and I said yes, let them know I was almost there and just stuck in traffic to my surprise they said ok. Once we arrived at 5:35pm we went inside I was expecting to have to wait for a table since people were waiting for a table but the hostess took us right in and sat us at our table. After having such a rough drive and then the restaurant being so understanding it made for great Anniversary. The food was so delicious and our waitress so amazing and on point. I truly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aV4i9DwnlebiUDA_2KGRsw"
  },
  "wkOABTq18i2a_ItdAxritQ": {
    "date": "11/13/2016",
    "text": "Went in a few weeks back for dinner and tried the flatbread pizza and hickory burger. Both were really good, as was the service. The place has an older vibe to it like it was decorated in the 80's and might cater to an older crowd but it's good food and a subdued setting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGXKMV1omio1I_3qNLdtAA"
  },
  "EvXVEf7Re_b3MRolmLnWtg": {
    "date": "11/17/2017",
    "text": "Ordered take out from this location and everything was great. We barely parked in the to go parking and we were immediately greeted by an employee with all smiles. Our order was right and food was hot. Food was really delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLAJZCXS1CEjBOl9aEQENA"
  },
  "qfcWsbv0trVQSAi2TUYNvg": {
    "date": "12/19/2017",
    "text": "Took the family out to Charleston's over weekend and out of the five meals they all were delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "unZxDg2yI0wxz2WEzTK68w"
  },
  "kh-RVK1Jnz7DOB66Aywl5A": {
    "date": "2/14/2018",
    "text": "Always enjoyed the food and ambiance at Charleston's, but won't patronize a restaurant using the \"bait and switch\"scam. I checked their menu online, but when I tried to order an item featured, the server told me they no longer had it on the menu. I showed her the internet version of the menu and she said it was a \"corporate issue.\"",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PGMr0gaLovOLMv7QeD48cw"
  },
  "Vm0EcN_IQSDHDfEGa4DNnw": {
    "date": "7/23/2008",
    "text": "Croissants and bread pudding. That's the only reason I eat here, the rest is just details. Ok, the rest of the food is pretty good. I know in all my reviews I put a disclaimer about \"it's nothing AMAZING\" and this one is no exception. The atmosphere is dark and relaxing and at lunch time, it's always busy. Today I had the new chicken salad sandwich...meh. I should have stuck to their fish or steak selection. They know how to grill a steak or a fillet of fish. The chicken salad however was sad and disappointing. The bread was so coarse that it scraped the roof of my mouth, the chicken salad barely had any mayo and WAY too much red onion chunks. I won't be ordering that again. Other than that, I'm rarely disappointed with Charleston's and plan to devour more croissants and bread pudding. Those are a little piece of heaven on a busy day!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "-fQPzH-e-ubDIiLQhybEjQ"
  },
  "KvgJFZGDylSbmWDJuSUNTw": {
    "date": "6/29/2008",
    "text": "This is a chain steakhouse. I usually have the Fillet Mignon - rare, it melts in my mouth. I get the Cesar salad with croissant, garlic mashed potatoes or french fries, sauteed mushrooms, my mouth is watering thinking about it. My iced tea is always full. My biggest complaint is that the wine selection is pretty bad for a steak house and the staff isn't sure weather or not they have a corkage fee. Waiters & waitresses are usually very nice and accommodating. A few times they have not cooked the steak correctly, they are good at fixing it for you, or giving you gift certificates to make up for it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "2d_dTV4z8NebY6WP7fIxDA"
  },
  "hhPu1xXTNDcjer1pW0gP3g": {
    "date": "9/8/2009",
    "text": "The chicken ciabatta sandwich is out of this world. Great service and many delicious menu items makes Charlestons one of my regular lunch destinations",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M0XCdzHf6HBrTHtWQUT8rg"
  },
  "VPN80Hx6_UFG1gIC0lGBGw": {
    "date": "8/6/2010",
    "text": "I give this place 5 stars because for the price the food is fantastic and I've never had a bad meal or bad service! The best things to eat here (after having gone 15+ times) would be the BBQ ribs, Prime Rib, any of their salads, and the Spinach Artichoke dip is a MUST! They also make incredible honey croissants that are to die for and for sides their garlic mash potatoes and glazed carrots are amazing.  It really boggles my mind, reading  the few bad reviews...you'd either have to be so unbelievably picky not to like this place...or your just plain weird, sorry! Good food is good food all around.  The ambiance is defintely on the dark side, almost like a Midwest super club, but I personally feel it gives it a much more expensive ambiance which makes you feel like you're eating at a really fancy place. I've always had the manager come around and ask how our meal was (just great service).   Really couldn't recommend this place more highly, it's my favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sVSYz5hMGDyX8PHcL_wz7g"
  },
  "NbF_jF3cPzsi2clZa1RCpg": {
    "date": "11/20/2010",
    "text": "This was my favorite restaurant until today.  My family would meet there once or twice a month.  The food is always good; however, today I found out NO more salad with your meal.  The salad is what set their restaurant apart from others.  I paid $20 for a piece of meat and a baked potato.  No salad, no bread!  I will be looking for another restaurant in the area that gives me a full meal for $20.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lHT9aM-Q7NATg9m1bDGU7g"
  },
  "mJtKhxKH3XHHuCeMfTuAJw": {
    "date": "2/25/2007",
    "text": "I won some gift certificates at my school's raffle, and never having eaten here before, my husband and I decided to check it out. We were both quite hungry, so we ordered the croissant appetizer. They were under-baked, greasy, and drizzled with honey- both unexpected and disappointing. Hubby's clam chowder was full of grit and my salad was drenched in dressing, topped with a handful of chopped mushy tomato, and also full of grit. The grit police must have been on vaycay. Hubby ordered the prime rib sandwich (which is one of his favorites at Houston's) and it turned out to be a full slab of nearly tasteless meat which was poorly trimmed and ribboned with tough membranes on a lame toasted roll. He would have had to tear into it like a Neanderthal to eat it like a sandwich, so he ended up eating as much as he could stand with knife and fork. The au jus tasted like bouillon- and super strong at that. My entree was far better- a tender and perfectly cooked fillet of beef (although I had ordered the less expensive sirloin) with a delicious baked potato with all the trimmings. I ended up giving him about 1/3 of my steak since I felt so badly for his disaster of a meal. When we complained to the manager, he offered us more gift certificates, and we turned them down. You, too, should just say no to this dark, inexplicably crowded, disaster of a restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NjLRgbRZiwEIMpAgXypJtw"
  },
  "yD0kD1RJ5678VViAvGo0lQ": {
    "date": "12/16/2009",
    "text": "With all of the advertising we decided to stop in for our 2 o' clock lunch. I have never had chicken fried steak before and thought since this was an American cuisine place I'd try it. Needless to say I disliked it a lot. The presentation was great, it came with a heaping mound of potatoes and instead of the carrots I ordered the fried okra. The gravy was good, I believe it was a chipotle gravy. Fried okra doesn't come across in many restaurants in town and I thought their's was pretty good! We tried the fried catfish which was awesome and so was the rib roast sandwich. The portions were plentiful and could feed a small village. Prices range from $9-$15. We wanted to try their keylime pie but they ran out. The service was pretty good. They kept our drinks full and were attentive without bring obnoxious. I would go back again but just won't order the chicken steak. That's just my preferance- it might be great for someone else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x1WjxfcbabVkDz9Von0gOA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Chicken fried steak with okra and mashed potatoes!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/x1WjxfcbabVkDz9Von0gOA/o.jpg"
      }
    ],
    "user_id": "YflW185gzaOFWYawZZZang"
  },
  "DI-rgSRk7G9LpV_LjbkDHg": {
    "date": "1/27/2009",
    "text": "Customer service trumps, so I must downgrade my rating with this addendum which I failed to post when this happened, at least 8 months ago, if not more. More likely it was last year.  It's now Sept 2011.  I happened to see an ad and thought, my positive review needs updating and sharing on FB, twitter, etc.    With almost every frequent visit here, we order at least 1 margarita, which yields 2 glasses from the shaker.  We dined in the restaurant over the bar this time and found the shaker only gave up 1 glass.  We tell the waiter, after all, we're ordering meals as well.    The waiter  consults the manager, who then eyes both of us while discussing this, before approaching our table.  He very condescendingly begins with speaking loudly, as if we were being reprimanded.  We tell him that we've ordered these margaritas for YEARS and it's always been a 2 glass drink.  He exclaims loudy still, that he is happy we informed him because the bartenders have been  making them wrong and he would be sure to have them make the drinks correctly with the right amount from now on!  There was no the customer is right, obligatory apology, no offer to make the drink as we've always had it served, no removing it from the bill, not a single offer to make it right for the customer.  We weren't asking for a free meal, nothing outrageous.  We asked that the drink we paid for, which if you think about it, are pricey-- for what you receive.  Not only do we NOT get a single word in the way of I'm sorry this happened, we are yelled at so every other table nearby turns to look and listen.  We weren't embarassed by that but somewhat surprised that he would make a specatcle,  in order to make it appear that we were unreasonable to the other customers, a weekend crowd.   What fool that gave him the title of manager?  tsk tsk, too bad.  We dine out for maybe 60 meals per month, who knows$, maybe more.    Needless to say, we haven't been back in to spend our money and we never will. Years of dining there and all that wasted  money.  There are far too many other restaurants with fantastic delicious food and tasty drinks PLUS FRIENDLY, accommodating staff.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sz_hey55GUH1N_nmIWN66w"
  },
  "RWW8QCC3NJ-9ZnNdjzEueg": {
    "date": "9/10/2010",
    "text": "Good food -- especially their ribs, good service -- prompt and attentive. A reviewer mentioned people may not consider Charleston's a kid friendly place. Well, lemme tell ya ... I was there w/ my 2 boys -- 5 and 2, and they were plenty nice to my boys. Brought them crayons, etc. They shared a kids meal and it was more than enough for the 2 of them. I would agree though that the atmosphere and decor lends itself to a more \"mature\" clientele. There were definitely a lot more \"gray haired\" customers there the times I've eaten at this establishment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dPDI-SA-uiF8JLeZ6Jqp3w"
  },
  "d9GqW7RZnsrwnxsE1ip6SA": {
    "date": "2/14/2010",
    "text": "I'm not a huge fan of chains but the food here is always consistently good. This is standard \"American\", little of everything, place. It is a good place to have a lunch meeting if you want to try to please unknown tastes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8SSaCgmvsztEOg2CqeXxnw"
  },
  "KsrD86wLHBFndz7CNEW6nA": {
    "date": "8/11/2009",
    "text": "Being a vegetarian I did not think Charleston's would have much for me. It turns out that I was right, HOWEVER, what they did have for me was actually very simple but amazing!  I had a business meeting today with a vendor and my biz partner. We all shared the spinach artichoke dip, which was super tasty and a great portion size. The chips were nice, warm and fresh and the dip came with salsa and sour cream on the side.  I had a house salad sans the bacon plus avocado for my entree and a baked potato on the side. I opted for the creamy garlic dressing and it was OUT OF THIS WORLD! The salad was fresh with egg, carrots and chopped tomato and the avocado made a nice addition.  They cover their potatoes in sea salt.. its pure genius. I'm serious. Genius. All I needed was a little butter and sour cream and I was set.  Our waitress was very attentive but not super friendly. She had a new iced tea out to me before I was halfway done with the one I was currently drinking. Great service but I have had to make five trips to the bathroom since.  This is a pretty good place for a business lunch but I wouldn't come here outside of that because I normally like something a little heavier for dinner and its a tad on the pricey side, but hey, I didn't pay so what do I care?",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "rA97zeqOrUYuEM69n0Xn4w"
  },
  "_t9tiI_DoWuHGfCnNNtbqw": {
    "date": "11/14/2007",
    "text": "Everything here is mediocre. Blah  The food is blah, the menu is a snore, the restaurant ambience is dark and boring  Mediocre all the way.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "OPN-dDUBkH7uH-G8nOnskg"
  },
  "-OxoE4YHPMNxVl0uueUmkA": {
    "date": "4/15/2009",
    "text": "charlestons is one of the few chains i actually enjoy. I love their croissants and their staff is always awesome. their chicken strips are awesome. i love their grilled chicken and veggies, too.   They have an awesome blackened grilled chicken, they don't use oil to cook either which is a plus! they no longer have it on the menu but have never given me a problem ordering it!  yay for charlestons!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "JmhVFueYvJe0CsUddwuajw"
  },
  "Wisvd-1Zwl3X5IoCIKxoTA": {
    "date": "3/11/2008",
    "text": "The atmosphere here is very cozy.  It is all dark wood and dark interiors.  The wait staff is all dressed in black.  The lighting is minimal with spot lighting for each table and what appear to be gas lamps on the walls.  The food is served in a minimalistic style.  You order a dish and a side.  You pay for each part of your meal individually instead of as a combination.  The vegetables were very fresh and cooked simply.  I would definitely eat here again.  The only downside is that it seems a little bit pricey for what you get.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gJHLxzpHHm_AAS55g15neg"
  },
  "stdXsuj0Q2XJTNIZ9UdPRw": {
    "date": "12/13/2015",
    "text": "Have been to Charleston's a few times and had wonderful service and excellent steaks.  It seemed like a nice romantic place, so for our 45th anniversary on 12/11/15 we chose Charleston's, fully intending to spend a 1.5-2 hr. romantic dinner including wine, appetizers etc.  Big disappointment.  Didn't even leave a tip, and we generally tip 20-30% depending upon service.  Ordered the prime rib that comes with a baked potato, added a side of burgundy mushrooms.  Wanted more time to peruse the wine list and when the waiter rushed us too much we skipped the wine.  He seemed to want to take our order, not let us look at the menu and decide either.  No wonder he got the order wrong.  We both ordered the same thing, so an easy order.  In the past we had always been given the hot bread, but he didn't bring any and didn't ask if we wanted any.  We thought perhaps they didn't do that any more until we saw other people being served the bread, so we asked why we didn't get any and were told \"you have to ask for it\".  Our orders were delivered by another person, without the baked potato.  She said she'd check on it, and came back saying the waiter misunderstood, thought we wanted to substitute the mushrooms for the baked potato.   No idea why he thought that.  Adding a side of something doesn't mean you're substituting it for something else.  I also asked for the creamy horseradish for my prime rib, which was omitted as well and I had to ask for it again.  By time the potatoes finally made it to our table, we were more than 1/2 done with our meal.  We would have ordered a salad with the meal as well,  but the waiter was in a big hurry to leave the table to turn our order in.   Really felt like we were rushed through ordering.    Really, really disappointed in the prime rib.  Choose between 10 and 14 oz., we got the 10 oz. which turned out more like between 5 and 6 oz. of edible meat - the rest was grissle and stringy meat - asked for medium rare and it was closer to rare, had to cut with the steak knife.  We'd never gotten bad steaks, always almost melt in your mouth - so very surprised the prime rib was horrible.  The best part of the whole meal was the mushrooms.  Couldn't get the waiter's attention to refill water glasses.  Our anticipated romantic anniversary dinner turned out to be a sad disaster/disappointment.  It had always been fairly quiet in the past too, which makes it romantic with the dim lighting and all, but this time, it was as loud as Texas Roadhouse or a Chili's.   They sat us at a table for 2, which is really too small, so we had to sit across from each other instead of next to each other, and with my husband's hard of hearing/understanding ears, especially in such a noisy restaurant, we could not even communicate during the meal.  Total flop anniversary celebration, due to bad service and bad food.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gJEPGx2O3f2-y69ivDJNQQ"
  },
  "aD9jRByW4M80YfwgRASCAA": {
    "date": "9/15/2014",
    "text": "I have been off work, injured, so I sat down and starting reviewing all these places we have gone to since I have nothing better to do then eat. So you see I have a lot of reviews , most written in a couple of days, but let me tell you this, these are honest reviews. So,  let me tell you about Charleston's. This is such a nice place. We go to either this location in Chandler, or the Mesa location, on Stapley. You can't go wrong at either location. We have been coming here for years. We love it here. The best way to start your meal with a great appetizer called \"Shrimp Cargot\" OMG. its so good, hot out of the oven, shrimp smothered in cheese and butter, so gooey, so good.  I now will tell you that the best ribs you can get, are here!!!! Really, no joke! So tender, so ....great!!  Burgers are good, chicken, and of course, steaks are wonderful. Come late afternoon, its nice and cool, cozy, and no bright lights. Just relax with your wife, or the kids, yes kids will love the food as well. Sometimes we have to take the kids somewhere nice too. Doh!!!!!! I give this place a giant Woo Hoo!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TSqSXQTXTE4VKh39_ocYDw"
  },
  "q-JJR365lIBDknbbuzw9Gg": {
    "date": "3/16/2015",
    "text": "Love, Love LOVE this place!  We come to AZ from San Diego each year for Spring Training and always look forward to our meal(s) there.  We have had exceptional food - you MUST start off the their Shrimp-cargot...amazing appetizer!  We have had salads, soups, sandwiches and entrees and always been very pleased with everything.  The Chicken piccata and prime rib dip are favorites for sure.  We have also had wonderful service and this week had a young lady named Bryce.  She was extremely pleasant and helped make our dinner even more enjoyable! Cant wait to go back next season!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F5W9GfF8VTiPIMlVgKwdXg"
  },
  "qOKQW4sNrDzYvmcQK0DklA": {
    "date": "2/21/2015",
    "text": "Oustanding food and service. Great pork chops and fresh fish.  The salad comes with homemade dressing which is exceptionally good. A warm fresh croissant come with the salad and was the best  I have had since N'awlins, as was the fish. The manager Michael came by to tell us our order would be out soon, and it was. Servers are attentive and very competent. Large portions come with a choice of sides, I substituted carrots and baked potato for the cole slaw and fries and they were very good. We travel often and look for above average restaurants, and this Charleston's is way above the usual American fare in most cities. Well worth your time and money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ed3pLLFA1EuViiAj79IQJQ"
  },
  "5EC9Pqn9Aq6QPn0almY77Q": {
    "date": "5/23/2012",
    "text": "I was taken here for lunch with a couple of guys by one of my partners at work. I can't remember what I had but I remember the portion being perfect. I left and didn't feel like a zombie after lunch. Our waitress was on top of her game. My glass never went below the halfway mark before getting a refill. I would absolutely go back again and I plan to as soon as possible.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1pZTx14SMQde2lJX8d7AvQ"
  },
  "2kgOHgIGMZelI-6Sdg2yOQ": {
    "date": "1/23/2009",
    "text": "I typically like to stay away from chain restaurants, but the mister and I were looking for a cheap place and served good food. He suggested Charleston's and I thought \"Hmmm... it looks like Denny's from the outside.\" As soon as we got inside I really liked the interior. It has a nice ambiance... as my friend Peter once said, \"It's where I like to go when I want to feel fancy for a cheap price.\" We had the Honey Burger I think its called and the prime rib au jus sandwich. Both were beyond my expectations. The great surprise was the baked beans that I ordered with my prime rib sandwich! YUMMERS! The burger was one of the best I have had and the sauce with it is just spicy enough to be flavorful, but not overpowering... I am not a big SPICE fan. The one downside was that my boyfriend's fries were cold with his burger, but they instantly brought us new, hot, fresh ones.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sLTvEeCGc-6FIQ_NqWFxIw"
  },
  "L4fzOCL3rYvKOTkMA6pj7A": {
    "date": "5/10/2007",
    "text": "The house salad and any of the steaks are delicious. I prefer mine done medium-well and this is about the best steak place that I have been to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Ab0Mz00pqhCEi0ufqGDCg"
  },
  "6bY-PlIKEtga5QyKCUG4jw": {
    "date": "3/8/2014",
    "text": "Taste just like roadhouse but more expensive. The service is much better than roadhouse and it's more classier. The catfish plate is pretty good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "33y3uyhlx1_RwlFq3tTv2g"
  },
  "8SKItXI7kC6DmNBjyOFvzQ": {
    "date": "7/25/2011",
    "text": "Went to dinner this past weekend with family to one of our \"regular\" places\". We have found over the past year that Charleston's has not been near as consistent as it used to be. Our favorite meals seem to have lower quality meats and they have changed their menu so salads are no longer included.  It's really no longer an average priced place, but it's become very average food :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yzjT8XByxa0yMlYsLNL8uQ"
  },
  "dgj-WsM9kVNlR2UKSuptAg": {
    "date": "9/12/2014",
    "text": "After having a bad experience at another restaurant we decided to give them a try, So glad we did, they were busy for lunch but we felt we were the only customers there due to the great attentiveness of their staff,  It started with the attitude of the hostess that greeted us and continued throughout the visit by all staff members we encountered.  The server was so professional in describing recommendations, helping us by offering to split portions in the kitchen without having for us to even ask.  When we got our appetizer it was so generous we know we couldn't eat the soup we ordered as well.  He just cheerfully noted he was waiting on us to eat the appetizer before even ordering it so it was no problem to just cancel.  The meal portion was generous and very delicious. I was so surprise and pleased about the whole experience I had to write a review Nick G  was the server and this was on 9/12/2014",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n1S7TjVClVEfqPjaMggozw"
  },
  "jCyMBL8cWCZyERKAS41f1g": {
    "date": "12/14/2013",
    "text": "Excellent in every way! Service gets an A+. The waiters were so efficient in refilling our drinks and getting our food on the table with perfect timing. The food was fantastic.  The spinach artichoke dip and their house salad with champagne vinaigrette & croissant  are amazing! Their filet and mushrooms just melt in your mouth! And their bread pudding is to die for! We live in Tucson but we'll definitely make the trip back to Chandler just to eat here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rFZ4kJDTBZKTN6lVEGS4EA"
  },
  "uMe1au1SiQ1c7KRgXmMbqA": {
    "date": "1/6/2014",
    "text": "Had the mahi mahi.  Food was very good as always.  The service was excellent.  Way to go,  Charleston's wait staff!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KD9Xm9kOQ1y_0B5ARpNENw"
  },
  "73Cur9jYQXgoqXT7DkrOeg": {
    "date": "9/19/2011",
    "text": "Good food, speedy lunch service and nice people.  Enough said.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0R0mb2aq7liSPu3OqSGq5A"
  },
  "L6YiwQgvZ0ikN8_K9Ye84g": {
    "date": "1/11/2010",
    "text": "I've driven past Charleston's on the I-10 and Ray plenty of times and never gave it much thought, but a few weeks ago I was invited to a business lunch there and it is pretty much perfect for that. It's a nice professional atmosphere and I was actually impressed with my spinach salad, the quality was much better than I expected. I don't have a whole lot else to say except that the croissants that come with lunch are heavenly.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "ZY2HuOTauUiYgOE_Ee5o3Q"
  },
  "VsuZ7aq-oMwUJmzOAnAAMQ": {
    "date": "6/25/2013",
    "text": "I used to love this place because they had a huge variety like the Cheesecake Factory (aka something for everyone). But when I went in April they completely cut down the menu and all the good dishes are gone. I was really disappointed and expected more.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jbx1QfpcAxhWLgYUQR_puQ"
  },
  "woyM__FyX4uqraMj8nqG8Q": {
    "date": "3/7/2019",
    "text": "This is a superior restaurant! Never had a bad experience. Food is always great as well as the service. One of my favorite restaurants for business and social dining.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4kIxVYbX32kncrGYaI0gOA"
  },
  "xI3g8eDCfwBw0XYpVFPwCA": {
    "date": "3/6/2019",
    "text": "We're visiting the area and tried Charleston's last night after a full day of travel and no meals. We absolutely loved Charleston's. I had the short smoked salmon that was served on a bed of sliced cucumber and a side of fresh veggie medley and was delicious!  Hubby had a filet that was cooked to perfection and served with a loaded baked potato. Bonus to the evening was a Ferrari-Carano reserve Chardonnay! Service was outstanding. We went back this evening and although we arrived 30 minutes before closing, the staff was more than happy to seat and serve us. Hubby had the Hickory burger - cooked perfectly - served with a huge plate of shoestring fries, and I had a house salad with grilled chicken. Again, we were not disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "owYu72Yiywa7o8VCeMielA"
  },
  "VTJCIUFLdqxfLxYMVK74ow": {
    "date": "12/18/2017",
    "text": "I went for dinner on a birthday weekend. Wasn't too busy but they had a 75% capacity. Andi, the server was spectacular...she was patient, funny, kind, and had an amazing personality....even if the food hadn't been fantastic, she would have made the meal Awesome...btw the prime rib.... scrumptious...  I'll definitely go back and ask for Andi !!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JT8T_BSkNcPDjUwmO0Bmfw"
  },
  "894MLHziOACzSt_7VNU1vA": {
    "date": "9/19/2018",
    "text": "This is one of my favorite restaurants of all time!  The ambiance is so relaxing and enjoyable, either inside or outside on the patio.  The food and drinks are always amazing...I've never had a bad meal, or bad service here.  I can't say enough great things about Charleston's.  Perfect spot to celebrate a special event, or bring out of owners to impress lol :) - HIGHLY recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4nO1z1taOC9VBEEW_4JfjA"
  },
  "1tM5paUc6VRNj7Ze9OlrGQ": {
    "date": "7/29/2018",
    "text": "I was at this location a few months ago and it was Very poorly managed. Unless they have replaced the manager and some of the waitstaff I would skip this location.  Worth driving to the Mesa or Scottsdale locations. Both of them are great.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yKlPctfiH5cGZNTphtE6HQ"
  },
  "Mrh2xi2IOZGyBRAac-b_Dg": {
    "date": "3/8/2019",
    "text": "Dinner ordered in the bar, you would think great service, but didn't happen. Salad ordered, but it came with dinner. Of course I sent it back. My mother's dinner came with no sides. One side came when she was done with her meal. The other one was non-existent. The manager said he would comp the meals, but still charged for some of the food we never got. Charleston's, we won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cxwItErLvEt1lKeXuUfhJA"
  },
  "tyRtxGsyP5D6bimo5lS79g": {
    "date": "1/21/2019",
    "text": "Was pleasantly surprised with the great food and awesome service.  I was in town for a quick trip with my sister and mother and found Charleston's on Yelp for a quick late night bite.  The three of us split the prime rib and chicken champagne vinaigrette salad and both were delicious. The great food was complimented by our excellent service - we were one of the last tables in the restaurant and our server Aly was super welcoming and accommodating for all our questions and requests. Next time we are back in the area we will definitely return for another great dining experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xWutWfdVsWJQ5Qt7cPe_mA"
  },
  "uYJDhM4UhBe-BGxl3soZEw": {
    "date": "9/8/2018",
    "text": "The French Dip is one of the best I've had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NQcxCuc-NiVL-5EdApyEkg"
  },
  "RTnAWSF72oxB0M_Fts7ygQ": {
    "date": "2/4/2017",
    "text": "Apparently, this is a chain, although I had never heard of it and we don't have one where I live.  Came here for a work dinner as they were quickly able to accommodate a group of 11.  I was pleasantly surprised at the ambiance, menu, and service of Charlestons (kinda wish we had one).    We had one server who did a great job of serving our table and all of the demands.  My coworker and I each ordered a sandwich but decided to split/share halves.  French Dip and the Chicken Avacado.  Seriously, it is not hard to get a sandwich right I know but these were SO good.  Really hearty portions (came with fries) and I probably could have easily just had half a sandwich.  The full entree choices looked pretty good.  One of my coworkers had the angel hair pasta with asparagus but substituted the chicken for shrimp... she loved it.  They have something for everyone on the menu.  They also had a couple of local beers on tap which were delicious as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0yrF14nWVAFeI0fG29a63g"
  },
  "jh5HsJfG2xfS13PpHcSMfQ": {
    "date": "5/22/2018",
    "text": "Recommended by BMW chandler, Mark.  Super great place for lunch. We split the Reuben with slaw...Yea. Perfect size and delicious. Fantastic service from Julie, who covered the whole bar area by herself. Definitely will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6rC-yu4BBMfPuacFQHveIQ"
  },
  "Pe4wEXGZG0W8WnqvJzVNVA": {
    "date": "9/2/2015",
    "text": "We went to Charleston's solely for the bread pudding & ended up leaving after a wonderful dining experience. The hostess seated us immediately upon arrival (unexpected at 7:30pm on a Friday night) & our waitress came by to take our drink and appetizer order soon after.  After browsing pictures on Yelp, it pretty much went without say that we were getting the Shrimp Cargot. It came out so piping hot that we had to wait a couple of minutes before digging into the delicious-ness. The escargot dish was filled with 6 succulent shrimp in a garlic butter sauce & was covered in havarti cheese; it was served with 2 pieces of garlic toast. The only qualm I had about this was that there wasn't enough garlic toast in ratio to the shrimp, however we enjoyed what was served.  Upon recommendation of our waitress, we ended up getting the Ribs & Oven Roasted Chicken combo, split. The Oven Roasted Chicken was by far the biggest disappointment. It was lacking flavor & any kind of pizzaz and was covered in a thick layer of fat which was highly unappetizing. I had to pick it all off. The ribs on the other hand were actually cooked really well and the mashed potatoes & baked beans were tasty. The portion size was definitely enough for two people to split (you may have leftovers depending on how hungry you are, if you get an appetizer, etc). The best part was that they brought everything out on two separate plates so we could just get to eating immediately.  Finally, we put in our order for dessert! Yes, I had VERY high expectations and yes, I was satisfied. We were presented with a beautiful piece of bread pudding that was topped with a Bourbon Whiskey sauce. When I pierced my spoon in the pudding & grabbed a bite, I immediately knew it was hot hot hot! Steam filled the air. After only the first bite, I was converted. It was the perfect amount of bread, cinnamon, and sauce but a bit heavy on the raisins; I think those could be lessened since it did start making the bread pudding seem overly sweet towards the end. The size was big so I got to take a little bit less than half home for the next day!  Charleston's doesn't have a very big menu but the choices offered seemed great. The service was also pretty on par so I'd recommend this restaurant to others.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tCe_Rgy8OIsopvh1NZfvlA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Bread pudding!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tCe_Rgy8OIsopvh1NZfvlA/o.jpg"
      },
      {
        "img_id": "KBWaO1nEbqTNAiFiH7nxOQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Chicken &amp;amp; ribs combo, split with mashed potatoes &amp;amp; baked beans.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KBWaO1nEbqTNAiFiH7nxOQ/o.jpg"
      },
      {
        "img_id": "E0H2OXEZdKj6v0JnwJd2gA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Shrimp Cargot.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E0H2OXEZdKj6v0JnwJd2gA/o.jpg"
      }
    ],
    "user_id": "CjhTdmN6qWEKC7Zo6qadow"
  },
  "h78S4fyKqMTW4-urMtINyw": {
    "date": "5/7/2018",
    "text": "Dave Hudson's favorite place to go.  Key lime pie is a must, don't forget to make room for the pie.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "huJaRMiUg-6vpjb-9VReiw"
  },
  "p8G8DGHrR47rxc2Npzy23A": {
    "date": "6/3/2018",
    "text": "Great food and a great kids selection on the menu, been here multiple times and always had a great experience with food and service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HxN88DFJXcvCGOwXL53U_Q"
  },
  "BrDAGazR-LNpFgduvhfuhQ": {
    "date": "11/20/2017",
    "text": "Nice place to go for a date. Fine dining, fresh food, good atmosphere. I had steak shrimp and fries. Its so good. #SteakLovers",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A1zgkpi9wxz3aUmuWDCUuw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A1zgkpi9wxz3aUmuWDCUuw/o.jpg"
      }
    ],
    "user_id": "RI3Rv0IsonL1aJvgdu7bDQ"
  },
  "Fn1WuJ0IsxPMKlXFRWWjZw": {
    "date": "5/13/2018",
    "text": "This review is for my dine in experiences at Charlestons. As can be seen in a previous review I'm no fan of their \"To Go\" service. Every time I've had a sit down meal at Charlestons I've left satisfied with the service and the food. The waiters are always helpful and friendly. Most of the time we order entrees that are no longer on the menu. My daughter religiously orders the chicken and ribs combo. She loves this. I'll order the same or a sandwich.  The food is always consistent and delicious. The only dessert we've had is the bread pudding. It's so good that we've never thought of ordering anything else!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tfBmMq_H3jdyUVxt3bop5Q"
  },
  "GnFtF5E_fQLYQztPRkpPAQ": {
    "date": "4/27/2018",
    "text": "I can't say enough good things about this restaurant. I can only come to Charlestons when I'm traveling and after a year I'm back. I have been here a week and been to Charlestons for dinner twice and lunch once. You can't beat this restaurant for: fresh, great tasting food, preparation and quality for the money. I don't mind paying money, but it needs to be worth it. When I've had a long day of working and I need a meal that will be fresh, taste great and I won't be disappointed, I come the Charlestons and they never disappoint. I usually do curbside and the service is impeccable. Nice, friendly staff that put your food in the backseat and actually seem to like their jobs. Today was lunch and I went out on a limb and ordered a new item. Ceasar Salmon salad. Delish. Look at the pic. Comes with that beautiful honey drizzled croissant and the greens are actually GREEN and there are a lot of them. Real Parmesan cheese shreds (not that horrible can powder), fresh firm tomato and crisp red onion and cucumber. Don't get me started on the scallion dressing! The salmon was also great; tender, moist with a beautiful char. Just opening the container at work and the picture is a feast for the senses. This is what good food looks and even better tastes like. In a time when so many restaurants are all hype and no substance and they seem to do nothing more than take your money and you feel robbed from the experience, Charlestons after 10 years has maintained and continually exceeds my expectations. I don't like to think I'm picky, but I do expect that when I pay my money, the effort expended by the retailer should be evident. Go, eat, enjoy. You won't be disappointed. By the way, my fav item: Catfish with French fries and broccoli or glazed carrots. The side salad with the garlic dressing is bomb as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UKgs3FjWyCMiOBLqI7cvcw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UKgs3FjWyCMiOBLqI7cvcw/o.jpg"
      }
    ],
    "user_id": "0Y6MiTQqUyoee-6G0vYuCw"
  },
  "kqG4Hin-BGlO-wCh_DZ-7w": {
    "date": "6/4/2018",
    "text": "Family group of 9 celebrating 2 birthdays. We have been here before and the service was spotty and food inconsistent. Food ordered came out wrong for 2 people. The salmon and replacement salad was wrong too. After we paid the bill the server asked if celebrating anything. To late, it w have been nice to ask when we were seated.   Sorry Zoe I am not interested in filling out your Corporate paperwork on a complaint. You have the details to complete it. Thank you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mWUek-IxvQUBO-LXjeC7-g"
  },
  "G_LJ9dS-Dqd6XmuEqt2Teg": {
    "date": "5/15/2016",
    "text": "Chicken. Fried. Steak. Do it. Only a few places in AZ do this dish right and Charleston's definitely is one of them. Coupled with delectable red potato mash and grilled candied carrots, the portion size is more than generous. I like to get the dish with a side of fried okra for a taste of southern goodness. The chicken fried steak is literally the only thing I get here, but I am sure the rest of the menu is as tasty.   Service here is also pretty delectable. The grub buddy and I never have to wait for a table and are always greeted with a smile. The waiting staff is always on fleek with drink service and always make sure we are good. Decoratively speaking it reminds me of my grandma's 80's dining room. This is okay because it actually fits the clientele.  Remember - chicken fried steak. Try it and be satisfied.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "OYIO1QpF56vpK9s7Jy86hQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Chicken fried steak = deliciousness",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OYIO1QpF56vpK9s7Jy86hQ/o.jpg"
      },
      {
        "img_id": "GYjUQ5OsC34_u5caI6mAEw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Nom-a-licious fried okra!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GYjUQ5OsC34_u5caI6mAEw/o.jpg"
      }
    ],
    "user_id": "3f7WGTPkj1a8cIWewDFUrg"
  },
  "d0c840vcEzCTuGjaLvsHVg": {
    "date": "4/26/2018",
    "text": "Seven years in this valley and the majority of the steaks I have had at restaurants are lousy.  But this place impressed me... best steak dinner I have had in a restaurant in years!  A bit pricey, but if you want good service and a great steak, this place is a winner, IMHO.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZnzeYusvU172cfMjYC9xA"
  },
  "-fV5ye9A472ZHPcauhPM8Q": {
    "date": "8/13/2018",
    "text": "Food was good, Fly in water awful. Waitress took glass away like it was not a problem. Fly in water is disgusting.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "95-DIVbvkrLpL59lG8EVGQ"
  },
  "GXaIruTfIDvhHmxB52IKjw": {
    "date": "1/26/2017",
    "text": "My wife picked it and glad she did.  Quite good prices    We don't have these up where we're from. I'm sure we will look for this franchise as we travel.  Very  good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B51M2ak9uvsSWM1lKtKl3Q"
  },
  "7DBdJjIlBRFVY2nxl3uwig": {
    "date": "12/9/2016",
    "text": "Just stopped in for a steak and salad.  I am so delighted to find this place.  It has a great speakeasy feel usually found in downtown areas, awesome grown-up Christmas blues and jazz, just the right amount of attention from the bartender and all of this makes the price so reasonable. I will be back often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FWw6mDcVVMMwbBYAoszoHA"
  },
  "iNSxtrc5Srup648RUR3X1Q": {
    "date": "10/14/2016",
    "text": "Just got done doing a date night with hubby here. Never been to any of their locations before! We got here about 7 on Friday and there was no wait. Our server was great. Really friendly and attentive. The husband got a French dip sandwich and I got a chicken pasta dish. Both were really good! Key lime pie was for dessert. I love key lime pie but honestly wasn't a huge fan of this one. It wasn't bad by any means but there were nuts in the crust which I think through me off. All in all great night out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pmfZ-owm2mq7Pvm7ovDoYQ"
  },
  "WtZvCBwPPwfutFxgIF6qeA": {
    "date": "12/16/2014",
    "text": "The crossiants are my favorite!! This is a great little neighborhood spot my fam has been frequenting for years.  They are amazing at accommodating special occasions.  I threw my dad's 68th birthday here and everything was perfect ... And surprisingly affordable! I highly recommend the pork chops and prime rib.  Great place for a cute date night or romantic dinner.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "MdZLLes6kTGcR0lcoFgNZw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Pork Chops with Glazed Carrots and Fried Okra",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MdZLLes6kTGcR0lcoFgNZw/o.jpg"
      },
      {
        "img_id": "_TkDSlsCF2ERvMlPEhGviA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_TkDSlsCF2ERvMlPEhGviA/o.jpg"
      }
    ],
    "user_id": "YspKuEXxYxaS7bPmYfsr7Q"
  },
  "LiZyeLDOxDvllSeOaPyaxQ": {
    "date": "5/10/2015",
    "text": "Checked out Charleston's for Mother's Day lunch. Called the night before to see if they were still taking reservations, to my surprise they were. Was seated shortly after arriving. Restaurant was busy but not crazy busy. Wait staff very attentive. Started with the Cream Spinach Artichoke Dip-yummy & a great start. My mom ordered the 10 oz. Prime Rib & loved every bite of it. I ordered the Famous French Dip-deeelicious!! Wait staff very attentive, the only thing that was odd was the waiter leaving the check before we were even done with our meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2s-UBqEKUeSm1Be02XKKRA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Famous French Dip w/fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2s-UBqEKUeSm1Be02XKKRA/o.jpg"
      }
    ],
    "user_id": "egybhvOhHyl4gjmqvjXtow"
  },
  "Ykt7hV0youaUltWblIPSTQ": {
    "date": "7/7/2015",
    "text": "We regularly visit this restaurant because of the friendly service, tasty food and excellent happy hour food options. We love the cheesy and buttery Shrimp Cargo appetizer that is served with toasted bread. The Chicken Club Salad is my favorite main course. It comes with one of their warm, soft and delicious croissants.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MVtyimcamIlDCJHWvv5dqg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Shrimp cargo - delicious! Must have",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MVtyimcamIlDCJHWvv5dqg/o.jpg"
      },
      {
        "img_id": "H7YjHBlcXq0I9nn70z-BXQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Brownie Sundae",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H7YjHBlcXq0I9nn70z-BXQ/o.jpg"
      },
      {
        "img_id": "XTADASb6gy0PdixYAPt6tA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Chicken Club Salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XTADASb6gy0PdixYAPt6tA/o.jpg"
      }
    ],
    "user_id": "6iNK8f0Y10Uy-bZjkGYU5Q"
  },
  "yrHcn6as7YtyBd7f14o3uA": {
    "date": "12/28/2014",
    "text": "My parents have been raving about this place's bread pudding for a few years now, so they brought me here for a special occasion. It's an upscale chain, apparently owned by the same folks who own Krispy Kreme, but they seem to go out of their way to make it a classier Southern-themed dining experience--good atmosphere, no pictures on the menus, professionally dressed waitstaff, etc. We'll get to the bread pudding in a minute (spoiler alert: worth the hype), but let's start at the beginning...  The service was top-notch. My dad had to cancel our original reservation because everyone in the family got sick, and they were very kind about rescheduling it and cutting our number from 8 to 3. When we arrived, he asked if the girl he spoke to (Michelle) was there in order to thank her. She caught us on our way out and was very sweet to my father. Our server (Vince) was great! He was friendly, warm, and patient with me changing my mind 3 separate times in the same order.  When I asked about the fume blanc wine, he brought out a sample for me to try. The busser who brought out our food was also incredibly sweet. The overall niceness of the employees makes me think that this corporation treats their staff well...I hope that's the case.  I enjoyed the food. The place, as a Southernish joint, isn't vegetarian-friendly, but it's doable if you eat fish. I ordered the catfish platter (grilled) with glazed carrots and fried okra. The fish tasted really fresh, which is always surprising to me in the middle of the desert, and the sides were awesome. Too much fried okra, but I'm not complaining. Mom got the fried catfish with coleslaw and fries, and she said the fish was great. Although I don't especially enjoy coleslaw, they make theirs with jalapeno, and it was actually pretty good--different. My dad got the filet mignon with fries. He said it was a little tough but seemed mostly happy.   While dinner was fine, the dessert was absolutely killer. Oversized desserts of the variety that you find at American chains are a secret pleasure of mine, and these delivered. The key lime pie \"slice,\" which was more like a quarter of a pie, was awesome, with a giant mound of fresh whipped cream to top it off. The lime component rode that sweet/tart line just like good key lime pie does, and the crust, while a little thick, was delicious. The bread pudding won the day, though. It was basically a slab of battered and raisin-studded croissant (yep) floating in a frothy cream sauce tinged with nutmeg and cinnamon, served warm. While we were too collectively full to finish both desserts, we did a pretty good number on them.  Overall, a nice experience. My parents are a little picky and they LOVE this place, so it's a good place for family celebrations and special gatherings. I even saw a few toddlers running around, so I'm guessing they have a kid's menu.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jSVzIYYV90612U-5Cp0lqA"
  },
  "Z541HQ2gwnJNFOyvi8ry1A": {
    "date": "4/1/2015",
    "text": "Prime rib celebration dinner with my husband, newly married and our best friend visiting from out of town.  You can count on Charleston's to provide, excellent service and consistent quality food preparation.   Though it may be a chain, I have not had a bad experience or meal here. The menu has a great variety.  The restaurant makes for cozy casual dining and conversation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rove-_SK-PAezQPQS7cnaQ"
  },
  "mQPDQHHHS24Epm9iN47RkA": {
    "date": "10/31/2016",
    "text": "We had our 35th anniversary dinner there last year.  Liked it so much we came back for our 36th anniversary dinner this year.  Worked it out ahead of time with Nadia (GM) and our waitress Emily was awesome.  We each had a wonderful meal, I know that when we go to Charleston's that whatever is on the menu is going to well prepared and tasty.  I rarely order pork chops anywhere but Charleston's.  And we found that they have a very nice Gluten Free menu available as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1qH90q9YO9e2j-ZyJzP3rA"
  },
  "me2S-kvisjdUmeb2LIkpzQ": {
    "date": "2/11/2015",
    "text": "For a chain, Charleston's is solid. I've never had a bad thing there and the portions are huge. That being said, they are a little pricey. You can't really walk out of there without spending at least $20 a person. Now the good. Get the spinach salad, it's always been my favorite, along with baked potato soup. Make sure to order some of the croissants if you didn't get them with your meal, you won't regret it.  This last time I decided to deviate and get the salmon. Delicious! The sauce on top and cucumber salad perfectly complimented the dish. Would definitely order again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DHu4abGno6YyLe7Pl2WgYg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DHu4abGno6YyLe7Pl2WgYg/o.jpg"
      }
    ],
    "user_id": "agVGgwvX8dnyvooYSTJc-Q"
  },
  "0vX7s8YtHwA5EGsvPvVtsg": {
    "date": "4/21/2016",
    "text": "What can I say about Charlestons other than they have the off the chain pork chop dinner with veggies that is seasoned to the hilt, just perfect.  The baked potato soup is like no other that I have had..this is our Friday date night go to",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "j8QeU8dE-Pvaz81UiGURuQ"
  },
  "jyRsX2tRlqgwW2RYBmcMrw": {
    "date": "12/2/2016",
    "text": "My favorite steakhouse and the bread pudding is to die for and addicting.  Very causal yet elegant place. Great for any celebration or just dinner before the show.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "weN7yBj5QkWC2gnXBMT87A"
  },
  "HDEtWJoZuP87O8CmyXZ1LQ": {
    "date": "1/3/2013",
    "text": "They guarantee have the best croissant in the valley!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LKtYA5j_GQ4Rz5_Dsz9asA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. The best croissant with honey butter dip! Awesome!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LKtYA5j_GQ4Rz5_Dsz9asA/o.jpg"
      }
    ],
    "user_id": "tM84r9rP7XTjX4SnRzviMA"
  },
  "xf58Z082CWQcwpZuD_84uA": {
    "date": "8/21/2016",
    "text": "One word! AWSOME! Great service from door to table- great food! Great wait staff, works together as a team keeping seamless customer service!! This is what HOSPITALITY looks like! Keep doing what you doing! Thanks for another great experience! Had fried Catfish Platter w/ fried okra! Yes crisp! Hubby had Rib & Chicken combo w/ fried okra and vegetable medley done but firm! Aaron was on top of things! Thanks Aaron from the Chandler AZ location!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n1f9AZiLg9doQmyLtU3zmw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Catfish!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n1f9AZiLg9doQmyLtU3zmw/o.jpg"
      }
    ],
    "user_id": "5ewUpAmp89fEQ65E9WfZzw"
  },
  "MZqzjpxUr4Bw782V8QbRew": {
    "date": "6/14/2013",
    "text": "Came here for a business dinner looking for some reasonably priced steak... which is exactly what we got. Service was excellent.  The group ordered - Fried okra : some pieces were not edible due to the rough skin. - Chips and guac : chips were eh but guacamole was delicious. - 10oz prime rib : it was OK... a bit salty but I liked that the 'dressing' was on the side. - chicken and ribs : what a huge portion of food for $22 !   Had a nice time but nothing too memorable here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XwMZ4qe0Icf7csxWJ-Wm6A"
  },
  "t4TgX7bkIIKhWVr9EAvlhA": {
    "date": "2/28/2016",
    "text": "My boyfriend and I went for a late dinner around 8:30 pm on a Saturday We were immediately seated and greeted by our server right away.  During the course of our meal, we must of had 6-7 staff come by to either fill our waters or to ask how are meal was or could they get us anything else. What great customer service and team work. Oh yeah, we both enjoyed our meals very much.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "oF2FU1q-WYPPVcwfdwSU1A"
  },
  "Ypr8lU7m1Lim2NcDKKBhCg": {
    "date": "12/27/2016",
    "text": "Been here a few times for lunch. Love the pizza appetizer. If u like ranch get a side of ranch with it.   Wife usually gets the crispy chicken salad (it's big could easily share it). I like the chicken sandwich. I've heard the prime rib sandwich is good too. Fries are awesome, very crispy shoestring style.   Service is always above average. A little pricey for lunch, but the food is good so that takes some of the sting out of it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FqfwEuqPk0Z2RUcr9j5X3Q"
  },
  "1Ke3eRqUUOSMQ3l77yvbUA": {
    "date": "9/10/2017",
    "text": "Went here for lunch about a week ago with my boyfriend and I was slightly skeptical at first.  I got the burger and he got the shrimp scampi. Our waiter was helpful, considerate, and always quick to get us more water. The food was spot on and absolutely cooked to perfection. Will definitely be returning in the near future!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6nGmWVTVbWdI2U0wXLGoKA"
  },
  "50CL5AQm449A38mJ3w3nNw": {
    "date": "8/1/2015",
    "text": "Date night and we decided to try a new restaurant. I was immediately pleased when we stepped they the door and the ambiance was exactly what I needed. I ordered the Parmesan Chicken and my husband ordered the Filet with mashed potato. My fish was excellent. Everything was just right. We will definitely come again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q_ywyzdD-1ewzE0Hvg4BGA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Parmesan Chicken with Angel Hair pasta and mozzarella salad.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q_ywyzdD-1ewzE0Hvg4BGA/o.jpg"
      }
    ],
    "user_id": "Unz9mzzXuHaRgtsEpbfOuQ"
  },
  "2C14f6nhIpIeRQxbHo877w": {
    "date": "8/1/2015",
    "text": "Came for a date night and was pleasantly surprised by the ambiance. I ordered the Filet with mashed potato and my wife ordered the Parmesan chicken. We both enjoyed our meal immensely. This will be a regular date night spot. We ordered a basket of  honey croissants to take home for later. Best part was dinner didn't break the bank.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rZFjSl7WOJhVlWnoMlVWmw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. 7 oz Fillet with garlic mashed potatoes...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rZFjSl7WOJhVlWnoMlVWmw/o.jpg"
      }
    ],
    "user_id": "ICeh9E8eBbDQcAzE2uGFTQ"
  },
  "8TUByBH3UeCNApYbNvMVQw": {
    "date": "3/8/2019",
    "text": "Great food and ambiance!!  We ordered the impossible burger and kale salad.  Both great!  A place you should check out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mHN9I6zirKRBVHmuz91Mmg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Key lime pie...amazing!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mHN9I6zirKRBVHmuz91Mmg/o.jpg"
      }
    ],
    "user_id": "NzAGdDh3SW6FDabRA5CgMg"
  },
  "sG4KEqec0r6kiNT7dejauQ": {
    "date": "11/24/2018",
    "text": "Made reservations and was seated right away. Love the flickering gas lights and warm ambiance. The waitress was very nice and prompt. The food was delicious!!! From the ribeye, prime rib to the salmon, everything was seasoned, tender and just wonderful. The portions are generous and be prepared to bring some home!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jUg9Nk-YbFZorL0N9SL-pQ"
  },
  "7R7B1R10d3fgtbpfnbaLrA": {
    "date": "3/16/2019",
    "text": "Always the best service and food. Seriously everyone you come in contact with here is genuinely kind and helpful. The food is amazing. This is one of our favorite places to eat for any occasion!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqgqz1t1n3gy8i57QdnFXA"
  },
  "rW9fs9b79e2-h69KsxKY_Q": {
    "date": "3/16/2019",
    "text": "Everything was SO good except for the shrimp..pretty fishy and salty..carrots were AMAZING!!! Jordan, our waitress, was super sweet and even cracked some jokes :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Uv0NyWKHExkFGU97ivhfPw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Top sirloin and my boyfriend had a filet. I added on a $9 shrimp skewer and swapped the potato for sweet glazed carrots",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Uv0NyWKHExkFGU97ivhfPw/o.jpg"
      }
    ],
    "user_id": "rYQutblDDzKkVI0RJKvv5g"
  },
  "9yZgHj3T3PG2gekfHYft6A": {
    "date": "1/11/2019",
    "text": "What is it with Charleston's waiters at this location not writing down the order?  Every time we get our food it's wrong. Where is the management in this place?  Why are they not correcting this behavior???",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nEpTVwM65AC3tSL4rCTFiQ"
  },
  "r-9nnc_dDEWcoulGAjBZIA": {
    "date": "11/14/2017",
    "text": "I knew going in that this was not my type of place but I was with a friend so I gave it a shot. It is extremely dark on the inside and the food was not terribly good. The chicken was alright (moist and had some flavor), but I was not impressed with the ribs or mashed potatoes - seems like they might have had mayonnaise in them. That doesn't mean the other food is not good but I didn't enjoy what I had.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LwHeiiKizdv8_zxutrOndQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Half chicken, ribs, mashed potatoes, veggies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LwHeiiKizdv8_zxutrOndQ/o.jpg"
      },
      {
        "img_id": "hqar-7Pm3ZavZ8mERO8HFA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Croissant",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hqar-7Pm3ZavZ8mERO8HFA/o.jpg"
      }
    ],
    "user_id": "u3rRXtoRxE5W1O19yVfslA"
  },
  "sjLTiZk9YnZGS1pJo1pQyA": {
    "date": "2/8/2019",
    "text": "The service is absolutely AMAZING! The food is also delicious. Our server was Taylor J and she was such a sweet heart! All the servers work great together and we just overall had the best service with great food quality!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S28NcJZkFjFleh_z5FHreg"
  },
  "1WRBns2rg2I4ufbpwU_T6w": {
    "date": "6/4/2018",
    "text": "Delicious large lunch menu. Five star service. The meals were coursed out like a fine dining restaurant. The waiter knew just when to bring out the salads after the appetizers. Unlimited refills on soda kept appearing without even asking. The wait staff was team service so everyone was willing to help out. The portions were large for me so I had plenty to take for left overs. The entire restaurant was busy but didn't seem overwhelming or noisy. Great for lunch. I look forward next time the dinner and desserts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O62SNmc_eAi_0gro5mbMSQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O62SNmc_eAi_0gro5mbMSQ/o.jpg"
      },
      {
        "img_id": "loDwFvbWX9_m8-3Ed144uA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/loDwFvbWX9_m8-3Ed144uA/o.jpg"
      }
    ],
    "user_id": "8WDGMSf1nmtUI0RP1faSUw"
  },
  "yMMDSz3FZXr09m9TkyxSiw": {
    "date": "1/31/2019",
    "text": "Went here for lunch. The food was absolutely amazing! Everything made fresh. I had the chicken enchiladas and my husband had the catfish. The food was amazing. The staff, just as wonderful. Looking forward to coming here for dinner very soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vKFdIiSUW7RwMmsXzjWAMA"
  },
  "dTg62fFKtqTOWiSp_8tZLA": {
    "date": "6/26/2018",
    "text": "We've been here several times, and the food, and service has been great each time.  The waiter has offered suggestions about how to tweak a menu item/better pairing of sides.  Get the chicken fried chicken!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IwH5ohXxHeCrFhdVwY6AfQ"
  },
  "0N2u3AGI_uHsuC1rXvuMww": {
    "date": "2/2/2019",
    "text": "Hubby and I came here for lunch specifically because they have the Impossible Burger, which isn't the easiest thing to find in Phoenix currently. The last time I'd visited Charleston's was about 10 years ago at a location that is no longer open, and so when we arrived I remember wishing I'd dressed a little better because the ambiance had a \"classier\" vibe than I recalled. Our server was amazing, our glasses were never empty before she was back with another refill. We started the meal with a side dish as an appetizer because we wanted to try the fried okra. Holy moly was it good! Perfectly cooked, perfect texture and flavor. For it a side dish, it was also a pretty large portion.  For our entrees, as I mentioned, I had the Impossible Burger, hubby had chicken-fried chicken. The portions were large and very satisfying. My Impossible Burger was the best I'd had of all the places I have tried it, including multiple spots in the Los Angeles area. The toppings were fresh and plentiful, and the fries were crispy and well seasoned without being too salty. My husband's chicken was perfectly cooked with a delightful crispy fried texture. The mashed potatoes it came with were homestyle and had actual chunks of potato in them which made them feel and taste even more authentic and perfect for any comfort food craving. Since there was so much food, we both wound up bringing home leftovers and they were awesome when we finished them later in the day. Overall we were surprised how much we enjoyed our meals and would definitely return to Charleston's again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TzfCd4D3e3hr-858wlv2ww"
  },
  "ohVehmem2KKqYXdIoW-l1w": {
    "date": "4/5/2018",
    "text": "Meet friends here for lunch and hand a wonderful lunch. One of the nice things is that they gave us enough time to visit and dine without being pressured to either order or finish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DJ_-Shpn0Ja8f24CN06TGQ"
  },
  "SGdd1IIuz27oCzmP0PFjnw": {
    "date": "4/7/2018",
    "text": "Delicious food we need for our unexpected overnighter in Chandler. My boyfriend ordered the 20oz prime rib with a potato and ate it all up! The banana pudding was to die for! Our server was so sweet and made sure we never reached the last sip of our water or iced tea without another one on its way. Definitely a good steak house, and would stop by again if we passed through Chandler again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g1Oi31ftr6wI83qiKMnZ0w",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g1Oi31ftr6wI83qiKMnZ0w/o.jpg"
      }
    ],
    "user_id": "4LSTp8OeAL_GRP-rDjz2hQ"
  },
  "E5Qmc5B4KDq4CbYKowou6w": {
    "date": "11/21/2018",
    "text": "We had been given a $75 gift card from Charleston's from corporate last April. At that time our experience was not so great. It took awhile to decide to try it again. Last night we went in and had the very same waiter, Ace! It is a good sign that he is still there after all this time. We remembered him and he remembered us. Once again the service was spectacular. Pleasantly, our dinner was also good. Thank you for restoring our faith in Charleston's. I had the grilled trout and it was delicious. My husband had the soup and salad. We both loved the dynamite shrimp appetizer. Thank you to Charleston's management for responding to our previous review with gratitude and generosity.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vn5wc4JriErO-iYy_jFHNg"
  },
  "g7TibNC9IdZyuI9EU7Sy7A": {
    "date": "11/3/2018",
    "text": "We came here for a romantic dinner. And it was so nice! If I could give this restaurants 6 Stars I would. Our server James is on top of his game! Steak prepared perfect medium rare, order the salad and they split it for us, and the dynamite shrimp is to die for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N_DPOQuIBjI2e6aqWXB0WQ"
  },
  "L7ibBvxjdXW6uiLU2yug7w": {
    "date": "2/25/2018",
    "text": "We were told twenty minutes for wait time, it was forty. The restaurant is dimly lit for mood lighting, and was very loud. Food was good but not the best, it is priced at what it is worth so a good place for a more inexpensive steak dinner for two. Bread is only served before the meal if you request it. Meal took a very long time, we waited close to an hour for our entree to be served so I am glad we finally asked for bread during the wait.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AknZ2JBSKYWbOKbf66AdjA"
  },
  "qQvI5V961HSIlHYgDFCfjg": {
    "date": "11/12/2018",
    "text": "Love this place.  Service prompt and attentive.  Ribs are the best ever.  Bread pudding off the charts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9aMsZVq443BwgYHhlWkwww"
  },
  "7uXsVY5WFyMv5Vx9-Pru3A": {
    "date": "1/11/2017",
    "text": "Took my Mom here while she was visiting this summer, I'd only been for apps before because the Mr loves a dish they call \"shrimpcargot\" (it's unique and tasty for non snail types ;) We were seated early for our reservation, and both the hostess and waitress wished Mom a Happy Birthday. Nice start!   Mom enjoyed her glass of Pinot Grigio, my dirty Belvedere martini came with blue cheese stuffed olives and was on point. The loaded baked potato soup was good, but they put the bacon I requested left off in. My blackened Barramundi was perfectly executed; Mom loved the shrimp scampi, and Scott had a steak that was cooked to his liking; it was an enjoyable dining experience; we were not rushed, water was refilled regularly, and plates cleared in a timely manner.   Service was very friendly from start to finish, and they did offer to sing Happy Birthday. We declined, but shared a very tasty Key Lime pie for dessert to-go, without fanfare. For food alone this would be a 3.5* review; they aren't doing anything revolutionary, but it was a good meal. The service was 4* and I rounded up because of it. We have already and will continue to return for \"shrimpcargot\" and the catch of the day.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 8,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "RKoGCFyyZ-h9_mAJxXuMfQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. 1/2 dinner salad with honey croissant 4.25.17",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RKoGCFyyZ-h9_mAJxXuMfQ/o.jpg"
      },
      {
        "img_id": "f34ZIuHAJJXXKSCCONGl4w",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Blackened Trout w double veggies subbed for rice 4.25.17",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f34ZIuHAJJXXKSCCONGl4w/o.jpg"
      },
      {
        "img_id": "XX2D9QM9cF63TuAf3z5qmg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Shrimp Scampi 4.25.17",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XX2D9QM9cF63TuAf3z5qmg/o.jpg"
      }
    ],
    "user_id": "eZfHm0qI8A_HfvXScwIYsg"
  },
  "_u9VYMYqiqK_GfsuU_eamg": {
    "date": "1/17/2018",
    "text": "Ice tea appears from nowhere! I ordered tea and our waitress was so on top of it, I didn't even realize that I NEVER RAN OUT OF TEA. Downside: I had to go to the restroom a million times. My salad was delicious, and quite large, but $17 was quite expensive for a lunch meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D9u6XuVDtC2gxEQ4BUOaTA"
  },
  "PHgUXwIJ8vttAB7wZpTSsA": {
    "date": "6/21/2018",
    "text": "Came here last minute for a graduation party because the wait at Texas Roadhouse was wayyyy too long. Not only did they accommodate a last minute party of 15, but the service was great and the food delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDWjJP86iQIOOfatz-tqGg"
  },
  "4UISIMqJbV5gso_8DfkssA": {
    "date": "8/19/2014",
    "text": "I went to Charleston's with my family. We were seated promptly which is always nice with kids. My husband ordered a glass wine, which he enjoyed. We ordered the spinach artichoke dip as an appetizer. It came out hot and was good. My husband ordered the salmon as his meal. It was slightly overcooked but was still good. I had the shrimp scampi and it was good. The atmosphere is great here. Very quiet. The server was always on top of everything.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XJb30QLqNPVzSBnOb52JqQ"
  },
  "R1RHtyimg0na1P-g8mcvAg": {
    "date": "2/13/2016",
    "text": "2 stars - food only redeeming factor. Hostess staff was rude because of our lack of reservation. Can't find anywhere that a reservation is even suggested on a Saturday at 4:30... Ended up sitting in bar area that was overwhelmed (1 server) while main room was fairly empty with wait staff standing around waiting on nonexistent reservations. Won't return, the trouble isn't worth the pub fare.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qGbjvgddoqu9EV5591Xg3A"
  },
  "tJNbdbc8iTXt_uL55EJX_A": {
    "date": "2/9/2013",
    "text": "We come here every couple weeks, because it's close by, the food and service are consistently good, and because my son is nuts about their ribs.  To put finer points on all that, let's start with the staff.  They are always, to a person, extremely friendly and attentive.  I've never once experienced a dud.   Your soda and water glasses will never go empty and they'll always serve with a smile.  Now, the food.   My only complaint here is they don't do half-sandwiches, and I wish they would, because the portions are huge and there's only so much anyone needs to eat at one sitting.  But they are good.   The ribs are probably one of the best things on the menu, and frankly, they blow away the crap served down the road at Rudy's and Can't Stop Smokin'.    Now, are Charleston's ribs barbecued for hours?  No, they're grilled, but they're amazingly tender and flavorful and they taste *good* every single time.   The croissants are like little pillows of heaven.  I don't know how they do it, but i have never in my life had croissants as good as these.  Last night I tried the Walt's Champagne Chicken salad for the first time.  WOW, what a nice, flavorful, balanced salad.  I'll definitely be doing that again.  The potato soup is to die for.  The ambience of the place is fairly typical suburban upper-midscale.  It's casual, but if you're wearing flip-flops and pajamas this place isn't for you.  Frankly, no place is, but this place for sure.     Two thumbs up from me...this place is a winner every single time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "s7xT3jT_BZQiYAaNR9iDTQ"
  },
  "DRwidoMH6w2yaX8KSE7EAQ": {
    "date": "12/29/2012",
    "text": "Only been here once but I will not be back so here is my review. While the service staff seemed very nice the place smelled like stale beer. Kind of a dump really.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NMsQI4tzxTi12Oh8GkNglw"
  },
  "vlhpj8i8EsjvRaWvCJS7Xw": {
    "date": "9/5/2010",
    "text": "Charlestons has got to be by far one of my favorite restaurants. First of all, its not very expesive but gives the illusion of a high class nicer restaurant. The service is impeccable and the staff really does care about the customer. They will comp a meal if they can tell someone is not happy with it. They also work as a team so your drink glasses never go empty. I also love the fact that I have never had to experience screaming kids. For some reason, I think people don't consider this a kid friendly restaurant which is fine with me!  But my favorite thing about Charlestons is definately the food!!! I am absolutely in love with the Walt's Champaign chicken salad and their croissants with honey drizzle are incredible! I have tried several other dishes here so here are my other recommendations:    Chicken salad sandwich - huge and just a downright good sammich, Chicken club salad - This is the hubs fav salad. Totally a man's salad with fried chicken, bacon, avocado, cheese, and make sure to order with lots of ranch dressing to clog your arteries even further Rigatony Bolognese - For not being an italian restaurant, this dish was still amazing. Creamy and a little spicy. Huge portion also Over Roasted Chicken - One of the best chicken dishes Ive ever had! Order with the mashed potatoes (very good consistency and flavor) and the baked beans (dip the chicken in the beans... crazy but sooooo good) Prime Rib with mashed potatoes - Ive have never had their prime rib but the hub says its one of the best he has had and is consistently well trimmed and has had good flavor each time he's ordered it.   A few other things worthy of mention:  Maryland crab cakes (full of crab and the apple relish served with it is fresh and a really good accompanyment), and the creamy chicken noodle soup (only served one day a week but this is the best chicken noodle soup Ive ever had and I really dont like chicken noodle soup! I would eat this shit even when I am not sick!)  And the last, most important thing to remember if you go to Charlestons: YOU MUST ORDER THE BREAD PUDDING!!! Yes yes, I saved the best for last. This bread pudding is the best bread pudding you will ever have. I have converted many a bread pudding hater (myself included) with this bread pudding. Haha. Take my advise and you will be glad you did. I expect a thank you!!!!  So to sum it up, Charlestons may be a chain restaurant but I believe its one of the best chains out there. Every time I eat there, I am content with the overall experience. Try this restaurant and their bread pudding and you will not be sorry!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "F10QJk-i3IrUxKcJI9CF-g"
  },
  "TEN1JoJCNn73eJGK53SMxQ": {
    "date": "11/4/2013",
    "text": "Try the Grilled Trout!  It's awesome.  Veggies are fresh.  The service is always good, not matter how busy they are.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WZ93QN41FtniOEAIWBagHQ"
  },
  "7nA1ydd973bDmZ4M3JGFnQ": {
    "date": "1/1/2016",
    "text": "I went there on news years eve. They were incredibly busy and I still got the best service. The staff was so polite and nice. And of course the food was amazing as always. Our waitress markie was so funny and attentive. I had the best experience!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8A4YA2rdbqMUgKkUjkoQDA"
  },
  "lGCGYbotuAdDfZV365Pm2Q": {
    "date": "4/25/2011",
    "text": "Went here a couple more times and have to downgrade it to 3 stars for the food and service.  Nothing in particular... just overall not as good as what we experienced the first time we went there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tsm8VraTp5OGyVALtUiCeQ"
  },
  "fUq03NP09UYxravwMiuUgg": {
    "date": "5/31/2014",
    "text": "This place is consistent... great service & food. Comfortably elegant atmosphere. The bar is wonderful. Really welcoming and they make drinks with fresh squeezed juices. Last night our very fun bartender (Brian) made us his original concoction of something that tasted like a liquid creamy version of a thin mint girl scout cookie. Very nice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oSpOxJ6jKG0lB5xPwPHuTA"
  },
  "pw4N9H08d-zYurseuRmW7A": {
    "date": "2/14/2014",
    "text": "This is  one of our favorite restaurants & we take out of town visitors here & they love it too.  Order the carrots as one of your sides & the croissants that come with the salad are fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NfyGzeltwmZ5-e0kpcgfYw"
  },
  "N8eegUN4LcB4_DmXWhsv3A": {
    "date": "11/11/2015",
    "text": "Never left disappointed. Prime rib is the best in town. Cannot beat the garlic mashed potatoes either. But always ask for the specials,because those don't disappoint either ! Don't sneeze at a restaurant known for steaks serving ribs , because the smell with please your senses when you walk in, and if you order them, your stomach will leave happy . great drinks as well! Definitely a crowd pleaser in every way.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "820E85fKcsoHYD_VKEpGBg"
  },
  "8c7_tpkVo0n8FGAJronHIQ": {
    "date": "6/15/2012",
    "text": "Heard that Charleston had the best roasted chicken ever and I was craving it. So made may way there and the waitress recommended I try the chicken rib combo, OMG this was an incredible meal, they did not disappoint. Later I had one of the best Key lime pies ever for dessert! Wow, I will absolutely be a regular here when I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "KtNGMeHmCpagrTTqcfBcgA"
  },
  "qTJbMsdb1isBqEFOWGofSw": {
    "date": "4/9/2015",
    "text": "Wonderful service. Friendly and not too intrusive.   Very nice atmosphere.  Menu prices are very reasonable for the quality.  Great salads.  Most of the food I've tried I have liked.  Just wish there were a few more menu options and that the menu better described the content of dishes (I was surprised there was meat in the bean side).  Try this restaurant.  You won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GM8UvCKjwp9ggTybI2PANg"
  },
  "SkVtyYaW2Y5HYQ95GHQeXw": {
    "date": "6/18/2010",
    "text": "My Cajun friend who says he knows his ribs, thinks Charleston's baby backs are pretty good.  The ribs certainly were tender and falling off the bone, though I was mostly concentrating on the okra side.  I love fried okra... and they give you alot!    My boyfriend got the prime rib sandwich, I thought it was going to be shaved meat... literally it's a steak in a loaf of bread.  I wish they gave us some horseradish, forget the bread... just like a steak dinner.  :)",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Mz3ZAFChRgBMgaaB5sJU_Q"
  },
  "-7tNjGhfDa-4zL06MA0JIg": {
    "date": "5/10/2015",
    "text": "Amazing food and service. We ate here last Wednesday, with our friends from Canada. We've always loved the food, but our friends can be a tad particular. Charlestons didn't disappoint. I tried the cheeseburger this time, and loved it. The other meals were equally as delicious. However, the icing on the cake was our server Victoria. This young lady was honestly the smartest and funniest server we've ever had at any restaurant. Thanks Victoria, for making our night fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kvpK5ei22ejDlEBrHsWJUQ"
  },
  "DS7EISerL9sUJO1LAKaNkw": {
    "date": "7/1/2015",
    "text": "I love this place!! Literally have never had a bad experience here! Never a wait for a table, I love coming here! The Caesar salad here is amazing. The chicken club sandwich is the best! And my boyfriend got the ribs and chicken combo and loves it! Literally everyone we have brought here loves it..all their dishes turn out the way they ordered them and taste delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cW_ugvCWQ5shvIULqKVUpw"
  },
  "rNqZQYZ8r3nvBV8a8S0gUQ": {
    "date": "4/3/2015",
    "text": "Great food and always consistent, prime is always my go to or the ribs drinks are also very good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u1vAWiB5pcbpBLdEh6WWJQ"
  },
  "StW7qYHWA1c0ImhnIA2Wqg": {
    "date": "8/9/2012",
    "text": "I have been coming to this location for at least 6 years.  The quality of the food has gone down quite a lot this past year.  It used to be our family's favorite place to dine and have prime rib.  We brought some friends over for dinner last month and was very disappointed.  Also, they didn't cook the meat as we wanted.  When we complained they only offered to put it back on the grill. No apologies.  Service was mediocre and the quality of the meet is not as good as it used to be.  I am sad as i had hoped that things would be as they used to be... A quality dining restaurant.  I won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ETf8WfJWJwVGoCzbw0fAdA"
  },
  "BDkEKpLPb3_egrvXWEF8JA": {
    "date": "3/10/2013",
    "text": "Excellent food and table wait staff but that really didn't offset the 52 minute wait to be seated after being told the wait would be 20 minutes. I don't mind waiting except people that came in after us got seated with little or no wait...seems a staff person would just seat people he saw standing regardless of the wait list.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMPlJSZiWcDVDzUEB6U8qQ"
  },
  "ZZf2W4cuP-7f02WyVZISJg": {
    "date": "9/13/2015",
    "text": "Went here yesterday, 9/12/15 for my birthday with 11 other family members.  This is the first time I've been to a Charlston's.  The service was fantastic.  The food-fantastic.  The prices for what you get-fantastic.  DEFINITELY going back to this Charlston's location.  I had the prime rib-10 oz.  mixed vegetables and baked potato with butter only.  The waitress was very attentive.  Too back she's going back to Las Vegas this December and won't be around for my wife's birthday in March.  But, I told her to look for a White Castle up in Vegas.  She never heard of White Castle!!  Hope she enjoys.   Anyway, highly recommend this Charlston's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u2EW_5Obufd12PKwjnyLUA"
  },
  "TAlpLOxs5STRVNo1VOqN3g": {
    "date": "11/1/2015",
    "text": "It had been a while sine I was in Charlestons.  Now I wonder way!!!  From salad thru entree, all excellent.  Ribs are some of the best I have tried. Service was awesome. Atmosphere is warm and inviting.  Go with the garlic mashed.  Then to top it all off, bread pudding.  Next time I will start with the bread pudding, as it is incredible.  Thanks for a great dinner, and see you again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "54Bnp3XdD5NN3RfAGWQP_Q"
  },
  "EhopmNqtq6GBuoKYYXJZbQ": {
    "date": "4/25/2012",
    "text": "I was invited here by my grandparents for their last dinner while they were in town before heading back to the midwest and had no idea what to expect... but I was pleasantly surprised.  To start out with, it is tucked behind several other chain restaurants and backed right up to highway 10 (don't worry you can't hear any of the traffic once you're inside!). So if you think you're in the wrong place keep driving through the parking lot towards the highway - it'll show up eventually.  The restaurant itself is a nice, dimly lit almost wine cellar looking place. The booths were comfortable and the noise level was quiet enough to hold a pretty good conversation. The service wasn't anything to write home about but at least they weren't rude. On the other hand, their croissants that come with your meal... I almost wrote 12 letters home to my mom because they were so fantastic, but be prepared you only get one with your meal so eat it wisely (or just be prepared to pay a little extra if you really need more!). The entrees were reasonably priced for what you get. My chicken was cooked well and very filling and my grandparents raved about their ribs.  So overall: good food, ok price, and ok service. i.e. - 4 stars from me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UvHPpDRyu0_uY81FzIPOcA"
  },
  "j-14d6XWO93V69dDVgr--Q": {
    "date": "8/10/2014",
    "text": "I would give four stars, but they don't have a good appetizer selection.  Otherwise, this place is delicious.  I do confess, I come for the beef dip sandwiches which are pricey, but worth it (and big so you can share).  The salads are fresh and chock full of great ingredients with delicious housemade dressings (and their signature honey croissant which is always freshly made, not out of the oven).  Service has always been excellent too.  I am just sorry I took so long to try this place out, I think the name and location might have something to do with it.  Charleston's sounds like a southern fish place maybe and it's located behind Carraba's.  In any case, trust me, this place is very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VaCHA9gfPvcPQFJribOyw"
  },
  "HyoiqCq8MmzgoJq-UlwJEQ": {
    "date": "1/23/2015",
    "text": "The prime rib is unbelievable!!! Get it with the raw horseradish and dip it in the sauce. It is a party in the mouth!! Service is surprisingly fast, and very nice. Love a place with friendly people.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ADO8dCEIKKL28YZ5g0WSaQ"
  },
  "92x0UoI4zsCL-WqjP2G5Sw": {
    "date": "3/2/2015",
    "text": "We eat here often and it's always great food. Always great service. I would recommend eating at Charleston's to anyone looking for a great dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yToBdyMtGe_sloAEShhyrA"
  },
  "4o8QoaUuIlwY2BrBrAUSDw": {
    "date": "5/1/2015",
    "text": "Amazing!!! Coukdnt ask for a better experience then what we had... This is our new favorite!!!!! Honestly the TV commercials are right... This place is all about the customer..& the food...Becky are server was outstanding.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HpxxZ7In41IxzrSea_hsTQ"
  },
  "sM9Od6TQyDo7zvbvwn6uDw": {
    "date": "4/10/2015",
    "text": "Excellent food and service.  Great steaks, salmon, and salads!  There is a great patio to sit when the weather is nice as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fQbGuU-BSiO4_HAM2SgHQA"
  },
  "GUczIRH-K9ToWzI33vkmwQ": {
    "date": "3/22/2013",
    "text": "I came here with my boyfriend and his dad for his dad's birthday. I'm a sufferer of celiac disease, usually steak houses have a good hand full of options for me on the menu. Charleston's had it's own gluten free menu with MANY things, also the menu was an actual menu, not a shoddy old book/ring binder written in comic sans.  The waiter was more than helpful and sympathetic, making sure that none of the food i ordered had gluten or came in contact with any of it. When my plate was brought out to me, the manager, JJ, came out with it to let me know that they took extra care in preparing it and there was no cross-contamination of any kind.  I was shocked, never before have I gone to a restaurant where the servers/cooks/managers cared enough to warn me about certain options or come out to let me know my food wasn't cross contaminated. I've been glutened at restaurants before when ordering off the GF menu, but Charleston's? Not even a little.  Definitely will return. The service is unchallenged in greatness.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QN7BYngj3Pl9y_g_sj1Skw"
  },
  "TNUGVQk1axqrAf7SQjq-HQ": {
    "date": "9/22/2014",
    "text": "I've eaten lunch here about a dozen times with coworkers and the food and service has always been excellent!! I've had salads, burgers, sandwiches, and even the chicken fried steak (which was a TON of food...I have a huge appetite and I overstuffed myself until I was in pain) and they've all been delicious. Haven't had a bad meal or negative experience once. On another note, I recently needed an itemized receipt to expense a lunch from weeks ago, and after 1.5 minutes on the phone with the GM, he sent me what I needed within the hour. Great service during AND after my dining experience. I'll definitely be dining here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NNn7H8Bw8MFXn_aTpvzZCA"
  },
  "AfqfU9nuxUzCzvQfvoeQnw": {
    "date": "4/10/2016",
    "text": "This review is really 31/2 stars. Myself my wife and our 2 daughters (8&9)were visiting from Southern California. Went here on a Saturday night for My daughters 8th birthday. Called the day of and got their  first available reservation for 7:15pm. Got seated right at 7:15. The hostess was young nice and presentable. There is nothing overly special about this place. Being from Los Angeles our expectations for a steakhouse are pretty high. This was good just not really good. Prices are reasonable. The drinks were pretty good. Their selection of wine was meek. Even my daughters said that my wife's steak that she grills up at home was much better. My wife had the ribs (because there selection of fresh fish was not to be desired ) and those were pretty good. I actually enjoyed her ribs better than my steak. My NY strip which was the special was a little fatty. I don't think that we will be back again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UpQ2Ob9_jQ-OGByOB8oojA"
  },
  "9jVsFTQGnAZLMLtbY_UwWA": {
    "date": "6/23/2014",
    "text": "Stopped in for lunch at the recommendation of a friend who was craving the catfish platter. We both opted for the lunch special, a catfish sandwich plus a side. We chose the coleslaw to compliment the sandwich. Both the sandwich and the slaw were wonderful. I also ordered a cup of clam chowder. It was nothing special. In fact kind of bland to me. The service was great. My lunch was great. I will definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z7A2nWg8TFQ9kSgWdsDOTw"
  },
  "RcdRt-O8uDl571Ii_8vNRA": {
    "date": "2/14/2016",
    "text": "We finally succumbed to 4 years of TV advertising...and are we glad we did!  This is our new favorite restaurant.  Went twice this weekend and loved the ambiance, the food and the service.  My wife tried the chicken fried steak and the chicken/avocado club sandwich and absolutely RAVED that they were 2 of the best dishes she's ever had.  I had the prime rib sandwich, which was very good but over-priced at $19 and the hickory burger.  There are still 6 - 8 other dishes on the menu we want to try, so 5-stars for the varied menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PG3PXo-FP9EtIU4hMIz91g"
  },
  "QrSc0oBDlqSZsZYwwMSMyQ": {
    "date": "7/13/2011",
    "text": "I'm not going to lie, I come to Charlestons primarily for their oven roasted chicken (which is fantastic, though I wish was available in all dark meat) and their croissants, which should be outlawed for simply being insanely good and perfectly done up.  Their glazed carrots are everything glazed carrots should be: sweet, delicious, and perfectly cooked. Their mashed potatoes have a ton of flavor as well, and even if this is a done-up chain type restaurant, this place gets it right a fair amount of the time. I almost feel guilty enjoying it as much as I do, but it's really damn decent food for a relatively decent price. (I had the burger recently, which was only so-so, as they were out of my chicken, but the champagne vinaigrette salad is awesome.)  Most of the time, I get curbside takeout, which is fast and efficient, but seating inside is nice if there aren't screaming kids. The music trends from decent to absolutely awful, but I don't know how much control anyone there has over that. And it's nice and dark and comfy if you eat in.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "2AZaPPRAWhDDO7k-jlpfwg"
  },
  "b3y3Dt1QNHHHUU3lYDIBTQ": {
    "date": "2/17/2012",
    "text": "We recently visited the Charleston's Restaurant in Chandler/Ahwatukee and had a nice time.  We opted to sit in Lounge Seating versus Dining [where the Service left a little something to be desired - Hence the 3 stars] and had an appetizer that was to die for - Shrimp Cargot - and for dinner we both selected the Salmon since that was the primary reason why we went there to begin with - Per my Papa's recommendation.  In True fashion, he was absolutely right about the 'awesome-ness' of the Salmon's seasoning, moistness and overall charring execution...Delicious!  We will definitely return for this meal time and time again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B0A2Af2F7DRsvdyfz_giOw"
  },
  "T1Kwuto_VUYtmisyT49SpQ": {
    "date": "9/15/2014",
    "text": "My husband and I LOVE Charleston's!!!Always impeccable service and they have the best salmon on the planet",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SzNhV4bcxOGkH27rrVfj7Q"
  },
  "jC1Jp-O5XUCyoVSFMjPtag": {
    "date": "6/29/2011",
    "text": "It's late I'm hungry....What the heck is Charleston's?  Unfortunately, this place is located in the corner of the corner.  Yes, if you need to find this place please update your GPS.  Food was okay at best, but the service was what made me smile.  I had the Hickory Burger and my mate had the fish of the day Tilapia.... Fishy she said.  Yes, Tilapia is a fish, but my favorite was the deep fried okras yum.  The place was kind of old fashion...I wasn't sure if I was supposed to sign the Declaration of Independence or order me some Sam Adam's - Enjoy!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kjeX2RXvW7RhBbD2QLd5jA"
  },
  "hxR7HQ8jc3e8P2U09yzmyQ": {
    "date": "2/22/2017",
    "text": "One of my favorite restaurants for years .. Until last night. Now it is on 'probation'.  My wife and I arrived at 5:45 PM to have dinner in the bar to take advantage of the Happy Hour drink prices.  As I often do I ordered the ribs and chicken combo with mashed potatoes and carrots instead of beans.  My wife has the Roast Chicken dinner, which she enjoyed.  Carrots, as usual, were superb.  Chicken was good as usual.  However, after ordering ,the waitress (who will remain unnamed - actually I forgot her name - the name on the receipt I know was not hers) the waitress came back and said the mashed potatoes will not be ready to serve for another 30 minutes and asked if I would like to get the French Fries instead (they have excellent french fries).  She said she will bring out the mashed potatoes when ready and if I am too far along in the meal she will box it for me to take home.  I agreed.  1) Unfortunately the ribs were not the usual excellent consistent fare ... the meat stuck to the bones as if it was glued on.  Once off the bone the meat was tender enough ... But not much of it.  A major disappointment for the money I spent. 2) She never came with the mashed potatoes ... Not even boxed to take home.  3). She did not provide service ... The two or three times we requested help by either going to the bar to get someone or calling to another waitress who was happening to be walking by ... Someone else helped.  But our waitress was not around  and when I noticed she was getting something from the bar she did not look our way (perhaps management had too many tables assigned to her in the main dining room that she did not have time - therefore not her fault).  Another experience like this and I will assume the level of service and quality of food has changed by design (cheaper input cost) in an attempt to improve their bottom line .. Which is never good for the customer ... I hope I am wrong.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "77SrvSdh-MlK4DcS_bbEZg"
  },
  "yPfTw3vWcVY7HDOPIb3lIw": {
    "date": "1/3/2012",
    "text": "This location rocks! We've been in AZ and TX and let me tell you, they have the BEST ribs on the planet! You would never guess it, but since being in the land of the bbq nation = TX, this place wins hands down.  They also have the best spinach and arti dip around. Salads are great, glazed carrots are to die for, and honey-drenched croissants that will make you drool. Ok, now I'm hungry...Service is always top notch and friendly. Would recommend to anyone for any type of food - they have it all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p2QeZPbU4sxMqtb5Q6bnzA"
  },
  "fL7jzxFAsB9nmOhK12zMDg": {
    "date": "3/6/2016",
    "text": "I was very disappointed in my food last night my chicken club had soggy bread and the chicken breast had a consistency like it was pre cooked and heated up.  The service was good however",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EUpPNd3UffN9SjPlzRTMgQ"
  },
  "I-AWsOkdym1SsDDPrpXCQQ": {
    "date": "1/5/2016",
    "text": "This is excellent restaurant good service nice atmosphere and the best Chicken picota I've ever had. That's saying a lot because I'm an old Italian cook for the last 40 yrs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AmaiOlcwxrb6--iiZJK9Ww"
  },
  "z_FyrWK2Bc9mH38F4jHmGA": {
    "date": "3/24/2019",
    "text": "Usually when we come the service is really good. We never wait long for our food always have our glasses full, not this time. First it took a while for us to get our drinks, then we ordered our food and that took a long time. The food was good but the waitress Sue was rude, never checked on us, she just had a bad attitude. Not sure if she was just having a bad day or if she just wanted to hang in the back and talk to her coworkers. Next time sue take the day off if you in a bad mood and maybe I would've tipped you more, but what I did tip you really didn't deserve.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3DWeOWi34u7z3p4viS0Z8A"
  },
  "efwOqQcWvBsS26CZBkvkBw": {
    "date": "12/26/2018",
    "text": "Failing their attempt at being a fine dining establishment.  We were seated two tables put together for six people.  See picture of how uneven the two tables were.  People sitting in the middle had to sit to the side and crowd the person next to them.  (Looking around, at least two other tables had this issue.)  It shows a lack of basic presentation and customer service.  Table next to use was practically shouting and the music was excessively loud.  It was closer to a night club than a steakhouse.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gSbdLX1EXHwFrP6EX61_WQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gSbdLX1EXHwFrP6EX61_WQ/o.jpg"
      }
    ],
    "user_id": "cskv8wCcduYQsU9KN3J7ZA"
  },
  "BO_aJI4z6fCsO2n-m0Ynhg": {
    "date": "2/23/2019",
    "text": "Ate here last night had a great waiter, the food was good, iced tea was good, chicken sandwich was good, prime rib was good, I don't understand why John C is complaining? My only complaint was the aujus was cold... 1 star off for cold aujus otherwise I like this place.  .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lloMabSLiZSKVKb2BAbc7A"
  },
  "kGLRarK_zXycGGPBfskyMg": {
    "date": "4/23/2018",
    "text": "This trip just did not seem to go right from the start.  I made the reservation because the better half wanted a certain sandwich.   We got there on time and there was a huge crowd sitting next to us.  We were fortunate to get our order in before they did.   I ordered the salmon with carrots.  It was pretty good. My better half got her sandwhich and it was a tad cold.  She ate it knowing that any remakes will be behind a huge group of people sitting next to us.  We told the server and he took it off the tab.  They did a good job.  I did like the food, but feel it was a bit over priced though.  I will come back and try something else on the menu next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tFSnxUGaNa2pwb4zClBu_Q"
  },
  "ctNm0GH2TfSH9ix7vBIS1w": {
    "date": "5/13/2019",
    "text": "Ribs where good but the lighting was so dim it was hard to see around.... even your plate. The place was so cold like freezing even eating warm food didn't do the trick. The service was okay for the price i guess. Probably wouldn't be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rXpImeH9wmO6T66mHf89eA"
  },
  "gqF1Dtoui9LWI93fOZmvSA": {
    "date": "3/31/2018",
    "text": "The food is consistent and very good. The croissants are a must have...trust me, order them!  We all had seafood dishes tonight; the catfish, blackened Mahi and Blackened trout and all came out great.  We enjoy the atmosphere and typically enjoy the customer service. Which brings me to my star rating rather than 5. The server was slow and inconsistent and found it difficult to keep out glasses full of drinks.   All in all, this is a nice place and we will continue coming back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "N9MRT7P9HCHVx19FXoAIEA"
  },
  "XCZT5J_C90rz0519kEU1Og": {
    "date": "12/2/2018",
    "text": "Steaks prepared flawlessly to correct temp.  Reasonable selections on the menu.  Pricing for portions fair.  Service great until the very end. Check presented while entrees still in front of us and dessert was mentioned as an after-thought.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BlSbxxb1vyfFoLGjfHh5dg"
  },
  "9lptCccJTXkzZ6CxWAZIBg": {
    "date": "9/26/2018",
    "text": "We had a delicious dinner here Saturday night. We were a little bit worried when we learned that we were seated in an area with a trainer training a new person. As it turns out we were worried for nothing. Our service was fantastic prompt and friendly. Our food was delicious. I had the fillet which was cooked perfectly and my husband had the mahi-mahi which was also perfect. Their dinner salad is better than the average that you get in some restaurants. And not to mention the croissant that they serve with a salad. I've been here for lunch many times and always the food is great and the service is good. This is a A great restaurant for couples  or a large group. I highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cxMvDKS5pQSj2nVjRI4pmg"
  },
  "8Luf_JJN3P-W25G9TrdCFw": {
    "date": "4/13/2019",
    "text": "Exceptional. Rigo greeted us with a hearty welcome and dashingly showed us to our table. Ashley our server was AMAZING. The service is OVER THE TOP attentive. Cocktails perfect. Food delicious.  We ordered the French dip, fillet mignon, and oven roasted chicken.  ALL yummy and prepared perfectly. I ENTHUSIASTICALLY recommend this restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ddn8-uxCjLFRf16qDGa0hA"
  },
  "CSMI9xG-Q2HqVpsVHTh6rw": {
    "date": "6/26/2019",
    "text": "I brought my husband here for Father's Day lunch.  Not only was the food amazing as always,  we noticed how many servers had assisted at our table. We really appreciated all of their service and great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rZzCnMThm3E1fQeVXsWl3Q"
  },
  "Zq9cEpsTL6aaTPWjP3uHfQ": {
    "date": "5/4/2019",
    "text": "Rachel was an amazing bar tending! She was full of life and had a great sense of humor. She made me feel like a King. I will definitely be coming back in and requesting her.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RjGbCLCWK2IKe0UwwSZY0Q"
  },
  "Ym1pe62PiLzxDPrKYo7OvQ": {
    "date": "7/28/2018",
    "text": "This place was great! We came about an hour before they closed and they were so accommodating. Our server was polite and knowledgeable. My steak was yummy and the wine was superb! I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FhrpsOUWSpH302TGZn8Isg"
  },
  "INyqS5x4xOJXXhurvrvrsg": {
    "date": "2/23/2018",
    "text": "I come here every year (from California) and have been coming every year for the past 13 years or so. We always come with a party of 25-30 people...I know...it's crazy lol but the servers are always awesome. We spend a good 3 hours from start to finish, because...well... It's a lot of people to take care of.  The food is fantastic, the service is good. My only complaint tonight is that the chefs need to understand what medium means when referring to how done you want your prime rib.  They brought me my plate and my meat was still kicking and mooing.  Then I sent it back to be cooked a bit longer (which I NEVER do) and it still came back kicking. I ate it. I damn near chocked because I couldn't cut it into small enough pieces. But, tonight I had beef sashimi and it was kind of disturbing.   But this is just 1 of probably 15 times. I still love it here",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vkDUJoO11U81qfQ76_WOdA"
  },
  "qc-37205eJ2n-juEndQJvw": {
    "date": "3/28/2019",
    "text": "I have been going to this Charleston's for well over a decade and they are always consistently good. I typically go there for lunch 1-2 times a week because it is close to my office and it's a great place to meet with vendors/clients. You will never be thirsty because they always bring you a fresh iced tea the moment you finish it. My standbys are the club salad (grilled, not fried), the chicken parm and the French dip. Appetizers are also wonderful, but we usually aren't THAT hungry at lunch. Service is extremely prompt and professional. You cant go wrong here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RXBLsDvMG40md41lhG8Pfg"
  },
  "QxZGMCbqHi9wutZNbuXhJA": {
    "date": "12/3/2017",
    "text": "This has been one of my favorite lunch spots for a long time! They have just about everything on the menu from soup, salads, sandwiches, pasta, to meats and seafood dishes and I've never had a thing I didn't like!   Sone of my personal favorites:  - the glazed carrots. SO good. They're cooked and glazed with a maple type sauce. They kind of remind me of thanksgiving sweet potatoes but just carrots instead of sweet potatoes  - the baked potato soup. The best I've ever had. It's so creamy and potatoey and perfect with the melted cheese on top mmmmm  - the croissants!!!! They come with all the salad dishes but if one doesn't come with your meal, order a basket for the table. They're warm, flakey, drizzled with honey and SOOooooOoOOO good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "WjPLEr26Y0nW_ZtCEymnDw"
  },
  "qdO_pDn0PW9vP7n8xDHvbQ": {
    "date": "7/1/2018",
    "text": "The decor here is beautiful, so if you're looking to take someone on a date night this is the place.  That said be prepared to shell out some serious cash, especially if you buy alcohol.  Nevertheless, the chicken parmesan I got was super tasty.  It had the perfect balance between too much and too little breading, which for me can break the dish.  The server was quick and attentive so I'll be back when I'm in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "orEcsoH2GGlraWp-JuKkBw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Chicken Parmesan with fries.  Pretty good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/orEcsoH2GGlraWp-JuKkBw/o.jpg"
      }
    ],
    "user_id": "F76i3Syqc_jTR2m2vXGwuQ"
  },
  "Q_3OxMzBP-ZWxcCN6ty_yg": {
    "date": "9/21/2018",
    "text": "Just had the best enchiladas at Charleston's. The food was delicious. The staff was great.They checked on us numerous times and offered excellent customer services.Amber was a great server. She was friendly and offered recommendations. My husband had the filet and it was cooked perfectly. The cream corn was perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DmYZ4Owjo3qxr5Gsbb1eFA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DmYZ4Owjo3qxr5Gsbb1eFA/o.jpg"
      },
      {
        "img_id": "Dx5yIB183ZzDRtM0fDgJQA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Dx5yIB183ZzDRtM0fDgJQA/o.jpg"
      }
    ],
    "user_id": "7tq5Z72q2gh83DcWUVbqhA"
  },
  "sB-adgBwDt_zExN6gLpH8g": {
    "date": "2/13/2019",
    "text": "I'm going to say this now in case I forget, probably won't but anyway, you MUST TRY THE BREAD PUDDING!!!  Now for the review, Hailey, our server, was super. She was very pleasant and catered to our every need. We never had to ask for a beverage refill because she was there with one before we could ask. Not only was she super, so was the staff. Anytime anyone saw an empty plate, whether it was their table or not, they removed the dishes from the table. The hostess was very inviting and professional. Staff attire crisp! Now the food.  You get a decent portion of food for your buck. We had the Blackened Trout with Rice and Mashed Potatoes, Dynamite Shrimp and Bread Puddling. Again, try THE BREAD PUDDING. The Trout was tender and the Shrimp, coated and breaded well, absolutely delicious.  Everything was flavorful and well presented. The restroom was clean.  There is pleanty of parking as the restaurant is located within a mini mall. I will definitely return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WC4EtqvMxmMKOv8qD51PwA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Bread Pudding.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WC4EtqvMxmMKOv8qD51PwA/o.jpg"
      },
      {
        "img_id": "4e9DWEdDBn89oS2DnJIDiQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Dynamite Shrimp",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4e9DWEdDBn89oS2DnJIDiQ/o.jpg"
      },
      {
        "img_id": "ktloJP5oyn09ZBN48N9HQA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Blackened Trout rice mashed potatoes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ktloJP5oyn09ZBN48N9HQA/o.jpg"
      }
    ],
    "user_id": "P4h9gzBJQrJ0qC_Y_xGWFA"
  },
  "1XN0ShWUNb6w9LaEwc1qpA": {
    "date": "5/3/2019",
    "text": "Staff is good but the managers are clueless. Not sure how they got their jobs. If they hired real managers this place could be great.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y1HTpfQjo1ixs6uUDZvhug"
  },
  "TWhz9C3os8zIFTGjtCa9Sw": {
    "date": "5/2/2019",
    "text": "This is the best chain restraunt I have eaten in food is always excellent not a bad thing on menu. there people are friendly and properly trained and they will drown you filling the water glass after every sip. My favorite is the chicken Avocado club with great cole slaw and a fresd Jalapeno",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iOaRme12U_7zodjSZo-2eg"
  },
  "qhCvqHmCBw7Jci3RXVPe9w": {
    "date": "3/20/2015",
    "text": "Second trip to Charleston's was again perfection. Service was on point, timing of appetizer, salads, main entrees was smooth. We had ribs that fell off the bone, the best Ruben Sandwich I have ever had and flatbread to start. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "1GgFMwCZwP-B8OWLTmrSoQ"
  },
  "KWb1uuJgUwPKJDUgiddpow": {
    "date": "2/26/2015",
    "text": "Wow, what a terrible experience! The shrimp scampi was so acidic that it burned the inside of my mouth and tasted like mostly lemon. It was inedible. We had to wait over 20 minutes before we were even offered or brought a glass of water let alone any other beverages. The service was terrible and the server kept saying that the tip wasn't included so not to forget to tip the waiters. How Rude! A tip is for good service and we didn't have that! It was so noisy inside that we could barely talk to one another and were nearly yelling to be heard by each other. Even after we complained about the bad food and the service nothing was done. They will never get my business again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "NGjHLJb-d3YLUm3YYgWoaw"
  },
  "zzCLvZztgVm6XBUGctFURQ": {
    "date": "9/29/2014",
    "text": "Let me tell you this place is a five star stop the food is fantastic you can taste the love and care they put into it.  The service was above expectations I didn't have to ask for a thing management was friendly and informative. This was the first time I've ever eaten at a Charleston's and it will not be the last next time I'll even bring friends and family just to show this place off! In case you are wondering I couldn't finish all the food that came with my lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WulrLQpUuv1LqRaXj8ShUw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WulrLQpUuv1LqRaXj8ShUw/o.jpg"
      }
    ],
    "user_id": "fOj4vM6JrsEf1kyxVpPQ5w"
  },
  "YSE1MF_Z0q90IX2ZGMqicA": {
    "date": "6/18/2015",
    "text": "I went back to this place and I have to update my rating.  I had the same exact meal and it was really great..even better than the 1st time.  The customer service is top-notch as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1IJQFFK4vROUbpPZbgkdrA"
  },
  "fGItMwQinUXHhdPl803dww": {
    "date": "3/11/2016",
    "text": "This was a really good experience for me. Met a friend here for lunch and it was fantastic!  The baked potato soup was delicious and the waitress was just great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wm0T1id8slWjVmAiMNQ5NA"
  },
  "2wf94Y8MNSZrQN8Rmg3LFw": {
    "date": "3/7/2017",
    "text": "I've lived in Ahwatukee for 15 years and this is still my favorite restaurant! The food is superb (my favorite is the shrimp cargot and steak), and I love the ambiance. Servers are always friendly and attentive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8JDsa2kvf1opWLBO7jwARA"
  },
  "RqDLXaRtX2tr9F_k4qyVlg": {
    "date": "1/12/2016",
    "text": "Took my girlfriend for her birthday and the food was excellent. The parmesan chicken was delicious. The staff was very professional and friendly. Thank you again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OWQoFGKwKbLa9zBTQzo9ig"
  },
  "NbnxVK0MRHB39xsW3_eOdA": {
    "date": "2/23/2016",
    "text": "The food was so good I went with my husband and friends for my birthday I really enjoyed it. I had catfish the and coleslaw the French fries were salty so I didn't eat much of those the drinks were great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3GzagNGcgzcxpIADMNrs_w"
  },
  "lhGSKNGjm2e1jXI9i0YJsw": {
    "date": "2/17/2015",
    "text": "Great service, great variety and very good food. If you like Houston's you will like this place including their French dip sandwich.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UDe9DmQMv5UV1a3O1DMZaw"
  },
  "8RssYs1rmOFkFmP-AesXDA": {
    "date": "10/22/2015",
    "text": "In the area for business, solely went off Yelp reviews of Charleston's. Wasn't disappointed, ribs were very good. Service by Isaac the bartender was outstanding. Oh and yes the bread pudding is that good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WlfyPxfUtwePYAKyRh8hbA"
  },
  "tRdtDoHjtzRVA2NAdBri6w": {
    "date": "12/2/2015",
    "text": "I went to Outback at this location a couple mo. ago. I wanted an item that they no longer had on the menu. They made it for me. :-) Not too long after I ate it someone came by and asked if it was good. \"It was excellent \", I told him. :-) Very good food and service. Have been meaning to give them a 5 star rating and good review. Here it is. This is a great place to eat and be served. :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M7lL9YjxTBgEwuLr2iIr6g"
  },
  "3oqdw7pxOnpDkgunueluaw": {
    "date": "12/5/2014",
    "text": "It was my first time coming here while I waited for my car to get serviced. The place looked really nice and comfortable inside. The hostess and server were very nice and pleasant. The only thing I recommend is to NOT order the steak fried chicken. It was extremely chewy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "xduGhZ92kLqvTGZ2-zX0hg"
  },
  "lTWju5KOzeRVat6qnFDoGw": {
    "date": "10/13/2015",
    "text": "Service was great! Very friendly atmosphere and out waitress took good care of us. Food was also delicious and the portions were huge! Be careful when ordering that you don't overdo it! :) A manager came and greeted us after learning it was our first time here. We received a warm welcome and some coupons for next time, definitely left a good impression!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WidZZ2oFXpXecEF_KaMZdw"
  },
  "omjwIfEYNM4vZocFR09GFA": {
    "date": "9/29/2015",
    "text": "Great steak and great atmosphere. I'll choose this over other chain steak houses. Worth the price",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sD79YPD0HNUC-ssKt5Gxpg"
  },
  "Nuar9u-_P4-WVPiBCRePrg": {
    "date": "12/19/2016",
    "text": "We came in and were promptly seated as well as promptly greeted by the waitress. The young girls that greeted us as we walked in and seated us were very young but polished to be very polite. The waitress that we had for the evening was so great to us that she really made our experience fantastic. I tried to make note to try and remember her name to include in the review and I'm hoping I'm getting it somewhat right but I believe it was Eman or Emon or Evon? I apologize but it was something exotic. Anyways she was so friendly to us and so smart with all the details of the menu. I loved her so much I even told her she should be a model instead of waitress even if she was great at it ha! I also have to command her on how great she was at bringing us out new drinks for what felt like the very second we took more than two sips. Nothing like just ice when your eating something salty and need to wash it down. Also my hubby could not decided what to get and had a million questions like he always does on everything on the menus and she really had the patience to stand there with us answering all his questions with no irritation (which is hardly ever the case with people these days) despite the restaurant seemingly being very busy and her looking like she was running all over the place when she wasn't checking on us giving us drinks or taking our order. I believe she had tables spread out all over the restaurant. The food was also all cooked perfectly and seasoned beautifully. Hubby got a steak with a baked potato and I got the ribs with beans and fried. Both so yummy, had to stop my hubby from eating both his meal and my meal ha! The only problem I had was that I didn't find this place sooner!(I'm surprised we even found it since it is tucked away in the back in a parking lot behind a highway ha) Even as we were enjoying our food we had a manager check in on how everything was going and she was so polite and nice making sure that everything went over well not even knowing that it was all going fantastically. This is how all restaurants should be I was just blown away with the great service and great food. Great job to you Charlestons and all of your team. I'm sure we will be back the next opportunity we get!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G8YxOtysI0bGj1IYlPZ2ag"
  },
  "ICRIrhw4UwkdGP2rs9Nfag": {
    "date": "12/13/2016",
    "text": "The good: wonderful ambience, friendly service, salad was very fresh, amazing burgers, nice wine selection, great croissants & duo dip. The not so good: I was disappointed with the chicken kale soup.   I was expecting homemade deliciousness but it tasted like canned soup with mushy vegetables and extra chicken (the chicken was good) added to it. If the restaurant wasn't so busy the night we were there I would've sent it back as I wasn't able to finish it. The rest of the meal though was quite good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xT0iTLGhUNRhsfAxo91rRw"
  },
  "1hTraP6FWl8pVIX8YTeiMA": {
    "date": "12/27/2014",
    "text": "Their chicken fried steak was the best I've ever had. TexAz has now moved into second place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NWT06Hu3VObAawRyjnymjA"
  },
  "8VwsTF-18jVCONO0GQ33rg": {
    "date": "4/20/2016",
    "text": "Had an outstanding lunch today at Charleston's.  Hubby had pork chops and I had fish.  Service was outstanding and the food were perfect.  We couldn't finish it all so asked for boxes to take home the left overs and they were delivered quickly to our table.  I am sure our waiter was Aaron and he was really great helping us pick out our selection. This was our first visit will not be our last. The place was very busy and we know why!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3dLjt60Lkka1FJrnUbDOYQ"
  },
  "iliRxOJ2n8CscrnHG7LgxA": {
    "date": "12/3/2012",
    "text": "Went off of the reviews on yelp and found them somewhat accurate so here is mine. We went for lunch. 1 appetizer, 2 dinners and 3 beers =$66..I guess not to bad.  Service was great! Food - We had the spinach dip and both of us got the Chix and Rib plate. Portions were huge, a plus. Chicken was very salty and ribs were, in both our opinions over-sauced. I don't like digging through sauce to find meat and the flavor of the meat was covered up by the super rich, sweet sauce.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TEWvp1wLClX-P9HbGQMnXA"
  },
  "sTdIjQZEx2Uo_7JI1VefWA": {
    "date": "9/25/2016",
    "text": "This just became one of our fav places within 2 miles of the house. This is only my second time taking the time to write on YELP. Have been a guest 7 times now and thought a recommendation was in order. Great atmosphere, professional wait staff and the food has yet to disappoint. We love to share and tend to go for the appetizers before a shared entree. The shrimp cargot is a #10 on our hit list of starters. The baby back ribs are the best we've had in the area; fall right off the bone as is stated on the menu. To top it all off, the atmosphere is  dimly lit (female prerequisite) and the music is tastefully soft in the background. Truly an enjoyable experience for two seasoned foodies. I will highly recommend Charlestons to anyone asking for a recommendation for EVERY occasion. We will be dining here on a regular basis.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pLasK76h3nexmr-llQBEPg"
  },
  "jidINGQ9CtbSHiQN0y74XQ": {
    "date": "6/15/2019",
    "text": "We chose Charleston's because they have a really good variety of choices on the menu and since each of us like totally different foods it made sense.    I got the Chicken Piccata and thought I would take half home for leftovers. But I couldn't stop eating it - soooo good !!!  Had a glass of pinot grigio from Italy and it was heaven.    Sis in law had the shrimp scampi and she ate it all too, in record time no less !   Hubby had the catfish but he has more restraint than us and did take half home. He enjoyed it the next day. He also loved the cole slaw which was not run of the mill.  Enjoyed the meal very much and service was excellent !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X1H_aEwrlvOs-Mntfyr4rw"
  },
  "JXchlhLkVrf8yDj-O4B8Kg": {
    "date": "8/18/2019",
    "text": "My wife and I arrived at Charleston's last night, Saturday, 8/17/19, at 9 pm. The restaurant was empty, the only other customers (besides my wife and I) being one other couple. We all sat at booths in the bar. It took 20 minutes just to order a drink, despite a multitude of employees, presumably servers, walking around and chatting with one another. It took another 15 minutes to order dinner. Our waitress didn't bother to ask us if we would like to order dessert. Finally, after finishing our meal and waiting for another 15 minutes to get our bill, I literally had to yell, \"HEY!\", at a server passing by about 30 feet away from us, to get her attention to ask for a bill. The food was excellent, as always, but the lackadaisical attitude of the wait staff was disappointing and, frankly, appalling. It was easy to understand why the restaurant was empty on a Saturday night at 9 pm. This place is heading out of business, at this rate, and that's shameful, because the food here is always superb. However, they ignore customers, the life blood of their business. I hope that someone who cares and has some influence over the business reads this review and makes the necessary adjustments to staff and their attitude before it's too late.  p.s. - on 8/19/19, management reached out to me to investigate the unexpected lapse in quality of service at my local Charleston's restaurant, located on Elliot Rd. in Chandler, AZ. They were very gracious and assured me that they would be taking steps to insure that the poor service I experienced was just a one-time phenomenon that would be corrected immediately. The food quality at Charleston's has always been excellent, so I will pay another visit to the restaurant and hope to enjoy the same great experience I have always associated with having a meal there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3k3mM0JloBJtUBPpIwMNdQ"
  },
  "dClWZ87_3-fRKrNoYwhWpw": {
    "date": "6/15/2019",
    "text": "The service here is really great, but the food is underwhelming.  This is a white linen tablecloth kind of place with a super traditional American 90s restaurant menu. I ordered a pasta dish and he ordered ribs and don't get me wrong, they were fine, but not anything that I would have to hurry up and come back for. Especially since the price was a little high for the lack in creativity.  The seating is comfortable and the service is good, but again, for the money you can get much tastier food at other establishments.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qFUU86xrpl_4QzS_uf9W3A"
  },
  "xroBNU2W0ZUHC56S8eQDBg": {
    "date": "5/13/2019",
    "text": "This place is solid on my rotation list! I've been here numerous times and the service is almost always excellent and when it's not it's still very good. Some of the servers are a bit too chatty at times. The pork chops are always my favorite and my husband, quite the cheeseburger eater says the cheeseburger is one of the best around.  I always take half my meal home so the serving sizes in my opinion are generous.  I always make a point to request not to be seated at the booths that only seat 2 because the server traffic is high volume in that area and the table is just too small for our liking, very congested area all the way around.  Great food and service in a nice atmosphere!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "t1ySJLNV1GaaXeMFmeQhhA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t1ySJLNV1GaaXeMFmeQhhA/o.jpg"
      },
      {
        "img_id": "Z5a9jfLjNvmQydi6nEGE8w",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z5a9jfLjNvmQydi6nEGE8w/o.jpg"
      },
      {
        "img_id": "Qz2Pgx1ndDhKlh5fkFqH5A",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Croissants w/Honey butter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Qz2Pgx1ndDhKlh5fkFqH5A/o.jpg"
      }
    ],
    "user_id": "JX7mjMODvt96vQIj9ENzhw"
  },
  "VpJkBn2Baj3QeCj60o0DVQ": {
    "date": "8/31/2019",
    "text": "This place reminds me so much of Houston's Restaurant! Anyway, I was on my way to the gym when I thought to myself, \"How about a glass of wine and an appetizer instead!\" Nevertheless, I ordered the most fattening appetizer ever in life, but damn it's good! It's called Shrimp Cargot and it's a play of escargot it's shrimp swimming in garlic and butter with gooie melted cheese all over it!! And it's served with toasted garlic bread for dipping !!! Did you hear that?? That's the sound of my arteries hardening!! I don't care because it's just good!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o0vZ1xsLxMWpHdeFWF_OuQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Grilled Salmon Caesar Salad. Really yummy!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o0vZ1xsLxMWpHdeFWF_OuQ/o.jpg"
      },
      {
        "img_id": "yVTsRVxHMWiqgR7tmvRDgQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yVTsRVxHMWiqgR7tmvRDgQ/o.jpg"
      },
      {
        "img_id": "0md-aWG_Tqy5V5L83v2OPQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0md-aWG_Tqy5V5L83v2OPQ/o.jpg"
      }
    ],
    "user_id": "ZUnmsVs1Vdp9_UtG41u7mw"
  },
  "xcHEx7ErtrA4yrm82aZ4Gw": {
    "date": "6/29/2019",
    "text": "Definitely Enjoyed Our Date Night Treat At Charleston's Husband Chose Ribs They Were Fall Off The Bond Delish. I Had The Special Blackened Trout. Shared A Spinach Dip For Appetizer Really Good. Love The Crossiants Served With Salad Nice Portion.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DgzhukHWWfKd5fUYMQHHAQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Blackened Trout",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DgzhukHWWfKd5fUYMQHHAQ/o.jpg"
      },
      {
        "img_id": "a0aUnCibdxWSzlXVgX4UUQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Famous House Baby Back Ribs Sweet Carrots And Stuffed Potatoes.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/a0aUnCibdxWSzlXVgX4UUQ/o.jpg"
      }
    ],
    "user_id": "dDmCuTlCJGEbyJmv8AZa3w"
  },
  "TgxUSpVdapvXmS0EIYLggw": {
    "date": "2/24/2019",
    "text": "James the server is the best. Absolutely spot on service every time. We always walk out buying more entrees then we need but happy that we took his recommendations and excited to return for another great experience. We go out to eat, to find a place this good and solid. To have dynamic service, really makes me happy. This is a solid restaurant. I've had a number of menu items. Every one seems to be purposefully made by scratch and taste like a scratch kitchen. This place ain't cheap. It comes with a price but the portions are not skimpy. The chx fried chx is two breasts and a heap of mashed potatoes and sugar baked carrots. I usually opt for a cup of soup. Sundays they do their kale and chx soup. My opinion the best soup ever!!  Burgers are lean and good. Salads are not petite. The Waldorf salad is off the hook plumpalishis!  Croissants come with the salad. Nothing done cheap here.  Definitely a good solid place to eat. Where everyone will walk away happy and plump.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "4MeyfdyeJ38A_wOKLapRMQ"
  },
  "IMirtxQNt8hUZdw1wj-NSA": {
    "date": "2/15/2019",
    "text": "Consistently, really good food and most days service that is as close to ideal as you can get these days. It's as simple as that. Decent wine selection which includes at least one local red blend. A variety of tasty entrees with complimentary accompaniments as well.  Specials which typically include a fish and a beef option with a special touch.  I also enjoy the veggies that change with the season as well as their usual options. Had one of their desserts for the first time tonight.  It was more than enough for three.  I ordered the German Chocolate cake which was served toasty warm.  Nice touch.  Told my husband I am going to whip up some truffles with the remaining cake.  A little Kahlua added to the mix. A really nice dinner, consistently delicious, this is a go to place. Special occasions like Fathers Day, Valentines Day, or just any day of the week.  Good food done well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "1Ahe7xBjIfPzzJCLa-bldw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1Ahe7xBjIfPzzJCLa-bldw/o.jpg"
      },
      {
        "img_id": "yUAZWKNtCJe8p4TtGmoM7Q",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Facing South from North end of the bar.  It is Happy Hour.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yUAZWKNtCJe8p4TtGmoM7Q/o.jpg"
      },
      {
        "img_id": "hXOknBe5M8i1gw8ytKW0eg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Halibut is on special.  Valentines Day?",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hXOknBe5M8i1gw8ytKW0eg/o.jpg"
      }
    ],
    "user_id": "quH7oYf3C-_klKjP-cklCQ"
  },
  "v8r83Ws3e2bdzWici_1vIA": {
    "date": "8/3/2018",
    "text": "EXCEPTIONAL SERVICE. Outstanding staff. Our party of 24 people was blown away by how accommodating, courteous, professional, and friendly Charleston's was. And... our food was delicious!   I am still in awe at how Charleston's took on our large group, without more than half an hour advance notice, and supplied us with an army of waiters and waitresses to get the job done. They even were ready and willing to divide up the checks, with smiles and patience! They all deserve gold medals.   We had chips and dips and various entrees. I personally had the chicken ciabatta. For me, the shoestring fries were the highlight. So crispy and yummy. I loved the peppers on my sandwich and the melty cheese. Also tried the salmon on the salad- yum! Everything else looked delicious as well.   I'd absolutely return and would recommend this place to any large groups. They were stellar and we are so appreciative, thank you!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "STySv-g38N1UReDqG6barQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Inside: cozy lighting, tables well lit",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/STySv-g38N1UReDqG6barQ/o.jpg"
      },
      {
        "img_id": "Z62A62HCiDNT5SWVI6dwQw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Chicken ciabatta",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z62A62HCiDNT5SWVI6dwQw/o.jpg"
      },
      {
        "img_id": "oVWhrSVef9eRNe8d4m0RJQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Salmon Caesar salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oVWhrSVef9eRNe8d4m0RJQ/o.jpg"
      }
    ],
    "user_id": "TckuDhBumls4JngOPSlaYQ"
  },
  "vrsF53XycSSR5cJdTf8JOw": {
    "date": "3/30/2019",
    "text": "Another success story at Charleston! Our waiter was so nice and helpful that we took all of his dinner suggestions.   He told us he was also a nutritionist therefore recommended the blackened trout for me.  Ron had his heart set on a rack of bbq baby back ribs.  Dinner came extremely quickly and it was delish! I had two sides of the same, spaghetti so l can give one to my extra hungry husband!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "9JaHCY7sDO3PQ4W61Zudhw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9JaHCY7sDO3PQ4W61Zudhw/o.jpg"
      },
      {
        "img_id": "tklkg-oILOH8A3ZN0FFKUw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Lightly bread crumbled catfish with Cole slaw and fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tklkg-oILOH8A3ZN0FFKUw/o.jpg"
      },
      {
        "img_id": "C61E5_DtJYIlgWFAyaP1WA",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Bbq baby back ribs with glazed carrots and fries.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/C61E5_DtJYIlgWFAyaP1WA/o.jpg"
      }
    ],
    "user_id": "ByNfFYaW544SRchjvAHscw"
  },
  "XlnWjCXc3Ju3BwDzO2oeaw": {
    "date": "7/20/2019",
    "text": "Great service and quality menu selections. Loved the trout special. Prime rib sandwich always a special treat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tiQQ2bAvOVZlhFDQKKe17g"
  },
  "BF6FC26EtYR4-x_b0IKlfg": {
    "date": "3/31/2019",
    "text": "What a great dinner. We sat in the bar area to take advantage of the happy hour menu and both ordered a beverage. Emma had a Manhattan and I had a margarita.  Both made just right. Emma had the grilled salmon with a side of pasta and I had the baby back ribs with fries and asparagus. Both entrees had generous portions and prepared perfectly. Nothing more to say. The wait staff was totally professional and knew the menu well. What a great night out!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "O_Usglb0SNhKruSdZV8c7A",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O_Usglb0SNhKruSdZV8c7A/o.jpg"
      },
      {
        "img_id": "fQWN9mJqr3KPEkABe_WThg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fQWN9mJqr3KPEkABe_WThg/o.jpg"
      },
      {
        "img_id": "KAPgqPQuNiGnoJ2wUMMHIw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KAPgqPQuNiGnoJ2wUMMHIw/o.jpg"
      }
    ],
    "user_id": "1S3NXAluUp5FB-YVSj3yOg"
  },
  "-AHOz4etFCaC1ASmmg7Ieg": {
    "date": "4/21/2018",
    "text": "Customer service: 5/5 Our waiter, Ace, was awesome!! Extremely attentive to our party's requests. Gave excellent recommendations about our food and cracked a few jokes  Food 4/5 Their house salad was wonderful and had ample toppings. My clam chowder, however, was soooo clammy. It could have just been an off night. But, I tasted my fiances chicken fried chicken was SO bomb!! The crunchiness of the chicken combines with that thick, rich white gravy sauce was so sinful. That was the table favorite   Wait time: 3/5 We went on a Friday night. My uncle said that there usually isn't that long of a wait, but we waited for about 40 min. But, it was 7pm on a Friday night, so we took our chances with that one.   Dessert: 10/5 Definitely definitely get the carrot cake. Best carrot cake I've ever had in my life! Two different servers told us to get it because it was the life changing.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Iq7G6KfEXHxYRNMg5S8uVg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Iq7G6KfEXHxYRNMg5S8uVg/o.jpg"
      },
      {
        "img_id": "Her3s2mpmnvqyeRk1LQBZw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Her3s2mpmnvqyeRk1LQBZw/o.jpg"
      },
      {
        "img_id": "bH56MQcew4xexujsun8GIg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bH56MQcew4xexujsun8GIg/o.jpg"
      }
    ],
    "user_id": "_d_W7-l9kAlnX6dyje9mKQ"
  },
  "bWOCGEFBxJn1NdAjDqu7aQ": {
    "date": "4/2/2019",
    "text": "Always a good time at Charleston's! A group of about eight of my friends came here for dinner Sunday night. It was a packed house, but we were seated quickly. Everyone that came to our table was nice. I believe one of the servers by the name of the DaShaun- I was Extremely helpful, giving his descriptions of drinks and food, and just an overall customer service gem! Everyone's food was delicious. I was so hungry I couldn't take any pictures, but I ordered the catfish which was fried perfectly. My friend ordered the stage actually two of my friends ordered steak. Both of them were pleased with how it came out, and DeShaun stood by and ask them to cut it just to make sure it was cooked how they liked it! Two other friends ordered the chicken piccata, that came with mashed potatoes, and they both were very very pleased with their order. As I said before, the drinks were not watered down, And they tasted very good! Charleston's does not disappoint!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WVz_H-0Bbfk4l1vvFSO8Bg"
  },
  "4mgZL4e4Dar5oXdYgGyVfg": {
    "date": "2/27/2019",
    "text": "Soup and Salad lunch special around $14 for dine in or convenient carry out around back with special parking! Always great service and top quality ingredients. Fresh croissant with a touch of honey comes with the salad. House made fresh dressings.   Stop in for happy hour or make reservations on their website for dinner! Not weekend casual, business dress.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ob6ToKjLna3WOZtrI_m0nw"
  },
  "n3-XPDyW4fXhRqfjPVP52Q": {
    "date": "2/21/2019",
    "text": "I probably would not come back for the food.  My enchiladas including the chicken are dry and tough to eat and the portion is certainly not worth the money! The service is good and our server was pleasant and friendly. I did ask for some extra sauce and it was better.  My husband did like his sandwich but the cole slaw is very sweet and he does not care for it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MtPAmhvreKTXZSltpj7eTA"
  },
  "2HAtuQk9KnVyoqxWgxlzcw": {
    "date": "4/11/2019",
    "text": "I would've given more stars, but I feel disappointed. I ate here for my first time on Sunday and went in for leftovers on Monday =( BIG LET DOWN. My parmesan cheese must've been prepackaged because it was all molded! YUCK!! I called and spoke with Jared, but he advised me that this situation was above his pay grade and he'd have the manager call me sometime this week or next week?? So my question, is this such a common occurrence that it serves no immediate attention?  Let me clarify that my experience was pleasant, our waitress (Alyson) was great, and the food was pretty good. I started with the baked potato soup. My fiance ordered the original chicken tender platter & I ordered the parmesan crusted chicken. Everything was great until we boxed some left overs. Alyson offered to bring marina and parmesan for my meal & I gladly took her up on it. I really wish I would've looked at the cheese before we left ={  I really felt that Jared didn't take me seriously or maybe didn't want to \"deal\" with a disgruntled customer (although I was very kind about it all) Something about his lack of empathy made me think he didn't believe me? I did offer to pack up my infant and take the meal all the way over if that was the issue, but he declined.   Here I am, Thursday evening, and still no call.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ezs-lEJOfI4OsHbCyUtN-w"
  },
  "ixx5_j5pqnr0ccg5XgDHPA": {
    "date": "8/6/2019",
    "text": "Best prime rib dip ever. Have tryed several times and the get better, best fries too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ON2M5Wonaaat52Z1txr4yQ"
  },
  "xTrt5fMba5FcdwVpQbiqEw": {
    "date": "5/6/2019",
    "text": "The last dinner we had was not up to the \"\"old\" Charleston level. I had the  prime rib sandwich and the beef was not like before.  The dinner we had two days ago left me very disappointed. I thought I would have the catfish for a change. The fish look properly cooked and browned. The taste was not good, it was mushy. Since I had eaten one of the fillets, I felt I could not complain. I took the other filet home and disposed of it. My fries were very over salted. Cesar salad and coleslaw were as usual, good.  One of the people at the table ordered the chicken fingers. I tasted one and the chicken had very little taste and was stringy. Another person at the table ordered a cheese burger, ordering medium rare. When it came, it was well done. He has had cancer of the throat and  cannot eat anything dry, it must be moist. The took it back, the problem was he waited almost a half hour before his replacement came. I noticed him struggling to break off a piece with the tong of his fork. It was difficult for him. I asked him if there was a problem. He said it was medium rare but very tough. He said he has never had a \"tough\" hamburger before. The third person received the wrong salad he had ordered and had to wait a little to long for a replacement.  The fifth person said, what could he say, he only had wine and a salad. In my opinion, prices have climbed and the quality is not there. The third time in the past I ordered a top sirloin, it was $25.00 and 8 oz. When I received it, it did not look like a 1/2 pound piece of beef. The \"old\" sirloin was larger and much less expensive. That piece of meat is not worth $25.00  One more time and hopefully it goes back to the old Charlestons. And another think, we asked for a table and we had to wait because they do not have many table, they mostly have booths.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sN585sbdWKLXdDVuhnxkUg"
  },
  "RnEn7FQjt8L3Al3cLTspSA": {
    "date": "6/9/2019",
    "text": "The food was really good.  Service was great.  You have to try the dynamite shrimp.  That's so tasty it can't be good for you.  I'd recommend it highly and glad we found out about it.  When the manager found out it was our first visit he also gave us a free appetizer for our next visit.  It will be soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZtovN67tVFChEMCHAyTWJw"
  },
  "ehbf4XjCD_wzodbdiY2NQg": {
    "date": "3/6/2016",
    "text": "Came here for a baby shower and the food is decent but not good. Service is great tho! I would suggest eating elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AoeHWcrAHJlZm6xz5oWw6g"
  },
  "9VwjlX7z_bbEOBBawuawvg": {
    "date": "11/15/2015",
    "text": "Had dinner with my family and the food was amazing. I had the New York strip and I was when it came down to eating the last bite. I will definitely come back here when I come back to this area.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xc8Eux5esRuIw6jch4qx8A"
  },
  "Apb_kBN0m61ZLvQHqKAijA": {
    "date": "4/4/2016",
    "text": "There is so much I can say about this place. This place is absolutely amazing. My fist date was here, different holiday dinners, birthdays, anniversaries, and etc... I've never had a single problem. It's a busy restaurant so every time we go, we always make a reservation first or we wait it out like everyone does. The food is awesome, every with a full house, the service is exceptional. The manager is always seen walking from table to table greeting guests, or out front welcoming them in. We always order the prime rib. It's so so good. Although, I was told the previous time they don't serve the prime rib until after 3? Please serve it again regularly!!  I will always come back to this place. I would give them 1000000000 stars if I could! They deserve it! I recommend this place to everyone that I meet, my family, my friends and all of my clientele.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9jIAKh9YPOOECNmA9PFR-g"
  },
  "VRCRevUXGbViBukRxEKXaQ": {
    "date": "7/7/2016",
    "text": "Great date night place.  Dark and cozy.  We love the ambiance.  Wait staff is on top of it, very accommodating,  Best ribs and french fries.  Awesome salads.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lvi-CKZcoAGQv7k5YUHW4w"
  },
  "SN1jRQChqr9H2g0iLuoHNw": {
    "date": "12/12/2013",
    "text": "Outstanding on many levels.  Walking in, this restaurant will feel VERY familiar.  From the bar to the waiting area to the dining room, it might be your first time but you'll swear you've been here before.    We had a group of 14 and two young ladies did an outstanding job on every level with our group.  Nobody wanted for anything the entire time.  The dinners are simple cafe type fare, but are well prepared and presented.  I ordered the oven roasted half chicken with mashed and baked beans.  Everything was outstanding and the white meat on my chicken was moist and tasty.  Drinks are on the lighter side, but other than that you shouldn't have any problems with this restaurant.  Enjoy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RNKwQjJ3cKRUnsaTjB7NrQ"
  },
  "jKZVN7_XOMpdJATwU4YoTg": {
    "date": "12/13/2015",
    "text": "I rarely write reviews but felt obligated to post after my wife and I spent the last 24hours vomiting and pooping. We had the Grilled Chicken Club and a French Dip. Thank God we got our 20month old a grilled cheese. My guess is we had contaminated sprouts or undercooked chicken on the club. My wife and I split sandwiches so could have been undercooked prime rib I suppose. Either way we will never be going back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kUFAlir7_fHv0_QD3ls7sQ"
  },
  "zZp5p5CQt181WGQnVPPjyQ": {
    "date": "4/12/2017",
    "text": "Amazing service and consistent food quality!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r9f_VInhmHqHzd9pd_2EVw"
  },
  "NAch8AOHSEF4rb_3JgELTw": {
    "date": "6/1/2016",
    "text": "We arrived for a late night dinner and self-seated in the bar. The service was amazing and the food was even better. We will definitely be back. I was craving some fried catfish and they delivered. I was able to swap my sides and had some amazing glazed carrots and burgundy mushrooms. We also had some smoked salmon with fried okra and cucumber salad. The food was really a super surprise and Isaac totally took care of us!! It was late, but no one rushed us or made us feel like we had to leave.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rp8WGzZUgPPYLe_hkObU7w"
  },
  "oG87gYTmzRumCgymbEyJjw": {
    "date": "2/22/2016",
    "text": "Everything was perfect on our first visit here.   Excellent service and food.   We shared the shrimp cargot.   Hubby had the filet and I had the parmasean coated chicken... Instead of angel hair pasta I had perfectly cooked vegetable medley.    The patio was the perfect place to enjoy this delicious meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X0IqCx5mf4Nti7Hvf5oDsA"
  },
  "AoIXyo295RtmWVu0_6oplg": {
    "date": "8/25/2013",
    "text": "came in for dinner one night and sat at the bar... super low lighting... both bartenders were very friendly and made good beer recommendations.... they were, in my opinion, pushing everything on the menu like it was the best thing on earth..... didnt mention the specials till i over heard a waitress talking about them... then he had to ask the other bartender what they were...  I ordered the terrayki top sirloin steak special with garlic mashed potatoes... Steak wasnt that good at all but it was cooked to a good medium like i asked. That doesnt earn them any more stars though... mashed potatoes were ok....   Best thing about this place was the beer and thats not even gonna get them an extra star because they sell those beers everywhere in AZ.....   wont be coming back here either!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y1GXDMOmu4lnsCI7TSi0sg"
  },
  "cRVU0vfLQu6JIdyCP9i-hw": {
    "date": "3/17/2017",
    "text": "This place is TOP NOTCH.  My manager had lunch there with a team member and forgot his credit card.  He was flying back to sf bay directly after lunch that day, so no time to course correct.  To make situation even tougher, he had a trip to NY a couple of days LATER.  I had to get that card asap or it was going to be bad news.  I called the restaurant in a panic to see what could be done.  A manager named Candice saved the day!  She confirmed she had the card and agreed to ship it out to us overnight.  I sent her the shipping label and she took time to drive it over to fedex in time to make the drop.  She even emailed me to confirm she dropped it off.  We received the card just in time for his NY trip and all was right with the world.  Thank you Candice!!!!  We will be BACK.  Not only did my manager love his lunch, this place is an example of what customer service SHOULD be.  Make a reservation and support this place today!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xPThJnhy-j8moLHs4OR8jQ"
  },
  "ySKH6IY9X5FhbWR2asvI1A": {
    "date": "7/2/2013",
    "text": "Service was outstanding! Fresh Guacamole & Chips were excellent! Atmosphere was fantastic!  Was in Phoenix on business and went to Charleston's on a recommendation from a friend back home.  I don't enjoy dining by myself when travelling, so I tend to find a place at the bar and watch a game or read a book while eating.  The service was outstanding!  Both the manager and the bartender were great; friendly, warm, & welcoming.  The ribs came recommended (which was my plan) but I started out with a 1/2 off appetizer of fresh guacamole & chip and a happy hour Amber Ale.  I realized quickly that the appetizer was going to do me.  My only regret ... I didn't get to try the ribs.  The table behind me ordered some as I was getting ready to leave and they smelled incredible.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nDLGtZvrM9M4ePd-8RAJ1Q"
  },
  "09geyUaBN5GEmAgbRbHIOQ": {
    "date": "5/27/2014",
    "text": "My boyfriend & I always order the Chicken Fried Steak with their Peach Bellini!   Pure deliciousness!!! =P",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MuxT5-1Ir9wpaEVjQT43sQ"
  },
  "zO0F3NKqdV68ab9nllQ3tw": {
    "date": "4/13/2016",
    "text": "I go here as a client nearly every 3 weeks and have had nearly everything on the menu other than the fish dishes. By far the best salads and sandwiches in the area and for that matter in the state. The service is second to none with everyone working together and as friendly as can be. Our waiter yesterday was Jonathan and he was very pleasant and made our group feel appreciated for choosing Charleston's.  I will certainly continue to frequent the establishment nearest to my work and most likely check out others when I am outside my bubble.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xoC5XTB9vM326yht3GoZEQ"
  },
  "onX6YWDq1lZTFYZNnhKtQg": {
    "date": "5/18/2014",
    "text": "This is the second time I eat here. My family and I had a great dinner service and the only reason I didn't give the five stars were minor service issues.  The food is excellent. It is seasoned well and taste delicious.   The service was great, there was only one occasion where we needed a refilled and actually had to ask for it but all other times, they arrived before we needed the refill. Staff was friendly as soon as you walk through the door until you left.  The other issue was when we went the first time, we saw people getting pieces of bread before their order was ready and we didn't get anything. On this visit, after our order was taken, i asked the staff about the basket of bread that I saw in several tables. The waiter told me that there they provide french bread free of charge and croissants for a small price. I requested a basket of french bread to taste but that order never showed up.   Again, not a big issue but still a valid one. When you are waiting for your food, a piece of bread usually quiets the hunger until your order arrives especially if you have kids.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "acCNVG3ME0hGNUrgM8NVpQ"
  },
  "s8mu6pNhpalb675DdUQ5Mw": {
    "date": "1/6/2017",
    "text": "Great service, food price reasonable- smells great when you enter the front door, mesquite/ Kiawe --wish we had this in Honolulu",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ojldCEssDbcdMClltgDnnA"
  },
  "3XelFcNk6ZQKlmxKd7b8xQ": {
    "date": "4/9/2017",
    "text": "Charleston's is one of my favorite restaurants! My friends and I meet there frequently simply because we love the food and the service is always excellent. We equally enjoy the atmosphere. We usually sit in the bar area and appreciate the calm and quiet setting. It is pleasant whether we are sitting inside or out on the patio. We are able to visit with one another and enjoy the fabulous food from Charleston's. We love it there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v1rxs--wfKWU1UwcXJqHsA"
  },
  "Ow_2gaZDEuHqKUBEHEz3Qg": {
    "date": "6/7/2017",
    "text": "Atmosphere is really nice but the food and service wasn't. Our waitress started the evening by telling us she was tired and had been on since 11am. Great! We didn't expect much after that and we got what we expected. She forgot our drink orders, we had to wave down other waiters to either try and locate her or get what we needed. The food was ok. Nothing spectacular. My husband liked his fish (the special), my kids liked their meals. My parmesan chicken was definitely not parmesan chicken. Dry as can be and barely any sauce and no cheese at all. Our friend, who joined us, mistakenly ordered the same thing and we both agreed the worse parmesan chicken we've ever eaten. I have to say, the bread pudding....AMAZING! 2 stars for the bread pudding....otherwise I would have given it a 1. To finish our wonderful (not) experience, our waitress handed us the bill before dessert even came because she was calling it a night. We still tipped her and wished her well but she definitely played a big part of us not enjoying our evening. Wouldn't go back!",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "6SI7mxYMNPW-Ihit7JTKHw"
  },
  "-nZxdD8r-k7eInMxiD62xA": {
    "date": "12/21/2017",
    "text": "I'm writing this review to support the restaurant, not to complain.  I took my staff here for our annual Christmas party.  We had heard good things and read the reviews, so decided to try it. We also have 2 gluten free staff members and had seen the gluten free menu online. I made reservations so we did not have to wait.  The wait staff took our drink order - 2 of the drinks arrived within a minute or so, the rest of the drinks took much longer - which we thought was odd since the place was not busy.  Our cocktails were ok the first time around, but the second time we had serious doubts as to what happened - the mojito was clearly almost all soda water with the tiniest bit of mint, and the martini was obviously watered down - my thought was it was left in the ice too long to chill it and then poured into my glass - tasted just like water - completely different than my first one.  Two staff members ordered wine - they came to the table at the same time - 1 glass with standard pour, and the other about half the amount - we thought it was a \"sampler pour\" and informed our wait staff.  He said both were standard pours, but it was obvious they were not the same.  Well, that was the end of our cocktail orders. Our waiter, who was very friendly and courteous, was uninformed about the gluten free menu - he didn't even know there was one - or what gluten free actually means when it comes to ordering safe food.  Our food was either mediocre or awful, and expensive.  The medium well steak was so overcooked my staff couldn't cut it - was burned and tough.  The trout was raw and slimy when it was delivered. Both meals went back and the next round was almost as bad.  The pork chops were ok, but nothing to rave about.  I asked to be refunded some of the meal - they agreed to the steak and the appetizers - but when my bill came they had changed their mind to a 5.00 credit for the drinks and a 26.00 credit for the appetizers.  My bill was over $300.00.  We all agreed we would not be back.  As small business owner I suggest the restaurant spend some time training their staff on their gluten free menu, how to make a good drink and better preparation of their food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAm9F4Q2DNMQTg0z74BMdQ"
  },
  "TFo-Ki9xEH0RcEFqbpgFPg": {
    "date": "8/15/2015",
    "text": "I've been there once & ordered the Cobb salad. It was good. Not enough dressing given. Lighting is way too dark, I understand intimate lighting but I feel it's too much. Food & staff were wonderful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oTn3-d9ydAfjeDLDS1A7kw"
  },
  "3PHhZ4TZLYcKoolwo6CAsQ": {
    "date": "12/30/2016",
    "text": "First time there. I was excited to try this place out however disappointed with the service. We had reservations and was seated immediately. Once we reached our table we didn't see our server for about 10 mins. Finally she appeared and asked us very hastily what we would like to drink. After this it was downhill. She took care of the 3 parties surrounding us yet failed to check on us or ask if we were ready to order. I literally had to snag her and request she take our order. I felt so rushed through the process. No small talk, no intro to what the restaurant's specials were, no suggestions-nothing. Very uncomfortable order taking as though we were at an upscale fast food restaurant. As far as the food is concerned- the spinach dip was good, as well as the croissants (that weren't offered). However the $29 filet was mediocre. Minimum seasoning and the mashed potatoes taste more sour then potatoes.   Overall it was not a good experience especially after spending $91 for 2 steaks, spinach dip and 2 soft drinks.   Will not be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "56jhRk2DGSBsJUvYVLALnw"
  },
  "p8kk24s164IGfvn0MmActw": {
    "date": "2/9/2018",
    "text": "Another part of the chain but still good quality food, service and all you want for a reasonably priced meal at nice restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ooSG7AOPOWW938LPgKwhDw"
  },
  "0kMNvxHlVJH9Lbau7d_wDw": {
    "date": "8/3/2016",
    "text": "Best restaurant I have been to. The ribs are my favorite. And I can not forget about the croissants!! Delicious! Highly recommend. But is expensive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZW1mH2B4OLvgiR7FxwQH_w",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Fall off the bone ribs, mashed  potatoes, with fries. All soo Good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZW1mH2B4OLvgiR7FxwQH_w/o.jpg"
      }
    ],
    "user_id": "g-RIDz4W2xKvFHReGHv7Yw"
  },
  "JQEiwY7ax2rMj4rxnWxSRA": {
    "date": "6/5/2016",
    "text": "This is probably the most consistent dining out experience I've had in a long time. The food is always delicious and served with a smile. Once I went with a party of 15 and they were closing in 20 mins, they sat and served all of us and the food was perfect, like they had just opened for the day. Now that's service!! I highly recommend this place to everyone I meet!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EylWr2-mpZJx1qdumOlHDg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Customer Service is top notch! Just look at what I was served after an amazing dinner...Best bread pudding I&amp;#39;ve ever eaten! Warm and gooey",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EylWr2-mpZJx1qdumOlHDg/o.jpg"
      },
      {
        "img_id": "qczU5nP0ahzqL2y4NM1RCg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Catfish Dinner with the best coleslaw I&amp;#39;ve ever tasted and a side of perfectly fried okra!! Outstanding food , every time!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qczU5nP0ahzqL2y4NM1RCg/o.jpg"
      }
    ],
    "user_id": "2-Wi7-qvT3prlYpwTe5c_Q"
  },
  "DBtWVzXXGormj_T7YcbRPg": {
    "date": "1/24/2017",
    "text": "My regular place!  I come here 1-3 times per week. I usually sit in the bar. I know them-- they know me--  all is good. Food is great, menu is large enough for a good selection-- you cannot run out of a beverage-- they have a keep em coming philosophy ( non -alcoholic that is!)  Everyone I bring gives it a thumbs up.  Great service-- very quick- perfect for lunch when you are on the go and dinner when you are not!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WcGExRkvFY7Zuu5LmbKA9g"
  },
  "5MEgue9R9uO_5XKT8HI7dQ": {
    "date": "9/30/2015",
    "text": "I have a severe food allergy which isn't taken too seriously by some restaurants. I was attending s company dinner at Charlton's tonight and I called ahead to speak to them about it. They transferred me to the GM, Michael. He assured me he would be handling my food himself and actually did catch something I was allergic to in what I ordered. He was able to change out the ingredients and saved me a trip to the ER.   Besides the amazing hospitality, the food was amazing. Would highly recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "O29SxGqUckloUVjl1nNfWA"
  },
  "lOPb2nvhOzXSNYCDk2GXcw": {
    "date": "1/30/2016",
    "text": "I love this place. I visit anytime I'm in town. The chicken fried steak is my absolute favorite along with their glazed carrots. SO GOOD. However , on this last visit I was saddened to find  they changed their ambient music to what I can only compare to very stuffy \"soft jazz\". I find it hard to watch a basketball game with Kenny G blaring in the background. I feel like I'm waiting for someone to tell me they'll be right back after this break. It may be be a deal for some, but it is for me.   Flutes and burgers? No. Thank. You.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VRrUX9GQTdoze2Ousdq1ug"
  },
  "w2-t9PEjO7eve_FNvRae2g": {
    "date": "6/14/2017",
    "text": "Great steaks with excellent service. Prices and reasonable compared to large chain steakhouses. Will definitely return",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9nk79H3EPUggT914r_kCtA"
  },
  "S2DAxZQkosdA5hOM9MsB3g": {
    "date": "12/21/2016",
    "text": "Absolutely great. We've never been here before and just happened upon this place so we decided to give it a try. Everything was great from the food to the service. Absolutely recommend it and the chicken fried chicken fried chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QwgX5_nzNionCzkGKi-2Aw"
  },
  "E6Lw4k3aOSxLg4jyp-jbyg": {
    "date": "12/22/2013",
    "text": "Very good food   Awesome service   Price a little steep for the type of food  I will return.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "N6ZTMIue-2b30CJv2tyPGg"
  },
  "zdj35heIXUzOpZrqdAH9Kg": {
    "date": "5/24/2017",
    "text": "Place was nice and quiet and worked well for a business meeting. It was a bit dark, but Overall was a pleasant place to meet. The waitress was attentive and cared for our parties needs. We had time restraints, and the food came quickly allowing us enough time to enjoy our food and meet our commitments. Had the French dip and it was amazing. The meat had great flavor and the bread was nice and soft. Would eat here again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vY0gLHwpb6SvB_BeFo2CUg"
  },
  "34l1V5h73Z8U7MKWq3kJeQ": {
    "date": "5/18/2017",
    "text": "Fabulous atmosphere, I would not take kids, let the adults have a nice night out!  The champagne chicken salad is amazing, the croissants are so heavenly, the steaks are delish!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5RCpAFArF0DaHupR3R09jQ"
  },
  "oOomBPsWBQ6friWc93FJ5g": {
    "date": "1/4/2018",
    "text": "Dine with a party of four and we all enjoyed it. Our server was very patient with several questions regarding food ingredients.  They took special precautions for allergies. I would highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jOm13U6LoqAv2BHrvGCYbw"
  },
  "yeHVARUjJPwstyHFduzymw": {
    "date": "8/6/2015",
    "text": "We had the avocado Chicken sandwich and the French dip along with the creamy potato soup a the honey drizzled croissants! Oh how can I forget the spinach dip and chips! I know a lot for being almost 9pm but when we're in this part of town we have to order all of our favorites at once and we weren't disappointed! Great Food and Great Service! Thanks to Austin our server for the nicely warm wet napkin w/ the lemon on top for my daughter to clean off her hands from the sticky croissants. It was a nice touch, very impressive! Job well done! Oh and thanks for letting me take your picture to post!!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "JdO6gnm8ldAwSUk01pxrlg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Austin.... Was a bit shy but his service was awesome!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JdO6gnm8ldAwSUk01pxrlg/o.jpg"
      }
    ],
    "user_id": "1YNtPgeMbngTpTBO9KMgLQ"
  },
  "faYWp7-8GIaysbzX7V3-0g": {
    "date": "4/14/2015",
    "text": "We came here on a Saturday Night. They were very busy! they even had a waiting list. But, when we walked in we were lucky enough to be seated right away.  No other party of 2 were on that waiting list, so that is why. Service here is spectacular!   Food was great! We got the shrimp cargot as an appetizer.  was very good, but the very best part of the meal.??? The Ribs. As always they were amazing. They fell right off the bone, they were tender and delicious! Great service, great food, and lots of parking. You cannot ask for much more than that.",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 14,
      "cool": 9
    },
    "photos": [],
    "user_id": "DzyBToexbfik0zt7ppky-Q"
  },
  "afqoz3-0B7i9oXVZpo0Q2g": {
    "date": "10/10/2016",
    "text": "I'm from Houston just here on business and looked up steakhouses and this place came up. With its high reviews decided to try it out, got the menu and found only 3 steaks. There was a sirloin, filet and prime rib, I opted for the filet med rare. The food came out great and the service was great as well. Definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eXDrcVqUPo0qYZJqHIq11A"
  },
  "3Zezlat865bb-iwPmYgg6w": {
    "date": "3/27/2013",
    "text": "They have a sausage with fresh basil thin pizza on the app menu that is amazing.  I don't know what they do to it, but it's so damn good.  I've tried the champagne chicken salad which is good too, and Mr. M and I have shared the chicken and ribs entree which is a lot of food, so perfect to share, and we've enjoyed that too.  But we have a regular routine of swinging in here just for that pizza and a beer or a glass of wine.  We've always had great service in the bar area.  I like the dark wood and the booths are semi-private which is nice if you want to carry on a conversation.  The pizza is 5-stars and the wine gets 3-stars because they give a skimpy pour for the price.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "BA9SDRZGyRcUMxTdUTVhmw"
  },
  "MYtFCvADEfNSZVTUWcCLiQ": {
    "date": "11/27/2016",
    "text": "Have been here a dozen or more times since moving to the area, and have had a great experience each time. The prime rib French dip melts in your mouth. The salads are fresh and flavorful. The drinks are yummy, and the waitstaff is always prompt and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AGwgNijIfV5GUuFrNIK4OQ"
  },
  "_CsjszdPMfdkzT0B6uku7A": {
    "date": "9/29/2016",
    "text": "Food was good, but the service was horrible.  The manager was immature and rude the server was nice but couldn't keep our drinks filled.  We were there for 3 hours took an hour just to take our order.  Will never go here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jodYzfaWd7-JOZtG-BistQ"
  },
  "JnV7KnWcl6_4fayUuS1uDA": {
    "date": "8/10/2015",
    "text": "Excellent food and five star service. Best ribs ever. Everything is fresh and portions are large. Warm croissants with house salad are a special touch. I have had mushrooms, fried okra, garlic mashed potatoes and baked beans... All superb. Atmosphere is warm with wood and brick walls, low lighting with table sconces. Your glass with never be empty. Well staffed means excellent customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nG3hnG_8MO3_oRT_9PNhDQ",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. House salad with chunky blue cheese dressing and warm croissant.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nG3hnG_8MO3_oRT_9PNhDQ/o.jpg"
      },
      {
        "img_id": "lCc619iuncA0P7c-X-dmKw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Best ribs!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lCc619iuncA0P7c-X-dmKw/o.jpg"
      }
    ],
    "user_id": "pspvAzicRJxt6ONvry60cQ"
  },
  "0OlChCmi0JRUPc04QMQYcw": {
    "date": "7/19/2018",
    "text": "Charleston's is my go-to restaurant if I want to spend a bit more but get great food and service.  Especially the service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KeXFFcXHhPmKRso-vgQ-wQ"
  },
  "gz0t1VKLeGqwqTvmfMhGrA": {
    "date": "10/29/2016",
    "text": "Excellent service! The food was delicious, and our reservation was respected promptly on arrival. We got a booth as we requested. The prices are comparable, and the baked potato soup was absolutely delicious. The stag is very friendly. I've been here for business lunches and date nights with my wife. This restaurant makes for a perfect choice for either occasion. I highly recommend the Caesar Salad with Grilled Chicken as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gesZf3GWS-CiRamYnuVEGw",
        "caption": "Photo of Charleston's - Chandler, AZ, United States. Delicious spinach artichoke dip at Charleston&amp;#39;s!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gesZf3GWS-CiRamYnuVEGw/o.jpg"
      }
    ],
    "user_id": "k9lB0qt8hYYhhTBB4vJ3og"
  },
  "RzwOVcYHaGgsx1ey4dceWQ": {
    "date": "6/26/2016",
    "text": "Charleston's, in my opinion, is an overpriced Applebee's.  I took a friend here because she wanted to go here.  After looking at the menu and prices, had I been alone, I would have left.  She evidently had her mind set on the chicken piccata for $16 (for lunch), so we stayed.    I got the chicken club salad that came with chicken.  I had no idea the chicken would be fried, so imagine my surprise when it arrived with fried pieces of chicken on top.  They graciously took it back and soon returned with a salad with grilled chicken on it.  The food was good as was the service.  My issue is with the prices.  I don't mind spending $35 on a meal for two, but not at a chain that is in the Applebee's category.  Too pricey, and I won't be going back.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Zlmlq8CDvY-_TIyRSYNC2Q"
  },
  "AuH5nLnr3_-n3UfBWX5yVA": {
    "date": "1/6/2018",
    "text": "Ordered online and had fairly quick delivery via postmates (took him less than 5 minutes to deliver it) and my burger was cold, cheese wasn't melted, and fries were super cold as well.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNJJfieIBFvbAMmOj_e8bg"
  },
  "MGkG_5ZLeFkLYt-nabzaQw": {
    "date": "5/19/2018",
    "text": "I loved this location for many, many years.  Tonight, the food was OK, but the service was really wierd.  After a large, loud, birthday party left at about 9:10 PM, all the wait staff stopped waiting on customers, and began frantically cleaning up the restaurant. It was 45 minutes before closing, but our drinks were empty, we were only half way done with our dinners, and the atmosphere became...Hurry up and Get Out, we want to close.  No more drinks, no more service, at all.  Service had come to a coplete haslt. Suddenly, a waiter rushed over to our table and reached around to drop off our bill on the table, without saying one word.  We were not done with our meals, had not been offered or ordered desert, offered boxes, or given drink refills.  I had to struggle to finally flag down a server to ask why we were being rushed out.  The manager came by, but, I did not feel he was truly apologetic at all, and I found his responses and tone very condesending.  The worst part, was that before the meal I was just saying Charlestons was one of the few places left with excellent service, and even though it costs quite a bit more than average, the friendly service makes it worth dining there.  The manager gave me a free dessert, which I took to go, as I felt I would have been holding the team up from getting out of there, if I ate dessert there, or much less, wanted to enjoy my dessert with coffee.  The whole experience ruined the night, and left me with an upset stomach.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JFUmPybtohSe7TstNPr0Mw"
  },
  "Jcg6GQLOwo8AxkZcy6CiyA": {
    "date": "9/22/2017",
    "text": "Come here often for business meetings. EXCELLENT establishment. Food, service, atmosphere are a 10. Especially the staff. No where of equal or greater price or quality have I ever gotten consistent service from multiple servers the way I have here. Otherwise try the porkchops. Not something I would usually get but YUM.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dREGi-4_jtM4n0hG1FH7-g"
  },
  "LYK2PONBLYzVFwKyHTqNWw": {
    "date": "4/23/2018",
    "text": "OMG...after reading the reviews, I just had to check it out. The croissants really did melt in my mouth. I could've just had a few baskets of those for dinner and would've been happy...but I had to try the suggested champagne chicken salad, and the review was right! Yummy! Of course I was dipping my fork onto other dishes at my table. The BBQ ribs were fall off the bone delish. The garlic mash potatoes were great...and I'm not a potato person. The veggie side was good too...not overcooked like a lot of restaurants. I will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SKJIPdhRDLanPqJhx-W4ug"
  },
  "OOhz-qPt307JopHPMEtg1Q": {
    "date": "8/9/2017",
    "text": "Food was ok. Hickory barbecue sauce was pleasantly and surprisingly delicious. We dined during happy hour but were not made aware of it until the end of our meal after reading the receipt. Had the waitress informed us of the deals our dining experience would've been better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GzRhqsCBOdxol6r2f12f_g"
  },
  "wB1SR3WrUsnyL-yFp914GQ": {
    "date": "5/21/2017",
    "text": "We come here all the time! Today the service was awful! Sunday evening. The place is dead and we are still waiting 45 mins for dinner and only 5 of the 7 people at our party have our food. Maybe next time!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7CASXqW1zBSNReFriuK1AQ"
  },
  "lwoo4D_w5J5_vaygS5KsUQ": {
    "date": "6/3/2017",
    "text": "It was okay, very much like J Alexanders or Houston's.  My food was good but not over the top.  When paying almost $20 for chicken strips you expect over the top.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "enwZYTcr6uX4nUhv-_w2hA"
  },
  "TaKK6p-iBJdotmwqLfWlTg": {
    "date": "11/16/2017",
    "text": "I am not sure about the service as the waiter took our drink orders and disappeared for the longest time. Our food arrived without our drinks. We had to remind him when he came by later. So not so great service. Food was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0yFjo5jaEtXaGNlfhG4uvQ"
  },
  "8NaAWle1AWCd7lnSuv4Z7Q": {
    "date": "6/16/2016",
    "text": "The food and service here is amazing. I loved the dim lights and relaxing atmosphere.  My husband had the ribs and chicken..it fell off the bone. I had the salmon..fresh and delicious.  My kids were totally happy..best Mac n cheese and steak.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VqcQYafPuM6SvtSW5lQFUg",
        "caption": "Photo of Charleston's - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VqcQYafPuM6SvtSW5lQFUg/o.jpg"
      }
    ],
    "user_id": "Q7ERzDZxrsxGzWE_sZ6ECQ"
  },
  "AlPJ13KJq4yGm8Tk7bigag": {
    "date": "1/25/2016",
    "text": "Not only had I never heard of this chain, since it's kind of tucked away, I didn't know it was so close to where I live / work!  My friend Kyle is leaving soon to move back to the great Northwest and invited the roomies out for a steak night.  We arrived and I immediately enjoyed the ambiance.  Dark stone walls with fire sconces and low lighting, perfect for a steakhouse.  Our server was friendly and we decided to get the shrimpcargot as an appetizer.  This tasty dish has shrimp, butter & garlic - in an escargot platter with baked Havarti cheese on top.  The combination of flavors make this one of the finest shrimp appetizers I've ever had!  **IF YOU'RE HERE, ORDER LIKE THREE OF THESE, you won't regret it**  Decided to go with the famous French dip as an entree and that did not disappoint.  The fries that came with were shoestring and perfectly crispy.  The side salad was fresh and delicious - and I had 1/2 of the sandwich to take home for lunch the next day.  I'll be back and will likely get the same exact meal because everything was spot on!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 5
    },
    "photos": [],
    "user_id": "1fPiKjZhkGWLya1QLkwlhQ"
  },
  "efoCACzsBX39bu3AMRqtvA": {
    "date": "6/2/2016",
    "text": "Very good Ruben! My Husband had the chicken fried steak.  I tried his and it was amazing.  I will get that next time. Great food and service. The best sandwiches in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jmuRY0OOK4Y8X7sskM2I7g"
  },
  "YvNJXwTma6wNRxUeDHC-DA": {
    "date": "4/17/2018",
    "text": "Not impressed.....  very limited menu .....  extremely expensive for the menu items..... food is so so (not great but not horrible).   Service is just crazy ...... we had 4 different servers, did not know how the responsible person was.  Applebee's is better :(",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H3z8MKvwKJ9oQ8_-U6mS9Q"
  },
  "PjhCwtBPvfXsF_r64cOVpQ": {
    "date": "6/19/2017",
    "text": "Delicious food and excellent service! I had the Chicken Parmesan.  The ONLY reason they didn't get 5 stars is that the air conditioning just couldn't keep up with the 110+ degree weather and t was rather warm in the restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2FRjZaV6wmsfKeKv_mFhnQ"
  },
  "LAMFWzgRArQFghLPYaPeRQ": {
    "date": "2/20/2018",
    "text": "Thoroughly enjoyed the meal, and server Amber. I loved the baby back ribs they were tender and not overly tangy. Bread pudding for desert (was to die for).....I had the roasted herb chicken with potatoes. The chicken was very tender and the potatoes outstanding. Cocktails . Amber your awesome. We will definitely return with our friends and family!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xSrYDwh-n5nRChnX1pUBBA"
  },
  "qVCsMxDJuwPK7t73TiIN4A": {
    "date": "8/8/2017",
    "text": "First time here and l'lol be returning! The staff was professional and welcoming. I got the ribs which come with beans and fries! I also sampled off my family's plates. The steak was amazing as well as the salads. My favorite is the spinach dip. Great decorum and nice interior look!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jHAydYp1VwySWQ7Ye5S1wA"
  },
  "Zw_0TCJSYumTXyQlO0Q3Xw": {
    "date": "3/16/2016",
    "text": "Really wanted to give them a four.  Jonathan was great.  We ate outside and enjoyed the Arizona nights.    The prime rib was good.  It came out medium but should have been medium well.  The manager did well and brought out a new plate of prime rib and sides.  I was impressed by that!   I would recommend the ribs and the baked beans.  The gumbo was a no go.  The keylime was great!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NpoqP8C5A0saBvMq7YRxBA"
  },
  "jwR7DercEluJIEoZlP3-hQ": {
    "date": "6/26/2017",
    "text": "Very Good Food!  Really nice ambiance.  Servings are large.  Staff was super friendly and attentive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pm83qD6F_uxATt42CDySiw"
  }
}