{
  "igUSc7qs4kDplFgCog5Q6Q": {
    "date": "3/16/2013",
    "text": "Let's say you need a clandestine meeting spot. This is the place. It's a fairly decent sized saloon tucked away in the corner of a small retail plaza. In short, it's off the beaten path and not easy to find unless you know it's there.  Why is this important? Because when it's time to break anything - from your wedding vows - to fourteen violations of the RICO act, (save for counterfeiting) here's where you want to do it.  The place is busy, full of locals, noisy in some areas, quiet in the back room, and, here's the best part, FBI wire taps are virtually impossible here due to the noise level.  Or, let's say you're here on the off-chance to humiliate your concubine with 8 x 11 images  of her doing it with her neighbor kid, again, this is the place.   If you go, try the Sirloin Steak Cobb salad for around twelve bucks. The IPA selection is lame so don't expect a decent beer buzz. In the absence of a nice braciole and a good chianti (and fed's listening devices) Tavern Grille is the next best thing to mama's table.  And when you're done here, if it's not too late you can walk next door to Andreoli's Italian Grocery for a nice cannoli and a Yoo-Hoo.  I can't guarantee there are no bugs in Adreoli's. And no large crowd of people with which to display pictures of your mistress b'jing little what's-his-nuts next door.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "9sldtsoM9MFEyPEss0L9kA"
  },
  "cYSGfP1P8UFmVO4uked8BA": {
    "date": "3/23/2013",
    "text": "We have become regulars here for a number of reasons.  Of course the food is outstanding. They daily specials that make it very easy on the wallet. The service is always been very good.   The staff recognizes those people that come in and have a seat to make sure they have been helped even if it is not their assigned table.   It is the kind of place that gives you that \"Kitchen Table\" comfortable feeling when you sit down.   Beer and wine selection is excellent. In fact a couple of the wines they have available have become staples at our home.   Matt and Ryan, the twin brothers that manage it, make sure that everyone is welcome and they are constantly on the floor making sure the customer is being well served. We love 1/2 price Burgers on Saturday and $6 appetizers on Thursday.   Desserts.  Oh Mercy.  If they have Cinnamon Bread Pudding make sure you get some and have them bring two spoons.  You will need each one.   We have taken a number of out of town guests and everyone has enjoyed their visit to the Tavern Grille.  Keep it up!  Ken Jackson",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gm82yjnfMT9TWUyqwFYbKw"
  },
  "aHBcf8o8fBpMd6g_6i86bQ": {
    "date": "7/25/2015",
    "text": "Love this place! We've been going here for years and have never been disappointed. Love that they have a happy hour special every day. Our favorite is on Friday with $5 sangria and boneless wings. Great service and it's nice to see the owners walking around greeting people and helping out serve the food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CQE_FGl57z1PowodvM0IVA"
  },
  "NEktpm-yIdaudWQWV9WdvQ": {
    "date": "3/13/2017",
    "text": "I had the boneless chicken wings and my friend had the fajitas, everything was amazing and the daily specials are awesome! Everything was superb except the service was a little slow at first. The food came out fast which I was impressed with considering it was crowded tonight.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "stpYujVvfXWauKL9Zf_IHw"
  },
  "rKEY9tMRsu4SlsUo965QyA": {
    "date": "11/23/2010",
    "text": "Slow slow slow It's mostly Sysco and Shamrock Service food, ya know flash frozen then thrown in a deep fryer, then some 'specials' but they're competing for the lunch business of Vermont Sandwich Company next door.  During the day and weekends you have the 'regular' Off Track Betting clients and evenings it's so hard to find a freaking parking spot. It's 'Cheers' of East Scottsdale, all locals and hard to break into their 'clique'.   Last Friday their toilets were backed up and no one could use them (had to go over next door to use their competitors, who were sympathetic & friendly), I thought as a health code violation you had to close your doors over this.  But if you only have one hour for lunch and plan to go, be prepared in a slow slow afternoon return to work.",
    "rating": 2,
    "rated": {
      "funny": 11,
      "useful": 12,
      "cool": 10
    },
    "photos": [],
    "user_id": "HqArcGli2YESf7OeCqmZhw"
  },
  "4J-4z5xld71asVQkp12avw": {
    "date": "3/28/2013",
    "text": "Came here with my family for dinner after it was recommended to us.   We were told that they often have awesome 2 for 1 daily deals or coupons. We were given ones for 2 for 1 chicken or steak fajitas.   I had the steak fajitas and thought they were delicious. I also had a glass of white zinfandel , which was really good and sweet. My stepdad had a bloody mary and liked it so much he ordered a second ( rare for him). Everyone enjoyed their food/drinks and the wait staff was friendly.  Would definitely return on my next AZ vacation",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "hLlmddIRRXKV8Dv_vTjxAQ"
  },
  "IEoDcV-8YFmpJeVMw8P6Zw": {
    "date": "10/28/2012",
    "text": "My first impression on an early Saturday evening was that this place basically had two types of clientele.  The over 55 crowd and the gather around the bar and yell at the television crowd.  We sat with the over 55 crowd.  My kind of people.  No small children.  Tavern Grille also has some pretty good specials.  Saturday is half price burgers with purchase of a beverage.  I ordered the Ultimate Tavern Burger which is a half-pound cheeseburger topped with guacamole, bacon, grilled onions, green chiles and mushrooms.  Yes, the healthy one.  The burger itself was pretty good, but the onions were not remotely caramelized.  Tasted more like steamed onions.  Raw would be better if they're not going to do them properly.  Also, while the homemade bun was nice, it could not hold up to the toppings on this one.  Burgers are served with choice of french fries, tots, steak fries or a slaw.  The french fries were hot and crispy.  Service was mediocre at best.  We didn't see much of our server and food was delivered by someone else.  We were mostly through our meals before the server returned.  I never did get my soft drink, but was charged for it.  When I asked to have the charge removed, the server started to tell me I couldn't have the special unless I paid for her error.  I don't think so.  She caught herself when she noticed my husband had two beers.    Overall, an A-okay place for a bite.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Rzf35jKV8e8EJdssrae_AA"
  },
  "QfhWonaTibi6IFAAesy58g": {
    "date": "12/4/2015",
    "text": "My Friends and I stopped in for a couple Of drinks and appetizers.  The happy hour menu runs from 4:00-6:30. Great deals on Martinis and cocktails. Top shelf for only $5.00.   He bar area was jamming. There is also a large outdoor patio with a fire pit.  We ordered the ribs and pulled pork tacos off the happy hour menu.  Very good!! I will be going back... For sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f2suoJz6zUaCZWxo2I17aA"
  },
  "nPPzKVDzJPGz6-IYRqTaRw": {
    "date": "7/23/2016",
    "text": "Excellent food.  Terrible service.  We stopped going for about a year because the service was so frustrating.  We recently tried it again and remembered how good the was.  I would suggest sitting at the bar or in the back room for the best chance at good service.  Go on Monday if you like fajitas because they have some of the best.  Avoid using the restrooms here if you can.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SiSEipRTY7KjaYzxoU5YDg"
  },
  "QomypNVtjCPTie_YpMtDbw": {
    "date": "5/31/2014",
    "text": "Absolutely AWESOME place! Great service, great ambiance, and delicious food! So many choices on the menu and everything is fantastic! New favorite restaurant!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EuqS_wzOHE1Y8bihAojtIQ",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EuqS_wzOHE1Y8bihAojtIQ/o.jpg"
      }
    ],
    "user_id": "DJOA8dYwi-TcoYfkc_iGgQ"
  },
  "6xeKZ_ASbugAVFBY1X0qOw": {
    "date": "3/6/2015",
    "text": "Great fun Great food Great Daily Specials! Great TV to watch favorite Sports teams ESP NFL! Bet on Horse Racing right in bar !horrible service last times I was there! Not going back for a long time!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZQy0gpxKfJXJUU-GK9S6ZA"
  },
  "agjc3uFL8Nq-8Ts0R-6tXA": {
    "date": "2/7/2015",
    "text": "Simple ! Jus the best Bar food in town .. Never a bad visit ! Smile on every one face that leaves here !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQcR_PTJVGJ3pgBBctOTXw"
  },
  "5HLYPr0eqIil4piDjYqZCg": {
    "date": "11/5/2015",
    "text": "The Tavern is my joint to go on a Wednesday to get lunch time wings. The service and the food are always great! If you are looking for a great hideaway or need to unwind for an hour or two, I suggest you check out The Tavern Grill. I promise you'll  get addicted!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k7rfRnV1JIXmlnQRdR8c2w"
  },
  "QPpD18zFl3-F3HNfRMYAdg": {
    "date": "2/9/2015",
    "text": "I like the Tavern Grille mostly because it's a sports bar that gives a little more variety in their menu. Food is always great here. Service is okay. If your still hungry after sitting there for fifteen minutes waiting on someone to acknowledge you then this is the place for you. That's the only down fall to Tavern Grille.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MCkPAIhnv2AHfWXP8cOd8Q"
  },
  "GWKxKPQhivWcQexz3zzbsA": {
    "date": "11/28/2014",
    "text": "I love this place! They have the best menu and a happy hour deal every day of the week on different featured items. The fried chicken salad is the same salad I get every time I go. So great and good service too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "boUCLTYLqPvXiwK6scbMbw"
  },
  "FclQfgNGW2KakHkIUm73tw": {
    "date": "7/2/2012",
    "text": "I have been coming here since the late '90's until recently when it was still Teakwoods. Recently popped in for a lunch and ordered the wings. For the record, Teakwoods, which was an offshoot by the owners of the Original Long Wong's on Mill - carried on the tradition of having the best wings in town. Now the tavern has messed up the wings, the're small and they changed the sauces. YOU HAD THE BEST WINGS IN TOWN WHY SCREW WITH IT?  Also - bye bye to the free peanuts you can throw on the floor. Someone too lazy to sweep up or what?  BOTTOM LINE: It's been good run. Not sure I'll be back.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "NKzLGod9KhAItpe73lI6OQ"
  },
  "-i7w7AfxLScwl1oVNcBlNg": {
    "date": "2/1/2014",
    "text": "I love the Tavern Grille!  We have been here many times and the food is fantastic! They have great specials (even outside of regular happy hour), a good selection of beer, and fantastic service.  Only negative--I wish the place was bigger.  We have been in several times when there was just not a place to sit!  We like the bar area, so are always a bit disappointed when we have to go back to the dining room.  Check it out!  They do not disappoint!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "54tS2NsSsJpv_lKpSBLV9Q"
  },
  "5qbHbepow-dbqX8vXnS_kw": {
    "date": "7/24/2014",
    "text": "Great food it's a little bit expensive but I think worth it.  Lots of TV sets   the decor is not great",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LNuZ3o1e6Erlik84RoJ-Lg"
  },
  "voLP-5bcI0fHZN2mnJX_Cg": {
    "date": "10/21/2014",
    "text": "The food here is good quality pub grub and the servers are all very friendly and attentive. Daily specials are a good value. 1/2 price chicken night is our favorite night. Good for families and large groups. Perfect place to watch games.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7gUNFD2cIutY_Dac5tf_YQ"
  },
  "RDolgKwuZWMTG99uPqL1OA": {
    "date": "5/29/2012",
    "text": "this is our go-to work happy hour spot...it's close to the hospital (don't know if that's a good or bad thing) and they have really good happy hour specials. everyday of the week they offer a food and/or drink special. i have never been here and it not be full of people. even older folks seem to fill this place up (and by that, i mean older than me).  the service has always been super friendly and this time was no different. about 6 of us had a few beers and our server was fast and efficient and the beers were filled to the brim. i was hungry so i ordered the vegetable pita. it was ok. bar type food. it was packed though, with almost too much cheese. the grilled veggies inside were slightly too oily for me. the fries however were thin and crunchy and salty...just right.   i've only been here a few times and each time i always leave happy and satisfied...probably because i drank a few beers. nice reliable spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "G-_KF_Ul4d3WGEa-G0Iq4g"
  },
  "IJ2KT6vfI5zZp6cWHhjAHQ": {
    "date": "2/16/2017",
    "text": "Great late lunch in a comfortable booth watching Trump news on a big screen TV. Super great wait staff. All 3 spoke with me and offered to help. Pastrami & Swiss on a fresh sub roll was delicious. Terrific hot fries...and I'm not a fries person unless they are WORTH IT. Asked for hot to order and I got it. Large plate...I hate small dinner plates when your order is falling off the plate on a public table. More fries than I would eat.  Must be that princess stomach of mine.   Great way to re-coup after an incredibly demanding 11 days.   Heh, Thursday appetizers are all $6 all day.  Desi came back to table several times to make sure her customer was A-OK. Check out their daily specials. Zoom in on chalkboard. I need to get back here on a Wednesday for $6 dozen wings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w4fxMBfmckqunkB8nlPHAQ",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Pastrami &amp;amp; Swiss on a FRESH sub bun. Terrific fries. They&amp;#39;d make McDonald&amp;#39;s nervous. .",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/w4fxMBfmckqunkB8nlPHAQ/o.jpg"
      },
      {
        "img_id": "alAkWlk8WVWClsxT2j1kLg",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/alAkWlk8WVWClsxT2j1kLg/o.jpg"
      },
      {
        "img_id": "gFLp9a_LIAP5LjBh_pElXg",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gFLp9a_LIAP5LjBh_pElXg/o.jpg"
      }
    ],
    "user_id": "WofPyl-HIpWkAAw7d_Dihw"
  },
  "9ptxuX7Q0Fh89Qix-J9VSg": {
    "date": "8/4/2018",
    "text": "Wow! First time in and we sat at the bar. I asked to try a beer and the bartender, Desire, brought me that one and another stating that my choice had an aftertaste. She was right and I'm so glad she helped.  We ordered dinner and everything was delicious and hot! You definitely won't go home hungry and the service was incredible. I'm making this one of my new favorites.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zqKTPzHGM80eulF4XeRJwQ"
  },
  "6IhbrkrUP4mrRm6QJWi4WA": {
    "date": "8/5/2015",
    "text": "My first experience was awesome. I'm kind of an introvert by nature. I'm shy and I don't mind eating by myself or going to new places by myself. I really have to force myself to talk to strangers. It's like a test to force myself out of my own shell.   Point is, of all the places I've been in Scottsdale, only 20% is cool. By cool, I mean real ppl who just want to have fun. Not ppl who want to be somebody they're not. Scottsdale is full of pretentious, \"I can't afford to hang out here\" wannabes.   But Tavern Grill is not that. Most of the time I am not all made up, meaning I don't wear makeup and don't dress up. Anyway that didn't bother them. I walked in wearing a baseball cap and regular clothes and the girl was happy to see me. I sat at the bar and was greeted by a friendly bartender. She gave a me a menu and took my drink order. Another bartender took my food order. She asked questions on how I wanted my food prepared, making sure I would eat happy.    I was really impressed by the staff here. I mean, they actually did their jobs. The bar had lots of tvs and great daily and happy hour specials. They had original sauces for their wings. Yum. I'm definitely coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "bBRkJp59aKz5kiypt2WjFg"
  },
  "lpVoaP2mZBBNfcyup30d_Q": {
    "date": "8/26/2016",
    "text": "Eh, this place was okay. Pretty much your standard sports bar. Probably good if you just want to order drinks and watch a game at the bar. Food was mediocre, my fish was over cooked and the boneless wings look more like calamari. Service was not great. We were not brought waters, had to ask for condiments several times, were brought checks before being asked if we were finished. Not terrible, but I probably wouldn't go back.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DziZQWS1hCjUDF_Bnx_zHw"
  },
  "jYfWI5sQa8D6_-XHVciYGA": {
    "date": "6/11/2015",
    "text": "As you leave Tavern Grille, you pass a long trough filled with mints and lollypops.  Cute.  I took a grape candy.  It was the highlight of my meal unfortunately.  Tavern Grille earns its three stars by a solid performance everywhere but the food.  It is an inviting venue, the service is fine, the menu is extensive for a sports bar, the portions are large and the prices are quite reasonable (particularly the daily specials).  Even the food has a lot going for it.  Most of it appears fresh and of good quality.  The blame falls squarely on the preparation.  Let's start with the chili - I don't mean you.  You should definitely not start with the chili.  It is overly acidic, short on beef, and believe it or not, it needed salt.  I have never had to season chili before.  Amazing.  I ordered my burger medium well, and it came out so far past well done that the burnt crust was actually hard to cut.  It was also bland, unimaginatively dressed and poorly bunned.  At least the bread didn't get soggy -- how could it, there was no moisture at all in the meat. Time constraints prevented me from sending it back.  On the way out, my wife mentioned that the burger was badly overdone and the hostess laughed and said we have to order it medium rare or rare.  If they know about this, why haven't they fixed it.  Wake up, manager.  The Philly steak seemed to have good ingredients on it, and was the best choice, but the salt shaker got a lot of work on this one too.  The steak fries were ok once you salted them.  Oddly, I might go back.  Everything else about Tavern Grille is so good I might risk a repeat fiasco hoping that the cook who worked on our food this time was having an off day ... probably not.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "moj7DUHkP4j9yfwFm-oOHQ"
  },
  "jciD_GFqBLSlx5gafU-aEw": {
    "date": "11/25/2017",
    "text": "Great place- especially at Happy Hour- $5 Johnnie Black and Tito Martinis.  Burgers are great-as is the Grouper.Lovely wait staff. Stay away from the over fried chewy Calamari however!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oGduluoUu_v7D6q0UmYFGg"
  },
  "Tpu4ZHCHHT5OHK9PVoXZQA": {
    "date": "6/4/2013",
    "text": "amazing service. I mean it, between the managers Ryan and Matt, yes they are twins, don't worry you aren't seeing double. The bartenders Angel and Cody are fantastic and I have to say I was SO impressed with the servers Alan and Desi tonight.  All day today, the restaurant donated 10% of each bill to an amazing local animal rescue that my mom and I are affiliated with, and have rescued from. But tonight, Desi was beyond accommodating. We took over a huge table, had about 10 people come and go, and she was so quick with drinks, food, and everything else that my head was spinning.   My family and I go to Tavern every weekend to hang out with our friends, drink, eat and be merry, and they take such good care of my family. Also, they have a dog friendly patio!   Thank you for taking care of us. Food Suggestions: Southwest Chicken Salad, Boneless Buffalo Wings, Zin Burger, or the Grilled Chicken Pita.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1Sx9K2E0_O85OVjeM_1FjA",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Half off bottles of wine on Wednesday!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1Sx9K2E0_O85OVjeM_1FjA/o.jpg"
      },
      {
        "img_id": "dIoEHACGP9fjXPqMWXcm5w",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Family burger day at tavern- thx Desi &amp;amp; Cody! No thanks to Matt who thought it funny to lock the door when he saw me coming :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dIoEHACGP9fjXPqMWXcm5w/o.jpg"
      },
      {
        "img_id": "vXJLHgWItg7cWsw--M2HTw",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. The Dutchess of Tavern on the right!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vXJLHgWItg7cWsw--M2HTw/o.jpg"
      }
    ],
    "user_id": "4gPnK4Q74fqPQ7p2eIt2wg"
  },
  "Zh_qwyXbong5p58xICCHxw": {
    "date": "5/1/2017",
    "text": "Great Food, Wonderful Daily Specials, outstanding Service for Great Prices. Unbeatable in so many ways but come early or late to avoid the rush.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P5sIeGBWQNBA2qBBCuQxhg"
  },
  "MDMHDTvmYdmi4mC2lgT3VQ": {
    "date": "7/7/2018",
    "text": "Great all around!  From the owners (twin brothers) to the waitstaff, kitchen crew AND cleaning group.......food and drink special!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YS_udr-aRwrlkGZyXBbvPw"
  },
  "BHP78gOYbMGwq0pZH6zVxA": {
    "date": "12/4/2017",
    "text": "Enjoyed this place! I ordered a fillet medium well with their garlic potatoes and asparagus YUMMY. Steak was cooked just right and tasty ...very VERY reasonable price. The staff is very accommodating and attentive.  They kept filling up my mom's coffee cup ...mom was impressed with that!! The restaurant is very classy inside ...dark wood, cloth napkins nice big fireplace. Their butter cake is to die for!!! We had an enjoyable time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yG-TR6GkwogZ_p1ndGCUFA"
  },
  "WzFBtd7Lrn2zazmDp1DS2w": {
    "date": "12/30/2017",
    "text": "CANNOT BE BEAT!  This is a statewide gem; if you are looking for truly OUTSTANDING food, cocktails, service, and the most friendly/upbeat/positive vibe ANYWHERE, this is IT!  Owners are tremendous; they are there daily to support their associates, customers, and create an atmosphere that we always compare to the television show \"Cheers: where everyone knows your name\"  NEVER had a bad meal or experience; this is OUR go to place!  Make it yours too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rPylnRM2E2Y140tZzdVFoQ"
  },
  "zUMez-vmNsojLXzw5rrUeQ": {
    "date": "8/27/2017",
    "text": "Very slow service, food tastes odd, coleslaw is rotten. It's rated 4 stars but the food is terrible. It's a sports bar, while everybody watches horse racing. We just wanted to leave and go home. We were going to go to Portillos with my sons, then my wife pointed out that this place was good. I had also  heard of this place and wanted to come. We came and my sons were starving. We ordered southwest burgers, and had to wait 30 minutes for food to come. We started eating and my son said it tasted weird. I tried it and didn't like it at all. Even the wedge fries sucked! I definitely don't recommend it, and don't waste your time and money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V2ezU3LZVKIrIFPwkE4d5A"
  },
  "_7lDXvwnwkfhCLkxSzu9JA": {
    "date": "9/30/2016",
    "text": "Not really sure why it takes over an hour to make a salad with no meat and a chicken sandwich. The moose dip was disappointing. No reason to come here ever.  We asked for our check and wanted to leave. While the owner said he'd buy our dinner, we had spent enough time at this establishment. We asked the owner how much the tab was he wouldn't tell us. He just kept saying he wanted us to stay and eat our dinner. We just wanted to pay our tab and waitresses. He never told us. We left $60 to cover our $9 appetizer, 2 cocktails, and one beer. Sure, he tried to rectify the situation but we told you no, we don't want to stay countless times.  Sometimes you can't fix your poor service.   Icing on the cake... My night off of grad school and work... Wasted. Waitresses, you did well.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HnK2qPTBSvGCkOfX4xbtqA"
  },
  "zWLm0KkvvPwi-7J68li8ow": {
    "date": "10/2/2016",
    "text": "Food was average, no complaints. Two stars because the waiter helped himself to my change when I paid. Of course I intended to tip him, and everyone else at my table received their change, but I had to ask for mine. He pulled part of it from his pocket and returned it, yes I said part of it. After we paid he completely ignored our table, we didn't get refills.  Won't be returning.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A5HTKnGWbdyQHde-reHJYg"
  },
  "vWNk-4wK5QxOwxel3Pbqhg": {
    "date": "11/18/2017",
    "text": "Awesome neighborhood bar and grill. Owners are the nicest guys in the world. Daily specials make it worthwhile. This is Cheers where everyone knows your name!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Rzoi8m9qd6rXhgBOpFlgog",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Rzoi8m9qd6rXhgBOpFlgog/o.jpg"
      }
    ],
    "user_id": "tY0V9FDzQu2w_nhF2gfGJQ"
  },
  "WnOyE_rpLcxrPpJ8yAodoQ": {
    "date": "6/2/2018",
    "text": "This is my favorite place to eat.  They have something for everyone and everything I've ever had here is amazing.  The other big thing is the people.   They are all so sweet and helpful.  I appreciate their friendliness.   It feels like I'm with a group of friends when I'm there.  The burgers are the best anywhere and on Saturdays they are half price.  The jalapeno cole slaw is so tasty.  You can't beat this place .... honestly.  The prices, the food and the company are superb.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z79uzGOB7o8KSIxKI12CEg"
  },
  "Ybz0uh6YMZ09KU8NMgoPnQ": {
    "date": "11/26/2017",
    "text": "Came in for 1/2 burgers! Food is worth the wait! Our server Sarah was excellent!! Our drinks never went empty and everyone at our table was satisfied! Sarah was very welcoming and super sweet! We will be back and ask to sit in Sarah's section again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4CwUm-KIWJcGpFEMgjmN2Q"
  },
  "jGinHNIQmidPUclcSITB1Q": {
    "date": "9/17/2017",
    "text": "First time here for Sunday football. Everything was good, wait staff was great! Manager came over to double check that everything was good! Will be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kz9EL28S72YioOwssh5o-g"
  },
  "vlJt1ftreWyC6VFVuRYN2Q": {
    "date": "2/19/2018",
    "text": "The servers seemed to be short staffed.. Two of them were on the floor and seemed super busy. So our service was not the best. I had the buffalo chicken sandwich that had NO flavor what so ever it seemed like it was a frozen out of a bag piece of chicken that was tossed in the microwave type of chicken. The best tasting thing of the lunch was the Diet Pepsi. The place is very dark no lighting and it was 12 in the afternoon.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2okF6ha_6-jqjhjhKfuOrw"
  },
  "qFR-JZgC4m_lPHAEFulxeg": {
    "date": "1/3/2017",
    "text": "Awesome place--great food--casual--great happy hour and daily specials. Family friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jGR3erhsOXlpHZnmlEw8sQ",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jGR3erhsOXlpHZnmlEw8sQ/o.jpg"
      }
    ],
    "user_id": "9gDb8LZUQd1T8wTisqKavA"
  },
  "rPFN9iVbuauKf3xAsEz0zA": {
    "date": "11/2/2018",
    "text": "This is ALWAYS my go to place, despite my families wishes,  (they get a bit too tired of it sometimes). I love it because, it's close to home, it's a neighbor restaurant, it has a long established history, they have great food (& a wonderful variety of it!), they have a full bar with great drinks & TV's of all sizes, everywhere, tuned to the latest sports. They even have horse betting & at least 1 pool table. Rarely are you unable to find SOMETHING to satisfy even the pickiest of eaters.  Eighty percent of the staff has a great attitude, the other 20, not so much. (Hope mgmt is reading this!).  My only complaint is the wait. I can understand having to wait 30-40 min to be seated for a popular, great restaurant. But,  there are times when they aren't busy, the sign says to seat yourself & then you wait & wait & wait,  sometimes just to be acknowledge, once you're sitting. Sunday eve we walked right in, were given menus,  offered drinks & asked if we knew what we wanted. We were waiting for our son & his girlfriend, and told him. He said he'd ck back in when he saw them. The man at the table next to us said, \"Well,  at least you have water. No one's even said hello yet. \" & got up & went in the direction of the kitchen. We've had that happen to us before too. One waiter is right on, there other is AWOL.  Overall, any wait is ALWAYS worth it tho.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nPGxTLjP6nnY2FlNKhFKqA"
  },
  "TqhEfj1m52c6YZALxfsaLA": {
    "date": "3/8/2018",
    "text": "Our waitress Mallory is awesome, our annual Dodgers pre-season dinner. Come down and see her she is awesome...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h0HJNrLdjYqR4tHjcmujxQ"
  },
  "LoZMXFSL12c5ljx-rM2qQQ": {
    "date": "10/6/2018",
    "text": "This is a great casual place to go and they have OTB. Great happy hour drinks and appetizers. Staff is prompt and friendly food is good. Nice size bar and family friendly. This will definitely become one of my regular stops.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQLWcN-gRpmDhxHrH8K8kw"
  },
  "gNOxBlgxxD0mvpOMTIo_og": {
    "date": "4/22/2016",
    "text": "This restaurant has immediately become a family favorite.  We just moved to North Scottsdale and were recommended to try this place.  We've been here twice and the food and service is delicious.  The waitresses look like models which as to be part of the appeal of this location. It aside from that my wife gets the Tuna Melt and I get the Cobb Salad.  The kids have gotten the chili dog.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ePTT_O7xz5sToBDu0UA2vA",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Crispy chicken chicken salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ePTT_O7xz5sToBDu0UA2vA/o.jpg"
      },
      {
        "img_id": "SZ6B43mrR8eWA0VdGW3jsw",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Chicken bacon mac &amp;amp; cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SZ6B43mrR8eWA0VdGW3jsw/o.jpg"
      },
      {
        "img_id": "ED-mfv1WEc_gR_0zz_Z46w",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Chili cheese dog",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ED-mfv1WEc_gR_0zz_Z46w/o.jpg"
      }
    ],
    "user_id": "sabwyIBd5jMWNimKVNllaQ"
  },
  "0YGGwj2rnShXJuOCDqHK1A": {
    "date": "2/18/2018",
    "text": "Second time visiting. Generally a good experience. Food was good but the chicken in my Mac & cheese was dry and tough. Service was ok given their full house and bar. Additional server(s) would have helped. Not enough negative to say I won't return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jw0WR6JvVKOPJ1PF-NtdLA"
  },
  "y7atcM2ReUY2Y-VXx6wLMg": {
    "date": "11/6/2018",
    "text": "This place never disappoints, but their taco Tuesday is the bomb!  Ground beef tacos for under $2 that are the best I've ever had!.... fish for just a buck or two more rival the best places in town and kill... combine that with plenty of TVs, a great, attentive, friendly bartender staff, an owner that actively meets and greets (and appreciates!!!) and you have the makings of a GREAT weekday (and weekend) haunt.  You CANNOT go wrong here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GCdTEZumAyf2eMR3wCAo0w"
  },
  "ydF1YC-NVWJUemoA-qqYuw": {
    "date": "5/31/2017",
    "text": "Good food and friendly staff! Families with kiddos are welcome, they even have a giant tub of candy right when you walk in. We had our 2 boys (6years old and 9months old). Only downside is loud music if you do being kids. Lots of tv's playing a variety of sports: baseball, hockey, horse racing, etc. Small outdoor space, dogs were welcome. We saw a couple of them when we went.   The sweet potato fries are really good! I got the crispy chicken sandwich. It was good for the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JR6wEvVHxvl9rE3_Vuo7cg"
  },
  "tK7qhLxgJROraRaul1zvhA": {
    "date": "1/21/2018",
    "text": "Terrible service ! We waited for a long time just for someone to acknowledge us.  Never once did we get a hello or we will be right with you..., the servers literally checked on all the other tables and walked right by us.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LhegY99KE3YyL-aHLO47fA"
  },
  "4vhfHlvogj8HboQTOuebDg": {
    "date": "10/12/2018",
    "text": "The best hamburger Mac n cheese hands down. Fantastic service and amazing food. Ricardo our server was great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TVzUpWQ1SCS87Z1UoE23zg"
  },
  "BcVTO0-CUp9JCJuOZy_d3Q": {
    "date": "1/9/2016",
    "text": "I have not been here since it is a teakwoods. Still a Good sports bar. Lots of big TVs, good draft beers and food. Will be coming back.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "2SF5bQ7cNmbb5ytiU2RNfw",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Swiss n bacon burger w tots",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2SF5bQ7cNmbb5ytiU2RNfw/o.jpg"
      },
      {
        "img_id": "l9AB31UEYKpjDb91g8NwGQ",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Bar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l9AB31UEYKpjDb91g8NwGQ/o.jpg"
      },
      {
        "img_id": "pOkEUF3_vnkK3e0t1xou_A",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Swiss n bacon burger. Cooked perfect med-rare with tots.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pOkEUF3_vnkK3e0t1xou_A/o.jpg"
      }
    ],
    "user_id": "KxGeqg5ccByhaZfQRI4Nnw"
  },
  "usGTGMRlapmK8Q1cNfgxgA": {
    "date": "9/6/2018",
    "text": "There is no better crew than at the Tavern Grille. They will take care of you from start to finish - food/drinks/Happy Hour!  Quality, friendly, and a great menu!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xNB5zwwbsYuXjHQrz0EV5Q"
  },
  "QASmB45p2uX-hhSBqzmTyg": {
    "date": "2/25/2018",
    "text": "This place has a big menu with lots of options. Everything everyone has ordered has been good both times we went. The waitstaff is friendly and attentive. This last time, we had an issue with having to wait because there were 2 huge parties that had just been seated and they were tight on staff -- anyway, the manager was super nice, honest about the situation, and took care of our dessert! Great customer service right there - we definitely felt cared-for as guests. Plus - it was the best bread pudding ever. EVER. I'm not kidding- get the cinnamon roll bread pudding- it's like the best part of a cinnamon roll - the middle- but in a huge, family-share size slice covered in frosting. It was seriously so good. I'd go back just for that (I probably will!!). Great place - give it a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jgX0e7L29ZiUhh-oD72B_g"
  },
  "MwCllAZ277s_fSC5C0KZIw": {
    "date": "2/19/2018",
    "text": "Great place, the food and the atmosphere is awesome.  Even ran into \"Tony LaRusso\" the other day.  He loves to bet the ponies and is a fan favorite of the employees.  Keep up the great work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zx4xZsz5S7t-eUkQ0UQhvg"
  },
  "YmYGI7X6rXvRdQFIJ2SIVA": {
    "date": "9/17/2018",
    "text": "This was my first time here. The specials are amazing. The burgers were so good.. our waitress Sarah was fantastic.  I had a slight issue the next day but was handled immediately with the Manager Matt. I would highly recommend this place!!!.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HryPZ2bRMf7r2oA0wI_hYA"
  },
  "pDfv24W2rgRE4eJltmhoHw": {
    "date": "8/29/2017",
    "text": "Great taco Tuesday, great staff, and a really fun environment to be around. Will be coming here for another fantastic time. Would recommend to everyone and anyone that is interested in having a good time with family or friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d5NeNomxxEMXCO4e_IiGxg",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d5NeNomxxEMXCO4e_IiGxg/o.jpg"
      }
    ],
    "user_id": "ugCijxRRH5BXnWtyGsJvuw"
  },
  "Nk-ztk09-gSap1ptZQ-vCg": {
    "date": "6/8/2017",
    "text": "This place is a great laid back bar with a friendly staff. The bar food here is far better than your typical bar food. Lots of tvs and have off track betting which is great for the hot summer days",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EPxpZD507rSOKxI2kAPoaQ",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Best tots in town.. order extra crispy",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EPxpZD507rSOKxI2kAPoaQ/o.jpg"
      },
      {
        "img_id": "Ztny7z5-1TtloUZ_bKKp8A",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Drunk shrimp.. delicious! large shrimp and a spicy wing style sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ztny7z5-1TtloUZ_bKKp8A/o.jpg"
      }
    ],
    "user_id": "JSwrBhTkRPRAwmTda7lbnw"
  },
  "HKdHGme15FH6enQ_Haf_Ow": {
    "date": "9/24/2016",
    "text": "Yelpers are you out there.  Listen up.   Sports bar. Not even close.  It's an under the radar off track betting horse racing venue. It's Saturday in the thros of college football and of the 20 plus TVs only maybe 5 have the games on and only because you beg the bartender to turn the game on.  Be careful not to piss off the gamblers as they will have your head.  They even have an off track betting window at the back of this place. Instead of hearing cheers for your local team you hear \"go go oh man I can't believe that horse came from behind. \" If you like hanging out with older guys who care only about horses this is your place.    I came out thinking this was a great sports bar based in Yelp reviews but not even close.   At one point the entire bar was nothing but guys all watching horse racing.   Really. On college football Saturday.  I'm out.  Forever at this place.   This is coming from a guy who is very flexible and very open to most places.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 10,
      "cool": 6
    },
    "photos": [],
    "user_id": "S15xlPJpL057M1pSa6lwrw"
  },
  "MbEvkm1csnlRo5oxysGA4g": {
    "date": "2/26/2018",
    "text": "I love this place. Amazing food, drinks, happy hour, food, and local brews. The owners are always friendly and attentive. I stop by every time I am in the area, especially before/after Spring Training games!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TrF5IsGTLA4on-_KU_8w8Q"
  },
  "V_dmdmudnXnVnrSp9EEbLw": {
    "date": "1/19/2018",
    "text": "This place is one of the best values in Scottsdale. Great Happy Hour and their daily specials are awesome..1/2 off burgers,  chicken sandwiches,  appetizers...where do we start? Ok...start with Angel. I think she only works a few days per week, but if you catch her, you win.  Steph is great too...overall, a really cool bar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x0_TTY4qYkiOFFNxuVnK4g"
  },
  "XZR9XKLdkHVbh13DPG3Sfw": {
    "date": "11/27/2017",
    "text": "The food was par... At best. But the manager seemed eager to please and very open to recommendations. I only hope he accepted them. The atmosphere was perfect, for a restaurant and pub. The waiter could have been more attentative, but all in all, not a bad meal, and a decent experience all together.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "StS_0juUqGu8pENKvN4PGQ"
  },
  "iOYLtB98rrCfLCqUipAXdQ": {
    "date": "3/13/2016",
    "text": "Fantastic. I went to this place with 8 of my cousins and we all ordered very different dishes. From gyros to patty melts everyone's food looked amazing. Every person thought their food was the best dish, something that never happens with this many people. I personally had the buffalo chicken sandwich, which you can put any wing sauce you want on. Everything is very customizable and there are like 6 substitutes to your fries on the side. I took a couple of Tums and expect to ride the porcelain for an hour or two when we get home, but hey that's all part of the experience. I had absolutely no issues and would definitely recommend this place. Check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WeKWW77iu9byBy7Nqf247g"
  },
  "0QMhNrFPJUzHDmcgaXIljg": {
    "date": "6/15/2017",
    "text": "Great place to grab a bite to eat and a drink and watch the game. Staff is very friendly, and the daily specials are good. Sarah was our server and she was super helpful, and very attentive. This will definitely be our go-to place from now on!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SMISaf3fBohNHPggeHoM_w"
  },
  "_UwuVOfTH4TkSjVPDoU1Ng": {
    "date": "9/3/2017",
    "text": "This place is awesome! Every time we come here we have great service and the food is always good!! They have off track betting which we love!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mtBdAdQ_hZacYbG6KmCAPQ"
  },
  "IKJsSb1CeKLkAnaq4MMxNg": {
    "date": "5/12/2017",
    "text": "I used to come here regularly, especially for NFL Sundays, back when it was a Teakwoods. It was easily my favorite sports bar at the time. Yesterday, I agreed to meet a friend there to get some dinner and watch the Dbacks ... We took a table in the back room and looked through the menu.  On Thursday, the daily special was any appetizer for $6 so i decided to order a couple as dinner. My friend noticed the menu included a \"sloppy dog\", a hot dog smothered with sloppy joe, but no sloppy joe on the menu.  So we asked whether they offered one, the waitress said yes, so he ordered it. I ordered the Drunken Shrimp (normally $13) and the Ultimate Nachos, which normally come with chicken or beef, but I ordered it with sloppy joe instead. The Drunken Shrimp is easily the worst thing I have eaten in some time.  The shrimp were overcooked well past the point of rubber, they were actually vulcanized. The menu describes it as \"Shrimp, garlic, beer, wing sauce with garlic bread for dipping.  If there was any garlic or beer involved, there is no way to tell.  The vulcanized shrimp came in a bowl filled to the rim with wing sauce.The only flavor was wing sauce and rubber.  The \"garlic bread\" is half a wonderbread type sub roll slathered with grease and toasted.  After two shrimp, and making my friend eat one, I set it aside.  Any restaurant that thinks this crap belongs on a menu has problems.  Interesting, the waitress saw it was virtually untouched as she took it away but never thought to ask if there was a problem. The ultimate nachos, on the other hand, were servicable.  Asking for sloppy joe on it was a good call as it melded all the other items on the plate together.  And for $6 (normally $11), it is an insane amount of food. Lastly, when the dbacks game started, it was nowhere to be found on the TVs.  We would have asked them to turn it on, but by that time, we were just intent on paying the bill and getting the hell out of there.  Can't see myself returning any time soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-rcYF929TShpkFBX0wt1nA"
  },
  "w81ibi1yN3192YoiYzxJ9g": {
    "date": "5/5/2017",
    "text": "Every day, all day happy hour deals are wonderful.  Try their bread pudding - beyond unbelievable!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DAUe2YBTM_yCDQrDgDivrQ"
  },
  "uUEwVsQ_FoG1yK0f3fITpA": {
    "date": "1/13/2016",
    "text": "Ok..I reserved judgement until my third meal here. This place is terrific and consistent. Three great meals two great apps. Incredible service.  Atmosphere is super chill and everyone in the staff treats you like you are their table. No one walks by without asking your status or grabbing a plate or refill. Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ukz4qKNx5MldVKtXXgVxg"
  },
  "oB6Z1OgriVMM71xEG-10Hg": {
    "date": "10/7/2015",
    "text": "Dive Bar dressed up as a Sports Bar.  Was probably a good sports bar many years ago, but now...meh.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6bn4jo6am0D4om-P7U0xeg"
  },
  "VYBtb32m1zTDxgXpsCJWrQ": {
    "date": "4/12/2017",
    "text": "Have come here for years. Mom is currently trying to make it through chemo treatments. All she wanted to do was come here, have a shrimp cocktail and cappuccino. What? No more cappuccinos?  Have to find somewhere else to go. She needs calories and swapping a hot tea for cappuccino won't do.  Love the food here, but have to go elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l3o20hhpQ3t2B0rPIKyHMA"
  },
  "acGtBJ-jUMFsVbUjLSYYGw": {
    "date": "10/1/2015",
    "text": "I have been going almost on a daily basis to The Tavern Grille for about 7 years. I live a couple blocks away, am retired, & it's a relaxing place to go every day for lunch. They have \"specials\" every day. I get 1/2 price chicken sandwich on Sunday, 1/2 price burgers on Saturday, 1/2 price fajitas on Monday & tacos $1.59 on Tuesday--there are many other specials too. The food is consistent every time it's served--you'll never get something one time that's excellent & order the same thing another day & have it not taste the same. They serve quality food, fast service from a well-trained staff, and friendly attention to your individual needs from the ever-present owners, Matt & brother Ryan.  Yes, it's a sports bar, but it's like \"a home away from home\" . You can't beat perfection !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZEkXaOSOd0DPHKXmy-_Kog"
  },
  "e2BSWHIPP_NDHeIe_bQUEg": {
    "date": "3/9/2017",
    "text": "Mallory is awesome. We're from L.A. For Spring Training to watch the Dodgers. First time at Tavern and we will be back. Thanks Mallory for our new hang out. We come down every year and we will be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-JOD56zXlxDXZapcISOxw"
  },
  "bd1U2vt9Q8zJACr3_Q8DUA": {
    "date": "3/5/2016",
    "text": "The two brothers Matt and Ryan and their leadership team of Cody and Steff provide a high energy establishment with great home cooked food,  super drinks and fair prices.   Give them an opportunity! 5 stars!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XaOsVwZtcAWhRqC6I5fO9g"
  },
  "WNb2u65_kKISKMV82zXw4A": {
    "date": "12/22/2015",
    "text": "Great sports bar.  Great specials.  Good bar food.  I'd give 5 stars, but I found it really really loud.  Maybe I'm just old!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9XbSCWDgDTw4Bd_2X52yw"
  },
  "e3jCoO9PEKcc_pwNvPSR9w": {
    "date": "10/20/2013",
    "text": "Saturday is half price burger night and so we took our neighbors for some burgers and beer.  San Tan Ambers were $3.50 and my mushroom and Swiss burger on rye really hit the spot. The steak fries were an extra treat.  This place changed hands about 4 years ago and the folks from Cottonwood (who own another place up there, same name) are doing a fantastic job of making the bar a local favorite.  If only they'd have the chocolate bread pudding a bit more often.  This place is a solid joint for beer, sports and great food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "HWy3v9GwaDj5l3KRsj0Izg"
  },
  "gln1OeJkBnHk0id4MCG4HQ": {
    "date": "3/31/2017",
    "text": "Great food,terrible service   It was a busy night  so we sat at the bar rather than wait for a table. We had to flag down a server for everything; drinks, a menu, food order. Servers were disengaged. No eye contact. Not even a 'how are you'.   Ordered the mac n cheese with chicken and bacon. So yummy and full of bacon and chicken. The Greek salad was excellent. As the evening went on and the place became less busy, service did not improve. Finally we got a smile from the waitress when we paid our bill   Will not return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pB8A0i6RBqrpbEzeX6btJg"
  },
  "6Ws1NKC_DzaSwnlffbGPeA": {
    "date": "7/13/2015",
    "text": "I just can't say enough good things about this place. Atmosphere is great food is better! My husband and I eat here at least once a week. We brought our in-laws here and now this is the only place they want to eat when they are in town! Try the southwest chicken salad (or everything else on the menu). You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "9kI5e5DzcCCODaaTzH2czw"
  },
  "ObKn1UXlTl26OVKFS9x8zA": {
    "date": "7/25/2015",
    "text": "I give it 2 stars because the food was on point, as always. The service was terrible. Maybe it was our fault because we sat outside?...... Whatever the case, it took forever for, Allison, to come out and even acknowledge us. (The only reason I know her name was Allison, is because it's printed my my receipt.)  When she finally did come out, she merely said, \"are you ready to order?!\" Ok. I guess, we had been sitting out there for about 30 minutes by this time and should probably know what we want to eat. So we ordered. I made sure to order my second drink when the first came out, as the amount of time before her next return may have been a good while. I had to go inside to give her my credit card, because I was over continuing to wait. As I stood....WAITING, I saw her engaging with other tables.  Smiling, engaging in conversations. I'm guessing that we weren't in the right age bracket for those \"good tips\", so why pay attention to the one table on the patio? It takes a lot for me to leave no tip. In this instance I had absolutely no reservations about putting a 0 on that line.  I apologize if we were an inconvenience because we sat outside or she was having a bad day, but I don't feel that's the way it works when you work in the service industry. Extremely disappointed in our experience this evening.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "kcl5MQbWZEu2GbKznhmIwA"
  },
  "xu8_x_shV70RFl4Te4RNEg": {
    "date": "2/9/2016",
    "text": "Friendly service, hot fries, cold beer, great Turkey Melt! Can't ask for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n-j3R48IrQ_rnC2wyTRKSg"
  },
  "Jf7tiPt6Eu4rRg5aC68tHg": {
    "date": "10/4/2015",
    "text": "Omg delicious food! Got the honey BBQ boneless wings, really tasty! Also got the chicken sandwich with fries.   Amaze! Staff was quick and friendly even on a busy Sunday football day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OrzZG73aB269YvLqU3xryQ"
  },
  "qMcuqzbnN-hHqAzyHFExAQ": {
    "date": "9/6/2015",
    "text": "The personalities behind the bar keep me and my buds coming back time and time again (among other things like great prices and great food). Steph, Nicolette, Cody, Angel, Ricky, Des - all wonderful and accommodating! On Sunday (1/2 off chicken sandwiches) you can't beat the tavern chicken (order it beer battered).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "00xJNsxnzrBNZUYZejJLTg"
  },
  "wlXY9adPtqyQVhPRABHTUA": {
    "date": "1/13/2016",
    "text": "Our favorite local sports bar and hang out! Love the food and the service is always great. They are nice and accommodating for groups with kids!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kbGJv3zLQiLT7SSNIuPvug"
  },
  "BnKesUXgzmM4k2Gcw4j8Bg": {
    "date": "1/3/2018",
    "text": "I visited Tavern Grill with a friend last week.  The restaurant is a very cute little watering hole. At the door is a trough filled with lollipops. I thought that was a super cute touch.  Everything on the menu looked amazing!  My sandwich was AMAZING and I would definitely visit again when I'm in the area.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3lVLT3IbXB8s1KAgR9NpDg"
  },
  "87kd2eL3ydUcznicZuX-1g": {
    "date": "8/26/2018",
    "text": "Loved the food. Service was top notch. Owners on site and out working the floors. We inquired, food is all homemade. Not some out of the box recipes. Enjoyed the experience, left full and satisfied.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u7EUiPG9ad-BeDUxm9eQUw"
  },
  "gv6GIkZkn5UYKwjH0dwiMw": {
    "date": "7/4/2018",
    "text": "Love this place! Everyone is always friendly. Just a great sports bar. Lots of TV's with all kinds sports going on including off track betting if you like the horses:) pool table and some games. Great HH menu they have food specials everyday. Like Saturdays 1/2 off all cheeseburgers. Their food is great! I think I have tried half their menu and loved everything. Portions are big too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LC0uCKmZRtJFIEgx74CV2g"
  },
  "-EFf69sv8J4SWPOQh1oFtw": {
    "date": "10/10/2018",
    "text": "Delicious food, lots of options available. Stayed for breakfast and lunch. Our waitress was wonderful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ctUesNmTXTf7dDGZpfQvDg"
  },
  "9s3Y2VDPtBPlBULIF6u1-Q": {
    "date": "9/9/2018",
    "text": "Great people the owners always greet you. They visit with you to insure everything in great. Awesome food and a great Happy Hour...I love the half price Chicken sandwiches with all day Happy Hour on Sunday...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lP71tZj7YOusHqc8v5-PGQ"
  },
  "zeB39JDF1pu8uqOPQCqzyQ": {
    "date": "3/8/2019",
    "text": "My favorite neighborhood sports bar. Great prices on drinks and good food. The owners and staff are very friendly. Tons of great specials any day of the week you're there. The atmosphere is my kind of place as well. Cheers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pwz-CcxC3EHuUrFOF7E2BA"
  },
  "RVGjV-G1C8cQe-fd3loipw": {
    "date": "12/29/2017",
    "text": "Soooooo we wanted to try something new after the aquarium and stumbled in. I'm almost 8 months pregnant, so Taverns/bars aren't my fave these days....but THIS one has broken the mold.   1. The service is great! It took a second for someone to come greet us, but one of the servers named Eddy came over and let us know we hadn't been forgotten about. He told us he had just got cut (he stopped taking tables) but took the initiative to greet us, take our drink orders, and let us know that our sever was on her way!  2. Becca was great. Very personable, quick, knowledgeable, and sweet. She was also rather attentive, and made sure we had everything we needed. Way to hire well! 3. My drink was never empty. The manager/owner came over and made sure we were content, and it went a long way.  4. Last, but not least, THE FOOD IS ON POINT!! He had a the Tavern Burger, I had Steak Fajitas. Honestly though, I think we could've ordered anything and it would've been tasty.   The location is tucked away, but big. We will definitely be back, even though we live a solid 30 minutes away.   Thank Becca and the Tavern crew!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NO8BL-vETnNmIKZRZhtFdQ"
  },
  "15M2f2r9LTvRaCNFyoomVQ": {
    "date": "9/29/2018",
    "text": "My husband was recently in Scottsdale for a three week spring training vacation. He loved the Moose Dip so much that he returned three times and ordered the same item. I have also been to the restaurant in the past and have enjoyed the menu and friendly staff. Can't wait to visit this establishment again. Don't miss this place.  There are daily specials that will meet everyone's palett",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hr_Fp9hGV4OkkkxIB-0nmQ"
  },
  "gSfMKFJPVbbQ1_JmPr7qSw": {
    "date": "9/26/2018",
    "text": "This neighborhood bar has the best daily specials written on the wall in the dining room & online. Wednesday BBQ rib night is our favorite but Taco Tuesday & weekend Burgers or Chicken Sandwiches are great too. Servers rock and prices are terrific.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tmZBeihJOMRKPGfpLjdX6g"
  },
  "0ahM22Sb4qiR-y9RUZECGA": {
    "date": "11/9/2017",
    "text": "Do you want to know why I love this place?  Her name is Stephanie.  The first time I came into this place, I stopped by for one beer. Steph introduced herself. I returned later that day. She knew who I was and what I was drinking.  OK, big deal.  I come in, maybe once a week. I live in the area, seasonally. I drop in after a six month absence and cozy up to the bar. Stephanie knows what I'm drinking.  Is this True love? Well, at least on a bartender/patron level.  I almost expect to here the theme from \"Cheers\", when I sit down at the bar.  Oh, the food here is good and the portions are large.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kk0XBbKl4-YXwnqciJS0sA"
  },
  "AhnlYsNp_HvHFW5gSsWMIg": {
    "date": "2/17/2019",
    "text": "Hubby and I are here watching some college baseball.  Met up with some local friends.  This place is great. Met one of the two owners.  Super busy and a hopping place with amazing food.  They have daily specials.  Saturday is 1/2 price burgers with a purchase of a beverage.  There wings are delish, bone in or boneless.  Gotta try the jalapeno coleslaw too.  Stephanie took very good care of us the second time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m83NMY0kRovx-oBBG0R67Q"
  },
  "v2ueV5-7F9A4CQjTy79aCg": {
    "date": "11/11/2017",
    "text": "Good enough food but terrible service every time I'm there.  Very loud.  Our check total was wrong - so watch that if you go there. We were invisible to the waitstaff as we sat at the bar.   Can't go back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QmlPJsHm_A1kF1BC5XYJPw"
  },
  "oTiyFxfBNwbjnRp7WgBt1A": {
    "date": "3/23/2019",
    "text": "We made the mistake of checking this place out. We walked in and we were put at a table that was in the walkway to the bathroom. We ordered two hamburgers and 50 minutes later we still didn't have our food. We walked out and we won't be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3-bBkIkeAfeGiZvTzuf0SA"
  },
  "Tg3cmZsYHwFX9DF8cVDQxQ": {
    "date": "8/25/2018",
    "text": "The guys that run this place are awesome!Great prices.Especially for the area. Lots of T.Vs Sports Bar. Like a Cheers Bar",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "92Wk3rA7tEa6RPkyRkT-RA"
  },
  "p65s3X7oRjKDYccMf--Brg": {
    "date": "6/25/2018",
    "text": "Best wings in town!  Wednesday 6.00 for 12 wings. We get them well done, grilled and sloppy. We love the honey suicide and honey garlic wings. They are not on the menu but they will make them any way you ask.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gE8qaySsyuxTlZD3xNHRDA"
  },
  "SYYe3xNiNduq7VD-3Rsf_Q": {
    "date": "1/15/2019",
    "text": "We had a wonderful experience at Tavern Grill.  The food is amazing and the beer is ICE CHEST COLD!   Fun and friendly atmosphere with prompt service!   Our family will definitely be back!!!!  It's the Bomb!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YWFl9bfHksgk6PFe-5bMEg"
  },
  "WdbM5amQoqlYodpKr-o-Dg": {
    "date": "8/1/2018",
    "text": "This USED to be a Teakwoods and guess what? They rock like Teakwoods on Gilbert and Williams Field used to! Excellent service, food and the most well made cocktails (good pour!) I have had in a long time. Specials for every day and prices on point even without a special! Found my Scottsdale spot for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZlKpKqQ7ghCLgr5tuQAGKg"
  },
  "60Z9yma808rH4H-u58-rLw": {
    "date": "3/10/2018",
    "text": "I was mortified.  I like to go to this place on Monday nights when they have fajitas on happy hour and they are good. But I recently took some very important business people there for lunch. Not only was the food so very slow coming out (and no, they were not busy) one gentleman's food didn't come out for at least 25 min after EVERYONE else at the table got theirs. I was so embarrassed.  We were all done eating by the time it came. When I asked, repeatedly on its status, they waitress told me that they had to \"thaw out the salmon.\"  Really?? The look on my guest's face! As the final straw, the salmon wasn't even warm when it came out.  Do you think waitress was at all apologetic?? Comp the bill??? NOTHING. Absolutely nothing. And then she got the check wrong.  I will NOT be going there for any other reason or time beyond Monday night fajitas. And even now I question that.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tg5v9tt0pw1cX9G7_3Dv8g"
  },
  "EYaN6R1keTd7pndN2UJv5Q": {
    "date": "5/5/2018",
    "text": "Second visit today, I was craving one of their tasty, half-priced burgers on Saturday. Being Kentucky Derby day and packed to the rafters I scored an end seat at the bar. The service and food was as excellent as the first time despite the crowd.  Quickly becoming one of my favorite places for a quick, fairly priced, quality meal.  Rooting they continue to keep the high quality service and food. Check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2y8cO8mmAXzYY_CLf4l6aQ"
  },
  "embalbL2tjOtEli5nz5Apw": {
    "date": "5/23/2016",
    "text": "This is a great little hidden gem.   At first I thought this would be like a Zipps type of place since it's a bar grill, but I was very surprised. The food was excellent. Ordered nachos, burgers & soda. All were very good.  Every day they have a special, and Saturday is half off burgers which was great!!!! Friendly service as well. Plus, this would be a great place to come watch sports because there are big TVs all around the place.   Definitely give this place a try if you're around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6b9aEWDokX1kwMJI0D5XaA",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Giant glass of soda.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6b9aEWDokX1kwMJI0D5XaA/o.jpg"
      },
      {
        "img_id": "Tb75dHwvacKstb36_6vVwg",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Specials for every day!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Tb75dHwvacKstb36_6vVwg/o.jpg"
      }
    ],
    "user_id": "cHCaqm7TuyQfG1tpSemRjA"
  },
  "m5zZ5yVvkdI2NOqStwguqQ": {
    "date": "4/23/2010",
    "text": "wow! Came here on my 21st Birthday. the bartender gave me a free birthday drink which he called around the world, it had every type of Smirnoff flavored vodka and the other half was hundred proof Smirnoff, the shot glass looked like Andre the giants coffee mug!!! Don't remember anything after that, but i got 86'd for passing out on the pool table....Just a reminder, Just say no to drinks that smell like butane!",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RyfoLPa0diSGTCQQ-xEoFw"
  },
  "kw49X2kRRoiXdzNrf2--CQ": {
    "date": "3/24/2011",
    "text": "Great food, great atmosphere, cold beer. If we lived closer we would be there all the time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r8QpnK_E891pwF8kq9P5Sw"
  },
  "noPXj_KC_wVxosCK1A4yHg": {
    "date": "4/10/2011",
    "text": "I've been eating and drinking here since '98 when it was still called Teakwoods Tavern and Grill.  The waiters/waitresses have always been courteous and the service is fast.  In my opinion, they have THE best wings in the Phoenix Metro area and some very good sandwiches and burgers.  If you are looking for a good sports bar to hang out at, I would definitely recommend this one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jqj1iXNVyRYy48iitp6Fsg"
  },
  "QtqQ-nt6ubqsEq9mfEArzQ": {
    "date": "9/15/2010",
    "text": "I hadn't been in here since it changed from Teakwoods to Tavern Grille. Layout hadn't changed much but there did seem to be more TVs. They still do the peanuts on the floor thing. They added a smoking patio off the front.  I ordered one of the specials of the day, Sloppy Joe Mac. It was good although really rich. Service was good and friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TVXfoMztidfro8CvBFPeMg"
  },
  "lNdVS4-4vC1jY4aLzAZRdQ": {
    "date": "6/6/2011",
    "text": "Great BIG BAR! Best burger in Scottsdale yet! 4$ mini pitchers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rWXS6l5qPmem2XGmNRGf_w"
  },
  "9c5T8CjT_578sonUfKlvmQ": {
    "date": "10/16/2010",
    "text": "This place is great. My buddy and I started going regularly to watch NFL games and were pleasantly surprised by the quality of the food. The burgers are great- some of the best in town in my opinion. They consistently cook your burger to the correct temperature which rare these days. Their fries are dynamite too. The bartenders and staff are very friendly and are really on  top of it. This is definitely not your typical bar food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfrWHZbEnS52mDq1vpKXHw"
  },
  "avI3CzesxMmWY-2rWEZIJg": {
    "date": "6/3/2010",
    "text": "This is called Tavern Grill now. I liked it before and after the name change. I work by here and eat here for lunch regularly. I would recommend the wings, pretzel, or buffalo chicken sandwich thing. Don't be a wimp, go with the hot, not medium, wing sauce. This is also a good place to drink beer and watch a game (when you are not working obviously). It just got some sort of OTB going as well, but I have not tried that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AlDQJ0TVR-GKc7wx8qN5mQ"
  },
  "HJoDfgVTh2kvKVQHe94lMA": {
    "date": "7/16/2010",
    "text": "The Tavern Grill is my favorite neighborhood joint. The food is a notch above bar food and the service is great. Especially if you sit at the bar. The back room is not great so if you can't sit at the bar, sit in the front section of the house. Sometimes the girls on the floor get a bit rushed...I think they have monster sections...and there is one server who is really friendly half the time and kinda cranky the other half. We call her Ms Bipolar and it is always fun to see what side we will get! But, I don't mean this as a negative, it kind of adds to the joints overall charm. Also, they have these amazing specials every day. We were there Wednesday night and they have half priced wine. Are you kidding? We had a whole bottle of Malbec for $12. Smoking deal! I ordered the Veggie Pita Sandwich which was super yummy, especially according to my hubby, who ate half of it and said it was his new favorite. It was $7.99 and came with a side. I ordered the soup of the day which was a chicken corn chowder...I was in creamy salty yummy heaven! So, yeah, this was a cheap night out. I would also recommend the 2 for 1 burgers all day Saturday (and they are good) and Tuesday Taco night: chicken and beef tacos for $1 and fish for $2. They are delish and I am full after two of them! I also will say I have never had a bad meal, the food comes out quick and hot and when it is busy you can see the management help out with busing and food running. AND it is a great place to watch my beloved Minnesota Vikings in the fall. They put the Vikings audio on the speakers...even if there is a Cardinals game being played at the same time. I'm glad to see they have their priorities straight!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zv-_yR3Wi50kAkeTPo_W2g"
  },
  "hHrIbNIFqiDkV3--mfcKow": {
    "date": "6/4/2012",
    "text": "We had been to this place when it was called Teakwood and were not impressed, but decided to give it another try after our neighbors told us how much it had improved under new ownership. What a surprise to see how everything had improved including the food and the service as well as having a healthy, friendly  neighborhood atmosphere. Being retired and wanting to eat out most of the time this has become our favorite place. A great menu and the daily specials are fantastic especially the burgers, fajitas and the chicken sandwiches. All of the deserts are home made so be sure to try our favorites the berry cobbler and the cheesecake. They also have the best fries in town. We eat there about 5 times a week and never get tired of the place. It seems like they actually appreciate your business as they always try to make sure everything is to your liking. We recently had a party of 18 celebrate a family gathering there and it went better than we could have expected. Every food order was correct and one server was able to keep up with a group that size.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1DOKDIxmzBLG1JPf6UsoOw"
  },
  "tfbYc1EwkanxhRdl0hFXPA": {
    "date": "11/30/2010",
    "text": "First attempt at this place since it changed hands.  Would not return.  Went to see Cards/49s MNF.  Many other places in area better for viewing sports.  Most of the TVs are poorly positioned, resulting in stiff necks from having to look too far up and bad angles.  Glare from Xmas lights and signs obstructed screens.  Audio commentary was barely audible.  Can't comment on food as I did not feel compelled to stay long enough to eat.  Beer selection weak and unimaginative.  Although not overly friendly, staff was efficient and kept glass full.  Free peanuts is not enough of a reason to return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J1XLEj4mS4kIZ9ymz5iRYg"
  },
  "AHdda82znct3sphj5n55-w": {
    "date": "10/26/2010",
    "text": "Looks like the owners and employees have been busy posting flattering YELP reviews. They're not too hard to pick out, are they? To the owner, ahem, reviewer that wrote \"he had been driving by for over a year\"; how do you do that with the bar tucked back into a corner like it is?? Plus, this is not the TEAKWOOD anymore and has no affiliation. Riding on the Teakwood name replete with antlers on the logo \"T\" might be just good business but it's a bit slimy to me (just like the crowd the OTB attracts). The menu is schizophrenic, in my opinion, consisting of typical bar fare but then the strangest specials. All you can eat crab legs for $20 bucks on Friday night?? When I go to a sports bar to watch a game or for Happy Hour I'm thinking more along the line of wings, not crab legs. What were they thinking? Saturday the 2 for 1 hamburger special attracts every geriatric in Scottsdale. But the real turnoff to me is the designed RIPOFF. Order a draft and you get a 12 oz glass. Order a pint...and you get a 12 oz glass. Order a 16 oz draft...and you get a 12 oz glass. This is the owners mentality; let's cheat our customers a little bit, they're too stupid to know the difference. Makes me wonder where else the corners are cut.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "uR2nmyTBNbvn8PmsIgapxA"
  },
  "Q7BMIwFPltnuDaGTx_aGXw": {
    "date": "1/10/2013",
    "text": "Fried zucchini! I'm surprised how few places offer fried zucchini - Tavern Grille does and they are delicious! I can also vouch for the burgers and steak salad. They have some pretty good happy hour specials, a variety of mac n cheese, and the house red is pretty decent as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bTP84Ewz8TwtkeGeQLlJnA"
  },
  "_-rdnV2SWT2wm84pOB4IHw": {
    "date": "8/22/2015",
    "text": "1/2 price burgers on Saturday that are unbeatable. Our food came out fast (in a packed house on Saturday night), was delicious, and the portion was so big that I (a 20 year old college athlete) could not even finish. The waitress was great and very attentive. I'll definitely be back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cpD5j-m39pe-Ap_TwbJs4Q"
  },
  "1cSFDyt2eNKQ1VGkQ_-VPw": {
    "date": "7/21/2014",
    "text": "This place is HORRIBLE!!! Service is atrocious!! Food is overpriced and the new ownership (prior managers of the place,  tweedle dee and tweedle dum) use to manage Chili's. They will run this place into the ground. I give it 6 months before the place shuts down.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7m7OtmWbUbIjkhwG9ze4Mg"
  },
  "-_PqPzKsuk_vKLAy6OuPBQ": {
    "date": "5/5/2012",
    "text": "The special on the sign out front wasn't available. The chicken wings were anorexic. The $8check moose dip was served in a cup the size of a shot glass. They don't subscribe to any payperview events. Better to just go to Buffalo Wild Wings.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4YQ5aV1Q-1n05zYAFHUB9Q"
  },
  "i3p-GCQBV1hxhz6N6Xnmww": {
    "date": "4/8/2012",
    "text": "This is a fun place to take the family or go with friends for a quick bite to eat.  For people who are exepcting a five star dinner this is not the place for you so please set your expectations appropriately.  Also, for people who have a very public disdain for all things Scottsdale please don't come to Scottsdale.  We won't miss you or your moronic opening statements.   Tavern Grille is what it is supposed to be, a realxed local neighborhood sports bar.  Its got your standard grill menu and daily specials.  There are TVs througout and Off Track Betting available for those that wish to test their luck.  The food is very average and convenience is the key so if your in need of an alternative to cooking at home and want something easy and nearby Tavern Grill is a good choice.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w7c4LO7EEGX6NOGMQJjmmQ"
  },
  "oFnnyc0uSfPz7vajie5rZw": {
    "date": "4/8/2015",
    "text": "After many visits to this place, I have come to this conclusion! The service at the bar sucks.. I think the managers try really hard and are personable, but the cute bartenders have an attitude and could truly care less what you think of their service. Or should I say, lack of it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WP1tGpcdFB9_UDoGkQtqhA"
  },
  "1v55OT8LA6NT664DphZWuQ": {
    "date": "10/20/2012",
    "text": "been going for lunch for a few months now. Awesome fish tacos on tuesday! need to go back for HH..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O0of7FAQt0g3Q1mv2Dbb_A"
  },
  "SNwQmYHsT_AbcPsJGxaUgA": {
    "date": "8/23/2011",
    "text": "I've been with my coworker for lunch twice during the week.  First time I had a salad,  I can't recall which one, but it was some short of chicken salad.  It was big and pretty good.  Today we headed over for Taco Tuesday - $1.50 tacos.  I had beef soft tacos.  I waitress offered beans, rice or salsa.  Apparently salsa is free, but beans & rice are not.  I get annoyed if the waitress doesn't mention the extra charge when offering sides, especially when the sides cost MORE than the tacos!  The tacos were good and I'd say filled better than average.  They had good flavor and the salsa had a good kick.  Despite having 2 good meals for a decent price, the service is just terrible.  The waitresses are not friendly.  They rarely check on you and when they do, they are mumbling and not happy.  Not sure if I'll go back...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dW9WtbAYs_JS2dkbExzNBA"
  },
  "pzww6nchRDOypARfNlFxJw": {
    "date": "9/9/2014",
    "text": "A great neighborhood place that I wish was in my neighborhood. Had dinner there with a friend whose wife was in the hospital. My wife had a grilled chicken sandwich, our friend a patty melt and I had a cheeseburger with bacon. All were great as was our service. Ryan, one of the owners, visited with us and welcomed us to the Grill. Everything was excellent. You who live close are lucky to have this great neighborhood place.  When we are in the area we definitely will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CKmwcSQjk60PKct4o26DzQ"
  },
  "5ikbzM9zh_WfWd5cgCFqQA": {
    "date": "6/16/2014",
    "text": "I am never disappointed when I go to this place. My husband an I went on Saturday night and had burgers and a beer. The service is always good and the burgers are great. The people are always friendly too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Et_e41hmQqtR93pTBsyRUQ"
  },
  "Ctl1gtkjOGEuJFPdVAt3lw": {
    "date": "12/21/2014",
    "text": "We are Saturday regulars. They have very good burgers at half price on Saturdays and an excellent beer selection. It is a great venue for watching games.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4nSAFZAdMxi4mhVtslKOgQ"
  },
  "49HEJLtRPMQYPNZGsd6Gvg": {
    "date": "11/24/2013",
    "text": "Came with friends to watch my alma mater lose a football game. San Tan beer is a Saturday special though I remain confused about the pricing. I had a bacon cheeseburger and my wife had an ultimate burger. Saturday's are half price burger day. We both liked our burgers. Friends had chicken sandwiches and liked them. We had been here before.  The others wanted dessert and they liked whatever they had. It was a special.  Service was a little abrupt but very attentive. For regular food and decently priced beer it is a good place to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D6SEKcIne80A0AhwiEV2Rg"
  },
  "1r-_ngxdYMVqphudLvKMHw": {
    "date": "9/21/2013",
    "text": "Love this place!  Terrific food and drinks with TV's all around- not much more you can ask for in a local hot spot!!  As a side bonus the two managers are brothers and really cute!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vqzWERrURYgK1-kmHheaxA"
  },
  "viMn1ek9ZNdp0kDPTlTYIQ": {
    "date": "4/6/2014",
    "text": "I hosted my kids soccer team after party here and the food and service was excellent.  The tavern is a great atmosphere for entertainment for kids and adults.  They have a section of the place secluded for kids and adults.  The kids had their own table, and their adults had another.  The waitress recommended many entrees which were all amazing, the service was very fast especially with the large amount of people we had.  I as well as many of the soccer moms were impressed and will be back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tt8Tr3rtjq4TNFI8AY6_ZQ"
  },
  "OTMuZzbSegbK0yEiY5ehNw": {
    "date": "8/31/2011",
    "text": "I go to the Tavern once a week to enjoy wings with friends. The Tavern Grille has the best wings in Scottsdale, bar none.The staff is friendly and the wait time is reasonable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WQjkLcR5mnJCF54cHsUncQ"
  },
  "LJNPwgJszmhbkG-SV7oMbQ": {
    "date": "2/28/2016",
    "text": "low key place, good for conversation with others",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P99FnStw8aRHHIAX5_EQaQ"
  },
  "AQ4XitWxY2jpXr7Z_mlURQ": {
    "date": "4/13/2012",
    "text": "Frequent the Tavern Grille for lunch from time to time. If I reviewed the place 6 months ago I would have given it a 4 for surprising me with a thoughtful menu and great service. Unfortunately, recent visits have served to taint my original impression, and I can only dole out a 3 a this point.  Their beer selection is excellent, with a variety of local brews on tap along with a great selection of bottled beers. Local brews, especially IPAs, garner a star all on their own.  Their menu has a huge variety of options, and many of them promise substance above and beyond your local bar food. Unfortunately, execution on the food tends to be so-so, much of what we've sampled being a little...bland. My reuben was average at best, and my wife's chili burger (order by mistake) was clearly topped with canned chili - a big no no in my book. I do have to say I enjoy their take on green chili cole slaw.  The serving staff we've had have been cheerful, the waitresses definitely being a positive for the place. But the past two times our food has come out so late that it was the manager coming by with our food to apologize that we had to wait so long. Predictably, the food was cold both times.  I was hoping we'd found a new go-to lunch place, but at this point, I think the search is still on.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B_0wtqNEG9mbMdklYVpC6w"
  },
  "vQvlecT5joxFPi-zUMFJ8g": {
    "date": "12/18/2012",
    "text": "We've been here twice and had burgers both times.  They are large and excellent.  The fries are really great.  We've tried four different burgers and each one has been big, juicy and wonderful.  Kinda hard to find the first time and parking can sometimes be a hassle but the food is good and the service was good!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZAwsN-jV2DO0REqsAfAibg"
  },
  "KbQA4VpbI-4acIxvyKpfiQ": {
    "date": "10/13/2010",
    "text": "We showed up here after hiking at McDowell Mountain and finding out that tragically Sweet Republic is closed on Mondays (!), we followed our GPS to The Vermont Sandwich Company, which was also closing just as we got there at 4:00pm....arrrggghhh! So just as we started to think that McD's was our only option we said, hey, there's that place, why not. So we walked in and, if you ever wanted to feel really unwelcome in a place...go here. There was a \"Seat Yourself\" sign, all the service staff ignored us and the place was filled with 50+/- year old men. It was one of those places where everyone kind of quieted down and looked at you when you walked in, leading you to believe that perhaps there's more going on there than an eating establishment, I'm not saying there is, I'm just saying. Now I'll preface this next part by saying I recently got a dog and have become one of those obnoxious people who gets annoyed with places that don't have dog friendly patios. We walked up to the bar and asked the bartender if they had a dog friendly patio and he said sure, go have a seat out there and he'd send someone right out. We went and got the pup from the car and had a seat. The girl who waited on us was really sweet, and the nicest person we encountered there, by far. As we sat she came out and said that the dog had to be on the outside of the fence. So basically, their patio is dog friendly in that you can tie your dog up to the outside of the fence and let it sit on the sidewalk outside. Anyway, we ordered 2 prickly pear margaritas, which are always delicious! I had the sandwich with roast beef, horseradish mayo, pepper jack cheese, grilled green chile and tomato. It was really tasty, the bread was nice and soft and not overly greasy like a lot of places tend to make toast. They had quite a few options for sides which was nice, I got the tater tots which were AWESOME! Nice and hot and crispy, fluffy and soft on the inside.   In summary, their food is actually quite nice, service is so-so, the peanuts thing seems pretty cool and I can see how that would be appealing. It seems to be a locals bar, we seemed to be the only ones there that the server did not know our names. Plenty of guys started showing up for the Monday night game, so I can definitely see that it probably gets busy when the games are on. Overall, not a bad place, I would go back if I were up in that area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BlhY_zkkornX1KsAy0VK-g"
  },
  "F1H7vRuSDvKwC9aVsCw9ZQ": {
    "date": "3/29/2014",
    "text": "We used to be regulars but hadn't been back for a while due to poor service.  So today we decided to try again.  Yes, the burgers were delicious but the rest of the experience was awful!  After waiting over half an hour for iced tea, we finally got to place our order.  Meanwhile, there were a bunch of screaming kids (not infants - more like 10-year-olds) who were actually climbing on the pool table, throwing the balls at each other, and completely acting like it was a playground while the 2 moms stood there chatting.  The couple next to us finally asked if they could maybe  not scream to which the Mom yelled, \"if you want quiet you should go to church.\"  The other tables around them, along with us, said the manager needed to ask them to settle down.  But it never happened.  Our food finally arrived, after over an hour, but it too asking three times to get silverware and we never did get a refill on our tea.  All three tables in our area were so annoyed at that point with the lack of service and lack of management, we all agreed even the really good food was not worth a trip back.  Oh, then the couple with the crazy kids left and stopped by the guy who had asked them to be quiet.  He started yelling at him that it was a bar and yelling and screaming were expected.  Then he told the man he should step outside to apparently fight it out.  The guy by us said just have a nice day which made the wife yell at all our tables that we should \"keep eating cheeseburgers you fat asses.\"  Yup.  And still no manager.  Everyone in our part of the restaurant shook their heads and agreed it was not someplace we would ever return to.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jTROi1VTvR2w_oVWTwtZWA"
  },
  "f9TQGzZsbx8smhzHamRvNA": {
    "date": "7/7/2018",
    "text": "Saturday half off of some of the best burgers and tater tots around.  5.50 small pitchers of beer don't hurt.   Tons of TVs and the staff is very good.   Good local bar.  Especially Saturday.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fCnqY-_ana3zytwuIODwWA"
  },
  "oPs5HB1vSfUQuvG21vgcsw": {
    "date": "7/2/2019",
    "text": "Went in for a $6 burger and a 3.50 beer. TAavern grill then ran the burger separately on my credit card then rang in the beer separately. Then two days later rang in the total of the two 9.99 on my credit <a href=\"/redir?url=http%3A%2F%2Fcard.So&s=05314447424ec051862a1a63c7018c6403d1609ea4eb1c3257d824e43a00fad9\" target=\"_blank\" rel=\"nofollow\">card.So</a> a 9 dollar transaction cost me 20.00 in holds on my account.When I. Called and spoke with the owner Ryan and just simple asked if these would fall off and why do they ring in each separate hold his response was accusing me that I was lying and that he never has a problem and I should not visit the establishment. INSTEAD of saying I'm not sure why that happen or could be a training g issue let me look into it. And just confirm yes they will drop off and say you are only being charged 9.99.The owner does not enjoy True reviews and try to correct the issues.Thinks that he won't loose customers.  Ryan the owner discriminates if you write a bad review as I said before and other folks have written they cater to there regulars only ! If your new forgot about it past reviews even called them bar bullies.food is not great cooks do not even know how to. Cook a med burger its raw and they serve it that way. MATT IS AWSOME !!! RYAN needs to learn some customer service skills from Matt",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qUpf4eAN5PXtIE4uVH482A"
  },
  "aS0n4nOVMVQ7ARn-HCzVFg": {
    "date": "1/2/2018",
    "text": "The food here was great!  We started off with a cheese dip with a funny name... sorry can't remember... but it was amazing!  It was cheese, salsa, beans, cheese, and more.  I had the Southwestern Salad and loved it.  A friend had a similar salad with fried chicken and she said it was really good as well. They have a variety of mac and cheese... son had the bacon/chicken mac and said it was good.  Portions are reasonable and service is good.    There were a few times we had to ask for our server, hence the reason for 4 stars vs 5.  Would be a good place to stop, have lunch, watch a game, have a few drinks. Recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dImHZAWN0h5DQ48ae8TT9Q"
  },
  "pWzNcjsGpZoKhkTEA99pxg": {
    "date": "1/26/2019",
    "text": "Good local tavern. Food is good and decent beer selection. Expect it to be full of locals mainly betting on the horse races so seats at the bar can be rare. When we came parking was a issue. It's kinda tucked back behind some other buildings so it's not easy to spot. There is a little outdoor seating. Mainly inside kinda dark with pool and some games. Appears to be mainly a local spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hlwpJ_BHvKJe9qB1dU6hGw"
  },
  "SY942z7L6z9a0OsBV8kOfQ": {
    "date": "1/26/2019",
    "text": "Been here a few times for dinners and always have experienced great food. Excellent specials throughout the entire week. TVs everywhere which makes for a superb sports bars when coming in to watch ANY sporting event. If you are a Buffalo Bills fan - there is a small group of us that gather here during the NFL season, come join us in our misery (lol).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kDyNvyYpfqI0EN7rwT_m_A"
  },
  "3PIUaERNr9mfETDFCdC0QA": {
    "date": "5/26/2019",
    "text": "We love this neighborhood restaurant. Food and service is always consistent. It's low key compared to a lot of places in Scottsdale. When my kids visit they always ask us to take them here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sF6XRbBlOUoAWIKxNvtR8g"
  },
  "-RJG-C2fOpblDLTPcoOrOQ": {
    "date": "11/13/2018",
    "text": "I absolutely love this place. The food is incredible. I've tried several things from the menu and I'm never disappointed. Great salads, burgers, fries, tots, chicken sandwiches, wings! The happy hour menu is awesome even on the weekends. A great place to park it all day on a Sunday and watch football drink beer and eat great food. The service is always top notch. Everyone is always friendly and warm and makes you feel very welcome. Can't get enough of the tavern!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zOm7LgTXo7-jwdoxK74M3A"
  },
  "T370oAhfgFQtVBEmZm7n7A": {
    "date": "12/1/2018",
    "text": "What a hidden gem!  This place doesn't do a ton of advertising and they have an EXTREMELY loyal following of regulars.  We can see why after having their burger, and doing a full video burger review: <a href=\"/redir?url=https%3A%2F%2Fyoutu.be%2FSBj1j8uwg7U&s=367acbd11333fcad7ec7058c00bd67cce82dd755b9408a452f2f9334d1e4be35\" target=\"_blank\" rel=\"nofollow\">youtu.be/SBj1j8uwg7U</a>",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cLdUIYuAimx1kreAp4mKCw"
  },
  "lUSdSUrZytHJUv2pZR_vhQ": {
    "date": "1/11/2019",
    "text": "Busy sports bar with a lot of older folks playing the pony's with a betting window. We sat in a back area which was more quiet. They have a huge menu so it took our party of four a few minutes to decide.   The male server was very pleasant and helpful. Three of us ordered beers which were very cold. Unfortunately so was our food. Half pound burgers pretty much cooked as ordered but either they sat in the window too long or were warmed up from the noon rush. French fries were tasty but would have been much better if hotter.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ljGTQD_-yC4iXievtgCsbA"
  },
  "qehO7ed9V9v3i2zHkG0A3A": {
    "date": "12/9/2018",
    "text": "Had a good solid meal at the bar. Hubby got the sirloin steak and enjoyed it. I was delighted with the pork enchiladas! Margaritas were tasty, bartender was attentive. All in all a good meal and cozy environment. Wish we had a similar go-to joint in Lancaster, PA.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i0DtOdp78o_zjB8OJ1UKUQ"
  },
  "07GOwTHYUiWOJiKVhCetXQ": {
    "date": "10/21/2018",
    "text": "Had a business meeting and dinner here.  Excellent food and had great service in the bar area.  Will go back next time in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "8yLyzAJe405gI-Ismi3qFg"
  },
  "5suzKEmOWa_eUkUBAeYJPQ": {
    "date": "4/27/2019",
    "text": "This place is amazing!! Great service and people. The bartenders and managers are top notch! The burgers are delicious! Definitely recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ts2-2nscrBleqgLnB7fKoQ"
  },
  "g-xnRzpq7oDkaHTNlFr5gQ": {
    "date": "2/21/2018",
    "text": "Last time I had the Monday chicken fajita special was five years ago and since then the price has only risen one buck as I returned to get some more this week. The strips of white meat chicken were not spiced, but just good chicken served over the usual peppers and onions. They give you three tortillas and enough fixings to make anybody happy. We wandered in close to 10pm and had no issues getting food. The bacon cheeseburger was also good as well. Always a solid choice for any meal.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "qgb0IqqXMjWt1mbm2m0zDQ",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Fixings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qgb0IqqXMjWt1mbm2m0zDQ/o.jpg"
      },
      {
        "img_id": "NkUWdHFU_sNrydRZDxJG3g",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Still good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NkUWdHFU_sNrydRZDxJG3g/o.jpg"
      }
    ],
    "user_id": "ELcQDlf69kb-ihJfxZyL0A"
  },
  "7S_o8Rc_lByzu4kgJU-SDQ": {
    "date": "10/12/2018",
    "text": "This is my regular go to place for lunch in Scottsdale! They have great lunch specials every day, a special soup every day, and they don't stick it to you when you order a beer. They also have a great happy hour. Lots of TV screens where you can watch sports, FOXNews, the stock market, and they have off-track betting. The staff is super friendly, and many times the management will come up and say hello and chat with you. I brought the whole family here for wings on wing Wednesday, and my wife and daughter loved it! We ordered six kind of wings and several of their homemade dipping sauces, including jalapeno ranch, blue cheese, and traditional ranch. They are also generous with the carrots and celery on the side. You really can't go wrong here! You can order steaks and spend all of it more, or go for one of their daily specials and save a little bit but still be great! Did I say that they don't stick it to you for the beer? They don't!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qPFZQE1K6pFk9hHETDbrcA",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Dang good wings! Next time I&amp;#39;ll try them grilled! Not over priced like so many places.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qPFZQE1K6pFk9hHETDbrcA/o.jpg"
      }
    ],
    "user_id": "ylVAy2B_JjkC1Xty8AUQxA"
  },
  "vLEAIK6KA-P3-LJC2pSsnw": {
    "date": "12/21/2018",
    "text": "I was excited to try this place, since it has decent reviews, but sadly I was very underwelhmed by it.  The service was very good, but the food was not great. I ordered the Zin Burger, because the description sounded delicious.  What I got was a dry, over cooked regular burger, with very fatty, limp bacon  (I asked for the bacon to be cooked extra well done, and the burger medium well).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TkZZInHxlqMtfK4rbj3YVw"
  },
  "ndMfo91ud31l5XrNcBPC6g": {
    "date": "3/15/2018",
    "text": "Still always one of the best go to places in Scottsdale for consistent well prepared and flavorful food and friendly, fast service. Always a game on with off track betting available too.   Cody and Desi at the bar are always busy but take a minute to acknowledge and say hello. The owners (twins) always make the rounds to deliver food, check on things and thank you for your patronage.   Always tough to get in for dinner due to popularity but certainly worth the wait. Daily food and drink specials help make your dining experience very affordable. Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rRfx0TVMZ5NvdBkN8555Tw"
  },
  "SHwG1J-sqj5Mtlqq1o6heQ": {
    "date": "12/29/2018",
    "text": "best burgers in Arizona... Fabulous waitstaff. Sarah and Chelsea fabulous. Thanks much, Jan & Howie",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXEutlL3dFfNCK0EtTEzDg"
  },
  "QTSLB8BHb54PY7iq74RCQQ": {
    "date": "10/1/2018",
    "text": "Great food. Lots of TV's. Extremely friendly staff! Great place to watch a football game.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fc5xJxiFDLLG_ISEpmatEw"
  },
  "hTMjXxvxxPKMCKgjdorwFQ": {
    "date": "5/25/2018",
    "text": "I came with a regular and tried something off the menu..... \"Garage hots\"  They were amazing!   Boneless chicken strips in hot buffalo wing sauce with also some kind of salsa verde and blue cheese sprinkled on top..... but there was a smoky flavor too, maybe after they were fried they put them on a wood burning grill or something?   I don't know how they did it, but they were delicious, and I will be returning to imbibe.    Also had the fries, which were also really good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WoJqhkYA_CoQ85e3b-owiA"
  },
  "cYXZ9VqUBkKfhPySg3vnQA": {
    "date": "3/9/2017",
    "text": "Ive been holding off on reviewing this place. Been here about 5 times now. we work very nearby and come here for lunch. Every single time we come it takes almost a full 45 minutes to get our food. Being so close to a business dense area you would imagine they would understand the time constraints their patrons may have.   I would have given one star because of this but the food is good and the servers are pretty decent too. They also have great daily and happy hour specials. Im 99% certain its the kitchen and management/scheduling.   The last 3 times Ive gone there we had to flag down management or a busser.   The hispanic gentleman that busses is probably the best employee in there! He is always looking around at the patrons and paying attention, ALWAYS. Hes helped us track down our food, bills, and drinks multiple times. THIS GUY NEEDS A RAISE.  After this last instance we wont be back.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "gzIIogl9Z9o1qog1Ve8QSw"
  },
  "G8lR2dbqJcOiRGmmR6u-Ig": {
    "date": "2/5/2016",
    "text": "This our favorite neighborhood regular place. The food is great and the service is super. One the owners is always onsite and engaged with the customers. The fajitas are better than in many Mexican restaurants. Great burgers too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OVCOmVJt1rAqhMPHDCKD3g"
  },
  "SHqKFJnd-OkYt427bF-5Dg": {
    "date": "10/22/2011",
    "text": "I've been coming here every Sunday usually for the whole day to watch football. Huge fan of the amount of TV's and and well they're placed. Gotta say I'm blown away by how inexpensive everything on their menu is. Plus the portions are huge. I've gone a few times on days other than Sunday. Make sure you utilize their daily specials i.e half off burgers on Saturday....$5.50 for a massive ultimate tavern burger and side? A-you can't even get a burger that big at McDonalds, and B-even if you could, it'd cost you at least 10 bucks for the meal.   My main complaint is the somewhat slow service there which is why I only gave 4 stars. Bottom line though: I still go back every week so the service isn't THAT slow.  FYI get the moose dip appetizer",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "34vH81wBnGptvHCyTQ8ABw"
  },
  "ILj_NrKbodZK9a4dtJ1X4w": {
    "date": "4/6/2014",
    "text": "Their Zin burger and their chicken sandwiches are delicious.  Right when you walk in, your greeted by one of the lovely servers.  If you can ask for pickles do so, because she is amazing.  The service is fast, the variety or tap beer is large, and best of all they have a plethora of TV,s that always have sports on.  I think its safe to say I am a regular now;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8YzxUrawDvycT02-DI-zxQ"
  },
  "vWCvaBUjzdeqSgp4tFJAJQ": {
    "date": "4/8/2013",
    "text": "Local gamblaholics, bad food, slow service.  2 thumbs down",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "32fRc4MMk1uk2JEEM7OmtQ"
  },
  "4yc3FuMWcebJR8gASdQLUA": {
    "date": "8/23/2011",
    "text": "The food at this place is good, but prepare to be treated with attitude.  Management must set the bar very low for their waitresses because I haven't had a good one yet.    Yes, they have good prices on their lunch specials, but once you go there you will decide it's worth paying more to get decent service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YgaZVFXvTjnWwTf6j8sZCA"
  },
  "NmxU3Etmjjjxq5kfdqZeRw": {
    "date": "4/21/2011",
    "text": "A guy from work recommended this place Tavern Grille (formally Teakwood).  He said the wings were amazing.  I need of a place to catch the final 10 minutes of a hockey game last night after work I opted to check these guys out as it's just a short drive from where I work.  The place was dead.  In fact I've never been in such an empty place that was not a dive.  Being Scottsdale, though, I guess they close shop early along with the other restaurants in the area.  The set up was very nice.  It has a neighborhood tavern feel.  The bar is long and stocked with comfortable stools.  Lots of booths to choose from and the typical bar fare of darts and pool table.  Tavern Grille has plenty of televisions as well so this would be a good place to visit when multiple games are going on.  The wings were served up fast and they were quite delicious.  Not the best wings I've had, nor the hottest, but they were still very good.  Easily the best ones I've had in the Valley since I moved here.  Give it's location and hours of operation, Tavern Grille is not a place I will visit on a regular basis but I will be back in the future.  Maybe one a day off for lunch or dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "I8K8inWlqoQ3af_CAER56w"
  },
  "QMwXDv6sMn8HIeKwTeDooQ": {
    "date": "4/10/2013",
    "text": "Ok, this is currently (4/13) my vote for the best burger in Phoenix. And it gets better... 1/2 price burgers all day Saturday.  Hand made patties, nice fresh buns, cooked just right.  The place itself is fine, dark bar with off track betting.  Not my thing, but nothing against it... But there occasionally is a lot of yelling at the TVs.  Salads need some work, and the wings are good, ESP for 6.99 on Wednesdays.    But get the burger and skip the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "KekQwlBlJlgzaHLfhXt8Bg"
  },
  "ElZ_GFM36XqRMaltJgfykg": {
    "date": "9/13/2011",
    "text": "Tried Tavern Grille for the first time this week.  This place is a lot bigger than it looks from the outside.  We weren't interested in the bar noise so found our way back to the dining area which was much quieter.  This is a seat-yourself place with table service.  Waitress was friendly and took good care of us.  Monday night is Margarita & Fajita night.  I tried the chicken fajita special for $6.95.  A lot of food, plenty to serve 2+.   Lacked spices for my taste, but the veggies were nicely crisp and plenty of chicken and toppings.  He liked the $3 margarita special.    Also tried the wings.  They offer them about 8 different ways.  We tried honey-BBQ.  Nothing special in my opinion.  Maybe a different sauce would have been a better choice.  (Sorry but I think it's hard to beat Zipp's.)  The parking lot is a maze shared by the rest of the strip plaza, spaces are slight and lacking in number.  Aside from that Tavern Grille is an easy in and out, lots to choose from, and reasonable prices - I'd probably come back and try again.  TVs everywhere so if you are a sports fan, this is probably a good place to consider.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gAcz_T0JKVmXDWkFehJigQ"
  },
  "gbWy1fF1rRn3hpQWzB1NYA": {
    "date": "8/5/2015",
    "text": "Wonderful casual bar and restaurant.  Service, food and prices are excellent.  Best patty melt in town!!  With all the daily food specials (ie, Taco Tuesday) and half price bottles of wine (on Wednesdays), this has become my favorite lunch spot.  Heading back next week to try the dinner rib special.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N5fLsFjRIo4u4Tiw5rG4mg"
  },
  "UPrzgvny89zHKcFlOcuRJg": {
    "date": "4/21/2014",
    "text": "Have been dropping in for lunch. Tuesday they have fish tacos that are really good. Nice n casual.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-A0Fjt-z3RY6k4xYaiIfLw"
  },
  "FOYO0UkYrYsE81RFeG8JaA": {
    "date": "3/1/2016",
    "text": "Our favorite neighborhood place to eat! Great service and fresh food! Best burger around and can't get better tater tots.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jvYZaa3PxrKvm8CklaQ1gQ"
  },
  "_iVu8kUPyBGW4Sxt-dClXA": {
    "date": "7/25/2014",
    "text": "Food is good.  Service can be a hit or miss, depending on the day of the week you go.  Saturday is half priced burger day, probably best day to go....  Used to have 'all you can eat crab legs' on Friday.  I guess they discontinued that a while ago.  :-(  Those were GREAT Friday dinners.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lakYec3NoN6i9MriCFqDLg"
  },
  "wCVMDFRDRD2LtI_DGDsl4A": {
    "date": "11/3/2010",
    "text": "This was previously posted under Teakwood Tavern Grill - which now has this new listing ...  I'd been driving by this place for over a year, and just never stopped in.  It was called the Teakwood's Tavern and Grill and looking at the reviews on Yelp, it didn't seem to offer much.  But then I heard that it had changed hands, and now was a place to try.  It is now called the \"Tavern Grill\".  Their specials were supposed to be great, and since I am always looking for a good deal, I thought I would check it out.  I stopped in the first time on a Thursday, and it was $3 Margaritas, and half price appetizers all day.  It was packed - there was a game on, and everyone seemed to be having a good time. I sat at the bar, and the bartenders were swamped, but they were still able to give good service. I tried several of their appetizers, and it was above average for bar food. And cheap.  I later went back on a Tuesday night to watch a Diamondbacks game.  The special that night was $3.00 Mexican beers, $1.00 beef or chicken tacos, and $2.00 fish tacos.  Dinner for less than $10.00!!  And I didn't have to cook.    And the great thing is they have peanuts - and you just throw the shells on the floor.  For me, this is a great attraction.  Nothing better to watch a game, drink beer and eat peanuts - almost like you were at the ball park.  They do have a separate dining room in the back, and specials for children.    This is a great sports bar, inexpensive food, and pleasant service.  Although it gets hectic for big sports events, it is a lot of fun, and makes for a very inexpensive evening.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "EV6-TcSMzKURTpkMKCuQww"
  },
  "j5XA05JFUk4EZyDGvU3dJw": {
    "date": "7/30/2013",
    "text": "Great bar area and a pretty good selection of food. The bartenders and very friendly and attentive. The wait staff is decent, the seem as though they are in a hurry at times even if the place is not packed. Overall a good place to hang and watch a game with all the TV's they have there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s3wsCEoXbsCfoDh-0B2Jow"
  },
  "xwPA6rj7Co4YQgprGm_8Ng": {
    "date": "2/22/2015",
    "text": "Its February 2015 and Tavern Grille continues to be our go to restaurant at least once a week.  Wings, salads and burgers are our standard order as we relax at the Tavern Grill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cNO-iv0SlxqUjZjs2MR1Tw"
  },
  "hag-QZimBhToMyYoPEcYiw": {
    "date": "5/16/2014",
    "text": "Won't be going back here....I SAW THE KITCHEN......bathrooms are the worst in town, really need to be cleaned and updated. Use to be a great place now they do kids birthday parties....REALLLLY???? did you have to go there.  Now it's just a Chucky Cheese with burgers and beer. Use to be a real CHEERS type of place but now everyone is new....and very OLD....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P4hQ9ZwiaBMnwH4quWUM4w"
  },
  "VKPnyKYwNlyr681UVYEJUw": {
    "date": "4/1/2013",
    "text": "Grilled Chicken Cesar not up to par as in the past. Croutons were burnt and chicken was dry.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bb9b9j0DRF5VLEDdEQ-tEQ"
  },
  "bkmLnaXIZD5gyPS1WBiSnw": {
    "date": "1/18/2011",
    "text": "First time there since they switched from Teakwoods.  Wings were good, but not very meaty.  Looked like they found the worst in the bunch and served them to us.    Fries were good, Kids Mac & Cheese was good.  Service was very slow, but friendly.  Enjoyable experience.  I will give them another try to see if improves any.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xoIrq4ucniCVPktICYur_Q"
  },
  "2XTM5_kcqcNJ_2sq6ekDpA": {
    "date": "5/24/2010",
    "text": "We tried Teakwood's this past Sunday and it was a great experience.  Huge menu with lots of things that sounded yummy - I tried the chopped salad.  Loved that on Sundays kids eat free!  My son also got a kick out of putting the peanut shells on the floor.    Service was good though they did bring me the wrong order but did correct that.  Surprised to find such a nice interior tucked in that strip mall - so nice find a place that is kept up well (I think its been a long time since I've sat in a booth that wasn't all lumpy, ripped or moved around).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLv0UHsogVJP1mWKJ_l8ww"
  },
  "2Bgtz0j1R6SreFTulnb0_w": {
    "date": "6/26/2016",
    "text": "Stopped in here while waiting on some people to come to this end of town to hang out at Topgolf.  The Thursday special was $6 appetizers and so I ordered sliders and shrimp cocktail. My colleague ordered sliders and the Buffalo chicken wings.  The sliders were good, but my shrimp were clearly not fresh and very limp. However, the cocktail sauce more than made up for them. The flavor and the horseradish combination was perfect! BUT, the real highlight of the meal was the beer battered buffalo wings. These were strips of real chicken breast in an absolutely delicious beer batter coating. There was an enormous quantity of them and  unfortunately we were not able to finish them because there were so many.  I would gladly go back and have that appetizer plate as my sole meal.  NOTE: if you take advantage of these $6 appetizers, please remember to tip your waitress based on what they would've cost had you paid the full price! :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zDoa3zgY8K52iXVi-zcDwA"
  },
  "h30l_qpz7-FcD4x2akueow": {
    "date": "8/2/2019",
    "text": "I can't believe there are bad reviews for this place! I've been here several times and have not been disappointed! Best. Wings. Ever.! I love the honey garlic the most Great sweet potato fries and I've had 3 awesome salads. The steak salad...omg...that steak was top notch! I cut it with a butter knife! Very \"dark bar\" atmosphere,  but who cares.. great food and really good prices.  $10.00 for 12 wings...c'mon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lwqyCqQa3mS9liHIxjpJtw",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Best wings in town! Honey garlic are the best! And great ranch",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lwqyCqQa3mS9liHIxjpJtw/o.jpg"
      },
      {
        "img_id": "2FU0VNyoGFJ_t1aHr-KJhA",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. This is a wedge salad? Hell ya, it is!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2FU0VNyoGFJ_t1aHr-KJhA/o.jpg"
      }
    ],
    "user_id": "OM47w9NM8oDJfVsWPJO8wg"
  },
  "mcc4KbOwj1hSKsCdHL0C8g": {
    "date": "9/15/2019",
    "text": "Sunday night, decided to go to the Tavern Grille to get something to eat and watch Sunday Night Football.  Got there about 8:00 PM and the place was pretty empty.  Sat there for approximately 15 minutes while servers and busboys buzzed all around us.  Nobody ever came to wait on us. Didn't acknowledge us.  Didn't even get a menu.  We finally just got up and left.  Nobody noticed.  We drove 25 minutes down from Carefree just to go to this place.  Won't be going back, I'm sad to say.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s-0Cju3IjhiGRqiExvdMrA"
  },
  "xTwCbE7tsFbOfb0Cmiyn-Q": {
    "date": "7/30/2019",
    "text": "Pricey. Daily specials confusing as they're laid out on the chalk board. Food is ok. Burger bland, not any seasoning on it at all.  Shrimp cocktail super pricey for a bar grill restaurant.   Probably won't go back again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4d13xAX2jp2EbGF8I9eZZw"
  },
  "iGMjbe_tSiJ706t_7AZOwA": {
    "date": "8/1/2019",
    "text": "My first time at Tavern Grille.  Much larger inside than it looks from the outside.  They have nice happy hour drink specials and I also heard that they do half price burger specials too.  It's a busy lively place with off track betting and a fun candy bin right at the entrance.  Now that I know where it is, tucked in a tiny plaza back of Frys Marketplace I will go again.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tDUp3oq96HxEdoRCNKQxDA",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tDUp3oq96HxEdoRCNKQxDA/o.jpg"
      }
    ],
    "user_id": "zy4A7504SezncCAcotMv4g"
  },
  "awbinqSa2-Cc97lbT34TDA": {
    "date": "5/17/2019",
    "text": "Great bar, off track betting, good food, pool tables & a lot of locals.  Separate dining room if you'd like with seating all around the bar.  It gets very busy, so plan ahead on a big horse race day (hours ahead). Lunch specials, fish fry fridays, tall drinks & plenty of TV'S.  The food is comfort food for sure, I like the green chili chicken sandwich, the salads are good, the tacos are decent as well.  Neighborhood bar, so come have a good time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "1C7imfsNeD-Pdwfrw-PR8Q",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1C7imfsNeD-Pdwfrw-PR8Q/o.jpg"
      },
      {
        "img_id": "Hw2SHTi0PtuzVOC7vk-AxA",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hw2SHTi0PtuzVOC7vk-AxA/o.jpg"
      }
    ],
    "user_id": "orO4O_7InPaJk32SJk2XYA"
  },
  "p8s1jHvr3mORHUwuf_NgXw": {
    "date": "9/18/2019",
    "text": "Usually ok time to come here. Budget friendly.  They cater very very heavily to they're regulars so beware.  I was brought my tab before I requested it hinting to beet it so I can give up my bar seat to a regular.  WILL NOT RETURN!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YH2mLlR4HUpSQKmKp9jLSA"
  },
  "Bd28Wmqez5zqCR54liog9Q": {
    "date": "8/6/2019",
    "text": "Not a bad place... I went for the wings and they were pretty good. There were a few of the 24 that my husband and I shared that were a burnt with not much meat on them..(even less than normal) lol. Service was great and the atmosphere was pretty nice.  A lot of people came in to partake in the off site betting... pretty cool feature if your into that..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eQSGWH1jf892mK4pzuAeyw"
  },
  "1ZLS09aFoEU9AuAaEE5dBQ": {
    "date": "10/20/2018",
    "text": "It's been a week since I had my really first bad experience at Tavern Grill.  We have been coming here since it was Teakwoods and had \"The DUKE\"  on the menu (going back 15 years).  We have been having really good times and good food here all these years so we decided to share what happened last Saturday because the management needs to know.    We were seated in the back area where all those large TV\"s are and we were literally seated front of the TV which is by a door that opens into a storage room.  It was a booth and we were sharing the same side.   We sat there eating and watching TV when a \"busboy\" literally knelt on the opposite side of the booth to start reaching over to get our dishes. His body was over our table.  He reached over and started to put the caps back on the hot sauce bottles we were using.  My husband and I tried to tell him to that we were still eating and using the hot sauce but the young man knew no English.  Finally, we had to wave him away until he got what we were saying.   After that he didn't seem to be done with us.  He began to transport empty kegs of beer into the storage area by dropping them and banging them loudly over and over.  He knew we were annoyed but didn't say a word to him.   We did, however, make a note on our receipt to let management know what happened to us--two long time patrons.  We don't want a free meal,  we don't want anything more than to return to the old Tavern Grill that we enjoyed so much.  The brothers do a great job of customer service and making the place a neighborhood gem.  It's like losing a reliable friend. Sad.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "LhUwtTvo8ofkyWr_ACUxlw",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LhUwtTvo8ofkyWr_ACUxlw/o.jpg"
      },
      {
        "img_id": "yZatULlhWLu1pVl0G7KoFw",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yZatULlhWLu1pVl0G7KoFw/o.jpg"
      },
      {
        "img_id": "JS1bzhcnu3cuF8x2SLcL5w",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. New England clam chowder",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JS1bzhcnu3cuF8x2SLcL5w/o.jpg"
      }
    ],
    "user_id": "ahwwAXJ_qwGmuRjTOHHMWg"
  },
  "h-n3djzDSZT20hfxBHAL9g": {
    "date": "1/27/2019",
    "text": "Chivalry's Dead at this place! Love the owners and the staff mostly. Problem here is the regulars \"NORMS\" That attempt to take over the bar area. Just saying when 3 women walk in to a bar and not one guy even looks up to catch your eye and offer a seat??! Foods good and prices right. Just dont feel a warm vibe from the bar bullys that tend to mark there territory.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i-lTq2m4d59nvxSpJkyyyw"
  },
  "eJjb4DObcmd_b4FlevuDrQ": {
    "date": "5/4/2019",
    "text": "This neighborhood bar and restaurant is awesome. Always busy but they seem to find room for everyone with minimal wait time at peak times. Best food and service around. Daily specials and very broad menu. Wednesday ribs are the best. Enjoy taco Tuesday as well. Always consistently cheerful and efficient staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "axLJV-iiOagaLDX3MKJpHQ"
  },
  "iiuJS1NUsaqj2vbCdOfYew": {
    "date": "7/16/2019",
    "text": "Best Taco Tuesday in town!  Such a great value and the staff is always very friendly.  It gets busy at lunch but the food comes out quick and spot on.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PhHW177DiDJ_GL2I5xcd-A"
  },
  "MqwCbuyJFq4oSDzCZgZDLw": {
    "date": "4/23/2018",
    "text": "What can I say that is new?  This is a great family place where the food is always excellent  ..as well as the service.  The owners, Ryan and Matt are almost always there to make sure everything is first class.  In other words,  they manage by walking around, rather than reading reports.  They appreciate the customers and the customers appreciate them.  They have different specials daily, and they are always great.   This is a winner, and always has been!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "be4Y79c85n3Dk_TlssM08Q"
  },
  "Z5nYaiqx1cZls9005GHa8A": {
    "date": "5/14/2019",
    "text": "Well I can't really do the best review because almost every time I go here I just get the WINGS! Soooooooo good! They're crispy and and meaty and not a lot of fat which I love! Everyone is super nice, Desi always takes care of us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "is1dmHox8Uww67-ZmjK-QQ"
  },
  "1Z0g2lTLb0BK67qr9oq5vQ": {
    "date": "3/24/2019",
    "text": "Went there with friends for dinner. We had burgers and some had ribs. The ribs were wonderful!  The regular price was reasonable but the ribs were on special that night. What a steal for delicious and a real steal on price. Must have had staffing problems that night as service we slow starting with trying to clean are sticky table. A neighborhood secret, we would go back again. Weekends are really busy so plan ahead.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C9Dg_c198W_nh0orTgcAIg"
  },
  "-bqakbKIj4kbymsHzIdSYA": {
    "date": "5/22/2019",
    "text": "Check out this place!! Hidden back in the corner, it is worth the find. Food is fabulous and owners are always there. Large portions!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "858c-6xQq5jPVq26aqMh6Q"
  },
  "oP707V9ExIV8c4X6SalbgA": {
    "date": "4/16/2019",
    "text": "Everyone loved this casual sports bar with great energy and even better food. I shared the sloppy dog (all beef hot dog with sloppy joe sauce and fried onion strips) no cheese for me, homemade bun! Yummy is what I say! And I'm always a fan of tater tots; my daughter raves about her Ruben sandwich & 3 people at our table ordered the fajita special: tons of delicious veggies & Fixins for only $8.99; this place has daily specials with great happy hour drink prices. Their Arnold Palmers come in a gigantic glass and are delicious. We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uwnh6iDZCyiOiTDW6qoLgw"
  },
  "ZcTHvutfrdjxtCwXj2YYSg": {
    "date": "5/7/2019",
    "text": "Writing this is an extreme pleasure  Two great owners who care for their customers with always a greeting. When you order your food Ryan and Matt are always there to ask if everything is alright  The staff. Unbelievable. Friendly, courteous and always want to make sure you are having a great time with their excellent customer service.   Thank you Stephanie, Angel, Jr. Dez, Cody , Rickie. And many more great and courteous staff with excellent service  All of the staff ask, anything I can do to help you ? The food. Unbelievably great. Cooked to perfection  No words can describe how great their menu is and there is different varied specials everyday. How can you beat that? Just an example..Saturday special. Burgers. Excellent quality of meat, and they are big hamburgers. There's no words to describe the burgers except ordering them Tavern Grille is # the number 1 sports bar and family establishment going",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wke_7Y2jPOnv97JARNipeA"
  },
  "zuf_aXbPzw2PdsArioRREw": {
    "date": "12/22/2018",
    "text": "This place is excellent. Great food. Amazing crew that is always on top of what you need. The specials are priced well below their worth.  The owners work hard to insure the happiness of their customers. Try the sliders. I always order a secret menu item of jalapenos battered and fried.  Tasty. The wings with a mixture of hot and bbq are the best I've had. You have all seen the show \"Cheers\" well this is the real thing. AWESOME",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WRAHBgI5j7jg1vjTQNr1Jw"
  },
  "lTA559CuQwRKjl3VIichiw": {
    "date": "7/14/2019",
    "text": "Getting ready for my annual trip to Scottsdale. Arriving on Saturday and this will be my first stop for the burger specials that they have on Saturdays. This place is one of my favorite stops while vacationing in Scottsdale. The staff and owners are very friendly and go the extra mile to make sure everything they serve is fresh and delicious. I will stop in a couple times while on vacation. The daily specials are awesome, Tavern Grille is a must to try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JhSuT3RpzHNE-w9D-Q7-AA"
  },
  "7PbpcMBuNZMTM-A76n6unQ": {
    "date": "3/3/2019",
    "text": "Wow, this has been my go to place since the Teakwood days,  tonight was a total debacle!! Sat there for over an hour with our server telling us our food would be right out, then after an hour he said they were short handed in the kitchen. How about that communication when we sat down. We finally left, second bad experience- curious if ownership or management company has changed-looks like 92nd Street cafe is the safe, consistent new go to for us.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D7YAIzVAjrt8Au-BrkiHpw"
  },
  "Asc1TDLHPPlTKQNd8Ly5xQ": {
    "date": "7/30/2013",
    "text": "I really dig the inside of this place, makes me feel like I'm not in blazing hot arizona! Perfect place to meet up with friends and family and throw a few beers back. The service we had was GREAT, she was friendly and I felt like she cared. However the food is just okay. That's why I'd only meet up to have drinks here. I will try something else next time we go back, because I would like to like the food as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f_5nxf2qOjaE0tVjjRJDPg"
  },
  "30z0ti1fM3CMLH-VZbjCTA": {
    "date": "10/21/2016",
    "text": "Just moved to Arizona and was told about this place by some locals. We are so happy we tried it. Food was amazing. Staff was super friendly. We will make this a regular stopping point.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FKp4YaigQrsZ8UJERuXiiQ"
  },
  "72fkvh05la9lGbYq3BBySQ": {
    "date": "11/29/2016",
    "text": "Excellent fish tacos and berry cobbler. The suicide salsa is amazing. Great service and the bathrooms are clean and smell like Hawaiian febreze. Could use better wifi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IsgAqlpUg6J-O1ppe4Sa2Q"
  },
  "dsJKjtqpEhF4RAFpQ5Hk5A": {
    "date": "10/30/2014",
    "text": "Great appetizers! First time I have ever paid $6 for nachos and had to order more chips!! No kidding, so much meat, cheese; tomatoes, olives, jalapenos, and more just absolutely loaded! So much I couldn't find the chips.  You have to check this place out on Thursdays $6 dollar appetizers all day. Caution...if you come during a football game it is REALLY crowded .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bIhL6xKOOdL1utMjZTzF6g"
  },
  "yAt01nNrY0PZag726yiAjQ": {
    "date": "3/26/2015",
    "text": "Food was great. Came here on Thursday when appetizers were 6 bucks. Nachos were good. Wings good. Wedge salad delicious. Had their homemade ranch. Servers were very nice and attentive. Definitely would come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MwRo5-LNtV6fpKKf2B8G0w"
  },
  "57rY4cai_nH67dspNOMY0g": {
    "date": "3/7/2016",
    "text": "Man I love this place - best food around and you can't beat the atmosphere.  The owners are very friendly and personable and go above and beyond to make this place what it is.  Perfect to watch the game (soooo many TVs) or to just hang with family or friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Z7IBKU9k-H0cWIU2mYydQ"
  },
  "fAmi84fpyqENsPAmCkWV4w": {
    "date": "4/26/2014",
    "text": "We were meeting friends at the Tavern Grille so I looked up the reviews and they talked about great service and great owners. We were pleasantly surprised that the reviews were spot on!!  Great experience. Loved our waitress Desiree!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "K6sP6DBvXpGMNAylLVLzNQ"
  },
  "-5qA2EvLCCtgBW8mzlK5_A": {
    "date": "12/16/2014",
    "text": "I have been wanting to try this place for a while and was standing at the door for 5 minutes with not being acknowledge.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w_03j-2szAMgdReDffcHoQ"
  },
  "0Ro9RPY9ICZHLfRoMh9jSw": {
    "date": "4/30/2014",
    "text": "This place is great. An owner operated bar with great specials for great food. Fajita special on Monday is great and the burgers on Saturday are half priced and the best around. Do it, you will thank me for it. Quality all around.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "prpOBEbyb1HD26t4755gtw"
  },
  "O0uWYeT5K3FO2U1swlqpuw": {
    "date": "1/10/2015",
    "text": "My first visit & we'll definitely be returning because of the excellent 5-star food. The sirloin Cobb salad was delicious & huge. The steak was tender & cooked perfect. I gave my garlic bread to Husband & lived it. Husband had the fish & chips & said the fish was really good since the breading wasn't too heavy & it wasn't overly greasy. The downfalls of this place & the reason for 4 stars are the noise level & extremely slow service.  If you go here, don't plan on any intimate conversations or to get in & out quickly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3jy72SmBDh-HwkKGHCocgw"
  },
  "2ITiZLtEuA5_TexiX_Srww": {
    "date": "8/24/2012",
    "text": "Went here by accident because my co-pilot can't use iphone GPS. All I got was beer and wings. It was hapopy hour, Beer was $2.75 (YAY) and wings were $5 (double yay). And maybe I came on an ON day but they were dang good, Service at the bar was top notch.  I can't vouch for the other food. We all got wings cuz they were cheap, and we all loved them. TVs everywhere for sports, and OFFTRACK BETTING!!! Big place, again with the GAMES FOR KIDS SO PARENTS CAN GET TANKED! DISCLAIMER:Do not drink and drive with kiddies in car. Call a cab. And do not let them gamble while you are busy eating wings. They can learn that later.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "djP46l4v0TQTqhLa-ZB1xw"
  },
  "oGoYajgU8y4PlTRFVQm8qg": {
    "date": "3/13/2012",
    "text": "Now called Tavern Grill.  1st time I've been here, met a friend for happy hour at about 4:30.  Place was filled with an older crowd.  But didn't care about the people, as I was there for a visit.  We ordered tacos, because it's \"taco tuesday\" and the fish tacos were really great.  Very surprised.  The service was excellent and happy hour prices were awesome.  The location is very bizzarre and not easy to see from the street, but I liked that they had lot's of TV's.  And the food was good.  I would def go back, but wouldn't go for finding a date.  Unless of course I was looking for a gentleman in his 70's.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Js1FsZ6oP_9tO5tbJN-d2g"
  },
  "UDyjqwKbKMBeg_kIkQzC8w": {
    "date": "2/6/2012",
    "text": "I like their special offer on Saturday. BOGO (Buy one get one free) Taste is good. Good burger. Go and try it. But if you want a cozy, quite atmosphere, you'd better find the other restaurant.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-3ZHY1WDUJ2CrarmAZb-Sw"
  },
  "IcX-MVs64I1HEpmCT2un8g": {
    "date": "11/11/2014",
    "text": "Good bar food at reasonable prices. OK bar atmosphere. Management seems nice and greeted me personally but the bartender really didn't seem to be enjoying herself. It was a slow afternoon when I went there for lunch. She offered no water refills,  had to be flagged down whenever I needed anything,  was only paying attention to her regulars, and never checked to see if I was happy with the food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d196Lj2Pp_p0E7UNPZLIKg"
  },
  "CyVYtFGBWQRDiCNQx4f0LQ": {
    "date": "2/3/2014",
    "text": "This has become one of our favorite local hangouts. Great happy hour prices, everything I've tried tastes good (quesadillas, burger, chicken fingers, fries), and OFF TRACK BETTING!!! My fiance and I love to grab a group of friends and take over their pool table area and just spend hours there. Staff is friendly and service is fast. Love it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kR5p8iCMlGm-ld-uq0FrwQ"
  },
  "tJPwhU1La5NFoVedgg3X5w": {
    "date": "5/15/2016",
    "text": "I work nearby and have been going to Tavern Grille for 10+ years: lunch, dinner and the occasional happy hour. On weekends my boyfriend and I will sometimes drive in from further away as we appreciate the familiar faces providing excellent service, fresh, delicious food and well-made reasonably priced drinks. Everyday of the week they have a different food special. Servers and staff are always friendly and eager to please - Tavern Grille is consistently good, very refreshing considering it's difficult to experience the same elsewhere especially when trying new places. Also, many of they're employees have been their long term...they must be treating them right which makes us happy to give our business to such a well managed establishment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XyYJyDjPNUGdkk-siRqOLg"
  },
  "D3PwQeobJaRuBws3XdhT8A": {
    "date": "5/3/2015",
    "text": "Went in for lunch service was slow but food was great as always. The moose chips are incredible. I would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QSO8rqQGn9k3Jcr9gMq-ug"
  },
  "J3BhS-5AWz1aOPxdTPLP_Q": {
    "date": "1/20/2014",
    "text": "This is our favorite hangout while wintering in Scottsdale.  The daily specials are varied and each is delicious.  They also have outstanding service.  On one occasion, when the kitchen forgot my order and it came out later than the rest of my party, they not only did not charge me but gave me the most delectable bread pudding dessert free of charge.  The staff could not apologize enough.   Every single member of their staff is well trained and excellent in the manner in which they interact with the customers.  The atmosphere is casual and fun and everything we've eaten has been above average in taste and presentation.  One word...awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EqJrybr4OYERnPX-Y6mjww"
  },
  "IHBSUVwP-xgsA63naKwRYw": {
    "date": "11/10/2011",
    "text": "I have a much known and publicized dislike for Scottsdale and those who reside in it. Especially the 30-something single crowd.... So why then, you may ask would I go to a place in the heart of that douchebaggery? To meet my best friend for a beer late afternoon, Happy Hour style.   What I encountered at this place was awesomely refreshing. So much so that I probably should not be writing a review on how great this place is, lest it become a \"cool trendy\" place to be. Great for the owners, I know, but terrible for real, in touch, sensible human beings.   Let's talk about the owners... They are local. And a family. REALLY? A family owned and operated joint in Scottsdale? Shhhhh! Don't tell anyone!  Something that that sets them apart is their home-made daily dessert. Our servers (I'll get to them in a moment; be still my beating heart...) kept talking about this brownie with this lost, googly-eyed in love look. Of course we had to indulge. And we did... In all 5000000000 calories of it's peanut-buttery chocolatey al a modey deliciousness. But we loved EVERY fat round belly inducing bite.  And so these servers... We had two of them. We started with Jennifer. And because we're just sooooo cool (not really. We're not very cool at all.), we ended up with Tiffany ANNNNNDDDD Jennifer. They rocked our little worlds. Beautiful, fun, friendly, outgoing, fun to joke with, awesome energies and attitudes, and did I mention beautiful?  This was a great experience for us after a long and challenging week. It's great to have a place to go where we have a great time and drink a couple of beers.  And they have buckets of peanuts too... Does it get any better?",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7f781UcgcRoFwtUR1IsB1Q"
  },
  "5MHHoigD6YyCPWJi0MvLaw": {
    "date": "10/31/2011",
    "text": "Mmmm... Beer... and the grub ain't to shabby either.  Who does not like roasted peanuts with the shell and pitch them on the floor after eating the nuts?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E_epad6UlUKXtm-X0us1Kg"
  },
  "QSHlP7cMsfARP-QmAucShw": {
    "date": "4/21/2017",
    "text": "One of my favorite spots in the area. The staff is always friendly and the food is always good. Another perk is there are two layouts. The bar layout, which has a lot of bar top seating, is the main focus. However, it has the casual dining option separate where you can have families. A nice side note is the Off Track Betting for anyone who likes \"the ponies\". This is a good option.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L3A_5NaJ6Mgm0-wrJRvXdg"
  },
  "9hn384PpF0WrT5pZQDqmgA": {
    "date": "12/15/2016",
    "text": "Thank you Yelp!! Never would've found this place!!  I am always intimidated when I'm eating alone, but I felt at home immediately. TVs everywhere and the staff all are so friendly but you can't go wrong with Sara!!  She made me feel like I've known her forever!!  The menu is so extensive if you can't find what you'd like you need to just go home!!  They have daily specials all day like $3 beers to $6 any appetizer!!  I had there onion rings and they don't skimp!! Must try you won't be disappointed!!!  If undecided try their triple combo plate, chicken,shrimp (best fried shrimp ever) and cod with the sauces unbelievable plus feeds 3!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DPaB_zUBLOPFzXuHoDp9kA"
  },
  "BYCPMZB5KA2x8VLFsch6DQ": {
    "date": "5/5/2017",
    "text": "Weve been here once with the kids, and we love this place and recommend it. We like to try new places each time we go out, and this is someplace we recommend for people with or without kids. Its a fun little environment with good foor. The bar is in the front and seating for the restaurant is in the back. We enjoyed our experience and food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5w2WDQ-dTBZSMPNzTabvHQ"
  },
  "O-ijGPYWVcQqC36xCs1Oxg": {
    "date": "1/12/2017",
    "text": "Been looking for a bar like this around here. So happy we found this place. The bartenders are so nice and attentive. The food has been wonderful. Love the wings!!! And everyday specials!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xXMaTeyBT3ipMuJvBNsAKw"
  },
  "EI1LMowGvtKSsDGt9lXQzw": {
    "date": "6/28/2015",
    "text": "A great little place to relax and have a cold beer and a great meal. Food is always great, service good, prices reasonable and comfortable atmosphere. Try the $3.50 sangria on Fridays, it's the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qrZQ9xKNNx6L3PxZhnRHHA"
  },
  "DVNBCZivnYjaB2dOC_2Ncw": {
    "date": "10/1/2016",
    "text": "Love this place.  Great service, great food, lots of TV's to watch the game, the bar staff is fun and sexy, and...everybody knows your name.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BrwyQPYj3CLzVpHNbsMcRA"
  },
  "oJqgoC1p9fC25UwsTPID_g": {
    "date": "8/22/2015",
    "text": "Bar staff is good. Manager is great! Inquired about the Patriots game that was on but not on tv's and he apologized . Reason is during preseason the bro network decides what games are broadcasted live. Thank you to the manager for going out of the way to tell me that. Will defiantly come back here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SX5ikqd3ZS8F1IMuLAebIA",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Central bar seat watching the preseason game of the Cards!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SX5ikqd3ZS8F1IMuLAebIA/o.jpg"
      }
    ],
    "user_id": "50sMRHr0ptxYDcSB3FeZow"
  },
  "mqEOpJwzi0KEXV6SX-M42A": {
    "date": "11/13/2016",
    "text": "First and last visit. First, the special was 1/2 price chicken sandwich which then required a drink purchase - I was drinking water so I ordered a bottle of water to go. Secondly, the chicken sandwiches, as described on the menu, are suppose to be 1/2 lb breasts but my sandwich, was two chicken fingers of processed meat which was terrible-I sent it back. I ate the great shoestring potatoes., though. The manager offered to put together a better sandwich. I declined. Third, the bill came to $1.08 for the water bottle Which I never received-boo hiss. Lastly, I presented a gift card I received from the owner or manager at the Cottonwood location but this location said it had no value..... really? Whatever.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iMAJOx6EbS47W9_o03dOYw",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Giftcard from Cottonwood location",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iMAJOx6EbS47W9_o03dOYw/o.jpg"
      },
      {
        "img_id": "arqXPJ0BFp1Vk3WynaqhJQ",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/arqXPJ0BFp1Vk3WynaqhJQ/o.jpg"
      }
    ],
    "user_id": "doytc8JZoo77kE3e6DecVQ"
  },
  "zIxJshzhw1bjw9CU6o57pQ": {
    "date": "3/18/2017",
    "text": "Went to Tavern Grill twice. The first time disappointed with service.  Waited for nachos for 45 minutes. Totally unacceptable!! Nachos weren't even good. Friends said I should give it another try. So we did. What a mistake, service was terrible again. Once we were served our drinks we didn't see our server again until she served our food. Waited 50 minutes for 2 burgers, again unacceptable. Server never came back to ask how everything was or if we needed anything.  Burger had a nice char boiled taste, the fries were terrible. Need least to say we will not be giving this place a third try.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dP-4yXX6mAuVPTFao7vKOg"
  },
  "5VDJmWoo72BLMiIY-B0RYw": {
    "date": "2/18/2017",
    "text": "Been looking for a homemade burger that's cooked to perfection and I finally found it.  HOLY COW (no pun).  The bartenders are efficient and friendly.  We had the moose knuckles as an appetizer with fries, tater tots and onion rings As our side.  Cooked perfectly and super tasty.  The owners are so friendly and completely involved with their customers. Delivered food orders and chatted with everyone. Absolutely will come back.  Yummmy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KOtFNR4wPbZFhK-FZEGE8w"
  },
  "NwqWbqYzo6Ne1_6Eoub80w": {
    "date": "12/6/2014",
    "text": "My wife found this nice place when she was working nearby.  We visit and have burgers or fish & chips or sandwiches every couple of months. It's reliably a good meal.  We usually go on Saturdays after a round of golf or a good hike. Frequently, we'll get their Saturday Special: 1/2 priced burgers with the purchase of a beverage paired with $3.00 San Tan Drafts.  It earns 5-stars because it's almost always considered as an option when we want to go have good food and a good time.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6vkySMLIPdE70pqhJckXvA"
  },
  "YmhiVSQ1derW4gydXnM24w": {
    "date": "10/11/2016",
    "text": "One of the best local sports bars in the area. A hidden gem with great TV set ups, great specials and friendly/personable bartenders and servers.  Even the busser's take care of you (literally one saw me walk in, grabbed a chair from the back and got me a seat at the bar). The owners are always there and make sure that your taken care of.  Make sure you check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UTIxdHqIOea-9JRNU6zr4Q"
  },
  "1daD80etPgxE9sJFpWz-1w": {
    "date": "11/14/2017",
    "text": "This place is a gem and I'm thankful we found it. I wish there were more taverns like this in Phoenix with great food, service and reasonable prices. We started coming here after we moved into the neighborhood. The menu provides you a variety of choices and can satisfy any palate. There are great happy hour deals here along with friendly clientele and it's a good place to watch your favorite sports team while you enjoy a cocktail after work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HwvUAc0SNyEJ_yOVH31zkA"
  },
  "XAWkWzBoJcRF0INVeVyg6Q": {
    "date": "3/28/2015",
    "text": "One of my favorite bars in the valley!  Their happy hour specials plus the daily special depending on which day you go make this place an incredible value.  Unlike most sports bars their food is actually the highlight.  My friend is in love with their wings and me personally the big plate of nachos or their sandwiches are the go-to dish.    The only complaint I'd make is their beer on tap can tend to be on the warm side or the .. old side?  Idk they must have bad taps or delivery systems because it's pretty consistently below average despite their selection and pricing being top notch.  My suggestion would be to just get a pitcher with a friend as it won't seem so bad after 1 or 3 of those!  (Please drink responsibly)  if only they had chilled pint glasses then it might not be so noticeable.  Seriously though their food is great, they have horse races to bet on which is fun for a casual bet, plus their happy hour prices are great!  The manager there is cool too he's always friendly.  You have to get there early for sporting events as seating fills up quickly and it's fcfs",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ro4LnbDil9mKkcbA2vQVlw"
  },
  "M1A65WNrIWXY4DwwqWAlaQ": {
    "date": "5/7/2016",
    "text": "Derby day and the place is packed and the food is coming out faster then you can imagine.. Good job to the management and staff. We appreciate you and your hard work on such a busy day!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "d8Lbjq-G-W5AmPo_DZ_Fgg"
  },
  "x46orh0iRwIyb-xIJIY1rg": {
    "date": "12/3/2016",
    "text": "I have been a loyal customer for years. I have live in the area for 20 years and been to many local happy hour bars/restaurants. You have to understand that in Scottsdale there are many choices to eat and drink. But by far, hands down the tavern grill is my #1 choice, it's very affordable and has a quality product. But most important the staff and service is 110% the best. Great job Tavern Grill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SekTbgAjNlBqw2rqIF5nkg"
  },
  "s9mB39OBrkHunASNa03gzQ": {
    "date": "8/21/2017",
    "text": "Very good bar for food, to watch sports (many TV's), horse betting.  Burgers are very good, chicken sandwich very good. Sweet potato fries are great and their French fries.  Nice bus boy (man) always comes around and shakes your hand.. very friendly!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nFk-FM12uvhS3vP8fRHIyQ"
  },
  "FGXYwH9ejJDJ70t8TzbFaQ": {
    "date": "7/31/2014",
    "text": "Fun place with great daily specials. All of the food is awesome. Not healthy, just delicious. Drunken shrimp is a big hit in my life. Vibe is a cross of sports bar, neighborhood bar, and restaurant. The also offer off track betting on the ponies. Good times and good people. Service is always good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sYIGrY-S-6r3zMRrmSfd9w",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sYIGrY-S-6r3zMRrmSfd9w/o.jpg"
      }
    ],
    "user_id": "yhZZPzv9PdDLZ49yTugt9w"
  },
  "feRTItPsqP_il8vnmKGMVw": {
    "date": "10/31/2016",
    "text": "Seems like a cool place. The menu is really confusing. They took a half hour to make a half sandwich and salad. I ended up leaving without eating. I guess there was a large party in the back or something, but that shouldn't matter.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vhFpvhHT1HhYsxaIZ4stuA"
  },
  "PgdT7BjNFDZVIHS1WMJyIw": {
    "date": "9/26/2016",
    "text": "Great service, great specials and good food. I take clients here all the time and get treated the same every time. Excellent management and friendly employees. Never had an issue ever.  Clean and professional.  Thanks again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X8ntyrZ8f1aJ7pNSjawklA"
  },
  "U8c1_I5XYmWNuDGIJ3WikA": {
    "date": "3/8/2018",
    "text": "Great restaurant in Scottsdale and Mallory is an awesome waitress.   We came last year and she remembered us.  She's super friendly and a great waitress",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HxP3qGH5n7TosOGAIL7wIQ"
  },
  "So26mK8-jm_QAgVTzDvfyA": {
    "date": "10/15/2016",
    "text": "Owner and staff very friendly. Try Taco Tuesday Full size tacos at cheapest price you'll ever see in Scottsdale. Dog friendly. Food orders stop at 10 Food ok. Vegetarian pita very good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fWvroGiCZd7DZJT8dXwsqQ"
  },
  "L6qW5uS3uHNAjrfqNZqcCw": {
    "date": "4/25/2018",
    "text": "This is one of my favorite bars.  Great burgers (my favorite spot for a burger) and chicken sandwiches.  Nice selection of ice cold beer and pretty good prices on the beers.  Good selection of whiskey, but when you order on the rocks the price increases for ice.  I will never understand why the increase for ice as the shot size does not increase?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-trj0so0_prPxta2G7ZAQ"
  },
  "Gkecq5lMHOJSltvIratWOw": {
    "date": "3/31/2017",
    "text": "Great service! And great for off track betting :) nice selection of local beers, and the food looked amazing! We didn't eat anything, just drank a few beers, it was super fun!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PLYXqbndjsnlRSUcJrGHKQ"
  },
  "H0RiU7WEJlSig9DRM-KxUw": {
    "date": "2/16/2018",
    "text": "Food is always good here. Great specials every night. Tonight was,dish frh night. We were not not happy with some fish we,received. Tonight the service was not very good. We could not get any server to get more fish.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CTJ_BC5hg9m049UltI4xtQ"
  },
  "jCd_VkiRWEOd7x8OYgw9Mw": {
    "date": "7/23/2017",
    "text": "Great food .Great service.Even better if you happened to be there on one of there specials night.(Otherwise count on paying the average Scottsdale price).Management is fantastic...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LA5xD3n4b9-NuW2Uy-IhbA"
  },
  "7NDNOf2TwRE3a2Bn2R2k4A": {
    "date": "9/5/2017",
    "text": "Great food, friendly staff and fast service.  I have tried different items on the menu and I'm never disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HjzG7ZtZfUxWkGn07_DKng"
  },
  "ipcuw23bkD4ELyWozKEApQ": {
    "date": "4/23/2017",
    "text": "Best Saturday burger special,,  the Ultimate burger,  what can I say it's not missing anything,  tried it on sourdough bread this time. .  . .  ..  .  .   = A relaxed, enjoyable time...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MXkzog3yfF7qGcqW5y00Q"
  },
  "Bmvz3XU9Y7C7HFa0edKgow": {
    "date": "3/9/2017",
    "text": "Food is good and the service is great!! Mallory is awesome! We come to AZ for Dodgers Spring Training every year. It's our first time here and we will definitely be back!! Drinks, food and sports! Who could ask for more?!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7BEE7NsVE74ZVS0LV0MBlQ"
  },
  "0kUnBegD_0_lvMFyFNzBBA": {
    "date": "8/4/2017",
    "text": "Well they haven't told me not to come back yet. ...plus that Aly (sp) is freakin awesome.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3kfb6rZ_Q-fyVrDXIjACfQ"
  },
  "tyzxoK8qA6y07ozG4-x-mw": {
    "date": "7/24/2017",
    "text": "First time here.  My husband got a green chili cheese steak that was awes ome.  Best fries ever! Nice and crispy.  Tots are the same way.  Chicken fajitas were yummy, 1/2 lb was more than enough for 1.  Service was friendly and quick.  Different specials every day  Note: kids do not eat free any day (I searched kids eat free Monday and they popped up #1).  Totally worth it, even though kids don't eat free. We will be back for sure!  Ask for Sarah! She's great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AvELAKqVCRtEJQe9ygL-2A"
  },
  "kUJ8JmG1dPC-19sSR0_z3Q": {
    "date": "3/18/2017",
    "text": "I am ALL about their fish fry Friday all you can eat @14.99! And service has always been grate! It's also the place for that off track betting for me and Kentucky derby!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V_ZWhNiB4Wqi7F981e5PTA"
  },
  "nXX9Puw5n_Enzrs1LkJyfg": {
    "date": "2/20/2018",
    "text": "Service is exceptionally slow here. Bartenders do not acknowledge guests in a timely manner, not even a hello.  It seems that even when they are not overly busy, they look overwhelmed and flustered.  A smile and hello goes a long way for repeat business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vurLVawwE1N05V13IUyiYA"
  },
  "YDGACTDT4RXAKD17xn-ofA": {
    "date": "3/9/2017",
    "text": "Found a great sports bar with great service for our annual spring training trip. Mallory was our excellent server and the food was good. You only live once so try the \"Suicide Sauce\". Definitely coming back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AAY-NZphLPc-nerKoswR3Q"
  },
  "M3zTHpD3W9yN9OOl_v1Jhw": {
    "date": "2/18/2017",
    "text": "Great atmosphere and food! 5 stars for our waitress Sarah...we had such a good time and even better service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XpAkvOtaDayCZZFSThZ71A"
  },
  "YjmiGKmuqB22jwkBZ1PQOA": {
    "date": "7/6/2017",
    "text": "First time trying this place: Eddie the server was nice, very attentive, checked on us often. Asked the kitchen to clarify a couple of questions we had. Wings were good. The one thing that left a bad taste in my mouth (no pun): a gal brought some of our food. I had asked for blue cheese dressing and the meal came with what appeared to be ranch. She argued and was very rude \"I assure you it's blue cheese\" and stomped off. 1) I can't stand places that take ranch and dump blue cheese crumbles in it and call it blue cheese. 2) We weren't rude but she was. The funny thing? The crumbles weren't even blue cheese, they tasted like feta. It's the little things with me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BdbAgvJvU2Kb24TildtztQ"
  },
  "mRoi4BbaGm5Pqm1BB9erew": {
    "date": "8/7/2013",
    "text": "After having a couple of drinks at Andreoli's, which is on the other side of the parking lot, I dropped in here for a couple of more.  I've seen this place driving on the 101 hundreds of times and have never stopped by, until now.  I'm glad I did.  I ran into an old friend and he was drinking a can of Old Style!  Wait, what...?!  I haven't had Old Style since my last trip to Chicago in 2005, wow!  So I got one and it was only $2.75...ha! <a href=\"http://www.yelp.com/biz_photos/tavern-grille-scottsdale-scottsdale?select=8wMbT533TTkCipGpgHC76A#8wMbT533TTkCipGpgHC76A\">yelp.com/biz_photos/tave...</a>  Looking around the joint, I noticed a pool table and an OTB (Off Track Betting) window.  You can bet on the Ponies here, awesome!  I wasn't here to eat, so I didn't try any of the food.  However, it smelled good and the plates that came out looked delish...I will have to return to try it out.  The bartenders here are very friendly and ensure that you're never empty handed.  Return Factor - 95%",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "8wMbT533TTkCipGpgHC76A",
        "caption": "Photo of Tavern Grille Scottsdale - Scottsdale, AZ, United States. Old Style baby!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8wMbT533TTkCipGpgHC76A/o.jpg"
      }
    ],
    "user_id": "QJI9OSEn6ujRCtrX06vs1w"
  },
  "smDn5ov8Pa87yPL7W3YN2g": {
    "date": "8/24/2015",
    "text": "Good lord, just get the drunken shrimp and eat that. It's a meal.  It's a freaking delicious.  Spicy beer-based wing sauce and garlic bread.  So, so impressed.  Service was good and attententive, waitress pleasant and fast although we sent her running about quite a lot. Place was clean and pretty quiet late on a Sunday evening so I can't speak to details on a busy night, but I liked the place.  We had some mild wings which were tender....and they delivered enough ranch on the first run to order the whole dozen.  I know it's pub fare, but I can honestly saw it's one of the better places I've eaten in Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "t61TzI47mpsdqrFG-7lJng"
  },
  "FYT9dIb28EEPx8JW0JjueA": {
    "date": "1/10/2018",
    "text": "Perhaps we should differentiate between restaurants and eateries. Tavern Grille is fine if you want to watch more then twenty television sports screens and cheer your favorite team.  But do not expect really good food.  It is an eatery, not a restaurant.  Maybe we could call it a pub.  I ordered chicken \"wings\" which I think are supposed to be breast tenders.  They come on a plate with three celery sticks and a small dish of dressing. Kind of tasted like processed food but I am not sure. But the price was very low, so what did I expect.     Our waitress, Becca, seemed impatient to explain happy hour pricing. But that is OK because we only saw her twice..... once when we sat down and once when she brought the food.  Oh yes, a third time when she brought the check.  She seemed friendly to some other folks, but hey, we are not regulars there, so what do I know?    Like I said, if you want a sports media experience, this is a great place.  As for the food, not so much.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4q6aIIJgf-KuZYh7UPlZ3w"
  },
  "6OMPFqpgZIkv3xhpLElx7w": {
    "date": "1/29/2017",
    "text": "I'd have liked to put 4 stars but my steak came over cooked twice. For my kids and my wife, it was ok. The team was nice and friendly. The Service wasn't too long. The Prices were affordable. I will come back because they were very honest and even if I have eaten my second steak, they didn't charged me. I really appreciated.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SOj3_EiIJsnhMWJPP_Ih4w"
  }
}