{
  "CMHahMBhkv0uFF-GuOaNmA": {
    "date": "1/24/2014",
    "text": "Been there a couple times in the past...Dont know what all the hype is...Went there yesterday 1/23/14..Cashier unpleasant to work with..She wasnt paying attention.. I find the menu a little over priced for the end result... I had the pork sandwich..it was very small..  The sauce was way way watered down (thin)... The mac and cheese was weak at best...ive had better Craft from the box...Im not a big fan of RC fountain drinks...(wtf is up with that ?)   When i went to put my tray away the garbage can was over filled with trash on the floor next to it..I balanced my tray on top and quietly left..Not a \"goodbye\" from the counter or a \"yall come back\"    nothing....    What happend to this place ?  Did they change owners ?  I just dont get it...                                                                                                           I dont think ill be back /",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6y2tyTf8df9tB0mxi2_BGQ"
  },
  "un5pOxMohQ8DiWv9YkWIzA": {
    "date": "9/5/2013",
    "text": "* I brought the Groupon deal \"$10 for $20 worth of barbecue, sides, and drinks\" might as well while I travel on budget. I got here on Wednesday at 1ish, there are 3-4 customer eating at the table, no customer in line.  I ordered the ribs and chicken bbq. The sides are alright, the chicken is realy good. The ribs are so dry. But the bbq sauces are soooooo good. I love the bbq sauces. I won't not come back unless I have another Groupon deal. I will only get the chicken next time.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "PlFBxpYo40HTm5pW4xHs3Q"
  },
  "sGDgIybl2fcaq5aNzzFcIg": {
    "date": "8/25/2014",
    "text": "Everything here is good. I love the barbeque sauce and the peach cobbler is to die for!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DQV5VLpGZm0pyBJeWf015Q"
  },
  "eP97-T6cx_mhxiS_N9OJGQ": {
    "date": "10/13/2013",
    "text": "Cute little BBQ joint!  I mean who doesn't love bears and an adorable catering van parked outside?  Reminds of smokey the bear actually and I'd almost  imagine smokey bear looking at honey bear warning not to start forest fires when bbqing.  Anyways, on to the review!  Fast food style BBQ- I ordered the 3 slider combo which is great so you can try all theme meats.  I liked the pulled pork the best although it's a little on the dry side.  The sauce is awesome and does a great job masking any noticeable dryness if you spread it out.  You also get a side (can't go wrong with Mac n cheese) that comes in a to go container which is great if you can't finish all your food.  I love the fact that the place is family owned and it's a great atmosphere in the establishment with several historically meaningful pictures of it.  The garbage system needs an update as the hole to actually dump garbage is tiny and causes sauce to spill all over the sides and for customers to actually put effort in aiming their disposal of goods.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qmB7ymedLkDBX3gWu-l_JQ"
  },
  "xhhE5qNrDmscJYqiQevFmQ": {
    "date": "12/22/2013",
    "text": "New ownership maybe but it's not the same here. Cashier wasn't friendly. The high chairs were so messy with caked in food. It took me many wipes to get it suitable for my son to sit in and eat in. Wires hanging down from window lights.  Napkin dispensers empty during dinner time. Come on!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jSn6xIKZ7WOKgvrkdxdhdw"
  },
  "QTKnDq6kn33gz9WvEx988A": {
    "date": "2/14/2014",
    "text": "This place is average. I had the vm1 with bbq chicken sandwich and potato salad. The meal was out quick and it was relatively cheap. The chicken was a touch dry for my liking, the bun was a little soggy and the bbq sauce had a watery consistency and lacked flavor. The potato salad was pretty good and a large portion.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "be-uZs2DxDW9_qAJ9k16HA"
  },
  "dPjltT6DoMt69gdQ2BOBAA": {
    "date": "7/2/2015",
    "text": "I can't get over what a jerk the counter guy was. There were three of us. He got our order wrong, but I didn't want to get into it with the guy after having witnessed the fight the guy in front of me had with him. To say it was a fight is a misnomer. The guy just didn't care. He looked at the ticket. Shrugged his shoulders and pointed to a cup on the wall. The customer was disputing the order, not the cup on the wall. The customer looked at me as if to say \"Is this really going on\". I am not sure if the cashier is special needs or just resigned to sitting on that stool day after day knowing it will never get better. I didn't want to get too close to him lest a part of my soul was sucked into his whirlpool of misery.  There was no ice for the iced tea or soda. The soda came out of the machine flat, stick with the lemonade, at least it was this side of lukewarm. The chicken was disgusting. It was dry, the outside was hard. The ribs (I ordered a half and got a full), were delicious as was the pulled pork. The links were good but hotter than they should be. Stay way from the bro'beans. Potato Salad is good mustard. Cole Slaw was good as was the Mac'n'Cheese. As good as the food is, it doesn't make up for the cashier. The cook came out from the back and was a delight. She was very sweet when she apologized for the chicken and gave me a second one but the meal was already over. I hadn't complained to anyone except my dining companions so I don't know if they served me the bad chicken knowing it wasn't good or if they have listening devices so they can laugh at the misery of their guests. Save yourselves, either abandon all hope before entering here or better yet, don't go.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Vipqn-T3SPT6YuKrZOAF1A"
  },
  "nJfyInMckpiydiKfPRmmFw": {
    "date": "4/4/2013",
    "text": "Food was okay BBQ brisket sandwich wasn't bad ...Mac & cheese was a little runney for my likening ...  Hot link wasn't really a hot more like a sausage link..",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "mtT_YxecgzMDj5WoA_FBuA"
  },
  "qc0pbbs21TDL5pTcfI-C3g": {
    "date": "3/10/2012",
    "text": "A valley staple. I am not the biggest BBQ or smoked meat fan but the food is good and the portions are huge. If you like BBQ and Soul food check it out. Their Sweet Potato Pie (and surprisingly potato salad) is extremely delish!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dEk7mXM4npuDPmxrwPcEgQ"
  },
  "Tvx0-PxBAwI9tpla27PTeA": {
    "date": "1/19/2012",
    "text": "\"You don't need no teeth to eat our meat\"  Haha, what else needs to be said.  This place is a solid BBQ joint.  I'm from the southeast and I love pork BBQ.  I was raised on NC style (from southern VA) but I appreciate all BBQ's.  This place is pretty great.  It's inexpensive.  Decent customer service.  Cheap beer.  Very little fat/gristle in the pulled pork which is something I pay very close attention to.    If you're looking for something quick, easy, inexpensive and delicious give this place a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gpGaRoTDuEMBIQbiMt2XDw"
  },
  "BkZmS_ruWiYM8ypOYp6KCg": {
    "date": "7/7/2013",
    "text": "I had a $20 Groupon for this place, so I decided to try it out on Friday. The food was awesome! The portions were huge too! I had 4 meals for a little over $20. I ordered the half rack ribs with two sides.  I also ordered the beef brisket. The ribs were meaty tender and had good smoky flavor. I typically don't like my ribs swimming in BBQ sauce and was kind of disappointed to see sauce slathered all over the ribs but It worked. I was pleasantly surprised at how tasty they were and the sauce was not overwhelming at all. I ordered a half rack but it seemed that there was a racks worth of ribs (they must be some huge racks)! I will definitely be trying this place again!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "91EmEo3qxkMqx56WRw9hFQ"
  },
  "b739-sO8He2PT224Zz1Fmw": {
    "date": "12/20/2010",
    "text": "OK, I am a Certified BBQ Judge, and was very disappoint with my visit Sunday night.    Cold food, ribs had no meat on them, even my 6 year old said 'wow they don't have a good cook here daddy'  Out of forks, out of salad?    Waited 40 min for cold food?  Please explain....  And one of the dirtiest bathrooms I have every seen.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "fXdv0LuoGJqssMZ9R_jHMA"
  },
  "o7oOMY8riUebenXqMT3qIw": {
    "date": "9/3/2013",
    "text": "Honeybears is a cutty little BBQ spot that does have some highlights. Their pulled chicken mini sandwiches, spicy beans, mac & peach cobbler are all really good. They have a great soda selection, and small dining area to eat there. Memphis style, which doesn't step to the Missouri BBQ I was raised on, but none the less still great. They always have a Groupon  or Yelp deal too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eEZ-p7GNY0iORJs3eUnwXA"
  },
  "b-OSjSWWC-noaFvmllRVKg": {
    "date": "10/10/2015",
    "text": "Over priced food, served without a plate, in a real dump. I'm a BBQ lover but I don't love Honey Bear's.  I had the same impression of the one located in central Phoenix too but wanted to try once more before deciding I didn't like their food. Decision made.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ovLSbRyk2NX0d6tVLTh9AA"
  },
  "XxpyvdrYpXZJ2wDgnYXbvw": {
    "date": "4/10/2014",
    "text": "Stopped here after a Group-On promo. The person at the register, like many of the reviews below, was not the friendliest in the world but then I came here for BBQ and not to make a new friend.   Ordered the 1/2 rack of ribs, hot link on the side and cole slaw and potato salad. The ribs truthfully were very good, some of the best I have had in a long time. The BBQ sauce was also excellent but more of a mid-west style and tasty.   I cannot say how the hot link was because they shorted me on this! Sorry but ordering something then paying for it and finding it missing once you get home just is not right. Really gave me a bad taste in my mouth over the place...   I have one more Group-On voucher and am using it this week. This time eating inside so lets see if they short me on anything else this time...  ~~~~~~~~ UPDATE! Returned to Honey Bears on Friday and first off the person working the register was a lot nicer to work with. Also mentioned that I had been shorted a hot link and she took care of it, giving me an extra one today.   Had the ribs again and once again they were excellent. Also got a BBQ Beef sandwich to go for lunch the next day and it was very good as well.   Course when I was at the restaurant this time the soda fountain stopped working and as usual it was AFTER several of us had paid for drinks. Oh well...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dumq-7mKNkkMITdBBWqx5g"
  },
  "Cm5wY8MZWNOsOZLn60-Swg": {
    "date": "8/20/2014",
    "text": "I've heard honey bears was good and wanted to try it out. Unfortunately, this was the worst BBQ place I've ever been to. I ordered a full rack of ribs, and out of the 12 ribs, I only had 2 that were actually tender. The rest were tough and fatty. I'm pretty sure they were a few days old as well. The sides and the sauce were pretty good though.   I was very disappointed and will not be back to either location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPctSfcVVHmnjHb7Xknrxg"
  },
  "CfCJ-0iWZ0lHlQlPKyBP-g": {
    "date": "11/28/2012",
    "text": "This is some good stuff.  Ordered the slider meal - which allowed me to sample the chicken, pork and beef BBQ for roughly 10 bucks.  I asked for some hot BBQ sauce on the side (they did not have it out on the tables) and went to town on this meal.  The meal was enough to make me satisfied without feeling like I ate too much.  The BBQ sauce on the sliders was more than sufficient but I am one of those guys that likes to douse their meat in BBQ sauce (otherwise it just does not feel right) .   Honey Bears was bare bones in decor but for a BBQ place, I am not judging on the quality of their pictures on the wall but rather the tastiness of the meat.  I would come back to this place in a heartbeat!  Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "_sxHQHVCwMBu97Vo0oowFA"
  },
  "LOgCSniogT-J3S1TJ9E7-g": {
    "date": "2/15/2014",
    "text": "Manager (Owner?) is very chill... Some people might not be used to it. It's a southern thing though! Lol... Anyways! The food is good, I always get either the pulled pork sandwich or the hot link sandwich. The BBQ is the ish!!!!!! I love it, can't get enough. I was reading some other reviews & all I can say is Love it or hate it, I happen to love it. PS: it's really not as bad as people make it seem... Give it a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Kv4xECtVzvm7Pte577KYQ"
  },
  "1Eee2e66zOsEWW30WLFJNw": {
    "date": "2/8/2012",
    "text": "Right next door to where we just moved in to and even while we were moving we could smell the pit. :) When I saw the building I already knew it had potential.   I was told this location was the oldest and had better BBQ than others so with a Groupon Now I figured \"why not\". We were not disappointed whatsoever. This coming from a person who only eats his own BBQ and my family from Mississippi!  Had the 3 meat sampler to give all a whirl. Best were the ribs. Second, the beef. Third place tie goes to the pork and chicken but the sauce was great. Actually used it on my own slow cooked pulled pork for Super Bowl Sunday.   Overall. I loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TEocfOss7uSZ5sQXRQGlXA"
  },
  "jKeMRQVE0FsfCt870o60bA": {
    "date": "10/23/2010",
    "text": "Last Friday we tempted fate and headed over to Honey Bear's BBQ restaurant in Phoenix. We equipped ourselves with full kevlar body suits complete with knee cap armor.  During lunch hours it can be hard to find a parking slot at Honey Bear's Bar-B-Q restaurant. There are probably 20 spots and most of them fill up pretty quickly. From the outside, Honey Bear's looks as if it has had it's share of violence and has survived through it all. Fortunately enough, the inside makes up for the outside, but only in part. The restaurant is clean and the food appears to be prepared in a clean environment. But the whole building and the front part sure could do with a fresh coat of paint. That whole part of Phoenix is pretty runned down anyways. Honey Bear's is probably the best kept of its neighbors. Even so, don't attempt to gamble with your life and walk from work to the restaurant, you might get stabbed or shot at or both -- you've been warned.  Many people in our office love Honey Bear's and if they had the chance would go and eat there every day. Out of the three times I've been to Honey Bear's during two of them I've gotten a BBQ sandwich and the other time I got a salad. The salad was nothing to write home about and honestly I didn't expect it to be. The place specializes in Tennessee style BBQ and not in salads. So if BBQ doesn't turn you on, then neither will Honey Bear's. The BBQ sandwiches at Honey Bear's never seem to impress me though. It just reminds me of sloppy joe and honestly I'd rather have a sandwich made with Manwich than with their BBQ chicken. Manwich is at the very least \"managable\". The meat on the sandwichs at Honey Bear's seem to be all over the place. It is uncontrollable almost. Their is no picking your sandwich up and eating it. If you try, it is just a mess. You end up having to eat your sandwich with a fork. Com'on now, is that how the people in Tennesee eat their sandwiches? With a fork? Yea, it's True what their moto says, \"You don't need no teeth to eat our meat!\", but I can guarantee you, you'll need a fork.  As for food presentation, Honey Bear's doesn't do so well. Their sandwiches come wrapped in tin foil and the first impression you get is that there was no care put into it when they made it. They just plopted the meat on and moved on to the next customer.  I have heard through various channels that Honey Bears tastes like cafateria food. Atleast I'm not the only hater.  The price for food at Honey Bear's is about $5 just for the sandwich alone. With a drink and a side order of something it will usually run you about $8. The whole menu is pretty much a-la-carte.  We will probably visit Honey Bear's agian because my co-workers have a thing for BBQ. But honestly, I think that Honey Bear's reputation is far better than their food and food presentation.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CjLW_dIn-VC-jryMGCsY1g",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Outside",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CjLW_dIn-VC-jryMGCsY1g/o.jpg"
      },
      {
        "img_id": "DoGv8P2EMMAHCWCny-f6Gw",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. The establishment",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DoGv8P2EMMAHCWCny-f6Gw/o.jpg"
      },
      {
        "img_id": "igKqRH2ToGKG5Opk3mWb4g",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Signage",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/igKqRH2ToGKG5Opk3mWb4g/o.jpg"
      }
    ],
    "user_id": "lCVK-qpnJw9G3rwJbhMOjg"
  },
  "kfBOm4Ce0RPZgBhl5LuGIQ": {
    "date": "4/23/2016",
    "text": "I have had a Yelp account for 4 years and this is my first review,  We had attended the Southwest Cajun Festival today in downtown Chandler as we love Cajun and Southern cooking. While walking down the crowded streets looking for the next place to try we spot the Honey Bears Banner, the banner reads, Honey Bears, Gumbo, Jambalaya, Boudin, Etouffee, wish I would have taken a picture. As you can imagine the lines are 30-50 people long and you get in line about 50 feet away from the stand, so we decide to give them a try.   Lines at all the places were long so we expected this and discussed what food we liked so far and what we still would like to try, as well explained to my wife what Boudin was.   So after about 15-20 mins we finally worked our way up to the counter. Once at the counter we were greeted, what would you like, I quickly said I would love a bowl of Gumbo, and we will try the Boudin as well. The attendant replied, we don't have those items! With my puzzled look I asked what do you mean? The sign above my head reads Gumbo, Boudin, etc. The attendant then points to a small sign at the opposite end of the stand and sarcastically said these are the items we have. I then replied but you cannot see that sign walking by or standing in line, you should probably fix that, and the attendant replied well maybe you should learn how to read!   Restraining myself we walked away, this was the first and last time I will ever think about eating at Honey Bears.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K1mtBCQeodZTfJcC0886IQ"
  },
  "Br6hkWViL2G608xY0orJtQ": {
    "date": "5/22/2016",
    "text": "Shared the brisket sandwich and rib combo with my fiance this evening. One side is included and then we added on another (mac n' cheese and coleslaw).  Portions are HUGE! Great bang for the buck. The ribs were juicy and sauce-y, brisket sandwich was flavorful and had awesome smokey notes to it.The coleslaw is similar to that of KFC's which in my book, is AH-MAZING. Standard back mac n' cheese, not too runny.  You'd never come here for ambience but the place is clean and there are a few TV's around.   My fiance has had lots and lots of BBQ and gave this place his stamp of approval, so we will definitely be returning!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xEUsXVpbwuM5_nR_rECk0Q"
  },
  "MYh4GiArMdBfvqOULQR7gg": {
    "date": "11/14/2015",
    "text": "The pulled pork sandwich was good, but my wife and I occasionally found fatty pieces mixed in with the lean. We also had coleslaw and mac & cheese, which was overly salty. I would get potato salad instead of mac & cheese if we return there.   For True Tennessee style, the BBQ sauce needs more of a vinegar base. Or at least, a vinegar-based sauce should be available at the counter, marked Tennessee style.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HpDnoHhoOpeW5cLzJq7BgQ"
  },
  "220_9UtAgYdK5is3eWoNUw": {
    "date": "5/9/2017",
    "text": "Literally watched the guy throw my hot links for my sandwich in the DEEP FRYER. 'Nuff said. Fool me once.....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LA9EzAPQbaOMkNpLZiRycg"
  },
  "dLL0xtDH-P-p54goh-h9FQ": {
    "date": "12/13/2016",
    "text": "Not so sure about the employees working here. When I came in the guy working the counter was sitting down doing nothing in particular even though the napkin dispenser was completely empty and a few things around the store looked like they could use some cleaning.  He was reasonably polite in taking my order, but certainly not above and beyond.  After taking a couple orders he went right back down to sitting on his stool.  If he has a doctor's note or some disability, I sincerely apologize for my review, but I strongly believe that in a restaurant 'if you got time for leaning, you got time for cleaning' and any time I see employees sitting around with obvious things to be attended to I have to worry about other practices in the kitchen.  The BBQ was pretty decent. Not the very best, but no complaints either. Beans were top Notch.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UyRvcuGn0vQmvnEghpucvA"
  },
  "Y0bKAomk7QcT_yv9Zs-6Sg": {
    "date": "10/16/2015",
    "text": "I would not recommend Not the Honey Bears I remember, counter service sucks. No more bar. If you like eating off a piece of aluminum foil this place is great, if you want a plate and utensils its $1.75 per person more. Beer was cheap and cold at 2.75 for a bud lite. Sides were nice and hot but the brisket was cold and the bun was as cheap as you can get. The corn on the Cobb was hot but old. Beans were good, as was the Mac and cheese. The brisket was not tasty at all bbq sauce was runny and tasteless over all I would not recommend coming to honey bears $30 bucks for two brisket sandwich with two sides and two beers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GWcK0U1B9s2YpRg7zS9KUw",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Generic walmart bun",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GWcK0U1B9s2YpRg7zS9KUw/o.jpg"
      },
      {
        "img_id": "aRowS2YtsBf07gZFDXEs-A",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. You decide...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aRowS2YtsBf07gZFDXEs-A/o.jpg"
      }
    ],
    "user_id": "PISdujhQvN3u6LReNyPe_w"
  },
  "Ce76TFX-CRbosUTi2FgkUg": {
    "date": "2/12/2014",
    "text": "Lunch at Honey Bears BBQ today. Arrived at 11:15 with four parties seated and three in line in front of me - good sign.   I ordered the BBQ pork, hot link, a side of slaw and a drink. He changed it to the # 1 value meal to save me money but it still came to $10.28.   Meal arrived in about 4 minutes and everything was hot but I was disappointed in most of it. Come slaw first: slaw was tangy, perfect spice and mayo level. Definitely would order again.   The pork and link came together in a HB bun. I got 2-3 ounces of pork and a three-inch link. Decent flavor but for $10, I should get more than 2-3 oz.  The link was good. It had good snap, excellent spice but just not much of it.  The meal came with a pint of BBQ sauce which was unexpected. The sauce had a slight amount of spice but was so sweet I couldn't put much on the Sammie. I suppose when you're called Honey BBQ, you make sweet sauce.   Around the corner is Hap's BBQ which I thought was better but Famous Dave's blows them both out with flavor and value.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fCWEsW3lhZk2RQ0zPrqvsw"
  },
  "Pk_F3klae2wVQK46niL4UQ": {
    "date": "3/31/2017",
    "text": "Like most people said, USE TO BE, good place. The bathroom is a mess! I got the brisket, couldn't really taste the smoke or BBQ of it, really plain.  The sauce in my opinion has gotten sweeter, use to have a kick but not no more. No salt packets! Every other packet besides salt! Lady behind the counter had to put some in a sauce cup. Use to live this place, but have second guess coming here now with so many more options. Hopefully the look at some reviews and step their game up.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uD2s4CsmyHyJQOy9m-TUdw"
  },
  "_4ZjcSJCAVWm538Yo0rx9A": {
    "date": "5/31/2017",
    "text": "really good bbq joing. Coworker and I went and got some food. The Mac and Cheese was really good. I got the sliders of pulled pork sandwiches and they were really good as well. Definitely recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8TBJiWReorjG3ReWtH3aJA"
  },
  "2J_EMU5ycPoGXQOZOaO74Q": {
    "date": "12/18/2017",
    "text": "Pulled is very tender with just the right smoke flavor.  Cowbro beans are outstanding.  The sauce has a delicious Tennessee style sweet and spicy  zip to it.  After the food was eaten, I could help but have a little more sauce by itself.  Mac and cheese is ok but better when I added some sauce.  Staff is friendly.  Good place to stop for a quick takeout.  I went back again and tried eating in and having brisket.  It was good but the pork was better.  You pay on ordering and are shown a tip prompt on the tablet before signing for a credit card.  You don't get served at your table but instead are called back to the counter to pick up your door tray.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sDLvBzVXfc26LBmAJBOQbg"
  },
  "TS3pu7-zuQYvQEkHZP0GXA": {
    "date": "9/3/2015",
    "text": "I was really not impressed with the BBQ here. I decided to go because I read others' reviews and most of them said the food was good but my experience wasn't as fortunate, I guess.   I ordered the ribs and chicken combo plate with greens and Mac and cheese for my son and I. The chicken was very dry, just slathered in sauce. I nor my son wanted to eat it. The ribs were inconsistent. Some were tasty and moist; others extremely dry and chewy. None of them were fall off the bone good. It may be because they weren't freshly made (when I went in there was NOBODY in there and while I was there about an hour only one other customer came in).   My greens needed salt and lacked the savory taste that greens should give. My mac and cheese was just...not right. I tried saving it at home but it was unsalvageable. But in their defense I am very particular about my Mac and cheese.   Also, there were no options for non-carbonated drinks; not even sweet tea! I don't appreciate that. And they were out of cornbread.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-2FX4aYflB60Zab1evigHQ"
  },
  "wZap55KBy1zjLteNkcMUzw": {
    "date": "4/9/2013",
    "text": "I really wanted to like this place since I really dig family owned businesses I guess I will start my review by saying I ordered via phone but when I called I got an automated system that was horrible and didn't route you to anyone instead it said to call another number. After placing a huge order they said it would be done in 30 minutes. I went to pick up my order an hour later and it was still not ready and ended up waiting another 30 minutes when I looked around it seemed that everyone there was waiting for food and no food was being served in a timely matter. After finally getting my food I really wasn't impressed.   Pulled Pork-Dry Brisket-Dry Sauce-Weak and needed spice Baked Beans-Very good especially with the sausage  Hot Links- Not bad but not spicy Coleslaw- Very good  Corn Bread- bland and tasted old",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "MBI9PGpox71jbi7wW9S40A"
  },
  "pKI_v5luqK8c-y4wTHf76A": {
    "date": "11/20/2017",
    "text": "I was carving BBQ today and decided to go to Honey Bears. I hadn't been to Honey Bears in years, and this location in forever. Something has changed, apart from the looks, which now look old, unkempt, and run down, the food was...no bueno! I ordered a pulled pork sandwich combo and a hot link on the side. I paid almost 14 bucks. My combo came with the sandwich, a side, and a drink. The hot link was an extra $1.99. Now, I don't mind paying 14 bucks if the food is amazing, this was not the case. My sandwich had plenty of meat but it was just blah, nothing amazing, the bun was some generic bun that was super soggy from the meat. No, if my sandwich was made when I ordered it and I ate at the restaurant there is no reason my bun should be that soggy that fast. Right? Fine, I removed most of the bottom bun and spread the remaining meat on the top bun and ate that. The mac and cheese, oh man, the mac and cheese. It was lukewarm, it was not cheesy, or creamy, or anything. I took 2 small bites and asked to switched it out either for a hot mac and cheese or something else. The girl at the counter stood there for a bit, then went and asked the Spanish speaking lady in the kitchen if the mac and cheese was turned on since \"the lady at the counter is saying it's not hot\". She came back and asked me if I wanted something else other than the mac and cheese, I chose potato salad..... UGH, I went from bad to worse. This potato salad had a lot going on and all the ingredients over powered each other. I took only one bite of that and was done. I finished my sandwich and my hot link and got out of there. I'm not saying I won't have Honey Bears again, but I will definitely not be coming to this location. I'm hoping the location in central Phoenix has been better kept - restaurant and food.  PS don't go off most of the pictures posted on this page, and if you do, please check out the dates. they are as old as 2010 - and back then, this place was better. Not sure if personnel changed, owners, cooks, or what but it is not the same.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ScFv8eq8OPJnyGv9h4BbTQ"
  },
  "8WdHMeTa1tNBFlgAjplFFQ": {
    "date": "8/31/2014",
    "text": "Went in today with my friend. I must say for a joint which specializes in bbqs, the food was below standards.  I took the half pork ribs. Not only the sauce was bad but the meat was hard and not tasty at all. My friend who took the chicken sandwich with hotlinks was equally disappointed with the food. I'm done with this place and not visiting this again.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "aq_ZxGHiri48TUXJlpRkCQ"
  },
  "7N0S2UkUJKyLGndPwgY1JQ": {
    "date": "1/30/2015",
    "text": "No.. just no.   I had been to the location about 5 years ago.. I forgot why it had been so long. I don't believe the food was bad 5 years ago.  Well.. to start the Mac and cheese was so off base. It tasted almost like instant ( although I know it wasn't ) it had that generic made for the long day taste and generic feel to it. Certainly not a home style mix.   The ribs were under seasoned. cold. And seemed to be little meat on them. The collard greens lacked flavor and they were cold. And the bun was just sad. I was dumb founded about the sauce as it was very watered down and no kick to it.  On top of which the establishment gets a c in cleanliness! I don't know what happened....",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0UU3JV2Od0sc5CyWWfcU5g"
  },
  "fiVar6K8vOBs86B7ws8bHg": {
    "date": "5/25/2015",
    "text": "The ribs are well above average but their pulled pork sandwich is out of this world!   I've had BBQ from places all over the U.S. and this little place really stands out in my mind. :)  The reason I didn't give it five stars is for the location. It's not in a nice area but the staff is friendly and you can get your food to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WfvDDt8YrTdALg8yIOfijA"
  },
  "ZVsrv47Xn6BbnnpZX3j1Sw": {
    "date": "7/4/2014",
    "text": "For a company that specializes in BBQ, their sauce is on par and very nice; however, that's the only great thing about this place. Much like others who have commented before, the ribs were tough and grizzly. They did my seem to have been slow cooked to perfection, more microwave for fast-good delivery.   Not a fan...",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "pzXQ146CxQCHRxjQcXktIA"
  },
  "WknVrQ5GHq9OU-_sutSseg": {
    "date": "10/18/2016",
    "text": "Hands down the worst BBQ I have ever had. I ordered the brisket sandwich. The meat doesn't taste smoked at all. It has a high fatty content. It was served with the sauce already on it (not a wrong practice, but better to allow the customer to put the amount of sauce they are comfortable with), and the sauce was horrible. It was like aged ketchup. Also the bun was soggie half way through my meal due to the sauce and grease content. On top of that it was over $7 just for the sandwich. Why would I go back? I won't. Don't waste your money here unless they do some serious soul searching as to why they are in business. Obviously it is not what they are good at.  Alternatives are Dickeys, Ralph's, joe's real BBQ, or famous dave's.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gwMGvr3030fto5cKwOywag"
  },
  "YkIx-k4FZ3rCeWuKHpWUfQ": {
    "date": "8/3/2012",
    "text": "I've gone to Honey Bears now twice. First time was when I was a teenager with my grandparents. Was not impressed. Since it had been st least 15 years, I figured is give out another go. Honestly, I've made better bbq at home. For the price they charge you, of rather go to Famous Daves.   Pork was dry. Ribs were fatty. Cobbler was gluey and tasted like it was Comstock pie filling.   Thank goodness we ate using a Deal Chicken offer.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "b34yOQoUDev_l6BzDBMpUQ"
  },
  "_tiKUyibzM9SJNNU5dNKXA": {
    "date": "7/21/2014",
    "text": "There's not much to say about Honey Bears BBQ...  The food is not as tasty as the smell I sense every early Saturday morning, & it lacks seasoning.  The location is a little sketchy, but is very clean inside the premises and the family staff are very polite.  Personally, the chicken is better than the ribs... But I only went there once & doubt it I will go back...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "qmZ3ASqYttJvm5c3iML48Q"
  },
  "YRF5GRP8APw7wkif5806tg": {
    "date": "9/29/2010",
    "text": "Delicious Ribs and they have Big Red soda on fountain? what's not to love?!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2tR4PAlGmwU7OIjT8--y3w"
  },
  "S39GXv5PCe48fKXqgi9R4w": {
    "date": "1/13/2010",
    "text": "Honey Bear's is a place that was at one point a celebrated BBQ establishment, but it is now only a shell of its supposed former greatness.  The setup and quality are fast food, but the prices are a notch higher.  The meat tastes alright, but nothing special.  The restaurant itself is a bit of a dive (although the Central Ave. location is nicer, it is considerably more crowded).  The portions are meager.  All of this leaves you with the feeling that it would be a good $5 lunch.  Unfortunately, it's not just $5.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwXw5HW3Y6Gr37V0KxX8sA"
  },
  "fJnbW1b6wQ1y3WrbnJBEfw": {
    "date": "9/14/2010",
    "text": "Had the 1/2 rack pork rib dinner.  Ribs, cowbrow beans and coleslaw.  All good to very good but not make a special trip for.    Tables, settings were minimalist but ok.  Rest room was probably less than miniamilst.  Will try other places if I am in the mood for barbecue.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zGdpvtPJUD5dAhaXzZa94Q"
  },
  "DPR9ftibFEoCIlB3ksFkew": {
    "date": "1/20/2011",
    "text": "Amazing pulled pork sandwiches, great bbq sauce, best pork n beans ive ever had",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1fBY654Mp3FI8KDulIiJzw"
  },
  "kjb-wRmNL2H3uNVn5PfASw": {
    "date": "11/6/2008",
    "text": "I this is your idea of good BBQ, you obviously don't know anything about what good BBQ should taste like.  I saw one review that suggested you eat the meat with the sides - looking for flavor I guess.  Lame attempt at sauce, ho hum buns.  I think the only reason they've lasted is that this town doesn't seem to have much competition in the BBQ department.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2Vt9kXftjitRV4uX3f3CGQ"
  },
  "_NmPWiHHBQIzddFmiAMvBg": {
    "date": "9/2/2008",
    "text": "I like the sauce here a little better than BBQ Company.  This is a little more vinegar while BBQ Co is sweeter.  The pulled pork sandwich at lunch is one of my favorites.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DLYdsGbx6fJfoIxXS0nQsg"
  },
  "rAZrU7rrZLzlMx3BfaPOwA": {
    "date": "5/14/2009",
    "text": "I could see driving over from downtown for this.  Great, simple, tasty.  BBQ was best I've had outside of Oklahoma, and the cole slaw was very fresh (I'd go a bit less sweet, but it was nice and crunchy).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "U-plBHDqCBCGDJKFukCvNg"
  },
  "WcxL6XZkpyfYDtB3rOrZiA": {
    "date": "1/20/2012",
    "text": "I have been coming to this place and Haps for my bbq fixes for years. Since Haps moved to a building near Honeybears the flavors of their food have seem to drop to bland but Honeybears pork drowned with bbq sauce is really hard to beat. I have been to both the Central location and this one and even though people may say it is a dive they are fast and the food is always great. Their slider special is a good way to test the waters but make sure you drown it in sauce for extra goodness. The central location does fries and the Van Buren one does chips so a win for Central on that one.  Both have the tasty \"Cowbro\" beans which are quite good. The Central local also has vanilla pudding that is quite good but both may have and I never noticed. The downside to the central location is that they do get alot of business from all the offices near by so 12 noon there is a line. Last time I went I seen they were now selling their BBQ sauce so I grabbed a bottle of that also but have yet to try it.  I would recommend this place if you plan on a tasty quick meal with quick service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vgFDDMup4OZGZNuSqEw0mA"
  },
  "SqjoTrW0dCxnNnsqchxDMA": {
    "date": "1/26/2009",
    "text": "I giggled and pulled over when I saw the advertisement. The slogan alone made the meal for me. The coleslaw and the pull pork BBQ sandwich was really good. My buddies ordered the ribs, they were huge and de-lish, from what they told me, its all good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "10uOF9Wz9Pv9d_R5c2rMTg"
  },
  "3rXhEPf_CDFkc4AJJuhHDA": {
    "date": "3/10/2011",
    "text": "I ordered the Chicken BBQ sandwich...was not that great. The chicken meat lacked any flavor. And the bread of the sandwich was extremely mushy. Plus, no sides and no kid options!! Just FYI...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_4Czae8N792UrKfyzYx_Zw"
  },
  "p1UEb4q7YJSj0oapWcNhPA": {
    "date": "1/15/2012",
    "text": "Food here was great, I had a bad experience in tempe but this place was great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dn4C-4KtYwW-prY14RTx-w"
  },
  "NIszoi-MP5yjbUCgAopa1w": {
    "date": "8/3/2011",
    "text": "I feel bad giving them 2 stars, the first time I went I LOVED the bbq, so good, so tender.  Second time I went, same thing, BUT I got food poisoning!  A busy, well known place like that shouldn't have that happen.  I'm never eating there again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8IDLUb6auOC4JQ72ZsEShg"
  },
  "W-XRs8dEDsT5YUslncoKeA": {
    "date": "4/24/2008",
    "text": "You want a big wad of sticky drippy animal on a bun? Well, you're in the right place. it sounds like the other location has more selection of sides. Why not here? This place is lacking. Bring me the home fries!! The sauce was too watery for me, but flavorful. I just wish it stuck to the meat better and didn't get soaked up by the bun. The potato salad was yummy (rather peppery), but I've had better.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "l5Fba-9TGiK9q0KqlaNUIQ"
  },
  "YVH3cUMj4IvDf0_bAoIO1g": {
    "date": "1/31/2009",
    "text": "Above average BBQ at a resonable price.  Large portions.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ht32V9f8QjmudKOFm_U51A"
  },
  "nk4Fuau5wvGfpCvrM1Ukpw": {
    "date": "9/21/2018",
    "text": "Awful service.  Tried to place an order for pickup.  On hold while the lady was yelling at her kids.  I ordered potato salad but I was told it would take at least an hour before it would be ready.  I was told I could not pay with a credit card unless I called their catering department.  Could not get through to catering so I left a message.  Finally got a call back 35 minutes latter (she put me on hold because she needed to help a customer - I guess she did not consider me a customer!) and was told I should place my order a day in advance if I want to pay with a credit card,  In the end she hung up on me!  I felt so disrespected!  I will take my business else where and purchase from someone who wants my business!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MeIkBhSfpLQRCqmOc2agvw"
  },
  "ngzM33mRb4PFWPRRmzSY9Q": {
    "date": "3/24/2018",
    "text": "This place was recommended by the valet at another restaurant. It's just a hole in the wall that we'd have never chosen on our own but we were pleased with the quality and the reasonable price. We had brisket and pork. Both we tender and had good flavor without the bbq sauce. We had potato salad and Mac & Cheese for sides. The sides were larger than expected and were \"homemade\" quality. The Mac & cheese was super creamy and cheesy. The potato salad was a bit mustardy for my taste but was still good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tU2MvSgChkucrPT_s3Mwbg"
  },
  "l7IvCHc5zcVsqs9t3Q1Mug": {
    "date": "7/7/2017",
    "text": "I believe this place is going on nearly 40 years. I met the owner. Most of the good places where I'm from (SC) are run my old black guys. This guy has the same roots.  Based on my two experiences Honey Bears gets one thing right... pulled pork BBQ... good thing that's all that matters to me. Could be considered best BBQ sandwich is greater PHX area. Grab one to or fro the airport. There is NOTHING else from this location for a couple miles.  *Save your money and avoid the sides. Hell, if you need more food, just get two sammies. Done.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xerg3Qty0-zMvpF6-9ZMGw"
  },
  "8tpKPSQTJeNxIv86sbkqgw": {
    "date": "5/5/2017",
    "text": "I'm an Arizona native, but I lived in Memphis for a few years and developed a taste for Tennessee-style pulled pork. Honey Bear's is as close as you'll get, plus their sauce has a little southwestern kick due to all the chili flakes. Make sure to get the sweet potato pie!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PcX6C4D5ZophZFTklrIpCw"
  },
  "bfdMikKrM48HmOb_E8l9mQ": {
    "date": "5/29/2017",
    "text": "Love this place. Their meats are cooked to perfection, the sauces are fantastic, and their sides are soooooo yummy. We come here a lot to get food to go, and have never been disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YzGQCUxpiN607wYX06x3BA"
  },
  "BZTMAL6BeVZZi9lz-BBeWg": {
    "date": "3/9/2018",
    "text": "I have eaten at Honey Bear's since they opened.  Back then the owner's where the cooks and family members worked the counter.  The rib tips on Fridays and the cocktails had the place packed.  Fast forward to today and a lot has changed in the kitchen and the counter.  I narrowed my selection to the pulled chicken, the pulled beef, and plenty of sauce.  I like the sliders on the menu but if you don't eat pork...check your order before you leave.  Ditch the bread and drench the meat with sauce and magic can happen!  I can't recommend any of the sides...but that's according to my taste...you may love them.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXEAema19eupNq-r_N09zw"
  },
  "8RTTTPcaLfd59Y0T70DkVA": {
    "date": "3/6/2018",
    "text": "High Fructose Corn Syrup as the main ingredient in the sauce is my main issue. Why not use real sugar? First time customer and the Spanish speaking employees are difficult to understand and They would say yes to every question that I had about the menu. I guess the customer is always right! The Pound of Brisket was good. The pulled pork cup was good and greasy. The manager is cool and friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GNCTCJ80ITqDOKRzyeGaeA"
  },
  "qiOp64HRmu9_gc-abYS52g": {
    "date": "1/13/2018",
    "text": "Tried beef brisket sandwich. Came on a cold bun, with sauce. Enjoyed the beef, and sauce definitely a winner. Meat was chewy though, and could have been warmed up more. Mac and cheese average, needed salt.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZBzk54ElTdGh-C4reDnqcg"
  },
  "R49QWypvHiwMYqhhkffkuA": {
    "date": "1/28/2018",
    "text": "This place isn't what it used to be.  I have fond memories of coming here as a kid and ordering fall-off-the-bone baby back ribs and delicious sides.  Coming here today, I was kinda disappointed. Not only to learn that they no longer serve babyback ribs and only serve spareribs now, but to learn that a good portion of them are overcooked or less tender. The corn has gotten bland, but the Mac and cheese was good. The only reason my review is 2 stars as opposed to 1 is the Mac and cheese.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "27SeypIYE6p0WApHInQarA"
  },
  "yNyXNTYZXkprK2CvbDsMVQ": {
    "date": "7/20/2017",
    "text": "My favorite BBQ place in Phoenix.  Really like the sauce on the shredded Chicken sandwiches, but also like their Peach Cobbler.  Don't live close anymore, but used to go every couple of months to this and the other one that used to be in Tempe/Chandler area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P3xDP91zjO6VSC-Tm7RLgw"
  },
  "x8MX3-bdZzlLAoIiN2VfXg": {
    "date": "1/24/2018",
    "text": "I got the brisket sandwich combo with Mac and cheese.   The meat was awesome.   The sauce is a vinegar based aside which was okay but not my favorite.  I didn't care for the Mac and cheese.   My biggest complaint was the dining experience was ruined by the flies.   They are all over.   Landing on my table and my food and eventually my face too.   I would go back but but would probably get take out and a different side.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TnTXc8VaDpiauBUP9rRMJQ"
  },
  "vU1tmv51wheKQ8s-SyxYQA": {
    "date": "7/2/2018",
    "text": "I just tried this place for my first time... HOLY COW I don't want this meal to end! I couldn't be happier with the beef brisket sandwich, Cowbro beans and Mac and cheese. Those cowbro beans tho..... everything exceeded my expectations! Although I got take out, the restaurant was very clean and nicely decorated. The man that helped me was very friendly!! My meal was ready in 10 minutes. Contemplating going back for seconds",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TcgOtfkhi6NWVR4lt__FDw"
  },
  "sGgoMzLhVt770BJtysHHnA": {
    "date": "4/26/2018",
    "text": "I've been a Honey Bears customer for 30 years, but no more. I recently ordered nearly $200 worth of food for a party and they totally screwed up the order. That happens, right? But I called to complain, and also sent them an email, and I received no response. Beware bad customer service.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3SKlnK5O8HApVsGKl4EWvw"
  },
  "iVRUOo-eS0CszUAEoYa2Kw": {
    "date": "9/29/2015",
    "text": "I actually was pretty impressed with this place, the collared greens weren't impressive on this particular visit.  Last time, they were amazing but we went an hour before close (7pm) and they weren't cooked well, I'm sure it's usually better earlier. The rack of ribs was good as usual, friendly staff, Mac and cheese was alright..   I like the old fashioned style of Honey Bears, reminds me of the scenes in House of Cards where Frank goes to Freddies for ribs...that's why I like this place. I feel that the sweet potato pie should have been heated up but it tasted fine.  They serve beer. They serve cornbread and peach cobbler. Collared greens and cowbro's baked beans.   Major knock on what they should but don't offer: Sweet Tea... this is a southern place that has no sweet tea...so that was my only let down.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cKK3Hhhjq_JqCy4sJpK5Mw",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Rack a ribs, collared greens, and Mac and cheese.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cKK3Hhhjq_JqCy4sJpK5Mw/o.jpg"
      }
    ],
    "user_id": "wh4wZBdSDUNvgBCpLA6q1A"
  },
  "tANgDCucXXaKIxU_M6SmLA": {
    "date": "4/17/2016",
    "text": "We ordered take-out from HB's. It's  been awhile since we've had their food, because it has not been that great In the past few years. So we foolishly decided to try it again.  We brought the food home and the first thing we pulled out of the bag was a foil - wrapped 1/2 ear of corn, ALREADY EATEN. Very GROSS!!! Everyone one said there was no way they would eat that food!!!  We took the whole order back to HB. No apology, no nothin'.   I am advising all to proceed with caution!  BTW, went to post this and they will not post unless I give a star rating. So giving a 1, but I would  like to make it a -10.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "0kT7-uRMe4RMdPZLUyfCUA"
  },
  "A_TXOWlsPyVysrYjBDhLgA": {
    "date": "4/5/2018",
    "text": "Wanted a great BBQ place but this is not the one. I spent $10 on dry pork sandwich, chips, and a soda. The pork was very dry and very little sauce in it. I would not go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ATMBiwQzH38vukrgxrnPzQ"
  },
  "VaAIFYNkY1WwXkslW4zmUg": {
    "date": "6/11/2017",
    "text": "I ordered a beef brisket sandwich with a side of Cowbro beans and collard greens for a total of $11.92(not including a drink) I had my own bottled water.  The first thing I found very tacky about this place is that I paid with my bank debit/credit card and the cashier system this place used is a swipe on a Airpad. Once swiped it's then turned around to me with an option to tip %15 %20 or %25 or decline. I just find this totally tacky that there's an option to tip the cashier or whoever it goes to for merely ringing up my order. (Just doesn't make sense to me but,seems to be a trend of putting customers on the spot to tip or donate) I find that irritating.  That was not the reason for my review of 2 stars. In reality I would give this place 2.5 stars. The food or at least what I ordered was well below average. I'll start with the sides. I know collard greens are probably not the most popular amongst folks but, I actually enjoy em and can tell good quality of greens. These were bland and seems undercooked. What made it worst is there is no hot sauce available for them. The cowbro beans were also bland. If you're lucky enough to have a few pieces of sausage in them it makes up for the blandness. The brisket was my main reason for the rating I give. It was dry and has no flavor on its own, I think that's why you must drown it with the house bar b q sauce. The bun it came with was cold and quick to become soggy or crumble. Overall this would not be a place to bring family or a friend that's craving BBQ",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2B-q2SnoN5Fu-XRsD2T16g"
  },
  "GYb41v1iP2h9yS09VP8ipw": {
    "date": "4/30/2017",
    "text": "Omg I'm at junk in the truck festival and just the smell drew me in!! And it tastes better then it smell! Definitely going back to the van Buern location!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m0lLFwOitvyDASkWxEqWnw"
  },
  "6xmpr8N3l0z47ckEd1RvUA": {
    "date": "3/13/2016",
    "text": "I don't understand the lower reviews.   Admittedly, you are not here for the atmosphere. But the restaurant was clean and everyone was very nice.   My friend and I had the pulled pork sandwich and it was AMAZING!  Very smoky, not too sweet.  The sauce (which you can add yourself) was vinegary and smoky and just a little sweet.  Our other friend had the BBQ chicken breast.  Sides were also good. We had baked beans, mac and cheese, coleslaw.  I wish the menu was larger--rib tips and more dinner plate type options would've been good. But the food was excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NwFkXVuLdtkWF1cmGbvScw"
  },
  "sQqJ3TOzPF_W35OMMGJ48g": {
    "date": "7/8/2016",
    "text": "OMGosh!!! Just had my fix of my favorite BBQ! Could just about drink that Tennessee/Carolina sauce. Lived next to this place back in '93 and realized again that I need to get there way more often! Mark even recognized me and hooked me up with some of the best Mac & Chez ever...as I was already getting the slaw and bro beans! Their sides are almost worth a trip there themselves. Next time a slice of that sweet potato pie is coming with me too  Thanks for all the years Mark...and to many more!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_BxgyFP-v-zpRcFhWGYFaw"
  },
  "n5L73-mkZpNqsggXrXLhug": {
    "date": "2/19/2016",
    "text": "1st time visit and the food was great! My husband and I really enjoyed it. I had pulled pork and Mac and cheese. He had beef brisket and Mac and cheese. The flavor was awesome and the sause was sweet and spicy. I would go there again and recommend it to others.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "CGtEmM2XH6XZzSvmN-rzug"
  },
  "QVlN2XbzhxI2umRQJLGIfw": {
    "date": "12/13/2014",
    "text": "As stated by other reviewers, Honey Bear's isn't what it used to be.   It's still tasty, but they seem to be giving you a whole lot less for a lot more money.  Add to that the screaming children they have running around lately.   The customer service is still very good.  There are better BBQ places than this.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5UWr1-rG5Ib086MgwionhA"
  },
  "flZKHOOWcDb9o45tp1sSRQ": {
    "date": "6/18/2014",
    "text": "Had bbq pork sandwich.  It was good, but over priced. No lids for your soda? Wth? Wish they served fries instead of potato chips.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XK9riyKgdf_v7uPc4fbrDQ"
  },
  "gpbo-sgRVyFyBU1SV_qN9Q": {
    "date": "10/11/2016",
    "text": "Pick this place out of a hat while seeing a friend near by. Some of the best BBQ I have ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g9yLt82uZws-qM2ZSw_l6Q"
  },
  "_d2dP7Mg7w1jSfKicS6KoA": {
    "date": "5/3/2012",
    "text": "So good. One of the best tasting BBQ I have had in a long, long time.   Must try!!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "cLw5dhbG8ts7r_0WCaYvxg"
  },
  "OpDEgrZxpuGHzpxP3lfxXA": {
    "date": "7/6/2013",
    "text": "Wow, simply unbelievably good barbecue this far west!  The beans are the best this Texan ever tasted, meat and sauce both outstanding!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qIrtfzP2d5N-EjPmbdFoSQ"
  },
  "W2MZy1GSB5r0ge882KZNHg": {
    "date": "8/27/2012",
    "text": "I'm a long time fan of this Tennessee style 'que. In all fairness I'm fiercely loyal to the pulled pork and almost never have anything different. On the rare occasion I tried something else I enjoyed it, but I usually just do the half pound of meat w/ beans & slaw. It's honestly one of my favorite meals of all time. The Van Buren location is preferable.   This place is the real deal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aj44b23oK_4n8SwxvZR8Kg"
  },
  "XlD7T86pcba3K2Y0Gwnhpw": {
    "date": "11/3/2014",
    "text": "I think it has started to go downhill a bit...then again phoenix is gaining more decent bbq places so I think that is part of why I just can't go any more.  Their is no smoke and not much flavor and the quality of the meat is not great. They get two stars due to a pretty decent bbq sauce and affordable pricing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8zz2CuBQDhKaT7ax9hP1pw"
  },
  "gi7PsZOKlKD_V2MJoy3bfA": {
    "date": "1/23/2014",
    "text": "Not real impressed.  Sauce wasn't all that and sliced beef was tough. Trash can was full, restaurant wasn't real clean. Two small sandwiches and two sides came to $20.   Won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "tCmpQ14WG0j4c2tsen168A"
  },
  "qrMPmK8ku3ItoBSQRLVVYg": {
    "date": "2/11/2012",
    "text": "Looking for good BBQ?  Got a hankering for some tasty meats, slow roasted to perfection? Hop a flight to Austin Texas and head straight for 'The County Line' BBQ.   If you can't do that, the next best thing in Phoenix is Honey Bears. A long time establishment dedicated to satiating the appetites of carnivores everywhere.  Their motto is quaint and to the point;  \"You don't need no teeths to eat our meat.\" Isn't that just precious? And so it goes, their motto has managed to attract the dentifrice-challenged from all over the valley, their smiles resembling jack-'o-lanterns.  Well I have all my 'teeths', which is precisely why I come here.  Being older, looks beginning to wane, I still have a nice set of choppers which excludes me from the dentifrice challenged category. It also makes me revered by other diners my age as a demi-god of sorts.    So whenever i'm feeling down, a little blue over how I never get the once-over from hot babes anymore, I come here,  where I'm worshipped by  toothless fucks from all over Phoenix, and all for little more than a lifetime of dental care! Go figure.  Their brisket. pork shoulder and chicken, all tasty, better than most BBQ joints in Phoenix.  Beans and coleslaw, nothing spectacular.  Service, friendly. Truly a good BBQ joint. Sauce is decent.  It's like eating at a homeless shelter, except the bbq is really good, and some half-assed preacher isn't in the dining area requiring you say a bunch of prayers in order to get a free meal.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "9sldtsoM9MFEyPEss0L9kA"
  },
  "FcIso7vKU3LjWPGz2YtbWw": {
    "date": "6/15/2012",
    "text": "I would give Honey Bears 3.5 stars if that were possible but it just wasn't quite 4 stars.  The ribs were delicious and my friends pork sandwich was better than expected and not over-sauced, which is usually the problem with bbq joints. But the service was slow and even though it wasn't very busy the staff just didn't seem like they were in a hurry to get us our food but were to busy talking to each other. We will give them another try though.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ke0kAr8rQXLhpR0u5ma4JA"
  },
  "IJr7WigZwUk6jzUI-okgew": {
    "date": "4/8/2016",
    "text": "My favorite BBQ joint in phoenix.  I get the beef brisket every time.  FANTASTIC",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "57zIQLLtQFre7USW2E_dFg"
  },
  "e5qbwbXEAk9dFs23fvOmWg": {
    "date": "4/20/2012",
    "text": "So I will be the first to admit that I am not usually a big barbeque fan.  A few years ago I was in Kansas City and even then I was \"Meh\" about the whole thing.  Maybe my palate has expanded since then- who knows.  Either way, when I had a hankering for barbeque today it was a little unexpected to say the least.    To be fair, I had been meaning to try Honey Bears since I moved close to it.  I had heard how amazing it was, but just had never really been in the mood.  Today I gave in and went and I am so glad I did!  The service was nice and super fast.  I was really surprised by how quickly my food came out.  I ordered the 3 sliders, figuring I would have an assortment of tastes in case I picked the wrong thing.  All three were really good, but the pork slider was absolutely my favorite.  I don't normally like barbeque sauce, because it usually seems too sweet to me.  It seemed to me like there might be a little bit of a kick thrown in that kept it from being overly sweet.  The sauce paired with the tender juiciness of the pork was completely delectable.  Now I know what I will get when I get a barbeque craving (and this time it won't be a surprise!)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kk2RXjoIsHdQO9x5A2Cxbw"
  },
  "LzCwJ-ecJoawxaM1p2iTLQ": {
    "date": "1/22/2014",
    "text": "Got the pulled pork sandwich. The pork was good and so was the BBQ sauce. The bread was sub par. Macaroni was slightly undercooked and the cheese was a bit runny. The size of the pork sandwich was nice for the price. Next time, I'll just get meat by the lb.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z5CU4D2ucrhrTTtVQmpUjg"
  },
  "3y7YkuSmUuPgQejxUPG1Eg": {
    "date": "1/30/2012",
    "text": "Went here Saturday after a long absence and was reminded why there has been such a long absence.  The food was mediocre and the facility is pretty run down.  I had the BBQ Pork, coleslaw and peach cobbler while my wife had the BBQ Pork and potato salad. We both thought the BBQ pork was a 3 or 4 on a scale of 1 to 10 and the coleslaw and potato salad were no better.  I was so looking forward to the peach cobbler but even it wasn't very good.   If you're in the area and want good BBQ go two minutes away to Hap's BBQ on Washington and 48th.  Of course Joe's BBQ in Gilbert is great too and even Famous Dave's kicks this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3RZfEmKEYUuGrWyemcXTKQ"
  },
  "pani96g0GW98htg8zSNB9Q": {
    "date": "6/4/2014",
    "text": "Great BBQ.  The coleslaw was fantastic, and the pulled pork was quite tasty.  The sauce was also super good.   I would have gave 5 starts, but I did deduct one as the people who talk about the nasty bathroom here are totally right.  Bring your Purell if you wanna use the bathroom first.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aa6b0eyzz-63meLsAJb9Kg"
  },
  "Di8-9S2fQer7aoVjSEeOuQ": {
    "date": "2/19/2016",
    "text": "Good bbq and fast friendly service! This place had been around for ages and is easy to see why. Keep it up!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G1qXkV1K9oEgyFhQZeF-iw"
  },
  "zG4dBSRHxSBUzN2FyxyP2g": {
    "date": "11/16/2011",
    "text": "This place should not be in business! I thought this place looks like a dive, but the food COULD be really good.  The food was terrible.  I ordered 1 lb. each meat for take out.  The pulled pork, beef and chicken was rather dry and chewy.  The ribs were cold, dry, and very chewy.  I think the food has been stored too long and just reheated in the microwave.  Also, I asked if I could just order the ribs as meats by the pound for take out and no sides.  He said yes and then charged me the full dinner price and gave it to me without sides.  The sauce was this orange brown watery substance that I would not call BBQ sauce.  The final touch, is that their attitude and customer service is really BAD!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RoqSS5bpjYUIqZC0KWqQIw"
  },
  "cNf3GyyKjye1H8KqY9Xocw": {
    "date": "1/9/2015",
    "text": "This is always been my favorite barbecue place in town, there pulled pork is really delicious.  There's always plenty of seating and nearby is the post office if you want to drop off your mail.  their side dishes always make me feel like I'm at home getting a homemade meal love their peach cobbler dessert. This place has a open container for sauce so you can get as much as extra bbq sauce as you like.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TPAajv-80DK-uXvWp0AOkA"
  },
  "9SPLPGf28l19o2Ht_rraNQ": {
    "date": "8/27/2012",
    "text": "I've only been the their location on Central Ave.  When I went to order my usual I was informed that this location doesn't have french fries.  Ok bummer... I'll get along with it.  We went later in the evening and the place was really dead.  I'm sure at lunchtime its much busier.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LKfsu6hRdMhosIBs7CJXTw"
  },
  "R7O7WwlBnplc5jCb9RLfCw": {
    "date": "6/17/2018",
    "text": "We just went to Honey Bears it was after 11 and the sign said open at 11. We went in and the cook told us they were behind to give them another 20 mins or so. Not come in would you like a drink while you wait but nothing. Were we suppose to wait in our car til they opened so we left  as we were pulling out I took this picture. Boy if this isn't True just ask their cook!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VwWRHY0ibnae08ZnUFiytQ",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VwWRHY0ibnae08ZnUFiytQ/o.jpg"
      }
    ],
    "user_id": "l3CpKdLlrpjsTh24zZNjDA"
  },
  "yeALCntOP3v_LNH_-wwTyg": {
    "date": "6/7/2018",
    "text": "This place is an awesome bbq place.  The sauces are great and the ribs are delicious.  All the side dishes are a winner.  This is always a must go to place every time I'm in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qP1kwI6jqUQzRf6k9YtyHg"
  },
  "e5eBODfcC72qLmVo68231w": {
    "date": "6/26/2018",
    "text": "Please update your hours. Went in today and the hours said 10am - 8pm. Got there at 6:45 pm and no one was there. Miss this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wp06StV1CbcyYgIDlbWjgg"
  },
  "izRDzF7IKAUs3hHlXIFuEQ": {
    "date": "7/10/2018",
    "text": "Place is ghetto and dirty. my combo comes with a drink and the cashier gives s red party cup as if I am going to a party or something then acts like it ok and does not even offer a discount.  it's a short middle aged woman with glasses. she is dumber then dirt offers no Information and talks if she has barely finished middle school.   The only reason. I even tried this place cause it's close to we're i live. I am.not a hater but people work hard for there money and I take great offense to being cheated out of money and a respectable amount of food that I purchased.   I sit and look at the two men that are owner and they laugh as they cheat people out of there money.  I petitioning for they place to be closed down if they are no changes being made and have called the health department for they food practices and unsanitary.   bottom line this place is garbage the owners are some cheap skate.crooks the workers there are garbarge.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8tXk8BzF-cVBVv0M5XGHeQ"
  },
  "U0fW24cSHySv3b-EvLwBrw": {
    "date": "6/8/2015",
    "text": "Tennessee BBQ done right, complete with a smoky and spicy bbq sauce. As much sauce as you want! I've been a loyal Honey Bears fan over the years, every time I'm in Phoenix, I'll end up here!  Get the pulled pork sandwich with beans and lots of sauce. Get the mac and cheese too. Put sauce on it. Use the yelp coupon, get your grub on.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YkEiqjr2FNup57Ip-CXzwQ",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Pictures don&amp;#39;t do it justice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YkEiqjr2FNup57Ip-CXzwQ/o.jpg"
      }
    ],
    "user_id": "ZxLwoAuBX-OJ8uMxTG4mcw"
  },
  "Y5YpwsLTLHpIrLpLvl_ZQQ": {
    "date": "3/11/2017",
    "text": "It's ok, the meat is bland by itself. With the sauce it taste much better. I tried the pulled chicken and brisket sandwich. There meat by itself is no match for Rudy's.  Would I be willing to go back? Sure, since it's close by.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mAuNxHwcJmIV8YFdOYNfCA",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Brisket sandwich without BBQ sauce. By itself it is plain nothing special.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mAuNxHwcJmIV8YFdOYNfCA/o.jpg"
      }
    ],
    "user_id": "1nTCrQsp5I-Qev6d5Mwt8Q"
  },
  "EifwFxtjSZ9SeDO0o2yxjg": {
    "date": "4/15/2018",
    "text": "30 minutes after ordering after ordering A chicken sandwich through Grubhub, I showed up to find that my order hadn't even been started. I had to wait around another 10 minutes as the staff suspiciously regarded me as a hassle before I had a bag unceremoniously passed off to me. The bone and tendon in the meat must have been mixed into the sandwich so there was some semblance of texture since the chicken tasted as if it had been steam cooked in a dishwasher. Their ketchup and vinegar \"BBQ sauce\" added a particularly vile aspect to this meal. This wasn't my first experience here, but it will be my last.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "19rPmV6xRm6EtEDoVYIKfA"
  },
  "ziCAeMvf9XXOgAlF9sxw_Q": {
    "date": "6/17/2018",
    "text": "They served me cold for and for the price it was NO good I would never go there ever again what a waste of money",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bf-aOSPL7LJSr0T14K_dJw"
  },
  "aiRDM6PgrCj0dV4oyXjT4w": {
    "date": "12/14/2018",
    "text": "Placed order 2 hours ago and now they tell me they are out of pork. Not the Honey Bears I once knew.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QJo4GHfmPGKjYQ0KzKc4mg"
  },
  "DjaoyLmyp7ksxrboZYLJqQ": {
    "date": "12/8/2018",
    "text": "We came in on a Saturday and were standing around waiting to be served for an awkward amount of time. Then when we finally were ready to order they didn't have anything we wanted. They just said \"we don't have that\". A BBQ place without brisket on a Saturday night? The food itself wasn't great either. Choose a different BBQ spot.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lo1G2xbOgNRIy1ZlQgaYEQ"
  },
  "-Y9aidnHL18oEUu4jJQcxw": {
    "date": "11/26/2016",
    "text": "I heard through the grapevine (and Yelp) that Honey Bear's BBQ was a great place to go for authentic BBQ in the area, so I took some friends from Italy to try their first BBQ and we were not disappointed. The amount of meat on the ribs was the most I've ever seen, so they clearly have a great butcher connection. The sauce was not too heavy nor sweet nor spicy, the coleslaw was perfect and the corn was extremely soft. My rib meat was not falling off the bone, but it was tender.  We'll definitely be back!  There's plenty of room for wheelchair/powerchairs, though the gravely parking lot is a bit awkward.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c8o3UmTcwn9WyZEtXZASzQ",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Half ribs, coleslaw and corn sides",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/c8o3UmTcwn9WyZEtXZASzQ/o.jpg"
      }
    ],
    "user_id": "u9N5_-N4oRz-UhwCFNbp-Q"
  },
  "ExBt9e6CnJQgWBZT0v_E7A": {
    "date": "6/9/2017",
    "text": "I don't know what I just ate... but it sure as hell wasn't Tennessee BBQ.  Let me start this off by saying: I moved to Phoenix from North Carolina, and I was born in Louisiana - so my bar for BBQ, Southern, and soul food is admittedly very high.  So far 9/10 attempts to find good Southern food here have failed... and this was one of those failures.  It's not my aim to be mean, and I know this is a family business - but dammit, I get offended when I eat stuff like this parading under the guise of Southern food. I think it's misleading to people who've never had the chance to taste the real stuff.  I'd say: don't eat here... but it's a local family business and I'm not a jerk. Honestly - they just need to hire a pit master from Tennessee or North Carolina who knows wtf is up and let them do their thing. It's never too late to reassess and improve.  To be more specific: Cons  Brisket on my sandwich was a wet slop, almost like a pot roast and flavor was off. Sauce was weird and didn't blend well with the meat. Potato salad was in a word - bizarre! Not sure what I was tasting in there - but there was too much of it and it overpowered everything. Greens were bland as hell, and a little rubbery. Also... put out some hot sauce! What kind of BBQ joint doesn't have at least 2-3 different types of hot sauce! And salt! The woman working the counter... wow. Really odd demeanor, like she's half asleep. Not very friendly and I watched her clean the same table for 15 minutes. Didn't bring our food out... just nodded at the counter and said \"yours is over there\". When we asked for hot sauce, she just seemed confused... which in turn was confusing... because... BBQ?!  Pros Mac n cheese was good!  They have RC cola and Big Red on tap! Classic.  Cute place  Friendly owner",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TX1pBvUkKMAbi34X6tjtJA"
  },
  "Bhm-AmIan5iQsmJ7nW6fuQ": {
    "date": "3/14/2017",
    "text": "The establishment is dirty and run down. Paint peeling, dirty floors, dirty window sills and windows and broken unsanitary bathroom. Makes me question the cleanliness back in the kitchen and their safety with food prep. The \"meal\", which they refer to as a \"plate\" was expensive and didn't even come with a beverage. They are charging an outrageous $2.89 for a fountain drink. The pulled pork sandwich was good but not great and certainly not worth (in my opinion) the price they are charging.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sGgVxSqevtwjPo50ozWOiQ",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. I&amp;#39;ve had better",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sGgVxSqevtwjPo50ozWOiQ/o.jpg"
      }
    ],
    "user_id": "WZVmrnhewnkLcS4FlTkWsA"
  },
  "HGa08LvzjLavJoYlczqYjQ": {
    "date": "5/7/2018",
    "text": "The chicken barbeque sandwich is tasty. Their side dishes and lemonade is good and the service is fast. The place is on the plain side but they serve you clean tables and away you go. Will come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s89A-TdcJUB7u-0FZl7_Ew"
  },
  "7hZdoT5NQq1Ublz-kVI3CA": {
    "date": "10/6/2016",
    "text": "It's a solid choice for good BBQ.  I had lunch here and brought home the chicken and rib platter for dinner. The staff is a little generic, but the point here is obviously all about the food.  It doesn't disappoint but the portion size is a little light for the cost, especially since they surely don't pay very much for rent.  I stop by whenever I'm in this side of town and it is definitely recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4-oiiQ1ZN7TulHjqVZ1exw",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4-oiiQ1ZN7TulHjqVZ1exw/o.jpg"
      },
      {
        "img_id": "fojsxcnte-oGqyrLWhRGMA",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fojsxcnte-oGqyrLWhRGMA/o.jpg"
      }
    ],
    "user_id": "YlfYMCw8bLmPaJD8m7fcSA"
  },
  "00Sf_Wv0T26EjmvNRS7ySA": {
    "date": "4/12/2018",
    "text": "Average BBQ joint. I had a pulled pork sandwich combo with coleslaw. The meat tasted good, but it lacked a Smokey flavor and almost seemed like it may have been cooked in a crock pot. Sauce was okay, not sure if it's made in house or not. I think I'll try the location on central before eating here again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WL9Mg-2bBpiIMKc0qkAv4A"
  },
  "seu1rBGIb5AgtV-n2Elm4Q": {
    "date": "3/20/2018",
    "text": "Friendly service. Terrible location. The ribs & chicken combo with 2 extra sides was enough for us two ladies to make two full meals out of. My favorite sides were the Mac and Cheese, and the potato salad. Collard greens didn't have a ton of flavor & the cobbler was more bread pudding texture. The flavor of the bbq sauce makes up fo my negative feedback, we will definitely be returning to Honey Bears BBQ.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QaH0kGdzzgfWSfi61YHcAA"
  },
  "8vtdJIbhRfWpqHah2gNZmw": {
    "date": "1/5/2016",
    "text": "How many ways can you spell DISAPPOINTED!!!!! I have had better BBQ on a HUNGRY MAN DINNER.   I had a friend in from Chicago this evening who was staying at the ALOFT by the airport. I wanted to impress him with the BBQ at HB's as he has taken me to some really great places in Chicago. This HB's was the first one I had eaten at when I first arrived in PHX. I last ate here 2 years ago when I was on Van Buren and the food was great!!!! What Happened???  We arrived at about 7:45. When we walked in both men were texting on their cell phones and did not really seem to care much about anything else. The person working the counter a tall man of ethnic origin was kind of aloof and on the rude side. I got the BBQ Chicken and my guest got the BBQ Pulled Pork. Total Cost: $19.63 which BTW was a great year. The food was out in 5 minutes so you know a lot of care was taken in the cooking and preparation. The Chicken did not taste fresh. It was soft and moist like it should be but it tasted like a reheat from 2 days past. Presentation was HORRIBLE! My friends pulled pork sandwich was served on a white hamburger bun and the sauce saturated it so much that he could not hold it to eat it. The bun should have at least been toasted.  I was extremely embarrassed as my friend threw more than half of it away.  In the not so distant past I ate at the Honey Bears on Elliot and Priest.  It is close to my home and the food was consistently good and we went every other month. I guess every chain has a BRONZE store and I guess HB's on 5012 E Van Buren St Phoenix, AZ 85008 is the B@$T@RD child of the chain.  My advice....try someplace else where they want your business and serve FRESH food.  I am Jeff and I call em as I see em!  BTW if you are handicapped they have a ramp but the parking lot is so uneven and has course asphalt, it is a major trip/fall hazard.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 8,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "FbLomv374LIMJCTPv-CbBg",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. That is the end of the leg. Mmmmm Good. I have seen better looking skin on the legs of a 90 y.o. woman",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FbLomv374LIMJCTPv-CbBg/o.jpg"
      },
      {
        "img_id": "D5RR5vinBn4SoN8rZ_87Kg",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Look at the care that was taken in the presentation of my meal. Isn&amp;#39;t it appetizing? All this food for $9.95. Is this really a 1/2 chicken?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D5RR5vinBn4SoN8rZ_87Kg/o.jpg"
      },
      {
        "img_id": "X5ILjWHTTO4MezW-H4kCXg",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Our Bill",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X5ILjWHTTO4MezW-H4kCXg/o.jpg"
      }
    ],
    "user_id": "A3wkfuNIvyJ6DCNXR8h4gQ"
  },
  "0HHtiw2AauOlDvqPDs16wA": {
    "date": "4/17/2018",
    "text": "What has happened to the sauce? It does not taste the same not only that it's put in an old apple cider container. It used to serve it in containers with their name on it. Service is definitely lacking on both stores Central and Van Buren. we have been going for years and with the exception of one time had excellent service but the last 2 times once at Central and now at Van Buren service is just above rude.   I really miss the old sauce and service with a smile.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5mW5fhAMdi7oOuuzoD6Yg"
  },
  "olHptzpAutkkLxXXPNNhjQ": {
    "date": "12/15/2015",
    "text": "Honestly I am shocked to read some of the more tepid reviews on here -- no offense, but I wonder if they ate at the same place we did?  This place was excellent.   My husband and I both think we are individual experts at BBQ.  He travels all over the country and tries the ribs everyplace he visits -- whoopee.  Meanwhile, I grew up in Memphis, attending the Memphis in May cook off every year and visiting award winning BBQ joints the other eleven months.  Whichever one of us is right about their superior knowledge of BBQ (clearly I am) we both LOVED the food here.  This is without doubt, as close as I've come since I left Tennessee.  The pulled pork is smoky and so tender it melts. The Cole slaw was on point -- and pulled pork ain't Memphis style without coleslaw right on the sandwich.  The sauce is sweet and tangy and fantastic.    The ribs were smokey and tender.  They were so good without sauce that it was a personal struggle deciding to dip or not dip each bite of rib meat.  Don't go in expecting a fancy dining room and table clothes with this five star experience.  However, if you're looking for really authentic BBQ, this place is the bomb.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "CZ4tdIXmiiMQHQ62lesnKw"
  },
  "RKeujJZWg-t90RSb9H9ZPw": {
    "date": "4/20/2011",
    "text": "Yet another great hole in the wall joint. They have awesome pulled pork sandwiches. This place is a local classic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8HyA2Pt14tLtMBY5A3RwUA"
  },
  "d9gSsBFLCcf8rIthYk4i6Q": {
    "date": "6/9/2011",
    "text": "Slogan: \"you don't need no teeth to eat our meat\"...  Actually, yeah, you really do. I gotta respect honey bears for becoming somewhat of an icon in the valley, but the pulled pork leaves a little room for improvement. My opinion is that it's cooked at too high of a temp. (note to honeybear: aim for 225 degrees - get staff in earlier if necessary)  Too high temp results in not enough time in it's early cooking stages to absorb that smoke flavor, which is also evidenced by an absence of color.   Slower cook time will also take some of the bite out of the meat.  But hey, it seems to be selling, so why change?  Maybe they should change the slogan though.  It is tasty, but all of the pork sandwich's flavor comes from the sauce, which is pretty unique - give me 100 sauces and i guarantee i can pick out honeybears.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Wmym-iPpjXaINtaXyuvGSg"
  },
  "IKpepCy8T7YFyuVkfMZ4Jg": {
    "date": "8/12/2011",
    "text": "Great sliders! Amazing BBQ sauce. I was disappointed when I was there because they were out of sweet potato tater tots, but I hope the next time I go they will be in stock! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IZQs7CfEQ8lgPCYDYwck_A"
  },
  "pktXW_XOo0j65Za_-tYkug": {
    "date": "4/27/2011",
    "text": "This is a great BBQ place, known for their sauce but their beans are fantastic (i get those over their sandwiches) and 2 for 1 beers everyday.   If your uppity maybe not the place for your but if you don't care what a place looks like as long as it has great food check it out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ePoB6z0F6VwwwxcVFVFqGw"
  },
  "5jjjFIh71sRT809o-XG10g": {
    "date": "2/9/2011",
    "text": "Great old school restaurant, great BBQ, best sauce. Scottsdale folk stay away it has a dive feel to it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xaZnGc-wud3wpwXfeKUBfA"
  },
  "Yx6TYIpAvBnQqFYCRFr8aQ": {
    "date": "10/16/2010",
    "text": "A coworker of mine RAVES about this place so when they came up on Groupon I jumped on it. It timed out perfectly to be the place where I had my goodbye lunch for my last week at work. I have to say, I was not dissappointed. I had the pulled pork and the beans and it was delicious. The portions were perfect for me, I left completely full but not uncomfortable. It was a great lunch but I can't say it was the best barbeque I ever had which is the only reason I didn't give it 5 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "73OCy2bC-8eAisYX9p5C_w"
  },
  "Ccp8gFFJBRwhcfrOwCDBaA": {
    "date": "6/5/2012",
    "text": "I went here on a Groupon, and my initial thought was \"I'm glad I only paid 50%.\" The ribs were too fatty and in small pieces (like bony riblets). It was heavily sauced, so I have no idea if it was properly smoked. The atmosphere was okay but is far from the best in the Valley. The highlight was their Mac & Cheese. Oh, and RC Cola? Seriously?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KyCJW_tKT7jpAyc7vjZ_Dw"
  },
  "wqPKei7GEi1hArVpmHXD2g": {
    "date": "7/19/2010",
    "text": "Okay, totally ecstatic about the Big Red! And the pulled pork, was juicy, tender and just down right good.The mac and cheese wasn't too cheesy but it had a nice pepper season to it... it was delicious. Because we got our order to go they put the sauce on the side so we can pour it on to our liking. I use the whole of sauce. It's sweet but with a spicy lil kick/aftertaste. I know of very few BBQ spots that have left a positive taste in my mouth and this is one for future reference to hit up if I'm looking for a good hole in the wall BBQ spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PRDGKuJaTKyABTUGRATJsQ"
  },
  "KyqSerJO6JxAq3BYc9Lbsw": {
    "date": "6/19/2010",
    "text": "Great pulled pork sandwiches and it's a quick 5 min. drive from my house.  If you like BBQ this is one of the better places here in AZ.  I don't think their sides are really that good more just there to have something on the side other than the sandwich.  Anyways as I said great for a quick bite.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ocB1WhramMTkICc5sZ1bUQ"
  },
  "mwzRwY1QaaexKH36JX-Vgw": {
    "date": "3/5/2010",
    "text": "Very good BBQ joint.  Cheap and no frills, just like it should be.  Maybe I'm just lucky, but I have yet to be disappointed by Scottsdale cuisine!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HVmudhmdkuGYR0EWZmA5Zg"
  },
  "uMIXMtIbT5CfP7IE86CKdg": {
    "date": "7/21/2010",
    "text": "Best BBQ I've had this side of the Mississippi river. They also cater sporting events and concerts. They had a big tent set up at the Mesa amphitheater for a blues concert and they didn't gouge you for a sandwich and drink like most venues will.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "msO139A1u6oOd9vkoG5uTA"
  },
  "7GGC4PMvL0B37QQP6Gg4fw": {
    "date": "10/28/2009",
    "text": "I used to love Honey Bears, but in the past 24 months, for some reason, they've lost their soul.   And that's bad because this was the only reliable selection of BBQ in Arizona.  Whatever they changed, and I'm not sure it's quantifiable, but it needs to change back.  Whenever I'd fly into the PHX airport around dinnertime, I'd bring home some Honeybear's for me and the wife.  The last few times, it's just been kind of \"meh\".    I'm not quite sure what it is, but I need to find a new guilty pleasure, smothered in BBQ sauce.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "OPiV-yNPoLf57J1OWUdylA"
  },
  "Ar7GDRAwZ5oTYfbv4JQKIA": {
    "date": "2/3/2006",
    "text": "\"The 1st warning sign should have been the lack of bbq smell when entering in the parking lot. Someone in the group mentioned that they must smoke the ribs at a different location. The servings are huge, but the food was disappointing. I'm used to great flavor without the bbq sauce and meat that falls off the bone. Here, if you didn't have sauce, you did't have flavor. I think they boil their ribs then grill them. The corn on the cobb was waaayy over cooked and water spewed down my arm after every bite. I've had better!\"",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "iYzbRy7B_Ho3NX-1rXvRLQ"
  },
  "lyM8VC3fZ9MxTutHAZteIA": {
    "date": "10/29/2008",
    "text": "I don't really know why but i expected to not quite enjoy Honey Bear's BBQ. Most of that is because when i think of BBQ anything i don't think of buying it more someone outside cooking it for me. Yet when i went in I can say I enjoyed. I ate the shredded chicken sandwich and was super happy with it. Though not a go to place if i get the craving I will pop back in again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "hcfNvTM43x9ZZ8QqHJPbkg"
  },
  "PFUpov8mZoF-z_-C4KDiPA": {
    "date": "10/8/2008",
    "text": "They advertise \"you don't need no teeth to eat our meat.\" Well, yes you do! I bought a full rack of baby backs and couldn't wait to get home with them. They were VERY tough... and had very little meat on them.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "nn7Evyj4TBZe1JPBEEirrA"
  },
  "03kSYCUhm6L4ckUydOOjRg": {
    "date": "4/17/2013",
    "text": "3 of us went there each had a regular sandwich, combo 1,  which was GROSS.  The bottom bun appeared to be dipped in the meat juices prior to the meat being placed on top.  The meat did taste good if eaten with a fork and all bread products were avoided.  Coleslaw was only tolerable, to soupy and peppery.  What happened here?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fv4k9wOtQ289-HEYlv3HRA"
  },
  "L113fBdbA91qhtPs2d9DOQ": {
    "date": "7/10/2010",
    "text": "ahhh, honey bear's.  i'm not sure where the name comes from, but i am sure the food is DARN GOOD.  the meat is ridiculously tender.  the sauce is good, runny, but good.  somehow i end up consuming a couple tubs of it without realizing.  the proportions aren't very big, for the sandwiches or the sides, but i guess you can argue that it helps you to not over-eat.  prices are pretty fair though. and again, the taste...mmm...  they cater too, which is pretty amazing when you show up somewhere and it's buffet honey bear's time!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lJ6XPasUHaSDvIkonzQ7oA"
  },
  "SLhOlFWOuo8e3p5Dak8Evg": {
    "date": "2/19/2010",
    "text": "Now I hold all my BBQ reviews up to my favorite standard and that is Rudy's (a TX based chain with stores in ABQ).  Now I have only been here (Honey Bear's) once on a suggestion from a friend who said it was as good as Rudy's.  Well now I can't say that just yet.    I stopped in on a whim for lunch.  I decided on the pulled pork sandwich and a side of mac n cheese.  I added a few jalapenos, but I could have used some fresh onions (I guess I should have asked).    The mac n cheese was good and creamy (velveta like in texture)  and the bbq sauce thin but very tasty (not to sweet, not too ketsupy or vinegary and a nice kick).  The sandwich was that type that required some fork and knife work, especially if you are like me and add more sauce.    As for the restaurant itself, when I was there it was clean, no frills cafe style.  You go up to the counter to order and pick-up and find a spot to sit.  I enjoyed my meal and plan on going back to try more items off the menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gH3JDpHQfVcMEGaAaCJPjA"
  },
  "Ta7GLeWF0dlxQK5bSx3J4g": {
    "date": "4/17/2008",
    "text": "This seems to be a more \"authentic\" location than some of the Honey Bear's I've been to, but it did not add much to the experience. The aisle that feeds you to the counter is winding, obtrusive and unnecessary. I ordered the large BBQ Beef sandwich, potato salad and a large RC cola to go. After a bit, the guy working the counter called my number and handed me a tray. I politely asked him to make it to go, and got a bit of attitude. Once I got back to the pad, the food was soggy and hard to eat, but that was kinda a good thing. It was actually refreshing to have an RC, it seems like you have to go with either Pepsi or Coke all the time. I would go back. There is something about the sauce that will bring me back in eventually. Not the kind of place I think I'd frequent, but good in a pinch.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "xPpqpudzcB2EwyHhIsAjlw"
  },
  "LffgGx7H_8NJoCzupqsVHw": {
    "date": "3/12/2013",
    "text": "Great food, always consistent. Prices fair, service spotty but acceptable. I visit about every 8 weeks and look forward to getting my q on",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bmjVVifZdmtCJEs8FVPfnQ"
  },
  "Bxd5CUWA6CEVANEQ9bTnpg": {
    "date": "10/8/2014",
    "text": "I've been going to Honey Bear's for years and have never experienced customer service this bad in all that time.  I went to order food for a meeting and it was very early (about 10:30 or so).  I had to wait a few minutes for anyone to acknowledge me at all.  Once I started ordering for multiple people (all on one check) the girl looked at me like I was completely stupid.  I had to repeat my order multiple times and she still got it wrong, all the while, looking at me like I was an idiot.  I noticed that she only put down 1 sausage link plate instead of 2 and asked her to add the other one.  She had such a major attitude when I asked for the link platter and she told me they didn't have that available at the time.  How hard is it to just not put the links on a bun and put them on a plate instead? I get the food and there is barely any BBQ sauce.  I ordered for 8 people, and was only given two small containers of sauce.  She gave me a hard time when I asked for more, and that was also when I found out I got two sausage link sandwiches instead of platters.  I also asked for the spicy BBQ sauce and was told (with lots of demeaning attitude) that the sauce wasn't ready yet. (really???) Long story longer, if the owners or the family is anywhere in the building, I'm sure the customer service would be better.  The food is pretty great, but not good enough for me to go back anytime soon.  It's too bad because I work for a company that loves to order from Honey Bears for meetings, but after the experience I had, I definitely won't be ordering from them any time soon!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rR3yI9o7pKsdQ8PiZKynDg"
  },
  "c0brgydGfAn7qHU-s8jbAw": {
    "date": "6/21/2010",
    "text": "This is pretty good BBQ.  Not the best I have had but not the worst.  The sauce is yummy but the meat couldn't stand alone.  They seem to rely heavily on their sauce to carry the food.    The Mac and Cheese was average...better than Kraft but I have had better out of a grocery store deli.    I almost had to give them an extra star for their catchy slogan (\"You don't need no teeth to eat our meat\") but didn't because that would just be a silly thing for me to do.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWSfuI1Te_KxPpdI0l0xbQ"
  },
  "RP-_oPQNqH8rEOV39z5jIg": {
    "date": "9/29/2013",
    "text": "Something is up at the Tempe Honey Bears, and it's not good.  I've eaten here for years, and at their Phoenix location, and previously at their South Tempe location (now closed). Food and service have always been excellent.  On my last visit, the place does not appear to be run by the family who has delivered excellent food and service for the past several decades. I ordered my usual Rib & Chicken combo with 2 sides.  The chicken was OK, but the ribs were seriously undercooked and underseasoned.  This was a huge disappointment!  As with most BBQ places, the ribs are supposed to be, juicy, flavorful and fall-off-the-bone tender.  It's something I look forward to when indulging at a place like this.  The hispanic staff (including a very young kid) who were running the place were unfriendly and slow.  There are lots of BBQ joints in town now, several closer to home, but I've been a loyal fan of Honey Bears for a long time.  I hope they can get their act back together.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8gvyr6fkEFCCjKVRGWBJcw"
  },
  "d5q07y0Jj0FUofcQiYbuaw": {
    "date": "8/23/2009",
    "text": "My dad used to have this saying.  \"If you put it on top of your head your tongue would beat your brains out trying to get to it\".  That sums up how i feel about honey bears.  After living in St Louis for a while i feared i would never find BBQ that met my standards ever again.  But this place is probably the best in the valley.  Many places try, but none can match this place for the portions or the price.  Only reason they didnt get 5 stars is the lack of cornbread.  What is with BBQ places here and no freakin cornbread?  Blasphemy. But other than that, perfection.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "B--5Ih8GxneIQNSuHTnwUA"
  },
  "1jWJcPUPYadz1W3S7zMKIw": {
    "date": "9/21/2009",
    "text": "The Real Deal  I'm from East Tennessee and our BBQ is North Carolina style. After moving out to Tempe in '95 I thought I'd never see good BBQ but Honey Bear's changed that, they could hold their own in the South. Honey Bears is N Carolina -style BBQ and the real deal., not cooked with spice/sauce until you put it on the meat. Go for the Pork! this is what they do, skip the beef and chicken, it's for the BBQ illiterate. Same with the folks who complained about having to put the sauce to the meat or not having fries, you do not know Southern BBQ. For those who do, enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ckkz6SWk7hR6HFhrpsOAGQ"
  },
  "mdHwfQP0v08etv_TQl4Gsw": {
    "date": "9/25/2013",
    "text": "Real BBQ smoked in a smoker.  Tangy and tasty sauce.  I speak on the one on V an Buren which I've been going to since the 1970's.  Their beans and potato salad are out of this world.  Always try to go to mom and pop joints as opposed to chains.  That's worked out well over the years in the Phoenix area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "u2EW_5Obufd12PKwjnyLUA"
  },
  "agFiZ49qXpzcH4R2hOk0OA": {
    "date": "6/18/2012",
    "text": "Delicious! Ribs, chicken, mac and cheese! It's all so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6JebqCTXmJnVapuxck3RbQ"
  },
  "EkMdTsaEHbv5CunK6Zso3g": {
    "date": "9/9/2009",
    "text": "This was a pretty decent place for good BBQ.  There isn't that much variety - mostly focused on BBQ meat sandwiches.  The good thing is that despite the small menu, what they do have is pretty good - I had the BBQ beef, which was tasty and had a ton of flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tlY0QMQDyfjQAEwHnzvFnw"
  },
  "FY2IDHz5GA-nbSYMuf8nFw": {
    "date": "2/16/2012",
    "text": "We really liked this place. Tried them on a Groupon and will definitely be back when we come in town. The outside of the place looked a bit scary, but don't let that fool you. It was excellent food! We had the ribs, wonderful, fall of the bone delish! The chicken was just as juicy! The pulled BBQ beef was good too. Potato salad was great too! This is definitely in the top 5 BBQ places we've ever eaten at. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ITIeAxoEbP0C7ZGikWmKzg"
  },
  "Kb9kTZEb2uOkXYstOQhiCg": {
    "date": "2/10/2009",
    "text": "Honey Bears is an experience.  I don't want to see how clean their kitchen is(n't), use the restroom or walk to my car in the dark alone, but I CAN'T GET ENOUGH!!!  It is the best BBQ around hands down!  I LOVE the pulled pork sandwich and would eat anything drenched in their bbq sauce.  Its sweet and spicy with the perfect touch of vinegar-i-ness.  You definitely need quite a few of the paper napkins to clean up with afterwards.  Actually, just take a shower.    Their beans, coleslaw and peach cobbler are delicious too.  They also cater.  Its a dive, but TOTALLY worth the trip!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e49Jr7Tk2g6JZ8h3ZUnRWw"
  },
  "279zAQU6g4JJZ8yh1ia-RA": {
    "date": "2/5/2010",
    "text": "Honey Bears is a place I'd heard fantastic things about for quite some time and so when I finally made it over there one weeknight with some friends and office-mates, I was surprised to find it so incredibly lackluster.   More than that, it was simply not good. I'm not sure if the food was just old and done for the day, as we were there about an hour before closing time, or what, but the meat was basically sprayed with some sauce and they called it a day. The meat was devoid of flavor and overcooked. I had chicken but the ribs were absolutely nothing to sneeze at either. The corn on the cob was simply some frozen piece nuked up or boiled or what-have-you, with some chips thrown in for good measure and that was about it.  The insides aren't impressive in the slightest, either. I've been to plenty of dive places and had a great dining experience and considered it more the fun for it (Lolo's original location in Phoenix comes to mind, as it has a certain fun and well-managed charm inside) but this was dark, dingy, and unpleasant.  The sauce was perhaps a saving grace if the food wasn't served nearly lukewarm and was able to bring something to the table on its own. Sadly, no amount of sauce-drowning could save my meal. I left unhappy and unfulfilled. I've heard so many great things from people I trust, so I may have to try it once more, during the day, but for now, the one star stands, as there was simply nothing even a little redeeming about this food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2AZaPPRAWhDDO7k-jlpfwg"
  },
  "CUTKlCKTMbsrJC_EFp5JkA": {
    "date": "3/20/2011",
    "text": "The first time I went here, I was living at some apartments just down the road at Papago park.  I had only lived in Phoenix a couple years and where I come from there wasnt much in the way of BBQ so I didnt know anything about it other than I've had ribs before.    I walked up to the counter and a very large black man hears me say \"Uhh, I'd like to get a rack of beef ribs please\".   He barks back \"Boy, you dont want no beef ribs.  What you want is pork ribs\" Being the skinny half Korean kid I was, all I could say was \"Yes sir\"  I'll tell ya, that changed my life.  Pork ribs, especially the ones from Honey Bear, make beef ribs taste like a McDonalds McRib sandwich.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DcUz3R0T87eP5mhgAdGK3Q"
  },
  "9j94hAulFqqE2sHuEl_ALw": {
    "date": "3/7/2010",
    "text": "Great place for pulled pork BBQ sandwiches! Awesome beans and coleslaw to go with your meal. Just enough to fill you up and make you happy at lunch time. They also have Big Red! If you're in the area, also look for Hap's Pit Barbecue and you can compare both places, see which one you like better!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "52aLp0hGkUk2JWs4WfNT7A",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. The perfect little lunch meal!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/52aLp0hGkUk2JWs4WfNT7A/o.jpg"
      }
    ],
    "user_id": "FkWBBtmKB96N5NZ8axeCOA"
  },
  "6iJa7MzR3gchySAOeUvHQA": {
    "date": "1/23/2012",
    "text": "ribs were dry, hardly any meat on them, and chewy/tough. seems that management may have changed since I last visited many years ago. man at counter lacked appreciation for my business, made crude comments about women who had just left,  and was very impersonal, did not thank me for my business or even look at me when he handed my to go order to me. I doubt I'll ever return to this location. the one on central I may try once more.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ValzYdgqm7RbdOmKHWKwdA",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ValzYdgqm7RbdOmKHWKwdA/o.jpg"
      }
    ],
    "user_id": "4d13xAX2jp2EbGF8I9eZZw"
  },
  "ZgsVfIdO9izDtmBbBc9Jmg": {
    "date": "3/22/2011",
    "text": "I have eaten here for years and like the beef and chicken sandwiches but over the years they have stopped trimming most the fat off the beef and that makes it pretty gross. The reason I don't eat here much anymore is your order from the counter from some kids with no personality, have to come to the counter to get your food, go to a station to get sauce, another for plastic ware and napkins and they have a TIP JAR at the counter.  Are you serious? The urinal in the bathroom has been broken for years with a trash bag over it so no one pees in it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "g4wOvxjgncbMCvgChOgPnQ"
  },
  "GWR2TdvYv5Jbya7bOiiBZg": {
    "date": "12/9/2011",
    "text": "Cannot believe I have lived next to this place for years and never tried it! Went for lunch today and the sliders (one pork, one beef and one chicken) were AMAZING! Their mac n cheese was bomb too, not to mention the Big Red. Will definitely start eating here regularly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZcwLnR_VGfgLmuJ_7tnAjQ"
  },
  "k82UP2CLaKcKD5yPdV1tQw": {
    "date": "8/24/2011",
    "text": "Must have been an off day but still pretty good. Better luck next time!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tsHQDxbhzPHE_G2QqNnygg"
  },
  "ugEmq438EMUbURKXtPvfrA": {
    "date": "11/7/2011",
    "text": "I was taken to Honey Bears BBQ by a co-worker for lunch and oh am I glad I learned about this place! We went this location by the airport, but I imagine they are all just as tasty. I got the 3 slider plate with a side of macaroni and cheese. We got it to go and the sauce (a very large portion) comes on the side. YUM! I'm a smaller girl but I can eat and this lasted me lunch and dinner - the leftovers were just as amazing. Can't wait to go back! :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tZYVHdCKznlcM5tiEIE2aA"
  },
  "pLalLgsLOCMCsVpIvt1PNg": {
    "date": "10/4/2011",
    "text": "Their sandwiches are excellent! I like to get the slider trio with bbq chicken, brisket, and pulled pork. Their potato salad is pretty decent but not as good as grandma's ;). Also, their coleslaw is quite nice but just a touch of too much mayo. Now comes the bad part: the ribs. I absolutely love bbq ribs and unfortunately their's were dry with very little meat on the bone. I would not recommend the ribs here to anyone. Stick with the sammy's and you'll be all good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QScfKdcxsa7t5qfE0Ev0Cw"
  },
  "RkDUD5Em3FA3Hz_l0mtObA": {
    "date": "2/28/2011",
    "text": "One of the best BBQ beef sandwiches I've ever had. No fuss barbecue and quite the experience. Oh, and the cowboy beans are amazing too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GABWrw5Et9jubriKwMUDbw"
  },
  "eHnv1uNmXT1OCEmBt0Pkcw": {
    "date": "3/17/2019",
    "text": "Ordered two BBQ Cups of Chicken for $10.00 each and for $10 each you would think these would be the best \"cups of chicken\" you ever had? Not even close the size was less than a half a cup. Had barely any BBQ sauce on it and the bottom was filled with water. I started to eat it until my friend said stop mine is pink. I brought it back to the girl and she said the pink was BBQ sauce and the water was \"juice\" she offered to replace them, at this point I was gagging and said no thanks hoping she would offer a refund or at least an apology. I left them on the counter with disappointment. I will never eat from that place again. They should teach their employees what good customer service is. Waste of money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "b-rgUg848MIccxO6-82Rwg"
  },
  "8y9-WplEXGBv8EKItz9KTQ": {
    "date": "1/28/2019",
    "text": "This place is an icon in Phoenix. It's been around for as long as I can remember and with good reason. They are simply the best at classic style Southern BBQ. The meats are always consistent and juicy with exactly the flavor I expect. The sauces are also delicious. Well worth the trip any day of the week.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fDIKq2NrkaU8vQV5f8cFig"
  },
  "ybH7SiCrLLQal1pYv96ODQ": {
    "date": "4/3/2019",
    "text": "Very casual dine-in experience. I wouldn't go for the \"vibe,\" per say, because they're really famous for their catering! Cheap canned and bottled beer and some of the best bbq in Phoenix for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HmV0T2S1zUxhsxgE4tBb2A"
  },
  "6bE47d7kYc7sCoer2hVFSQ": {
    "date": "12/20/2017",
    "text": "I found this place to be far inferior to both other BBQ joints and other restaurants in general. My family and I decided to meet up with my parents here before taking my daughter to see Zoo lights at the Phoenix Zoo. It was a poor choice.  To start the staff was unfriendly. The gentleman taking the order had a question for my step mother and instead of politely asking my father (who was ordering) he just yelled over his head to her in an offstandish tone. When my wife and I went to order he just walked off. A woman with a blank look cane out and just started at us until we ordered. Really bad first impressions.   The food didn't help improve their standings. I ordered the brisket sandwich with fries and coke slaw, my wife ordered the pulled pork sandwich with fries and corn. She was told it would be a bit for the corn to be ready.   I can't speak about the issues with my parents order (they just said it was unpleasant) ours was ccoolldd, bland and soggy. The buns weren't toasted so the liquid from the meat turned them to tasteless mush. My coleslaw was unimpressive and the fries were way too salty. The \"freshly made\" corn was cold and overcooked. While the fries were oversalted, the corn had none. None of the tables had any shalt shakers, not were there any packets available. When I asked for some I got this is look and then the woman behind the counter have me a plate of salt. Odd. No amount of plate salt could save the bland BBQ. While there was a solid smokey flavor, that was it. The meat wasn't seasoned and sightly acrid.   Blech, waste of $30. Never coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "optd66t5hC1pvSqMqotQaw"
  },
  "RA8k4yKgD6c7yxagyYiPig": {
    "date": "4/1/2019",
    "text": "So disappointed. Mac 'n cheese was one big clump of goo. Meat was too fatty.  Good smoke flavor and sauce.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nRNBNxc2XOaW1suu8MuoFQ"
  },
  "PVGfz9qFcWE_vncyUd40tQ": {
    "date": "3/30/2019",
    "text": "The worst food we had in a long time. Service was not friendly, soda machine didn't work at all.  My husband had potato salad and only took two bites and said it had a funny taste.  I had the brisket sandwich , he had the pulled pork , we couldn't tell the difference. Need up eating what meat there was and not the bread. As there was more nun than meat. Only plus in my meal was the collard greens, they were good. One thing I can't stand is employee's taking about other employees and that what we listen to, as an employee was sitting right behind us. Our friend said try it . Not sure about our friend. Why we didn't just take the food back up and tell them we wanted our money back , was a mistake.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "crsaL_yDh22cRn6ZpHhK1w"
  },
  "BNYeAPqb0Rie9zViLRTBUQ": {
    "date": "10/28/2018",
    "text": "We used to go to Honey Bear's years ago and decided to take out for our weekly family lunch today. I don't know what happened to the food, but 5 meals for $130 is downright highway robbery, especially for what you get. We got 5 Rib & Chicken Combos. The chicken was decent, but the meat was blah. All of the flavor came from the BBQ sauce. And the ribs were overcooked or BBQ'd (I wish I had take a photo) with not much meat. Some were definitely burned black but slathered in BBQ sauce to cover it. We were very disappointed and won't return. Way Overpriced for mediocre food.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "WOl0mip1OMtPG8WSviDtXg"
  },
  "WoWzX3jU8M9TSiZtjITf3Q": {
    "date": "2/7/2019",
    "text": "Worst place to order food from. How do you open up at 10:30 but don't have all the items on your menu readily available to order form.  If you open up at 10:30 and you know you have to make the food shouldn't you be in the kitchen at least an hour before opening. Always a disappointment when coming here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hDi2evmPQlvjGAaVfAaVWg"
  },
  "cRhnUMemSo_AJTp1UOan_g": {
    "date": "2/26/2019",
    "text": "I've come to this location for years and have watched the slow decline in this establishment.  The food quality is declining, its dirty, and the staff isn't friendly.  The soda fountain is constantly broken or out of something.  The drink station is nasty.  The restroom is barely serviceable.  This will likely be my last time eating at either of the Honey Bear's locations.  So disappointing to watch it fail.  Also, the price is indicated as one $, but is notably more expensive at over 12 dollars for a combo meal.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_wP2nmw-3JF0VN7yiue2Cg"
  },
  "eVhQKr_knPJPdHHlkUEirw": {
    "date": "2/22/2019",
    "text": "Everytime I bring home Honey Bears my whole family is happy. Great food! If you like BBQ it doesn't get better than Honey Bears.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QkIBVv6nTqIGU4PKNeC1hA"
  },
  "nDkG80A5qKf3OAns4ZS_CA": {
    "date": "1/15/2019",
    "text": "A friend of mine could be to Honey Bear's BBQ recently and it was some of the best barbecue I've had in a long long time. Looking forward to going back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ONX9WitUWJzr3xvwp0Atwg"
  },
  "FfCjaDayxPR3Gy_dpRnjJg": {
    "date": "2/6/2019",
    "text": "Food was amazing and was ready within 5 minutes of my order. Lady at the counter was extremely nice and inured a out way to make a 2 meat plate out of a sandwich (no bun) without ordering by the pound. Will definitely be back when I'm in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dj-UNjcjaFZ1s_uztUTfNA"
  },
  "lmekW41pitMkGFwd69_pmg": {
    "date": "2/23/2018",
    "text": "This place SUCKS!!!!! The kitchen is in complete chaos! I ordered a 2 piece catfish dinner for $11.99 and a beef brisket sandwich for $6.99 for a total of $20 and change. Waited 20 minutes until order was done. Got to my car realized my beef brisket was not in the bag. Went back inside waited another 15 minutes for a simple sandwich.  Got home and opened boxes and the 2 piece catfish dinner is one fillet cut in half to make 2 pieces... BS! Mac and cheese had NO cheese... lame.... beef sandwich bottom bun was completely Soggy.....Will NOT be going back.....Stay away from this stupid ripoff place....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "4CydliTTG-4pmEfDmAKzDg"
  },
  "jRmVtQ7Tbko-YREsVC_xtQ": {
    "date": "5/28/2018",
    "text": "The food is good.  The coleslaw is really good.  I recommend never using a credit card.  At the Van Buren location... they always run it twice and it double charges sometimes.  I called them them when I saw my bank ledger to fix it and their customer service was atrocious.  I will never eat there again personally.  That's just out of self respect.  It's sad.  I've eaten there since they opened and were donating all their proceeds to their church.  I wish them the best.  I'll find another place to go for BBQ",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xvqDXnPK4OpIFhROJKu5Mg"
  },
  "MMWsGp54Qgy3Y-HcKia2JQ": {
    "date": "12/10/2018",
    "text": "Wonderful place with fantastic food and friendly staff. The BBQ is unparalleled and you really feel like you got quality home cooking when you come to Honey Bear's BBQ. Can't wait for my next visit.   Thank you Honey Bear's BBQ!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DAsqOe0neWeLFtjJ21IN2A"
  },
  "jOLtydHfJ6e1lF4guQmoFA": {
    "date": "4/7/2017",
    "text": "My best friend and I were in a tough spot a few months ago when we stumbled upon Honey Bears BBQ. Long story short we were stranded on the side of the road and needed a good place to eat. We walked into Honey Bears and was greeted by Mark, the owner. Mark treated us like family! We were hooked up with meaty mac and cheese. Which is mac and cheese, baked beans and shredded pork on top. TO DIE FOR. Mark charged our phones so we can contact a ride, fed us and left us feeling 10 times better than we did when we first walked in.   Thanks for the hospitality, Mark! (From the two girls in 80's clothes last year, Andi and Megan)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "1d5nf7RMjFQ2gXTb5zrh1g"
  },
  "2-WGWLuLvTz4LUc10PGyCg": {
    "date": "7/23/2017",
    "text": "Loving located on notorious Van Buren, this hole-in-the-wall BBQ spot is legit one of the best places I've found in AZ. Obviously when you go for BBQ, you go for the meat and sauce. My chicken sliders could not have been more perfectly cooked and the sauce was just the amount of spicy, sweet, and overall delicious. My roomies had nothing to complain abouut their pork sandwiches. Definitely filling alone without the sides too, so it's hang for your buck. My only complaint would be the sassy guy at the register.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LLq5scOa7iFrLJaFs6pDsA",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LLq5scOa7iFrLJaFs6pDsA/o.jpg"
      }
    ],
    "user_id": "PzjCsCXxqd5aEWaFYz8gJQ"
  },
  "O8VjnY4PGBfL7FOIp1f1gQ": {
    "date": "2/13/2019",
    "text": "I wish there is a negative star option. This place is a total nightmare. The meat taste burnt and flavorless. Also overpriced at the same time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mZPVZTrAAZitfsVsLl9XTw"
  },
  "xnQqLm52cVKcYwaz26qtAQ": {
    "date": "3/3/2019",
    "text": "I can to smell horrible alike vomit on brisket sandwich look not normal and I stop ate it can't eat all feel me disgust and I ate only beans ... honestly, I don't want go there never again ever....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6-lMccFn3t3yszI7Wlooqw"
  },
  "KsFmLJP2w2OL1hUEAoMcKw": {
    "date": "6/6/2018",
    "text": "This is right around the corner from me so we decided to try it as we wanted some BBQ. The first time our order got messed up but the BBQ sauce and greens brought us back. The second time was atrocious. The chicken is DRY. The ribs have no flavor. Mac n cheese is disgusting along with the coleslaw. The beans, bbq sauce, and the greens are delicious so I will give them that. Also the owner himself is so nice but his son or whoever works the front area is NOT pleasant. He does not listen and when you tell him he made a mistake he says oh well I didn't ring that up or no you didn't say that or just negative stuff to not make him look at fault.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gzJvUVgknC96mobK_c4Pdg"
  },
  "M1BE41Ve720KZgKvBKCLSA": {
    "date": "6/16/2009",
    "text": "Oooohh the good food we find in the ghettooooo!!   So yeah, when I moved to Az I didn't really know anyone, so of course I had no idea which areas were near 'bad', and which were closer to 'good'. I moved about 3 blocks away from Honey Bear's, and truthfully this place saved me a few times. Sure, it's on a street famous for hookers and activity deemed less than savory by most, but the bbq is solid.   Parking is ample and the staff is as down home as the bbq they dish out. Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "7yKYKACishL1ZVwNCMi0ng"
  },
  "ZCpCL4MBLzou92jpUTc2Fg": {
    "date": "11/14/2013",
    "text": "HORRIBLE experience. Got a couple of the Groupons thinking it was a good deal and bc my dad grew up in Phoenix and we used to come here a while ago for their formerly good food and service. However, we will never be back again and opted not to even use our balance because of how poorly we were treated. The Groupon actually expired yesterday and I was really tired but was going to make the 40 minute drive anyways but I thought I'd call and just check to see if they would extend the offer til today as some company's are courteous in that way. I spoke to a gentleman on the phone and explained that I knew my Groupon was expiring that night but would they let me come today for the deal and he said yes that would be fine. So today I make the drive and was told \"no\" by the girl behind the counter. I explain the whole situation about calling last night and that I spoke to a guy and she just said \"I know who you spoke to but that's not our policy so you can't get the deal.\"  No apology or attempt to rectify the situation.  I should probably add that there was NO ONE there and she could have easily extended our offer and established return customers but she had no custom service skills. When I asked her name she said it is Courtney but it looks like she has replied to reviews on here as \"Anna S.\" so who knows. And after reading more reviews about ppl who have gotten food poisoning after eating here recently maybe it's for the better!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "kP-rSLfwhRk8rhl4vSKp7g"
  },
  "ZNO-lxTdHSPFxPWEROvpfg": {
    "date": "9/21/2012",
    "text": "HORRIBLE HORRIBLE HORRIBLE catfish taste like crunchy cardboard. HORRIBLE customer service in the van buran location. If you want some really good catfish papa joes is AWESOME!!! It's actually worst than one star, and they BOIL there ribs. SMH!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y3fmKCmxkVU4tqpPuDz5YQ"
  },
  "i-nc4QEp_LlDh-nne63U-g": {
    "date": "7/28/2014",
    "text": "Unfortunately, I was underwhelmed with the flavor of the meat here.  Side dishes were pretty good. If you want a good smoke ring and flavorful meat I prefer Rudy's. However, if you're in downtown phx and don't want to travel to the 'burbs this place will do",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZgrBVmyYxm4FIaqCE0PXaw"
  },
  "ZErd-0FLwf2PNt5w5Yez2Q": {
    "date": "3/9/2013",
    "text": "Been going to Honey Bear's for around seven years and it is the BOMB! It is my favorite bbq place. I suggest you try it, especially if you like wet and saucy bbq. When Jesus comes back, I expect to see Honey Bear's Sauce ascend home :D If you want good BBQ and a no glits and glammour dinning room, you've found it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H3iIzvfpTGavCv1hQwsgZw"
  },
  "MQMBPsB1XU1XQsKrD7myUg": {
    "date": "8/5/2011",
    "text": "quality in the food is inconsistent. i'm sure it depends on the cook of the day.  the only thing that consistently not dry and full of gristle is their pulled pork.  i have 2 groupons for this place and i'm hoping to try their catfish.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "9YRFLVFVbHGAJ1weFx5zqw"
  },
  "36SS_5s7qkPJwx8R_OqfZg": {
    "date": "9/2/2008",
    "text": "I can't remember how long it has been since I started going to Honey Bear's BBQ.  It has to be at least fifteen years.  I love this place.    I was there today for lunch and had the shredded chicken and a couple of hotlinks.  Delicious!!  Also had some coleslaw too.  I think I've had just about everything on the menu and it is all GREAT!  The service is good and the staff is always friendly.  If I have one complaint, it is that I am sticky and smell of BBQ sauce the rest of the day.... it could be worse.  Any place that's slogan is \" You don't need no teeth to eat our meat\"  has my vote.  The truth of the matter is, the slogan is right.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "0BcJ3TmeXf5J9-fB0hrA2g"
  },
  "vmn2mOTtjx8KNc-ZWRc6_w": {
    "date": "8/19/2012",
    "text": "Went there on a Sunday... not busy... only 2-3 other tables. The place was clean and very BBQ-esque feeling (which is good!); HOWEVER, it may have been a bad day or personal issues or ?  ... The big bald guy at the counter (I can say that because I'm a big bald guy), had a very unfriendly attitude.  Like I said... he may have just been having a bad day, BUT... we almost left before trying the BBQ.   At then end of placing our order, we decided to add a piece of their sweet patato pie, listed on the wall menu... His response was only \"No Pie Today\".  No please... No Thank you... barely a grunt in reply to a question.  Definitely the the BEST RIBS I have ever had.  Tender, but not fall apart... slight crisp to the outside... plenty of meat on the bone and a great sauce with a little kick.  The food was so good I'll probably give it another try but I hope the big bald guy will be having a better day!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Bqu43n3pcNW0scbPMmCDyQ"
  },
  "DJ2jilbck1Rc8c-dI4YcZw": {
    "date": "11/30/2012",
    "text": "Ok, so I haven't actually been to this location. I just had the BBQ from their tent at the Tempe Art Festival. When I got there the BBQ rib tips weren't ready yet. Mark Smith actually delivered them a couple blocks away to my office when they were ready, and he included extras. Such wonderful service, so nice! The BBQ sauce was amazing and I want to head to one of the full-menu locations to try their ribs. mmm",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GF_BSqaNu69aKn0AR_M9Wg"
  },
  "pdQXvvPRvYjdYGV1rKmTiA": {
    "date": "5/10/2009",
    "text": "Honey Bear BBQ is wet, messy, forget-yer-in-Arizona, hose yourself down with gallons of ice-tea when you're done, fun. The meat is so tender they must be getting it from animals who can't even stand up. The flavor of the sauce is a nice balance but leans a bit heavy on the sweet. But if this surprises you, you've simply forgotten the name of the place. Try any of the meat, and don't miss the beans. They taste like something went horribly wrong in the pot and someone tried to cover it up with ladle-fulls of honey, and just before throwing the whole mess out, realized \"This is pretty damn GOOD!!! I'll go there every chance I get, but if you don't like sweet messy BBQ stay away.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "yURhWF5jdSjHCG0wb83qgg"
  },
  "SaeY9viQzAm231do-9zKxA": {
    "date": "2/11/2010",
    "text": "Ten years ago this was the BOMB!  Today,  They serve you with attitude or simply as a number.  The people who work at the front counter dont care about the food how it looks or what you ordered.  When the Management is around their spirits are a little different.  The food is good but the SOUL IS GONE.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x9PrMko180F3dOC8b9gOFw"
  },
  "L2mGuOgLCsrbtC1VK9hsDg": {
    "date": "4/2/2008",
    "text": "Yumm-o!  I love this place!  We eat here a lot.  I always get the ribs... and mix it up between the potato salad and the cole slaw.  The only thing I don't really like is sometimes they put too much pepper or something in their potato salad and cole slaw.  I'm not sure what that flavor is, but when there is too much, it ruins it for me.   But since I don't go there for potato salad and cole slaw, I'm pretty happy with the place, plus it's within walking distance from my apt.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "U_Ne8BOcLn1iWBgInHVzEQ"
  },
  "lKaBYMPjpzoV2sb1gHjdEg": {
    "date": "7/16/2008",
    "text": "This is by far the best BBQ place in Phoenix IMO.  The only problem that I always ran into is what to get.  All the meats are smoked to perfection and the link are spiced just the way i like it.  The BBQ sauce is so good that I keep a gallon of this wonder in my fridge at all times.  Oh, and they also have Alcohol!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bvofk-gNzMxX-CyBZ7d5Lw"
  },
  "JTea3PL-VYuQRcrwSEKlzw": {
    "date": "7/24/2012",
    "text": "Great BBQ and sides plus reasonable prices and service I will go back",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nq9juLK17z-jCz6OwEVG0Q"
  },
  "_3znthGkKb8hDytkKpOHvg": {
    "date": "11/15/2010",
    "text": "Don't let the neighborhood turn you off - this is the BEST BBQ in Phoenix! Totally back to basics BBQ - no fancy fusion food here!  Try: Everything",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_3M1OYIlQyr9Lvlh2zpbOg"
  },
  "uy0z2u_WJARgABhd59T-Tg": {
    "date": "3/6/2012",
    "text": "i'm confused.  i tried this place without looking at a review and i give it a 2 star.  but honey bears has a 4 star rating.  that's why i'm confused.  not sure if it was a bad day or what is going on.  the food was average to below average.  i did finish my food but that was about it.  my family was not to impressed either.  the inside experience was okay too.  after we left this restaurant we decided to never come back again.  but after reading so many positive reviews i'm may give it a second chance.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "w-8dwH60e8aoPVlrElEsZQ"
  },
  "oFrAeBNn8qNMiAeiuTCHng": {
    "date": "5/24/2007",
    "text": "Good god damn is this some awesome chow.  Whenever we had some lame corporate event, there would almost always be Honey Bear's before in huge trays.  It was usually the only good thing that would happen.  They do everything good here.  By way way waaaay far the best BBQ in a 200 mile radius of Phoenix at least.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "iQbqQwF6ttvdMbpbqEGIaQ"
  },
  "3WvAUpndr_ZadPJii2KbzA": {
    "date": "4/7/2009",
    "text": "\"You don't need no teeth to eat our meat!\" the slogan for Honey Bear's Bar-B-Q proudly proclaims and they are telling you the truth! Wonderfully tender and tasty pork, chicken and brisket that fall apart as you eat them in to an amborisa of meat and spicy sauce!  Honey Bear's has been a valley gem for decades, their original location a run building in Phoenix near Papago Park that you would never expect would house some of the finest barbecue this side of the Mississippi river. But the aroma would draw you in anyway.  That's how I first found them 20 some years ago, by smell while bicycling near Papago Park the wind brought the smells of the promise of smoked pork at it's finest. I was not disappointed then and never have been since.  Home of the hottest Hot Links around, Cowbro beans, Fried Catfish, Beef Brisket, Pulled Pork and Sweet Potato Pie.  Now Honey Bears has 4 valley locations, but success has not affected the wonderful quality of their food and their prices are the lowest anywhere for genuine slow smoked barbecue!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "N3bLACFC7VL0T7OBmVDSrA"
  },
  "kZZXN1KrTCWxvvEV0iCelg": {
    "date": "5/31/2012",
    "text": "I am EXTREMELY happy they serve rib tips every day now. The sauce is amazing. Get buns to soak it all up. If you run out of buns, go to the store and buy more buns. Or you can mail me the sauce so I can dispose of it properly. Or not. Just don't waste the sauce.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LU_uGZbUciYKtB3fheVOGQ"
  },
  "J9L7jq-lLa-xqKqoQMGFag": {
    "date": "7/23/2012",
    "text": "I've been going to this particular one since 1987.  It was a ritual to go there right after the Copper World race, Indy car race and  the races at Manzanita.  Great food, great portions and great atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZEpS0eOpUeqk0FrnD1njEg"
  },
  "6DJcSff3Payi6-HItOIJHw": {
    "date": "7/30/2019",
    "text": "Stopped in here yesterday as was in the mood for BBQ. Haven't ever really found a go to place for BBQ in the valley, and so was excited to try this place out. Little off the beaten path, but easy enough to find!  I'm a big brisket fan so I went with that along with a side of Mac & Cheese. The brisket was really good! The mac and cheese was great as well, and the two went together really well.   This is a great spot, plenty of seating, and helpful staff. Will definitely eat here again when I am crazing some BBQ!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CNVH_z16xvtLCRaWG9n2rg"
  },
  "DHYLv7tFhyxiBNH1zCIpsg": {
    "date": "4/22/2019",
    "text": "Great food! Bad business! We pre ordered, and paid for, in advance, 10 pounds of pulled chicken... come our Wedding day, no one has the order or any record of it! We had the receipt and had to demand that the order be filled! They actually complained and stated that giving it to us would wipe them out of their entire days supply of chicken! Um, too damn bad! We pre ordered and pre paid for it! So not only did they not have it, we got yelled at for it! Lol! Finally got the chicken!  Thank god for RUDY'S TEXAS BBQ, HIGLEY AMD THE 60! They saved the day and took care of the rest of our needs and our reception was a hit! We got all the sides of pickles, onions, jalapenos, bread, plates, cutlery, styrofoam cups, napkins! Far more and less price than what Honey Bear's offered! Sorry Honey Bear's! You Catering just couldn't compare to Rudy's!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "e41NX0udVzAhZJy9FkNbIg"
  },
  "EBgjvvCTPIu2t7k_aBUVmQ": {
    "date": "8/28/2019",
    "text": "When I first moved to the Valley my roommate took me here and he promised me it was good food. He was right it was good food but the prices are higher than I like. Its a once in a while treat but I could not eat here often. When I asked for extra sauce and I would have paid for it the counter help said the sauce is on the ribs and I said I would like some more and he just walked away. I understand that good help is hard to get so I just walked out with my food. We did purchase over a $100 food to go so I expected better service. I'm not mad I'm just not going to go back. I have found that costco ribs are really good and you can put the sauce you like on them. With the beef ribs there was a lot of fat and I don't eat fat. Like i said it was a treat but not one I'd repeat for in the future.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5cjW_J8kGc7_Ibil2SPQlQ"
  },
  "ukoMsy9YEvST_oRRZ0OG2w": {
    "date": "7/6/2019",
    "text": "We were at a Fourth of July celebration and Honey Bear's BBQ was serving up their favorites in their food truck. We had their chicken and pork cup, mac n cheese, and cole slaw. I didn't expect bbq to be that great from a food truck, but surprisingly it was quite tasty. The meat was tender and tasted even better with their signature bbq sauce. Service was speedy, ready within minutes after ordering!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "3kpoitFg-n7K3DtzSh-Y1A"
  },
  "tjjZxlAA0Klu6ycm6HwFIA": {
    "date": "8/14/2019",
    "text": "Came here for dinner tonight with some coworkers  from Singapore. Told them this was the BEST BBQ place in town. It did not disappoint! They were getting ready to close and we were ready to go somewhere else for dinner but the staff told us to stay and enjoy the food and place. My coworkers were not only impressed with the amazing hospitality of the staff but also the food! We had the ribs, coleslaw, bbq beans and the out of the world peach cobbler. This place is the best!!   Thank you Honey Bears Staff for a great night we left extremely happy and full!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I08axQt-0CPHi-Yx0-8iSw"
  },
  "GaUjE-lBXmohSVU0RUjfUw": {
    "date": "12/27/2018",
    "text": "Great location great people great food they are beyond friendly making sure they get everything you need delicious bbq with the house made sauce they offer I love the pulled pork with coleslaw and extra sauce if you haven't tried it you absolutely won't regret it",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 7
    },
    "photos": [],
    "user_id": "1yw3JgmQQxwP662FOLZrWg"
  },
  "wFIndsZzvZqfPV_APdbVBQ": {
    "date": "4/17/2019",
    "text": "So I had a few friends take me to Honeybears barbecue the other day and I thought it was really nice. The atmosphere was just kind of normal but the barbecue chicken was really good. And of course all of the other side dishes and fixings are also good. It looks like this place is a family place which I like. I guess the only downside was there wasn't enough seating because it was really busy and the interior was just kind of regular seating and nothing special. But the food was really good and I enjoyed myself and we had a good time.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "4FmMmopbxkTDU5RiM_3_HQ"
  },
  "uOiWEr6LwiTlZeLSCRrmgg": {
    "date": "6/26/2019",
    "text": "Good bbq for cheap, I've personally haven't had Tennessee style bbq before so it was different from my normal taste buds for bbq but it wasn't bad at all. Personally a fan of warm toasted buns for my sandwiches, and they serve untoasted buns but thats fine.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Awnd_p_pqI9GaqztBj964g"
  },
  "-ei5HXjUhmM-B8BqwwoyTw": {
    "date": "9/24/2018",
    "text": "Not the same as the Central ave location.  Service is not knowledgeable & not helpful.  Food does NOT taste the same. Van Buren location food is not good.  There's no reason to go to the Van Buren location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pbgwe8tK6H3JG2T-5U57KA",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Catering menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pbgwe8tK6H3JG2T-5U57KA/o.jpg"
      },
      {
        "img_id": "pVQ_S3-Itym15_vTA7FlXg",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Main menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pVQ_S3-Itym15_vTA7FlXg/o.jpg"
      }
    ],
    "user_id": "bA_0WltreAfajPFUm5rgfg"
  },
  "KjJ9LmrTH1X47TS9kucL0g": {
    "date": "11/26/2018",
    "text": "Ok at best BBQ. I've heard alot of good things about this place but the hype about this place didn't come thru. It seemed like alot of the bbq is really dry and nothing too special to make want to come back.  I had the brisket sandwich and really didn't have that just smoked, juicy taste that I was expecting. I had to layer it with sauce to add some flavor to it. Not a place I would come back to when the valley has some other great choices for bbq",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fZXYoG5teswbFKR60oFBtw"
  },
  "iek7zBiJvF-HXnytyULHeQ": {
    "date": "7/14/2019",
    "text": "1st time trying this place.  I ordered Catfish, mac n cheese and cow bro beans.  Catfish was good, mac n cheese was ok - missing salt and the beans were good.  I'll try it again to check out the other sides.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CJpBi5hPquz0pGG5n5GC3g"
  },
  "glJ1HnQrUYEcA3z0St0_Wg": {
    "date": "2/16/2019",
    "text": "Great BBQ.  It's the perfect little BBQ restraunt.   More of a runny sweet sauce...   they have two locations but I believe the one on van Buren is a little better.    Enjoy.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ECJr76TU94WWq2tIiKIYXw"
  },
  "eqA9IL5akZYN1-QJx1kbfw": {
    "date": "8/13/2019",
    "text": "Best place in town for barbeque. The staff is always friendly and the food yummy. Inevitably my eyes are bigger than my stomach so I get a take home box for more goodness later.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SpVosmi2LGkrYXZVggVlhQ"
  },
  "OX2S4Gps7oWVeCGA9WhxRA": {
    "date": "6/4/2018",
    "text": "My boyfriend decided to stop in a few weeks ago and order some food to go. He ordered a ribs and chicken combo, a hot-link sausage sandwich, and some side items (collard greens, bbq beans, and buns). I believe he paid about $30 for the food and the commute home was very short.   The best part of the entire meal was the collard greens and they were not even that good. The meat was flavorless and tough. We decided to save some of the meat as leftovers and ended up throwing it away a few days later. It was a first and a last time visit for my boyfriend. I had previously tried french fries on my own trip and also wings on another prior and they were so tasteless that I forgot to even write a review until now.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "f-8BKEVPqiqRaNNmhjAU8Q"
  },
  "PWiCaHWPgALiYO118C1gnA": {
    "date": "6/11/2019",
    "text": "Ok so I would have to put this place at a 2 star. Nothing fancy but nice facility, clean but a little humid and hot for the dine in. One side has AC other side has swamp coolers or at least that's how it felt. With the big opening between the rooms the air was mixing and well coming from the hot environment out side to indoors I want to sit and be cool.  Food ok well I would say this is an average maybe a little below average bbq place nothing special, nothing to make it pop. The smoke on the ribs was good but only after I cleaned them off a little they were smothered in bbq sauce. I wanted the potato salad but they were out so I opt for the Mac and cheese. It was ok but the pepper was not crushed and every time  I took a bite I just got that really strong pepper taste that over powered the cheese. I ordered the rib deal 4 ribs, Mac and cheese some French fries and no drink and well 17.00 bucks is definitely not what I expected to pay for a little below average place. I personally don't plan on returning to this establishment but please go and give it a try for yourself! Thanks",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IeXBAah0Q-pk1rn9LesF4A"
  },
  "Tdma21F8KMc8t3pAvHMVlQ": {
    "date": "5/3/2019",
    "text": "Waited in line for 45 mins. There out of MAC an cheese, there out of bbq sauce and out of 3 different sodas. I guess it would have been easier to go up to the counter and ask what do you have to eat. Not sure how a bbq place runs out of bbq sauce and lemonade.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IxuiYpuA0qxu8OJFR8Sheg"
  },
  "4tD0Z5Oz9S5g5lSsOeBGuw": {
    "date": "7/20/2019",
    "text": "My mom has been dying for barbecue all summer and I brought her here for her birthday. She had the short ribs, which she said had more fat than meat on them, but still good. I had the pulled pork sandwich, which was very good.  We both had the mac and cheese as a side. It was creamy but had pepper in it. She was supposed to also get a side of cole slaw, but it never came. I'd go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MD0TWqzyw5ppAnUV7IJuIw"
  },
  "lbkvCsMjn0eDhjIs20tSjg": {
    "date": "11/17/2018",
    "text": "We visited Honey Bear's mobile BBQ at a Chandler event.  I was jazzed to see they had hot dogs because I just wanted something like to tide me over.  Darn good hot dogs.  Must be their own recipe for the dogs.  Cashier was a little clueless but that happens at a lot of places.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RTz_E92YRqSdtbNmd-yxoA"
  },
  "UCtzM47Lbnl8qjX49iXG-Q": {
    "date": "10/28/2017",
    "text": "There are an awful lot of BBQ joints around town with the recent increase in BBQ's popularity. Then there are some that have been around a bit longer, like Honey Bear's BBQ! The original location on Van Buren opened in 1986 and fortunately, it's right around the corner from my office.  Even though I'm on this side of town nearly every day, I was still happy to drive over toward 52nd Street to meet up with my girlfriend's brother for lunch. This place has plenty of seats despite how small it appears to be. And the \"standing dining\" lobby is a unique touch for those who are in a hurry to get back to work.  Now why would you wanna do that? Food this good needs to be savored and appreciated... Over a long lunch hour. But then again, my office is less than five minutes away.  I've dined at Honey Bears several times previously. I've even entertained clients here. Yeah it's a little on the \"divey\" side of things. But the food will make you forget about that.  Our lunch today was excellent as usual. The three slider combination is my go to entree. Unless it's Friday and they have catfish on hand. The pulled-pork, chicken and brisket are all tasty. And because this is Tennessee style, go grab some extra sauce. The sauce is so good, you'll be tempted to drink it.  Today's lunch was fun and we all enjoyed the food. Especially the \"Cowbro Beans\"! The only reason I deducted one star is because we were all looking forward to Peach Cobbler for dessert. They had none. And they were out of RC Cola. (Yeah, I like RC!) Oh, and no cornbread?! No worries, I'll swing by again for lunch soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kh1jR3JZnfqO3ESKzyMEZQ",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. A picture is worth one thousand words. I can think of nearly as many to describe the meats here.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kh1jR3JZnfqO3ESKzyMEZQ/o.jpg"
      },
      {
        "img_id": "VcC6mu-YOxoGC_9QyQc3uQ",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. One chicken, one brisket and one pulled-pork slider with the excellent Cowbro Beans!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VcC6mu-YOxoGC_9QyQc3uQ/o.jpg"
      }
    ],
    "user_id": "OZErOKA1RaH2J6flZhU-zA"
  },
  "oXXPuxOXvkNvKFjCAWdkaA": {
    "date": "4/26/2019",
    "text": "I have some regular business here in Arizona, plus both of my children are currently here attending university. When a client of mine took me to lunch and we pulled up to this establishment, I thought it was a joke. Well, as a man in his late 50's I still learn and relearn old lessons from time to time. In this case, not to judge a book by its cover. This place isn't much to look at to the point its almost enough to make you not give it a single opportunity. This is some of the best BBQ I've ever had! Hands down. The majority of my business takes place in the south/southwest and I favor heavily on the BBQ establishments. And despite the setting, this food is right up there with the best!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FizyTbufoVYyse3CuyF9Tg"
  },
  "6YwhhGKzi-py-D6pWDvK2w": {
    "date": "12/19/2012",
    "text": "This place seems to be a Valley staple, so I had to try it despite some poor reviews. My experience was pretty good. Ordered two sandwich combos at $9.89 each. Usually don't comment on beverages, but the rare presence of Big Red in the soda machine was one I took advantage of right off the bat. Moving on to the side dishes, the macaroni and cheese was just average, a bit gummy, but the potato salad had large chunks of potatoes and a nice relishy taste. Ok, now onto the main courses. The chopped chicken is just that - 95% white meat chopped onto a bun. So, in this case the BBQ sauce better be good or else it will be one dry sandwich and luckily this sauce was tasty, kind of a thicker red vinegar style, but still a good taste and it gets soaked up fast. The Brisket was another huge sandwich, almost needing a knife and fork as meat spills everywhere (a good thing). This was shredded or chopped style brisket and I even found a few burnt ends buried amongst the meat. Hardly any fat and once again and that sauce made an appearance and \"completed\" the brisket very nicely. Place was pretty empty at 6:30pm on a weekday, just the way I like it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-fgC5NISQdm1aBiEU7VNRQ",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Chopped chicken sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-fgC5NISQdm1aBiEU7VNRQ/o.jpg"
      }
    ],
    "user_id": "ELcQDlf69kb-ihJfxZyL0A"
  },
  "pWsaXkccL4f9DEx0Jcxl5g": {
    "date": "5/20/2014",
    "text": "Was not a fan. The service was horrible, pork was chewy and they were out of mac n cheese. The only good thing was they had Big Red on the fountain. I will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iA1ZUERD9YWDlZCiuTeNnQ"
  },
  "-VjdBWynncvW07-LAQNylQ": {
    "date": "12/6/2014",
    "text": "BEWARE OF DECEPTIVE BUSINESS PRACTICES!!  I purchased a Groupon coupon which had no expiration date.  I tried to redeem the coupon they called the owner on the phone since he was not in the restaurant, and the owner said he was refusing to accept the coupon.  We pointed out the no expiration date and they still refused to honor what i paid for. As a consumer I feel they did not honor their agreement.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "oacvtGOSb0MN3xF7pN0X0w"
  },
  "XzZ7YDufmYDGqPq-0psIsA": {
    "date": "6/13/2011",
    "text": "Some of the best around. I hadn't been to Honey Bears in years but stoped in for chicken and ribs.  They are still awsome and the slaw is spot on. The chicken was moist and flavofull. Dont be put off by the location or looks it is good food! And has been for years.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eDckI2a7l_gobAaLddM0zg"
  },
  "QngYEG9Ir00ThRynr7R1CQ": {
    "date": "4/5/2013",
    "text": "This is the second time I have been here and I feels it's average for BBQ. The potato salad was very cold, almost frozen and did not have any flavor. I was not full from my sandwich and since I didn't eat the potato salad was going to get peach cobbler but they didn't have any that day :-( Pretty \"basic\" place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "esQVkiERSKvDu773Sl4GeA"
  },
  "VlDPzonrVFJD35h1ivj7Bw": {
    "date": "2/21/2014",
    "text": "The way BBQ should be. Counter service, but plenty of tables. My wife & I split a full order of ribs.  This was a 3 day supply for us seniors. We both had cole slaw sides, my wife had the beans and I had the mac and cheese. Everything was very good. I have eaten there, or gotten take out many times when I worked at Sky Harbor. It was always good. I spoke with one of the owners regarding the flaws of the Tempe location (closed) and he agreed. There is nothing like this original location  if you want your stomach filled w/o emptying your wallet. We would go again",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EyCdTW6a3H_SKPYZRkE5bw"
  },
  "oom5aFMgCOisX2Vo9nq7GQ": {
    "date": "4/14/2013",
    "text": "I don't understand the fuzz about this place.   BBQ was not impressing, the weekend special Catfish was Okay. Side dishes were always disappointing. Price is high for the quality of the food.   I didn't hate it, but I would rather go somewhere else for BBQ.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GVIpmH7bkPFcu8a3VXt3xA"
  },
  "G2WPUJBOOgVQvBvKiSpehQ": {
    "date": "1/2/2013",
    "text": "Not too impressed. The baked beans were way too sweet as is the BBQ sauce. So-so cole slaw and dry meat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zUhCdhFqMSRMBxfgwUC4YQ"
  },
  "UtQ1cMQC73riu4za4cqKZw": {
    "date": "8/18/2013",
    "text": "Delicious BBQ! We got a coupon for half off on Groupon, which was the first bonus. When we arrived, the woman at the cashier was super sweet and helpful. She suggested her favorites and was patient with us while we decided. After we sat down to eat, the owner came and asked how our food was. THEN he came back with more sliders for us to try, for free! Such great service, delicious food! Next time I'm in Tempe, I'll definitely go back! Great job, Honey Bears!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "otKseAUCjhgdAxP4tQkcEQ"
  },
  "B1GreMm989HnsvglWK4keQ": {
    "date": "1/9/2011",
    "text": "Finally! An amazing place to get fantastic BBQ sandwiches in Phoenix! I went here for the first time a few weeks back (totally blanked out on the Yelp reviewing).  Some co-workers suggested we go there, saying it was one of the best places in The Valley for pork BBQ. They were right!  It's a tiny restaurant, and chances are you've driven by it a couple times but just have never noticed it. It's nothing fancy inside, just great service, great food and happy customers. I had one of the massive pork BBQ sandwiches on the menu and had flashbacks of the days when I lived in the Carolinas. MmmMmm deee-licious!  I could go on all day writing about how good Honey Bear's is, but I'll just let you go try it for yourself. Go on! Go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "54WSKEri9togfv9Nx01BKg"
  },
  "dEUpLm24nekQUMiP6D7SBQ": {
    "date": "4/2/2013",
    "text": "I had Chicken and Ribs with beans and mac & cheese and it was finger licken good. If you like saucey BBQ this place is pretty good. Both the Rib and Chicken were falling off the bone and the beans were really good. I'm not usually in to the BBQ that is saucey I found myself stuffing my face. By the way... the serving size was huge.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LmJsYp27X6bCaq5rO5Xa1A"
  },
  "PZfYs6XI1Y7C6IYpxCe1kg": {
    "date": "2/19/2012",
    "text": "I have been back to this Honey Bear's location several times since my first review.  And the place has gotten significantly worse on each subsequent visit.  This last visit will definitely be my last.  The place does not look well maintained at all and the food was an utter disappointment.  I ordered my usual hot link sandwich and my other half ordered a pulled pork sandwich.  My hot link sandwich was so so sad.  And the pulled pork sandwich was not only smaller and on different bread but also lacking taste or flavor, and add to that it not tasty.  Of course, it gave him heartburn later to his dismay   Now I need to find myself another place to sate my hot link cravings!.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "h1BF4UAwXT9J7bMll-trsw"
  },
  "2hCim0ov5B2OnnyDC3Nr_g": {
    "date": "8/30/2010",
    "text": "I dined here last week and had a half platter of ribs.  Some ribs had minimal meat and were dry.  Some ribs were great.  The BBQ sauce is a tangy red sauce.  Food I would rate a \"3\", I've had better, but it's not bad.  Location - this place was dirty and there was spilled BBQ on the floor near the cash register.  The cashier was aware of the spill but didn't clean it up promptly as she had to warn me to watch my step.  Another customer was complaining to them in Spanish on how they messed up his order.  Service/Cleanliness: 1.   Overall - this place deserves a 2.  Who would like this place?  Someone who's gotta have BBQ and nothing else serving BBQ nearby - it will do.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "r_eNnwlaObXSQijnAO8pmw"
  },
  "HynvkMxtTQntiLDp4uMtVg": {
    "date": "8/19/2013",
    "text": "Mediocre at best!  Who is writing these reviews and giving this place high marks? You don't know barbeque that's for sure. What's good about slices of processed meat with barbeque sause poured on them? What's good about ribs that are boiled with more sauce dumped on them. Huge disappointment and way overpriced, $24 for two servings of meat and one drink! I can go to Dickey's barbeque and have a better meal than this place for 1/2 the price.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IYABPSJE6xRMndqVdfYHNg"
  },
  "d4IqPZdX3q1lSEvrGZGs7w": {
    "date": "10/30/2010",
    "text": "What the hell is in the sauce? I swear it's like crack. The more you have the more you want it and leaves you in a coma like state.   This is some seriously good bbq! The venue is not fancy at all just down to earth simple food in a cafeteria like setting.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yoT5mQ0EeB40AAMi4ZIyTw"
  },
  "VDDeGWyJJKps7d8ijK7YfA": {
    "date": "9/12/2011",
    "text": "Living in Phoenix, there are very few really good bbq spots, Honey Bears is an exception. Honey Bears is one of the best bbq restaurants that you will find in Arizona.  Honey Bears cooks Tennessee style bbq which is a sweet/tangy flavor. I'd say that the highlights of the menu are the ribs and pulled pork sandwich.   Their meat choices are pork, beef, chicken, and hot links. They also have a couple side dishes that are worth trying, the \"cowbro beans\" and potato salad.  Honey Bear's gets five stars for cooking up some of the best bbq in Arizona at a reasonable price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K2tK3VYPGpsg7UQfOxmHXQ"
  },
  "Y3_tDKhweOfr7HaOAI3nbA": {
    "date": "7/13/2009",
    "text": "BBQ, a very unique experience, it is a truly American culinary art form that is diverse and has just as diverse group of passionate followers.  I would classify Honey Bears BBQ as awesome, in the wet BBQ mop using kind of BBQ.  If your perfect BBQ is a good dry rub BBQ brisket, or rack of ribs, you may want to skip.  However, if you are an individual who can enjoy the goodness of a pulled pork sandwich with a generous pool of their mostly sweet with a bit of spice/vinegar BBQ sauce, this could be your place.    I love Honey Bears, it reminds me of a BBQ stand at a country fair that didn't leave town when the fair moved on.  You walk right up to the window order your BBQ they give you a cup to fill with soda and a number that they will call out over a intercom.    It is not somewhere you take some one to \"wine and dine\" but it is a great place to grab a sandwich with a friend.  And do not skip out on the peach cobbler, very sweet and filled with tasty peaches you will not be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 27,
      "cool": 27
    },
    "photos": [],
    "user_id": "x9Qyooq3HkA29xeyEsPHGg"
  },
  "twlecYoAFqb0ImtMaKlppw": {
    "date": "12/26/2015",
    "text": "I've been slipping by here for over 25 year's .  l moved to LA 17 years ago .  brought the fam in today what a complete disappointment........ The hot links were boiled not grilled...... I asked why and the Asian lady said the grill wasn't on yet.  I asked why she didn't mention the fact the grill wasn't on when I ordered them she said she would check if the lady in back could warm them up, I exploded!!!! I asked if the place changed hand and she said NO....... In the past the boys bent over backwards to please. Not today, not one bro there.  I told her to take it back, no apologizing nothing....... I even left a 15% tip when I payed at the counter before I had to pick up my food.... Sad to say never again........ The bros should pay attention to this website as it would help their business greatly.  By the looks of it only the reviewers care.  The brisket  was great, half chicken was dry, corn mushy, and the ribs were good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "p-DzbYlnC0yFtpAIhqW7XA"
  },
  "KlfYWkdMmPxVK0SZbj41Rg": {
    "date": "2/4/2012",
    "text": "totally disappointed .. so sorry honey bear i was looking to build a brand new relationship with you but you feel totally short ... i ordered pork ribs (the only ribs they sell) ... tougher than I wished, not allot of TLC here.  I ordered hot links and was very disappointed .. hey everybody has their own idea of bbq so to his her own",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UKSlwNBrKoE7qxZnaOHwzA"
  },
  "f9oRFFgI3oY6oJvC8iRLpw": {
    "date": "6/14/2013",
    "text": "This place really needs an overhaul.  It really did not feel clean to me at all. Place was empty, but trash cans were overflowing and dirty.  The tables were not wiped off and there was meat on the floor.  With nothing going on in the place, why weren't the staff cleaning up?  The food was good, but with the way the place looks and feels, I wouldn't go back.  The owner needs to update this place, and soon!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YCFdSunEx4qc0PuNoqCABA"
  },
  "paCaHbUFOgP3qh-ZuapMkg": {
    "date": "4/24/2017",
    "text": "I had the need to feed 40 birthday party goers last weekend. I thought BBQ and then i thought Honey Bears. I gave them a call a week in advance with my menu selections and itinerary. I arranged to pick up the food at the VanBuren location at 3:00 on a Saturday afternoon, I arrived at 3:00 just as they were finishing packaging everything up for the ride. They were timely, the food was hot, the sides were perfect and the price was a value. The people at the party that knew Honey Bears were delighted those that didn't became fans that Saturday. My thanks to Mark and the staff at Honey Bears. They make feeding large groups cost effective and easy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zJoGZJe0CN8cHUTEIKOfzQ"
  },
  "_1vwvYtQDQVgSOJt1e0Xdw": {
    "date": "9/29/2015",
    "text": "First off I am extremely picky when it comes to bbq. So I always go into a new BBQ joint with high expectations. I came here with my boyfriend and he just ordered for us. A full rack of ribs, mac n cheese, collard greens, and corn bread. I picked up my first rib and the meat quite literally fell off the bone. It was juicy and exploded with flavor. Collared greens were cooked to perfection, and the mac n cheese was perfect. Oh then while I wasn't looking my boyfriend decided to order a piece of sweet potato pie...and I am so happy he did. I will definitely be coming back to try as many things on the menu as possible.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DJ0gYeNOd4XKs_5-kKi-CQ"
  },
  "LCXpvHTo-suJIo2cuQIDew": {
    "date": "5/24/2015",
    "text": "Decent food but the counter service sucks. The guy running the register seemed to have a chip on his shoulder and was irritated at every question I asked. When I drop over $40 for lunch , it would be nice to get a \"thank you\" or \"have a nice day\" but you'll get none of that here. I felt very unwelcome here so I will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Bn1wPC0CPTdL49kbpQxiA"
  },
  "Hzw52dtmzuYLkVa6mBBUIg": {
    "date": "4/2/2015",
    "text": "We've been here before and the food and service were very good. Today however was a very different story! The young guy taking our order seemed completely confused. We ordered 2 kid meals and 4 adult meals and he only charged us $13.95. When we tried to argue and pay the right amount he smiled and just acted like he didn't know what we were talking about. I hope to god that the owner wises up and fires this idiot. He's gotta be losing tons of money from this fool! On top of the idiotic service, the ribs were fatty and chewy, the collard greens never saw a ham bone and the corn on the cob tasted like last weeks reheated mess. Definitely don't recommend this place!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "WZpmqn0b3w8sgSSvhlWw0Q"
  },
  "RFPLK6HfK1IqmIdZdyn1gQ": {
    "date": "10/18/2013",
    "text": "The guy at the cashier was very chill and friendly.   We ordered the value meal with 3 pieces of ribs, pulled pork sandwich plus a side of mac  & cheese. The BBQ sauce was goood. The ribs were good too but I just hiked Squaw Peak for the first time when I went there so I was really really exhausted and hungry that I'd pretty much eat anything. So, I'm not sure. It's worth a try though!  By the way, thanks to Yelp we got $2 off! We also ordered peach cobbler and sweet potato pie for dessert, and they were delicious!  Will we visit again? For sure!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WInjZcz2TZqVa65W1GL8vw"
  },
  "CqKMRFlDZFXE5v18wkGjLw": {
    "date": "3/26/2017",
    "text": "This place use to be great. Not so much anymore. The lady that took our to go order was not pleasant. Probably won't return. They've changed the BBQ sauce. Who actually owns this place?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W2K1C1qoIkjWHPis_DDLdA"
  },
  "cjS38VTAwRXeAblEvLR7jw": {
    "date": "1/8/2014",
    "text": "Came here after finding a voucher on <a href=\"/redir?url=http%3A%2F%2FRestaurant.com&s=0aab4cbd731f3d3b0d1453050d3abc56a8c80bd214e25469c7555b750dca8a51\" target=\"_blank\" rel=\"nofollow\">Restaurant.com</a>.  Very happy with our meal.  Friendly, quick service.    I had the ribs and sandwich (chicken) combo with two sides (corn on the cob and mac n' cheese) and my husband had the three slider combo with a side of mac n' cheese.  All very tasty.  The gentleman behind the counter brought us some of their baked beans on the house and they were amazing.    We'll definitely have to come back as we didn't have room for dessert!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JNrFYVZ9kw0UPjFOdHPhXg"
  },
  "7W0UHp5BKxKQntzIDM-AKA": {
    "date": "3/28/2015",
    "text": "None of these negative reviews are valid whatsoever. The place is very clean, the staff is amazing, and the food is great. I got the beef brisket sandwich which is good, but these baked beans are AMAZING. I've eaten a lot of BBQ in my day and their beans blow other places out of the water (specifically rudys who claims to be the king of em).   The owner Mark and his staff are very generous and personal individuals which is another key reason I'll continue to come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FgW6gRheR34H4_RatIIzgg"
  },
  "OWFHlEnlqpicWU-SLcq1MQ": {
    "date": "1/19/2013",
    "text": "Sad I didn't try the ribs they looked really good. Instead I went with the pulled pork sandwich which was good but not worth the price.   Not too impressed and left feeling like I had paid too much for an alright lunch.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "BgXcJf0ctOX8O6LFgADTlg"
  },
  "FPdrE-qxl69fOMQuVu0Abw": {
    "date": "6/20/2015",
    "text": "Foods pretty good. Counter staff is horrible. We have been here 4 times in the last month and I am completely unsatisfied with the staff. The collard greens are very good. It would be nice if the staff matched the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HcyOYjI-CVAUhXdoJepoZw"
  },
  "tM7pjomyrQVHa0awxhavJg": {
    "date": "6/12/2013",
    "text": "I'm from Chicago and dying for some fantastic tasting ribs, other than those that I BBQ myself. Everyone pointed me to Honey Bear's BBQ.  The place is clean and casual, and the service is OK. But the ribs were horrible. The beer was fantastic though and I first thought maybe the alcohol had dulled my taste buds. I remember screaming, \"Either this is a poor cut of beef/pork or both animals had mad cow/pig disease!\"  I decided to return and give them another chance, and not order alcohol. I ordered the ribs and again, \"Mad Cow Disease!\"  I won't ever return. How does that go: \"First time shame on you, second time shame on me...\"",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rQSs8LNP-A4F_OggJieTdw"
  },
  "UMhqGRJ4xYJH2eTr5E4rVA": {
    "date": "1/18/2015",
    "text": "The food is very dry and the place is super dirty. Would not recommend. Never been to the one on Central Ave so cant speak to that one.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QYYx4_Ca2tUg0QFh7_rrRw"
  },
  "u0fdaY68_q-RLrFW24D0zQ": {
    "date": "6/8/2015",
    "text": "One star is generous. If you're looking for good bbq, go elsewhere. I'm a huge fan of brisket. I think it is the True high water mark of bbq. I ordered the brisket at this location. I'm not sure what came out.   I was given a half pound of mush, absolutely drenched in bbq sauce. Why put out bbq sauce if you're just gonna smother my order in it?  Brisket should be served in slices and BBQ sauce should be applied by the customer. There was not one discernible slice. It was like when you leave shredded wheat in the milk too long. Between that, the gallon of sauce, and the tremendous amount of grease, it was like a bowl of nasty soup.   While AZ isn't known for BBQ quite yet, avoid this place if you get the urge. Rudy's kills this place any day of the week.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NtObe1SaGVYa0UJT--pE7w"
  },
  "y-nMJwxiwxo1Wwvl1SYWzg": {
    "date": "10/6/2010",
    "text": "That's what I'm talkin' 'bout! This place is not fully hood, but it is close. They have a large selection to chose from, and I wasn't sure what to chose until I saw a nice value menu. I finally chose the three slider option - a pork, a chicken and a beef. A large pot of sauce on the table provided the right amount of sauce to be added to the sandwiches. I was surprised at how quickly the order was ready. My friend ordered and as she was getting her soda, her number was called.   The soda selection was another interesting feature. No Coke or Pepsi here - RC, Diet Rite, Big Red, Country Time, and Sunkist mark a few of the selections that do not appear on most restaurant menus. There is plenty of seating in the dining room.  A good selection of sides to chose from (I went with the potato salad).  The flavor of the meat was excellent and each slider was overstuffed. When you see the sandwich, you know you are going to wear it - which is another sign of a great BBQ establishment. You will need plenty of napkins with this one!   My first experience here will not be my last. This place has jumped near the top of my list of BBQ pursuits.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3xORNxbKdd08LUf0tclx3A"
  },
  "BNclrmKRr4D6ptC1OyuNTA": {
    "date": "6/26/2014",
    "text": "Let's be honest, when it comes to BBQ places that are decent, the valley is sorely lacking.  So, when I brought up the fact that I was having a serious itch for some Q, a coworker brought Honey Bear's up. Having not heard of it, I was in for it.  The establishment is a hole in the wall, butsome of the best BBQ I have ever had was in holes in the wall (i.e. Aurthur Bryant's in Kansas City). We got out of the car and were greeted by the pleasant smell of wood smoking meat, and it smelled awesome. I was super excited...until we stepped into the door.  The aroma went from pecan wood chips to backed up sewage. I kid you not it smelled like someone emptied their bowels in the middle of the lobby. People would come in and turn right back around and leave. But, my friend assured me this was the place to be so darn it, I was going to stick it out.  I got the BBQ chicken sandwich. The sauce had very little flavor to it but the meat was tender (there is your one star, the ability to not dry out chicken). I asked about what side the cashier would prefer and she just shrugged and said \"I guess the potato salad.\" As expected from the response, it was mediocre.  But that smell went back with me to the office where a coworker asked if I had been sitting in an alley with a drunk during lunch. I had to change my shirt but the smell was burned into my nostrils.  Never again...NEVER...AGAIN.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "HIKl1rTzrS5Pw-PLoUpvzQ"
  },
  "xwgHpMaJ96JWzWNFgyTqLg": {
    "date": "3/26/2015",
    "text": "Great food, typically nice BBQ style eatery.  Front counter guy was very nice & informative",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0S0J8w2LCPmjXF9WcK6fmQ"
  },
  "47rERsyiDb1roKyd_uoT5w": {
    "date": "5/28/2010",
    "text": "\"Put some south in yo mouth\" Boooyaaa~  Pretty darn good BBQ. I had the pulled pork sandwich, the meat was tender and I could really taste the hickory smoke. The sauce was thick and tangy (yes I went a little overboard with it). I got corn on the cob for the side and it was a little bland, as if it had been boiled too long. My friend opted for the catfish and I snuck a few bites, it was not over-breaded, just a thin light dusting and super juicy inside, next time I am going to order it. I had an ice tea and it was so strong I had to add water to it (which I love). Overall this was a great lunch and although I ate so much I almost put myself in a food coma I will definitely be back.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "sTcYq6goD1Fa2WS9MSkSvQ"
  },
  "ek5otr0FgxWGNkvvChbHTw": {
    "date": "4/9/2015",
    "text": "It was my first time at Honey Bears. I went for lunch, so it was around 12:00.  They welcomed me in with a huge smile. The staff was really cool and gave me some suggestions.  I ordered the one meat and two sides meal. I got the pulled pork, the coleslaw, and the mac and cheese. When my order was called, they also gave me free ribs because I was a first timer and they wanted to see me come back. I thought that was really nice of them. The food was sooooo good. If you love old-school, messy, lick your finger BBQ you must check this place out. I love that it's rustic and old too. A very rare sight in Phoenix these day. I will return.... many times.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jp-YcM1IIBLSZhy8TMHxQA"
  },
  "Es4sy5VxqhdwhGZsSHJdWw": {
    "date": "11/9/2016",
    "text": "Have been going to this restaurant and had it used for catering at parties in my home for 25 years always good food until today had my housekeeper pick up for four people when I got up from my nap I went to make my sandwich and it was all grizzle and fat it wasn't the pulled pork that soft you definitely needed teeth to eat their meat in fact I ended up giving it to my dog hopefully this was just an anomaly but it would be a while before I would go back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IlxwoTvLFYuq6q5olokD1Q"
  },
  "0jaO-2cWqTRzx3ney59rwg": {
    "date": "5/5/2014",
    "text": "The food wasn't very tasty. The bathrooms will make you leave and not even ask for your money back.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "IvxwSpRqtaVaJvQxRdV0Xw"
  },
  "_H3JgOepEttJKJuaz_oX_Q": {
    "date": "10/4/2016",
    "text": "This place has great BBQ, and the sides are great too. The wife and I come here just to eat sometimes all the way from Gilbert.  It's a 25 min drive, but it's worth it. The workers are nice too. Clean place. I highly recommend for good BBQ!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eOX4P4UgGjkzLjKedUp4Dg"
  },
  "hJ-nY2k2BEjp3SLRyMlUkg": {
    "date": "6/23/2014",
    "text": "Honey Bears BBQ is definitely worth checking out. What they lack in variety and options is made up in quality. The ribs were nice and the pork sandwich was tender. Unfortunately I will chose elsewhere next time for more options and a little more meat on the bones. Overall the food was good but nothing wow'd me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oEiGIb1gooGdgO-K9vS1sQ",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Ribs and pork sandwich with mac n cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oEiGIb1gooGdgO-K9vS1sQ/o.jpg"
      }
    ],
    "user_id": "kbEEABctxwzZuXusTppSaA"
  },
  "PKmFe5WSbfT_eHzYj4N6ng": {
    "date": "3/25/2014",
    "text": "While at the recent Chandler Beer and BBQ festival, I decided to give Honey Bears a try.  I had never been there before and have heard them mentioned as one of the great BBQ joints in the Phoenix area.   What a disappointment. The ribs we ordered were tough and gristly and tasted like they had been \"quick-cooked\". I've made and eaten enough ribs to know when a piece of meat has been rushed. My guess is they were scrambling to meet the high demand of the event and took some shortcuts. (It was later in the day) If thats the case I would say its a shame to sacrifice quality to make a buck.   With all the new BBQ places popping up in the Phoenix area, there's no room for the ones that compromise. Just my luck with 20+ BBQ booths to choose from at the festival I picked the one that obviously does.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "L83T2GEOmnynV6KafQbV6Q"
  },
  "eLctn0VoyXqEbalPrHxoFw": {
    "date": "8/5/2016",
    "text": "It's good if you need a quick fix, otherwise I would go elsewhere. The quality of the food is excellent, don't get me wrong (their ribs are my go-to), I'm just not a fan of their sauces. Their BBQ beans are a must however and the cornbread muffins are amazing when they're fresh!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pss82aEG-Vph5R0CKJJDLA"
  },
  "OyHopy6pLzt3HnmTvhPkFQ": {
    "date": "4/23/2013",
    "text": "CLASSIC BBQ JOINT !!!!!!  What a great place to get REAL BBQ !! The family owned and run aspect always appeals to me, and the casualness is pure downhome. This place reminds me of the authentic bbq joints in MPLS and St Paul MN, my hometown. The pulled pork sand was as good as any as I have ever had, and the sides were unique. Just eating something called \"CowBro Beans\" is an experience.  It maybe could be a little cleaner, but so could Famous Dave's. Worth the time and money. Don't miss out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WesvIcbn3HiBxiPMbWLTjA"
  },
  "KW4g2tpnV7JWrkkE_C_ASg": {
    "date": "9/1/2017",
    "text": "Completely disappointed, use to be the spot back in the day. Shade of its former self, THIS PLACE IS FOR THE WEAK FOLKS NOW!!! Don't waste your time. My guy got a 1/4 chicken combo and only got one small piece of chicken that barely had any meat on it. And correct me if I'm wrong but I thought that when you order a 1/4 chicken it comes with a wing, breast, and thigh. Well that's what it use to be but not anymore. It gets one star only because my chicken slider was okay, but my fries were hard and under cooked, plus the cook never changed his gloves. Yuck!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OiEKTTuSAkyDop6pr3IFUA"
  },
  "G87lTjhzVrv0zVnwhXT1pQ": {
    "date": "8/6/2016",
    "text": "Had the combo Meal #3 Sandwich & 2 Ribs, with the Beef Brisket sandwich, Cowbro' Beans & Mac and Cheese. Everything was terrific, the Mac & Cheese was just OK. The brisket & ribs were delicious, and the Cowbro' Beans were tasty too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CjvfNkOmYXcXNvbxTUkWaQ"
  },
  "io_i4nyrNbI-7LqSWjG2OQ": {
    "date": "3/25/2016",
    "text": "This is one of my favorite barbecue ever.  Such great memories are tied to honey bears.  We've eaten in, had carry out and have had them cater.  Their meat is always tender, the beans are just awesome , the sauce is amazing.  It's all just super damn good.  It's low key to eat in and they are always kind. Bring your appetite. I suggest the chicken or the pork sandwich.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iHWK6Q5YqecWvZrdh8BK_g"
  },
  "kM_DwSGlmIN3eYgV8rScXw": {
    "date": "7/19/2017",
    "text": "The place is not the most inviting. Very cafeteria like. The ribs were delicious. The cole slaw was very tasty. The cook was very kind and generous with the portion of ribs.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "78UXUEaiTDCoG_fG509Zmg"
  },
  "rSYKzmyNp2I-XI6ewR82MA": {
    "date": "8/8/2016",
    "text": "Darn good BBQ. Darn good price.  Good local joint to check out if you're in the neighborhood.  Pulled pork is to die for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pMSoGe-D4iiyeXeUstULxA"
  },
  "tWP_OZPktJ2FU1T8i4TM8g": {
    "date": "7/19/2017",
    "text": "They sold my bank card information. My wife and I dined in and were the only two there. The food was good. We paid with a debit card. 8 and 12 hours later two fraudulent charges appeared on our card. It was the only time we used the card that week. Clearly fraud from this establishment. AG has been contacted. AVOID!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uSD-VU0EmNSTLRCVIzXlYA"
  },
  "W946w2xBYztZuptbECmveg": {
    "date": "12/25/2015",
    "text": "Hole in the wall restaurant with excellent tasting food and great customer service (awesome owner at the Van Buren location). Recommend the peach cobbler, delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cPF7dcK44NJQgySdoIDHRg"
  },
  "9JdxFPX0D2GshcZpNmaWow": {
    "date": "6/3/2014",
    "text": "Have been going to this place/location for YEARS!! Needless to say, I wont be back to this establishment ever again, after I discovered a CLUMP of hair (view in photos at own risk) in my pulled pork. Highly disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rk0n3ZEJ72rVmZNziGN61A",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. Discovered this CLUMP of hair in my pulled pork.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rk0n3ZEJ72rVmZNziGN61A/o.jpg"
      }
    ],
    "user_id": "_Bixw71rWYfxo5Qqwt5WFw"
  },
  "GHcxKHYfNLIahjgC61uBRg": {
    "date": "6/30/2017",
    "text": "I'm writing this post to make sure no one wastes their lunch hour on this place. Although the BBQ is pretty good, it's not exceptional. After spending 20 minutes or so standing in line swatting away flies, there's a good chance that you'll get up to the front and realize that they are out of half of the options on the menu without warning. The location also leaves a lot to be desired. Highly recommend going to Hap's Pit BBQ right down the street instead.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3unmREbDmqe066iqlkgilg"
  },
  "holsu4cFdxttvyv_aIJMog": {
    "date": "9/2/2014",
    "text": "Been craving Honey Bears for a while now, finally drove up from Tucson and got my fix. My signature order is a pulled pork sandwich for any BBQ place I go. Honey Bear's did not disappoint, the pork was seasoned very well and was juicy. The sauce is more on the sweet side and not too thick. The mac n' cheese was very creamy and seasoned with pepper. I am a pepper person so I do not mind the little kick. Tried a rib and the small amount of meat that was on there came right off. Seasoned and cooked very well. I am not one to order ribs so I don't want to be too critical of them because they were very good, just thought they were a bit slim.   If you happen to catch a Cardinal's game in Glendale, Honey Bear's has a quick service stand INSIDE the stadium. Definitely a good game choice meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bu-m8xC4EUNdTLspx37D3w"
  },
  "CjohjyaaPYq6vxsOt_xDKw": {
    "date": "6/22/2017",
    "text": "This was the best BBQ in town and I can't say that anymore. The prices are a little high for a pork Sandwich beans and a drink 11.39$.  They got my order wrong which wasn't a major deal. No sweetener for the tea besides regular sugar. The quality of the food and sauce is good but there are now much better BBQ choices nearby.  They could make some improvements.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kFrCm1aeRCtHc9xmdjvKlg"
  },
  "VKYGZJ5XcVHF-GPFkI7Opw": {
    "date": "5/10/2011",
    "text": "I've been to the renowned \"Memphis in May BBQ Festival,\" but Honey Bear's pulled pork and BBQ sauce is as good as any I've ever tasted.   Since the owners of this place come from TN, I guess that shouldn't come as a surprise. The pulled pork sandwich is out of this world. Honey Bear's motto is, \"you don't need no teeth to eat our meat.\" And that's really True. It's slow-cooked, moist, and packed with flavor. The BBQ sauce is amazing. It's tangy and spicy, I'm thinking it might have a tomato and vinegar base, but I don't really know. My husband loves their hot links and spicy sausage. He's a rib guy too and says they're great.   Honey Bear's on Van Buren is a bit of a dive and it's located in a slightly dicey, but safe, location. I think the dumpy atmosphere adds to the down home feel of the place.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "SicCj8XW6jdIL1N0bocWOQ",
        "caption": "Photo of Honey Bear's BBQ - Phoenix, AZ, United States. OMG, the pulled pork sandwich.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SicCj8XW6jdIL1N0bocWOQ/o.jpg"
      }
    ],
    "user_id": "WBp6Mw23UeQjvkgb0FTIrg"
  },
  "ssec87hjekZ_Iwyfxbo4eQ": {
    "date": "3/30/2016",
    "text": "All the food was amazing - we made the mistake of ordering extra hot bbq sauce. It is no joke! it was delicious but had us all sweating and with runny noses. Ordered lunch for a group of 13. All the orders were correct. Love this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZMSslEx9VUX8t6jqsUyw-g"
  },
  "hH4HZVqsFJ3vrJXwHn7zXw": {
    "date": "5/7/2016",
    "text": "Absolutely loved it, the meat was tender, smokey, and the BBQ wasn't overwhelming so you can actually appreciate the flavors. Rib meat came off the bone with ease. Brisket was awesome and so was the pulled pork.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bmPLSGjkp9LJ7oSmD9fzPQ"
  },
  "bzJThYcvCnL8MYniKwMH1Q": {
    "date": "12/5/2015",
    "text": "I am a huge BBQ fan and this place did not disappoint! I have had BBQ at some legit places in Las Vegas (where I am from) but these guys are the best I have had in years! The meat is tender, the sauce is perfect, the sides are amazing, The staff was unique and the inside was cozy and inviting. If you want authentic Tennessee BBQ done right then this will hit the spot for you! I can't wait to visit you next time I come to Phoenix! Thank you for a very yummy experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "v281gE-nk3jozr_5hWFAug"
  }
}