{
  "LSUmbW7vMt59tZ3WyaSw-w": {
    "date": "4/3/2018",
    "text": "Took my husband out for his birthday and I chose Pitch. Glad I did.  Anna was our server and she was amazing. She was super nice, kind, patient, and even brought me iced tea to go at the end of our meal.  We had the VIP MAC & cheese, a yummy pizza (pear & goat cheese), Moscow mule, and berry cobbler for dessert.  It was all very good. I did feel it was a little overpriced, which is why I chose 4 stars instead of 5. However overall this experience was fantastic. Definitely a place you can host a party too - their patio is beautiful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3TKhPoJIUtTwIpdrPWYnJw"
  },
  "nAqsIHDB7BCJgi9TPYvxDg": {
    "date": "1/18/2018",
    "text": "A very solid 4 stars...probably more a 4.5.  Came here with a party of 4. Place is super cute but I feel like they did wayyy too much outdoor seating and not enough inside. Wonder if it will hurt business in the summer.   Amazing beer and cocktail menu. They had a great blueberry beer which was dynamite. Food menu has TONS of options.   We did the truffle fries and brussel sprouts. Both were raved about with the entire table.   I had the cheese pizza and it was overall pretty good but not great. Didnt have much taste so needed some salt, olive oil and red pepper. That got it going!   Cant wait to come back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "v3O6ka--Gus4FfJvk4tgeg"
  },
  "GHyBBIH58utSqwJm-OGn0A": {
    "date": "4/14/2018",
    "text": "Love this restaurant. We eaten there three different times and the food and service is always amazing! I would highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R6GPIy29nZQY5FcVEeY_Cw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/R6GPIy29nZQY5FcVEeY_Cw/o.jpg"
      }
    ],
    "user_id": "qIu94Rc0chy7uKeLmso55A"
  },
  "e_rkZPhwZ1TO-OBTWo8EcQ": {
    "date": "12/16/2017",
    "text": "Went here for dinner on Friday night as this new spot is right down the street from our house. There's something missing from the overall vibe of this place.. I can't quite put my finger on it but here's some pros and cons-  Pros- Service- you can tell they are trying reallllly hard to impress customers and deliver a good experience  Patio/ bar area- great place to sit and have a bottle of wine and app, can see this place getting busy during the spring for patio season.  Cons- Way over priced- I have a hard time paying 20 bucks for a pizza that's just \"ok\" when I can drive over to LGO and get one cheaper that's way better. Food- nothing on the menu we ate was stellar or even worth going back for. Very bland and just overall not good.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "_0UXptnf1DtCqqYByMBS0Q"
  },
  "K7NrLjk2QhndXWcicibItg": {
    "date": "2/17/2019",
    "text": "Tried Pitch for dinner last night while in Phoenix visiting my daughter. She has eaten there several times and always liked it. We ordered the peppadew appetizer, green salad and margarita pizza. At midnight, we both woke up with the worst food poisoning ever. It's 2 pm the following day and I'm still suffering from my meal at Pitch.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GRhIa3l45Zok42l29PFpxQ"
  },
  "77FHBBjJ9QOXGoazZ_IJVA": {
    "date": "11/17/2018",
    "text": "Well, we didn't get to try the food, so I can't discuss the quality. We came in around 3pm on Saturday (11/17) and was sat outside. We were the 4th table out of 20 outdoor tables. We sat for 10 minutes and no server greeting us. When one finally helped a table near, we asked if she was our server. She stated she \"could be\", I'll be back but never came back. Then after 15 minutes with no greeting, no water served, the hostess came out and informed us they had a reservation at 445 and we will have to move if we plan on being here this late. I replied that we would be gone way before that if someone served us and asked if he would take our order. He stated that he would get our waitress. We waited another 5 minutes and left. They didn't seemed to be short staffed nor busy. Menu looked awesome but can't comment on quality. Will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LBKXddhKGF6kCj6KBKJuSg"
  },
  "UxycKp-q5d2kipTE5zQFBw": {
    "date": "4/4/2018",
    "text": "Great Marsala Pizza and Tagliatelle. Calamari had too much breading. We sat outside and the ambiance was lovely.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u36_BJmdckN99csWM_YvJQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u36_BJmdckN99csWM_YvJQ/o.jpg"
      }
    ],
    "user_id": "6v-ZSHC7yyC1PQoF9ZuS4Q"
  },
  "c1YCLK-D1w_ZwDgWxLPHPA": {
    "date": "12/15/2017",
    "text": "Food was good, atmosphere was great, why is a pizza that barely feeds 2 $19?  Maybe I'm not refined enough? My opinion LGO Wins on food, price and atmosphere is a tie.  Someone please explain why $19 pizza!!!!!!' Seriously. I don't get it. Pitch Management please message me, love your location and concept.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "5X7syimE5Z0UPr6WA73qJw"
  },
  "5xVDyHiBEK2gVOc_G1EYCQ": {
    "date": "6/6/2018",
    "text": "Brian Bailer Owner/Manager is totally defensive to constructive information from a customer. His motto...\"the customer is always wrong.\"  Thank God their chef is good. Food is secondary to being treated like a gentleman or a lady. Calling a customer a LIAR when they simply explained that the entrees were delivered 10 minutes apart is simply rude.   Prediction - Brian's partner will buy him out before Brian runs the restaurant into the ground.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "mQl6JaSkPZ37jSHaACY9rA"
  },
  "ZbBkvGHx59Y3oBYZm380GA": {
    "date": "10/16/2018",
    "text": "Pitch is a great restaurant with delicious food and excellent service!! The waiter did a great job helping us decipher the menu as it's a little long. I recommend the cauliflower and Brussel sprouts for and appetizer and of course the pizza is out of this world!! Great location and easy parking. Also the outdoor area for drinks and pizza is welcoming.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6HWVcpxjdq5C5p5MjVXJLw"
  },
  "WQoJKsQNEF08tUXUW1B85Q": {
    "date": "12/9/2017",
    "text": "I like that we have a new spot within a short bike ride for us. I assumed it was another sports bar with a name like Pitch. But they have a full service menu and wine list. It's cozy hipster dark inside. Modern rustic....the garage doors at the bar are always nice so you feel like you're outside even when you're not. Speaking of....they have a great looking patio. Dog friendly. We ordered a Shroom pizza. It was plenty large enough for two people. It came super loaded with flavorful, earthy mushrooms. The crust was thin and crispy. It was super tasty.  There are numerous menu items....from apps and pizza to burgers and seafood entrees. A handful of vegetarian options are scattered throughout. But our server said some meat heavy options could be modified. Our server was really attentive and informative, considering this to be our first visit. I'm not a great writer so I'll close by saying we really enjoyed this place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "G-_KF_Ul4d3WGEa-G0Iq4g"
  },
  "0qquYcLECDf90MymAIeDFw": {
    "date": "12/2/2017",
    "text": "I was really excited to try this place and I'm looking forward to another try to see if the service will be more consistent, and to try other items on the intriguing menu. The servers other than the PHENOMAL Cooper, the up and coming Brianna and Miguel really need a lot of training. This includes the hostess and even one of the managers.   The good: decor and atmosphere. Probably the best patio atmosphere I've come across. The menu variety is great. I tried an appetizer combo of roasted Brussels sprouts and creamy cauliflower. The veggies were not great, but the sauces were fantastic. Others in my party loved the crab cakes, the cheeseburger and the onion rings.   The bad: The service, aside from the three superstars mentioned above. A craft cocktail tasted like there was either no or barely any alcohol. I took a few sips and asked the waitress if I could exchange it for a glass of wine. She said she would talk to the manager and brought me the wine. When the bill came, both drinks were on there! When I asked about this, she said the manager said I would have to pay for the drink I didn't like. I asked to speak to the manager, and his response was that it would still cost the restaurant so they had to charge me. He insisted I drank way more than I did. My friend who sat next to me verified I took a few sips and he relented. That's a manager who is pretty short sighted over what would probably cost them about $2.   About half of our party had Cooper and their food came out much faster than everyone else's. She had great answers to first timer's questions. Just a night and day experience from the other half of us. Soup, which is obviously ready to serve took a good 20 minutes to come out, and just 2 minutes before entrees.  Some of us stayed after dinner and split a bottle of wine and had great service from Brianna and Miguel. They are new servers but they understand how to give customers a great experience.  I hope to revise my rating to 5 stars after another visit because the potential for this place is great. If they are willing to listen to feedback they should be very successful.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "aSS48nGcfROR1ko36IvLjA"
  },
  "zzgiPPMTjl4WDGbvAEWygA": {
    "date": "6/8/2018",
    "text": "Pitch is located in a great location and has a nice open layout that looks inviting.  In practice it doesn't work out so well most times of the year in a place like Arizona...either far too hot or cold.  To start with there is entirely too much staff.  Falling over one another.    Each time we get the server spiel of the specials.  There are so many that I stop listening after the 3rd one.  No one wants to hear 6 specials....how is that 'special'?    The food is OK.  Nothing special, nothing awful.  The only food quality complaint was a soggy pizza which seemed to be from toppings that probably weren't dried after rinsing prior to being placed on the pizza.  The showstopper problem for us is that the food is delivered at random.  We were told it would be delivered when ready, but it's a bit ridiculous when 4 of us ordered a pasta dish and 2 pizzas which were delivered one at a time and only after the previous was consumed.  It took nearly an hour to get all of our food.    It was this way each time we've tried Pitch.  There either isn't an expediter or anyone in charge of the kitchen.  Each time the waitress disappeared after the order was taken.  And each time the manager came to applogize that they were training new people.  2 of 3 times we we're given coupons for breakfast or lunch.  I was out of town and left my easy going septugenarian parents with the coupons.  When I returned, my mother asked what I was thinking sending her there.  She described the omlete as something that tasted like it was cooked the night before, frozen and thawed out by running it through a dishwasher.  It was so off putting she called upon returning home to let the manager know of the quality of what is being delivered to the customers.  The manager told her she didn't know what she was talking about and hung up on her.  My family had been in the restaurant and catering business for a combined 110+ years serving high end clientielle.  We know our craft and rarely complain.    We just vote with our pocketbooks.    Pitch has a chance to turn it around, there is a good core. However, I think this place will be mismanaged out of business.  There is a ton of competition in South Scottsdale and near by Phoenix.  Nearly all are better bang for your buck.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "VZXu0mChswR7ApEx0KDqkQ"
  },
  "0ty0s_azIRLncpzdvLLqbw": {
    "date": "11/13/2017",
    "text": "Experience started out weird. I walked in looking to have lunch, and the hostess just stared at me until I asked where I could sit. Not the best first impression.   After that, sad to say it didn't get better. The pizza is subpar. I ordered a Margherita pizza, which should have lots of flavor, but the only thing I could taste was the basil. Bland, flavorless sauce, and the crust was overly dense to the point where it almost felt stale. My brother asked the bartender what the restaurant's specialty was, and he just said, \"All of it, everything on the menu is the best.\" No. Wrong. Is that really how the staff has been trained to answer a question like that? First, it offers no guidance whatsoever on what to order. Second, a specialty cannot be \"everything.\" If that's the real answer, it's a bad one, considering the pizza was so underwhelming. If nothing is more special than that, I have no reason or desire to go back. There are other places in the area doing similar food much better.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 11,
      "cool": 4
    },
    "photos": [],
    "user_id": "YLNSQ72T6-H-hL9H7Iqo2g"
  },
  "SN6iEja_Yy_nB23aq6qo-w": {
    "date": "9/28/2018",
    "text": "Overall a good experience. A bit pricey at $25 for the weekly special pizza which just enough for three people to share. The patio is dog friendly which makes it that much more appealing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FwogOcrMWhQge-14TozK6Q"
  },
  "zCNgSwX-3XkaK44P4O9_yQ": {
    "date": "4/6/2019",
    "text": "On a Saturday afternoon after lunch with the inside of the restaurant empty they couldn't serve our party of 4 food at the same time. The first meal came out approx 7 mins before the others. The reason given...they don't use heat lamps. When the other 3 came out the egg (ordered on the side) was cold. Average burger but cost $15. Soda served by the can.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D-EifcutvjbDm1v-GzRQmg"
  },
  "RVSsqCimY6dL-_jjoimnkQ": {
    "date": "11/2/2018",
    "text": "Great ambiance here. Loved the patio dining area.  The only problem was we ordered our entrees and my gf's entree came out 15min before mine... the server told me the kitchen burnt my chicken and I would have to wait a while for a new entree. I was a little disappointed that we couldn't enjoy our meals together and even more disappointed that the server didn't at least comp us a drink or something for the mishap (she was great overall though). We will probably give this place another chance, just a little displeased tonight.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bIMibn-BwuC6LAcEE_6wSg"
  },
  "rnm0Pf85wY3HQv26naPfCg": {
    "date": "1/21/2018",
    "text": "Pizza was TERRIFIC! And 1/2 price bottles of wine on Sun, Mon, Tues, and HH?! Awesome!! Next we'll dine in and check out the variety of salads too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bDsAF4zw7Lslk4N6BkILbw"
  },
  "TE6NxjbQSU27m_mjeYkM7Q": {
    "date": "8/12/2018",
    "text": "We ate here last night for the first time with another couple, it's sooo cute and the food is really good. They had a special for a bottle of wine and pizza for $40 so we did that and shared the pizza as an app. We ordered a few other things that were amazing... rigatoni scampi and truffle fries sooo good. Def will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KovT6k5cONbg3_7Am7Nt1g"
  },
  "S8Vosco1U-_p5FCJ-vh9VA": {
    "date": "9/13/2018",
    "text": "My friend and I went here for dinner and it was an awesome place! We had the Thai pizza and brussel sprouts and they both were excellent! Our server was very attentive as well. We will definitely be back to enjoy their outdoor patio in the near future!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PrBXlXi6l200Bx58kMu1cw"
  },
  "3O8Z2t947zMdH-68-Jo9xg": {
    "date": "4/20/2018",
    "text": "Tried out this place a couple weeks ago and we really enjoyed it. They have a huge patio which is great when the weather is perfect, or after dinner to have a casual cocktail on the couches. Our server was very attentive and made some great recommendations. I ordered the MIA pizza and it was very delicious. Cocktails and wine were also good. The only slight drawback is that this place is pretty \"trendy\" and loud, so not very romantic. Tables are pretty close together also. Not a huge deal, just thought it was worth mentioning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ruy1B3REORvVyqOuTQailQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ruy1B3REORvVyqOuTQailQ/o.jpg"
      }
    ],
    "user_id": "QGX5wOzqUxnfd8sePiNQWA"
  },
  "MUl0Jtn9SIrrPndzdJCnCQ": {
    "date": "11/2/2018",
    "text": "Welcomed to an inviting atmosphere where the bartenders were eager to share samples of whiskey and bourbon. Needless to say my experience was Pitch perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jePKlpVAUz-TbQXjxvF1Dg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jePKlpVAUz-TbQXjxvF1Dg/o.jpg"
      }
    ],
    "user_id": "TltNQT8XbwHQF1YX7sCxwA"
  },
  "6o0_c38pg25kP_aRtJLwkg": {
    "date": "4/16/2018",
    "text": "Good place to go chill, drink and eat! There is a great outdoor space, and there is outdoor bar space as well, which I love. Been there a couple of times now and the service has been good both times. We were in a group last time and took a long time to make decisions etc, and never felt rushed. Decent beer selection and some interesting cocktails along with some good classics. Haven't tried any of their wines.  The menu is varied but everything has been good. The mix and match starters are the best part! The cauliflower and brussels sprouts are a must try. The pizzas are tasty with some interesting combos. In summary, definitely a fun place to hang with some friends!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R0vqk_oTLYyEc20z5c_idQ"
  },
  "AmPe3VHii_-0ALSce5rRwA": {
    "date": "6/8/2019",
    "text": "Had a few issues but manager doesn't seem to care and has an attitude issue.   Food was ok but expensive.  All food didn't come out at same time like we asked.   We were waiting and asked if they had any bread to serve but they didn't have any.  We ordered pasta dishes that were good but it wouldn't hurt to give people some bread while waiting for their entree.  I probably wouldn't go back    Too many other restaurants to go to where owners care and have a better attitude.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "AORIqT_r-3vsc6_DWRLAfg"
  },
  "lEHAZQqeoTrCDM08d8_1kw": {
    "date": "6/7/2019",
    "text": "Won't go back. Staff just plain rude.  About 7 customers in whole place. Bartender aloof just took drink order. Only one other person at bar. He just stood there looking bored.  Asked for check and I told him \" we won't be back, drinks aren't good\" No questions or apologies.  Nodded to another man who came over, Manager? I explained my complaint and he also didn't ask why I was dissatisfied and said That's ok we only want nice people in here\" Went back to sitting at end of bar and waved goodbye to me!  Dismissing us!  Folks there are too many places in Scottsdale, especially in summer, to go to this kind of place.  Spend your money at a place that appreciates you being there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "iLB0kOGBUfFw0RTRYzCwSw"
  },
  "G8fJ-LpcYpaIhPpX5Fn6dw": {
    "date": "4/9/2019",
    "text": "I absolutely love this place! Love coming here for happy hour with girlfriends and sitting on the covered patio. Drinks are always refreshing and the short rib nachos are always on point. I always ask for Taylor to serve us. She's fast efficient and has an amazing personality. She always has the table laughing and drinks are never empty. I highly recommend giving this place a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wit5qKGWIPnH3txu6f272w"
  },
  "0ZLSefgOmApUOaQs_n8tkQ": {
    "date": "4/4/2019",
    "text": "Hands down the best restaurant in Phoenix. Service food and ambiance. So so so love. Come at Lear once a week. Sometime 4. Lol. Oh n cocktails r AWESOME too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D1IbBfoHTukyHwUYDk5tCQ"
  },
  "EJojaygDlkLVcRdymX5JIA": {
    "date": "8/8/2018",
    "text": "I absolutely loved the food, but the waitress was not friendly. She seemed like she hated her job.   I ordered the shrimp scampi and truffle fries. I loved the shrimp scampi, but my waitress forgot to bring my truffle fries until I reminded her when I was done with my dish. She didn't apologize or give a deal on the truffle fries.   What kind of service is that? Not sure if this will be a place I will eat at in the future.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "q9sq_-7drP5vJNt3EMtgKQ"
  },
  "scTWRfinD0saBiTvpHV0mQ": {
    "date": "11/2/2018",
    "text": "Pitch is a nice, new place to grab a drink and eats. We enjoyed a nice coffee and the cheese plate. The patio is awesome. It would make a great place to meet a large group of friends and do some laughing. The drip coffee was super good. The chai tea latte was actually incredible. The premises were clean, well-lit with maintained restrooms. The waitress was a little distracted, not super engaging but it might have just been an off night for her.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0UhnO9qD2C7j_42RxqTeNQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0UhnO9qD2C7j_42RxqTeNQ/o.jpg"
      },
      {
        "img_id": "lW_jDA7ELE3VV9RuC_HoBg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lW_jDA7ELE3VV9RuC_HoBg/o.jpg"
      }
    ],
    "user_id": "lK8p8nO9tpB6Ashxu1QPVQ"
  },
  "-CnKXHfmovUHLFOys0EW_Q": {
    "date": "1/10/2018",
    "text": "Great for groups, not great for date night.   We were excited to check out this new restaurant in our hood, got a babysitter and did a date night here. I'll start with the positives and work down from there...  ATMOSPHERE: the view is great. Classy and contemporary decor. Mostly patio, which was chilly despite heaters (and asking for them to be turned on) on a January evening. Tables are mostly huge tables therefore not very intimate. We sat at a hightop that was cold and hard and could've fit 12.   FOOD: was good, but not like $22 a pizza good. We got the $19 tres peps and it was basically a pepperoni pizza with a cold jar of pepperonichinis and jalapenos on top. Like, the toppings were not baked in. Oh also served on a plastic plate. In my opinion Phoenix is a pizza Mecca, and you can just find better pizza elsewhere for cheaper. I wouldn't say it was bad, just unimpressive, especially given the price or that it's in an obscure location.    SERVICE: now, this place is new so I'll give em grace for still working out the kinks. Our waiter was awkward and clearly upselling everything and talked to us for far too long about cars (we aren't car people). They have daily specials which took way too long to explain. This would've gone over better on a paper menu. The manager came to check on us once and got way too close for comfort and touched me while I was eating which wAs weird (I know I'm not a dog but who likes that??).   Overall, I'm not dying to return given its expensive, quirky service, and uncomfortable seating. If my boss insisted on going her I would play along, at least the food isn't terrible.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "0jRcmkgwrjsPtDOeqLJweg"
  },
  "EvwZmWrbw9V1oOM11X7B8A": {
    "date": "3/4/2019",
    "text": "The ambiance was great. The service was good. YET- I got sick off of a burger eaten at the restaurant. Terribly sick, a full day of yuckiness. I know it was the burger, in hindsight, mainly because it had a smell and taste that was different, not so fresh, while it did look good when it arrived. It was something recommended by the staff as being known to be really good, that and the pizzas... On another note, the artichoke was good!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XqHSvZl8eqM-oG9NCcurRw"
  },
  "KaGw1BdWjuPAzLSw_W0Gew": {
    "date": "10/20/2018",
    "text": "The tempura buffalo cauliflower is my favorite! The onion rings are also giant and deliciously crunchy with a good spicy aioli. The pizza crust is also the best, flown in from Italy! Favorite pizza is the MIA with the fennel sausage is so yummy thanks pitch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Hg1FuNVdy0DpB_xxMZ9hiQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hg1FuNVdy0DpB_xxMZ9hiQ/o.jpg"
      },
      {
        "img_id": "tfTv0myHjqMhP8Ddlmb4oA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tfTv0myHjqMhP8Ddlmb4oA/o.jpg"
      }
    ],
    "user_id": "UyafPyQXTrpivdmM2NuEBw"
  },
  "8xTAVnT6V3pVhMUuJvWIbA": {
    "date": "7/6/2019",
    "text": "The kids menu is $13 for french fries and three small chicken tenders. Not worth the price and the most outrageously expensive kids menu that I have ever seen.. My salad was very good though. Just not a good place to bring kids.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oz81cXIVQpGW1AtIgYFwLA"
  },
  "OG0kumUH-WXFv-s2r2BuQQ": {
    "date": "3/3/2018",
    "text": "Been here twice now, once when they first opened and then a couple of months after. They really worked out the issues from my first visit, I would've given them two stars because I felt the food was unimpressive and inedible but the service was good.   Tried it again because of the awesome dog friendly patio. I was pleasantly surprised this go around. The service again was awesome, very friendly staff and attentive. On this visit I tried the calamari appetizer, along with the Margherita pizza. I'm pretty elitist about Margherita pizza. I must say their Margherita pizza is the second best I've tried in the area (second to LGO). I will definitely be returning now because of the awesome patio and the food, I'm glad they worked the issues out from when they first opened.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zcp389V72h0DKl69X72wKQ"
  },
  "d416ohWuPMy1koYYUeRoCg": {
    "date": "12/8/2017",
    "text": "I'm excited that a restaurant has decided to occupy the Quad off of Thomas.  It's a welcome addition to the neighborhood.  There are several issues, however, that need to be ironed out if it expects to have any staying power.  Among them:  - Pretty awkward layout.  You will circle the building before you realize that you have to walk through the patio to get to a table.   - Pretty dismissive and unhelpful staff.  The process for ordering takeout, for example, is a haphazard affair.  Hopefully this gets ironed out over time. - Pizza was beyond average.  The crust was dense and hard and the pancetta was the saltiest I've ever experienced.  There are too many better options in the area.  We'll be back to try a few more things on the menu and give the place another shot.  Hopefully my experience was the exception.  It would be nice to have a regular neighborhood spot but there are far too many options in the area to tolerate average.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 3
    },
    "photos": [],
    "user_id": "SCo1UBoeN3bhRMkSYuiX1A"
  },
  "grfyOhyGk4sWqDBkLxtpMw": {
    "date": "7/8/2019",
    "text": "Great All-American Menu.  Great Wine List, Beer list, Burgers, Pizza, Salads, Pasta, Salads, Starters.  Ordered Buffalo Cauliflower (new hipster must) , Cheeseburger (hand grind meat) and Meatballs with a salad.  Everything excellent and cant wait to try other items.  Service was perfect.  What a Gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WYj33ck35zd0etO9Obabeg"
  },
  "0-iNstHNH54khJtpZRdA1A": {
    "date": "3/24/2019",
    "text": "This place is a hidden GEM! The food is unbelievable! I get the Abierto every time. The mules are really good too. Good atmosphere. Also... you know when restaurants bring you a fruit cup for a side... it's usually room temperature and full of melons? Not Pitch! Cold fruit with berries, pineapples, etc! Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ikOdDY6gqZ-6RhzH57jhLA"
  },
  "jUJDiK_sXsfgMbxWRcE_Tw": {
    "date": "12/6/2017",
    "text": "Finally have a good food spot on our little stretch of road. It's all fast food and one awesome Thai spot, after reading the reviews for The Porch over on Indian School that is also new I feel super lucky to have Pitch a couple blocks up!   Been here twice and tried two different pies, both good the Mia with mixed olives for the win though. Meatballs were good. Alfredo tortellini on point. Sliders were yummy but messy because of the sauce art but you can wash your hands. Cocktails are on point as well, wish the happy hour was 30-60 minutes longer but whatever. Tad pricy but no worse than other spots in Scottsdale and better than a decent amount to be fair.   All in all, happy camper.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bpl4XQkhiTXjxVTDP9U71Q",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bpl4XQkhiTXjxVTDP9U71Q/o.jpg"
      },
      {
        "img_id": "GbxAVJfWHIukUUYRgeGOdg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GbxAVJfWHIukUUYRgeGOdg/o.jpg"
      }
    ],
    "user_id": "1tRxOlhiEZ6lTNb6oxazTw"
  },
  "93SHXeHqjXukZcLNRacAkA": {
    "date": "7/5/2018",
    "text": "Love this new neighborhood spot. I've been several times and the food is very consistent. Have done breakfast lunch brunch and dinner !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9h_MiBi9M215oiZdlsIoUQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9h_MiBi9M215oiZdlsIoUQ/o.jpg"
      }
    ],
    "user_id": "RcAQWDyYI5VUxovd9RMzhw"
  },
  "A_FZea-eI8lYU1TzuEn6yw": {
    "date": "8/15/2018",
    "text": "Our pasta (Scampi Rigatoni) & appetitzer (Calamari) portion sizes were Phenomenal, large and fitting for 2. Amazing service! Amazing food! Price point was worth every bit for the amount of food you are served...even the appetitzer (Calamari) was so filling and fulfilling. Very happy with our experience and we will be back again soon! Also, the property, patio and scenery are both gorgeous as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U9QeGUSeZSOjiJah8laQRw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/U9QeGUSeZSOjiJah8laQRw/o.jpg"
      },
      {
        "img_id": "-bZbq1967KmHC7BIPoPPOg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Crispy Calamari",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-bZbq1967KmHC7BIPoPPOg/o.jpg"
      },
      {
        "img_id": "fwfrUw__4_2-vvixi7delg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Scampi Rigatoni (Sub Chicken)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fwfrUw__4_2-vvixi7delg/o.jpg"
      }
    ],
    "user_id": "-ArFk24i3tBeFHYRXHjamg"
  },
  "nsBuGwHWwW-rWMmxtap65Q": {
    "date": "3/5/2018",
    "text": "Finally a great new local restaurant near my house. It is located in an office complex that was recently remodeled. The food here is great and I loved the beer selection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qLTcZUkd-kiS1KWKRFkxw"
  },
  "IDOtNhiV1lh1vuA_eiTtxA": {
    "date": "2/13/2018",
    "text": "Great vibe. Super set up. Great indoor and outdoor seating. A full bar and we had an outstanding Pitch Cabernet. Dean the man in charge oversaw our perfect evening in this new restaurant. Our server Cooper made it all happen. Terrific artichoke appetizer and a beautiful beet salad got us started. The Salmon rocked and there was zero left over chocolate cake. We will definitely be back with friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nb4YVMTlKg1XE2A9iQmVTg"
  },
  "AZj6QfkN6Ud8SYg2g4miNA": {
    "date": "11/9/2017",
    "text": "Great location in the newly opened Quad office park. Good selection of beers and great vibes. The calamari was good, and loved the pepperoncinis on top. I'm excited to have a spot to go to after work for happy hour. My one negative, is they are anti ranch dressing, to the point that you wonder if the owner had a bad experience with ranch in the past. The Joe Rogan - Joey Diaz video perfectly explains it. <a href=\"/redir?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DtXwakHd0UU0&s=7a263c181bd8062482beb13f76f37618106768517c38d0429fc4e831d2c83bf0\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=tXwa...</a>. As a ranch guy, I won't give 5 starts until we get some ranch up in there. This is operation ranch dressing.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aGikeZbox-uWUDQ7WNvSXA"
  },
  "btpDVZn24LZVg3OpRHS9xw": {
    "date": "11/6/2017",
    "text": "My wife and I came last Friday for the soft opening with two friends. Love the layout, decor and patio! Service was on point and food amazing. We had their wings with Mac and Chz to start. We did a few pizzas to share for dinner. The pizza was large enough for two but if you want to take some home order for each person. My favorite was the Tres Peps. My buddy and I got the grand booker, if your a whiskey drinker I highly recommend it! We will most certainly be back. Welcome to the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "won0LrouVC01PAiwtrhpdA"
  },
  "NmNOoj6YYwuIz9HPAPxiGg": {
    "date": "3/17/2018",
    "text": "Staff was nice but food was mediocre and it was overpriced for a lunch meal.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wjNMQqz0wH5C7LOVyYCGxA"
  },
  "KEBHNe2VI67VtEvJsxdr9A": {
    "date": "11/8/2017",
    "text": "Came to the soft opening this past Friday. Loved the atmosphere, the food was delicious ordered the VIP Mac and cheese, truffle fries and margherita  pizza. All were delicious had to take it home and ate it the next day and still tasted great! Also came back for the grand opening and had lunch. I ordered the mixed green salad and it was delicious and of course the margherita pizza! Will be coming here like a regular! Welcome to AZ!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3U4ApefTdjbTv0R17Z3XgQ"
  },
  "-UCPq83vNant4b0yp8BBrg": {
    "date": "5/7/2018",
    "text": "Very cool atmosphere and setting; menu had some intriguing options. However, the biscuits and gravy were highly disappointing; gravy was very runny; dish was luke warm. Friend's salad was soggy from too much dressing; lacked flavor and disappointing as well. Bartender was all over the place. Took our order, came back and asked if she took our order, 40 minutes later I asked someone else working at the bar if our food was on  the way, 10 minutes later they show up with 2 of our dishes but our pizza was still missing. Told the bartender to forget about the pizza, minutes later the manager shows up with the pizza and we tell him as well that we don't want it anymore because we are ready to leave at this point. He proceeds to say \"it's only been 16 minutes\" (so now they're arguing with customers?) Sigh.....at least they tried to make things right by taking off a round of drinks and gave us a few gift cards. I would give this place another chance if the food was good but when both service and food are terrible, I definitely won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1jWQpfE39TjuTpu5qWBgw"
  },
  "TybQLN6glRjuR6dYuCcj1A": {
    "date": "2/13/2018",
    "text": "I live very close to Pitch and when I saw that it was opening I knew I had to give it a try.The entrance is located by walking thru the outside seating area.We were greeted with smiles and given choices as to where we could sit. I have been there 4 times now with my first visit being my Birthday. My birthday celebration was with 8 family members on a Sunday (early evening) and we sat outside. We have 2 young kids who loved being able to get up from table and play corn hole located right next to outdoor seating. For my birthday we started off with drinks from their extensive drink list.We ordered San Tan Hefervizen Beer,couple of Pitch mules and a 1/2 price bottle of wine.All delish.For starters we had artichokes,beet salad, wedge salad and meatballs. All delish.We then had a couple of pizzas and burgers.Again delish.We shared and everybody loved everything.They gave me a fantastic tiramisu on the house with a candle for my birthday dessert.I have been back several times and have enjoyed their HH both inside and out.Had the hot wings,mashed cauliflower and roasted Brussels sprouts.We will keep trying new items but I must say the meatballs are the bomb !! I love this place and will continue to recommend to family and friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIvgScO95FhDn3turSz9eA"
  },
  "Bh_sALnxy_RiprwQgYbXyA": {
    "date": "2/27/2018",
    "text": "This is a tough one for me, Pitch is very nice-looking new restaurant/bar. I like the modern touches and nice lighting. I would give Pitch higher starts but my meal was pretty bad. I was with a group of 8, our waiter was slow to get our drink orders but no biggie. My friends ordered salads, arugula, roasted beet, iceberg wedge, one ordered fries and cauliflower. I decided to go big and order the crab cakes. What a mistake. The salads came out and they looked beautiful! I had immediate regret with my order. My crab cakes (2 of them) were delivered, they were burnt on one side and were sitting atop a mound of lukewarm mealy mushroom risotto and around the plate was a strange orange sauce that unfortunately tasted like Velveeta that immediately congealed and developed a skin. Very disappointing. I should have stuck with a $13 great salad instead of very disappointing $25 crab cakes. Order anything else, but not the crab cakes. Otherwise we had a good time, very good wine prices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hy65a_tZDpJcADr4t5AbEA"
  },
  "ZXW4AxL1tJhjM4xUkQAqpQ": {
    "date": "11/15/2017",
    "text": "Atmosphere and patio are great, but food was just okay.  Also very pricey for pizza.  Seems like the place is a little confused if they are a fancy place or a casual pizza/beer place with TVs.  Also, no ranch???  The heck?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tm6yH-OJA3f0HmVMeJdylw"
  },
  "1k5mm6-cuoA03VsagjE9oA": {
    "date": "12/6/2017",
    "text": "Wow! What an amazing place. Slightly tucked into a business plaza, but with an amazing ambiance. Beautiful interior and exterior. All the staff was friendly and informative. Our server, Miguel, was extremely friendly with a wonderful smile and had a great knowledge of the specials they were offering. The food was by far the best part though. I got a Pork Belly Sandwich and my friend got the Basil Pesto Chicken Pie. My Pork Belly Sandwich was perfectly cooked and seasoned with two eggs on top and a delicious pickled cabbage underneath. My friends Pizza tasted amazing (I stole a bite or two). The crust was probably the best I've ever had. If you are looking for great food and an extremely friendly ambiance, this is definitely the place for you. I would give it 10 stars if I could. It's hard to find good food with a friendly atmosphere. Thank you Pitch for the great food and the wonderful staff you've hired. Will definitely be back for more yummy food!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vx-yKyRz9oTfBroUUPYFYQ"
  },
  "QB4SURKPx9FgJKdmp0ygmw": {
    "date": "1/20/2018",
    "text": "Showed up for brunch this morning with a group of 8 and got seated right away. Staff is very attentive. Bloody Mary's are amazing! Had the corn beef hash which was out of this world. The rest of my group had everything from pizza to salad and breakfast burritos and were happy with every selection.  Highly recommend giving Pitch a try. I will be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GnqvQZQt-DWCFdpL_O-J8A"
  },
  "TreNLWYl1M6juogwqLelsg": {
    "date": "1/8/2018",
    "text": "We went there Sat night for the first time, and really liked it. Both my husband and I loved the pizza, and my husband is very picky about pizza. He also ordered the pork chop. The ambiance was great, loved the patio. The service was slow. Took 5-10 min for our server to greet us. Took another 10 min to get our first drink, which 20 min seems excessive to wait for a drink from seating. Had to flag down our waitress to take our food order 15 min later. Just assuming they're still working out their service kinks. But we would totally go again...and soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nnagN-m8kL2O-jDCnypexg"
  },
  "WmRBNHyJq2vzWxvj8TC71A": {
    "date": "12/23/2017",
    "text": "I thought it would be fabulous to have a restaurant in the neighborhood. So I went for breakfast at 9:30am. I was the only one in there which was off-putting. Took forever to get my coffee and I didn't get a spoon to stir in the cream. I admit the Avocado Toast with poached egg was supreme, but I didn't enjoy it with the loud music (Why do they do that?) and the flies bothering me. Probably won't go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fCq7tEUwc3zWfNLAbmaqSQ"
  },
  "sWVdHan1HlCnYBTSelCk0g": {
    "date": "11/28/2017",
    "text": "Went in to just checkout our new bikeable neighborhood place for HH. Great service, great atmosphere, tasty hot well prepared apps, nice beer selection, what's not to love. Will be back soon for a full meal",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o2qCDQ9plZiWP-cWAeQXAg"
  },
  "BJSWT67lpGKL9EkpJaSHmQ": {
    "date": "12/11/2018",
    "text": "we walked in and they immediately sat us down. we waited AT LEAST 15 minutes before they came totaled our drink order. about 10 minutes later, they rest of it party showed up and waited to receive their drinks too. we ordered chicken wings for an appetizer and crab cakes. both were very good but took a long time to get. another 15 minutes from passed until we ordered our entree. i ordered the Turkey Melt which had sourdough bread, bacon, avocado, turkey, and a spicy aioli sauce. the bacon tasted bland and wasn't crispy and it was cold. the sandwich lacked the flavor in general and tasted very bland. the aioli sauce was  spicy and sour which actually added some flavor. the french fries we ordered were delicious and crispy enough. we also ordered a pizza that was extremely overpowering and so sour. the restaurant had no ranch which is a necessity if you want bland food to have flavor. i asked for ketchup with my fries and waited 20 minutes until i had to ask again. service wasn't very good in general. i just say i expected much more from this restaurant. it lacked an image and service. i will most likely not return unless i read that the service and food has gotten better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CXNEn17pwerTMOVwXhCqSA"
  },
  "Nsx7spI23uhvHr3N4LQOOw": {
    "date": "11/21/2017",
    "text": "The Mia pizza (gluten free or regular crust, sausage, and pepperoni) is even better than the La Grande Orange Gladiator, or the True Food Chicken Sausage pizza. The place is gorgeous modern, with easy parking and bike racks right in front, a huge dog friendly patio graced with mature trees and a view of the Papago Buttes. The couple next to us were enjoying the Short Ribs Grilled Cheese sandwich and a delicious looking salad. More promising menu options, including gluten free, and the friendly staff and owner topped off the experience. A new favorite South Scottsdale haunt.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UV1osogMEnWWs559uyS0Sw"
  },
  "5hWwEpytmQbI0iStLFr52A": {
    "date": "11/14/2017",
    "text": "One of the \"operators\" named Brian verbally abused a kitchen employee in front of us on Sunday morning (11/12/17). We have no information on whether or not the employee was doing anything wrong. He simply seemed to be leaving with a pizza box. But, the point here is that Brian found it perfectly acceptable to berate another human, in public, in a VERY menacing way. Brian then proceeded to stalk that employee as he left, following him through the restaurant to the parking lot. We found it unnerving and scary that an owner of a restaurant thought nothing of taking his anger out in full view of his patrons. We observed him for the rest of our meal hulking around the restaurant speaking with little regard to other employees. We can't imagine that he'll keep people employed there for very long. I asked to speak to Dean, the owner, who was not available. Instead, the server whom I asked to send me Dean sent me Brian whom I declined to speak with and said I would call Dean. My unwillingness to disclose the reason for wanting to speak to Dean visibly angered Brian and he would not stop asking me what my problem was, and I continued to respond that I would call Dean. He walked away stating that I was \"unbelievable.\" As for the food, they apparently have a policy that it is served when hot. So, my partner's meal came five minutes before mine. We asked them many questions about the menu and the answer to most everything was no. The food was simply mediocre and not worth the trouble. Too bad because Scottsdale needs good restaurants, not just a collection of bars. A poor start for this new enterprise and I can say with certainty that we will not return.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "IfiY3jkUgCzWqPuURVpdXA"
  },
  "m7doQQLhPs0SVPUSUGn9VQ": {
    "date": "1/6/2018",
    "text": "My wife and I went out last night to check out a place that open up by us called Pitch. There are a lot of people there and everybody look like they were having a good time. It was our first time there and we were just kind of curious cuz we live about 2 blocks away. We were greeted by friendly staff and we told them we just wanted to have a couple of drinks and just check the place out. We opted to sit at the bar as most of the people there were sitting at tables and enjoying the meal. One of the owners named Dean came up greeted us, and asked us if we'd like to try some of their wine. The service there is fantastic. These guys really know their wines and their cocktail menu is amazing. Betsy and I split a bottle of Stella Rosa. It was delicious. They have some different prices for different options for their wines. But I can tell the people at this restaurant really care about their customers. A couple joined us at the bar. They were greeted with the same courtesy and care as we were. They ordered some food and as they were enjoying their meal they raved about about how good the food was. We plan on going back for the food as their menu look really good and it wasn't the typical crappy fair that you see in the older Old Town Scottsdale restaurants. I like the ambience of the place open air patio little fireplace it just seems like a family-friendly place. We're going to take the kids there to check out the food and see what the kids say. So consider this part one of my review but as far as I'm concerned what I saw last night this place is a huge benefit to our little southwest corner of South Scottsdale. And just a heads up to Dean thank you very much for helping us we're not wine connoisseurs but your patience and helping us with our selection and your expertise was greatly appreciated.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PjEQF-KURBHlI5SGH9I0hw"
  },
  "jb_EDiNVtvmyhkoNc3yAdw": {
    "date": "2/16/2018",
    "text": "My friend and I walked up to Pitch from our nearby neighborhood for lunch today and we both thought it was excellent. We sat inside, which was tastefully decorated and the music in the background wasn't too loud. They have a great dog-friendly outdoor patio (with heaters) and a corn hole game nearby. One reviewer complained that it wasn't good for date night because the tables were all large tables, not smaller more intimate seating arrangements. On the patio they do have couches and small tables that would serve, and inside there are several smaller tables.  As to the food, the grill-roasted artichoke appetizer with hummus and tomatoes was surprisingly flavorful and the serving size certainly was enough for 2. I had the beet salad, which was large and boasted a broad variety of greens, thinly sliced beets and goat cheese. The topper of a phillo dough \"roll\" filled with goat cheese would have made me happy all by itself. (Hey, chef -- how about an entire plate of those as an appetizer???)  My friend had a burger with sauteed mushrooms and cheddar and said it was delicious and very filling. The side salad had a similar variety of greens but also included garbanzo beans, which was a nice touch. She asked for her burger cooked medium and it came back cooked exactly that.   Our server (Cooper) was personable and knew her way around the menu. (I never remember my server's name after I leave a restaurant, sadly. But Cooper -- I'll remember.) Pitch is not inexpensive, but the food sure seemed worth it to me. We didn't try pizza or sandwiches this time, but we'll be back to experiment more. As a footnote, I told Cooper that I was going alcohol free for Lent but wanted something non-alcoholic but more interesting than soda. I got a cranberry juice and seltzer. Other places I've been have charged $4.50 just for seltzer water. Pitch rang up my drink as a coke and charged me $2. Much appreciated! Good luck, Pitch. So glad to have you in the neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ro4jG8YBH_PzwQlW4pIkw"
  },
  "JEW5MbgV_3h8abBqdMXNgg": {
    "date": "12/9/2017",
    "text": "First visit to Pitch and we are impressed. Great service tasty food and s good value. Chopped salad was good but needed a little more onion or something. The Zamia pizza was fantastic. Decent price for restaurant wine $40. Cappuccinos with amaretto Post aperitif We will be back for the happy hour.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jBJo4DsM3AjkdkC9gBraBA"
  },
  "1_4Zpq8NpQDRB8uijljs-g": {
    "date": "1/20/2018",
    "text": "This is my favorite new place. The food is amazing. Outstanding craft cocktails and wine list. Matt and Brian are fantastic operators and keep the atmosphere fun with great music. If you haven't been to Pitch yet, get here. Patio rocks as well!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tozIEq4q8gbA34_v_Gow3w"
  },
  "4YEbkjf6QCyGWtssPi1mYA": {
    "date": "1/15/2018",
    "text": "Superb place, love the food, the music and the staff. A welcome addition to Arcadia. You have to try the artichoke starter, and the s'croom pizza. We have a great evening and enjoyed Pitch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ywyp8jtI8adfK-XPW0CZw"
  },
  "-pURqLhSbD3wnZ-9yPG8tw": {
    "date": "5/4/2018",
    "text": "Don't come here if you're expecting to eat lunch in a reasonable amount of time - our casual lunch took over 1.5 hours. We had a party of five people, and over 30 minutes elapsed between the delivery of the first entree and the delivery of the last entree - the restaurant wasn't visibly busy when we arrived at 11:15 AM. Regardless of the quality of their food, I was so disappointed by the service at Pitch that I won't be coming back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vGMlsHhE5164XY2VzkrU7g"
  },
  "JVCKqZE0al8xvbxPLbRiuw": {
    "date": "2/15/2018",
    "text": "New to the area... went last night... it was great.... cool atmosphere... really fun and caring staff... Megan was our server... awesome service... nice wines and excellent pizza... will be taking a group back very soon to let them try it all!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tML6Fy3-f_I0dErb_dfWKw"
  },
  "8RHEx1PcIaHO_AJeYCJYCA": {
    "date": "6/14/2018",
    "text": "We went Pitch for an early supper (4-ish) with my 93-year old father-in-law. Handicapped parking was open and convenient; thanks. My father-in-law ordered a Cabernet and I had one of the local beers; both great choices. We had the spaghetti and meatballs as one entry and house-made pappardelle. Both meals were delicious! Sauces were fresh, pasta was amazing, and portions were generous. I'm excited to come back and try more from their menu. The only downside was the service; after being received promptly and making great menu suggestions; our server evaporated; this was especially noticeable because at the early hour there were only two other tables with patrons. At one point I went to the kitchen to ask for something and they called the server over. Like I said, it started out fantastically but ended up forgettable service-wise. I'm going to assume we caught someone on a bad night and we'll be back to try it again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LkeD3HDd_0F4rHnimSZvDw"
  },
  "n_h7Hzo05n7YxOrnQHrYaw": {
    "date": "11/26/2017",
    "text": "Despite the lack of music on the patio, I found this place to be a fresh take on coal-fired cuisine which is not easy to come by in AZ.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NjozOOgSQqGFn8Wnbn8HkQ"
  },
  "rS2oor5UVqYsdS2W7z-Hmg": {
    "date": "11/14/2017",
    "text": "Awesome place, Great Food and Music, new team, still working out some of the kinks, but give them a try you will love the atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2oq49xWVbabsdXiK-FA8yg"
  },
  "gQVc3yhSPZRZwTAtEUGO4g": {
    "date": "7/16/2018",
    "text": "tried this place for the first time today and i was amazed! the mushroom pizza was amazing and so was the green tea...i'll definitely be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HodpN14Fw1jWLQSaBoW41A"
  },
  "Q_gMDTJYUj5ZQZwuSlt5xA": {
    "date": "11/24/2017",
    "text": "I went to Pitch on Thanksgiving Eve for drinks and dinner. Nice indoor and outdoor seating. Cool vibe and music. According to our waitress, it is a \"farm to table\" restaurant without microwaves and heating lamps, meaning we wouldn't get our food at the save time.  Took an extra long time to just order our drinks and food. Took another 5-10 minutes to get our two drinks. Our food came out staggered as promised by the pasta items were ready before a simple chop salad. Seems like it should be the other way around. Food was hot and tasty. I had the mac and cheese plus shrimp. Very filling. On food and atmosphere, 5 stars, but service left a lot to be desired.  Looks like it has full coffee bar and weekend brunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jntr7XjycDA4I_8L2yQdyw"
  },
  "LFtbqLpzyLiA64xFJpCmtA": {
    "date": "12/10/2017",
    "text": "Great place! It's only three blocks away from us and we have been there three times since Thanksgiving. We have had the tortellini twice, artichokes, meatballs, a few different pizzas, etc.  all have been fantastic. I am used to artichokes being more of a peel and eat - but these were all laid out so we used fork and knife which was fine. I am all about the cocktails and the bartender was very accommodating. I requested a grapefruit martini in Lieu of a lemon drop and she concocted something delicious. The two bartenders from our previous two visits were outstanding as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KPmsnEVGhHyKVlZcA3-ceg"
  },
  "wp92sccqItCo0ARdw0z2pw": {
    "date": "1/6/2018",
    "text": "Really hoped this place would become a neighborhood favorite .. alas, not so.  Tried hamburger and the meat patty was so thin it literally fell apart .. we love happy hours and go at least twice a week .. why would we go to Pitch when the alcohol/wine prices and appetizers cost so much more compared to our favorites like Roaring Fork and Seasons 52 ... actually, the overall prices are too high ... plus, they just received 5, yes 5, violations on restaurant review.  Tsk, tsk ...",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "vLbML_hGcaJsC5whUjLhRw"
  },
  "z3SgUYn8F0R0aoPyn4H9Lw": {
    "date": "4/21/2018",
    "text": "Pizza is really good and the building is cool with a huge front patio. The Parmesan White Beans were a tasty appetizer and prices are very reasonable. Service was prompt and accommodating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qcBttz7Ez9N8qZLZ6KYgXA"
  },
  "ysthu704fC582XNO9nwgGw": {
    "date": "5/20/2018",
    "text": "Gourmet pizza and great crab cakes that are better than most. The whiskey, bourbon, and wine selections are extensive and reasonable. Will eat my way through the menu and know I won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ejZqQ_AJIAlZMskPDSOgDw"
  },
  "pVrGpt6e9OIO9xWzrd7Cwg": {
    "date": "12/1/2017",
    "text": "Awesome place.  Great drinks and great food. We enjoyed the awesome indoor/outdoor environment and service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CXVVi8uTicNClDc0r7kr1A"
  },
  "KXw6TN1d7rJQVmLymyY0_A": {
    "date": "11/23/2017",
    "text": "I am only giving this two stars because the food was marginal. Service was probably the worst I've ever received. Our server was not attentive, drinks came out wrong, several food orders came out wrong, we didn't even receive some of the food we ordered. It was a Wednesday night and not busy by any means. Probably won't be back here.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "8hsL_llraggdE2-UPcn3WQ"
  },
  "hg565i0OQ1_BtLajEKlyFQ": {
    "date": "3/10/2018",
    "text": "We live in Omaha and love this place.  The Az location is on point.  Did not disappoint!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_nY1tfYvmQkz_AmDU69PAg"
  },
  "Q4fmYmiKstwsE5kz1XBO_g": {
    "date": "2/17/2018",
    "text": "Great local restaurant w/solid pizza, salads, craft beers, etc. Located in creative redevelopment w/pkg!! lgNo & fox take notice",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3lUEQb9TIxOeAUtvgh7p8w"
  },
  "douLbJQ3_m8FlvyN88FYJA": {
    "date": "1/1/2018",
    "text": "I've been here 3 times. The first time I was impressed: great atmosphere, food was good, and service was great. I got the artichoke appetizer (very good) & the calamari (nothing special about it). Others got the spaghetti (very good), The Doc pizza (very good), & the crab cakes (also very good). The only bad thing is that the food is served as it comes up because they don't have heat lamps so people were eating way before others. The second time I ended up getting the crab cakes and they came out a little burnt (not as good as I remembered them the first time). My third experience I ended up getting the Scampi. The scampi was more of an alfredo that is very very bland. I ended up adding a lot of salt, pepper, red pepper, & lemon to give it some taste. Cute atmosphere, would recommend for drinks.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "09A3j44-l3Y1u87_mU-msQ"
  },
  "iH_zIWtlciyWkUKVsG-_VA": {
    "date": "1/8/2018",
    "text": "We tried two appetizers, pasta and pizza during our first visit. We started with truffle fries and of course got all of the sauces; ketchup, lemon garlic aioli, roasted cherry pepper, and a pesto aioli. My favorites were the pesto and lemon garlic. Then we recieved the  roasted brussels sprouts, super awesome flavor and well cooked. I had to try my two favorite aiolis and would recommend putting the pesto aioli on the brussels sprouts. As we entered the main course we got rigatoni scampi, one of the best pasta' s I have had at a restaurant. Finally the main event, our pizza,  Mia with egg overeasy on top. So good, a top 10 gourmet pizza for sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OhgHQviln4E3_zmYxonoWA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OhgHQviln4E3_zmYxonoWA/o.jpg"
      },
      {
        "img_id": "bsMmjqU1RguGEAcTUEX8mA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bsMmjqU1RguGEAcTUEX8mA/o.jpg"
      },
      {
        "img_id": "i3vQXtG3xtk-rhFiq9ZGWA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i3vQXtG3xtk-rhFiq9ZGWA/o.jpg"
      }
    ],
    "user_id": "JGNMXAu4FTdVdaIWTMhjRA"
  },
  "RNMEGPAphb7vyAPbt2BFVw": {
    "date": "4/27/2019",
    "text": "We have visited pitch twice. Food and service was pretty great both times...until one of our guests was unhappy with their dish, she got what she ordered but didn't like like it. The waitress handled it great, took it away and offered to replace it with something else. The bald manager came by with a bad attitude asked what was wrong with it and made a snide remark about getting what we ordered.  Apparently it's not enough to just not like something to send it back :/",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2VwAHLipJzNuBI8u5mOZGg"
  },
  "JpqtMg3Hno-vgA87Q_KMjA": {
    "date": "4/25/2019",
    "text": "We've been here before and generally have a good time. We had lunch yesterday and  enjoyed ourselves, but not without a couple of problems. First. I ordered the Meatball sand and asked for extra sauce ; the tiny portion I received w / the meal was clearly inadequate, so I asked for more. Got a larger than necessary bowlful, and was charged an additional $3 ....also asked for a little more salad dressing ( the small dollop of a large portion of greens also initially inadequate )...this, too resulted in a charge of $.50.  It seem to me that  a nickle & dime approach to customers can't possibly be a desired business model. The food is usually good, but Pitch mgmt. seems to serve what they want and not what the customer would like.  We'd like to return when some changes are made.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "eCS9AtlHIXXclGCSNabC9g"
  },
  "pLJCZiOsrreumDFynQMRWA": {
    "date": "12/9/2017",
    "text": "This is a new pizza, burger, salad place that just opened up in a renovated office park.  The redevelopment of this property along a less than memorable stretch of Thomas Rd is very well done and creative.  Pitch has a big front patio, indoor/outdoor bar and large indoor seating.  It has that modern industrial design that's popular these days.  I sat at the bar and had a pizza and iced tea.  The Mia pizza comes with mozzarella, fennel sausage and pepperoni.  The flavors of the ingredients were very good.  I thought the pizza seemed a little greasy when it came out and the leftovers that I had the next day really kinda solidified into a clump when I reheated it up in the oven.  I'd probably try something other than the pizza the next time.  I'm also not a huge fan of their logo glassware.  It's a relatively small size and when I needed a refill on my iced tea the bartender had to go all the way to the back of the restaurant and into the kitchen, I suppose, to bring me a refill.  That's not ideal for him or for the customer.  Overall, it's a nice enough place if you're in the area.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Q3oMBClU3f0RU4zKZxPXgg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Mia",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q3oMBClU3f0RU4zKZxPXgg/o.jpg"
      },
      {
        "img_id": "hQQaLEHZoD88hl9dqUvQ_Q",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Pizza and lime bikes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hQQaLEHZoD88hl9dqUvQ_Q/o.jpg"
      }
    ],
    "user_id": "S9Jw00eZHVj5_0sOM_C5Rg"
  },
  "X4mEJVZXDCt11pl6kExDCw": {
    "date": "5/31/2019",
    "text": "I just want to preface this by saying the food here is pretty fabulous. I had the soup and a mia pizza and I was impressed. The service was great and thorough. It's a very nice restaurant. The only thing I can complain about is it's not two dollar signs expensive. It's a lot more expensive than that. $21 13 inch pizzas, $40 steaks, and $26 plates of pasta. It was really good and I'll go again but I won't go expecting to leave under $50 if you plan on a beer or two. The food is terrific though...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X83jvUjDVptCJIbzljycow"
  },
  "k92fGuu202YmFZtPdOTUMw": {
    "date": "1/30/2019",
    "text": "Our new favorite restaurant! A place that's great for families AND happy hour is hard to find. From my 9 year old's perspective, the meatballs were amazing ( I confirmed that they were!). And he asked for more of the house made focaccia that came on the side. But the most important question for him was \"what kind of fries for you have?\".  The answer was, skinny, crispy and salty- dreams do come True!  Besides stealing bites of the meatballs and fries, the grown-ups also tried the chicken basil pizza, which was awesome. Crust is on the thin side with a chewy edge. My husband didn't like the big chunks of tomato on the pizza, but I did. You can't please everyone, right? He still loved the pizza. The slight miss was the charcuterie board from happy hour. Kind of skimpy, not too exciting.  But True to form, my favorite thing was a cocktail, the French mule. Made with green chartreuse liqueur, my favorite old school cocktail ingredient. Complex flavor and packs a punch!  We also had great service, and the restaurant itself is beautiful. There's also a big patio! We'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v524aqZ_OAasUt2lb1YluQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. French mule and happy hour charcuterie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v524aqZ_OAasUt2lb1YluQ/o.jpg"
      },
      {
        "img_id": "6EI4JdD16hjxVqI_dGIThQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6EI4JdD16hjxVqI_dGIThQ/o.jpg"
      },
      {
        "img_id": "LiU78hbkfPh77QBt2fgjSg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Chicken pesto pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LiU78hbkfPh77QBt2fgjSg/o.jpg"
      }
    ],
    "user_id": "e2l0lW2CK33ZK82ITYoFWA"
  },
  "sbw76E7V4A1YKe7Ebfan0Q": {
    "date": "6/14/2018",
    "text": "Nice hangout with good food, food beers and a nice atmosphere.  Pizza was delicious and the service is attentive and welcoming.  Highly recommend for a happy hour or a night out on the town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "F4incfAtndpvReXZje--cw"
  },
  "l512_epmLzu9d3FjwxOIGg": {
    "date": "2/28/2019",
    "text": "First time we dropped the place was hopping and without a reservation on a Friday night we had to go elsewhere.  But we returned for an early Sunday dinner and got seated immediately. Calamari was a delicious appetizer and each of our meals was very enjoyable. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fkgfAFS6gAxnT-BYbvlM6Q"
  },
  "AApqjRAbxGkONsCnCWI-IQ": {
    "date": "6/15/2018",
    "text": "Fun place, great food, outstanding service. Had the BLT and it came with avocado  and thick bacon SO GOOD!!!! Has great outdoor seating and a fun place for a date night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LE4lYdj0rvHV3tDwyNkr9g",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LE4lYdj0rvHV3tDwyNkr9g/o.jpg"
      }
    ],
    "user_id": "XmvKKMAkSwyhB9F_C1Ze-Q"
  },
  "xMILVppTTNdamLTcJdVRKw": {
    "date": "2/18/2019",
    "text": "I had a great experience at Pitch! My server was Carigan. The service was non-intrusive, timely & attentive!   We could see that the manager was expoing on the line quality checking, & that's always a great sign!!  The floor design is open with high vaulted ceilings, big open windows & a nice sized bar.  The food was really great quality. Yes, slightly pricey, but priced right for the quality. We were all really impressed with the pasta!   We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EMbjt9ds-NujTwL4AqdYtA"
  },
  "ehbFjAcfirdpelVSUHvN1g": {
    "date": "5/7/2018",
    "text": "Inside Pitch it's open, bright, and airy. The patio seems like a great place to hangout on a nice day. I tried the house-made pappardelle - it was pretty good, but the noodles didn't really hang on to the loose sauce and made me feel like I need to eat it like a soup! We also had the doc pizza, this was definitely the better item! The crust was a little chewy, in a good way, and had great flavor. I will definitely go back and I suggest people try it!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OQp8-5EGEWEITt4jO6yDgg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OQp8-5EGEWEITt4jO6yDgg/o.jpg"
      },
      {
        "img_id": "DA2Xhfkkpwxidc_05uylLw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DA2Xhfkkpwxidc_05uylLw/o.jpg"
      },
      {
        "img_id": "2f6J_NhhcY8OsPUZIAFaTA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2f6J_NhhcY8OsPUZIAFaTA/o.jpg"
      }
    ],
    "user_id": "OIgSMLPKe1PDtP5I-1FrWA"
  },
  "TzuzxmgkpXX_-bisDqWefA": {
    "date": "11/9/2018",
    "text": "Josh is the best bartender! He makes me anything right on the spot. Great atmosphere, music, vibes and people will definitely be back again.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YKEaWHoageQO8Ps_L8-rkw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YKEaWHoageQO8Ps_L8-rkw/o.jpg"
      },
      {
        "img_id": "iGy-_G2wKP2iGm7a4CBMPw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Basil Chicken pizza yummy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iGy-_G2wKP2iGm7a4CBMPw/o.jpg"
      },
      {
        "img_id": "G5Tg-1Mt_YGqT-Jb08WJmQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Big Blue Van",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G5Tg-1Mt_YGqT-Jb08WJmQ/o.jpg"
      }
    ],
    "user_id": "n4SUieLJFUi3LNccLVK7gg"
  },
  "AmmJxmkcaHRSWAdOiDm0Sw": {
    "date": "1/22/2019",
    "text": "Food is phenomenal! The design of the place is super modern and hip. We have been in twice and everything we have ordered was awesome! The service the first time was a bit off, but I think it's just ironing out the details  I've been back several times. The service has really improved. I think that they have worked out the kinks of being a new business. The food is great. It's definitely with coming in!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ig3N6o0d8fBxGQ2WV--klQ"
  },
  "QIVv0oZ_oPb1mfVOBII9yw": {
    "date": "3/28/2019",
    "text": "I've only been once and do plan on going back. If you're looking for a place with a great patio then this is it. I gave them 2 stars because the time it took us to receive our food. My boyfriend and I ordered a pizza to share and his brother ordered a burger. Once the burger came out the waiter told us it would be a couple more minutes for the pizza (which is fine). 15 minutes passed, the waiter came over to say they had to remake the pizza because they burned it. My boyfriends brother already finished his meal by the time we got our pizza. I wish they could've given us a discount on our bill or a glass of wine to make up for it. They didn't do anything which irritated us the most. We ended up taking the pizza to go and ate it in the car because we had somewhere to be.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "2HJtlrAN1gRRv0HqqL9g7A"
  },
  "dcwUQeH7x5bFR5O5_3l9uA": {
    "date": "6/2/2018",
    "text": "Awesome place with good places to sit inside of outside depending on the time of day. First time here tried a pizza and was not disappointed quality ingredients loaded on top. Can't wait to go back and try some other intriguing menu items.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1smod4m_l8yWHBrjw_XaoQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1smod4m_l8yWHBrjw_XaoQ/o.jpg"
      },
      {
        "img_id": "3wnZU7UGmDbu9ZSV5hdg8A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Thick cut crab cakes cooked to perfection",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3wnZU7UGmDbu9ZSV5hdg8A/o.jpg"
      }
    ],
    "user_id": "-tE9nOotEHa-3VbsiWisWQ"
  },
  "ZxAeamzr9trg44HZFPKJIQ": {
    "date": "5/30/2019",
    "text": "Go there for happy hour. Get a bottle of wine. Sit on the patio. And enjoy. This place is local and great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6zJR_LyebVGDzbu2uDMzXw"
  },
  "7SfsCLfQE5v9AtHzGgXTVw": {
    "date": "4/5/2018",
    "text": "I have driven by Pitch many times and finally had the chance to stop by with my husband for Happy Hour. We really enjoyed the ambiance the outside patio is perfect in the winter and spring to relax and have really good food.  The Happy Hour menu is great it gives you a variety of food options as well as drinks. We had the Calabrese Meatballs and as well as the Short Rib Sliders with Sangria. Let me say we enjoyed all it. The service was excellent, we will be coming back especially before the heat kicks in.:)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TcftfHJS6IECjmLudxxgnw"
  },
  "XB9l4Wwvq18E0hlEyHsemA": {
    "date": "8/4/2019",
    "text": "Great place, wonderful neighborhood!  Music is WAY too loud, other than that, staff are super.  Arugula and Prosciutto Salad is the best!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JKKTC33NHhDjHqwFE-f1qw"
  },
  "ak2p5s_8lTan6vF-P7LyIg": {
    "date": "1/18/2019",
    "text": "Amazing! The service was friendly and quick and the food came out steaming hot! The portions were perfect for the price. I highly recommend the VIP mac and cheese and the Papago Punch! The vibe here is super trendy too - great for your Instagram feed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zCthClzHhlQe3ls6tl20CA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zCthClzHhlQe3ls6tl20CA/o.jpg"
      }
    ],
    "user_id": "V3Hz23PPbnr3UQNEZi3eRg"
  },
  "Tdkqmo3rl23lh0BqGMSQIQ": {
    "date": "5/27/2019",
    "text": "Love this place! Their pizza is amazing and the happy hour deals cannot be beat. This is one of the few places where I enjoy sitting outdoors because they have a nice shade and it is very spacious. Selfishly, I wish their happy hour went a little later but no complaints on my part.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WxAJhcoI7KrL-hZRrs5zxw"
  },
  "_R4KUS5DvdaK_SUwqGcfDg": {
    "date": "10/19/2018",
    "text": "So there are a lot of cute things about Pitch but I cannot ignore how overpriced it is. The pizza averages to 19 dollars. Like why??? They have a good beer selection which is nice. The bartenders take forever and a day to even notice you're sitting at the bar. Not impressed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cmR74hJFzgx_k-ZghZPI2g"
  },
  "1a3JO6yQPlc88QqEGbWUzQ": {
    "date": "8/14/2018",
    "text": "OWNER is rude he has a bad attitude, I don't know how he has any business. he acts like his food is God's gift when in reality I can go to a mom and pops store and have better food...he has a short man syndrome if you want good service and better food don't eat there.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "yw3OhNse1Yp22F4ortl6TA"
  },
  "AxN5P85ARqw3lNor4ttNfQ": {
    "date": "12/7/2018",
    "text": "Definitely a great place to hang out on a Friday night. Great food, really cool atmosphere. A lot of little touches that make it exceptional. Ownership/management seems top notch, really friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NPBRZa5jp1nDoIjXdHSgQg"
  },
  "QrN1L7BzxM3N7FoEj80vVg": {
    "date": "3/19/2018",
    "text": "New place in town we gave it a try, & will positively be back. We ordered pizza, & wings with a salad. Everyone at the table was highly impressed with the food & service. We went in the evening and loved the ambiance. Pizza is made in a wood fire oven. Go in give them a try :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "t6DZZyk5XiwU8MS1t6S3jg"
  },
  "z0d12Wjc6Zak3rsMk5qQWQ": {
    "date": "2/14/2019",
    "text": "I would give it 0 stars if I could. This 1 star review is for the manager (Brian) only, my food, service, and the ambiance were all good. My girlfriend on the other hand did not like her entree (lobster mac & cheese) and said the lobster didn't taste fresh. No big deal right? Happens all the time. We didn't want anything in exchange just expected the entree to be taken off the bill like is industry practice. We wave down Brian and ask him what the deal was as my gf ate MAYBE 5 total bites of her ($26) mac & cheese. This is where the issue REALLY starts as Brian is a total prick and condescending when talking to my gf and says 'why should I pay for it just because \"you didn't like it\"'. Total sleezeball move by a middle manager of a \"high class establishment\" lol maybe learn how to work in a customer service industry.  Absolutely no chance we'll ever return.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "X6T3fr0It_y2jT4Tli-dLg"
  },
  "Z2Ot6xvMMdjaN6juNDuHIA": {
    "date": "6/4/2018",
    "text": "Behold one of the best gluten free pizzas in the land! Their crust is beautifully textured, and their toppings can't be beaten. They readily accommodate the gluten intolerant and do so with a friendly attitude.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0Ezfx8JoYNq6wv7PurhiHA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Gluten free &amp;#34;the doc&amp;#34; pizza!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0Ezfx8JoYNq6wv7PurhiHA/o.jpg"
      }
    ],
    "user_id": "-3gCtrp6npN0OGyivOWYuw"
  },
  "fl_LI_1Ekbm471Wg1xiTZQ": {
    "date": "8/5/2018",
    "text": "Nope!!! I had the worst experience here with the owner, he is rude and mean. Very embarrassing   for my friend and I who got something that we weren't expecting and his response was this is what you ordered with attitude and proceeded to aggressively take my plate away, I told my company what an ***hole he was. He turned around came toward us aggressively said he was the owner and told us to leave all the while yelling in front of patrons and staff!! I was also told by him if I wanted to count calories I could go to Applebees.... He is a judgmental person who treats people and staff with disrespect..",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "CJijpqtC1pTr0KtueQKUWA"
  },
  "V_Fbasy5fKYXgIPfaU2ugA": {
    "date": "3/13/2018",
    "text": "Very much in the vein of hipster kitsch type dining environment that is so prevalent today: Industrial interior features; open, communal-style dining atmosphere; coal-fired oven. That said, we'll see how long this concept plays out. Until then, I'm good with the nice choices (and large portions) that places like this offer and Pitch was no different. The Pitch \"VIP\" Smoked Cheddar Mac & Cheese (with fennel sausage) was outstanding and enough for two meals!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "N7qer0hBB8ouQ6_NW_ojDg"
  },
  "uMQ65LPQ8plpyDo2a8abyA": {
    "date": "7/11/2018",
    "text": "This place was so great! I loved the vibe, ambience, the staff was very friendly and personable, service was stellar. I've only eaten here once, and it was fantastic. I'm definitely coming back to try more of the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rU5sbNY0cKb_E9dqx84Qxw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Wedge salad &amp;amp; truffle fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rU5sbNY0cKb_E9dqx84Qxw/o.jpg"
      }
    ],
    "user_id": "TgKmD0JY0G01QkiiWCXang"
  },
  "0A4mxVP0O2XXALp7DNu4rA": {
    "date": "3/16/2018",
    "text": "Had an opportunity to check out Pitch restaurant. This is a really nice setup with an indoor/outdoor option for seating. I definitely like the fact it's a dog friendly environment. It also caters to bike riders who want to enjoy this great AZ weather. It saddens me that I had to give this place only three stars. The Margarita pizza I had here was mediocre. The fruit cobbler which looked great was also just average. Nothing about the food here would make me want to go out of my way to come back! This would be more of a place I would just grab a beer from to be honest.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ibb5xZ8400IC6jO2tdpvQg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ibb5xZ8400IC6jO2tdpvQg/o.jpg"
      },
      {
        "img_id": "miJtev7t4WFIt_nzgK7TzA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/miJtev7t4WFIt_nzgK7TzA/o.jpg"
      },
      {
        "img_id": "kyOeHgXEyYTUqLuHzp6IUQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kyOeHgXEyYTUqLuHzp6IUQ/o.jpg"
      }
    ],
    "user_id": "Z_PFVN3z3RpEAMwe94cqVQ"
  },
  "dLlwX7torbXmNAJkRFxySw": {
    "date": "2/16/2019",
    "text": "Normally enjoy coming here but tonight was not a good experience. Sat us by the bathrooms and was ignored by our waiter who wasn't very friendly. Had an appetizer, salad, and pizza. Tasted alright but nothing special. Few hours later began vomiting clearly caused by my meal. I will never return to this restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "oL2FCuOcy0_bqivrQV4b_g"
  },
  "HuQIZ2O8Zy5NkxYjQ0dB-g": {
    "date": "5/1/2018",
    "text": "Finally had a chance to get down and try Pitch! I'm so glad I did and my only regret is that I didn't go sooner! Counting down the days until my next visit.   The menu had a lot more variety than I expected.  Started off with the HH meatballs. Very good, and large for a HH portion.  Then we ordered the roasted Brussels sprouts with spicy pistachios and a pesto chicken pizza. Everything was fabulous!  Admittedly, I probably won't venture much deeper into the pizza portion of their menu. As their main dish and appetizer menu had a lot of things I'd rather try first.   Service was great and the food came out quick (almost to quick).  Very cool trendy establishment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kcK0IBrCURD18QvkicAtAw"
  },
  "o0OoMvX38Cn-iArCboYNNg": {
    "date": "5/13/2019",
    "text": "I wish i loved Pitch. It's right across from my house and the food is very good and the menu has a ton of options. However, every time we go the service is just sub-par. No sense of urgency. We will continue to go, but if something else with better service opened nearby, we would go there for a better deal and better service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TMApDGK5pbMjITrgGxal6Q"
  },
  "CmtEyIhkDqeKPiLWc6h-rQ": {
    "date": "4/5/2018",
    "text": "Great food but even better happy hour! The food was delicious and there are so many happy hour drinks and food specials! Everything came out right away and the servers were kind and friendly! The weather was beautiful and the large patio was well lit even after nightfall. The other customers set a great atmosphere that wasn't too loud but still lively. The decor is trendy and updated. There was a large variety of vegetarian options and the pricing after happy hour wasn't too pricy. I thought a place like this would be more expensive so I was pleasantly surprised! Will surely be coming back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "C8CBOjO7s32dCW0DRmiL9Q"
  },
  "xIXUnpWaJisioBFCgfbJqQ": {
    "date": "2/28/2018",
    "text": "I had heard of Pitch when I lived in Nebraska but hadn't tried it so when this one opened up so close to where I lived I thought I'd bring another former Nebraskan there for her birthday.  Service was great the waitress was very knowledgeable and helpful.  The patio area is so cute!! And the food and drinks were great!!  We went during the day for lunch but I'm sure it's even cozier at night!! Definitely a fun place to try!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DPaB_zUBLOPFzXuHoDp9kA"
  },
  "ljMNDzNBrK9eXxNNFFLNBw": {
    "date": "3/3/2018",
    "text": "Went here with some girlfriends because, well, we needed a pizza night! I made a reservation, was seated immediately in a nice booth red area, perfect for catching up with the gals. We took a while to make up our mind to order everything, but our waitress was attentive and answered our multiple questions since it was our first time in. Loved the vibe and layout of the place. Seems great for large groups, small groups, couples, families, etc.   We ordered pizzas and a couple of sides. One of the pizzas had gotten burnt so it took a few extra minutes for all of the food to be in the table. They were very apologetic though and made sure the pizza was done right and came quickly behind everything else.   Would love to go back again! Curious what their brunch is like... mmmmm",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6dmn4I06Txk_ahyCW1qgKQ"
  },
  "_5OyqGulmgQ__gBsOQZ94A": {
    "date": "12/21/2018",
    "text": "I enjoyed the atmosphere and dining experience. Food is spot on! Also dog friend!!! A big plus in my book!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0PRvldPZPqgAC_CW2whEBg"
  },
  "TVSqrd2zngc53SQVUE642g": {
    "date": "8/18/2018",
    "text": "This place is fairly new to the neighborhood. They do have very good food and the ambiance is perfect. I took my little daughter her and it wasn't too loud for her. Would come back again to try the different food. Got the pizza today but the other dishes brought out looked amazing as well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AwwV1jK46hKla2nLF2J-kA"
  },
  "nZ-u5Ax8nC1TEfnCvElDbA": {
    "date": "3/30/2018",
    "text": "Loved this place from the moment I walked in. Super open concept. Huge cute patio with ping pong and corn hole. The staff was friendly and knowledgeable. The owner suggested a wine and it was as delicious as he described it. Service was fast and on point. But let's talk about the food... yummmmm we ordered gnocchi, calamari, and some kinda peppers from the app menu and each one was finger licking good. The guys got pizzas that looked and smelled amazing. I shared meat ball app (huge) with another girl who is Italian and thought they were just as good as hers:) well maybe not as good all and all we enjoyed our night and definitely will be back. This is a new restaurant in town from Nebraska go check them out and you won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7vtCzfumfjbvYwvPvzPGeQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7vtCzfumfjbvYwvPvzPGeQ/o.jpg"
      },
      {
        "img_id": "Gaj_o03N8Kj3Zfzt-OOWlQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gaj_o03N8Kj3Zfzt-OOWlQ/o.jpg"
      },
      {
        "img_id": "HrB0ph9-wBGwNtX6COT_5Q",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HrB0ph9-wBGwNtX6COT_5Q/o.jpg"
      }
    ],
    "user_id": "xA0-wO9qiSquzw_hVDyDiQ"
  },
  "oLVGrj2846yBRZ-nifQnFw": {
    "date": "4/20/2019",
    "text": "With a tired Little Leaguer in tow who loves spaghetti and meatballs, I was headed to Pomo, but she suggested Pitch. She loves the outdoor tables, seeing other diners's dogs, and real food on the kids' menu. We got the best waiter we've met there, Lucas, who is usually behind the bar. He performed a great balancing act: first tending to my granddaughter's preferences and helping me convince her that the Brussels Sprouts appetizer is \"power food,\" then rustling up her favorite Root Beer, which was off the menu,  before her spaghetti arrived. In the meantime, he suggested a great salad for me with fresh roasted artichoke hearts, arugula, etc. with the inspired  addition of white anchovies. Lucas also knows his wine: I ordered a glass of white Caymus Corundum, a consistently excellent Napa blend. Later, I was curious about the CA wines with the PITCH label, and Lucas accurately described the grapefruity, dry, minerally sauv. blanc. Also Lucas never failed to engage my eight-yr-old granddaughter. Despite his tempting descriptions of various desserts, she was full. Lucas and I had exchanged mention of our favorite tequilas. When he promptly brought the check and our to-go pkgs., he brought me a taste of El Espolon from Jalisco, which I had never heard of -- and its easy to remember Dia de Los Muertos  inspired label. Quite good, along with Lucas' other suggestions.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q2YZ6cDvFB8ceAFUp_PvzA"
  },
  "srrVB9TwkHoUuqbP62xiuw": {
    "date": "2/12/2019",
    "text": "Great patio, cocktails, pizza and service!  Pets seem to be allowed :) Good variety of beverage and food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SpopQDi5k9b0ohxB1u-iaw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Great atmosphere and service with Mike!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SpopQDi5k9b0ohxB1u-iaw/o.jpg"
      }
    ],
    "user_id": "eGhkSpZnlIOgMoU5XSu0nA"
  },
  "xrI-yQzM_ot2c4yqprIgUw": {
    "date": "3/25/2018",
    "text": "Really enjoyed Pitch!  Our server was delightful and very helpful in assisting us in menu selections.  We did the mix & match of pistachio brussels sprouts and creamy cauliflower.  Both were yummy!  I ordered a Margherita Pizza and I love that they served it sitting on a large empty can of Italian tomatoes!  What a cool idea, that I'm going to use at home.  It was tasty with a nice thin crust.  Other entrees our table tried were the Shrimp Rigatoni and the most amazing Lobster pasta with Pancetta.  All of the dishes were delicious.    Will definitely go back to try some other items!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "_09AoHD_7jHfmaWLFD9Mdg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Loved how they presented the check on a logo metal board with a magnetized cork!  Great idea!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_09AoHD_7jHfmaWLFD9Mdg/o.jpg"
      },
      {
        "img_id": "jbss6dBz0AN40F6_5f29TQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jbss6dBz0AN40F6_5f29TQ/o.jpg"
      },
      {
        "img_id": "DR1k5SYq-GGKj3jWBl-VYQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DR1k5SYq-GGKj3jWBl-VYQ/o.jpg"
      }
    ],
    "user_id": "PRw12Yx-c-U5UsywjKS1oA"
  },
  "Xtwrp0B0_e8ekSfTFGWCtw": {
    "date": "3/9/2018",
    "text": "Liked it so much I visited twice in less than a week! The outdoor patio is so lovely and the location unexpectedly awesome.   If you sit outside during the daytime, def wear sunscreen. That's good advice just about anywhere but especially so in Scottsdale. I got a lobster red nose after about an hour.  Salads are quite good and quite different. Beet and goat cheese version is huge! Be prepared to share or take leftovers home. Same for pizzas.  Please note the huge menu of mules. Regular, mezcal, all sorts of crazy combinations in a copper mug.   Would totally recommend for a group looking for a unique outdoor meal.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "NQFdWk7wtyIsr5he2ALrtg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Arnold Palmer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NQFdWk7wtyIsr5he2ALrtg/o.jpg"
      }
    ],
    "user_id": "djxnI8Ux8ZYQJhiOQkrRhA"
  },
  "igIRbQ6pI78U636sd384Pw": {
    "date": "6/25/2019",
    "text": "The pizza was okay, the prosciutto was thick and hard to chew and the pizza was just missing something. The Mac and cheese was a bit bland. Our server chelsey was great and the outside patio was nice with the misters",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NFEiVgBG9k_3yQX_fykfaA"
  },
  "Q3XWlXN4h0iTfayriPlzkQ": {
    "date": "5/11/2018",
    "text": "On my forth visit to Pitch....  We keep returning to Pitch simply because most of the food is very flavorful, the bar is spot on, and the floor staff is generally top notch.  But (there has to be a \"but\" to keep it from 5-stars) the kitchen is plagued by poor timing of the food orders.  The waitstaff repeat the mantra that they \"bring the food when it's the freshest and hottest to showcase the food.\"  In my experience, that is cover for an inexperienced head chef.  However, I cannot take any credit away from the creative dishes that are routinely delicious...even though it seems I am the last to get served and last to finish with any group I bring to Pitch.  Navigate the menu with some care.  As the name implies, Pitch is showcasing a coal-fired oven (any baseball references are conveniently coincidental).  To that end, they excel at the items utilizing the oven.  The duck is spectacular as is the pork chop.  The thin-crust pizzas are cravable in their own right, even in a town with no shortage of great artisan pizzerias.  The fired artichoke appetizer is very well executed (albeit, at times a bit over dressed so ask for the dressing on the side).  Pastas are a standard fare and likely won't be the item to dazzle you but certainly will leave you satisfied.  Go to Pitch for the incredibly fun atmosphere and coal fired fare.  As I said in a previous review of Pitch, I wish they would open up another restaurant closer to my home in North Scottsdale; perhaps \"Catch.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gvZueXzaDjZrvADRORzfvQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gvZueXzaDjZrvADRORzfvQ/o.jpg"
      }
    ],
    "user_id": "f2fARVF59BhR0FbWO8nrXw"
  },
  "ZgznFjIrVdCzIx_A53H6ag": {
    "date": "10/30/2018",
    "text": "We keep coming back here. The olive appetizer alone will do that to you. The pizza and salads are the bomb, too. I like that our doggy can sit on the patio with us. I will ask people with the nasty huskies to keep them at home please. There was like a whole husky melt down while we were there. dogs are like kids, not all are public-worthy. Just saying. The staff here are great. I have not been disappointed. And I will be back cuz lazy Sundays are made for sitting outside wit a beer and a pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oHFc1G9x-IlXMdeL6bkdpA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oHFc1G9x-IlXMdeL6bkdpA/o.jpg"
      },
      {
        "img_id": "MEnWLrKL--1MIYkbmfBxRg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. You can&amp;#39;t lose  eat olives",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MEnWLrKL--1MIYkbmfBxRg/o.jpg"
      }
    ],
    "user_id": "djP46l4v0TQTqhLa-ZB1xw"
  },
  "8pv9cC1BMvL9kZ2eK2HH2w": {
    "date": "9/1/2019",
    "text": "Love this place! Had dinner last night one in our party with celiac I am vegan and they did an amazing job of accommodating us. The food was extremely delicious and there are over 200 wines to choose from. Brian and Carlos did a great job of making us feel welcome and taking care of us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MmtjySvhGsC07oQS-aK4tA"
  },
  "5z82xTW9sWzfjQKr_E0G1A": {
    "date": "2/26/2019",
    "text": "No doubt, the food is good. You won't be disappointed as long as you don't make modifications. It's not the cheapest lunch but if you're willing to splurge a titch, Pitch is great.  Why 2 stars?   I've been there 4 times in the last 10 months and regardless of how busy the restaurant is, the first and last plates at the table are served 20 minutes apart. Not exaggerating, it's been timed before. I've been in groups of 2 and 3 up to 12. When it was me and a friend, he finished his burger before my salad came out. It's a feature of the ambiance, I guess.  The specials are stated like this \"today's special is a barbecue sandwich and a [unrelated words] Wonder. It's the Wonder of the day\". What kind of meat is the barbecue sandwich? What type of bread? What makes it bbq, does it have sauce or a dry rub? I lost interest at \"Wonder of the day\"  On the way out, I asked for a draft cold brew to go. It was $6. I don't like ice so I asked for no ice. They poured me 2/3rds of the cup... Listen, I'm frugal but that's cheap. Feeling brazen I asked for them to top it off. The first waitress walking by offered to help but not before she wandered around for a minute. Feeling extra brazen, I asked the bartender who poured the original to top it off. Lasers shout out her eyes and melted the bottom of the plastic cup so she had to get me a new one that was repoured the bare limit of what could be called \"a full cup\".  I made this review because every experience is pretty similar. So why two stars? 2 for good food (not great) and 0 for service.  If this were the corporate world, \"service at Pitch\" would be identified as \"an opportunity\".",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZqSLlfGqXB8K4fhRWwqy0g"
  },
  "MzoUeGev0XGTzANSlkvxEw": {
    "date": "4/10/2019",
    "text": "Great place. Came in with a group of 12 for a work lunch. They were able to handle the group just fine. Service was attentive, and food came our relatively quickly. Everyone was very satisfied with their meals. Definitely recommend the shrimp tagliatelle! Most places skimp on shrimp dishes, but pitch is very generous with it. A big plus! Atmosphere was really great as well. Will absolutely be back to try brunch and dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "gp70im63kc-zrjyaECIriw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Shrimp Scampi Tagliatelle",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gp70im63kc-zrjyaECIriw/o.jpg"
      }
    ],
    "user_id": "F8qKwFsbt-BwhRZHmsXwbg"
  },
  "t_yUcay5wX4WKHwdOs_J6A": {
    "date": "6/8/2019",
    "text": "6 of us had dinner at pitch restaurant , Scottsdale Az . I mentioned to the waiter the blinding sun in our eyes as well as others . I was told nothing can be done . One of our guests requested bread and was informed that's not possible . Upon leaving the restaurant I called up the owner who could care less , didn't apologize and basically said to not come back after he hung up . Great place to avoid in spite of the tasty food and good service . The owner has a non caring attitude nor requested we return to have a pleasant experience .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "L1GfOk9AL0qXOFYfSLyl8A"
  },
  "jo-DT_zso3HiF83B7RTe-A": {
    "date": "7/26/2019",
    "text": "Have been a couple times over the past year and I feel like it is going downhill. Got the mixed greens salad (didn't tell them it was to share to avoid the unnecessary split fee) and it tasted (and looked) like a bagged salad from the grocery store that was covered in a too thick dressing. It could have easily been half the size as well, it was unnecessarily huge. The pizza's we got were fine, mine was GF which cost an extra $5 (I know there will be an additional fee but that's a tad high especially since it's not noted on the menu). The worst part though was them charging $2 for each glass of fountain Coke, that's just nickel and dime-ing you. The service was fine but for a final check of $80, it doesn't feel worth it and seems like it's going downhill.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C79V1J342Mxc_yxLqUYjDA"
  },
  "pgbugUDn_HJznKQ8q0NAhg": {
    "date": "9/7/2018",
    "text": "Well I may be biased because I'm from Nebraska and the original Pitch originated in Omaha , but in all truthfulness this place is the bomb!  Atmosphere is hip and casual all in the same ! Large outdoor seating area as well as indoor ! Yard game area for entertainment too. We ordered the wedge salad , chicken pesto pizza and a build your own pizza. All were top notch ! Our server was friendly, attentive  and helpful . Family friendly but also cool enough for an adult outing too !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iH7YrIY7nFgoYzCG1YRHAg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Build your own",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iH7YrIY7nFgoYzCG1YRHAg/o.jpg"
      },
      {
        "img_id": "GJR5gWWTY4BKJ8NZuknY_A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Indoor seating",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GJR5gWWTY4BKJ8NZuknY_A/o.jpg"
      },
      {
        "img_id": "RbBPPQ1IW-rxs17htJu8qw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RbBPPQ1IW-rxs17htJu8qw/o.jpg"
      }
    ],
    "user_id": "lCBgLGo8jGqa3qiUUX_XNA"
  },
  "lY0dntMb3uPUsVHxodLnEA": {
    "date": "5/23/2019",
    "text": "Such a great first experience! Service was great, our waitress was attentive & very helpful. The weather was wonderful, so we opted for the patio. A 3 piece band was playing cover songs that set the mood perfectly. The food was fantastic! We started with meatballs, French fries & onion rings to snack on. The meatballs were delicious. Better than homemade. Main course consisted of Pappardelle pasta with house made sausage, the VIP smoked cheddar Mac & cheese, and the Thai pie. Everything was amazing! Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "60_lsQJ8JEGfZeXcTgKn8Q"
  },
  "vKH8ZSloOunJSixORP8_Kg": {
    "date": "3/17/2019",
    "text": "The restaurant is great with indoor and outdoor seating.  They have a vast selection of speciality cocktails an excellent sangria.  The food is wonderful with many specialities.  They are all worth a try.  The outdoor seating is pet friendly.  the only downside was management allowed small children to run wild screaming throughout the outdoor area and did not hold the parents accountable.  The reason for only 2 stars  in place of a solid 4 to 5 the place should deserve.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zB9qSy9Po4uWtdFgO5_X3A"
  },
  "WlNlQGZFSCLQBEyj2f64aQ": {
    "date": "11/28/2017",
    "text": "WOW, WOW, WOW is all that I can say! We are SO excited to have this fabulous new restaurant within biking distance from our house. There are so many great things about this place, I don't even know where to begin so i'm going to make bullet points to make sure that I don't miss a thing!  *Dog-friendly patio *Happy Hour from 3-7p *Gorgeous open-air ambiance *Super friendly service *DELICIOUS cocktails - I had a cucumber + jalapeno mule and it was so fresh and tasty! Not too sweet either.  *They use locally sourced, organic ingredients *Great beer selection *FOOD IS AMAZING!   We ordered their grilled artichoke appetizer to start and you guys, I will be dreaming about this for days. There were 4 BIG artichoke heart halves + stems, grilled to perfection served over a crunchy flatbread with homemade hummus, over mixed greens with tomatoes and an onion vinaigrette. It was all topped with LOADS of parmesan cheese! Like BEYOND dreamy.  For the pizza, we split The Doc which was packed with so many goodies! It had mozzarella, tomatoes, fennel sausage, pancetta, goat cheese, asparagus, and basil, to name a few.   We will be back SO SOON. Like maybe this weekend!! :) Welcome to the neighborhood, Pitch!",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 29,
      "cool": 22
    },
    "photos": [
      {
        "img_id": "knZMDCuW7non8cYokxbiVw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/knZMDCuW7non8cYokxbiVw/o.jpg"
      },
      {
        "img_id": "5k0QldLu-XiC97GU2ocT5A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5k0QldLu-XiC97GU2ocT5A/o.jpg"
      },
      {
        "img_id": "ro71Ddy2ivlgLgsEodiE8Q",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ro71Ddy2ivlgLgsEodiE8Q/o.jpg"
      }
    ],
    "user_id": "e6iCOIhtupBCiw-VwBvJ4A"
  },
  "MgqkHG9pW2rvK3u6vykvfA": {
    "date": "7/26/2018",
    "text": "All I can say is, \"YUUUUUUUUUMMO!!\" First time dining here was last night and they did not disappoint. The ambiance, crew, food and drinks were all on point. We started with the Charcuterie Board, and shared Spaghetti & Meatballs as well as the Bianco Verde Pizza. Holy flavor explosion in your mouth Batman!  The pasta was great. It was perfectly el dente home made pasta, with a very robust sauce and 4 small meatballs. My husband loved it. I thought it was a bit on the salty side, but that sure didn't stop us from practically licking the plate clean.  The Pizza... Wham, bam, thank you mam, slap your grandma, good!!  Unfortunately we were so full from the meats and cheese (careful looks can be deceiving with that board. It looks lite but man is it filling), we were only able to fit one slice of pizza each, but it was the best darn slice of pizza I've had in a loooooooong time.  Our server Reilly was fantastic! I didnt really care for my cocktail, The Cucumber Smash. It was very tart. He brought it back to the bar and had some adjustments made, it was perfect. Cool and refreshing. All in all my husband and I had a great time and we very much look forward to coming back. Thank you Reilly!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s5_035akUQV_JD6yR9EWng",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Dessert menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/s5_035akUQV_JD6yR9EWng/o.jpg"
      },
      {
        "img_id": "Nk-7ghma2rA51TY5guHj4w",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Bianco Verde Pizza is the best!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Nk-7ghma2rA51TY5guHj4w/o.jpg"
      }
    ],
    "user_id": "tsXlmhcm5I43HrWvzrH9ew"
  },
  "Y9FZH4OvzJYNqKPhPf837Q": {
    "date": "7/25/2018",
    "text": "Home run on this place. Great local food with a great selection of flavors and drinks. Staff is outstanding and knowledgeable in recommendations of popular favorites. I had the Mia with egg pizza very delicious. So if your tired of the same old dugout, grab your gear and head to the Pitch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HzfRROsGqBH1ls7VqREVdA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HzfRROsGqBH1ls7VqREVdA/o.jpg"
      },
      {
        "img_id": "ftm_K5TWUkctGiOMiPrS8A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Mia with egg",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ftm_K5TWUkctGiOMiPrS8A/o.jpg"
      }
    ],
    "user_id": "TTgWm6G6JSMWFjuCaE3jhw"
  },
  "rT-PBsnGwzbF2zSTBanccQ": {
    "date": "11/29/2017",
    "text": "If you're confused as I was, yes this place is surrounded by a bunch of businesses. I went for weekend brunch with one of my bros. FYI, parking on the left side if you don't know how to enter.  The menu was very extensive. Even so, we still opted for some of the daily specials, like a smoked salmon omelette and a peppadew steak pizza.   I opted for the chicken fried steak and eggs. Classic dish doesn't seem too adventurous, but they made a gravy with white wine that was actually on point. The steak was well battered and thin, just as I like it. However, I will say it wasn't a perfect experience. The succotash had good beans and ham, but it felt like the potatoes were on the side of barely done. Two or three minutes on the flat-top or fryer would have made the dish a home run for me.   The pizza was largely successful, and I think worth being their focus. The thin crust somehow held up against more than a generous portion of toppings, with being neither burnt nor oily. It was a little heavy on peppadews for me, but that might be personal preference. It does get my approval though, and I'll definitely be back to try some of the dinner staples.  Out of curiosity, we tried the creme brulee. Beyond the crisp sugary layer you see specks of black for the fresh vanilla, which you don't see often at restaurants. Some might say it's runny, but I actually loved the softer base - made it eat more like a pudding then a flan.   I think Pitch has a lot of potential, with solid brews and food. I hope it continues to do well so I can come back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "rxt11UOIOZ-rg0ukAU4udw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Chicken fried steak",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rxt11UOIOZ-rg0ukAU4udw/o.jpg"
      },
      {
        "img_id": "eQTiWenC3WeqZUv5iMn8HA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Weekend special smoked salmon omelette",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eQTiWenC3WeqZUv5iMn8HA/o.jpg"
      },
      {
        "img_id": "QdtLkX6wzooR6jVCPm-_-w",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Weekend special filet and peppadew pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QdtLkX6wzooR6jVCPm-_-w/o.jpg"
      }
    ],
    "user_id": "T6jCRh9Qi6bzAp-TG2Duvw"
  },
  "oRAkgnjso3nxkRIpX3L_Pw": {
    "date": "6/20/2019",
    "text": "Went to pitch for a going away dinner with my theta fam. It was amazing! Got the arugula salad which was in a proscuitto bowl and we split the mac and cheese which was so good. Also tried the sausage/pep pizza and fries :') the tiramisu we got for dessert was bomb. Mike was our server and was so nice and asked if we needed anything. Lots of photo ops at sunset and great lighting outside. Cute ambiance :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SMh8u7yBica-Ue944v-zfw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SMh8u7yBica-Ue944v-zfw/o.jpg"
      },
      {
        "img_id": "21o1LD9tvkmH8VuwomgZLA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Normal mac &amp;amp; cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/21o1LD9tvkmH8VuwomgZLA/o.jpg"
      },
      {
        "img_id": "MorwY4oLze6VuxUqqN9jsA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Tiramisu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MorwY4oLze6VuxUqqN9jsA/o.jpg"
      }
    ],
    "user_id": "n802p88277u-vRXQfHethQ"
  },
  "Gsog_XqE4_HM_uYKF0jTYA": {
    "date": "1/8/2018",
    "text": "Definitely add this to your list of restaurants to visit in the Valley! We enjoyed a couple appetizers, a pizza, and pasta...and all of it was so tasty. Four of us shared the truffle fries with 3 different aioli sauces for dipping, roasted brussel sprouts (I prefer mine a little less crunchy, but the flavors were yummy), scampi rigatoni, and finished with the mia pizza + 3 eggs on top. We even had a bit of leftover pizza and pasta to send home with my mom for our stepdad. The ambiance was great. Our server was sweet and a great salesperson. The food was a hit! I also like that there were quite a few people in the restaurant, but it didn't feel crowded or noisy. We'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "CJdIbkfi_gwR5FAwJc8V7A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CJdIbkfi_gwR5FAwJc8V7A/o.jpg"
      },
      {
        "img_id": "2MsP-aJ-K-LTRUEaRgb50A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Mia + egg. The egg whites were a bit runny for my taste, but overall the pizza was amazing. I&amp;#39;d definitely have it again!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2MsP-aJ-K-LTRUEaRgb50A/o.jpg"
      },
      {
        "img_id": "NzyNmMbYyz2DdZApfBI8yg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Scampi rigatoni. The sauce, the noodles, the bread, the shrimp...it was all spot on! I&amp;#39;d like another plate of this please!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NzyNmMbYyz2DdZApfBI8yg/o.jpg"
      }
    ],
    "user_id": "hiEQhuyMOSKCvVqmHrpvhg"
  },
  "57IsTzbdOgeeOlCocLOfpw": {
    "date": "2/20/2018",
    "text": "Great restaurant.   Service is good.  You just don't know it's a restaurant from the outside.   Many of us in the neighborhood thought it was an indoor batting cage.   Lol.  Try it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8eUbHdvkMNsP8ZFPSnckiA"
  },
  "cAW8vejsPjoZaok7EIpfhA": {
    "date": "2/3/2018",
    "text": "This place is amazing!! Great food, amazing atmosphere and the staff is more then accommodating!! Dean the owner went above & beyond!!! A must try! Thank you for moving to our hood!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UNVPPQTyLNCaqbU1puE5bg"
  },
  "kOUQI1jSbCewj7xluXrHMg": {
    "date": "11/12/2017",
    "text": "This spot just opened up in the Quad on 64th and Thomas. So it's right beside my office. Great device and the outdoor patio space was perfect for our large group. So excited to have this option so close by!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "0MholbJWD8LHKpU7Fa6wGw"
  },
  "D8JqDyaqEaYNa5bOiw11og": {
    "date": "2/14/2018",
    "text": "Pitch was so tasty! Amanda took care of us and did a great job. She was very personable and had so much knowledge about the food and the concept. The arugula salad was so awesome. It was a great choice for a birthday lunch. Thanks guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SwFNjLmgr8xk4XkGAfXL-A"
  },
  "iVaBpc1Xac66Vvvc9oUbsQ": {
    "date": "11/9/2017",
    "text": "Great opening night with Dean and his team at Pitch last night.  Excellent Tuscan white bean appetizer and meatball pizza, not to mention a strong selection of California and Italian reds.  Service with a smile and a great vibe made for an enjoyable evening.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fZOLwC9rGSPOv3qJ4Scdhg"
  },
  "Fr7cr8uhu_msWF_TB4p5hA": {
    "date": "8/25/2018",
    "text": "A great night at Pitch. Comfortable vibe, great staff with corresponding great service. Owner was friendly and communicative, offered a wine cellar tour. Don't miss the meatballs and house Malbec. Loved the lighting and outside views.  Overall great experience, we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BB39PJGGIQOwmIY9_d3qcQ"
  },
  "6KWdQZl2qneB7BaXzUVF0w": {
    "date": "6/2/2018",
    "text": "We went here a few months ago for happy hour. The restaurant has a great dog-friendly patio and is within walking distance of our house so we figured this would be a great staple in our happy hour repertoire. The menu is also what I consider leaning towards the \"foodie\" sphere, so we were extra excited. The place crashed and burned hard. They don't have many beers on tap, and only 1 IPA on their entire menu. They cater to cocktails and wine. We started with the calamari; it was bad. I had a few pieces and stopped eating. My date found a piece of plastic bag literally fried into the breading of the calamari, suggesting their calamari comes in a frozen bag. When we mentioned this the manager(?) that came by, he didn't seem phased. We also ordered the arugula salad and the Mia pizza. The salad was good, although the more expensive ingredients (e.g., pear, gorgonzola) were sparse. The pizza was a disaster. I can honestly say it is the worse pizza I have ever had from a restaurant. It tasted like something that you'd buy in the Walmart freezer section AND it was almost $20. It is one thing to be a shitty hole-in-the-wall restaurant, but what pissed me off is that they pretend to be a \"foodie\" location. I walked out of there wishing I had ordered from Dominos, that is how bad it was. On the walk home we left the leftover pizza on the corner near the trash in case a homeless person came by. If you want good pizza go to La Grande Orange in Arcadia.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5FyU8gjovKM1SnLmhAwruA"
  },
  "uvRnH8gMzmUdtNEf57CKhw": {
    "date": "12/3/2017",
    "text": "Nice patio but super turned off by the service. I made a comment about the potatoes in my dish being under cooked and my waitress gave me a weird look, said \"ok\"  and walked away. A simple acknowledgment or apology would had sufficed. Things like this make me not want to return to restaurants.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tgj3WpkmjHlO4vkD8etE1g"
  },
  "CgNX4o_1KeVOCVluTKCHkQ": {
    "date": "1/1/2018",
    "text": "First experience at Pitch was a great one for us! We decided to bring in the New Year with brunch at a new neighborhood restaurant, Pitch was the destination. Staff was super friendly and food was extra yummy. We each ordered the creme brulee french toast (servers recommendation.) Serving was on the smaller side, glad we ordered a side of bacon to accompany. Dining with a toddler can be challenging but we found the staff and atmosphere to be inviting. It was a huge plus that they had a nice courtyard for our little one to run off some energy.  Thank you Pitch for the great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xlzun3_iFzaFwFImLM6E6Q"
  },
  "aqLUcqKRJFGXcWoEynPEuw": {
    "date": "1/25/2018",
    "text": "Came here with my dad a month or two after it first opened. Great history behind the restaurant with a very open feel. The service was great and the food was pretty good. Ordered a few appetizers and a couple pizza's. I'd recommend the pizza and to sit on the patio. I'd highly recommend for a off site work happy hour or going out in groups.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3cECXn-q3aMb0Z7oQb6Etw"
  },
  "NImRSL3A_eNMQSuENLR2QA": {
    "date": "11/28/2017",
    "text": "We love coming here after our bike ride around the canals. Our server Cooper is top notch and makes us feel right at home. I am obsessed with their wings and gorgonzola sauce (I came back after 3 days because I was craving their wings.) Their pastas are rich in flavor and can be enough for two people. Their pizzas are also great and I like their Red Sangria. Give this place a try! They also have a good brunch menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jDoR1VKY9mnWur0YVdF2HQ"
  },
  "CQqe8XK4UCE5A6_M25-yVg": {
    "date": "3/4/2018",
    "text": "We've had great experiences at Pitch! Their IPA on draft is amazing and their short ribs and ribeye were both amazing, as well! This is our neighborhood \"go to\" spot. Their staff is always friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o6nb0xOEYELvwaCPMGd2Xg"
  },
  "GOhdTHht1QjzfWaIdg_ATA": {
    "date": "7/4/2018",
    "text": "Food is awesome.... our waitress Machelle was equally as awesome..... they have a good artichoke app and we shared pizza and wine :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_vE-mLBNXAqkz-7YJYwrIg"
  },
  "jbkL_VQNvGuXPO9JQiUwvQ": {
    "date": "12/3/2017",
    "text": "I first came here thinking it was a bar. Nope, Food is great with big portions and the drinks are like most places that serve cocktails. Try the onion rings with honey. The staff was very friendly and nice. And great atmosphere with the music that is upbeat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jwZAlUn83Q9PpeFUoDbg9Q"
  },
  "BV2ZmPQVBU5aFVCV1qCdkA": {
    "date": "2/25/2018",
    "text": "Great brunch!!!  Perfect portions with lots of flavor.  Service was outstanding.  Be sure to ask about the Wonder of the Weekend (WOW).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "58_o-B2pOcPXhtV2lfFMAA"
  },
  "IXQB_PYyfP5765HSuxPpgQ": {
    "date": "2/1/2018",
    "text": "I'm so glad there is now a Pitch in Scottsdale!! Love their wine selection and the pizza is always on point (and the mac&cheese and burger- yum) Not to mention the staff and service is solid! Their specials are always unique and tasty and the ambiance is relaxing and classy! They have two locations in Omaha and when I lived there, it was our go-to spot...I would highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-s0lB0j-wj4kF5NO6DF2ew"
  },
  "MA-j_3383s1uGuAkI2_mqg": {
    "date": "12/15/2017",
    "text": "Love this upscale neighborhood pizza/wine bar.  They are always busy!  I have been several times and I always get great service and great food and drinks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FCHWcRIYX7eikA-A12v3OQ"
  },
  "zofQvHYO_4VPaZy2tcSVaQ": {
    "date": "11/24/2017",
    "text": "Great service, atmosphere and very diverse (and delicious!) menu. Would highly recommend. I will definitely be back to Pitch again very soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zsMraIDfU4saztfZt1lVVA"
  },
  "cRG_66CJT5t-sMDXpozO4g": {
    "date": "11/16/2017",
    "text": "Stopped for a drink, cool set up and layout had the crab cake app very good. Pizza looked little over priced. I will return",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YV_cseeL3ZDEPC9A_xvtpw"
  },
  "MEcsjM2upB-ztOBzsImbuw": {
    "date": "3/31/2018",
    "text": "Tried hard to like this place because of the patio, but after 3 tries, we're giving up.   Terrible service and mediocre food.   The construction on Thomas Road makes it hard to get there, and it's not worth the trouble.  Much better choices are close--- the Vig (much better patio and great food), or Cold Beers & Cheeseburgers (40th & Indian School, or Old Town Scottsdale), or Chelsea's Kitchen (outstanding patio and outstanding food).",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "iFxOT2Y9Vw0bWei6g-I9QQ"
  },
  "6NmpwNoPat8GyapiGauavA": {
    "date": "6/4/2018",
    "text": "My 1st Yelp review. This place is so delicious. The flavors are so unique and blend together so well. Try the Artichoke starter and the Bianco Verde Pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hEPerwN1atYWSln7uuabdQ"
  },
  "uHF4nX2ECvmf4bJ1KnNREQ": {
    "date": "2/8/2018",
    "text": "My new favorite place! Everything about this place is awesome... actually BEYOND awesome.  I had the wedge salad with shrimp and it was fabulous.  My friends had a delicious mushroom burger and Turkey melt.  The presentation was great,  the customer service was unlike any I've experienced in a very long time.  Before leaving,  I asked who I thought was the manager,  who owned the restaurant and he said, \"me, and a couple others\".. as he proceeded to clear our dishes.  An owner actually out and about talking to customers and clearing dishes??? what the whaaat?  Amazing!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HN555NqNJKqRoUyhrJrJhg"
  },
  "s2CQ3rtJ6x2NLukwU8QD6w": {
    "date": "11/30/2017",
    "text": "The breakfast sandwich is AMAZING!  The ham and bacon combo with the basil pesto aioli!!!  Try it!  You will love it!!!!  Pam",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6RKc2XKIUtBlsBiu62WhRQ"
  },
  "OCenldBQ1JL0u_E2fT0juQ": {
    "date": "5/28/2018",
    "text": "Great food, great service, great atmosphere.  The pizza is amazing and the appetizers are too. I love that they have an area outside to play while you wait.  The kids liked playing while we waited, but it wasn't for long despite how busy the restaurant was. The beet gnocchi appetizer is to die for. The Pims Cup is refreshing. The wild mushrooms on the pizza are breathtaking. The entrance is a little difficult to find but more than worth it to walk around a bit. Try it and fall in love with this excellent restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ta8otILW7T9R4TyJ90dBaw"
  },
  "fqRqZxZHe4OMjAnsQ4mChw": {
    "date": "1/4/2018",
    "text": "My fav new go to brunch spot!! Just down the street fun decor and friendly staff!! Located in The Quad on thomas a new installment and is a great eatery by day for breakfast, lunch and wine bar or dinner at night! I recommend coming here and relaxing on the patio where it is pet friendly and enjoy a good Bloody Mary or cocktail. Some brunch choices i Love is the short rib breakfast burrito and creme brulee french toast. They also have seasonal tastes of the day one was the red velvet french toast which is to die for yummy!! Come check it out so it stays open!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "CHomvHLiappeENd8SbU9nQ"
  },
  "W-YuLzt7afx30u8YpKTnHQ": {
    "date": "12/2/2017",
    "text": "I was excited to try this new restaurant as it is in walking distance from my home, and has a nice outdoor patio.  My first experience was just ok.  Our server was very inexperienced and very under-trained,  breakfast was ok.  coffee was good but they charged me 50 cents for milk they had put in the coffee!!!  that was a shock....however, .being so convenient,I decided to give it another try for lunch, and this time I brought  my family. on a whole the food is fresh and good. The problem occurs with the staff, the waitress and mostly the management.    My brother ordered a breakfast sandwich and asked if the meats (ham and bacon) could be substituted for avocado. and the croissant be substituted for wheat bread.  .   .  He  specifically said \" if that couldn't be done he would choose something else\".  the waitress said \"no problem\"   the orders arrived and  the sandwich was made on a Croissant. :(  He decided to just eat it.  Also,  the little side salad had no dressing on it at all.   he politely asked for some dressing.   When the bill arrived they CHARGED for the avocado as an add on, not substitution for the meats... and they also charged for the salad dressing!!!! , which they had forgotten to put on the salad to begin with... well, I'm a believer that people are reasonable. when we asked about these charges the waitress said, she was sorry but didnt have authority do anything about it. we requested to talk to  the manager, who then came over. and instead of apologizing and taking care of the errors  he was  ARGUMENATIVE, RUDE, SARCASTIC and SURLY.  He presented with the  WORST customer service I have experienced in my 38 years of living in Arizona.  There are many good venues, & great food choices in the phoenix/Scottsdale area.  I will definitely not be returning to Pitch and I'd encourage anyone in the Arcadia/Scottsdale area to spend your money at a place with friendly ,nice staff and management that want to build community and relationships. These people running Pitch don't have a clue of how to become part of a neighborhood, build a local brand, or even how to create a successful business in a closely knit , highly competitive market like ours. Take your inexperienced, brusque, curt and gruff staff back to Omaha......youre not the kind of business we want in our neighborhood.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 11,
      "cool": 4
    },
    "photos": [],
    "user_id": "4SWzb19KwEzlAbIXUMLnvQ"
  },
  "FYH6w0WwM5VlZnYaw-3X_A": {
    "date": "11/10/2018",
    "text": "Went in for a couple drinks and bite and ended up staying almost all night! Great atmosphere, our server Taylor was very friendly, personable, and accessable. We never waited for any drinks, had a great time and I'm definitely looking forward to going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nr4JDyp6twzQF5YvGvF-Dg"
  },
  "z1_cspoe2fkI0UCAfF7m0Q": {
    "date": "2/26/2018",
    "text": "Great location, the food is so-so though. Appetizer and wine selection is outstanding, but pizza and dessert was mediocre.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d7UIZdzAlEGlYNoORR8spA"
  },
  "CUOxFf9oxm0fRImUXw4hNQ": {
    "date": "12/6/2017",
    "text": "We stopped in on a Sunday afternoon for a drink and some dinner.  What a great new place in an unexpected location.  Lively atmosphere, airy indoor/outdoor space, friendly staff and tasty food.  I enjoyed a Stella cidre and we shared an order of fries and a meatball pizza.  Definitely a great addition to that neighborhood!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "cMEtAiW60I5wE_vLfTxoJQ"
  },
  "8m0zRnqJhWG67g396-mFBg": {
    "date": "3/20/2018",
    "text": "Love it! Super friendly staff, awesome food, fabulous wine selection! One of my favorite \"go to\" spots in town! The Thai pizza is absolutely amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuwY7PHHJHyEflOWbzrU5w"
  },
  "eUD5fNphy_NptRZoXEeR1g": {
    "date": "2/18/2018",
    "text": "Great new addition to the area, fantastic menu, great patio, and good music! They ha e a fabulous happy hour as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sMQmmEl3SLAH0v9E4uKo3g"
  },
  "Krd-vHHy0QAwqlQfY5rLtw": {
    "date": "2/16/2018",
    "text": "It's cute and new - the vibe is casual and hip. Plenty of parking without the annoyance of valet. Staff is attentive. Menu is big on pistachio but has something for everyone - open concept with plenty of seating. Ordered the Brussel sprouts which we loved!  The gnocchi was amazing! Served in cast iron to keep warm ... the dishes are all very large prepare for leftovers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VNjd0iwrMFfOxQgBlwKo2Q"
  },
  "sSlxAWzHSP3D9xk8lHSjfA": {
    "date": "4/28/2018",
    "text": "Cooper is by far the best server around! She is wonderful even each time we come in, she remembers are name and gives us 5 star treatment. Also the food is amazing! Everything we have ordered here had been nothing but pure perfection. The wine is fabulous. The owners are so friendly and make sure you are taken care of.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6x0dxqRPMdHZKeTwh7DvaA"
  },
  "FnQYxJzGiV2leCTvIbK63g": {
    "date": "1/15/2018",
    "text": "After reading all the rave reviews, we gave this place a try last weekend. The service was decent, atmosphere is great (except for being sat at the end of a large table with a big birthday party at the other end), cocktails and food were fine, but overall everything they do is already done better by someone else in the valley. Additionally, their prices are high in comparison to the quality of food and wine (by the glass) served.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8re_y3nclK9R8Vh6uXIB5w"
  },
  "n2-M0TtYNBGR_0RJp7IBRw": {
    "date": "3/17/2018",
    "text": "Atmosphere: Great Food: Good Employees: Great Service: A bit slow but sufficient Prices: High  I'm unsure whether this is common, but they don't provide wait times. I found this annoying because I was unsure whether our group of six would be waiting for 10 minutes or 60.   I recommend Pitch provide wait times to customers, even if they're grossly overestimated. Better to under-promise and under-deliver, right?  The prices will probably keep us away, but I still recommend it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7J8UAcGqJ3R6A-fMKNocXw"
  },
  "8-eU5aKF5VgTkcBRkjIdag": {
    "date": "9/9/2018",
    "text": "So good. Lobster Mac, Short Ribs, Good Morning MIA with Jalapenos, Creme Brulee French Toast, Truffle Fries, Brussels Sprouts, Scampi Rigatoni. MEATBALLS!! Buffalo Wings, those things rock my face off. Short Rib Burrito with Jalapeno Green Chile Gravy for brunch!! Yes. Creamy Beans. Crab Cakes. Salmon. Pizza and a bottle of wine for 30 bucks, are you kidding me!? Great service, accommodating and knowledgeable. Great Cocktails. Phenomenal liquor options. Best wine list in the Valley. Beer list should be sampled as well as the Scotch and Tequila selections. Check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nAQyKAAjs9DLUyos5Q9E1w"
  },
  "587EfMOhDmlA9YJze0Ss6w": {
    "date": "11/11/2017",
    "text": "I'll start with the good. The patio, atmosphere, and location off the canal earned 3 starts. We rode our bikes here on Friday night with a group of friends. The service was ok, slower, but expected being a new restaurant. Our server was young and messed up a few of the drinks but got the food orders correct and that came out quickly.   But man, the food and the prices wouldn't ever make me want to go back. I was blown away by the prices- $16 for a chicken Caesar salad that was Small and plain. And pizzas are 12\" thin crust for $21! We got the doc as that was what she recommended and hated it. The ingredients didn't work and it had an odd spice. The calamari was big but not much seafood, rather a lot of battered zucchini and way too much breading. Overall we were disappointed. And for a few drinks and some food each couple spent around $75-$100. For beer, wine, and pizza. Not impressed. For this location they better get the prices down or I don't see this place making it.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "Qt6KlG9mVG2h87pJ7jVADA"
  },
  "R0U6TEwQ88Dfe-5FK4Laiw": {
    "date": "2/25/2018",
    "text": "I did like this new addition to valley dining. How cool is the fact they are a scratch kitchen. The food including the Brussels sprouts are absolute FIRE. I have a pizza and the coolest part they let me put some sous viid eggs on top. Definitely something I've never done before. My god it was worth it. The cocktails need a little shaking but once you stir them up they tasted decent. Just a procedural issue i wanted to share",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LqXBNCAVKzw1u1YLKRD4pg"
  },
  "gg85sMN6cfjfDS7itrIOng": {
    "date": "2/7/2018",
    "text": "Patio was open, dog friendly and cute! Looks like same decor as many new places in Arcadia and Oldtown. That modern look, but it is nice! We came in an hour before Super Bowl and it was dead. It was a cute concept. We had the meatball pizza and wings. They were both good! Prices were ehhh decentish? (except for the $25 crab cakes and a few other \"specialty\" pizzas). We will definitely be back with our pup and try more things on the menu. But if they want to survive I think their prices will need to come down a bit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9QX_bdm_LXzuoWnlHZbdzg"
  },
  "4sFt3_NgpZ0ZsLkJOGmwfQ": {
    "date": "3/13/2018",
    "text": "Atmosphere, staff and food are on point! The beet gnocchi is absolutely stunning! I seriously thought it was stuffed with cheese but it's just magical all on its own. Eaten here a handful of times and have never been disappointed. Impressed with every experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "44k0K5DG5OgMnTS7YYKf2g",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Drop the beet!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/44k0K5DG5OgMnTS7YYKf2g/o.jpg"
      }
    ],
    "user_id": "EbKeAMcxQMBFXB5iMiiukg"
  },
  "Is8vGEAEnfFn-KztF3ozkA": {
    "date": "7/29/2019",
    "text": "Been here a handful of times and it's always amazing! Such a big menu with variety. I always get something I've had and know I love and something new which I end up loving as well. Great atmosphere with good eclectic music playing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ddwszJx6hmO91sNQFJq5cQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Buffalo tempura cauliflower",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ddwszJx6hmO91sNQFJq5cQ/o.jpg"
      }
    ],
    "user_id": "hfRWmsXzeJRjAqP16dCkdQ"
  },
  "YcmQD8DzfsGz3paqVOuTjQ": {
    "date": "5/31/2019",
    "text": "Once again the service was as bad as the last time. When will we ever learn? We want it to be a success so hopefully they will take it to heart.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "4O4GqbqnH1stCNfBYlV91Q"
  },
  "_ZYLiiUlg99b-ovftIwHBg": {
    "date": "3/2/2019",
    "text": "Fout of us dropped in for afternoon drinks and we ended up being a table of eight. We sat outside on their beautiful patio. Metal structure intertwined with sails. We all enjoyed Happy Hour pricing on our drinks. What a nice surprise HH starts at 2pm here. The Cosmopolitan was excellent. My son in law had some different Mules and he enjoyed them. My son & wife enjoyed 50% off a bottle of wine. The food was very good also. The place became busy, when offices closed. We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ry465EXe4WqA2lHjRAdWZw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Short rib Nachos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ry465EXe4WqA2lHjRAdWZw/o.jpg"
      },
      {
        "img_id": "KNWkvp25fihgggwwb2v-LA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Bianco Verde",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KNWkvp25fihgggwwb2v-LA/o.jpg"
      },
      {
        "img_id": "4bD6LmgIXLX2XTzEMh9hAQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Patio",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4bD6LmgIXLX2XTzEMh9hAQ/o.jpg"
      }
    ],
    "user_id": "pIeWXdNh0SAoZe_AtdfDPQ"
  },
  "MWEkP4bdD_u0zzRWQrd4Jg": {
    "date": "4/27/2019",
    "text": "Great place. Great service. I had my daughters birthday party there  and service was 100% fantastic. Thank you Great time  great food.  Waiters and waitresses were so gracious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k6a_cT8wvz5Yuji9CbNXCg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k6a_cT8wvz5Yuji9CbNXCg/o.jpg"
      },
      {
        "img_id": "XmbStzPiF69jchuPrRH26Q",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Shoutout to pitch and my wonderful servers for making this a great party. We drove them crazy in the beginning andthey were great",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XmbStzPiF69jchuPrRH26Q/o.jpg"
      }
    ],
    "user_id": "_z3eASnU0JeRo8nfMQjo7Q"
  },
  "3e2yPHfT1NT6knARLA7Bew": {
    "date": "7/25/2018",
    "text": "Stopped in for a late lunch around 3pm on a Saturday. It was quiet and there was just one other table. Server was pretty laidback which was fine since we were in no rush.  On the weekend they serve brunch which we both partook in I had an open face egg sandwich with spinach and topped with a rich cheese sauce. Hubby enjoyed his chicken and waffles.  Overall the food was good and the ambiance is delightful for this lovely neighborhood place.  Next time we will have to try the pizza!  The yelp pictures have my mouth watering!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "p1xL_62vI6sUH6PZfK4Ydg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Chicken and waffles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p1xL_62vI6sUH6PZfK4Ydg/o.jpg"
      },
      {
        "img_id": "E2GwqK051Uymw4LEb0f40A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/E2GwqK051Uymw4LEb0f40A/o.jpg"
      }
    ],
    "user_id": "vCYjSND9ik9HWeLzZT4pGw"
  },
  "GI4RTHJQzadyQEuDjAfUDA": {
    "date": "6/29/2018",
    "text": "My friend and I came here for lunch on a Saturday afternoon. It wasn't busy at all and we were seated right away.   I ordered the Mia pizza. Mozzarella, sausage, pepperoni, tomato sauce. It was good, but I was bummed they didn't have ranch of course. We also ordered the truffle fries to start which were good. The pizza was a pretty large size, so good to share.   The food was good, I was bummed they didn't have ranch and our waitress should be trained to be more sociable. She seemed like she didn't want to talk or smile at all. I thought it would've been busier for a Saturday. They do have a big menu though and also offer, breakfast/brunch, and happy hour. They also have a pretty cute outdoor patio too.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 10,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "kDpJInv8B7OED2yEN-NkRQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Mia pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kDpJInv8B7OED2yEN-NkRQ/o.jpg"
      }
    ],
    "user_id": "GSvZ1ZJmVqQA9O2NVfO1TQ"
  },
  "r1tg-kq2jiLZpjS51f1egw": {
    "date": "9/16/2018",
    "text": "Gets the bloody right! Has an awesome room you can rent for meetings too. Full catering in to the room, watch your limit they give you - you won't need as much more than likely. The service is amazing all day, food is awesome.   People are great- beat gnocchi is a must have!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d2iKv2AXEJjz2MFMpJeQgw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Bloody&amp;#39;s done right!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d2iKv2AXEJjz2MFMpJeQgw/o.jpg"
      },
      {
        "img_id": "sAsKklR4iMJ-UPftlayJ2A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Private meeting space",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sAsKklR4iMJ-UPftlayJ2A/o.jpg"
      }
    ],
    "user_id": "KcRKqbOjdgjq2UL1nhf9wQ"
  },
  "ys5YLMkZqWIZEzL4E2ywxw": {
    "date": "7/23/2018",
    "text": "Since moving to Scottsdale in December,  my husband and I have been obsessed with Pitch (not to mention it is a quarter mile from our house).  We have tried the bolognese, Mac and cheese, artichoke appetizer, onion rings, Thai chicken salad, short rib grilled cheese... all are stellar with no complaints.  Alcoholic drinks have a good pour so you get your money's worth.  I am a big fan of their extensive menu of Moscow Mules.  Service has been awesome every time outside of one particular waiter who seemed socially awkward, but he was nice nonetheless.   Excited to try the happy hour.  Definitely give this place a go.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mKGiKYL1JJsytnQ0LLAjGA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mKGiKYL1JJsytnQ0LLAjGA/o.jpg"
      }
    ],
    "user_id": "0syu0xSE_W5b5GdgK9IYYw"
  },
  "19SRGBff0ObphuO4vJbBKg": {
    "date": "9/6/2018",
    "text": "We started with Arnold Palmer, and Midtown Mary (Aka Bloody Mary). The topping for the Mary is tasty and creative. They put a tiny skewer, made of slide of sausage, goat cheese stuffed pepper dew, and pickled baby corn cover with spiced salt, on the drink. Both drinks are refreshing and good for Sunday brunch or hot summer.  Then we got half onion rings, and sweet & spicy rosemary wings. The onion ring batter is so delicious and not too fluffy light and not too soaky. When I dipped it with the sauce, sriracha mayo style, they go so well together. The wing plate has a nice high end design. They use the lettuce wedge with blue cheese, instead of the typical celery, carrot, ranch. The wings were juicy and the sweet & spicy rosemary sauce gave me a taste of Asian (sweet & spicy) with fresh herb (rosemary) kick. Delicious!  While waiting for the pizza, we got another round of Arnold Palmer and Midtown Mary. Then the meatball pie pizza has arrived. The meatball pie came right from the oven as we could we the steam coming out of the meatball. The meatball pie has a super thin crust and each slide has half of the big meatball on it. The fresh basil on top does enhance the favor of this delicious pie.  We were too full to get the desserts. Next time we need to plan better so we will have a chance to try the dessert.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tyLFL2zSkb8Pvvw2rMxawA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Meatball pie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tyLFL2zSkb8Pvvw2rMxawA/o.jpg"
      }
    ],
    "user_id": "USG1wkzku03asNV8TQZetw"
  },
  "MCQyj1ieIiYdBwvjwEtMkA": {
    "date": "5/21/2019",
    "text": "This place is pitchin'!! I honestly thought it was a new up and coming coworking space or incubator for startups, just based on the name and location. I was pleasantly surprised by the awesome menu and drink offerings. Beautiful patio area and cool vibe. I enjoyed the charcuterie board and the artichoke starter - YUM! Service was great and I will absolutely be back soon. Wish I had known about this place sooner!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UYoY3ISzF3RNxm2pske6Eg"
  },
  "MDeXV04TrSClHNlArah_xA": {
    "date": "8/4/2019",
    "text": "Terribly disappointing...we had to ask for 1 dish to be redone and another was completely over salted. Very expensive for what is was. Only good points...nice decor and a lovely waitress.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "q8yU-sME5rHpUr47ce4KRQ"
  },
  "GTWe0ZyrK7RO7ooFLcdFiQ": {
    "date": "12/23/2018",
    "text": "The pizza could've been more well done, but I suppose we could've asked for that. While our first pizza was slightly above average, the chicken pesto pizza was a huge disappointment. Drinks were extremely watered down with large ice cubes. Unfortunate - this place is very cute and I love the decor, just not the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NrBVzpWZFWRxMlR6uV2jrg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NrBVzpWZFWRxMlR6uV2jrg/o.jpg"
      },
      {
        "img_id": "s6iUNjXZMBBkAHspVXUD3Q",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/s6iUNjXZMBBkAHspVXUD3Q/o.jpg"
      }
    ],
    "user_id": "ojyEvT8dniHaz0qOJ6fFTQ"
  },
  "-RGzdxwdpedz_qm0lUc06Q": {
    "date": "8/17/2019",
    "text": "I am here in AZ for a work trip, so a couple of my coworkers and I wanted to get a late dinner on a Friday night before one of them had to catch a flight. We got a table with no wait! We sat outside (even though it was really hot, they had nice misters so it was perfect). We told our waitress we were in a hurry, and we got our food SO QUICKLY, it was unbelievable how quick. And it tasted amazing. I definitely recommend the buffalo cauliflower wings, meatballs and crispy Brussel sprouts! Definitely recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "07jNXOohuVbsr--GwvWnOw"
  },
  "7OA2zyl_es2dZPAAkrVXlA": {
    "date": "7/2/2019",
    "text": "That Arugula salad with Prosciutto and Shrimp was killer. 100% will be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eiTPYdhcLq33BvkDkzMxzQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Arugula and Prosciutto Salad w. Shrimp.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eiTPYdhcLq33BvkDkzMxzQ/o.jpg"
      }
    ],
    "user_id": "PoUnffuNXZaVhsEgOWxo6g"
  },
  "ivkwGPJQOBRbZEzmsoVU2Q": {
    "date": "7/7/2019",
    "text": "Buffalo cauliflower was a ridiculous explosion of goodness in my mouth! And they have like seven varieties of Moscow mules! Everyone has mules but not that many varieties.  Perfect Scottsdale vibe. If you're from here you know what that means. If you're not, it means it's classy, eclectic, a little bit boujee, and a little bit pricey. If you want a place where you pay just a bit too much but you have a nice patio with green vines and cafe lighting to take a pic for your instagram, this is your spot my friend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cOfyEq1Z0fjMyS0Iy5mVlw"
  },
  "r4WW6-4a9RSFS2PBJeTAzw": {
    "date": "2/3/2019",
    "text": "Pitch is really close to where I live so I find myself driving by it several times a week and thinking how cute the patio looks. One day, I was driving by and I saw a sign saying they sever Press Coffee. It was a done deal then; I knew I would be trying Pitch.   Finally the perfect opportunity came along. The rock and roll marathon was going on and I found myself unable to drive in any useful direction. I need a brunch place stat, within walking distance. My mom and I walked over to Pitch.  My mom for some reason thought it was three miles away and still started walking. She was very pleasantly surprised!   We sat on the patio. I ordered a mocha, made with Press Coffee, of course. My mom opted for some beer for brunch! For food, I ordered the short rib breakfast burrito. I did not think the menu did a good job describing this item, because it was way better than I thought it was going to be. It was covered in a jalapeno sauce that was more like a soup around the plate. I love sauces so I was very excited about this. It was also served with some very yummy potatoes. The menu made it seem like the potatoes were in the burrito vs. served on the side. I was really glad they were on the side; I love breakfast potatoes.   My mom ordered the weekly wonder, which is a different special each week. When we went, it was chicken enchiladas and she loved them!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U30MueFijfpUGbW39c1Arw"
  },
  "xjHpMlHu4cjL9WjIzv1Lgw": {
    "date": "11/6/2018",
    "text": "In love with this restaurant! So many yummy options. I went for the Cajun Caesar salad (half portion) with salmon $12, and it was delicious.. the salmon was cooked to perfection, and each addition to the salad enhanced it. Dont let the anchovy ingredient scare you away. Next time I'm back for lunch, I will likely order their half mixed greens and 2 meatball lunch special $10. They have yummy starters and sandwich options, but I'm most excited to come back for Happy Hour to order one of their pizzas. Their discounts on drinks is legit too- $7 Myles and $5 cocktails with a few food discounts. The oversized porch makes this the perfect date spot; a few TVs inside for sports also.",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 19,
      "cool": 17
    },
    "photos": [],
    "user_id": "hCy4Kkyo4N0fFLMDpKjYyw"
  },
  "Rt_TqqD4RrGxmCpmX57qdw": {
    "date": "4/22/2019",
    "text": "This is a nice laidback place to eat for lunch. The menu is completely overpriced and the food is average.  I come here almost everyday with coworkers because we work right next to it.  The bartender absolutely nickels and dimes us constantly. Extra charge for dressing, doesn't explain items properly so that we order things that aren't on special (I.e. the $10 soup and salad that was actually $17 because she didn't correct my friend on the parameters), etc.  We are moving offices and looking forward to changing our daily lunch routine.   I like the setup and patio. Staff is nice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "qypWuxmVSX4S1vjbnnVcqg"
  },
  "rLaq49MKrOInPPnqfn4ybQ": {
    "date": "10/18/2018",
    "text": "I've been coming here since I started working in the plaza Pitch is attached to and I love that it's a 2 minute walk from my office.    The staff is always super friendly and the inside and patio are beautiful.  Large open seating areas and huge high top tables.  I've ordered quite a few items from the menu over the last few months and I can say that everything from here is pretty dang tasty.  The Chicken Po Boy's are one of my favorites, along with the meatball Hoagie and their classic flame grilled burger.    I've tried their mac and cheese once which was very good and comes in a cast iron skillet which keeps it hot the whole meal, however the price tag is a little much for a lunch item for me.  paying almost 20 dollars for pasta and cheese is a little much if you ask me.  Their pizza's are also around the 20 dollar range which normally keeps me away from those items as well.  I do love this place and it's a regular spot in my rotation of lunch places and being in the same parking lot as my work is an added bonus!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "3IZC92G8kpoW0vBosH1i3w"
  },
  "GrFSLPRiYfSVfoOONWtrig": {
    "date": "5/18/2019",
    "text": "After looking up this place I totally thought it was sports bar by its name, but nope.  It's excellent pizza & Italian place! Had incredible service and it good place to visit from being out of town!  -Very nice patio -Good Service  -Nice Prices",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fylA6TUjV9MRjuYMKgzN8Q"
  },
  "Db-4dxVTtTNtPII1FjPiJg": {
    "date": "4/29/2018",
    "text": "Everyone's raving about this place and I don't understand why. The food was decent but over priced and service was average. Overall it's over hyped over rated and over priced.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fEBhtnpMWWp32NEJMgMrkA"
  },
  "bvXx2RIF7Zo4y3JFTcIT6A": {
    "date": "6/24/2018",
    "text": "The environment was amazing. Service was great. I sat outside at the bar. The drinks were amazing. I definitely will be back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vz86t6HUbDtXgscA4BqCPQ"
  },
  "zLsSh-LRuY82rXpPe5_cBg": {
    "date": "6/23/2018",
    "text": "Incredible experience! We were craving pizza so did a Yelp search and the pictures posted and location are what brought us in.  Was very welcoming staff, nice decor, great beer, and amazing food! We felt like regulars after the way the staff interacted with us even though it was our first time there. We will most definitely return! Thanks Pitch!  Big props to Megan and the rest of the bar staff for providing a great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "45IljdB_EGOLyKejYyHPqQ"
  },
  "IY88X4dgwAXC59GvVu7vRw": {
    "date": "4/30/2018",
    "text": "Always falls short. Food. Service. Just below the mark.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XrvQrYO7wZqrEUNKIXAEhg"
  },
  "QMioMwaGcCth6gn8usmFtQ": {
    "date": "4/20/2018",
    "text": "I enjoy the vibe of this place and their dog friendly patio! They don't have vegan options on the menu so we ordered a vegetarian pizza with no cheese, but it came out with a cream sauce. Our server was great and corrected it right away! Thanks lady!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K5CPsHcpLD68PPzkE7nF9w"
  },
  "u7XMlXHnNN6pVwlXRzt_zw": {
    "date": "5/12/2018",
    "text": "Came here for dinner and a few drinks.  Nice indoor and outdoor seating.  Couches outside with corn hole toss out on the grass.  They had a nice drink menu.  Their food menu had a nice range from  appetizers to dinner plates.  The food is your normal pub flavor.  Nothing out of the ordinary.  Great place to meet up after work as well a great place for large groups.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OHUPGzRshOmtNpJQ-xbKTA"
  },
  "d6J-YJfWPvPHHH_2v2iTYw": {
    "date": "7/16/2018",
    "text": "This place has the most amazing mushroom pizza. It's a must-try. Definitely will be coming back very soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f5ABhoSCNu-VC3FeVQpZfQ"
  },
  "D53kc_cPBiMjmvL5uSim0g": {
    "date": "12/16/2018",
    "text": "Had a great pizza and the onion rings were good.  Our server was really attentive also.   Unfortunately  our dessert was lackluster.  We had the berry cobbler which turned out to be a dish of warm blueberry pie filling with very little streusel and an even smaller scoop of ice cream.  Need to work on the desserts and portion size",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IMTc3xmw9mt8LRuui2VL5Q"
  },
  "sO1AUlUY9WAmpVofE6djzQ": {
    "date": "1/6/2019",
    "text": "Went here for the first time today after seeing the food pics on instagram, the food is better than the pics. Will try the pizza next time and definitely grab a big Miller high life  beer. Would totally recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nUmSo-MdzSQDxqMvqUYdJQ"
  },
  "VWhBdusRWz5keR2vp9J1EA": {
    "date": "3/12/2018",
    "text": "I brought a group of 10 to this venue on a Wednesday night and the service was incredible. Everyone enjoyed the food, wine, and cocktails. I had the fried brussel sprouts and a couple glasses of sangria, which were both very good! Only one person in my group got a pizza. The special that night was the taco pie and highly recommended by our server, but it was not was not my favorite. The pizza crust was really good indicating their regular pizzas are probably worth trying on a second visit.  The venue is beautiful with a large outdoor patio perfect for our Arizona evenings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wsKA93GRy0zClGd7jDa53A"
  },
  "vi5dnbSt0VpMn2yrATLrTg": {
    "date": "6/26/2018",
    "text": "A girlfriend chose this restaurant to have her birthday lunch. What a nice surprise! Pleasant decor, a lovely server and delicious lunch! It could not have been a better choice! They treated us very well and the menu has a lot of different choices! I was torn between the beet salad and the short rib grilled cheese! The grilled cheese was amazing! I had the side salad which had garbanzo beans and a sweet Italian dressing. My daughter had the truffle fries and we could not stop eating them! So tasty! We will return and sit outside in their great patio next time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3eDxZL4tX-kpWfms35xAcA"
  },
  "XLGno0YeaDPFt3wQfysnvQ": {
    "date": "2/26/2018",
    "text": "I cannot say enough about my experience there last night. I went on a lady date with a friend who travels for work so we needed a couple hours to hang out and catch up. Let's start with the staff, Brandon was our server/bartender and mainly helped us but literally the entire staff came by at some point (to deliver food, bring more water or pick up plates etc...) and they were all so friendly and looked like they enjoyed working there. We ordered the cauliflower in evoo, the Brussels with parmesan, goat cheese stuffed peppadews and the charcuterie board as well. All of it was great. The board had pickles, hummus, olives, nuts, meats (including duck prosciutto), cheeses and mustard. I mean, it was amazing. To top it off, Matt, the wine guy of this operation came over and we chatted about wine and he made an excellent selection for us. The wine list is fairly priced and on Sunday it's half priced bottles up til $90, then it's 25% off.  All that food and 3 bottles later and our bill was next to nothing. We had carrot cake to end the night and I seriously cannot wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "UjVSsatm_7KSuNvH0ZpuQA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UjVSsatm_7KSuNvH0ZpuQA/o.jpg"
      },
      {
        "img_id": "vfvuDsU0uUc5OSyw9Zra9A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. #caymus",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vfvuDsU0uUc5OSyw9Zra9A/o.jpg"
      },
      {
        "img_id": "D9RsVd43F-aQYtAom5en2A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Incredible wine list at extremely fair prices.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D9RsVd43F-aQYtAom5en2A/o.jpg"
      }
    ],
    "user_id": "OvYN86BmZyP87SaTO7mHkQ"
  },
  "xiEyswv2zmAUMJIn4n2xQQ": {
    "date": "5/12/2018",
    "text": "Stopped in for brunch today and was quite impressed. Our server Amanda was attentive and upbeat. Portions were large and food was very good. Will be stopping back to try the pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3QCT9NlijUkpOXcv1pvMGQ"
  },
  "7hMyMi_jkm3KyThCRoTrDQ": {
    "date": "12/21/2018",
    "text": "Very trendy ambiance, creative pizza ingredients, and dog friendly patio. My dog approves of the pasta as well. Delicious macaroni and cheese that will entice me to come back for more. Pizza slightly over priced but you get what you pay for and this has delicious written all over the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AWJfI-oG3Qc7MAZXu_NKGA"
  },
  "OGqGtCe48J1jFkKOANHY8w": {
    "date": "10/8/2018",
    "text": "Came for a girls night dinner and was not disappointed. The pizza was PHENOMENAL and so was the overall experience! Our waitress was nice and had really great drink suggestions, the food came out promptly and the entire restaurant was just simply lovely all around. The location is just West of Scottsdale Road on Thomas, so its a lot quieter than your average Scottsdale restaurant (score!) There is an all-glass wine cellar near the entrance which gets your mouth watering right when you step inside. Hanging all around are the gold Edison style light bulbs in orb shaped fixtures that illuminate a warm gorgeous glow everywhere. Adjacent to the bar is a very cool rustic style wooden facade mounted above their open kitchen. In it are holes and in the holes are full bottles of beautifully backlit rose wine, which is again very appealing to the eyes and the stomach. The bar has two \"sides\", inside and out, allowing for a very inviting and open, social atmosphere. When the outside portion is open you can view out to the covered patio which is well shaded during the day, and well lit at night (also has overhead warming vents for the colder months). Their happy hour is too good to be True, boasting 1/2 price bottles of wine, $5 any pizza and $1 off brews, including \"combo\" specials of Pizza&Bottle or Greens&Bottle from $30-$50. A seriously fantastic establishment that I cannot wait to visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T6VkySIRv6oZERbgi6QkOw"
  },
  "ScbDZbktBgFPebkCnz7r4g": {
    "date": "2/6/2018",
    "text": "I really wanted to like this place.... I've passed by it a couple times since I live in the area so I suggested my friend and I check it out for dinner. The atmosphere is very romantic and modern. I ordered a chicken salad and thought it was a bit pricey and the chicken was very salty. I understand that everything is farm to table and house made but the area it's in... I think prices should be a little better. Not sure if I'll go back but it was good trying something new.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "IPxA3WNS4d3NNZ2kwN0sWw"
  },
  "jhuN4icfuDYK8IhjVX0JFQ": {
    "date": "10/19/2018",
    "text": "Love this new spot in the somewhat up and coming area of Scottsdale/Arcadia. We needed something here! Service is great. My experience of the food has been good. I will say hat the main courses are always very delicious. I haven't been a fan of the sides however and wish they had some more \"normal\" side options. Very much like the reasonable prices as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0nbLNE-vjQZLsEOSZ7-_6g"
  },
  "iM2iF5qAHGCSvMCW6J24CQ": {
    "date": "5/25/2018",
    "text": "First time visiting we were recommended the meatballs as a starter and The Mia pizza, both were delicious. They created a great atmosphere at this location. I feel like we had the best table in the place, the first table outside on the patio with the doors open and a gentle AC breeze coming from inside. Good drink selection. Some good Nebraska hospitality including frying up a couple eggs for our pizza even after we had eaten a couple slices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PvlJheu4U_3X4huDg-OLfA"
  },
  "pbi4cgASuBox8DaAFNn-gg": {
    "date": "1/12/2018",
    "text": "Foodies beware....The star is for our server and the 80s music/bar atmosphere.  The food doesn't deserve any stars.  We ordered gnocchi, onion rings and an olive bowl for appetizers.  The olive bowl was ok-I mean they opened a jar and served them up-which in hind sight was preferable to having the kitchen \"prepare\" your food but this CA girl expects exceptional chef marinated home cured olives if they're actually served as an separate appetizer and not part of a cheese/charcuterie board.  The focaccia bread on top of bowl was ok. The gnocchi dough was made properly but cut into uneven pieces and then completely ruined by a saute of way too much balsamic vinegar.  Half of them were crunchy.  The other half soft. The plate had a bed of marinara with giant chunks of canned tomatoes-no one chopped properly or with even knife cuts.  And the marinara was only on half of the plate. This dish had peas in the mix?  Just look at pix.  Looked as bad as it tasted.  The onion rings were bland and over cooked.  We also ordered their specialty pizza.  We went for a simple margherita.  See pic.  Wow and I don't mean that in a good way  They threw whole canned tomatoes on top. The crust tasted only of charcoal in the spots which were charred otherwise bland and unseasoned.  After we were served I decided there was no head chef and no quality control whatsoever in this place.  This bar is  masquerading as a gastropub.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zI9w9fPQuJuL6eGVwhS5ZA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zI9w9fPQuJuL6eGVwhS5ZA/o.jpg"
      },
      {
        "img_id": "bMeOjtF9OPw-hgdEDKgf-A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bMeOjtF9OPw-hgdEDKgf-A/o.jpg"
      }
    ],
    "user_id": "vnbnH00BdqJdPDaAZs8dSQ"
  },
  "JHbchRKZ4Qy7yOF1-pE3ww": {
    "date": "2/13/2018",
    "text": "Yum!  I came here Sunday for a girl's lunch.  The patio is amazing!  Easy parking.  It was a bit too windy to sit outside but highly recommend.  We dined inside at a hightop and they had the garage doors open.  Perfect day! Service was fantastic and food spot on!  Perfect spot for happy hour or to hang out with friends.  Check it out!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-d8tk22ca-MpY7htQIw08Q"
  },
  "znb3C0NRdt54llTkqLbOAQ": {
    "date": "8/31/2019",
    "text": "This is a fantastic concept- carefully thought out menu and great wine list bryan was very knowlagable on the extensive wine list   Our server was also very helpful accommodating our many dietary restrictions at our table",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "733WV63WLsAaGI3XY0hqug"
  },
  "Sy1ZGR684sZmm5RBkquylg": {
    "date": "9/7/2019",
    "text": "This was one of our new favorite spots & have been there 3 times in the last 30 days. However today was a series of unfortunate events.  Ordered the same build your own pizza ($20- these are not cheap pizzas)I had ordered before however this time it had about 1/3 of the toppings it had before. We ordered 1/2 of that pizza to have no cheese and the other half light cheese. The cheese side had more cheese, about double the amount of any pizza we've had there before. But we didn't want to bring it up to the server b/c my daughter also ordered spaghetti & meatballs however, no one at the table wanted it because of the taste and we LOVE spaghetti & meatballs, but this was dark red sauce with a layer of grease all over the top of it. My daughter only will eat red meat in a hamburger or meatballs & she LOVES meatballs, but she took one bite and couldn't eat it. We told the waitress there's no way she can eat this, she doesn't usually eat meat except meatballs but she does not like this meal at all.   The server took it away but still charged us for it.   No, you're not required to replace it. But, that shows me you don't care about us returning to your location. Ok, we heard ya, loud and clear!   Try BASE PIZZA it's absolutely delicious and you can watch people night hiking from the restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kEavxASLcLk7XFEfEPyOxQ"
  },
  "Ev_7S63GicvXwpIs6v8AhQ": {
    "date": "8/22/2019",
    "text": "Scottsdale? Yeah, not my temperature, I was visiting a friend in the area and hungry. A cursory glance made me think - \"meh, another try-hard but likely mediocre gastropub, dime a dozen these days...\" Was I ever wrong.  First I should preface that if you look at the reviews for this place they're mostly good, but the smattering of sour ones seem to have small problems with service or are made by alcoholics who want long-pouring bartenders. I found lunch service attentive and professional, but I don't drink. Now...if you're looking for quality Italian food - look no further. Wow. Ingredient quality A+. Plate conception A-. Execution A+. San Marzano tomatoes? Check? Perfectly al-dente semolina spaghetti longer than your arm? Check. Tender veal meatballs? Check. Perfectly prepared sauce with the right touch of garlic and pasta water. Check. Appetizers, soups, and salads are all very well conceived with an original touch. Major props to the *real* chefs in the kitchen and to the managers for ordering top quality ingredients.  Pitch is hot and heads above so many sad Italian restaurants I've been to throughout the US over many years. Maybe the heat in Scottsdale isn't so bad after all.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hYQBhJVzQnl0C0nLVqKUvg"
  },
  "Vk9KGu4R_ws1jmfq8uoeNA": {
    "date": "8/19/2019",
    "text": "I came here with family Sunday afternoon. The pizza was awesome! The crust is crispy and the sausage was obviously house-made. We also tried the bolognese fries were also super unique and delicious. The sauce was fresh and the truffle oil was a nice addition. The tires are thin and crispy which I love!  The kids menu items are expensive but again, the food was very fresh. My only \"issue\" might be with the kids Mac & cheese. It comes out in a piping hot skillet- which for a child is an issue. The flavor is also VERY smoky. The adults loved it but I could see how a child would prefer something more traditional, and again, not served in a skillet (that's a recipe for a disaster)!   I did not get a drink but they had lots of exciting craft cocktails I would love to go back and try. They had a plethora of mules that were different. I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DtnU_8qxbDZgZn0r9HnrEA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Sausage pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DtnU_8qxbDZgZn0r9HnrEA/o.jpg"
      }
    ],
    "user_id": "AL17oUwu-OA0V3L9eJ5ROg"
  },
  "FN2G1zkKSRgXsCtmv1McJw": {
    "date": "7/31/2019",
    "text": "Every time we go here we always are impressed with the great customer service and the overall great vibe the place has. With summer coming it's nice to see they have a fantastic outdoor mister system. It was so good that we had the same company install ours in the backyard! We will be back and highly suggest y'all come through as well. We even got pictures this last time!! Haha :)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "a0Lh4RXXaqPTt2eWo8tEcQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Mule",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/a0Lh4RXXaqPTt2eWo8tEcQ/o.jpg"
      },
      {
        "img_id": "8jYwON2USUoLIU-VR56vlA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Sangria",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8jYwON2USUoLIU-VR56vlA/o.jpg"
      },
      {
        "img_id": "CjWsOuMzHZzFU2kOEgQm6w",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Thai pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CjWsOuMzHZzFU2kOEgQm6w/o.jpg"
      }
    ],
    "user_id": "2iqbObo-Btr9yx0lf7MDYA"
  },
  "KbfNXpTE6zEng5VPWwnntQ": {
    "date": "8/19/2019",
    "text": "Okay, this place has the best Brussels sprouts ever. I had the garlic ones and they just melt in your mouth!! I also had the salmon salad as my entree and it was DELICIOUS!! The service was great and the overall decor and ambiance was perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ON6OwLnffcJJhsOFxJBicQ"
  },
  "v827yheYPhobEm-25X2gQg": {
    "date": "9/6/2019",
    "text": "I love this place! Great beer selection, and awesome pizza. If it's not too hot they have a very large outside area that's super cute. Came here today for happy hour and they have a awesome bottle & pizza deal. As well as really good appetizers. Today we got the meatball appetizer which was a really decent size and super reasonable on their happy hour and also comes with some focaccia bread! The shrooms pizza is delicious but typically we do the \"pitch your own\" and get their house made sausage which is SOOO good. Definitely check this place out.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bafY25EZScLz3VJHVuB6aw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Cucumber refresher drink, very tasty gin beverage, not too sweet.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bafY25EZScLz3VJHVuB6aw/o.jpg"
      },
      {
        "img_id": "1Vc2EPZO2pkFvNHcfw9khA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. My favorite beer here, a ipa from Helton",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1Vc2EPZO2pkFvNHcfw9khA/o.jpg"
      },
      {
        "img_id": "vgPFr95jjQwV3GPpy3cyWg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Calabrese Meatballs! Sooo tasty",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vgPFr95jjQwV3GPpy3cyWg/o.jpg"
      }
    ],
    "user_id": "aS_-BOzD5PgLA2l0bT7bZQ"
  },
  "v8DS6pkKagVSKCYnv8sCpg": {
    "date": "9/16/2019",
    "text": "Best service and food ever! I have never had a bad experience at Pitch always such friendly staff and the pizza is always amazing! Get the meatballs too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "surMxKgl5YiQtcuYYtYoGg"
  },
  "Wf0zs9hJfuJtEKXd1ftRwA": {
    "date": "9/17/2019",
    "text": "Really friendly staff! The food was amazing. When I got a side of fruit I was honestly expecting not to eat any because it's always not great, but theirs was clearly fresh and tasty! The Irish coffee was just as good. I feel like the whip cream was homemade which made it even better! Defiantly will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FMgHdzlHi6yWQ7gYP4cZLg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Brew kfast Sandwich and Fresh Fruit",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FMgHdzlHi6yWQ7gYP4cZLg/o.jpg"
      },
      {
        "img_id": "ufCylqrYBoQI3SI-vqzFsw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Irish coffee. Whip cream was amazing!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ufCylqrYBoQI3SI-vqzFsw/o.jpg"
      }
    ],
    "user_id": "DV-g_gZRgVwc32DQBbZpjA"
  },
  "74BH1RrhgWV_OWWY2YOjGw": {
    "date": "5/4/2019",
    "text": "Now this was a surprise to me, the area was formally business suites and doctor offices.  They have transformed it to a different place with an open atmosphere to catch your eye and attention.  Don't blink or you'll miss it just before 60th St on Thomas Road Northside.  Pitch has an array of menu items that the cooks in the back have created and awesome dinning experience.  Let me start with the Smoked Peach BBQ Wings (yes you read it) creatively constructed and paired great (only other place that had them better was in Atlanta,  GA) flavor and the presentation with the iceberg wedge with a creamy blue cheese dressing was on point.  Then it was the Coal-Fired longsteam artichokes dish, prepared nicely and man this is worth traveling here to get.  Keep it up PITCH this is the new spot to get your creative grub on!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Kzbpvlw6959om33e6Iqv8g",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Smoked Peached BBQ Wings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Kzbpvlw6959om33e6Iqv8g/o.jpg"
      },
      {
        "img_id": "8kUTrYZMYamlKkgcC5UMGA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8kUTrYZMYamlKkgcC5UMGA/o.jpg"
      },
      {
        "img_id": "O2B5zFihjtQhJ2Y19eGGKA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O2B5zFihjtQhJ2Y19eGGKA/o.jpg"
      }
    ],
    "user_id": "2nk5FF5OuGO6sLpZMREY5A"
  },
  "yAqW3S_3bwiFbpy9tmfbUQ": {
    "date": "7/18/2019",
    "text": "Favorite go-to spot for delicious pizza and brisket sliders. Always order the margarita pizza and add the mushroom medley on top. Oyster mushrooms top-notch service excellent environment neighborly and management like family. This place has it all, you can't go wrong, and its popularity is well deserved and earned! Happy hour is boss.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y_4UdLKpt9nsojhndcE45g"
  },
  "ViIDZ3kzbItIOhZ8hK7SSw": {
    "date": "8/30/2019",
    "text": "Thankful we had reservations as pitch was packed  Food arrived piping hot and delicious the burger was great salad was yum my martini cold and tasted Amazing the cheddar Mac and cheese bubbling and browned very tasty good beer selection oh the French fries super skinny crunchy and hot fresh accompanied by some delicious ranch dressing very happy we decided on pitch I feel the value for the money was well worth it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xB39U3cJhsXA71ROKVtJg"
  },
  "-BUK7wz-lPfBGJKSBfy3Sg": {
    "date": "5/30/2019",
    "text": "Pitch has a lot of seating indoor and outdoor. It's a great place to come watch the sunset. We sat at the bar and ordered drinks then food. The chicken pesto pizza was amazing. So was the service. Everyone was genuinely nice and helpful. We also had salads and wine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "rdpcNNrH8reGYhjUeFrZZg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Indoors",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rdpcNNrH8reGYhjUeFrZZg/o.jpg"
      },
      {
        "img_id": "CtrQIWXszP0MenU28IdaLQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Wine",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CtrQIWXszP0MenU28IdaLQ/o.jpg"
      },
      {
        "img_id": "E-D94M5oUsTGP8VF1BrJuA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Looking out from bar area.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E-D94M5oUsTGP8VF1BrJuA/o.jpg"
      }
    ],
    "user_id": "ODPb_goPPBsWR2Lh_kR-9w"
  },
  "Cc7f9d4XhsT5dyQaJ6ygkw": {
    "date": "1/13/2019",
    "text": "After a visit to the DBG we found this place just up the street. It has a really cute set up, with a sleek and modern interior as well as an open patio and bar. Two of us were able to snag a table on the patio around 7:30pm on a Saturday night without a wait, so that was awesome!  They have an extensive wine list as well as many cocktail and beer options. Shortly after being seated we were brought water but then had to wait awhile for our server to greet us. It seemed like she had the entire patio so it was kind of understandable it took a bit. Once she did make it to our table she was really nice and filled us in on specials for the evening.   Considering they highlight their pizzas, we both wanted to try one. My girlfriend just got a plain cheese ($12) and I went with the short rib pizza, which was their pizza of the week ($25). While we were waiting for our food, it started to sprinkle on the patio. The staff was fairly quick in getting the umbrellas up and making sure each table was as covered as possible. Props to them there! Although if it had started pouring I'm not sure that we could have stayed dry. Luckily it didn't!  Another thing to note was that my girlfriend got a Diet Coke and they bring you a can and glass of ice.   Once our food came out we were excited to dig in. The pizzas are a large size and definitely big enough to share. We probably should have just split one but it was nice to try two different kinds. We ended up leaving with a full pizza (half of each) on our way out for lunch the next day.   The short rib pizza wasn't bad. It came with carrots, cheese and some type of sauce on top. It was a nice try for a speciality pizza but it didn't stand out as memorable for me. It was good but I wouldn't order it again. Especially for the price, I'm not sure that it really delivered. The cheese pizza was pretty basic (yes we know it's just cheese) but neither of us were big fans of the sauce. Again, it was decent but we probably wouldn't order it again.   Overall, it's a really nice space with friendly service, we just didn't walk away thinking anything special about the food. They do have many pizza variations, as well as pastas, burger options, as well as some main dishes and appetizers. Definitely seems like a good place to have drinks and share some munchies.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "wlt6AQXMfXQrDtgKEuUw7w",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wlt6AQXMfXQrDtgKEuUw7w/o.jpg"
      },
      {
        "img_id": "Cki4FIeOTbOaT_KMq68Xnw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Cki4FIeOTbOaT_KMq68Xnw/o.jpg"
      },
      {
        "img_id": "OHH6e7m8N4mhLWkoCCeB-g",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OHH6e7m8N4mhLWkoCCeB-g/o.jpg"
      }
    ],
    "user_id": "Lk70TsLeGBYSXsnr5q-cXg"
  },
  "hV7SXuOY88TgMBG8rPdMnA": {
    "date": "2/16/2019",
    "text": "Great list of reasonable priced alcohol and lots of menus to choose from:  They offer Breakfast M-F. Brunch Saturday and Sunday. Lunch everyday. Happy Hour M-F 2pm-6pm (food and drink specials)  Dinner everyday.  a Whiskey Menu.   They have gluten free pizza and sandwich bread.  But nothing on the menu is indicated as such. If you have an allergy ask lots of question.   We ordered the COAL-FIRED LONG STEM ARTICHOKES Flatbread with house-made hummus, cherry tomatoes, parmesan, baby green salad, sweet onion vinaigrette, lemon garlic aioli.  Our bartender was able to make it gluten free by omitting the flat bread portion, which he described as more of a chip than a flat bread.  In any case he gave us some cucumbers to accompany the dish.  The dish ended looking more like a salad, with loads of shredded cheese. It was tasty as well as the Lemon Aioli, but too much cheese for my preference.  (I know, who says such a thing?) $12  We also ordered the CAJUN CAESAR SALAD with Avocado anchovy dressing, romaine, house-made croutons, cherry tomatoes, parmesan. Choice of chicken, shrimp or salmon, we opted for the Chicken, $16 (see picture)   Because of my gluten allergy, we ordered our salad without croutons.  The chicken was great, grilled to perfection, could have used a few more slices, considering the price.  However, the salad was also over loaded with shredded cheese, it really took away from the salad itself.  In my opinion, the dressing was watery, and not very flavorful, had a fishy hint to it.  I understand Cesar dressings is made from anchovies, guess what I'm trying to say is, it didn't compliment the salad.   This is a great place for large group gatherings, they have a separate private room that can hold 100+ people. Pretty awesome to have that available. Great gathering place for after work drinks and Birthday parties.   Will be back to try 2 of 7 menus.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MR8RET5_ZoIr-7_hOg7KOA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Inside bar, with view of outside.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MR8RET5_ZoIr-7_hOg7KOA/o.jpg"
      },
      {
        "img_id": "0-EKiuPATPvQ3cjE6j9-CQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Front entrance, yard games.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0-EKiuPATPvQ3cjE6j9-CQ/o.jpg"
      },
      {
        "img_id": "anpAsr_B8p7zZ35xIF3n2w",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. The Cajun Chicken Cesar Salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/anpAsr_B8p7zZ35xIF3n2w/o.jpg"
      }
    ],
    "user_id": "3wANTgwtoejdou-oWXadow"
  },
  "o6OrBKVJ0VVEvYC7v0YvNg": {
    "date": "1/22/2019",
    "text": "Great place in Scottsdale for pizza. We came here for lunch this past weekend. There was an event going on but the service was still pretty quick.  We ordered the shrooms pizza with fried eggs added. We also ordered a custom pizza with roasted chicken, prosciutto, mushrooms, and caramelized onions.   Both of the pizza were delicious. The toppings portions were very generous. The shrooms pizza was deliciously creamy.  My favorite was the custom pizza however. I love prosciutto and I especially appreciated the option of being able to add the prosciutto after the pizza has been cooked to prevent it from being too hot and melty   We enjoyed our lunch here and would definitely want to come back. I recommend checking this place out if you're craving pizza!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "I8AzRCHYbcEEDU8AtE2dsg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Shrooms pizza with fried eggs added",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/I8AzRCHYbcEEDU8AtE2dsg/o.jpg"
      },
      {
        "img_id": "Wma4pW9mp2pqreFWB0T4XQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Custom pizza with roasted chicken, prosciutto, mushrooms, and caramelized onions",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Wma4pW9mp2pqreFWB0T4XQ/o.jpg"
      }
    ],
    "user_id": "9RhaWb_euReKSqx2go-h9w"
  },
  "Dp5Dzpdq6XWAQrYVzBO_aA": {
    "date": "5/10/2019",
    "text": "Omaha Nebraska native is what I am...desert rat is what I have become.  So happy to have this gem here in AZ to remind me of home.  Originally based in a great area of Omaha called Dundee.  So excited that I can continue to enjoy the fantastic atmosphere, food and libations that the creators of Pitch do so well!    Beer and wine tastings were solid and the food was fantastic.  Charcuterie board of meat and cheese was shared and loved among the table.  Meatball appetizer was outstanding.  Thai pizza was ok.  Roasted beet salad and baby spinach mushroom salad delicious.    Can't wait to go again.  And again.  And again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ig4MBERqYl9fSjQRYSWOlA"
  },
  "mUossQmeduIhN_Ogv6vu_Q": {
    "date": "12/1/2018",
    "text": "NomNomz: 5/5 Libations: 5/5 Service: 5/5 Ambiance: Trendy, casual, fun! Price Range $$  If you love yourself some ZA (pshhh who doesn't) then this is a must-try spot in Scottsdale! Everything made from scratch?! Sign me up.  Nomz: The pizza here is fan-freakin-tastic. Can't go wrong with their \"Dos or Tres Peps\" (if you're a spicy fan, add jalapenos to that - SO good). Their \"Shrooms\" is also heavenly. If you're a mushroom fan, the truffle oil and parsley combination will knock your socks off. Their pizzas are loaded with flavor, and the crust is so effing good. With a perfect crisp, you won't be able to put it down. For realz. All the pizzas range from $14-$21, really decent prices for the fresh products you're getting.   I only really came for the pizza, but the rest of their menu looked phenomenal. There's truly too many dishes to choose from, so I'd recommend grabbing a group of friends and sharing all the goods! Don't forget to try their appetizers! The coal-fired long stem artichoke salad is unreal. It's a really large portion though, you can definitely share it with multiple people. I saw a few others and they all looked amazing.  Libations: They've got a full bar, and great cocktails to choose from. A pretty large beer selection (+ some local drafts), along with some great wine selections. All normal prices. They also offer a number of unique Moscow Mules which is pretty impressive.  Happy Hour! I'll have to come back for this. Mon-Fri 2-6 PM. $1 off beers, 1/2 price bottles of wine (score!), and $5 off pizzas. Doesn't get much better than that.   Tip: They offer a multi-course private chef experience with food and wine pairings, sounds fun for a special occasion if you're looking for something unique.  Overall experience: Holy smokes, dat was goooood. And their service was amazing. We had multiple people drop by our table to make sure we had everything we needed. Very pleasant energy there! Will definitely be returning to check out the rest of their menu!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-KaCJhZDWHdTcAcOWpH0QA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-KaCJhZDWHdTcAcOWpH0QA/o.jpg"
      },
      {
        "img_id": "IabPRdT4653tVP75ucc-jg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IabPRdT4653tVP75ucc-jg/o.jpg"
      },
      {
        "img_id": "twSS9no5PByjofJClkkSMw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/twSS9no5PByjofJClkkSMw/o.jpg"
      }
    ],
    "user_id": "__sqiOAPjCeUaCn4cd0_lw"
  },
  "y_9Zm-AbS1Mi3zkWEZd4-g": {
    "date": "1/12/2019",
    "text": "Pitch has a casual, relaxed feel to it.  The interior is spacious and contemporary; they also have a large outdoor patio.   Despite a few hiccups in the food and service, we enjoyed our dinner.      Service was a little spotty with a forgotten drink order, and water glasses that did not get refilled. As for the food, we shared the onion rings (half order - crispy, hot), the Thai Pie  (ok),  and the Artichoke Flatbread (not really what I was expecting but tasty).   For the main course, I ordered the duck entree, cooked 'medium' as recommended by our server, but it was served rare.  I sent it back and the second time around it was very good.       I look forward to sitting outside next time and trying other items from the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vy4RrA3_w9CHn8UgD_O6FQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Duck Entrée - good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vy4RrA3_w9CHn8UgD_O6FQ/o.jpg"
      }
    ],
    "user_id": "GA6RAfSkRQuHAV0qIs_1Lw"
  },
  "5WaZqu8fKOZ5rZbRg16c0Q": {
    "date": "9/15/2019",
    "text": "First time visitor. The food was very good and the service was pretty good. Server in training. The place was somewhat empty maybe because of the football game and Sunday brunch timeframe. Overall I believe the place will do well overtime. Hope to visit again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YS6D_1UokWj67WxV0MqV5Q"
  },
  "2IepEu8EhqdlRAMJ9Z_Ceg": {
    "date": "6/21/2018",
    "text": "Nothing to write home about. Not worth the price tag in my opinion. Food was mediocre at best. Atmosphere was cool but the food wasn't. I don't expect this place to stay open long with the cure t menu.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xxt45JQQaWWV2P7Q5IJj_g"
  },
  "KJDajVk3Mx1s4Yp2VlEu1w": {
    "date": "11/14/2017",
    "text": "The food was GREAT.  Artichoke with long stems that had been marinated.  Meatballs the best. Pizza was excellent.  The facility is excellent.  Acoustics gentle. Lighting superb.  Great patio. Plenty of space between tables.   Loved it. Congrats Dean! Larry",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "WgGHZfII5RBtj7_2GTJU4A"
  },
  "5BvCsXSCtmyIZSUOmbOf9w": {
    "date": "1/7/2018",
    "text": "The Pitch offers a fresh new menu to Phoenix. The meatball appetizer and artichoke appetizer are yummy. The patio is cozy and offers views of Papago mountain. Happy hour is a great deal so be sure to show before 6pm. Cheers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1-N36XE-mmUMteN0FqrqTQ"
  },
  "TXGe0J4ubzXIFrxlpSx0QQ": {
    "date": "5/29/2018",
    "text": "We have had many amazing dishes. If you like artichokes I recommend the appetizer but be prepared it is not served like you will expect-it's more a salad but the chokes are amazing and the dish is fantastic! The parpadelle is amazing so is mushroom pizza! The only reason they dont get 5 stars is because we have been many times now since they opened and they still cannot figure out how to time their meals to hit the table at once. We've been 10+ and it has happened 100% of the time. Be prepared for your meals to come it separately. Otherwise Pitch is one of our favorites!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "obaZk4UkGTe_yn851MgK1Q"
  },
  "EJ2XTPVLTb8bo2WkDHw3dQ": {
    "date": "8/11/2018",
    "text": "My boyfriend and I tried this place for the first time today and we were very pleased! Hannah was such a sweet young lady and took wonderful care of us. The sweet and spicy chicken wings were delicious and the MIA pizza was just yummy! We both got cocktails and those were tasty yes Powerful (reminded me of San Diego cocktails) We will definitely be back to try different items on the menu! Thanks Hannah!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a5s7wcZuLOXY9bvaSN3Pkw"
  },
  "wBOQ71cjsKllw5yELDI9JQ": {
    "date": "12/26/2017",
    "text": "My mom & I decided to try Pitch for our first night in Scottsdale since my mom loved the Pitch in Omaha. We wanted to try a bunch of different things & ended up ordering two happy hour dishes & two starters; Angus beef sliders, Bolgonese Fries, Basil Gnocchi & Brussel Sprouts. The sliders were our least favorite of the dishes. We both agreed there wasn't enough meat or cheese plus the reduced balsamic drizzled on the top of the bun made our hands sticky & was hard to get off. The Brussel Sprouts were the 2nd to least favorite. The flavor was delicious, but the sprouts were unfortunately soggy & not at all roasted & crispy. The Basil Gnocchi also was delicious. I wasn't big on the gnocchi being infused, the pesto flavoring was drowned out by the red sauce as it sat surrounded by peas. The Bolognese Fries with truffle oil were the winning dish. The fries were so thin & crispy they were addictive. For sure some of the best fries I've had in Scottsdale yet. The sauce and ricotta on top paired perfectly with the truffle oil. Can't wait to come back to Pitch & try one of their pizzas or pasta that are supposed to be pretty good. Definitely coming back, however, for those fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y0R_ZGWNBXN4CLJBvh6miw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Bolognese Fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/y0R_ZGWNBXN4CLJBvh6miw/o.jpg"
      },
      {
        "img_id": "0WkCgb5sRBsyPVjWC0VslA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Brussel Sprouts",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0WkCgb5sRBsyPVjWC0VslA/o.jpg"
      }
    ],
    "user_id": "rj8WrBCEs6VOf0vfZ_HOKA"
  },
  "a5NYOGkWJjfkgFPtdpJvNg": {
    "date": "2/17/2018",
    "text": "We absolutely loved our experience at Pitch. We have been a couple of times for dinner at this location and the restaurant has great energy and even greater food to back it up! We tried the weekend brunch today for the first time.  We started off with a fresh squeezed orange juice and an excellent latte. The coffee flavor was very scrumptious.  Then we moved on to the entrees and we had the Short Ribs Enchilada and the Creme Brulee Stuffed French Toast...nothing short of amazing! The flavor profiles of both were off the charts. The food never disappoints!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7Dm4iqKNFZK5TK5quCxD-g",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Creme Brûlée Stuffed French Toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7Dm4iqKNFZK5TK5quCxD-g/o.jpg"
      },
      {
        "img_id": "2YlcBInOdCC_IN1KtSco9g",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Short Rib Burrito with Hash",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2YlcBInOdCC_IN1KtSco9g/o.jpg"
      }
    ],
    "user_id": "tlVXbJ3yZ9DugvhloW6gjQ"
  },
  "1lh0Lyy6InDBfsGmkBGEIA": {
    "date": "11/24/2017",
    "text": "An excellent restaurant within walking distance, and I'm ever so thankful! We've been 2x in the past week and were not disappointed! If you happen to dine on the nights they offer the Cheesburger Soup, go for it! It is phenomenal!!  I love the crab cakes, both appetizer and entree. My husband had spaghetti and meatballs and portion was huge, so prepare yourself. If you like salmon, there's is great. You can get it on any of their salads or as an entree. We will be back for Sunday brunch - cheeseburger soup and 1/2 price wine bottles.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2j21Qa2BExRzSbB2j3U8Pw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Crab cake entree",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2j21Qa2BExRzSbB2j3U8Pw/o.jpg"
      }
    ],
    "user_id": "7uTtHa2V9Ds9yyAy3-PIhQ"
  },
  "PC_LlxDfFOpLZWYhTL4lLg": {
    "date": "8/11/2018",
    "text": "What a great menu for the whole family! This place knows how to make some food. The Rosemary wings perfect! Buffalo chicken salad HOT but so good! Burger is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5nYtQW9qY2gR89TJoO4eqA"
  },
  "Pz4dkeCcFptwqs7vS_vyrw": {
    "date": "6/13/2018",
    "text": "Stopped by for dessert on Sunday and the place was fairly dead but of course it was a Sunday evening around 7pm. It is a large space with a great outdoor patio decorated urban chic with open kitchen. The staff was great very friendly and accommodating and we were impressed with great selection of tequilas and bourbons. My husband and I shared a neat Pappy Van Winkle 15 Year Reserve which was modestly priced considering the cost of a bottle which was excellent and the bartender was nice enough to have purchase a half shot of an unusual wine barrel aged tequila which was also very good. As for the dessert it was just okay. We shared the Key Lime Pie that our server raved about it but to us it was nothing to rave about and underwhelming at best. It seemed fresh and we were told it was made in-house but seemed more like it might have come from a box with a small dollop of whipped cream on top and some kind of raspberry sauce that surrounded the dish. Based on the dessert I'm not sure if it would be worth a return trip if the other menu items are just as underwhelming which is sad because it really is a nice place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M3YpU8fRyTZAQIn08bDT4g"
  },
  "t6i7WA1ho2Tlo9Fihg38vg": {
    "date": "8/7/2018",
    "text": "I've been here a couple times and have always had a great meal, service and drinks! It is such a cute restaurant and never disappoints! The staff is very friendly! It's a nice place for a bike ride/weekend brunch spot! They typically have a bunch of rental bikes outside their location and parking is very convenient. Highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NdMkqSzuvBpoMd44zbFusg"
  },
  "YCjeMQQMwepefBPaDXPrrQ": {
    "date": "1/13/2018",
    "text": "First time here and we love the food. They are known for their pizza but we weren't here for pizza. They have an extended menu that will please almost everyone. The place is beautiful with a huge patio. So today, we had the calabrese meatball salad. It sounded odd but interesting. The meatball was moist and the salad favorable. We also ordered the soup of the day, which was a tomato base bean and chorizo with veggies. Spicy but it was so good. Definitely coming back to try other items on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MRoIBuZu32wHbIq7uEYj_g",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Meatball salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MRoIBuZu32wHbIq7uEYj_g/o.jpg"
      },
      {
        "img_id": "Fy9IiLzkR8PDnHNDdOg1cg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Artichokes appetizer, the white sauce made it a heavy dish",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Fy9IiLzkR8PDnHNDdOg1cg/o.jpg"
      },
      {
        "img_id": "RSCNF100Y2_peyPod3pNLA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Protein Omelet",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RSCNF100Y2_peyPod3pNLA/o.jpg"
      }
    ],
    "user_id": "reUMLWwXDGiyUJWm-zQ7QA"
  },
  "MWqbOO4NSLZ1IN9bCiEgNg": {
    "date": "11/3/2018",
    "text": "The pappardelle was amazing... sat at the bar with friends and the bartenders were hilarious... cheese cake was great and if you like whiskey/scotch/bourbon... great selection and also a really good mix of tequila. New favorite spot near Arcadia.. really nice patio too!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uqjFxRw7sPCczWEK_5QSzg"
  },
  "cxfxF1gMsPTMCIre-ID72w": {
    "date": "12/20/2017",
    "text": "Been here a few times in the past month with nothing but good things to say! Meatballs are incredibly tender, pizza is off the hook (probably the highlight), along with modern/hip restaurant and patio. The staff is friendly and management seems to always be active in the dining room. Could be the next neighborhood gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OXFa4esRMpl3U7X7dUXh3A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OXFa4esRMpl3U7X7dUXh3A/o.jpg"
      }
    ],
    "user_id": "noz6uVygw-CBYxGEZwkI7Q"
  },
  "wzDjr93nUdyaOon6sRKTCQ": {
    "date": "12/3/2017",
    "text": "Vegetarian love! We ordered the Margherita pizza and added avocado, pesto & peperoncinis...  wow! Amazing! Atmosphere is absolutely beautiful. Our waitress was very friendly. All the staff was also very welcoming. Definitely coming here often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-l_3W-59_BwYJtWiMWkU7A",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-l_3W-59_BwYJtWiMWkU7A/o.jpg"
      }
    ],
    "user_id": "aUztbzbfOeHhDgKMenm3Rg"
  },
  "WEyyGvAMLKnv5iq6etjglA": {
    "date": "5/18/2018",
    "text": "The bartender is hot.... I hope she calls me. Also apparently I am supposed to write more because it was not enough to post...",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wao8qMhgUScavJm1eZDoxw"
  },
  "4G8LVxTW1wqasqg_Pwu6FQ": {
    "date": "2/11/2018",
    "text": "Awesome atmosphere, really cool Neighborhood vibe and would be a great hotspot if I lived in the area.  Great Happy hour, Best Meatballs in town, loved the Pizza and everyone raved on the specials! Staff was fun and very knowledgeable.  Cool spot that cant wait to get back to!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_LG54z4-OlB4YiqDkKntw"
  },
  "SfgsfrrLvkZj_8dt5HVl7A": {
    "date": "2/9/2019",
    "text": "I've driven by hundreds of times. Stopped in for some lunch. Cool looking place. I sat at the bar. Grabbed a cold beer it was good. I was given a menu read the menu finished my beer. Checked Facebook my email and other things was finally offered another beer. Didn't get a chance to order food I had to leave. If you're a party of one you seem to get looked over. I will try again as it's close to my house. P",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "03Jk7T0HtPDPcxkEP9pYRg"
  },
  "ViSJ8ws3LIDjq4bZG8o0LA": {
    "date": "5/5/2018",
    "text": "Very disappointing. We've been looking forward to trying out this new place for quite a while. We tried appetizers where the artichoke dip was salty and the chicken wings were dry and tasteless. Three of us also had pasta dishes which were also very bland. For the four of us the bill was $156. For that kind of money my food should be delicious! I agree that the vibe is good and it was much needed in that area of town but the food really needs to step up its game.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XAzg7vQeOVnM_cTyMUbjeQ"
  },
  "YFE4riBFUQyDTF1q_jdQAA": {
    "date": "12/26/2017",
    "text": "Our server, Lucas was great and extremely knowledgeable about the menu items. The atmosphere is inviting with seating in door as well as out door and it is conveniently located in the heart of a neighborhood, I will definitely be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2F_XcK4dulP1SwdZ6qA7Dg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Roasted beets, mixed greens, roasted butternut squash, pistachio, baked goat cheese filo and red wine vinaigrette.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2F_XcK4dulP1SwdZ6qA7Dg/o.jpg"
      }
    ],
    "user_id": "T2JDGUtx47mLHclVd5xGSg"
  },
  "wrEUfg7xjLDYtQoOAVtLFA": {
    "date": "11/17/2018",
    "text": "We had a Mia pizza and a marsala pizza with a thai salad appetizer. The food was delicious. My only complaint- the berry cobbler takes a while, if they had told us we could have ordered it earlier. It is definitely worth the wait but if we could've avoided the wait- even better. The COO, manager(?), Dean was above and beyond kind and competent. You learn from the top; judging by Dean they are in very good hands,",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jax1Rua5iWNEMynfJz90-Q"
  },
  "1yknvOlzx3dzkk5Y0oYAzw": {
    "date": "11/16/2017",
    "text": "What an amazing place. So glad this place opened so close to me. It's def a must try place! Even came back in the morning to try breakfast. If you haven't been please do!   They're a little hidden.... in the Business complex that's been there forever that's been giving an amazing face lift  Just west of 64th street on the north side of Thomas   Your Welcome in advance",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "x7aDnJSXhi0gtFZ9ydUaYw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x7aDnJSXhi0gtFZ9ydUaYw/o.jpg"
      },
      {
        "img_id": "rrDCU0Z9iGrxnyaW-c7fKQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Tomahawk Porkchop",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rrDCU0Z9iGrxnyaW-c7fKQ/o.jpg"
      }
    ],
    "user_id": "bZ5cRgpXHI7rwbnDgzZMjA"
  },
  "6M79A11RdL4Ozab1TMgitw": {
    "date": "5/21/2019",
    "text": "One of my all time favorite restaurants and my go-to place   Great food, great staff. Happy hour on the patio is always fun. Dog friendly, so bring the pouch",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cXF1wJSAajoVGO3A2Ue5ZQ"
  },
  "MQWewV4tmc3f0ztoC8vQkA": {
    "date": "11/18/2017",
    "text": "Really nice indoor-outdoor atmosphere. I think this new restaurant will do well, especially considering that most tables there were ordering multiple drinks before noon on a Saturday.  Servers were pleasant. Lots of them standing around, waiting for more business.  My husband's cheeseburger had excellent flavor with a fresh bun. His shoestring fries were good and plentiful. I would not re-order the corned beef hash. Too many large-chunk potatoes and not enough other flavors. The meat in it was ok.  They could use some fly control. Big open garage doors allowed many flies in.  Will be back to try other items.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wN7jGqK_ZpB9KoYSAUyr0g"
  },
  "8GfTaXuqL7wme1-mi0HN6A": {
    "date": "12/20/2018",
    "text": "Our server was fantastic, but the food was eh.  Calamari, more breading (like fried chicken breading) and pepperoncinis than calamari, the sauce was tasty though.  \"Tiger shrimp\" tagliatelle, the shrimp were tiny, not tiger shrimp at all, and the sauce was more creamy than and lemon garlicky as described, though the noodles were delicious.  Filet I understand was delicious as were the scalloped potatoes.  Crab cake appetizer not good, as the salad thing under it had bean sprouts and beans and who knows what else, very weird.  The crab cake itself lacked flavor.  Cool ambience but only like five beers on tap?  Rest in bottles.  Needs some tightening on the food and draft beer for sure.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_tZt7lAbVcQDY-gRlXF53A"
  },
  "0nktof1wEdw8VShye4rcXw": {
    "date": "4/13/2019",
    "text": "Scampi Taglatorri for the win!  I got this the first time and every time. It is like handmade pasta with shrimp and fresh veggies. So good, I crave it. Nice open atmosphere and staff is consistently on par. Tonight Perry was our server and did an outstanding job of being engaging without being overbearing. Nice to talk to and knowledgeable about the menu while offering helpful suggestions. I'll be back again and again.  Only four stars as it is a little expensive for what you get and service is consistently slow, but I will be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "htzWWc9wjn7YsjRRSI6hMg"
  },
  "4vdQmS7YDvuuS1TeSaab9w": {
    "date": "12/14/2018",
    "text": "My new favorite place! Its even dog friendly. Everything from the beer to the food is a winner. The calamari, meatballs, pizza and burgers are amazing but if you can only get one thing for some reason I say get the Buffalo cauliflower!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I8aErsH9WKs_c1mVHPmVVA"
  },
  "BpXOpsE8MgfXYMZJ6QgInQ": {
    "date": "3/30/2018",
    "text": "The good: Tasty cocktails, beautiful outdoor atmosphere. The pizza is ok. Crust is tasty, and there's a good ratio of ingredients. The sausage is DELICIOUS.   The bad: Everything is pricier than I think is merited. $21 pizza is kind of insane in this area. The place is across from a Fry's parking lot. I mean, it's pizza. $3 a topping? Come on. I also didn't like their misleading menu. The happy hour menu says \"$5 off any pizza.\" We ordered a create-your-own pizza and didn't get the discount. I asked why and was told that the create-your-own isn't included in the Happy Hour deal. I'm not going to fight about $5, but that was misleading and disappointing and illogical. When I suggested they change the wording of \"any pizza\" they responded \"we're not changing our menu, we've never gotten any complaints.\" I thought the attitude was dismissive and kind of embarrassing. I'm a customer giving you a (rational) suggestion. Even if you're not going to change it, at least acknowledge that you can see where it might be confusing, and approach it with a less smarmy attitude. They did give us a $10 gift card, which I appreciate, but I will not be back, even though I live across the street.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "G3ZZHtYleeHXtVDhuydH2g",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Says &amp;#34;any pizza&amp;#34; is $5 off for happy hour but this apparently does not include the create-your-own. Ridiculous, head&amp;#39;s up for everyone else!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G3ZZHtYleeHXtVDhuydH2g/o.jpg"
      }
    ],
    "user_id": "oZmD9EePQ1bOMn5bj23MbA"
  },
  "ScuOPOqKhn6_2PiAHywsHQ": {
    "date": "4/11/2018",
    "text": "My sister found out that the \"chop salad \" is not actually chopped, it's just called that (quoting a young manager). Then I found apple slices on my pizza of which none were uniform. The pizza crust was soggy at the middle corner by the third slice :( the fig flavor was good",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YFWDOBMMFQN6wanQZlyUkQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Someone needs to get this kitchen a mandolin! #knifeskillsfail",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YFWDOBMMFQN6wanQZlyUkQ/o.jpg"
      },
      {
        "img_id": "mdTr9FHcJ0iHTcO79rNW0w",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. SEEDS in the apple slices served on my pizza #dentalwork",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mdTr9FHcJ0iHTcO79rNW0w/o.jpg"
      }
    ],
    "user_id": "FghvPRTuVaFoIABLuoEqFA"
  },
  "S1PxpfXb5N-lNxUOowcQWg": {
    "date": "4/3/2019",
    "text": "Not sure what sucked worse the food or the service...........both were horrible!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "G3Yai4DtkL4JcxRLfTNu0Q"
  },
  "sXUi7L1BlLnySffrEanl4w": {
    "date": "1/24/2019",
    "text": "Great ambiance! Patio is very welcoming. Lengthy menu was surprising and filled with many delectable dishes. Let's not forget about the drink menu, wines and cocktails are all fantastic! Definitely recommend; we ate here and enjoyed ZooLights afterwards, great night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lP7OF0pMUiJGF2_oFpkMlQ"
  },
  "i1PeJZyhUk7CGzjnUalNqA": {
    "date": "5/31/2019",
    "text": "Went to Pitch tonight for an early dinner.  Great atmosphere and food.  Husband had their Margarita pizza and loved it.  Got it with a bottle of their house Chardonnay for a great price and taste.  Their Crab Cake Salad was delicious with two large crab cakes that were perfectly baked with just the right amount of crispness.  Will definitely be going back to try other items on their extensive menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dRD4mUGQwywsHhB4MS1Osw"
  },
  "R8P46B_LoLEd6_Eq15_cQQ": {
    "date": "1/17/2019",
    "text": "Six of us decided to try this relatively new restaurant, and it was definitely a winner. Really great pizza and appetizers, especially the calamari and meatballs in  sauce, and wonderful woodfired pizzas. The service was very friendly and prompt, and the owner came over and was very excited and enthusiastic about the restaurant. It's a really fun space with indoor and outdoor seating, dog friendly, and has a wonderful wine list and over 100 scotches. One to check out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZJljBTpAFXR6myntoa1YNg"
  },
  "qkqsP0poJDPwm58yPYSkVw": {
    "date": "6/12/2018",
    "text": "We picked this place based on the reviews and it did not disappoint. Service was good. Not over the top friendliest but friendly enough and efficient. I never would have ordered the artichoke starter if I hadn't of read the reviews... but wow. Just do it. Incredibly impressed with it. We got and shared a pizza and the meatball salad and not a single thing disappointed. The house (cheapest) red wine was also fantastic with our lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A2pV6UbX4UR0VYPc7kEqSA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A2pV6UbX4UR0VYPc7kEqSA/o.jpg"
      }
    ],
    "user_id": "uF1clteRPsO-s8RdxXFTBw"
  },
  "pXWpDnexsuE41xlEVkb3Zg": {
    "date": "7/13/2018",
    "text": "Just amazing!  Fresh veggies, pizza was delicious and quickly devoured, most of all the service was superb!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GV2xKnQQbJJ3LyeqVW58yA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Sorry,  no pictures of the delicious food. Highly recommend this place, salads and pizzas were fresh and delicious, back for sure!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GV2xKnQQbJJ3LyeqVW58yA/o.jpg"
      }
    ],
    "user_id": "v-9e3_pGMoufki7gEf4wMg"
  },
  "lw0Il5_47gzYtevaq6r-SQ": {
    "date": "5/28/2019",
    "text": "Great food! Excellent service! Beer tap choices limited, but good. Also bottled beer options. Excellent wine list and nice cocktails. I highly recommend for groups.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ih22fZGOBZMO2RqUgEhZtw"
  },
  "z47qZFgjoOynhCH24n6XsA": {
    "date": "5/28/2019",
    "text": "Took 12 to Pitch tonight.  Excited after getting take out.  Thought we'd go back with friends.  We had a great table on the patio.  Waters came out right away.  We were missing one chair.  Reminded our server.  The rest of our party arrived and still no chair.  Our reservation was booked days in advance. We got appetizers, then ordered entrees.  We needed kids menus and they needed to make copies. My husband requested more water.  Our server never came back.  I went to remind him about the menus and water.  Our entries began arriving.  All our appetizer plates were still cluttering the table, and still no water refills. I went to find out server to ask if they could clear our table and refill waters.  He got a big attitude.  A girl came to clear.  We were assisting her by handing her plates.  Most meals arrived except two.  Eventually my nephews salad arrived.  My sons burger arrived after I asked the estimate?  The kitchen had made an error on it.  By the time it arrived the entire table was done.  He had snacked on appetizers and half my husbands pasta.  I let the waiter know he just could not eat it as it came so late.  He responded with \" oh I'll wrap it up for home!\"  Honestly they should've removed it from the bill.  I'm very disappointed in the service.  Good food, good atmosphere, poor",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hTmRHSH3gRI3rEEjwItelQ"
  },
  "dhlh5zBvvi_y3FcHznfl9Q": {
    "date": "7/8/2018",
    "text": "So I'm from Austin TX (food snob capital of America).  This place is so good I'm leaving a review even before the entree's come out. Place is hip, staff is friendly. The calamari excellent. Have no doubt the pizza and Thai salad are gonna be delish.  Update:  The Bianco Verde pizza was simply amazing, and the Thai salad delivered the goods.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bhHy4stpRwZxPnLE5WLMqA"
  },
  "gKilqtrhKKa_996PUbz1pA": {
    "date": "10/8/2018",
    "text": "Service was great - all staff smiled and attentive! Atmosphere is trendy with great space for indoors and nice outside patio. Perfect for this weather! I like that it's not located in the MESS of Scottsdale traffic. Makes going there more pleasant. Kids shared cheese pizza, & hubby and I shared The Doc. We also shared a mushroom salad. The food was tasty.  If you prefer your pizza dough to be toasty/crunchy throughout your slice, then this place is it! I'm not a fan of soggy pizza. Even with all our toppings, it held up. The flavor/seasoning is well balanced and light.  The salad was yummy and not dripping in dressing, the vinaigrette dressing taste was subtle and paired well with the pistachios, spinach & cheese... Standard drinks are served by the can which is cool, until you want a refill or 2, $. But I like the can idea! because it's way cleaner than the soda dispensers, bacteria builds up quick if it's not cleaned regularly. Overall, pretty darn good. We'll most likely try a white pizza our next go-round!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bm-vxJ3YgmILg4HJCHrsNg"
  },
  "G-JB6IF1Xjqxj_VYgcSemA": {
    "date": "8/23/2018",
    "text": "Food's ok. The owner is a complete ass who can't take a joke and doesn't know how to deescalate. I literally had to tell him he I did not wish to talk to him after he kept insisting over and over that my passing on a message that my boss requested Happy Hour pricing despite wanting to eat at the office, was a lack of respect. I was simply asking because she asked me to, meanwhile he kept calling me the wrong name and saying I am disrespectful. I left the kind bartender a 20% tip and got tf out of there. What a d**khead.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "tatlrp7AxXFDVoY0THV5fQ"
  },
  "VJo1WIrBAPFmE46NjhggDw": {
    "date": "1/29/2018",
    "text": "Just sitting on this delight of a patio makes for a great meal. That the food is also downright good makes things close to perfect. I especially love that this place offers a few unexpected items such as white anchovies and peppadew. So why not five stars? For me it was poor dishwashing and for my wife slowness of service. Oh, special mention to the general friendliness of the clientele and the many cool dogs that get to join us humans here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zj9_bvb-O0Mua8pAO5NsIg",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. No dogs in this picture but there are often great canines at Pitch.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zj9_bvb-O0Mua8pAO5NsIg/o.jpg"
      }
    ],
    "user_id": "jL41h4Ez98PZfqiKzbbY1w"
  },
  "4rJEWZowxVLdF28pDiiQFg": {
    "date": "2/27/2019",
    "text": "We absolutely love this place!!!  The artichoke is the bomb!  Pizza are legit, and after coming here for months loving everything we've ordered I get the filet....wow...beyond reproach.  We love local high end steakhouses, but this filet is better!  The Gorgonzola butter is ridiculous, but the filet was cooked perfectly...little bit of char...wow.  Not sure I can order anything else moving forward!  Wow!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ThVZgSBgHtdK7k5KyZ8rvw"
  },
  "79zaHS9S2GTTqEV-8VZ6oA": {
    "date": "4/29/2018",
    "text": "The vibe is here is breezy, especially when the weather is nice and there's a... breeze.   Unfortunately, something annoyingly dumb happened, and it will just nag at me to the point I probably won't go back.  The happy hour says ANY pizza is $5 off, but of course, this apparently doesn't apply to 'create-your-own' pizzas which they didn't mention when I ordered one. To add a level of nonsensical absurdity to the bait-and-switch, the custom pizza costs $12 with \"San Marzano tomato sauce & mozzarella\" before adding your ingredients. But $6 of \"extra mozzarella\" and \"fresh mozzarella\" was added for no reason, and when I brought it up, the waitress acted like this was totally normal. Like every pizza obviously needs extra and fresh cheese. Because the mozzarella it comes with would never be enough. So apparently everyone who orders a 'create-your-own' pizza gets a mystery charge for mystery cheese. Sure.  So I spent almost $40 on one little pizza and a drink. During happy hour. No thank you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y2UGlqLBExDvBh2QRebhtA"
  },
  "4W3THozRnwvrE0UDJk1j1g": {
    "date": "6/23/2019",
    "text": "So excited to find such a great restaurant. Service was outstanding. Our server was attentive, friendly, and helpful. Our group of four shared the onion rings, which we all really enjoyed. My husband and I shared the meatball pizza; it was delicious. The meatballs were melt in your mouth good. Also really enjoyed the seasonal berry cobbler. Will definitely be back as all the food coming from the kitchen looked amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ilrWhoZapEZKZ-cdzWyMgg"
  },
  "pnX22DtvpPw_oJXKk94Y1g": {
    "date": "3/9/2019",
    "text": "Best Pizza in Scottsdale and possibly Arizona all together. Very cool and relaxing vibe. The service is great, bartenders are cool, and the owner has come out to greet my boyfriend and I twice. Try an egg on your pizza you won't be sorry!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hOADPPjFNf0dCqLsuaph9w"
  },
  "qI07aHUoOEYrq1KGRBSGOA": {
    "date": "2/2/2019",
    "text": "I always feel like I am on vacation here! Love the food and the drinks! The patio is outstanding but slowly going downhill like other hot spots in town due to the dogs. The couches are ruined and those areas are a little dirty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GMfF7EtQ4_lYXNjXtM08kw"
  },
  "zCGKkha1-B_XPmXBME7Slw": {
    "date": "1/31/2019",
    "text": "Love this place, so close to my home. The food, drinks and staff are great.  So many salads to choose from, when you're trying to eat (relatively) healthy and great sandwiches & pizza when you're not. The shoestring fries are awesome.  Also love that there is jenga and baggo (cornhole) right across the way.  One think I wish was different.... the fire 'display' would be great if they were at the couch/lounge areas, as functional fire pits.  For great drinks, see Stone and Josh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yu8YRpmihXck7pWa1x5r1A"
  },
  "5w_mKfBZmRBjo7SVaCLCNQ": {
    "date": "1/5/2018",
    "text": "I love it when a new business opens near me in an area that has been revitalized.   This restaurant is sitting in the middle of an updated business complex.  I love the look of the restaurant - open, airy with lots of patio space, which is perfect for this time of year.  I'm a bit worried about them for summer because that's a west-facing patio and windows - that's gonna get hot!    First - our server was awesome.  We sat on the patio for lunch, and it was beautiful.  People were playing corn-hole on the green area.  The menu has a great selection with some really interesting options.  Two of us ended up ordering the short-rib grilled cheese and picked greens as our side.  The others ordered the shrimp po-boy and the long-stemmed artichoke salad.  I was really intrigued by the mac-and-cheese - it is filled with good for you veggies (spinach, mushrooms, etc.) and you can add chicken or shrimp.  Next time!   Wow - we all loved the food.  The grilled cheese had LOTS of short-rib. As a matter of fact, I would recommend asking for a little sauce on the side because it was just a tad dry.  But filling!  I liked the dressing for the salad - it had a bit of ginger and was yummy.    Those grilled long-stem artichokes looked fabulous (and my friend said they were) - I see these are also available as a starter, and I plan to try those soon.  The shrimp po-boy had buffalo sauce, and my friend said that it was a bit much - be sure to recommend SOS (sauce on the side).   I plan to meet other friends there this evening for Happy Hour - I can see this becoming a favorite rendezvous - at least until summer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TsuSXVUYLbXtMXzZyOXgUg"
  },
  "lDJ6-zZGahelhyqVrDHAVg": {
    "date": "1/26/2019",
    "text": "Hands down one of the best customer service experiences I have had in a while. Had some family in town to visit and had a large table reserved in advance. Taylor was our server and she was fantastic. Very engaging and always coming by to check if we needed anything even though it was a busy Friday night. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DGDYzTD3JhejyIrAIexx-Q"
  },
  "5sSd2Eb9_CSKGLiWDweOfg": {
    "date": "6/9/2019",
    "text": "Was so excited to see a Pitch is Scottsdale. We are from Omaha, where the other 2 locations are. Love the Brussels sprouts, meatballs and margarita pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H8hEHXJfO_TY0ztKYWZIGA"
  },
  "RbptP83O2O0Ziwp5yHh9Jg": {
    "date": "6/8/2019",
    "text": "Went here for dinner with my husband and mother in law on Thursday.  Nice place and food was pretty good.  It is rather pricey and since it is a coal cooking place there is that burnt smell in the air. I did not enjoy the smoky smell but overall it was a decent place. Server was very nice as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hULemsUX9ZcAg9RJLCoVEw"
  },
  "eNmCEr-d0t2UwuIxPAGdOw": {
    "date": "11/24/2018",
    "text": "Great food awesome beers. Excellent service too. There breakfast sandwiches are sooooo good",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tvRFTuKRfc51Gr-C609hHg"
  },
  "BjcjnPFJZU50GWkMuwKjHg": {
    "date": "9/16/2018",
    "text": "Great atmosphere, service, drinks and food!! The all man brothers is like an elevated alcoholic Arnold Palmer- very refreshing! For brunch we got the morning Mia- their breakfast pizza- it was good, very rich with the hollandaise, potato, and multiple meats.i would def go again especially when it cools down- the patio looks fun for fall!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sHfFumMN8lvnTqohMrF3Sw"
  },
  "Am8K3MI3Gap0Cm460Vf5Iw": {
    "date": "9/16/2018",
    "text": "We dined here for the first time, and YUM! They have flavored iced teas, my boyfriend got the jasmine blackberry and I had the earl grey (my favorite kind of tea) and they were very refreshing! Everything on their menu sounded delicious, but we came here for the pizza and decided on the Margarita pizza with an added balsamic drizzle. The pizza crust was airy and crispy, there was the perfect amount of cheese and the sauce was very \"grandmas secret recipe \" tasting- SO GOOD. For dessert we had the seasonal berry cobbler with gelato on top and it came out hot and bubbly from the oven. The service was also impeccable, and overall were very impressed by this restaurant. I am so glad we found this spot and can't wait to come back for more great food!  Also - They had 1/2 off bottles of wine which we will definitely keep in mind the next time we're headed here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A6_MAxij-41Nu2NwTJunJQ"
  },
  "UVmzuW5EfHVO9wZmXJVIlw": {
    "date": "1/18/2019",
    "text": "My husband and I came in for dinner tonight.  The experience was exquisite.  We sat at the bar.  The drinks were wonderful and I thought the salad I ordered for dinner was going to be a bore.  It was anything but that.  It was beautifully displayed, delicious, and fulfilling.  The bartenders were friendly and truly loved their job.  We will definitely be making the drive back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XYzqUf3kHlsvL3OdXGCi2A"
  },
  "uUgJwR4SxSX5uPmkMWWPlw": {
    "date": "1/7/2018",
    "text": "When we arrived we received a very friendly greeting and were given our choice of indoor or patio seat. Since with weather was delightful we chose the patio. Our server was very friendly as well. We order vanilla lattes and reviewed the menu.   This spot is biking distance so I was really excited to try it out. I was disappointed to see there was not pancake options however they had a breakfast burrito on the menu and they are my go to breakfast option. I ordered the short rib burrito and my husband got the breakfast special, biscuits and gray.  The food didn't take long to arrive. The presentation was lovely. My meal was delicious! Short rib burrito topped with scrambled eggs and a side of breakfast potatoes with chorizo sausage. It also had this tasty jalapeno cheese sauce.   My husbands meal didn't live up to the hype. His biscuit took up most of the dish, there wasn't enough gray or sausage. He was a little disappointed. However he got the other half of my meal so that made up for his order envy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wIG2cFlqL-YiyqqKCzFQWw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wIG2cFlqL-YiyqqKCzFQWw/o.jpg"
      },
      {
        "img_id": "GI6n4ty4W7fBYfho1Fdhcw",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GI6n4ty4W7fBYfho1Fdhcw/o.jpg"
      },
      {
        "img_id": "Ctr8sEkdop6O6jx5JpnccQ",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Vanilla latte on the patio .. starting out delightful",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ctr8sEkdop6O6jx5JpnccQ/o.jpg"
      }
    ],
    "user_id": "8NyfmvP9Zg3d3s12hxxVkQ"
  },
  "rCd1Mdy5nV_CMPpcYKm8pA": {
    "date": "1/31/2019",
    "text": "This is hands down the best pizza I've had in Arizona. The spot is kind of hard to find it is in with some office building and almost looks like one at first. The patio is really cute and the open design of the building is really nice. The crab cake salad is also extremely good but the pizza is the star of the show. They have extremely high quality ingredients and you can taste it in every bite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YgqrJh93TncyQsDmhy8NEg"
  },
  "DDYDIognVECMXvMkkaW5fQ": {
    "date": "6/23/2018",
    "text": "out hot.   I love the idea where they brought out the large empty Italian tomatoes bin and used it as a little table for the pizza to sit on. What a good idea.   Our waiter didn't seem too social or even happy to be here.   This place is cute. Love the light fixtures. The patio is nice too. Too bad it's 100 degrees out.   I will definitely come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wcwqGbkNH6HxW7gPnsZITA",
        "caption": "Photo of Pitch - Scottsdale, AZ, United States. Shroom pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wcwqGbkNH6HxW7gPnsZITA/o.jpg"
      }
    ],
    "user_id": "D2ljL5ejuqpa4f8fnZ1qjw"
  },
  "-EYCBGFebfCFvpVK9xtcfg": {
    "date": "4/29/2018",
    "text": "Awesome place and boy, did Thomas need something like this. First time we went in, the owner was there and was excited to get us set up and recommend his favorite. The whole staff here is excellent.   We've been back several times now to eat there or get take out. It's always busy, but the restaurant is really well run. The staff seems to enjoy their time there. They have a great atmosphere with an indoor/outdoor bar and a few local beer selections.   Of all things we've gotten, the pappardelle pasta stands out as the best to me, but the other pastas and the pizzas we have had are all really good with one exception; the spaghetti. I wouldn't recommend the spaghetti as it's likely not what you're expecting. But, maybe it's just me as I don't like angel hair pasta.  It may seem a bit pricy at first glance, but the quality of food is their. Their pasta and sausages are made in house. Pitch is one of our new favorite spots.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fOe2cAYRsLTO9JAG5tpF0A"
  },
  "njZZ7iNy2AGYG2wJCwgRXw": {
    "date": "3/31/2019",
    "text": "#1 OUR party of over 50 +was booked for over 2 months . It was dining then movie screening. #1 Really BAD service includes several people holding menus up to shield the glaring sun from our eyes the bald dude had to be asked SEVERAL TIMES to move the umbrella that was standing feet away. He did not move it to help us, the staff just watched as we kept holding menus to block our eyes & played musical chairs moving every few minutes to be able to see!!! Lazy. #2 staff tried to kick us all off the table after 30 minutes and we already ordered saying it was supposed to have been reserved  [ had no reserved sign & we were TOLD that table was for us and there were 2 of our party members already sitting there for a while when we sat down] so right as our food was about to come they again tried to kick us off after we just ordered, #3 another staff, I assumed the manager came & AGAIN told us that \" this table was supposed to be for others but you guys can just stay here we will figure it out \" oookkk,,,, WHY COME TELL US THAT ??? WE ARE A PARTY OF 50 PEOPLE eating meals .. so STUPID!!!  #4 staff came back after we had JUST STARTED EATING said we did have to move and #4 had US ALL CARRY OUR OWN FOOD plates & glasses off that table into the film room [ I personally has 3 plates of foods and a water & cocktail] which ALL ARE IN MY REFRIGERATOR UNEATEN GOOD BYE $43!!! for actually drinking my 1 cocktail!! #5 we had to sit for 30 minutes without any service in the movie room #6 sat freezing in the ICE COLD WINDY ROOM #7 some genius had the FAN on NOT A/C so it was 62CONSTANT FLOWING air blowing FREEZING US & blowing wind on us & in our faces for nearly 2 hours straight. #8 MADE US CASH OUT OUR TABS WHILE WE were TRYING to eat & made us open a new tab if we wanted to order more drinks #9 left my food on the wind blowing table for 30 minutes after I ASKED 2 DIFFERENT PEOPLE more than once FOR BOXES so my 3 plates of food sat there under WINDY dusty air vents constantly blowing air all over my food #9 forced me to get ugly and DEMAND she walk her ass over NOW to bring me a box #10 charged me +$4 to do 1/2 the nuts the dish already came with #11 served me SALTY WAY UNDERCOOKED sprouts ...   and even tho she SHOULD HAVE known our party of FIFTY the film started at 6.30 she put all of our orders in a 6pm after we strongly reminded her multiple times .. other than that it was ok ....so long and good bye FOURTY THREE DOLLARS for 1/2 an order of onion rings, a side of brussels sprouts that were BARELY COOKED and a salad and one cocktail.. ALL UNEATEN because it had dusty air vents strongly BLOWING on it for 30+ minutes . Cant bring myself to just toss it all, I'll try to cook the sprouts myself. ANNOYED  if it was not my friends documentary we were there for, my entire party would have just up & WALKED AWAY . I doubt they will respond to this but I thought I would tell how my first experience at Pitch went from start to GLORIOUS FINISH! with SO MANY flaws and givin that the big party had been pre planned for MONTHS they need to get it together! I feel that they OWE us to show us they can do a good business. ... OR CAN THEY????????",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "fCpldExHx52Vn6A5aXDm8g"
  }
}