{
  "mEhTCd7yabjJ5_ghfgbcLw": {
    "date": "12/4/2014",
    "text": "I love trying new places and I've been wanting to try this place for a while but for some reason I wasn't too interested once I parked. \"Eh, what the heck!,\" I said, so I gave it a try. I walked in and was told I could have a seat anywhere. It was pretty empty and thought it was busy, from what parking looked outside. Only 2 groups were inside. I took my seat of choice. It didn't take long for me to order and I thought my breakfast was going to be hot, once I receive it. Truth be told, I'm not one to be negatively critical on the places I go eat nor am I picky. I got my huevos rancheros and looked yummy. It came with 2 lightly fried tortillas, 2 eggs topped with salsa, refried beans, and hash browns. Unfortunately, my plate was cold. The beans, tortillas, and hash browns were cold, which made me not enjoy my breakfast comfortably. Although it did have great flavor, it was just cold. The owner was nice, though. I may give it another try for something different.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xnUHUlKsTbA1LuyY3yUCZw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Huevos Rancheros. Would&amp;#39;ve tasted better if it was hot.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xnUHUlKsTbA1LuyY3yUCZw/o.jpg"
      }
    ],
    "user_id": "nSLz1hlkiLz_fflqOR1jdA"
  },
  "tNfzLBSJn5TZNxP-3cqLTg": {
    "date": "8/22/2014",
    "text": "My partner and I go here about twice a month for breakfast.  While the service isn't always great we do love the breakfast.  The pancakes are fantastic, heuvos rancheros just enough spice to keep them honest and the omelettes are great!  We suggest sitting outside, it's quite and we love that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DX58Ek5VbD68NAJvVytYUw"
  },
  "phZg5ojnu3XFBuBT3nBoNQ": {
    "date": "8/11/2014",
    "text": "We tried it for breakfast yesterday because Joe's Diner was packed. I got the chicken fried steak and eggs and C got ham and eggs.  We both got a side of biscuits and gravy and coffee. Everything was wonderful except for the biscuits. They were hard as rocks. And I'd like to see some sausage in the gravy. But all in all, I'd go back again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nQfdjkGqkIYLQkkemgc4Wg"
  },
  "eGwst0tnarjbdBXgPK4_GQ": {
    "date": "7/19/2014",
    "text": "Cute place in a good little neighborhood however this was not my favorite breakfast spot . My husband and I stopped by to order omelette and traditional French toast. I was very excited to eat there since I had heard lots of hype about the place. When we got our food I was highly disappointed by the cold potatoes that were given to me. Also, the omelette was meh... Considering all the yummy breakfast options on Melrose, this place is not my first choice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lBzCbSf9ekDP4iao-5Sb0Q"
  },
  "fonAEZjBWaixamPK0VgZ0A": {
    "date": "2/1/2014",
    "text": "I tried Melrose Kitchen for breakfast on a Saturday. They were busy, which I took as a good sign.   I ordered the country fried steak and eggs. The country fried steak was good. The menu advertised it as coming with sausage gravy but I'd never know. It tasted like basic white gravy. The eggs were ok, although a little more cooked than I preferred for over medium. But the hash browns were not my favorite. They looked good. Crisp and golden brown, but they tasted like reconstituted dehydrated potatoes. That was disappointing since I love hash browns.  The coffee was excellent and only $1. The whole menu is relatively cheap. On the bad side, the hash browns tasted like they came from a Waffle House.     Not a bad little place. But I really wished they'd use fresh potatoes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HnZ9SrrAMsq43A6N6UTXbw"
  },
  "0P-Ek7xapBR8Cb7MP-fXVg": {
    "date": "6/7/2014",
    "text": "I love the Melrose neighborhood and this place fits right in. The Kiwi lemonade is fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TnRcGRybKUR5phkN7Es3jQ"
  },
  "wfRzueg_bf7mtNR-E8_R7Q": {
    "date": "3/27/2015",
    "text": "I enjoyed the breakfast burrito and liked the taste I had of my friend's french toast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DMqMnojqjWxuORWYLGBQwg"
  },
  "NHeDhzI9SNH2Ifzv1dFFBw": {
    "date": "4/15/2014",
    "text": "What a wonderful hole in the wall place! It was perfect for my boyfriend and I since I wanted breakfast and he wanted lunch. The omelette was delicious! I'll totally come here again, the decor is super cute!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X-FvrcEG-h_liUduxEbebQ"
  },
  "d3vYMIoBDnqd02sgOlp02Q": {
    "date": "12/19/2014",
    "text": "Let me start off by saying it's my first time here. When I walked in the restaurant was half full an the tables the where empty where cleared off but where not washed. The service sucks my waitress did it know any of the menu, she did not look like she wanted to be here. She did not keep up on my drink I had to ask numerous times to fill it. I had the corned beef hash it says \"home made\" it was nothing to write home about. I also had a side of biscuit & gravy, that also I did to like the gravy was \"grainy\" line it came out of a package, the biscuit tasted like it was under cooked. So all in all I did not enjoy my food and I will not be coming back any time soon. If I could have given this place a half star rating that what it would have gotten",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u4nJDhu5hLiD7Mfjc0qW4w"
  },
  "2OBFjgIEJ1bI5CgoLZnUxg": {
    "date": "1/4/2014",
    "text": "First time there today and I was so impressed! I found the recommendation on Yelp and decided to try it out this morning after a long night of drinking fun. First, the location isn't that bad. Its next to a cute antique shop in the Melrose shopping center. When you walk in youre free to sit where ever you'd like. Its a pretty small place but very welcoming and kind of awkwardly decorated. The service was excellent and had our food within minutes. We had the breakfast burrito, which is amazing and you choose your own ingredients (up to 6 total). Its definitely taste. While we waited for our food we definitely rocked out to early 90's R&B music, which I thought was cool and totally unexpected. The prices arent bad and the menu has a good variety of food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYPskzjqJ3yPYjyNKnTxLg"
  },
  "mXwHI4unlmg4sgwO0ARjXA": {
    "date": "1/3/2014",
    "text": "Very friendly, warm and cozy... Fabulous food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mR0N5-ypFf2lFZn8SJ-cUw"
  },
  "9MlPJA61dNGF6h1gBCmASw": {
    "date": "6/1/2013",
    "text": "Amazingly cheap prices, very cute interior, excellent service, and very tasty food. I have nothing to complain about! I got the breakfast burrito with three kinds of cheese, ham, bacon, potatoes (they come with and you can get them in the burrito or on the side) and avacado (an extra $0.79 but worth it) (you get 6 ingredients you choose from a huge list!) for just over $6. The tortilla was fresh and tasty and it was loaded. Also got a blueberry slush lemonaid ($3) and it was obviously fresh and very refreshing. Mom got the \"special\" chicken fried steak with gravy, with eggs, toast and hash browns for about $8. It's not on the menu so definitely check the special board before ordering - it was DELICIOUS. The only complaint she had was that the hash browns weren't quite crispy enough, but that's such a minor thing. Checked in with Yelp and got a coffee for free, but it was only $1 anyway with free refills. They also had a pretty large brunch/lunch menu which I look forward to trying.  Will definitely be back. I'm pretty impressed, especially with how little everything costs. That's a huge plus for me these days!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "94HchNwPr69BdrF0On9uKQ"
  },
  "aYB-ITuep0QspO_gQxLiWA": {
    "date": "3/27/2014",
    "text": "Its hard to miss because the location's tucked inside a shopping center, but once we found it i realized that I had to come again. Its a quaint, friendly, personable diner-ish locale. The OJ is delish, and although I'm GF, I get the French Toast EVERYTIME. And the prices!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "suD8AjbVgB4pAXLawhIAmQ"
  },
  "v6_JSHPShvnRJr5r5lp3rw": {
    "date": "1/1/2016",
    "text": "While sitting for an eternity waiting for our order to be taken and then served I was noticing how hard the single server (owner?) was working very hard. So I was not in a hurry was trying to give him credit for the hustle and noticed there was a constant flow of people who seemed like patrons. So I waited some more all the while never checked in with or offered more soda or water hoping the food would be worth the wait. The tamales I ordered where inedible. I could NOT get my fork or knife through them. My and my kids potatoes were cold. I left most of my food untouched. When sever came for bill she asked how was everything I told her how unhappy I was she offered no apologies or solutions. I would never return or recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T54O0q11Sq7q7RnBy5TCMg"
  },
  "Qgwww0BqmgENh6YvFELvuQ": {
    "date": "3/4/2013",
    "text": "Stopped in for lunch after taking in the 7th Ave Street Fair.  I ordered the Parmesan crusted Swiss cheese burger with fries and my husband had the pastrami.  Yuck.  After waiting over 30 minutes for our order, Parmesan crusted cheese burger came out with no Parmesan crust, American cheese, limp lettuce, tomato, and a pre fab grey cooked frozen burger.  Fries were soft awful.  My husband's pastrami had one measly piece of meat on it.  A few bites into it, we decided it wasn't worth the calories and left. Complaining would have done no good, they were swamped from the street fair and really didn't care.  Bathroom was a dirty mess, too.  Won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "caEisRFzWv_Trxjekjywdw"
  },
  "SC6lo4px_8bSG3PH1FTHLA": {
    "date": "9/26/2014",
    "text": "Best breakfast place I've been to in Phoenix! I had the cinnamon French toast and home fries, which were both perfect. My boyfriend had the huevos rancheros and he loved them! Service was great, would definitely come back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EfRBD7Dlhfl3wU7hOL0uRg"
  },
  "22uk6fD6Y2qeUx0-BejXog": {
    "date": "3/25/2014",
    "text": "Great feel! Great breakfast! Pleasant service! Down home feel! They let me make up my breakfast exactly the way I wanted. Fresh squeezed orange juice!! Sooooo glad we stopped here! Sat outside!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mcp_KMrRvwSJTUKkj8M7SQ"
  },
  "OWXQnwQVAJgsb4aoia0caA": {
    "date": "1/17/2016",
    "text": "Waited over 30 minutes after placing breakfast order, waitress never came by to inform us that there is a problem, in fact , she was avoiding us.  3 tables sat down after us and got their food - finally we got up to leave since we had no idea if we will get food - we told owner and he just said \"OK.\" The staff had no interest in making any attempt to feed us or apologize",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iitB_6ryt_xSup1etMnCmQ"
  },
  "fLtSx-nTW2xQmiLhaeelUw": {
    "date": "12/6/2014",
    "text": "If I could give zero stars I would. The absolute worst service. It took 30 minutes just to get water and menus. Then another hour to get food. Will never be going back here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9WRe3tFWKTD713n0iQ2uQ"
  },
  "KuETxWRPpZV_d0KyRet59Q": {
    "date": "10/18/2013",
    "text": "Love this place!  I've been many times for both breakfast and lunch (b-fast is my fav!) and love it every time.  The manager (or maybe owner?) is a super nice guy, very welcoming, kind, helpful.  Back when it was Two Hippies, I asked if they had iced coffee.  Even though they didn't, he made me my own iced version!  Food is delish and I love the location.  The ambiance is fun!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rD5U4o9NxkxRO86JmmMOdg"
  },
  "lnF3UcXNNhzlFU1VjWEKPA": {
    "date": "12/7/2016",
    "text": "I loved this place it is super cute. Ordered stuffed french toast it was great that hash browns were the best! The whole vibe was very pleasant. Had chicken tenders also but those were not that great too crunchy. Beautiful patio called the secret garden.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VGUR_C8FmjdmBMUd7b1sIg"
  },
  "5HFf2eJFtxTarKN4RsUQeg": {
    "date": "11/4/2017",
    "text": "Great little neighborhood place the corn beef hash and eggs are exceptional fresh corn beef hash that's not from a can.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IWv77-Hn5ypla2jGEYNmyQ"
  },
  "GzS_Wo1L8Otk-b49nRLE0w": {
    "date": "2/18/2013",
    "text": "We were in the mood for breakfast yesterday and decided to give this new place a shot. Turns out it is wasn't exactly \"new\" except for a few things. Pretty annoying. You order at the counter and they bring it out to your table. The staff were friendly and attentive.    I would quantify this place as low-end country breakfast. The food was just okay but prices were extremely inexpensive. My 2 egg breakfast was $4 and came with eggs, choice of meat, and toast. I also ordered French Toast for $4 and it was a decent portion. But overall, the food was not that great, just very mediocre. I am sure I would not go back....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y_2jMUKz6pvJ0JSWG3u10A"
  },
  "nnucdcUpls0TZ0ZbsvlwMg": {
    "date": "1/1/2015",
    "text": "Service is non-existent. We had to get up twice to first get someone to take our drink order sheet waiting for 15 mins we then waited another 15 to be able to get someone's attention to bring our drinks that we ordered. Our food came before our drinks and when our drinks came they didn't even get the order right. It was 3 waters and 2 coffees, very difficult.   I think the cook got the sugar and salt mixed up because the hashbrowns were very sweet and you only get about two bites of hashbrowns anyways.   Coffee tastes old.  Omelets are decent but nothing to rave about.  After being served our food no one has come back to our table to check on us.   Maybe just don't sit at table #5. Other tables seem to be getting better service. Since I've had so much time to kill waiting for service,  I've seen several tables send back food from incorrect orders.   We were excited to try a new place for breakfast,  but we won't be coming back here or recommending this place to anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z4m531c6tRblfMCmFDuemA"
  },
  "kLTX0Yd6Pts1CFT3tt0eGw": {
    "date": "9/5/2016",
    "text": "Hands down the worst service I've ever experienced. Food came out at different times.  Everything taste like a HIGHSCHOOL cafeteria  made it.  Except this is much worse.  The space is cool but a big let down.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4fyuN7N-8cMc_SrLtt7tQg"
  },
  "1q8rPDh3UNMHA0yBwbqUAA": {
    "date": "3/4/2017",
    "text": "Glad my wife saw this place! Enjoyed eating out back in the \"Secret Garden\". Food was great too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pw8QIbipbcyjZyOjRsDv6Q"
  },
  "6P__Fnqki1YRIO6Czzm9Hg": {
    "date": "10/23/2016",
    "text": "My brother and I had a takeout order from this place today. I was really disappointed with the overall quality. The eggs were flavorless, the bacon was floppy and thin, and the hashbrowns were a small portion and soggy. Now all of that would not be so bad except that it was $9 for this sad meal after tax. I was not expecting too much but Yelp let me down on this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZssjeQIkYj8X2tvepC5fFw"
  },
  "cwrLVC7IE-ofkfM6GkIWOA": {
    "date": "10/12/2016",
    "text": "We absolutely love this place. Everything is delish and the staff is super friendly. It's definitely a must. A great place for family and friends and our furry Baby is also welcomed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sMTllwbUsXiL_hnHQRwbhw"
  },
  "kaEJ49TJMQdPKmBy24_UNw": {
    "date": "6/28/2015",
    "text": "I have the pastrami sandwich today which was recommended.  Which was great.  However they put  Little pastrami on their sandwiches. :(",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MXy2efnVDDgLQkcibBuiJg",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MXy2efnVDDgLQkcibBuiJg/o.jpg"
      }
    ],
    "user_id": "-k9k-Gsp_cClOquIsOfXdg"
  },
  "jNCfvR61IKY3ySm_GSJUzA": {
    "date": "2/11/2015",
    "text": "What a cute little (very little) spot. Original menu, not just the basic boring stuff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WsAejVneMXU-_yp_W0b_2A"
  },
  "j2Im-uw8qZYgmbpCn46vRQ": {
    "date": "11/22/2016",
    "text": "The breakfast at Melrose Kitchen was really good! We tried the Huevos Rancheros and the Country Fried Steak and I loved both!  The biscuits are divine! It's a small little place, but the atmosphere is really nice! I'm only giving 4 stars because the customer service was pretty mediocre. Other than that, it was great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DG094chY97v10Wa5KzontQ"
  },
  "5ZJwJBNZeiD_z1rSyUtvbg": {
    "date": "8/2/2014",
    "text": "We stopped for breakfast around 8:30 a.m. on a Saturday.  There was one other party in the restaurant.  We were greeted politely and seated immediately.  Our server quickly took our drink ordered, and offered to take our food order if we were ready.  I ordered the biscuits and gravy meal, which comes with a buttermilk biscuit cut in half with gravy over top, two eggs cooked to order, hashbrowns and sausage.  The eggs were cooked just as ordered.  It was $6.99.  My boyfriend had the two eggs cooked to order meal, which comes with two eggs, hashbrowns and a piece of toast.  It is $4.69, $7.19 if you add meat.  He substituted the regular toast for gluten free bread, which came at a small additional cost, but was a good gluten free bread.  We enjoyed the food and thought the prices were really reasonable.  We would like more gluten free breakfast meat options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Oe57AmWR4soZA1oTxoNoQ"
  },
  "9qXeQHObozo5CeVOHObMYA": {
    "date": "4/7/2014",
    "text": "Can't believe I've lived in Central Phoenix for five years and am just now finding Melrose Kitchen. Hubby and I stopped in on a Saturday morning around 10 am, and I was expecting the place to be packed - but thankfully, it wasn't. In fact, aside from the shrieking kids behind us, it was pleasantly calm.  The first thing I noticed walking in is the mix of colorful and eclectic decor - it has a real personality, not a cold cafeteria feel. The second thing I noticed was that the eating area was very clean - no dust on the decor, no torn seats, no forgotten crumbs on the tables.  We were helped by three different servers throughout the meal, but our primary waitress was very friendly and bubbly. Our coffee arrived quickly, tasted strong and fresh, and was refilled frequently - a must-have element of any respectable diner. I ordered the huevos rancheros and my husband, who is on a strict GF diet, had the homemade corned beef hash. After reading Yelp reviews, I was prepared to wait for the food, and we were in no rush.   The food was worth the wait. Our eggs were cooked exactly as we'd ordered them, the beans had a gentle spicy kick, the tortillas weren't soggy, the hash browns were fresh with good texture, and there was just enough cheese to add good flavor without drowning the dish in a pile of oil. The homemade corned beef had a rich and unique flavor that I couldn't quite place - I'm not usually a corned beef freak, but theirs might just convert me. There was a full bottle of tabasco right on the table, which always makes me happy.  After we scraped our plates clean, the wait staff was happy to clear the table and keep topping off our coffee. We didn't feel rushed as we enjoyed the atmosphere (and caffeine).   Would love more GF-friendly options on the menu, but at $20 for two (pre-tip), I've found my new local diner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "FfvovuPQSTCAz19mj3mV1w"
  },
  "uQbOrS9j9tjkcJ5b1r4l3g": {
    "date": "8/23/2014",
    "text": "Great little spot for a bite. French fries just like I like them, extra crispy on the outside and soft and creamy on the inside.  Had a great lunch, split a hamburger and tuna melt with my wife. Added a shake to complete the meal .  Great service and a cozy place to relax while feeding.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zoo127mamOT7NTbDR_l45g"
  },
  "LDg7Kc_hnBUWBFNe-y6ZuQ": {
    "date": "5/18/2016",
    "text": "Oh my gosh! They have amazing huevos rancheros. I try to get them at least once a week.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wTTalOQvYZheaksFnFc4kw"
  },
  "hykklv9yiAk-GKHwOpqz-A": {
    "date": "2/3/2015",
    "text": "What a wonderful omelette. And I love how the kitchen allows you to choose six fillings. I piled mine with tons of veggies. It was really delicious. Friendly service and a Great atmosphere. The coffee could have been stronger for my taste.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BvH8xIC4TCrSHtBpRfmdog",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Omelette",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BvH8xIC4TCrSHtBpRfmdog/o.jpg"
      }
    ],
    "user_id": "UK2DsID5q3MCqYX23S6xXw"
  },
  "ZQ3WPBDiMC39zTQybfs9dg": {
    "date": "7/17/2016",
    "text": "Great neighborhood spot with plenty of sweet and savory breakfast options. One of the fastest kitchens as far as getting your order out quickly and correctly. Veggie and dog friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vrd1fhGBjm9QL4tcakQw1A"
  },
  "rbn07sjVtdbMsJHIe7tASA": {
    "date": "8/24/2014",
    "text": "I was hoping for a great place as I saw lots of cars outside and a welcoming staff once inside the narrow space. It's cozy and there are plenty of staff coming around for assistance.  Yet my water glass was never re-filled and and they kept wanting to clean up fast.    Coffee was disappointing.  Bacon overcooked and thin, too crispy.  Hash-browns decent.  One piece of bread cut in half for toast and too dry.  Omelette comes with six ingredients for one price, nice.  But it had no taste.  I ordered it with salsa - also pretty tasteless.    Am I picky?  I am about breakfast.  I have been looking around for a good place since WyKnot closed.  No one has been able to come close to Jackie's amazing talent. Plus I live in Phoenix and trying to find something central.  (Joe's place is around the corner and also not worth it).  My daughter got a shake for $4.50 in a plastic cup.  No presentation.  $17 for a tasteless breakfast.  They have gluten free and vegan options so it be worth some one's visit for that aspect.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-lsU9gI45Fbm82Z9I_Y2LA"
  },
  "oyxwG3FLA4IaV5lXfwAvtQ": {
    "date": "9/20/2016",
    "text": "The Melrose Diner was a good as I remembered. Its always a favorite and their huevos rancheros was awesome.  I highly recommend this neighborhood staple.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5kNZQSOUKZL83IEdLMAoMw"
  },
  "dUTo3_UyylL2GUJ-mJLkQA": {
    "date": "8/9/2016",
    "text": "Quite a disappointment....stopped in a lunch on a recent Tuesday, burned out on drive thru fare and decided to treat myself to  what I thought would be a real salad without little plastic pouches.  It was 11:30 am and the place only had one table active.....so i ordered at the counter decided on the chicken ceasar salad and an ice tea TO GO. It was almist $12  After an excessive (i thought) 15+ minute wait I finally received my salad and knew before i opened the box it wasnt going to make me happy because it was so light.  Then at home when I got a look and taste of it, well 2 stars was generous.  It was a scant layer of romaine the barely covered the bottom of the box, some premade croutons, and about 2 or 3 ounces of hot grilled chicken breast cubes (hot chicken on cold lettuce yuck!) no parmesan and a tiny cup of dressing. SO: ingredients: so-so ( some were missing) presentation: NO wait time: NO Pricing:  NOT in  line with what i received Staff: Nice, very friendly  So I paid almost $10 trying to get a better quality salad and the $5 salad i usually get at Wendys was better in every way..... alas although I may try them again based on nice staff and extensive menu , would not recommend to a friend  though.....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OCjs9-jozS6XkSZohG96Yg"
  },
  "g1EkmCwPbzQcT0NWWQ_3dA": {
    "date": "2/4/2017",
    "text": "Went to check this place out today had an orange juice and an omelette which was good you can put up to 6 toppings in your omelette for like 9$ and comes w toast the portions are huge I couldn't finish mine so took it home even though I never ever eat leftovers lol I like this place it's cool but nothing to write home about with the omelette maybe I'll try something different next time",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9JXwM20Otwyp0aZ4hJ2Vaw"
  },
  "JUKsHWCr_DV0huRLaAITYg": {
    "date": "2/27/2017",
    "text": "Place is clean and cute, but food was  mediocre. 5$ for a latte that wasn't good and it was so cold inside that we had to wear our jackets.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wwEPXIwF-TbZ-vkJU7Hacg"
  },
  "y9-mgsKnR3Kf2caK0wIrag": {
    "date": "2/19/2017",
    "text": "Food was good... service was a bit of a mess...3 different servers...had to grab one running by for a refill or napkins or the bill... but if you are quick and have good running shoes to catch a server, the food is pretty decent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a-fm3v3jlGh8cOKrgc0AXQ"
  },
  "-57wmxL7hXvmr2STT58xRA": {
    "date": "6/17/2017",
    "text": "The eggs Benedict was cooked to perfection.  The outdoor covered patio is perfect to enjoy a meal with our fur baby.  Great service and friendly vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cl7Hp4CxCQQvV-Ru0JTJxg"
  },
  "Cjrl91hfUzl0IWjkkEsAKg": {
    "date": "7/12/2013",
    "text": "This place was delicious!  I loved the decor and the food was really good!  I had the chicken fried steak for breakfast with hasbrowns and toast.  I really enjoyed it!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-UKMDFaNSVVsmRGrJDCQJg",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Chicken fried steak and gravy!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-UKMDFaNSVVsmRGrJDCQJg/o.jpg"
      },
      {
        "img_id": "q6vtO-v3X20rrRfGIGn1UA",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Steak and eggs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/q6vtO-v3X20rrRfGIGn1UA/o.jpg"
      }
    ],
    "user_id": "e9V-hsaLlQIFvo5GnJIkbg"
  },
  "VPXmAd5xukKpr1D2miAkEw": {
    "date": "4/8/2017",
    "text": "Don't bother I have eaten here a few times and don't know why I come back other than it's close to my work. Waitress staff is friendly but the manager asked how the food was , had the carne asada burrito, and said it was poor. He asked why I told him here were chunks of pure fat and grizzle in the meat. He didn't say anything just said oh... and walked away. Then the other manager took my bill and asked how it was and I said poor. He took the money $20 and never brought back my change. After 10 minutes went to the front and said are you planning to give me my change back? Again nothing but oh let me get that, this will be my last time ever here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b0sggdZFrsDoNMA7QQBIKA"
  },
  "E_No4uZAH-PIFIaO9qiHIg": {
    "date": "4/8/2017",
    "text": "Really great local breakfast spot!! Sat on the outdoor patio and the service was very friendly and food was delicious!  Great little gem in melrose :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kc3CKBxXObPJJFB4z6XHnA"
  },
  "SAOrf1ctUd51Uu4LTnJOEA": {
    "date": "4/2/2016",
    "text": "Sadly, this was really bad all around.  The garden outside is fun but not worth the poor service and poor food quality.  My biscuits were as tough as rocks, the sausage was overly crunchy, and the potatoes were burnt strings.  Service was lacking for sure.  Probably won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kuVubVoOoTTVBdhXeEgrQQ",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. This is the patio!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kuVubVoOoTTVBdhXeEgrQQ/o.jpg"
      }
    ],
    "user_id": "khVcxO9mpfPxz-H3viG7vg"
  },
  "Mgj9sc7lra-l4w6gUrJEAQ": {
    "date": "2/24/2013",
    "text": "Was here a couple of weeks ago for Smunch.  Had the country fried steak and it was fork tender.  I asked if I could skip the toast and have some of the gravy on the potatoes too and it was no problem.  The portion turned out perfect for me and it was cheap.  Throughout the meal the servers were attentive with coffee and such.  At a couple of points one of the servers sat down at the upright and played a few lines.  There is a sign encouraging customers to play a tune,  While not a destination restaurant, the price point/serving sizes fit well in this neighborhood.  3.4 stars",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "Z128ihQea7BLPh2T9q9sKA"
  },
  "65k7SaFG2OPpSgiTNCiA2A": {
    "date": "10/18/2015",
    "text": "Not bad, not amazing either. Walked into the dead place on a Friday mid morning for a quick breakfast. Was waited on and ordered quickly. I see lots of bad service comments. In my experience the service was excellent, no up sales. Prompt service. Just order food and get it in 10 min. Perfect! Recommend",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XxglaN3qC3B6anV0NpJQqg",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Biscuits and gravy, sausage &amp;amp; eggs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XxglaN3qC3B6anV0NpJQqg/o.jpg"
      }
    ],
    "user_id": "6Q-lmfBlse3-VcULgtp_vg"
  },
  "oxZD8-FMXCeSMAKxX0zITA": {
    "date": "12/4/2016",
    "text": "Small neighborhood diner.  Stopped in for breakfast with my cousin.  Walked in and the decor had me questioning our decision to stop in.  However we had great service and the food was even better.  I had an egg white omelet with hash browns and a slice of wheat toast.  The omelet was cooked perfectly.  Coffee was ok.  My cousin had steak and eggs and said it was very good. All in all a pleasant surprise.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TsdHI4xFWmSA3sCh2hEYnw"
  },
  "byr3OIX26gVOSjH_LpRNGw": {
    "date": "11/5/2017",
    "text": "This was a very cute diner with delicious food. The service was impeccable and the owners were very nice. I would recommend the almond and banana pancakes. I will return with more people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bN87rFioxh5spt9j1B2Dpg"
  },
  "0BCy_8xYLei-nS0zOk6Mwg": {
    "date": "1/30/2015",
    "text": "I HATE giving poor reviews but I will if it really deserves it.  This place was absolutely disgusting and just awful!  It is so obvious from the poor service and gross, cheap food that they don't care about the customers at all and have no business being open serving food.  Service is horrible!   Slow, no interest in working and just not friendly at all.  Waiter essentially forced me into changing my order from plain pancakes to their coconut and banana pancakes since they are \"really popular\".  I gave in and added 2 eggs over easy and hash browns as well.  Daughter ordered a bacon waffle and hash browns.    My daughter didn't get her hash browns but the waiter took off so I shared mine instead.  Hash browns were stale and tasted like they were cooked in very old and reused oil.  Seriously so gross tasting!    Pancakes were very obviously the most generic pancake mix you could buy and they burned 2 of them.  The banana and coconut was just a few pieces thrown on top... not worth $10 by any means!  I am a horrible cook and my pancakes are way better!     Bacon waffle was flavorless and bacon was either burnt or raw.    Even their water tasted like old stale food and possibly leftover grease.    I seriously could not get out of here fast enough and drove very quickly home and puked everything up.  It was THAT gross!  Stay away... worst $25 I have ever spent!",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "4rpWrd3vO-KlKpXUaNii_w"
  },
  "Yhl5U4ws_BCdMYPc1vNHAw": {
    "date": "3/30/2017",
    "text": "I really wanted to like this place since it's in my neighborhood.  The staff was friendly, service was a little slow.the atmosphere was kitschy verging on cluttered. I had biscuits and gravy, they were bland and my eggs were cold. I wanted a latte but something told me don't bother. They seemed busy while I was there so maybe I just ordered the wrong thing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yrbu6Ojo1tN91aYjRLjmfg"
  },
  "xqIJD2-64uVQP29oj3iJcA": {
    "date": "12/14/2017",
    "text": "Best hash browns ever!  Crispy and NOT greasy.  Eggs cooked perfectly as ordered and bacon crisp and yummy.  Staff is friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X6FeD6mRQSoF7eDXB1Arew"
  },
  "iZ-hTZA0_IPtqwcEq4Wfhg": {
    "date": "10/23/2013",
    "text": "Huevos rancheros and bottomless coffee for $8! Service was lightning fast and friendly. Newspaper was current. Ingredients were fresh and delicious. Nothing fancy, but the sauce, beans and eggs were all made fresh in house.   Coffee was bland but inoffensive.   Great breakfast before a day of shopping the vintage stores along Seventh Avenue.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kD0c68MmH5y3I18dMlqWUg",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kD0c68MmH5y3I18dMlqWUg/o.jpg"
      }
    ],
    "user_id": "VbhQF98kILGyc_-YHrysRw"
  },
  "efZZCH6yyjiDZSHj5QlFAA": {
    "date": "12/28/2016",
    "text": "Great place for breakfast. Service is wonderful, diner atmosphere and menu. Vegan options. People are very friendly and eager to please. Old auto license plates on the wall type place. Vegan omelette or burritos with choice of many ingredients.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rcl6sdC9n_Z0gb8k7K7RrQ"
  },
  "NBl33h3mgkLOGbNGEHekiw": {
    "date": "12/10/2017",
    "text": "This place is so unique inside with such a comfortable friendly environment. Perfect for breakfast or lunch with friends or family. The food is great. Perfect options and choices.  The price of the food idea are inexpensive for the quality and amount of food you get.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XpAQEK9FAw0cd1SCWa4wnQ"
  },
  "qtu6yLC6Va6EFm96i_O01Q": {
    "date": "3/20/2017",
    "text": "Had a great (build your own) omelette.   Great friendly service with a smile.   looks like they did a little remodeling.   Nice cute little place. I'm going back later this week to try lunch",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RvK3O-b3RuSm_iytG-2dOg"
  },
  "THvsOD2scVcA9OyMkID84Q": {
    "date": "8/16/2015",
    "text": "DOWNTOWN GEM.  This restaurant is primed for launch...but still on the pad.  The portions are perfect leaving you with no guilt for eating all or no guilt in stopping half way.  It is set up as a social place where friendly conversation is buzzing...and you can actually hear each other (see my rants about The Montauk and Eggstacy).  Reasonably priced, good attention to flavors, perfect breakfast beverages.  But, the menu selection is thin and the decor is just not trying hard enough.  Melrose (essentially 7th Avenue between Indian School and Camel Back) is the next downtown Phoenix hipster infill area.  Phoenix has done a terrible job of slowing urban sprawl and reclaiming the core but the Melrose area is begging to be big, even if this is a late-to-party concept compared to other major cities.  Melrose has great access to light rail, huge lots with parking and an already established retro set of furniture stores to set the mood.  If the Melrose Kitchen gets you down to see the area, that's a bonus.  Our party was greeted with a very friendly staff.  Just parading into the restaurant, you get to tour the other tables' fare and it all looks inviting and delicious.  As we traditionally do at new-to-us restaurants, we ordered a smattering of recommended dishes and one that just sounds good.    The HUEVOS RANCHEROS was recommended...and seconded by surrounding patrons.  It deserves the praise.  A very spicy and flavor-rich red ranchero sauce topped perfectly executed eggs and non-soggy corn tortilla.  The secret star on the plate was the hash browns that were perfectly seasoned, scattered with nests of crispy bites and pleasantly not greasy.  The BUTTERMILK PANCAKES & BANANA/ALMOND PANCAKES were light and deep with buttermilk scent.  They were served hot and fluffy.  It is hard to brag about pancakes because it's hard to mess them up but this place manages to execute perfectly, thus making them notable.  My favorites were any and every bite with their house-made sausage gravy.  The BISCUITS & GRAVEY I saw at other tables and noted nothing but happy faces.  I personally opted for the COUNTRY FRIED STEAK with hash browns and a pouched egg.  The steak was handled expertly, perfectly pounded free of the tough sections and then battered with a savory spice.  Dipped into the egg yolk as recommended by our waitress made every bite better than the next.    The surprise beyond the meals was the drink.  The coffee is nutty, rich and hot and the milk-based smoothies (they also offer soy milk, almond milk and OJ based) tasted like an old fashioned mall rat Orange Julius, mmmmmmmmm!  Just eating breakfast today brought back flavor-based happy memories of arcades and movie hopping.  Critiques?  There are a few but all could be remedied in a single day.  The decor is off to a good start with nostalgic old-timey posters but the white painted bead board and ceiling lattice are reminiscent of restaurants opened by 1st generation immigrants struggling to stay afloat because the extended family is the only customer base.  This is a hip area so the decor should catch up.  I loved that every plate in the joint is different.  They should carry that shabby sheik feel onto the flat ware, glasses, chairs and tables.  Up the lighting with a really eye-catching central light fixture made of anything repurposed.  Remove the distractions of the walls in favor or some reclaimed pallet wood and those great posters.  Lastly, build on the menu.  The base is strong so create a few more offerings upon that spectacular ranchero sauce and sausage gravy.  How about a House smothered burrito and chicken fries with waffle bites?  Add a few GF options and highlight vegan fare and the hipsters too will wanna eat here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f2fARVF59BhR0FbWO8nrXw"
  },
  "mtr2l73ZomeKXaJPEwwYCQ": {
    "date": "1/14/2017",
    "text": "I had the BLT & Navy Bean soup, excellent!  My buddy had a very good Philly's cheese steak. My other buddy enjoyed his huevos rancheros.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ErH1XY3N6eOcAvysz8W9Og"
  },
  "0bEFc84bM97xpOF3KdId3w": {
    "date": "7/19/2015",
    "text": "Very comfortable, welcoming neighborhood spot. Nothing particularly unique about the menu but the food is affordable and consistently quick and yummy.  The blueberry granola are the kind of pancakes that don't need syrup, bacon's crispy, hash browns are just right.  But the service is the best part.  A bunch of total sweethearts at Melrose Kitchen.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6A7m0q1kAbTx2BYNWtFjow"
  },
  "ZeiYzzL4vSkhhG9mQvU1mA": {
    "date": "1/7/2017",
    "text": "Thought we'd try this place but really disappointed. Serving sizes way small, expensive and food was horrible. Should have stuck with places we know. Staff is friendly and efficient.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ahAYBmEf0kBBE_OWCxMImg"
  },
  "gIvvdKCujHqcx7zUkDZG5Q": {
    "date": "4/23/2013",
    "text": "Somehow, I ended up in this stretch of Phoenix as I was searching for another place that i never found. It turned out to be a great mistake because I ended up finding a really great breakfast burrito. It was $6.99, but the best part of this item was the six choices of ingredients that you get and that doesn't include the three eggs and home fries that are automatically included. There were at least 6 meat choices and ten veggies, etc that could be selected. I went with ground beef, onions (green and white) and peppers and monterey jack and sour cream on the side. Red salsa is automatically included. The eggs and beef were well cooked and the burrito was rolled very tightly. Clearly, a top 5 breakfast burrito. All items are available to go, but you can eat outside also.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ro-_a8_1zvJ8JRE-p8WgTw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Inside the burro",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ro-_a8_1zvJ8JRE-p8WgTw/o.jpg"
      },
      {
        "img_id": "wal9RvrsmaP2QL6mg5tHpg",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Breakfast burrito",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wal9RvrsmaP2QL6mg5tHpg/o.jpg"
      }
    ],
    "user_id": "ELcQDlf69kb-ihJfxZyL0A"
  },
  "p-Zt_ppbYswScQ5ydjUEtw": {
    "date": "9/27/2015",
    "text": "Tried a new Sunday Brunch spot. We arrived before the 10am brunch rush. We were greeted as we entered the restaurant and were seated immediately. The food was delicious and reasonablely priced - 3 egg build your own omelette with six ingredients for $8.00. We both had the omelettes with bottomless coffee and a side of bacon (5 strips) for $25.00. The server was excellent and appropriately attentive without being a stalker. We will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WRPhl-kgKvyihnlMEYth3Q"
  },
  "nI1E8Ny3Q0B0TU-vX3OfTQ": {
    "date": "4/18/2015",
    "text": "I love coming here with my husband and our dog. The coffee always hits the spot when you're in the mood for a hot cup of joe. The patio is dog friendly! My only complaint is that the service is rough. The owner is great but I've noticed the turnover is high. That's the nature of the business but the newer staff has left us hanging for breakfast for almost 45 minutes. I ended up missing my class. It happens and sometimes people need some grace and that's why we come back for more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ygzPtkyH0mV1KfVynPE5Yg"
  },
  "P_jK-suISAP66LvOQkWMMQ": {
    "date": "6/15/2015",
    "text": "It was okay food. The service was slow ( they were short staffed) however the people were nice and apologetic about the slow service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvBCqNl04k4_8X0IQVu8Tg"
  },
  "tmjt3rM-1QEPVKAt-jt-5g": {
    "date": "2/20/2015",
    "text": "I have been wanting to try this place for sometime now. I live in the area and am huge on supporting the local businesses. A friend and I went here last Saturday after working out at LA Fitness. I ordered the omelette and you get FOUR ingredients to add to the omelette. Many places you only get two. It was a good size and had a wonderful flavor. The store front is very inviting and draws you in as it looks different than any of the others. When you walk in, it feels like a little cafe that has been there forever. The waitress are very friendly and help each other out. Since I started this review, I have been their since and still feel it gets five stars. If you like places that are local with a feel of home and not a commercial or corporate look and feel, this is the place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_tay0jo0W0QFOBmA1lX_Ew"
  },
  "06sU9BaklvMDnpgIuhMV1g": {
    "date": "8/6/2013",
    "text": "Went for brunch on a Tuesday, Restaurant was nearly empty, received friendly and fast service (server was the owner), and food was good. The ham, cheese, and tomato omelette was fluffy and fresh, and had good flavor. Hash browns were okay, a little too crispy for my taste, but tasted fresh. And my check was very reasonable - $10 with tip! \\  The restaurant still has a beach theme (looks as it did when it was Two Hippies) which is cute and restful. If the front lot is full, park around back or on a side street. Given the portion size and price, I would recommend this restaurant for a casual (and cheap) breakfast or brunch. I will be back (especially since the Melrose Kitchen is right down the street from my home)!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3-geL2NP_LXlsVBiNzwe7A"
  },
  "BnJUswxAQKHgz3pX8QvnTQ": {
    "date": "5/10/2015",
    "text": "We ordered for pick-up and the blueberry granola pancakes were tasty!  The omelette was also good because the eggs very fluffy and light.  We thought the breakfast burrito with sausage and potatoes was decent.  Overall it was a nice meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t_4l1-GSJYJ6IDFkgNhWmQ"
  },
  "aXgRbJP-ECDV_iYGGOq4Tg": {
    "date": "11/12/2014",
    "text": "I really wanted to like this place -- like, really. But it was only OK. The service was good, but the food was only so-so. The taste was a bit bland, and didn't seem as if they were using quality ingredients. I did like the decor and atmosphere, but it wouldn't hurt to pay attention to the room temperature: it was hot. I like sitting in a booth, but 'sticking' to the booth because of the sweat? Not so much... Still, I may try it again -- I don't like chain restaurants and any mom-and-pop place like this deserves a second chance. And hey, if you eat here and like it, don't forget to add the Yelp review, it's no fun to only hear from the unhappy haters...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "32ZVCO_BxQN4cLmUDPNGMQ"
  },
  "uEYmwgg0KlNkfXMHH9TYVw": {
    "date": "9/20/2015",
    "text": "We lucked out and found this spot while antique shopping. Extremely cozy. It wasn't too crowded at 1:30. It's just open until 3pm on Saturdays.   I had the vegetarian wrap with sweet potato fries and the desert pear lemonade. All excellent. The fries weren't seasoned but crunchy and delicious.   I'm definitely returning for French toast and other yummy items!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p2_JLwzs6mnrIsgwozTMdg"
  },
  "HQKndP8PQggKGL93dxBwGg": {
    "date": "3/21/2014",
    "text": "One of the things I love most about living in Phoenix is how much more alive its becoming. New business, communities coming together and putting money into infrastructure, its simply wonderful. And Melrose Kitchen and its surrounding area is a great example of that. My family and I ate here for breakfast and it was great food at a great price. I got the chicken and eggs and everything was cooked perfectly., The service was extremely nice as well. The owner was working on a new vegetable soup and insisted we try it, just wow! Some times taking your family out some place nice can be costly, but not here, I would defiantly recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yLt281iJiskFXU_WfGlKGg"
  },
  "MlLvsYiMC13t0LG1hIFVsA": {
    "date": "7/18/2016",
    "text": "The food and prices were great for a diner like this. I can't say I truly understood what was happening with the decor. Honestly giving this place 5-stars for the outside seating and more importantly, the playlist. Lot of strong classics, like \"Baby Come Back\" by Player--excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EusQYPzs8FQ57gUV81hNLQ"
  },
  "BqO3Qx2UO3MLyl2Qo8GSPw": {
    "date": "3/4/2015",
    "text": "The restaurant was quaint. The service was a little slow, in fact I would say somewhat humorous.  We sat there and watched the employees run around aimlessly, not accomplishing much of anything. I ordered another coke, they charge by the can, when she first brought our check.  So she took the check, adjusted the price, brought back the check.  It took about five minutes later to get my coke, which she had pulled out of the cooler and left on top of the counter. The food was great, it came out warm and made to order.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "70JG4IeNdZ7Ej7nfM54nUg"
  },
  "AlZQ6LQkPvkhagmWTR53Dw": {
    "date": "1/18/2014",
    "text": "Disappointing first visit. Yelp sounded great w cool setup. Great setting. Americana etc. but all food was mediocre (hash brown looked like it came scooped out of a can) and all of it was cold.  We came at 10 am yet they clearly left it out on server counter while we waited over 20 mins for our 3 dishes.   Overall maybe this is an exception but wanna be True to a review.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dZfbT7_fCYRgX8h-cNwkmQ"
  },
  "v95srV8yyY06JTSrF-fq3A": {
    "date": "1/18/2015",
    "text": "A truly home vibe. Super friendly service. Great prices and perfect portions. LOTSA breakfast variety. Killer homemade salsa was the icing on the cake for my biscuits n gravy. Family run and local. A big shoutout for this cafe/diner",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "26mgCs5zYAAMXpJi5StEeA"
  },
  "-fT5sQeLStDy9tqUCyg6hQ": {
    "date": "5/8/2014",
    "text": "Melrose kitchen is rad. It is no super-mega-fancy breakfast/ brunch spot with mimosa specials or anything like that, it is just a very humble, super affordable, cute as balls, cheeky joint with some great options on the menu. I rather enjoyed the coffee, the service and felt very welcome here. I even had some English buddies that stumbled in here while staying at my house and they had nothing but good things to say about it as well. I give it 5 stars for what it is. If I was looking at it from a pretentious point of view, maybe I would have a different opinion. Keep 'er up!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yrDeiCGzfTRZPrC36XLa4Q"
  },
  "Wh-EQN3awZfMf8a_5imV8A": {
    "date": "12/27/2013",
    "text": "Walked in on a Friday morning to eat breakfast for 4. Ordered build your own omelette, huevos rancheros, burger, and chicken and waffles. Reviews from the family were quite positive with top marks for the coffee and the fries. Overall pretty decent little spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2eJgg2Pvy70-WmAvmZb73Q"
  },
  "wevo-0LmWdweB30btCddSw": {
    "date": "9/4/2013",
    "text": "I was drawn to this cafe because of the fun exterior and the poster listing it as one of the best vintage cafes according to the New Times. Walked inside and it was cute. Ordered an ice tea and it came without a lemon and the tea was AWFUL. Ordered the basic Melrose Cheeseburger with fries. It came with no condiments. I got a package of mustard when I asked for it. The burger has tough and chewy. Just a cheap frozen burger with plenty of grease. I ate three fries and gave up. Awful food, awful service and not cheap... over $8 for something that was best not eaten. Sad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "Cjrq1LXaBfWOa9WXRlCXbA"
  },
  "pwUEdv9EyyuX4XsqpbCZUQ": {
    "date": "3/18/2018",
    "text": "My girlfriend and I were reading reviews for a good breakfast spot so we took a chance on this place because it was close to home.  Boy was this place a waste of time.  I was so looking forward to there breakfast but once we got seated and got coffee that was the last interaction we got from anyone working there.  We waited for 30 minutes and we just left but they still charged us for the coffee.  Bad experience and won't be coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KUz7yv5JFfg1aW2x2tvoLw"
  },
  "KjBJOUg-x6K-lZl5lqjKeA": {
    "date": "12/31/2017",
    "text": "We stumbled upon this restaurant on our way to the airport and couldn't have been happier to have done so. The restaurant is very quaint and cozy; the perfect local place. The food was delicious for our whole group from waffles, French toast, chicken fried steak, sausage, and eggs. It was all so good and was devoured. The service was great and the prices reasonable. I could come here a lot and just spend some quiet relaxing time during a meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sioI9U5-89GU93PnYnINuQ"
  },
  "KfDLr4Z3x3w7v84mEGuUZA": {
    "date": "12/21/2017",
    "text": "The food was very good. Like way better than I expected. They do dinner food right. The service was a bit slow. I had breakfast for lunch and it was fantastic. The bacon was crispy and the eggs were fluffy and flavorful. Hash browns were amazing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HxcGFvlCNKvXWPUzh2hdRA"
  },
  "ov7Ck_hEW5AF-BC-xtZ2sQ": {
    "date": "1/8/2017",
    "text": "My boyfriend had the blueberry and granola pancakes which were delicious. I had a modified croissant-wich and it was also great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UnWlFRCxnHFTZlBzMre9sQ",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UnWlFRCxnHFTZlBzMre9sQ/o.jpg"
      }
    ],
    "user_id": "RdAJvM9alc3keIj6Ia02Bg"
  },
  "779dYHZiyS7CdgGHe3gDhg": {
    "date": "6/20/2015",
    "text": "Like this place because they offer a Tofu Scramble, however I have got to say there is NO seasoning in the tofu. It is literally just mashed up and heated (you can still see the cube shape btw).  Disappointing how bland it is and on top of that they charge an additional 60 cents for something that's much cheaper than eggs and comes with no seasoning, ha just doesn't make sense.  I will most likely keep coming in since there are so few places where a vegan and non-vegan can enjoy breakfast together.  On the positive side this is an adorable cheaply put together little place. When the weather is nice go through the diner into the back and sit in the outer part, such a cute and warm set up. Cluttered but a very open, warm, and bright feeling without feeling the heat. This place is also located near many antique shops so its nice to come by if your in the mood for antique strolling :)  Braggs Factory Diner still killing the competition with Tofu Scramble, best I've had!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "At51QESilyTRRUW2L_Pwdw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Patio",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/At51QESilyTRRUW2L_Pwdw/o.jpg"
      },
      {
        "img_id": "YPEf-Xtl6p-d2_DIGRv2gQ",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Patio",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YPEf-Xtl6p-d2_DIGRv2gQ/o.jpg"
      }
    ],
    "user_id": "tBZzapeew9tHvSdjSPaOqQ"
  },
  "NVQcmHaqXKb1OWuJGagVPA": {
    "date": "11/15/2016",
    "text": "We were planning on having breakfast somewhere else, but there was a marathon going on that prevented us from getting there so I searched yelp and for Melrose Kitchen. What a cute, funky, eclectic place, We sat out on the patio because the weather was simply gorgeous.   There were seven of us and I am pretty sure we all ordered something different. Not a complaint could be made. The food was delicious! I had the Blueberry Granola Pancakes, yum, yum. Fresh blueberries, and so much food, I couldn't finish my plate.  Someone had the Banana Almond Pancakes, another the the Chicken Fried Steak and eggs. All were very good.   Next time in town, we will be stopping again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-K3d0--7Vf0M5RL-sfGCiA"
  },
  "Icdztrn1rFItQ4MdM5sKMQ": {
    "date": "9/17/2017",
    "text": "Great diner food and service. Fried okra, big waffle, iced coffee, and biscuits and gravy:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dEoStsB54bRKeYghmvwgHg",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Love the fried okra for breakfast!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dEoStsB54bRKeYghmvwgHg/o.jpg"
      }
    ],
    "user_id": "7KZhUr0i3K202Ux1-OGOhQ"
  },
  "HR9f4roeApuj50Yq96SGGQ": {
    "date": "10/18/2017",
    "text": "Awful place,dirty bad service.  Food over cooked, especially chicken. Breakfast & other items are not cooked well. they do not wear gloves. Place is hot & air not good. Friends I know will not go back.  If you are unhappy with review, Too bad, it is the truth, Correct the problems.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v7FPnMzdbl6J7U_8H1BWZA"
  },
  "PHv8qQwXlYxsZaBnSgc6XA": {
    "date": "5/18/2017",
    "text": "The food is simple, affordable, the place is clean, and the staff is really nice. There's also a gorgeous Secret Garden where you can sit outside in the backyard area while it's still tolerable out. Make sure you visit this Hidden Gem. Haha I love using travel cliches.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eNsAqVPVWDXyQgXEljfjoQ"
  },
  "JVsE3Y9Ff57UNcC_tlavZw": {
    "date": "6/12/2016",
    "text": "Staying the night in a part of Phoenix that we were not familiar with brought us to Melrose Kitchen and we're so glad we found it! Hubby was originally going for Chicken Fried steak and eggs but after we asked the waitress what she would recommend, she asked Hot or sweet. Hubby is all about spicy food so he ordered based on her recommendation and got the Huevos Rancheros.  He raved about them being so good the entire he was eating! I also was going to order based on recommendation(StuffedFrench Toast) but changed my mind and went with a build your own breakfast burrito- it was ok, very filling but nothing spectacular.   Coffee was decent and refills were plenty! We defiantly recommend this place for breakfast!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QI3m6RyyHDLnQPppXwvaGA"
  },
  "V-txQpK4gOR1zmtjZouy4A": {
    "date": "1/2/2015",
    "text": "Good quick breakfast or lunch in the \"hood\".  Dog patio friendly.  Attentive staff.   I would love to give five stars, but for two issues: hash browns are not served \"hot off the grill\" but lukewarm out of the steam table, and the tired seating causes some discomfort while enjoying an otherwise great breakfast.  Plus, (and is this only me?) the owners think their customers deserve only the cheapest flatware (forks so thin the tines don't align) with sharp, unpolished edges.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uQAbGPrayiI_bEgw335TtQ",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Jezebel recommends Melrose Kitchen.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uQAbGPrayiI_bEgw335TtQ/o.jpg"
      }
    ],
    "user_id": "xmXt7afvj-mgALs1EPwJfg"
  },
  "hYdpwpNHGLk8cMlV4a_-OA": {
    "date": "10/15/2017",
    "text": "Very cool, lots of character with Moms kitchen feel.  Service is awesome.  Great homemade food.  I had the Rellenos and they were awesome.  My friend had the Country Fried Breakfast and loved it.  Love these places where you can walk in, seat where you want and have a good home cooked meal.  The place is spotless clean.  If you love hometown restaurants this should be on your list.  Again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MPJuMnTcR01LVJ88vMZU8A"
  },
  "uLs7xbCBzRyN7-6BawMc0Q": {
    "date": "4/10/2016",
    "text": "This place is very hit or miss... I've been going here for a few years on and off and seen them switch from walk up to table service. The food has stayed consistently pretty good which keeps me giving it a chance, but the service is scattered and odd.   In general they have a seat yourself flow but sometimes that means you either have 3 servers trying to take your order or none.   Today I lost patience and decided to leave after I came in and say down and waited at least 5 full minutes to be acknowledged. Servers and kitchen staff were all over the not so crowded dining area but we're avoiding my area. The couple at the next table was also seemingly unsuccessfully to gain a server's attention.   I really hope they get some order to the chaos. The food deserves better to go with it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Yn5S7Yt9RFVq7G-ohx0aQ"
  },
  "TZGYjPSD-b9_QnaPA-MZVw": {
    "date": "8/17/2017",
    "text": "Love love love the food and kitschy atmosphere. Dog-friendly on the patio and people-friendly anywhere in the place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f5xNC_vsNmSIpIPDQ1BGEQ"
  },
  "daJVPRg9nmw_5oECx6cNVw": {
    "date": "12/31/2014",
    "text": "We went here with family to celebrate.  We had 10 guests and were seated outside, since there wasn't going to be room for our party inside.  Other than being a tad chilly on a December Saturday morning, it was ideal.  The restaurant has lots of kitschy decor like random themed restaurant decor meets, more specifically, 50s diner decor (oh, except for the hyper sexualized (aka objectify much?) devil pin-up girl in the boys bathroom - subliminal messaging?).  It makes for interesting wall gazing material.  The food...oh, the food...It's pretty decent diner food.  Not much more, not much less.  I had the tuna melt and it was pretty good, but not great.  The lemonades are freshly made from...powder, water and syrup?  The Desert Pear Lemonade tasted like a Jolly Rancher.  And that's why I wouldn't order it again.  Service was flexible and friendly.  We had a big party, they managed to answer our questions and bring us our food and always with a smile.  I'm pretty sure, however, that I ordered coleslaw but got French fries instead.  I didn't care enough then to mention it, but, if you do, you might wanna do that.  Overall, pretty average.  I wouldn't recommend it or go back, but if you like kitschy (damn, that's a lot of consonants in a row, I just realized...now we return to your normally scheduled programing) diners, then this is a great place for you.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4h6lorgiR2swM6VXNS1Rug"
  },
  "FNmve_qv5nZ_g-nLb-8MNQ": {
    "date": "2/5/2014",
    "text": "You get a complimentary coffee with a yelp check-in. Might as well take advantage. This offer actually helped bumped up their rating.  I ordered a vegetarian omelette with avocado, black olives and tomatoes. They also have vegan options, so you can substitute your eggs for tofu. This restaurant used to be two hippies, and it's now called Melrose Kitchen. I don't know if it's now under new management because they can now accept credit cards. Breakfast was decent, inexpensive and the service was good. I still do not like the decor, but at least it's not as cluttered as two Hippies, and they can now accept plastics. Much more convenient.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "NUkDQg7VDl34C6lisT0hrA",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NUkDQg7VDl34C6lisT0hrA/o.jpg"
      }
    ],
    "user_id": "nXMMoDzXRByQiWH9cf-FAQ"
  },
  "07pmPWwroYA7iAgy03IzbA": {
    "date": "3/24/2016",
    "text": "I'm usually a restaurant snob so many would be surprised that I eat here regularly AND give it 4 stars.  Here is why...its consistent! food is cooked fresh, staff is friendly, they will make substitutions. You can get breakfast until 3pm when they close or lunch. The owner is always there so he makes sure things are running well. There are a few waitresses on the slower side but still very nice. I usually do breakfast and am happy they have turkey sausage but I have also done lunch and done a panini or salad and both are solid. It's a diner so don't get beside yourself but you can get a solid meal meal that's tastes good and is cooked fresh and they don't rob you. I live in the Melrose neighborhood so I eat here at least once a week for breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0bzu2z06rqOCvwYxtGOe0A"
  },
  "GKdeqiIyFwgpS_XLQndQZw": {
    "date": "7/16/2017",
    "text": "The food was good and cheap but they don't have AC. Eating lunch at 107 degrees is miserable. Do not recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CNDt4sK9iAMLKu5zPhH6pQ"
  },
  "GU5bEN1aQ8lrQQpLbqEXiQ": {
    "date": "7/1/2017",
    "text": "Corned beef hash with a side of bacon was the single most perfectly executed classic American-style breakfast I've ever had. Everything was cooked and seasoned perfectly. Add to it an easy going vibe and this place gets my vote for favorite breakfast spot in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ycl3mhn04YeOXqcX3Hr2jQ"
  },
  "duEc6VkYgNRty7NetlKPSw": {
    "date": "1/1/2016",
    "text": "Average nothing to write home about. The back patio looked kind of fun. Old school diner. I did not care for the coffee too much. I might go back and try it again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dEk7mXM4npuDPmxrwPcEgQ"
  },
  "uK0yN2zBCuePXK-MvR-I7g": {
    "date": "9/16/2018",
    "text": "The food was good. Our waitress was really friendly and attentive. The atmosphere was relaxing and we did not feel rushed. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cc8CcUjY8TvCBnh7YZhXdw"
  },
  "ElpfClL2tnbE-RSIwjJTLg": {
    "date": "8/18/2018",
    "text": "We Stoped for the first time and we had their burgers they were delicious and big . We will return when in that area again .  The young waitress was also very nice good service .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tsIYfjjy4ds3ImlnJ1PHdw"
  },
  "B4P2hjJHqGvJT3qIXzLdoA": {
    "date": "8/5/2018",
    "text": "Stopped by here for the 1st time. Staff was friendly and quick. The food was great. I had breakfast and my daughter had a chili cheese dog. Both tasted delicious. We will try to make it back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UgFbhLM02_D8AHjlf5V0tg"
  },
  "z6wQ8XN64n4xHJNiQrclRw": {
    "date": "12/10/2017",
    "text": "I've never had a chicken friend stake I didn't like. That's my 'safety dish' and what I usually get at any diner that offers it. I've never had a chicken friend stake that has blown my taste buds away, but I've also never had one that I was repulsed by. This one wasn't any different than the others I've had and I would recommend it to anyone who loves meat for breakfast. The gravy was very savory, but I also felt like it might be too salty at, however I love salt so I didn't mind it too much.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "JEEYFXLbKy-KpbTT-BHb6A"
  },
  "YSAHfF8rCSQQBzGKHZuwaQ": {
    "date": "1/21/2018",
    "text": "I love Melrose Kitchen!  I recently moved to the neighborhood and this has easily become my favorite spot in the area. The food is always good , and the environment is pleasingly eclectic.   The mix of off beat decor easily mirrors the mixed group of patrons. From gays (me), to older married couples, to travelers from all over this restaurant mixes all well.   The food is diner fare so don't expect a 5 course meal, but it's fresh and tasty and they have a wide array of options.  I definitely recommend this restaurant to anyone in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-72NDWDZKB4GInwfxpLvoQ"
  },
  "D26asrW_sgKtKXggFnwP1A": {
    "date": "7/4/2018",
    "text": "1st time trying this place out. We ordered our food to go. It was 12 pm but still in the mood for breakfast so looked online and found this place. Decided to try it out, best decision for breakfast loved it! I had huevos rancheros  my husband tried the fried chicken and the kids loved the pancakes they said they where extra fluffy  We will definitely be stopping by to eat in next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yPiDrDFl6Da5MaXaWV1SGg"
  },
  "wA6xUHlRFjNPRtJd27ZlcQ": {
    "date": "6/16/2018",
    "text": "Has the mom and pop feel. The food is great and delicious. The prices are very reasonable. I will definitely return. My only reason for the 4 stars instead of 5 would be the coffee wasn't very good and the AC didn't feel like it was working. Not sure if the AC was just down or what but that's a must in AZ.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l1oNKe2pPQYJcIFr5N-99A"
  },
  "ojBrVilpx11KNUWUaDtKNw": {
    "date": "5/31/2018",
    "text": "Wonderful breakfast lunch joint in the Melrose district.  Decor is reminiscent of an antique,  curio shop. Fast and friendly service with moderately priced and tasty food.  Definitely coming back more often.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DX9jL3IGkIaLRSkArM3Daw"
  },
  "hJSsvj5NiNivfoUd0l8lMQ": {
    "date": "1/30/2018",
    "text": "THis is my favorite go-to spot for late weekend breakfast. It's relatively simple and basic menu isn't full of frills, but basic necessities at a fair price. I'm particularly fond of the rear patio...it reminds me of if someone's grandma had robbed a cemetery the day after Memorial Day...Full of fake flowers, color and a whimsical, gaudy sort of charm that hits the spot every time. I can't even count how many friends I've brought to this quirky neighborhood nook. I want it to stay busy enough to stay in business, but not get blown out to the point that you have to wait to be seated like every other breakfast joint in the city. It's my happy medium and I hope it stays that way!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X33Q64gYKLBAepIjWofHBw"
  },
  "C5BYSkZmvnlQUTCXq8M2ZQ": {
    "date": "7/5/2016",
    "text": "Walking in the place was nice. There is a very cute seating area in the back. We decided we would enjoy the nice weather. I ordered ice coffee and the Chili Relleno lunch. It was not bad, rice and beans bland. Husband did not enjoy the Turkey, bacon, avocado panini. The Turkey was cold. He ate just a couple bites. The food took 30 minutes to arrive. We were not asked if he we needed anything, until later when the Manager brought the check. He then asked, if he liked the panini,  when he said \"no\" he just gave him an \"oh well look\".  Customer service  and food I give a C--.  I will pass on this place.      .",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C0B0_ZmlFOmJPGHDcP9sww",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/C0B0_ZmlFOmJPGHDcP9sww/o.jpg"
      }
    ],
    "user_id": "Tym5nsriCA83uftOIESXpw"
  },
  "0TgRRwS5UUCmXMzmnh863A": {
    "date": "2/25/2016",
    "text": "Hole on the wall kind of diner, but they have really good french toast here. Inexpensive and good quality food. The people here are so kind and sweet. Great customer service.  Play on the piano.haha. :D",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "D2ljL5ejuqpa4f8fnZ1qjw"
  },
  "-Svj6O_SlJRCOeWetkX2Eg": {
    "date": "12/5/2016",
    "text": "I felt like I was walking into a '90s movie where the crazy old lady next door with cat eye sunglasses asks you over for lemonade and you come into her house and you're like, \"Whoa.\" Because when you walk through, there's flamingoes, there's mosaic sinks, there's big umbrellas, and everything in between. Is it fascinating? A little bit, in a kitschy type of way, but then I started to feel claustrophobic. As for the food, I ordered standard diner food (eggs, sausage, biscuits, etc.) but didn't enjoy it that much because there wasn't much flavor to it. The hash browns especially were undercooked.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ks8B083lo7q-P33ZBCFMbg",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Flamingo fountain",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ks8B083lo7q-P33ZBCFMbg/o.jpg"
      },
      {
        "img_id": "OmvpHZUXc2dLE2hwZZJzkw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Ornate sink",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OmvpHZUXc2dLE2hwZZJzkw/o.jpg"
      },
      {
        "img_id": "IuGqkfqSZ1XjGtR8rilNrQ",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Bar decor",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IuGqkfqSZ1XjGtR8rilNrQ/o.jpg"
      }
    ],
    "user_id": "4ECIXWllFTxtJaj1cKOZWw"
  },
  "VziK7nYEeMts5wqQjeyJBQ": {
    "date": "12/29/2016",
    "text": "Came in with a girlfriend for brunch on Monday, was greeted promptly and seated. The restaurant was really cold, apparently they do not have a heater due to the age of the building but they did have a little heat lamp set up. I ordered the chicken fried steak and my friend built her own burrito. Our food came out pretty quickly and we both enjoyed our meals. I have had a very negative customer service experience here in the past so I was pleased that the service was friendly and prompt the entire time. They would earn an additional star if they got their liquor license and could offer mimosas with brunch.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gOYgSEbE-Z7cqGsgGW3LBg"
  },
  "SmOEvd2_I1Bz2rEGAUZJXQ": {
    "date": "5/22/2017",
    "text": "What a nice little neighborhood spot! It's cute and kitschy and very diner-like. The people were very nice and the service was quick. I had the tuna melt (excellent) with fries and tea. The fries were your standard crinkle-cuts and the tea was fine. Based on another reviewer I tried the hot salsa, and it too was very, very good and about a 6/10 on the heat scale.  It's too bad it took me so long to check this place out as we live nearby, but I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mMKQPNXMtBqDCP4ClMhdYQ"
  },
  "9ne7tp1qTpKUdotoidfsrg": {
    "date": "1/8/2017",
    "text": "I hit up this place for breakfast on my way out of town, found it on Yelp.   Comfortable small diner style with great comfort food, I had the blueberry pancakes with hash browns and eggs, twice the size of any breakfast I have had recently, for $13!  Including coffee.   Most of the people seemed like locals, it was very laid back and mostly quiet, a great place to read and enjoy a slow breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bs_FiiqQNyUg6Fh_WqyLyQ"
  },
  "1iwwGQcvMKQmfbNHIupfLg": {
    "date": "12/3/2016",
    "text": "We shop local and eat local, so we hoped Melrose would be a new home for us. We were thoroughly disappointed. We both ordered grilled cheese. My half sandwich had 1 piece of cheese cut in two triangles and two slices of tomato. The cheese was cold and not melted. One bite and I was done. Honestly, I was shocked. My husband ate more of his, but after each bite he grew more and more disappointed in the 7$ sandwich. We spoke to the manager and he could have cared less. I do not recommend this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hYd6Ev8EJppRyly0IVNqaw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hYd6Ev8EJppRyly0IVNqaw/o.jpg"
      }
    ],
    "user_id": "KHxO2f0AC-iRp0AaS3Bt2w"
  },
  "Y4S-ivakrYbU16MK6zeafQ": {
    "date": "7/30/2018",
    "text": "Great atmosphere, service, and breakfast. Stop by. You are apt to really dig it. Coffee is really good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uCsRdgoC8Fpw8aRkCWAXvA"
  },
  "nIAisq-NSlIAIwJ3HGpoyg": {
    "date": "12/4/2016",
    "text": "Thanks for having vegan tofu scramble as an option! For those patrons avoiding animal products melrose also has a veggie burger (a buck extra), veggie wrap, potatoe flautas, or spinach quesadillas. I got the burrito with tofu scramble (0.60 cents extra), egg plant (yes, sounds weird but it was good), green peppers, onion, jalapenos, avocado (0.75 cents extra, it's a tiny portion though...maybe not worth it), tomato, and black beans. A bit of a messy burrito since the bottom of the tortilla was so oily and it easily fell apart. The restaurant itself is decorated as your typical American traditional diner with a slightly musty smell...otherwise cute and cozy!  It's nice to be able to go to places like this since a lot of similar restaurants don't have meatless options. My husband got a tofu scramble (just not as a burrito or omelette to cut carbs) and said it was light, tasty, and a good portion size. Overall, recommend it if looking for a typical American diner with a vegan option!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B-r3d-c7L9ekun2bZ_honA",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Tofu scramble with hash browns",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B-r3d-c7L9ekun2bZ_honA/o.jpg"
      }
    ],
    "user_id": "DlkbXmez19iNaa9gYFtyng"
  },
  "RqoW6h4nS-ICIAOZmtn4uQ": {
    "date": "7/4/2017",
    "text": "Our favorite neighborhood spot... And every time we bring someone new, they're hooked too. The Huevos Rancheros are the best I've had in Phoenix, so I can't bring myself to order anything else. My husband usually gets a breakfast burrito or an omelette. The service is great, the atmosphere is relaxed and fun, and the food never disappoints. Every time we eat here, we end up talking about how happy we are that we live so close.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rWyq7Tw3JiJ76Chl1wvs4w",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Huevos Rancheros",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rWyq7Tw3JiJ76Chl1wvs4w/o.jpg"
      }
    ],
    "user_id": "2nqL5QPIQgLixLpGNQfuiw"
  },
  "0PhZZHIrdpkABEy1sUPiDQ": {
    "date": "1/6/2018",
    "text": "Food was good, service wasn't the best. The decor is eclectic and the outside garden seating is nice though! Will try it again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xkqTBHCcIYfFtBaFoAslcw"
  },
  "dPjCO48cC41ovsur-PCTeQ": {
    "date": "7/23/2019",
    "text": "Don't let the interesting decor stop you from sitting down for breakfast.  They have some very interesting breakfast items that aren't done in traditional fashion.    The banana walnut bread French Toast special was awesome!  Super moist with tons of good flavors.  We didn't even need to use our syrup.  You could even add two eggs and hashbrowns for a little more.  These were perfectly done and had the hash browns were unique in taste in a good way.  Great breakfast and will be back to try a burger!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2B9CPW4g8391oIxQk_ao8A",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Eggs and Hashbrowns",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2B9CPW4g8391oIxQk_ao8A/o.jpg"
      },
      {
        "img_id": "hM2KX7UxLKIkcLxHz8rFyg",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Banana Walnut Bread French Toast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hM2KX7UxLKIkcLxHz8rFyg/o.jpg"
      }
    ],
    "user_id": "qb7VkmiG_OtOclL6-FRN1w"
  },
  "4MEggysZaunDT_ps3klE6Q": {
    "date": "8/30/2019",
    "text": "Not fancy, but fast, friendly service. And the food is good too, haha. I had the turkey sausage and eggs, and it came with toast and hashbrowns. Definitely filling.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lRoxsADRRw35oQnPqZ7y4A"
  },
  "Zhyh0m5vz0TJVKc2oTzWMA": {
    "date": "1/26/2019",
    "text": "Went to this small little restaurant today and it was soooo cute! Perfect spot for dining on a patio as well! Walls are filled with classic pictures and an old school vibe! Serving breakfast and lunch with daily specials!   We had the chicken fried steak and the cinnamon raisin French toast! The service was great and we were greeted right away!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "P0Ursm0kypjpvEGZxLRutA",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Cinnamon raisin French toast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P0Ursm0kypjpvEGZxLRutA/o.jpg"
      },
      {
        "img_id": "vx8Fc8-xSVNp264zJs-FLg",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vx8Fc8-xSVNp264zJs-FLg/o.jpg"
      },
      {
        "img_id": "GV2J8CtpVIc3uim2U9LQtw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GV2J8CtpVIc3uim2U9LQtw/o.jpg"
      }
    ],
    "user_id": "hepDRPYyOhqezmohbELbpA"
  },
  "_Z4bSeuLrshHLHyTA0JPEg": {
    "date": "1/11/2019",
    "text": "What a gem  As the old adage goes \"Breakfast is the most important meal of the day\". I have to admit, Breakfast is my favoite meal of the day regardless of what time it is.  Today was my first visit to Melrose Kitchen. The folks at Melrose Kitchen are cooking up breakfast right. Melrose Kitchen offers creative  unique entree's and old time favorites, and you can substitute or add on to any entree selection.  On my first visit I ordered am omelette with 6 ingredients , hashbrowns, and a side of fruit, all were delicious. In addition, to great food Melrose has great customer servicr. Melrosr has an old diner feel with great music. The servers are friendly and seem really concerned that you enjoy your  meal and leave happy and full.  So if your ever in the area, stop by Melrose Kitchen, you won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 15,
      "cool": 11
    },
    "photos": [],
    "user_id": "MMf0LhEk5tGa1LvN7zcDnA"
  },
  "AO86RQ73h1cxvufPiRKehA": {
    "date": "8/16/2019",
    "text": "I love this place! I get the chorizo con huevos and it's delicious! I love how well I'm treated every time I'm here and it has a mellow vibe to it. Perfect for family dinning, date night, or solo. I recommend this place!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YRopbvFH0eF_4P9VRYZ-Xg"
  },
  "KADFuhqFwLrjP2ZPch5EEw": {
    "date": "2/10/2019",
    "text": "On my second visit the owner Called me bye name. This one kind gesture sealed the deal I will be a customer for life. He says Hi Adam every single time. The food is comfortable. The Build your own burrito is usually my go to but when I've been drinking the night before Huevos Rancheros are what the doctor ordered. When you want to add a comfy homestyle  cafe to your rotation this is a great place not to mention the prices are so fair",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jzf314Ox3KGIkrY5t2hFNw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Huevos Rancheros",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jzf314Ox3KGIkrY5t2hFNw/o.jpg"
      }
    ],
    "user_id": "nJ7UQsA-jwr5ez50ceeO_A"
  },
  "8BhND2QKC4eouvVKGPS21g": {
    "date": "8/8/2018",
    "text": "Consistency is key and this place has it nailed.  It's so awesome to go here and always have good food.  The other diner in the neighborhood isn't that way at all.   All of the Mexican breakfast are super good with the jeovous rancheros is so yummy. The beans are creamy and the salsa taste yummy. The pancakes are fluffy. The bacon is crisp and good. Even the sandwiches are fantastic.   Melrose kitchen rocks check it out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9qCsgl81_CMsnMuc67hqg"
  },
  "3WFimmO9gnog6iDSTs9qmw": {
    "date": "3/27/2019",
    "text": "It was honestly an okay place with the right attitude. Don't set your hopes high as far as food wise I didn't think it was astounding and it wasn't bad either. Kind of like the movie Cars 3 it was just okay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Qa4NR9xsXDGO1XLPYCsOEw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Horchata 2/10 recommended if you like water with minimal flavor",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Qa4NR9xsXDGO1XLPYCsOEw/o.jpg"
      },
      {
        "img_id": "NJLSB1MwLQVdAP8fCme8rQ",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Lemonade 4/10 recommend",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NJLSB1MwLQVdAP8fCme8rQ/o.jpg"
      },
      {
        "img_id": "DTuwnIItCn9Yx6CVGGO6Gw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DTuwnIItCn9Yx6CVGGO6Gw/o.jpg"
      }
    ],
    "user_id": "p8ubqPUxxyIb7XarTLe_rg"
  },
  "8Ft3x9PXs8PmC9cR_ryX7A": {
    "date": "4/4/2018",
    "text": "Very sad I used to go to Melrose kitchen quite often cuz they had really good waffles and chilaquiles we're fire but things have changed now they're food just mediocre apparently they got and they're cooked hopefully things get better I guess I'll try them in a few months",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8QzXdF51mPIAp3aNMkD21g",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Chilaquiles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8QzXdF51mPIAp3aNMkD21g/o.jpg"
      }
    ],
    "user_id": "kbfpED-6FURIsNlsAXqc2g"
  },
  "G3GKhcZw11UBysPGC83Iaw": {
    "date": "12/26/2018",
    "text": "The chilaquiles were amazing some of the best I've had! The eggs were on the side, not mixed, a little different but the taste will blow your mind!!! The Greek salad with grilled chicken was very good.  Great service and environment, definitely worth a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eBKGegM7gTy5DngPHu9wZg"
  },
  "8n4z03TTTqZRlW0da7M8Dw": {
    "date": "4/21/2018",
    "text": "Don't go an hour before closing, at least that was my experience. We walked in and they were putting chairs on the tables so we asked if they were open and they were, for another hour. So we sat down and the waitress did come by quickly with menus and asking for our drink order.   I ordered the French toast with eggs and hash browns (this was an add on to the French toast). The French toast was a bit burnt on the edges and it seemed the bread may have been stale or they simply cooked the French toast too long. Either way it wasn't good, edible but not a pleasant experience. The syrup too had very little taste which didn't help the French toast at all.  The eggs were cooked perfectly however and the hash browns were ok.  We also ordered a cheeseburger which was good and we added my eggs to that giving it a good taste.  We also ordered onion rings at an upcharge and they were ok. They are larger onion rings so you only get a few.  Our waitress never came to ask for drink refills and once we were finished with our meal someone else can by to refill my tea.  Parking is ok if they aren't busy because they are located in a strip mall. It seems like a cute enough place with possibly seating in the back, maybe a patio area? They kept us up front though due to them closing (I think) and they were pretty much mopping and cleaning around us.  Prices are ok but it seems their add ons are a bit higher priced so watch what you add because it will increase your bill. For our meal it was $26 (without tax and tip).  Probably won't come again but if I do it will be earlier in the day for, hopefully, better service and food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eIsGqezWEmzvAI3kYD8F6A"
  },
  "L0zzAiWXEuQ6th00uIX_Qw": {
    "date": "1/19/2019",
    "text": "Pretty disappointing food. My waffle was a tad over cooked and super dry. Bacon was so dry and brittle we didn't bother eating it. The only tea they had was Lipton. Two tables near us received the wrong orders. Overall bad diner food with a staff that didn't seem to want to be there.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_Q7G4Soz5IcdjN18xBpjRw"
  },
  "xdeF2kJHnUJsyOdurr2NGA": {
    "date": "2/17/2019",
    "text": "I live in the hood. This was my first time at MK. I order the ushe- pancakes eggs & bacon. I am a pancake expert of sorts. These pancakes were made from a just add water mix. If you are looking for good pancakes, go to joes just north of here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zm0m49QSqi9augxFVIp9dw"
  },
  "fxmzypKqrUsBA1butFiNlA": {
    "date": "4/7/2017",
    "text": "The decor in this place .. kitsch .. a mix of 90s, license plates, coffee mugs, flowers, diner .. lots to see for sure .. i love it!   I was in for breakfast .. my coffee arrived quickly in the cutest mug.. like one I'd own! My food was delish .. the hash browns were cooked just right (I hate places that leave them raw in the middle)..  Every person on staff stopped at my table to see if I needed anything.. I love that !! I will definitely be back when I'm in this neighborhood.  Another diner paid for my coffee .. SWEET !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "V6Z6cvXREt9HRDLlUqUC1w",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Coffee time",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/V6Z6cvXREt9HRDLlUqUC1w/o.jpg"
      },
      {
        "img_id": "AMFvHW7yLVXSN8oIsnYunQ",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Eclectic decor",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AMFvHW7yLVXSN8oIsnYunQ/o.jpg"
      },
      {
        "img_id": "torngIEfwTx1NxgKJsI0xA",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Breakfast .. with a side of ham!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/torngIEfwTx1NxgKJsI0xA/o.jpg"
      }
    ],
    "user_id": "BpJygDyhzDf7Pw1Is_5zSA"
  },
  "4xeInwuSRuV68ex-mPVNyA": {
    "date": "1/24/2019",
    "text": "I brought my family here for the first time and we check the menu. The food was OK I ordered a supreme nacho , and parents ordered chilaquiles and enchiladas and daughter got a chicken and fries .. every thing that we got was just no . I don't want to comeback .. I would only go back for the chilaquiles it was spicy . Rice was good beans didn't taste well . Service was slow . I felt invisible there idk if my waitress had other task but they took awhile to get a refill . And for the nachos really bland I got the ground beef . Really stingy on the sour cream .. i will give them a chance but not sure ... atmosphere was okay . I will say theirs hot chocolate was on point that day .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWYSYLX2pLaOOMyNSuwGyQ"
  },
  "Sa-W7JUyAp52ZKnQueFZkw": {
    "date": "12/17/2017",
    "text": "We had brunch here at the Melrose Kitchen today. It was a darling little diner and super clean. A locals restaurant for sure. That made me very happy. All the employees were polite and nice. They accommodated one member of Our parties food allergy with no proble m at all. I appreciated that. Our food came out pretty quick and cooked to order.  The food was good, but nothing over the top great. We will definitely come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tZz_tbuz3UcbvVgY1UVs1w",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tZz_tbuz3UcbvVgY1UVs1w/o.jpg"
      },
      {
        "img_id": "SoN4QZ-9Pj_CvdKgIKj-Tw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SoN4QZ-9Pj_CvdKgIKj-Tw/o.jpg"
      }
    ],
    "user_id": "KxKEdUEaKThdl0ieDEkS-w"
  },
  "FewMyDs6drErbQ4-AawucA": {
    "date": "5/20/2018",
    "text": "This place is off the beaten path and perfect for a quiet breakfast date or even coffee by yourself with a book. I sat on the back patio next to a fountain and read my book and drank coffee until my delicious breakfast was served. It is incredibly quiet and peaceful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QV03HqYMJEnjzNZ7sdPBQA",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Service was quick and my order was perfect AND delicious!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QV03HqYMJEnjzNZ7sdPBQA/o.jpg"
      },
      {
        "img_id": "v4K-MzE5ws7P-hleMOyKnA",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. My coffee was served fast and hot in a beautiful ceramic cup that kept it hot.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v4K-MzE5ws7P-hleMOyKnA/o.jpg"
      },
      {
        "img_id": "vjCP5Jr6LGAfFUCBnbaP1Q",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vjCP5Jr6LGAfFUCBnbaP1Q/o.jpg"
      }
    ],
    "user_id": "pQ-GZh7Wb2jpq6iSDTaNaw"
  },
  "1OYPywO1iQT7AsVvR8FrCA": {
    "date": "7/17/2018",
    "text": "Placed my first takeout order through yelp here and I'm glad I called before I went as they hadn't seen the order yet.  I must say I do love the look and feel of the place, I'll have to find some time to dine-in. I ordered a Chicken Caesar Salad and it was ok.  I'm still on the fence on if I liked the chicken and I definitely needed more dressing.  The toasted cheese bread was amazing, I could eat that all day.   Overall, it was just a salad and when doing takeout on that, it's tough anywhere you go.  I look forward to going back and trying something different.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DYV1AW5FkAFj1b4jTvhJ2A"
  },
  "MBz19apktl_Bfy-dLmWHwA": {
    "date": "5/24/2019",
    "text": "Very good food. Quick service. Quiet place. Reasonably priced. Excellent service. 10/10",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QZ_6S9H-On-DWdtrUgAbPg"
  },
  "Dy0TxKuxyTAXIQOm4TX-wQ": {
    "date": "1/17/2019",
    "text": "I like going here... it's pretty laid back spot if you wanna have a nice breakfast, very mellow setting and the food is nothing to brag about but the atmosphere is really cool... overall I enjoy this place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cWflHyUWTnY8unhkkHdvQw"
  },
  "N8yB_qOSha74HekON8eyVw": {
    "date": "9/25/2013",
    "text": "Came in for breakfast with my daughter. Great friendly service, good food, affordable prices. We will return again. And they deliver! Fantastic deal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pwbIdCN9eMGgCKeQLIfyfw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pwbIdCN9eMGgCKeQLIfyfw/o.jpg"
      }
    ],
    "user_id": "finyopFGDk-PdQzDhTs8bQ"
  },
  "_k3kYvn5qq2thOpTcruyxQ": {
    "date": "3/26/2015",
    "text": "Finally! Legit huevos rancheros! Service, quick and fast. Sit on the patio! Loved the ambiance. Some music on the patio would be nice. Easy parking. Will definitely come again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-8KsJs0YuMbtBidxX_XcfA"
  },
  "JsLoGUERBwg7oeWotS-SXw": {
    "date": "6/27/2015",
    "text": "The food here is okay. I didn't care for it initially but during the last visit it seemed better. It's a good place for a quick diner-style breakfast.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FI9Zs_lHVggKdQiFKldFBA"
  },
  "izLb40GBz4-5Z2R1LVcu8A": {
    "date": "6/21/2015",
    "text": "Found this place driving around today looking for a non-crowded breakfast joint. EXTREMELY happy we found it! Service was very attentive, coffee cups always full. It was a cute and cozy place. My boyfriend had the huevos rancheros and the eggs were perfectly over easy. I had the stuffed french toast, which was equally wonderful. But what we both couldn't stop talking about were the hashbrowns! Something so simple, yet messed up so easily by other restaurants, Melrose Kitchen has perfected them. Definitely will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qmRrtxdFWww3FxqKIN7VBA"
  },
  "_LJ4bg9qysg9yUHHXc9DqQ": {
    "date": "5/26/2015",
    "text": "loved this place! stopped by yesterday  since we wanted something close to us and we were so pleased with the customer service and the Huevos Rancheros! it's actually quite cute inside and out and they were so friendly!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PV0Xnz5-OSebDrNsvt7mBQ"
  },
  "NAxRO1qSj5rSQB40odYfsQ": {
    "date": "5/25/2014",
    "text": "Used to love this place and we were regulars, I left a 5 star review when it was two hippies. This morning was an entirely different experience. We started off sitting down and waiting for someone to take our order for far too long. With only two other tables full who had already ordered food I expected to be attended to without too much of a wait. After talking for a while and killing time on our phones we realized we had been sitting there for at least 15 min. Considering we were the only ones there to order we were a little irritated and decided to take our business elsewhere, just as we stood up to go the waitress headed over so we sat back down. She didn't apologize for the wait only stood there with a dead stare while picking at a pimple on her face. So we ordered. A few minutes later she came back to inform me that no turkey was available to put on my omelet. She suggested turkey sausage and I reluctantly said ok. The food came and the saugage was spicey as hell and ruined the omelet but I powered through it with the attitude of ; lesson learned, don't order the turkey sausage. Then the bill came and I was charged $1.00 extra for the sausage that was offered as a replacement that I didn't even want in the first place. I figured it must have been a mistake so I went to the register to explain. They said sorry it's extra. The face picking waitress then said \" uh.. I thought I told you it was extra\" I said no you didn't and it wasn't even what I wanted. The dollar was purely a matter of principal alone since it wasn't what I wanted and I wasn't told it would be a dollar extra. They stuck to their guns for one friggin dollar! I tossed them a bill to cover the breakfast plus a tip for the dead eyed face picker and assured them I am done with this place. Not a way to assure return clientele. I guess the low occupancy should have been a clue that things had changed for the worse. Used to always be a line before the makeover.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DpIhfFHCx2WhtSuTDDsGCw"
  },
  "BdimlAMwLVRDBFBbfNgp8A": {
    "date": "3/18/2015",
    "text": "Upon arriving, we were greeted by a 'HELP WANTED' sign and a very crazy scene of waiters and waitresses rushing all over the place. One managed to pause in this insanity to ask us where we would like to sit. I told him (since we had a dog with us) outside on the back patio. He told us to wait a moment to check if there was any availability and rushed back to check. I stood and watched him walk back towards me, only this time he made no eye contact and proceeded to walk right by me as if we did not engage in any sort of prior conversation. So we waited...and waited...and waited until I finally went to the back patio to see if there was any seating, which I did not find. Upon coming back up to the front, a woman (who I thought worked there) approached me and told me that we were supposed to \"seat ourselves\". I looked a little bewildered but then another host came up and told us to wait and we would get seated. We went back outside to the front where there was a lot of bar type seating (not particularly comfortable for a party of 4 with a dog) and waited. My husband's cousin/owner of the dog went inside to remind them that we were out there and she came back saying they would get us set up soon but would bring us water and coffee while we waited. 15 minutes later, no water or coffee. The second host who spoke to us finally came out and escorted us to the back patio to be seated. Upon sitting down, I happened to look over and see the lady that I thought worked there was actually a patron. I don't know why she told me what she did about seating ourselves but I feel like she should have minded her own business. As we sat and got our waters, we perused the menu, which had a good assortment of food to choose from and since we had walked 15 minutes to the place in the warm weather and had not eaten yet for the day, we were quite hungry and thirsty. So we waited again...and waited...and waited for 15 more minutes. We were constantly being passed by multiple waiters/waitresses who were helping the other people around us and assisting their needs but I think they either forgot to staff someone on our table or just got distracted. I also happened to notice a couple who were seated before us and were in the same boat as nobody was asking them if they would like to order anything so they eventually gave up and just left! I was considering doing this as well, but I was too hungry and hot to even consider finding another place for brunch, so I stayed put. The original host who seated us ended up taking our order finally. I got the turkey/bacon/avocado panini with a side of fries. I thought it was very good but something I could easily make at home. It didn't wow me necessarily, and especially since I paid $10 (after tax) I expected a little bit more out of it. After our food arrived, things seemed to slow down a bit and the waiters paid attention a bit more. I just say overall I don't know if I will come back here and if I do, it will not be at a crazy time of day when everyone else comes. I can definitely see why they have the 'HELP WANTED' sign, but I think they need to do some house cleaning on the service end before they hire on someone else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-CkQLJu09vfonLj50PfPYQ"
  },
  "sGisS8Nnxh-Us0eK4WdrDw": {
    "date": "7/15/2014",
    "text": "My partner and I have come here a few times. We live nearby and enjoy the neighborhood. We love the atmosphere of the restaurant. It has a very unique and local feel. Our food was okay and the prices were not bad. Unfortunately the service was pretty poor and disorganized. It took our waiter about 20 minutes bring us water. During the meal multiple times he forgot things we asked of him. Overall, we probably won't return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Crv4SZVjGmznxWzT5QPJDA"
  },
  "gnM1U2ctYVpUC-6dUomkgA": {
    "date": "10/6/2014",
    "text": "maybe i should have gave 3 star, but the gravy was really good. too bad it was so sparse as in not much on my Chicken fried steak  or the wife 1/2 order of biscuits and not enough gravy , the hash browns are over cooked my sourdough toast was not toasted was warm though so someone tried to toast it  and the eggs over medium was perfect  (the restaurant was clean the staff nice /clean, teeth brushed, hair combed, smelling good. left a 2.50 tip for a 20. take out order too cheep?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pmN2PQwqTRKomaTTTsonPg"
  },
  "t81oPgEssFqmwDzOKhQKrA": {
    "date": "4/4/2014",
    "text": "Had the huevos rancheros, they were good needed more sauce, but the server was friendly and fast, strong coffee",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eKv1V0Ts6ZQXD3t7Et4K5Q"
  },
  "__0PpIOWdiB5VG5NiHvQtQ": {
    "date": "4/15/2014",
    "text": "I wonder what all the negative reviews are about. if you are looking for the brunch at the Phoenician, this is not it. If you are looking for standard diner food, still not it. If you are looking for a family owned restaurant that will do anything to make your meal a memorable one, stop looking. Chai does a great job of making you welcome and serving you above average meals for below average pricing. He is a great host and is  working harder than most 4 star restaurants in making you meal enjoyable. Give it a try. It is like McAlpine's on steroids.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v9Khb1BFBjHUQiy2KH3cAA"
  },
  "eNk78fqhaHOOpyofsr3kTA": {
    "date": "5/24/2014",
    "text": "We were looking for somewhere different but close to us to go for breakfast this morning and decided to let Yelp pick it for us.  I agree with Tabitha's review in saying that I have lived in this area for nearly 3 years and had no idea Melrose Kitchen even existed.  We tried it today and will definitely be going back!  The place is adorable eclectic, the staff were great and the food was fantastic!  Ha!  We all but ;licked our plates clean.  Totally decent prices, the orange juice was SO GOOD, and the food came quickly.  Absolutely going to be one of my favorite new places!  Thanks Yelp. BTW we got the stuffed French Toast and Chicken Fried steak and eggs, both SUPER YUMMY!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qhX_x6jV_fVohXzIyvEZmQ"
  },
  "Y3Fm0mKfwy8VRyewkqoY6w": {
    "date": "6/1/2014",
    "text": "My husband & I are breakfast snobs and we loved this place! It is so charming and the Huevos Rancheros are amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FK3g2tguRq0Bqd9yLJBIeA"
  },
  "Jr3aMgLPaKEusko1odNONg": {
    "date": "9/22/2013",
    "text": "Great food, fast service, and cheap prices. The french toast is perfect and it's only $3.49. The staff is very friendly--it's a great local spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OiDPTh4uAvgxvKUaBTWMNA"
  },
  "SZV8-VLzVTepoj28pk3QrQ": {
    "date": "4/23/2014",
    "text": "Best fancy grilled cheese in Phoenix and better service than any Fox-concept restaurant I have been lured into.  I actually felt good about tipping 25%.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ATNP3lNnpX53FgBqKDvpA"
  },
  "WXMK_If7HNg56iZbKnNXLw": {
    "date": "2/16/2014",
    "text": "The experience began with a warm smile from Raven our server. She was prompt at taking our order, though she seemed a little confused (perhaps because it was her third day). After a 25 min. wait one order came out. It was a bacon cheeseburger. The bacon was paper thin and half raw. The fries were well cooked and tasty. The next two orders took another 10 min. to arrive. My wife's garlic burger was sublime. a taste treat sensation! My over-medium eggs were hard boiled. The owner recognized this and offered to replace them. I reluctantly agreed because hypoglycemia was setting in. The new order came out within minutes and sadly. still overHARD! Additionally, I asked for home fries with fresh jalapenos, and got hash blondes with cold pickled peppers.(no i chose not to pick a peck). After the bill came the owner offered to remove the cost of my meal. Upon checking the check, he did not do so and when I told him he apologized and made the adjustment. Nice place ambiance wise and clean but discombobulated. If they don't get their act together, Melrose may not be the place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sNxgsSlhGKHGUmXvY8GGYg"
  },
  "abgOPYppKLTvOS3gfTY8cA": {
    "date": "12/21/2013",
    "text": "Food is what I'd expect from a diner, but the service is horrid.  Price \\value good",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PRqiotQwboNo1Mp1yfh5Dg"
  },
  "VOh3TOVmKofJ8cfAvl13mw": {
    "date": "3/27/2017",
    "text": "Really good neighborhood breakfast/lunch place. A build your own omelette for under 10 bucks.  It's everything a breakfast place needs to be in a comfortable atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EXYxgS72w0RsHUcKg_hTLQ"
  },
  "eE6x2ya6TMJ16ZTYS1l8Lg": {
    "date": "9/28/2014",
    "text": "Stopped here for breakfast this morning. I was very impressed. The service was prompt and attentive. I had an omelette (you get to choose up to 6! ingredients.) Nice fluffy omelette. Perhaps the best restaurant/diner coffee I have had in recent memory. Nice clean place. I will definitely return.  Today I returned. Just as good as before. A great neighborhood place. Comfortable, casual, great food. Come here if you are not in a hurry but just want a nice place to sit and relax while enjoying wonderful cuisine. Breakfast is my favorite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LtbvIBC2FIeckZOglYThXw"
  },
  "z4ElBP4L_a4lyYv0wJL3AA": {
    "date": "9/5/2015",
    "text": "Stumbled into this place while shopping for a new guitar for my son. In had their huevos rancheros w beans and rice, and it was homemade. Beans were natural not over spicey, rice was great. Ranchero was really good. Cool retro restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_6N60Qi5TA5XABccMxL2-g"
  },
  "YgNeaVRGQMM9E1gLZ3WV8g": {
    "date": "2/23/2015",
    "text": "The food is really delicious and the coffee is hot.  My party had the stuffed french toast, chicken strips, a cheesburger,  a chipotle chicken sandwich, onion rings and fries and it was all good. The staff is very friendly, the owner is very friendly as well, they even brought my mother a small bowl of beef stew that they had brewing to test out. The tables, floors and bathrooms are very clean.   The decor is kitschy and fun,  I noticed the mens restroom had a classic Betty Paige poster and over all it is a smorgasbord for they eyes. They also sell wrapped up cheesecake brownies in the front.   The tricky part about this restaurant is that it is in the Melrose neighborhood and a lot of places are thus named \"Melrose\" something, but it is on the left hand side of the street.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LPKvoLFvUE2RLMcZ9yQURg"
  },
  "-GYFI3sKsrJ1trEvBe-AyA": {
    "date": "11/21/2013",
    "text": "A perfect, and quirky, little breakfast diner. The eggs and hash browns were perfect.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ubJ5qFcUiY8EW9DSEljckA",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. Stopped in for coffee, ended up staying for breakfast.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ubJ5qFcUiY8EW9DSEljckA/o.jpg"
      }
    ],
    "user_id": "7HHlRnFqMACumKHTYmZapA"
  },
  "CRjkEHbI56U9EAcQy6NaEQ": {
    "date": "4/1/2014",
    "text": "For the food and the prices, this place gets FIVE STARS, hands down. KEEP THE COOK!  But the wait staff was scatterbrained, inattentive and slow. This was really a shame, because like I said, the food was DELICIOUS! However, we literally had to beg for more water, they were confused by our orders (which were right off the menu) and didn't check on us once.  For the VEGANS: They offer an awesome breakfast burrito with tofu scramble. My vegan friend was in heaven, because breakfast is normally not kind to vegans haha.  Overall, would come back here again for the food, not the service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NVF0tq_2lRSNelIvO7trjQ"
  },
  "Yv9mdq-Pup7ZeL0COujwRQ": {
    "date": "12/4/2016",
    "text": "A quaint, funky, \"bohemian\" breakfast joint in the Melrose area of Phoenix.  Great food and awesome vibe from this place. Will definitely be back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E4WyGnaTNYrT_6n06_Fn-Q"
  },
  "JA1x4XzR8rhR6_A2TGSegg": {
    "date": "3/24/2013",
    "text": "I came in on a sick day for french toast. Not too busy, maybe 9am on a Thursday. It used to be 2 Hippies, and I even had their old menu when I got home, but it was still good. Nothing spectacular to write home about, but worth the trek out of the house and into the realworld, all hopped up on cough syrup. French toast was a little dry, and the syrup was obviously just incredibly generic, but it filled a empty place in my stomach and for 5.00 wasn't bad at all. Would go back for sure.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BYPoVl4gcyT5gKUOa3dZrQ",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BYPoVl4gcyT5gKUOa3dZrQ/o.jpg"
      },
      {
        "img_id": "0CO-9cah3GPjXKEQIf3nUw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0CO-9cah3GPjXKEQIf3nUw/o.jpg"
      }
    ],
    "user_id": "alv_EJkNj1dpMVlwPdmIjQ"
  },
  "af3CGdlpr8F2Auxd8xanDw": {
    "date": "12/3/2013",
    "text": "One of the few places that was open on Thanksgiving. The interior is quite colorful & eclectic, I liked that.   Pecan waffle, hash browns & orange juice. Food was okay, they were skimpy with the pecans. May return to try something else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9jA5_7o9V4m6i8ZRb4t6LA"
  },
  "U5Pp6V7Vj6I-wkajZUuxVA": {
    "date": "11/30/2015",
    "text": "I love this place! They greet you right as you walk in and make you feel welcome. It's very clean and who ever decorated did great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gdLN620BUeJSqG0B9ZsAoA"
  },
  "Ox5IqQpMig7sCpUkqlQBRQ": {
    "date": "2/1/2016",
    "text": "Incredibly friendly, eager-to-please owners, good home cookin, cute retro-kitschy atmosphere, affordable. Go there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ynCj6CCozpPSwAv8KzU1mw"
  },
  "FH0US_ssBduaplWXPsewSg": {
    "date": "1/28/2016",
    "text": "Decent food and friendly service. Sometimes it's a bit awkward trying to order food because of the counter placement. Many times once the food arrives you have to go back to the counter to request refills.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-nvQ5TJQvKzcwJ1F1oSqOg"
  },
  "_GlLNqvw85AC4l05P6pDwg": {
    "date": "2/7/2013",
    "text": "Drove here to find that Two Hippies Breakfast Joint has now become Melrose Kitchen! The decor is fairly different, but the menu and staff is pretty much the same. Glad to see the 6 ingredient custom burrito was still available.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XBTGIRBcVEh88MZB0Wo6PQ"
  },
  "NbvBB4dP3l4OpusnaIaYcw": {
    "date": "4/2/2017",
    "text": "Well, I don't know if the food is good or not. We went for breakfast/brunch this morning and were told to sit wherever we wanted. There were only a few people in the place - plenty of tables to choose from. We sat on the back patio and waited and waited and waited. We got no menu, no water, no coffee and certainly no food. We left and went somewhere else. Too bad because we need good breakfast spots in the neighborhood.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yce-sAHILuyAaQyHjg2r0Q"
  },
  "vI71WTcA3atc_2UGP9CoEw": {
    "date": "5/18/2015",
    "text": "Fun decor. The kids love the huge fish on the wall and I like the vintage bikes. Build your own Omelette is da bomb( do people still say \"da bomb\"?) . The lil Asian guy working the register and taking orders is good humoured and friendly.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7Bn1wPC0CPTdL49kbpQxiA"
  },
  "hhlmelcNRTdYz07cwX1itw": {
    "date": "7/19/2015",
    "text": "This has become my go to breakfast spot on the weekends. I discovered it when I made the mistake of venturing out the morning of Fathers Day trying to find a place that wasn't a 45 min wait. It was busy but I was still able to grab a spot. The menu is simple diner food, but in my opinion steps above Joes Diner up the street in terms of quality and taste. The service has always been great for me! The diner itself is fun and cute and a great way to meet neighborhood locals.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMabWPEZJMtEkQ6EQu6RDw"
  },
  "7vBgtenIy5v8DE3aQ2fxKQ": {
    "date": "4/17/2013",
    "text": "Wonderful service, very friendly and attentive, and the food was great too! I know for some of the old Two Hippies fans it may not be exactly the same, but I really like the atmosphere and think the new ownership is doing great things.   Go for huevos rancheros!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qO5QUhK2siDzIVDJMsZKnA"
  },
  "5B-txuh3ISfCcx756Hq6rA": {
    "date": "9/25/2015",
    "text": "I was so excited to try this place for lunch as my office is nearby.  Three of us ordered from the lunch menu and three of us were left disappointed.  The food has a processed taste.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FaYedQWklmzCC6RqJa791g"
  },
  "jJZ3Z2SrmLNBhbgSnulGTw": {
    "date": "3/1/2015",
    "text": "One star because the food was good...once we actually got it. I understand being busy on a Sunday morning, but we waited almost an hour for our food. This probably wouldn't have seemed as bad had anyone actually come to check on us, apologize for the wait, ask if we needed a refill, ANYTHING. We didn't get check on once, and we were about to cancel our order and walk out right when our food showed up. About five minutes after that, another table stood up and left making sure the staff knew they would never be coming back. I'm definitely with them, NEVER coming back. Once we were finishing up, they were taking our plates as quickly as possible, and once we said we would take the check they finally had time to bring THAT to us quickly. Definitely made us feel rushed out the door. The worst service I have ever experienced, I regret that we even had to pay for our meal.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RK0zV4QfPo83R5blm9sQBw"
  },
  "2EglJqDmfbwTdNnCQIymXw": {
    "date": "2/22/2015",
    "text": "This was our first time here and unfortunately it will be our last. The service was poor, the servers were not very attentive. Our water glasses sat empty for the majority of the \"meal\" and it took forever for our orders to be taken. When the food finally arrived, it was cold and we never received our toast or fries. It was disappointing as we had high hopes. Maybe it was just an off day.....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ixIAaUV53-P4iEqj32G__w"
  },
  "P_pzU2_wMySAuu4hUTgrYg": {
    "date": "10/4/2015",
    "text": "Great service, simple menu, and good food. If you're looking for a low key breakfast joint, definitely give this place a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0EFgxJK81Z-9QYcoMkVOhA",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0EFgxJK81Z-9QYcoMkVOhA/o.jpg"
      }
    ],
    "user_id": "-ABiQUKbX11U8d6zdj9oSw"
  },
  "2V-qrVVfS0S4JoZrXyN3yA": {
    "date": "12/27/2013",
    "text": "I am writing about two different experiences.   The first time I ate here was about 5 months ago and it was a dine-in breakfast. It was pretty decent. Friendly service with good coffee and average diner food.   The second time I ate here, boyfriend had picked up our order to go. My eggs were still slimey...and I had asked for them scrambled. I had ONE HALF piece of toast (couldn't manage to give me the other half I ordered) that wasn't buttered, and my hash browns were very cold. Nothing was seasoned. Boyfriend had similar issues with the salt and pepper shortage.   Essentially, if you want somewhere to sit down and get a decent meal, dine in, not out.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "QZfJ7UulkIQJR--4Bduj6g"
  },
  "ORFqd3Y_nMp3CBHHcpdb1w": {
    "date": "1/3/2016",
    "text": "Melrose kitchen is the perfect place to order the famous Huevos Rancheros. The corn tortillas are prepared light and not greasy. I have never had rancheros sauce as good as the sauce they serve. It's spicy and thin. Served with beans and hash browns. The portions were great for the price. The service was excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ro2fU0AScuS3io1eV8iWNg"
  },
  "ziLFoTRhG9OJlWhMKpBGjw": {
    "date": "10/28/2013",
    "text": "Wondered in here yesterday in search of delicious breakfast fare. Did I find it? I'd say so. I just moved to the Melrose District area and have been eager to try every breakfast place and visit all of the antique shops (but that's another story...). My boyfriend and I came here for brunch. I was immediately taken in by the super kitschy and cute decor and friendly wait staff.   I ordered Huevos Rancheros and my boyfriend ordered a 2 egg breakfast with a waffle. We both got coffee. Our food was delivered quite quickly and was super delicious. The Huevos Rancheros had the perfect amount of spiciness and I tried a bite of my boyfriend's waffle-fluffy and light. The food was fresh and tasty.   The prices are ridiculously inexpensive and the portions are quite large despite that. I've grown used to paying a pretty penny at Old Town brunch places so this was a nice change of pace.   Despite the speediness of service, my only critique was that I couldn't really tell who my server was since we had 3 different people stop by our table...also it took a bit to get a water refill that I had asked for.   Overall, this is a great place to grab a quick bite before 7th Avenue shopping adventures. I will definitely be back since I live so close!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "eCc5bRw6hBsky6BKtYSP3g"
  },
  "j8_e1ngn_f7pirNVvwRhtg": {
    "date": "1/18/2014",
    "text": "Cute mix of homemade and garage sale finds fill the space with stuff to look at.  Fun stop in the middle of thrift and antiquing.  Food is \"good diner\" cuisine.  We will be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DGI7LT4-fmllzJZl-OhklA"
  },
  "41Tq1rdHosn6ZknBzuWn_g": {
    "date": "11/15/2015",
    "text": "My friends and I have officially made this our weekly Sunday brunch spot. Their \"secret garden\" patio is eclectic and a great place to enjoy your meal. I typically have their omelet which is always cooked to perfection, with up to 6 add ins of your choice. The service at times can be a bit weird, I never know who my actual server is because we have almost every employee come up to our table at some point or another. However, over attentiveness is better than the latter. Definitely a stop worth checking out in the Melrose district.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yBOAoIDR7b6r3v3pAqNnLA"
  },
  "nt2P5c1gyCpMGtNRI9vYrg": {
    "date": "1/15/2016",
    "text": "Great atmosphere!! Everyone is super friendly. Only third time in and owner already knows my order  food is great and so is the price!!! If your looking for that small hometown diner feeling and that home cooked meal....this is your place!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fYdJUFUgZt-afIHQ4JttWA"
  },
  "29fqK328OPmNLzcz7rMu-w": {
    "date": "4/14/2015",
    "text": "Super yummy, great service, and the atmosphere is comfortable and cute. We haven't been here since they remodeled the place and menu... Impressive!  6 item omelettes people!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dXeuD_C-NQR9bL8Zre_Jig"
  },
  "-smdPhg7Tb8XqbbUIh0cvw": {
    "date": "1/3/2015",
    "text": "Good French toast, sausage wasn't that great though. Very friendly staff, and I liked the decoration.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nA0Pijv5_DES1xw5-OBmSw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States. French toast, eggs, hashbrowns, and sausage",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nA0Pijv5_DES1xw5-OBmSw/o.jpg"
      }
    ],
    "user_id": "jhL1t6FzBFL3IhTI8dkDrw"
  },
  "BxfNCRKWGODGYDJNnfglCQ": {
    "date": "11/27/2013",
    "text": "I love this place so much! I live within walking distance and by my third visit, I was already clearly a \"regular\".  Their breakfast burrito is the BEST breakfast burrito in town, which you can customize to your exact preference.  The ingredients are fresh and the burrito is HUGE -- it's my number one go to \"brunch\" order when I know I probably won't eat again until very late (and skipped breakfast).  It's cute and quaint and 100% local.  My kinda diner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "s1uQRf7vP5hfvUoBxqzH9g"
  },
  "Fp3huBsPENRugAtDReVWxQ": {
    "date": "12/19/2013",
    "text": "I think I found my new favorite breakfast place! Excellent breakfast burrito with great hash browns, cup of coffee that is often refilled and a nice comfortable atmosphere.   Friendly prompt service. Plenty of parking. Great little diner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "a5--WEPUdH7smreNuqj4aQ"
  },
  "HFXVomorKoRyO3xWaTzBNA": {
    "date": "9/22/2014",
    "text": "My wife and I love to try new places and hope we love it so i can give a good review. There are usually way too many negative reviews because only disappointed people are the ones writing. Sorry to say my review is not a glowing one. Melrose Kitchen seems very average to me. It gets three stars for good service, fun decor and really good prices. My eggs benedict was good, but nothing super special. Biscuits and gravy were floury and not good. The biscuits were nothing special.  I suppose it is not fair to judge a restaurant from one visit..but when it comes to biscuits and gravy, you can in deed judge a breakfast place on that. Unless it was just a bad day with the cook..I suggest changing the gravy recipe.  I will try it again though. Probably lunch. If all goes well I hope to be able to give a better review.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uxR4jshIdy8mdAX7pCpSZg"
  },
  "y_IkIWQNvJYbGQodfwHVAw": {
    "date": "4/13/2014",
    "text": "This place is so cute. Very quaint and a 50's/60's American feel on the inside. Service is very good and there is always someone there to help you. What did I eat?  The famous Huevos Rancheros  I'm not a foodie but I know good from good and these were amazing! I will be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EIvHatb1z2N4ANKdt8Mdkg"
  },
  "HvwD6kGYlW74Hofow1l95g": {
    "date": "9/19/2014",
    "text": "This place is only getting a 3 star because our waiter was awesome!   It's hard finding a breakfast place that doesn't just only serve pork breakfast items but turkey as well. I ordered eggs, hash browns, turkey patties and toast also was craving something sweet so also ordered the Big waffle with added strawberries and whip cream. Everything looked good but I did not like their Turkey Patties, it had this interesting flavor that I will try to describe. The turkey patties tasted like they had been frozen then defrosted but not all the way cooked, I actually went to have breakfast with someone and they ordered the same thing and also didn't eat the Turkey Patties. Maybe it's the brand they use or could be the cook but I could of made better using the turkey sausage patties at your local super market (The Jimmy Dean Brand). The strawberries on the waffle were soggy but that's okay, they did taste like they had been soaking in sugar for several hours so your taste buds were going to surely wake up with the sugar strawberries. Maybe I'll give this place another shot, who knows.  Ps: they have interesting flavors of lemonade that was Delish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NMiwDN0uzRgN90lEoEiWuA",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NMiwDN0uzRgN90lEoEiWuA/o.jpg"
      }
    ],
    "user_id": "Oqfi3b_FQP4izygPamTnuw"
  },
  "60WGQVaWG4s703T-ClG9pg": {
    "date": "5/11/2014",
    "text": "People were nice but our food was not so great. Coffee was lukewarm and not good either. From all the positive reviews I was disappointed. Maybe we just hit it on an off day. Will have to try again as it's only a couple blocks away and would love to love it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j2cIDL6jmDt4es_bnFhREg"
  },
  "QeQq6Mfq5LhI4VYgBvmXRQ": {
    "date": "10/28/2015",
    "text": "I can't say what the food is like as I never got any. I came in with my family on a slow Wednesday morning. A sign saying seat yourself would be nice as there was a bunch of us just standing around. The help never said anything to us to help alleviate the confusion. Finally me and anouther customers decided it must be seat ourselves as we were being completely ignored. I have twin boys that require high chairs. Once a server came I asked about high chairs for the kids. The lady said they had some but only brought one. After I inquired about anouther she acted like I was out of my mind for needing two. Well with 1 year old twins yes I need two. I told her to forget it as it was clearly to much to understand. She then disappeared for over 10 minutes and never came back. Finally we just decided to leave as it was clear the staff had no idea what they were doing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "22LFknFhN1yq_yuK-Old4w"
  },
  "LCPIZEiNDcfzTPMb_ydjhA": {
    "date": "2/7/2016",
    "text": "I thought a diner could at least do a cheeseburger right. I usually love greasy spoon cheeseburgers. WRONG. McDonald's does a much better job of hiding the fact that their patties are frozen and prepared off site. Can't imagine how poor the rest of their food is.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WK0hq9797ZlTUFYidPNnqw"
  },
  "dbajjdB2hKSsqhEnaOx3yw": {
    "date": "1/28/2016",
    "text": "The bacon was absolutely perfect! We had French toast and pancakes with eggs sausage and bacon. I loved the sausage, but again the bacon was crisped to perfection! Everything else was good and tastes homemade. It's worth a try in my opinion.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wX3xkz6GvoYxn3QaBQdjFA"
  },
  "CVJ0vyMHxcOgRFKpWIK11g": {
    "date": "4/2/2016",
    "text": "Excellent food and great atmosphere! The Huevos Rancheros are done to perfection. Their Latte is by far my favorite though. I had to have two!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vn6Mq_XeWyqyJRd6J9uX7Q"
  },
  "8ZfgjDbtKRo1Ybx4-IPP4Q": {
    "date": "9/7/2013",
    "text": "I fell in love with the place when it was 2 Hippies Breakfast Joint and still love it here since the food or great service hasn't changed. Six dollar breakfast burrito will always hit the spot. The decor is different though, no more hippie memorabilia but that's ok, still plenty to look at.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "EkoEQIEB7k1tVVtNfp9x0A",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EkoEQIEB7k1tVVtNfp9x0A/o.jpg"
      },
      {
        "img_id": "7uyYCm5aEFQX01R30lkNtw",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7uyYCm5aEFQX01R30lkNtw/o.jpg"
      },
      {
        "img_id": "VJft2A2Eiwv9VvfUAD6qzQ",
        "caption": "Photo of Melrose Kitchen - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VJft2A2Eiwv9VvfUAD6qzQ/o.jpg"
      }
    ],
    "user_id": "QiyvjCMCGhqscz26JcfEkw"
  }
}