{
  "Ay9EzmQ5y9urhhD_a5euGw": {
    "date": "2/22/2015",
    "text": "Really delicious food and great service! We tried the lamb kafta and chicken kabab sandwich, and both were excellent. All of the food was fresh and flavorful. We will be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8MqmITlNiP3R4_8UgsmQ9A",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Chicken kebab sandwich!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8MqmITlNiP3R4_8UgsmQ9A/o.jpg"
      },
      {
        "img_id": "Mw-4JuQw3xwi57NX-llt7A",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Lamb kafta with hummus and rice. Delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Mw-4JuQw3xwi57NX-llt7A/o.jpg"
      }
    ],
    "user_id": "HE6uTKU-j9hmBpLiqgOJ1g"
  },
  "s3LG4eoZxXjlyz280Lo0dg": {
    "date": "7/16/2016",
    "text": "I had the Gyro plate (beef & lamb) with salad and rice and it was very delicious. The rice, salad and meat blended so well together that I couldn't help but want more!   The rice was perfectly seasoned and tasted great all on its own. The meat was tender, savory and cooked just right. The salad was fresh, making it very scrumptious.  Not only was the food very flavorful, the people who served me were both exceptionally kind and generous.  I'd like to recommend eating here to everyone. If you love Mediterranean food or are willing to give it a try, this is the place to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ss9w8ow8aEYsPQDfheOjHA"
  },
  "ZGA9iYoACc7bbwx1R-rW8Q": {
    "date": "11/15/2014",
    "text": "This place is a great authentic Turkish restaurant!   The gyro is one of the best I've had!  The bread is warm and fresh. Staff is very friendly.  Don't miss out on the authentic Turkish tea!  I will have to come back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mrZnJmhkzSjPV1XvxCSdqg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Authentic Turkish coffee! Yum!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mrZnJmhkzSjPV1XvxCSdqg/o.jpg"
      }
    ],
    "user_id": "BfauCI4tneP3Njk7tmcD2w"
  },
  "3BG_bZKpNYJk7-akygRWsA": {
    "date": "3/25/2015",
    "text": "So, I went here for lunch one day during a week long training event. The location is definitely pleasant, and had a Turkish vibe to it (I'm Turkish). I had a tough first impression as I had a lot of trouble ordering. I attempted to order three different things that were on the menu, but the person taking my order kept saying the menu was changing and they didn't have what I wanted. It got down to the point where I ordered something I didn't really want.  I got the chicken kabob sandwich that was very good, but extremely pricey for not coming with any sides. I really wish I could have tried the lamb instead. I found the actual portion size to be appropriate, contrary to one of the reviews I read.  I didn't get the best impression from the staff either, as some previous reviewers have noted. Although, it could be that's how us Turks come across. Hm. I think I would give them another shot once they resolve the menu issues and perhaps update my review. I might recommend asking for a introduction to Turkish cuisine if you haven't had it before. You may miss out on some gems they seem to have on the menu, otherwise. Definitely try a tea or coffee!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b9cJ76lu_WmEum0MRaBrng"
  },
  "khmDtygByXxYqMpx_CJTHg": {
    "date": "4/25/2016",
    "text": "Very good hummus and bread.kebab was tasty. Baklava is delicious. Next time going to try Turkish coffee and tea. Great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QyhfvMVWtmxQg7hUZmgjlA"
  },
  "GLEOIRrtdcCMJNWoVyufcQ": {
    "date": "1/31/2016",
    "text": "I love this place!!! Their Hummus is creamy and yummy. Always order extra pita. I typically order a side order of Falafel as well. My BF would order his beef gyro which is also delicious. We had our kids so we order chicken shawarma for them which I had a taste and the chicken was juicy and flavorful. The kids favorite was the rice with it!!! I'm glad we have added another place for us as our \"Go To\" place!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JnIhH0aEgMB0cZNLV9ya8g"
  },
  "MMu3a9SYm3qgapdc5C6WJQ": {
    "date": "6/4/2015",
    "text": "I had read a lot of good reviews, here on Yelp, about this restaurant. So I did go there for lunch today. I LOVED it. The food was very good. The place very clean and the server/owner? very attentive.  As an appetizer, I had Sigara Borek, for entree Urfa, a long skewer with rice and, as  dessert, baklava. The server brought me a cup of tea with my dessert as well. Everything was very tasty.   I know, that I will be back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nOf0ZPhTen0ET8-y1CYgqg"
  },
  "gGJwF1Nc1BmLAoZNHnoq8g": {
    "date": "12/4/2015",
    "text": "When you drive up to the restaurant you Kinda raise one eyebrow and wonder if it really is a good restaurant since the entrance is small. But then when you walk in you can see that it's much more spacious inside and very clean. It's a hole in the wall which is the kinda restaurants I like because it's run by people in the community and not a corporation. I love that. People who want to share their ethnic food with everyone always beats chain restaurants. One thing that I noticed was that the menu was very easy to read. The food was very delicious and had the right amount of spice and authenticity to it. The people in the restaurant were very friendly and it was a great lunch break for me between running errands.   So I say ditch your routine or comfort restaurants and take a chance to taste some Turkish food. It will help you explore and become one step closer to being Anthony Bourdain or Andrew Zimmern.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nSrDX4aDj0MCQgY7JXhGIQ"
  },
  "7yfXOYuKR5dio8v1Z-CDBg": {
    "date": "2/2/2016",
    "text": "I love this place , clean and food so good Iskender kebab so good , this will be my favorite restaurant",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GRT_mv6D3uGeIs1NORzKMQ"
  },
  "h5bjh11BFp1AqlXM_aMEgg": {
    "date": "7/3/2016",
    "text": "Chicken Kofte and the gyro were awesome and service was great. Husband and I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "krfAkSqyxEO3dvvQriaCzg"
  },
  "76XFgSkNXKNeR1QquPueeA": {
    "date": "6/25/2017",
    "text": "The family was really nice and very helpful. Food was served quickly and it tasted great! I would definitely try it again when I'm back in AZ. Owner told me to try the spicy beef patties with the hummus. Looking forward to it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JAFLRfn0r5tkw05dThZxBQ"
  },
  "WpmbHEHr8bgnQPX1iAefyg": {
    "date": "12/4/2015",
    "text": "Maybe it was an off night? Food was expensive, ordered a gyro platter which is pictured with a pita and two sides. I was charged extra for the pita, the meat was greasy and didn't taste like it should. I have had much better for less money. On a positive note their hummus is really good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_TVVlxhRqV19gdyZHTxctg"
  },
  "FBka9dWRcv7d55bPwzflDQ": {
    "date": "4/14/2017",
    "text": "Excellent find!! The Doner was delicious.  The kids enjoyed the chicken nuggets.  We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JD9FeicMZ_s0PgbYdK8b9w"
  },
  "9ct80lli8gQCo_PwTvZzjw": {
    "date": "12/12/2015",
    "text": "I love this place, they have bread everywhere which instinctively makes you hungry. The food is seasoned with the best garlic and paprika ivd ever had. I like this place, its better eating there to get the whole experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JHa6QhwsnQ3tBfoHwz9pJg"
  },
  "wGYXylMAorv5ngEzdv6FqA": {
    "date": "7/17/2015",
    "text": "I'm not sure how this place gets five stars. I ordered a gyro, typical for a place like this and hard to mess up. I'm used to going to places where the gyros are so full that I have to eat some of the meat out first before I attempt to eat it. Not here. There was maybe six pieces of small meat hiding under my tomatoes...and it wasn't even good. Never again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5TbEQsxzl-ge-KAJASc4NA"
  },
  "_FHy9FYwpdPN7lypUOiiuw": {
    "date": "4/8/2015",
    "text": "We had an excellent meal. We tried the gyro platter, the beef kofta kebab, the lamb kebab, the turkish flatbread pizza-ish thing and the kofta things that were dough with meat inside. The gyro was excellent and seemed homemade not factory made. The kebabs were also very good, tender and flavorful. The buttery rice was delicious, as was the salad(it had an unusual and delicious cheese, not the standard crumbled feta). All our items were fresh and tasty, and the staff was friendly and helpful. Turkish coffee was also good and so was the tea. We'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "DRBBucPpeNLIK2U-eyygGA"
  },
  "ZmIiejPi-W7-MkfVpC7ejw": {
    "date": "12/14/2014",
    "text": "My hubby and I love the food and staff here. And the bakery stuff are awesome. Small friendly warm restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JQlZGQv_Gt7lavlZFeOEeg"
  },
  "XqbLOgMQtBePM059ODM73Q": {
    "date": "3/30/2015",
    "text": "Outstanding food. I lived in Turkey and this is just like walking into a street side cafe. The kebabs were excellent and the lahmacun was excellent.  Highly recommend you try this place. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "2qfEQQaN26KzXj5JtAgstA"
  },
  "45y7oQEBtoKDbtlB8BVAEg": {
    "date": "7/17/2015",
    "text": "I don't know how this place has the rating it has. They must be padding it! First, they didn't have the first thing I wanted...then didn't have the second choice I made...so I got stuck with chicken and it sucked! This is a typical half ass attempt at Greek food done cheaply. I'm still waiting to discover that little gem of greekness and this ain't it!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4bPQE2Z7Gq9SOtNSPdB3NQ"
  },
  "0C7AxypyBQnN4i30H42VpA": {
    "date": "2/4/2017",
    "text": "a nice hole in the wall place to try, the owner is real knowledgeable about the food can answer any questions you may have as well as recommend certain things. i have been there a couple of times and i will keep coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j4pRiKypwTSWd6RcT0VosA"
  },
  "EFnKjjfrDOO0qgOQ9jQ4cg": {
    "date": "1/31/2016",
    "text": "The interior is very bright and roomy. The decorations are perfect without imposing on you. The layout is very practical and they even have a nice play area for children.  We ordered the chicken kebab and the manti and the sigaro borek. All were fantastic! The manti did not come with rice but I mixed it with the rice that came with the kebab and it was even better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nyh28ab5Hbm32jIGxxKbhw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nyh28ab5Hbm32jIGxxKbhw/o.jpg"
      },
      {
        "img_id": "gpAJuu6ZHaBpXvwdldQJ_Q",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gpAJuu6ZHaBpXvwdldQJ_Q/o.jpg"
      }
    ],
    "user_id": "6L0TLZ-0tv51wmPSYBwXzg"
  },
  "cNZUjQNT-uWAtkWf4D8wFQ": {
    "date": "1/26/2017",
    "text": "I brought a coworker here and now this is our go-to lunch spot.  Really good, fresh food that is served quickly and at very reasonable prices.  I have tried several different dishes and have really liked everything I have ordred.  The pita bread is VERY good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4irynfMm8_VIC3SeG6WDrw"
  },
  "NGxO-OsJnxHj2DHLCpdbhQ": {
    "date": "10/17/2017",
    "text": "Thanks to chefs for these delicious spacious meals. I like doner Kebap, and very good serving to customers, clean and good price. If you like Turkish style you need to visit this place. Thank you again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YXM3F6t6e5ZZCwKWZiColA"
  },
  "-LhlQuickbOMA_30X41ppw": {
    "date": "10/11/2016",
    "text": "I have been very impressed with the freshness and quality of the food served here at the TurkDish. I have had the lamb Alana several times and the vegetarian dish as well. I bring friends here and they love it too!!   The chicken burger is like no other!   When I eat here It taste like I'm eating in a Turkish home where food is prepared with LOVE!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WVkIPjxYYY1J2Mvu9LkEnQ"
  },
  "QjcQheK_U8xt3pxZ4P39Zw": {
    "date": "6/22/2018",
    "text": "A True hidden gem in east valley. Amazing food very reasonable price and good service, all the makings of great restaurant. This was our first time there but we will be regulars for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0GkRNnekOTuty6seHE9Kag"
  },
  "F_80-HkScDdmi-_M4ynMMA": {
    "date": "8/15/2018",
    "text": "Horrible service!! Went there today with my son and asked the lady if the Cizbiz was spicy, she said no. So I went ahead and ordered it and lo and behold, it was spicy for both my son and me. So I asked her to cancel it and bring us another food, but she refused and said that SHE does not think it is spicy. She said she is going to charge me for it anyway. The experience turned out to be very unpleasant and we won't be returning there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JW0MgNUXBrsuCAVQIbDXIw"
  },
  "qJGSonfwZ6vBxpQ526MimQ": {
    "date": "6/10/2018",
    "text": "Excellent Indian Cuisine with exceptional service. We were very pleased with the spices, quantity of food and price. Can't wait to come back and try the curry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RVWfL9LdfZ0mVbEOgtbK4A"
  },
  "J_njQAU453pDcgkiIu7oIQ": {
    "date": "10/6/2017",
    "text": "We took our Turkish exchange student here for dinner one night...her eyes lit up as she took in the menu.  The owners stopped by the table and chatted with us for a little while.  The food is very good.. the atmosphere casual.  It's a strip-mall place, but if you're curious about Turkish food, definitely check this place out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Q7p9asYQzdmOJTxhqAGjlw"
  },
  "B3PctDUNMjRdhquPLmGu0g": {
    "date": "11/17/2016",
    "text": "First time to eat here and I was very impressed. The service was excellent, the hummus and babaganush was fabulous! I had the falafel plate and found my falafel were overly cooked...  The pita was fresh and warm!!!  We ended with a Turkish tea and baklava, so fabulous.  Overall a wonderful experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XBvxscfiJxoRWjhppTaKqA"
  },
  "iYpOb8JrvWdxqQ05mg0y9w": {
    "date": "7/12/2017",
    "text": "I ordered the Lahmacun which has been referred to by other reviewers as Turkish pizza to go and the owner explained put the tomatoes and onions on top and squeeze on the lemon and then roll it up like a burrito.  Excellent fresh flavor and at $3.77 with tax it hit the spot for a quick lunch.  Will definitely go back and try out the rest of the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UTqbNLSA4gyRdn4UiJEmNg"
  },
  "ZLZiGyCS7drtpCwjAd67UQ": {
    "date": "8/13/2016",
    "text": "This place is great. I have tried Iskender, adana (lamb) from main dish, and these are already my favourite. Hummus and babaganoush as sides were great as well. I have tried Kunafa and sutlac as dessert. Sutlac was so tasty, I would try it again. It was so similar to the ones which I used to eat in Turkey. This is the best Turkish/Mediterranean place so far that I tried in the valley.   The prices are good, the place is clean and owners are very kind. This business is a family like business, owners are also the employers. I will support this local business.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2rSE-ESNITbm0OMY4pjBLw"
  },
  "ovX_zHGKuB_zbXewpiIsCg": {
    "date": "6/12/2015",
    "text": "The reviews do not lie.  I was skeptical when I walked in. I ordered the icli kofte entree, dumplings with dense and moist barley pastry. It was very different, but I really enjoyed it.  The place was run by a very nice (Turkish?) couple. We had 15 people come in at once for lunch, but they were able cook and serve us fairly quickly.   I checked in and got some complimentary Turkish tea. The tea was really good. On top of that, the lady gave us extra fries free of charge!  Overall, excellent food and good service. I would come back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CPnFd_Pooxmszppyp2Rj_Q",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Gyro plate my friend ordered, really delicious as well.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CPnFd_Pooxmszppyp2Rj_Q/o.jpg"
      },
      {
        "img_id": "W2bea5UvkSv-ygiRog2vaQ",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Icli kofte, really good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W2bea5UvkSv-ygiRog2vaQ/o.jpg"
      },
      {
        "img_id": "X5_PqyV-66a14sdiRVm5Fw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Tea",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/X5_PqyV-66a14sdiRVm5Fw/o.jpg"
      }
    ],
    "user_id": "tMqxceO84JQDMp7zYOl2LQ"
  },
  "AjRIjjDkoQFe-p6sDCUDxA": {
    "date": "5/9/2015",
    "text": "My husband and I decided to try something different for Mother's Day, we drove 22 miles  to try this Turkish place... 2 words: \"WORTH IT\"!!! Will definitely go back here and invite my relatives to try their food.   their free Turkish tea!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dHBREWmCMSeevlRVchao4Q",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Delightful Turkish Tea ! Top Pic: Lamb Kofte ; Bottom Pic: Adana... Really good! Tried their excellent crunchy chicken wings!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dHBREWmCMSeevlRVchao4Q/o.jpg"
      }
    ],
    "user_id": "d5TnVg6cs5Rb8-aim6H7fA"
  },
  "UnJwK6Dzlzi4f8oVqqNrwQ": {
    "date": "3/6/2017",
    "text": "Went there a couple of weeks ago. Great food, reasonably priced and very delicious.  Would recommend it to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oEf5gKrchg7VXtOMs0nSCQ"
  },
  "oYl7dqCCyE8f5JIoyer8og": {
    "date": "5/11/2018",
    "text": "This restaurant has some of the best Turkish food I've ever tasted! Every dish was amazing. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G6ZY3e75KhtBluwBpBczBg"
  },
  "qsbUau8TFkBdNoQOMMmJjw": {
    "date": "12/2/2017",
    "text": "Best felafel I've ever tried! This is becoming my favorite restaurant in Chandler. Also for those that require it there meat is hallal/ kosher. Fast and hospitable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y9SewGBGqy1D_4DdgUgUvA"
  },
  "DTGG46zKG1XOAZxSI-a0Bg": {
    "date": "6/17/2016",
    "text": "Had the chicken gyro. It was delicious. Service was fast too. Great spot for lunch. I would go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tCdnCvCvYJJlxGq6gnh1Eg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tCdnCvCvYJJlxGq6gnh1Eg/o.jpg"
      },
      {
        "img_id": "RqtcGB7i-BRBrEzONrUgSA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Black tea&amp;#39;s always great after a good meal",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RqtcGB7i-BRBrEzONrUgSA/o.jpg"
      },
      {
        "img_id": "bcB9XtTg8dBtDizAeFDX-w",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Flavor of the chicken was soo good &amp;amp; pita was nice &amp;amp; soft.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bcB9XtTg8dBtDizAeFDX-w/o.jpg"
      }
    ],
    "user_id": "62F74oDvCDgVABIbxQ3zVQ"
  },
  "FCSIQRAmlISpYSyyFqH1Zw": {
    "date": "3/12/2016",
    "text": "Since I arrived 3 years ago from Turkey I have been trying to find authentic Turkish cuisine in Arizona and southern California and have been disappointed.  Today my brother-in-law asked if we wanted to try this place.  Why not, can't be worse than what we have found before.  We were excited to see real Turkish menu items.  I ordered the Iskender kebap and everything tasted authentic, I have missed this food for 3 years!  They served fresh Turkish tea.  My wife and brother shared a lahmacun which they said was very tasty.  We bought 4 to take back home to Yuma.  We were fortunate as they make simit on Saturdays which we also bought some to take home.  Place was fresh and clean, simple but nicely decorated with Turkish decor.  People very friendly, fast service, relaxing setting.    We will definitely be back each trip we go to visit family in Phoenix-which will be more often so we can get a taste of Turkey.  Great food, great service, warm hospitality - we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Mvws_Txp799JulimxCKklQ"
  },
  "FG1_RGrzBjlaKrSJSJo5jQ": {
    "date": "2/6/2015",
    "text": "I won't be going back. With that said, the service was excellent, it's clean, brightly lit, and freshly painted.   My order wasn't right and it wasn't complicated.  I ordered a falafel platter no tomato and a gyro sandwich, no onion. It was $18.13. The food was extremely expensive for what I got in comparison to other Mediterranean spots in the area.   The gyro was $6.49 and the falafel platter was $9.99. Let's start with the gyro. It had onions. And the size of the gyro was tiny. I'm a girl and by no means gigantic. It was barely larger than my one hand.   The falafel platter had 5 smaller than average falafel nuggets, one Pita, literally a hand full of salad. For $10. The falafel tasted frozen, not home made. I make home made all the time. Even Manischewicz' falafel mix has more texture. And there was tomato all over the salad and one little olive on top of ice berg. There was no onion and two slices of cucumber. I asked for condiments on the side as my order was to go. I received half of one Dixie cup of tzatziki and even less salad dressing.  Zorba's, only 5 minutes away, has a large, decent gyro for $5 and falafel sandwich for $4.  At Pita Jungle, two locations within 5 minutes each, have similarly priced food but the quality is good and the portions are much larger.   According to the menu, gyro is $6.49 and a side salad can be added to any sandwich for $2.75. The gyro platter is exactly the same thing but costs $9.99. Huhh?  There are signs up all over this place asking for reviews on yelp, so here it is. I have no reason to go back when they're is better, less expensive food of the same variety right down the street in all directions. Not to mention parking is sketchy with the sports bar nextdoor.  I'd be happy to post pictures.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fMm24Aj291sqqd3BQe7QTg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. This is the $9.99 falafel platter. Half-full Dixie cup of tzatziki and even less salad dressing. I ordered no tomatoes.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fMm24Aj291sqqd3BQe7QTg/o.jpg"
      },
      {
        "img_id": "rQD94_0GTVXuvPjoJdsxqg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. This is a $6.49 gyro. No, I don&amp;#39;t have freakishly large hands-it&amp;#39;s that small (insert &amp;#39;that&amp;#39;s what she said&amp;#39; joke here).",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rQD94_0GTVXuvPjoJdsxqg/o.jpg"
      }
    ],
    "user_id": "tY2h_jSxt6s4xrMD9KVAAw"
  },
  "5m5mQUE0ewrSEgn7U-kHUg": {
    "date": "12/23/2017",
    "text": "My family and I never had a chance to experience their food. We were denied service because we had a service dog and were providing proper certification for our dog. They said no animals allowed and so we had leave. If you have any medical issues that require a service animal, please don't bother coming here.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "19I-jgGVVynSGcmOhW1zLA"
  },
  "JJkkG26U0H3CZV9Z3F4sqg": {
    "date": "7/21/2016",
    "text": "This is by far my favorite Middle Eastern Restaurant in Arizona.  I drove by this place several times before randomly trying it with a friend one day, and I am sure glad that I finally checked it out!    This establishment is nothing fancy and it doesn't need to be.  It is very simple and humbling.  Turkdish is a hidden gem!  This business is a small family run \"mom & pops\" type business, and you can tell that the owners are very hard workers, genuine, maintain integrity, and the food that they make is AMAZINGLY TASTY!    I eat here at least once a week ever since I first tried it.  I would absolutely recommend trying their Lamb Plate, Mild Beef Plate, and Chicken Kabob Plate.  Their hummus is AWESOME - as fresh as it gets, and there rice is verrrry tasty!  I will continue to support this local business, and I would absolutely recommend others in the community to do the same... this is what small business in America is all about!  Please support these good souls, especially after trying out all their delicious foods!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7fHmEe2V87xvN6MAEhFHJA"
  },
  "eZAhVuuXWMGe7VPMz7LCzA": {
    "date": "7/7/2016",
    "text": "Love this place for lunch. Their spicy sauce is mindblowing. Both their falafel and chicken shwawarma wraps are delicious and perfect. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x1EZu6w9ifvsqoZr0SRBsQ",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Best on the menu.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/x1EZu6w9ifvsqoZr0SRBsQ/o.jpg"
      }
    ],
    "user_id": "05c1IO1dxA9VVobtF7BtxQ"
  },
  "n4dFQVbNX12PpnnV7JoJVQ": {
    "date": "11/2/2018",
    "text": "Delicious home made food! We absolutely loved it . Family owned restaurant. Ambiance can be improved!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ZqyrtwhW49_syWl7Srw5w"
  },
  "1RRoNTt6j0DWCpgmkfcJPQ": {
    "date": "3/9/2018",
    "text": "Found on yelp, & was reminded that a friend had recommended I try them.  Decided on the chicken kabob. The chicken was so good. Tender, juicy, & tasty! This was potentially out of hubs comfort zone, but he picked up a take out menu. He cleaned his plate.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pNn_DcM3TyBxSqSv5S7P_g"
  },
  "XZ0Dz_-5hPIRnHFKJPL9uQ": {
    "date": "12/1/2018",
    "text": "Great food, great hospitality, and fast service. I would recommend this Mediterranean eatery to all.. Clean,  very open environment for dinning in with your family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fwnb11xIeV8MPCRhX9wsfQ"
  },
  "rZUf7b3TOgXfHB6VRf7nPQ": {
    "date": "10/27/2018",
    "text": "I am not yet an expert of Turkish cuisine, but my wife is.  She is Turkish.  I have been to many good restaurants in Turkey over the course of more than a dozen trips to Turkey.  TurkDish ranks as a good Turkish restaurant in my judgement.  My wife says It is like home cooked: the wives are cooking and the husbands are serving. As the Turks say, Afiyet olsun.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-oRt-6pJNlOrPC3dKD0htw"
  },
  "UYNVa7u6Dq1_cztM7l72gA": {
    "date": "10/26/2018",
    "text": "Fresh spices and quick! This place was a real find. We'll definitely be back. Great variety of flavors. Spicy lamb was awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G-cKgPALmOM7eJ8Fj2aFQQ"
  },
  "p98hM72GOcabsOp5s3Mu0A": {
    "date": "4/29/2017",
    "text": "Lentil soup was amazing. Chich taouk was great and very healthy and owners were very friendly. The plates are presented in a nice and tidy way. And lastly very affordable prices !!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "CtFMUUCTyb9ElFkvgpe8LA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Lentil soup and taouk",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CtFMUUCTyb9ElFkvgpe8LA/o.jpg"
      }
    ],
    "user_id": "qK-CX0G2JEd8jWFNsVlsNw"
  },
  "I_iANwdysq0rsGBuD5cBdw": {
    "date": "11/17/2018",
    "text": "great food. never get disappointed with the quality and amazing service. my family loves this restaurant and we look forward to coming for many years",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1Pun6eZ1e608Yp2w2kDY6w",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. fun with the amigos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1Pun6eZ1e608Yp2w2kDY6w/o.jpg"
      }
    ],
    "user_id": "KSLAgaAQ2ruC3MrGUPS49w"
  },
  "dWAiHYaSvFcKQj4A8bLLLQ": {
    "date": "3/25/2016",
    "text": "Just tried thus place for the first time. It's tucked back into a plaza area but its worth looking for!  I live close, so I guess I have been missing out on this place ordered take out within the yelp app, which is super convenient and rare! That's honestly what got me started here.  Ordered 3 gyro wraps. 2 spicy and 1 Philly style. They were all great! The spicy gyros are seriously spicy though! Be prepped if you order those. Philly style was perfect to me. I'll definitely be back a couple more times before I relocate!  Ps, if you get takeout, be sure that they doubke bag (the brown bags)...because mine broke and everything came out. Lucky they didn't roll down the staircase!   An awesome taste for something that won't break you're wallet!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rGm8NKrjhoqKRx5eJc_3qA"
  },
  "XV8pI9Ao5p9RI4j42gw0Xg": {
    "date": "8/25/2017",
    "text": "I read a lot of good reviews and gave it a go. I walked in and there was a guy sitting in a chair behind the counter. He just looked at me and looked irritated that I was there. I said \"hi\" and nothing. There was a lady putting silverware in napkins. She just looked at me too. I was about to walk out when a waitress came over and said \"are you picking up or placing an order to go?\"  I said \"I was thinking about eating here if that's ok.\"  She said \"oh yeah have a seat\". I already knew I wanted a Greek salad with chicken. I was hungry and ready to dig in. I will say, the salad was decent. But it was about the size of a small dinner salad. Had there been more substance and at least a \"hello\" from the staff, maybe I would go back. But I won't. Too bad. It's 4 minutes from my office.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SbfBeY-uuxSgO7w0Wx7QqQ",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. See review.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SbfBeY-uuxSgO7w0Wx7QqQ/o.jpg"
      }
    ],
    "user_id": "9OPJKVhsMi3t0vqnkL-biQ"
  },
  "nAvk9b8uXby-vIUXNypEZw": {
    "date": "11/2/2018",
    "text": "This restaurant has the best Turkish food in the world. I have had Turkish food all over USA but this place is the very best! The lentil soup is perfect and Adana Kebab is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oAi4IeQf5ujdRNJJ4TPfTw"
  },
  "eIul2jpwOhOX7o9tLZw8ew": {
    "date": "1/31/2016",
    "text": "My first time here,  was craving healthy and Greek/ Mediterranean food, searching Yelp led me here in my own backyard so close yet never been here.  It was pretty busy at 630 pm on a Sunday night and only the owners working as their only employee had the night off  (I told them that is why they were so busy) anyway after looking at the menu for a few minutes I chose the chicken kabobs, which came with a salad and rice or hummus, pita is extra .99c  The wife was cooking a ton of food by herself and when mine came out it was cooked perfectly.  The salad dressing tastes like a dill vinegrette so darn tasty I could have drank it. The homemade hummus and tzaziki were also delicious.   The owner gave me a dessert on the house because of my long wait, which was so kind and not necessary.  Overall great experience and I'll be back to support this mom and pop.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "S6t_MS8CEL5tCGYPdMFpYg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Dessert",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S6t_MS8CEL5tCGYPdMFpYg/o.jpg"
      },
      {
        "img_id": "XKq5to1FstdQYRsI7gxDDg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Chicken Kabob",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XKq5to1FstdQYRsI7gxDDg/o.jpg"
      }
    ],
    "user_id": "eU77PxGTK58WVRWoXULlEw"
  },
  "DKDnqWKdNHiXg0WBkjPGKw": {
    "date": "5/8/2016",
    "text": "Great food, excellent service. What more do you need? Oh, and very reasonably priced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hh5ZtUanXTARKJ6Bwnj8RA"
  },
  "x9yBaeiNKKIPZcItI3e7ZQ": {
    "date": "12/28/2015",
    "text": "A great place to try if you're looking for something different! Definitely try the hummus!   Food: Each time I've been here I've tried something different - and it's all been good! This time I had the Adana (spicy beef), and it was very flavorful. Did I mention the hummus? Maybe the best I've had! I presume this is authentic Turkish food, and the variety is quite good.  Cost: A little steep, and $10.80 including tax for my entree.  Service:  The staff is \"all business\" - efficient, if not very engaging.  Atmosphere: From the outside it doesn't look like much, but once you go through the door, it's a comfortable, well done restaurant.  Overall: I love the food (did I mention the hummus? :-) , and will keep coming back despite the slightly high prices.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Ivq9ZFWXsMJGNSmMmbqjBw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Adana (spicy beef) with salad and hummus.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ivq9ZFWXsMJGNSmMmbqjBw/o.jpg"
      }
    ],
    "user_id": "e0pVHbAZE3B_iwRenLfImA"
  },
  "oEiVaHe8hrMcuIN2rD4l4w": {
    "date": "8/6/2017",
    "text": "Superlative flavor!!! Fresh nothing out of a can!!! The sheer respect for the ingredients is exemplary!! Having said that this place has ruined it for me because now everywhere i go i will hold them to the standards this place has and its just not gonna happen lol.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xnPg9CKFuxJuII_J7QBz9A"
  },
  "ZGSaM7oJUPCFN5a8et9zng": {
    "date": "12/16/2017",
    "text": "Fell into this place at lunchtime on the opposite side of town.  Casual and comfortable. Super friendly and informative. Food was amazing. Fresh and delicious.  Babaganush is my favorite and it was outstanding.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mpNAg_2PwgAKXRZsohI5eg"
  },
  "c8rw0hwlkn9CQywOm6Wu7A": {
    "date": "9/20/2018",
    "text": "Went to this restaurant this week for lunch. Had the gyro plate with hummus and salad. The food was very good, especially the hummus. Service was good and prices reasonable. I paid $10 for the meal. Will certainly go back again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xCBdfEqc92d7LdMtSA9Stg"
  },
  "TpSt83Vyu5OeVOGTfQNMPw": {
    "date": "1/30/2017",
    "text": "The Gyro plate at this place is amazing. At the end they offered me the Turkish tea. Reminded my of childhood in the Middle East. Good food and tea, therefore 5 stars",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bK8JU6lKL8dlPLkAm-LffA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Lamb gyro plate with rice and salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bK8JU6lKL8dlPLkAm-LffA/o.jpg"
      }
    ],
    "user_id": "aq_ZxGHiri48TUXJlpRkCQ"
  },
  "Zpzumu8Qvo97gvv8TaTktQ": {
    "date": "3/4/2017",
    "text": "The best Turkish food in arizona. The flavors are so close to those in turkey. The platters are the perfect size, really delicious. Yummm",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3wc5_CMkeV9FAob1LvAwCg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Lahm bi ajoun aka meat pie. Thin and delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3wc5_CMkeV9FAob1LvAwCg/o.jpg"
      }
    ],
    "user_id": "jY8zDuGfep_ROk5_QJYelg"
  },
  "r5iEay1ewMwImjqw4vKX_Q": {
    "date": "11/25/2016",
    "text": "This is my wife and my favorite Mediterranean food in the east valley. The shishkebab chicken over rice is so good, it's the only thing I order these days. She gets it with hummus, I get salad. So delicious. If you're fed up with Xmas music, stop in, this restaurant is a great oasis from the pushy frenetic holiday advertising found everywhere else. Ask for tea after your meal, they will bring you a little glass of after dinner hot tea with a sugar cube, it's very soothing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p9oxmCPwKtrmen-6cRaUDg"
  },
  "g0tgn1E9_dUg8HE5okCwYA": {
    "date": "11/22/2017",
    "text": "Smallest gyro I think I've ever seen. Seriously, it looked like a fun size cangy bar. Flavor was good, but if you're paying $6 for a gyro it should probably take more than 6 bites to eat. Probably should have gotten something else and I will if I ever get desperate enough to go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VsPtV25lFQqFO8UIPtW1Bw"
  },
  "28wlmcZ-hwaJuwWItdhuxw": {
    "date": "9/28/2016",
    "text": "Fresh, authentic, tasty! I had chicken kababs with salad and hummus. The chicken was just cooked through, so tender and juicy, and the flavor was great.  The only reason I'm holding back on the 5th star is the wait and service.  I was surprised that I had to wait for a little bit for my lunch since I was the only customer there. But everything was fresh and delicious so that made up for the wait, and I also spent the time watching a Turkish channel on their TV (on mute) with Turkish music playing in the background. After my food came, 6 more customers arrived.  While the owners were nice, they were doing all the cooking and serving, so they didn't come back to my table after I got my food. After waiting for a while for the bill, I went up to the counter and paid...perhaps that's the normal protocol. They may benefit from hiring waitstaff, especially for customers who work in the area and are stopping in for a quick lunch.   Overall, it was an enjoyable experience, and I will definitely be going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i78o7lgcQ6u-CRbIqtqDSA"
  },
  "razr3FvwBJXAm9k4bf3s2g": {
    "date": "3/17/2016",
    "text": "Tried Door Dash for the first time with Turkdish.  Unfortunately, I was underwhelmed.  It was a little overpriced in general, and the portions were small.  The hummus came with one piece of pita bread.  I ordered an extra just in case & we still didn't have enough.  Probably will not try again.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "60_lsQJ8JEGfZeXcTgKn8Q"
  },
  "O5oEH2Rtaai5aaalydaUPw": {
    "date": "1/22/2015",
    "text": "My friend invite me here it's very nice. I get lentil soup, Lahmacun and manti. It's very nice and not expensive. I can suggest everyone to come and bring your guest. It's  budget friendly. It's worth to come",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CAnXkLzjZUrM2ChC1f5jOQ",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. After I done with my dinner I took picture.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CAnXkLzjZUrM2ChC1f5jOQ/o.jpg"
      }
    ],
    "user_id": "IcvidU6gS3za27n6274qvg"
  },
  "qhzyErm4GZe0k2Km59vmSg": {
    "date": "9/12/2016",
    "text": "We ordered the lamb plate and chicken gyro plate and an order of dolmades.  The food was very tasty and was delivered by the promised time. The Greek salad dressing was amazing and I wish I had gotten a full size salad, just to have more dressing.  The basmati rice was cooked to perfection and complimented the lamb really well. The dolmades (rice wrapped in grape leaves) had a perfect amount of dill in them for me (I like dill a lot). The only draw back is that you have to order and pay extra for the pita and the cucumber sauce, which is a must for me.  I will be ordering from them again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQLpyVF0m4dbCzyMmpjLRw"
  },
  "kSxCIr5cOI3-vqQaWTDzJQ": {
    "date": "9/11/2014",
    "text": "As someone who happens to be quite curious about new tastes and really unique quality food, I happen to try and enjoy the various cuisines rather than stuck up with what I loved (I find it a little bit boring too-no offense). Anyways, there are three things I prioritize when I walk into a restaurant; greeting, serving, remembrance of the food, price/standard ratio and tidiness. I do care about them in a comparative way but from the \"what their real potential is\" aspect.  Greeting: First and foremost, you are always welcomed with warmth and hospitality of the owners or whoever is upfront working at that time. I cannot guarantee on behalf of them that it will always happen but considering the fact that I've been there more than 10 times and (more to go) It has been always like that.   Serving: Sky is the limit for the service. Restaurant business is carried by people and as long the \"intentions\" of the owner or employees are striving for the best, I'm down for it. You can simply see that in owners or the waiters eyes that they just want to serve you in the best way possible.   Remembrance of the food: I happen to see some bad comments about the quality of the food. I don't say they are manipulating the truth but I have no doubt that owners would compensate it if those individuals would request a better plate. It is a human driven place and people might make mistakes unintentionally. Based on my all visits, the food was just always a good remembrance of what I've enjoyed in my hometown and I will be their loyal customer as long as I have that feeling.   Price/standard ratio: Although this is very relevant and subjective issue, my opinion is the prices are fine. Yes, you can find some items a lot cheaper in somewhere else but that doesn't necessarily obliges the restaurant drops their prices. There are also other customers who keep buying from that \"Expensive\" price so bear with it.   Tidiness: I think the place is clean and seems improving. I had the conversation with the owner and if he can realize what he is thinking about decoration, it might one of a kind restaurants in Chandler with a combination of satisfactory food, nice atmosphere and great hospitality.   People who knows me already are also aware of that restaurant indirectly but for those who don't know me, I definitely recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FnDd_38ji621GdIMevHivQ"
  },
  "fKtDVwQee17Zt-bPN8tOsQ": {
    "date": "10/24/2016",
    "text": "I love the food and people who own the place. I am Turkish and food taste like what you would get in Turkey. I Highly recommend the place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l5WnCaDtnTKKRSD0x80xXw"
  },
  "RPl-Jowsjc7LMJHit-_ucQ": {
    "date": "6/5/2015",
    "text": "Excellent authentic turkish food cocked by Turks!  So far everything I've had on the menu had been excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VI2mBC9YdncD1iQXvnVdFA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Lunch",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VI2mBC9YdncD1iQXvnVdFA/o.jpg"
      }
    ],
    "user_id": "KGv-nchch5GGLQipiWZMvw"
  },
  "eZBlknRlQSbAWVedAuSMdA": {
    "date": "5/9/2017",
    "text": "it is a delicious place I decide to go regularly, over the weekends they make delicious Turkish pastries and bread!! the best in town",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mKQwQuA-rVSCEQTpcMzPUQ"
  },
  "fzh4_aaOqC3nbge22eDRyw": {
    "date": "8/4/2014",
    "text": "Seriously, hands down The Best Gyro In Arizona! worth the drive anywhere. I originally stumbled a pond this place from a coupon I received from my coke rewards and I was hooked every since the gyro was perfect to the last detail and the fries are amazing they sprinkle this seasoning on them very good. I no longer reside in Arizona but you could best believe when I visit I'll be stopping by there...I love these guys! The staff is nice too! I couldn't ask for a better place and service. Thank You",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "txxD8_P3BXtd-JFmAcsysA"
  },
  "0RBMbmA5apJtw9PjRIjX_g": {
    "date": "4/6/2017",
    "text": "We were looking for a local place that had good gyros and falafel.  We read a few reviews and decided to give it a try.  What a mistake.  The falafel was bad, actually inedible.  The sauce on the sandwich didn't have much flavor.  The actual falafel balls had a very odd taste.   The gyro wasn't much better.  Again the sauce on the sandwich was tasteless.  The gyro meat was dry and poorly seasoned.  The fries were ok.  Will never go here again.  There are far better places in the area to get a gyro or falafel sandwich.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IhfiVcsldwjy01rDPIFomQ"
  },
  "A8i2Wdfgfx3HuWLBdgv6kw": {
    "date": "11/17/2016",
    "text": "This place has the best kebab and chicken wings ever! Really friendly all the food is super fresh and their hummus is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xbPhnvyCgLxl-8hSFmZ02g"
  },
  "BdHqynjXILfou7o8AX106g": {
    "date": "2/7/2016",
    "text": "Service was prompt and friendly. They have a decent menu. I ordered the beef/lamb gyro which as expected. My husband and I also shared a hummus plate and I tried some of his Turkish coffee, all of which tastes good. I will definitely come back here for a fresh, affordable lunch when I'm back in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ivLGVeFgHhVVcDd-KHphvA"
  },
  "RvsqAW5dEaploY1UWpAFzQ": {
    "date": "4/23/2015",
    "text": "I have traveled to turkey a few years back and fell in love with their cuisine and when I heard about this place I knew I had to try it. The service was phenomenal and the food was even better. I didn't have to wait and was seated immediately. I ordered the chicken gyro plate and it was just perfect. I really recommend this place to everyone because they definitely impressed me. If your looking for good food , relaxing atmosphere and amazing tea then this is the place for you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BhZLC2mK0eour12Vh8vJww",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BhZLC2mK0eour12Vh8vJww/o.jpg"
      }
    ],
    "user_id": "-kyltywcDs4lLnqLdvVP9g"
  },
  "3n7KKOv43U1_Wf8_mvsYyQ": {
    "date": "7/4/2017",
    "text": "This was a great place and was very reasonable - extra points for accomodating us on short notice and close to closing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "shX6jNikfw7KkyaShhLAsw"
  },
  "VrvELxcZm4WZoohdOxbupg": {
    "date": "1/20/2016",
    "text": "BEST falafel and gyros in the Phoenix area. This is our second time here, this time we brought my sister and her boyfriend. Both times we got a hummus appetizer, falafel appetizer and the beef gyro combo, one spicy and one regular. They got the beef gyro plate and the gyro burger. Everything was great. The gyro meat is seasoned and cooked perfectly; it's not dry or tough. The pita is very fresh and soft, the hummus has great flavor. The rice on the beef gyro plate was cooked perfectly and had great flavor. The falafel were fried perfectly and were very moist and flavorful inside. They have great Turkish coffee that is basically like human diesel fuel. You will not be disappointed",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kEQRZbj09HQe3nVwnZhJYQ"
  },
  "QT08wmNmw_0lg1oDZImKLA": {
    "date": "3/31/2016",
    "text": "Amazing food and great service. The family who serves the place are so polite and they remember my usual order so gives a feel of familiarity. And the kebabs are so juicy and tasty. One should definitely try this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XvLBr-9smbI0m_a7dXtB7w"
  },
  "6vTl86HTIllXfcx8Ov9VMQ": {
    "date": "1/3/2016",
    "text": "The chicken gyro was DELICIOUS. Seriously so good, I wish I lived close to this place for that alone. Hummus was also fantastic, but I wanted more than one pita, so next time I'll ask for extra. Baklava was ok, kind of a small serving. Free Turkish tea with check-in, which was good also! All-in-all, about $20-25 for 2 chicken gyros, hummus appetizer, and one piece of baklava.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "lCJ9RIOROC-RL2M8sYL2QA"
  },
  "XPFiYbw3GmlWwMk14KgqWA": {
    "date": "10/18/2014",
    "text": "As a response to the owner's reply,  please take responsibility for your employees actions rather than just saying \"it's not my fault\".  The reason I was upset when my Groupon was not honored is because I mentioned it BEFORE ordering. The server should have told me at that time it would not be accepted,  not after I ordered and ate food. This is bad business. But yes, the food was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "axVNobZSFGiCDpspTsi0mw"
  },
  "m9i2zvzVdQBOMJe8t_2ADA": {
    "date": "1/19/2016",
    "text": "TurkDish makes quite a delectable dish! The restaurant occupies a cozy little spot in a strip mall next to the Taekwondo building.  The menu consists of your standard Mediterranean fare with some pastries and Turkish coffee thrown into the mix. I decided on the vegetarian mix ($10.99) which includes rice, grape leaves, hummus, falafel, pita bread, salad, and tzatziki sauce. Quite a lot for a meal!  The hummus was my favorite of all the elements in the meal. It was smooth and creamy with a delicate light flavor. The falafel was light and crispy, and the salad was bright, colorful, with lots of veggies and a delightful vinaigrette. Even the rice was well seasoned. The grape leaves were a little too mushy for me but they had good acidic flavor.  I got my meal to go and it was well packaged.  Overall I'll go here again to try more dishes.",
    "rating": 4,
    "rated": {
      "funny": 10,
      "useful": 19,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "azaILvXAz9a2JnXKt74leQ",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Vegetarian mix to go",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/azaILvXAz9a2JnXKt74leQ/o.jpg"
      }
    ],
    "user_id": "DK57YibC5ShBmqQl97CKog"
  },
  "BGV5Y43mNQ7VNQB4uXtDBw": {
    "date": "1/18/2017",
    "text": "I try to stop by everytime I'm in phoenix. Love the food. It's obvious they care about there customers taste buds.   What I like - authentic turkish food - price is understandable - doesn't take long to come out of the over  What to keep in mind - it is defiantly not a high end restaurant - expect to dish out 7-12 bucks on average. - all the food is helal (which is good haha).  Hope I was able to give some insight...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YWKvBjPPAxo-ZYtKn4gfpg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YWKvBjPPAxo-ZYtKn4gfpg/o.jpg"
      }
    ],
    "user_id": "-tT35XT2Bm0IfrgxI2eulQ"
  },
  "JeqfjPIO1lvSPvwAbn3_1g": {
    "date": "12/18/2016",
    "text": "We came to this Turkish restaurant for our next dining excursion after reading a string of positive reviews on Yelp. Upon arrival, the modest and casual interior encompassed a front counter, TV, a few tables spread across the tiled floor, and cultural artifacts neatly arranged on the walls. The atmosphere was quiet and subdued, as we were the only customers in the restaurant during our visit.  The Ezme ($5.49) was made with spicy eggplant and a piece of pita cut into four small pieces. The eggplant had a smooth consistency and was spicy delicious. The appetizer was very tasty but the portion was small. There was also not enough pita bread to enjoy it all.  The Chicken Gyro Wrap ($5.49) came with tender chunks of chicken, lettuce, onion, tomato, and spicy tzatziki wrapped in-between a thick pita. The chicken was nicely seasoned, and the spicy tzatziki was a tasty anchor to accompany the secondary ingredients to brighten the wrap. The thick pita was not homemade, but held everything together well. It was a solid Gyro Wrap. I recommend it.   The Adana with Lamb ($9.99) came with one strip of ground lamb kofte with spicy seasoning, hummus and salad. Adana is usually flat, thick, and substantive, but I find the one here rather skinny and inadequate. Taste-wise, it was still juicy, spicy, and delicious, but the repetitive stingy portions got on our nerves after a while. The hummus was creamy and the salad was fresh to add texture. We don't need to eat big portions to get full, but in this case, we were still hungry after finishing the meal.  Turkish cuisine is widely considered as a social food, but our experience here hardly reflected those sensibilities. Service was not attentive, friendly, genuine, or generous. The way we were treated felt more like a business transaction than a home-style dining experience. Interested diners can expect good food, but a lack of love in the portion size and customer service. 2.5 stars for the skimpy dishes and an overall lackluster experience. We are a fan of the cuisine, but will not be coming back to support this local eatery.",
    "rating": 3,
    "rated": {
      "funny": 13,
      "useful": 32,
      "cool": 19
    },
    "photos": [
      {
        "img_id": "ohH6bmVS1xQafW3JxLlNUg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ohH6bmVS1xQafW3JxLlNUg/o.jpg"
      }
    ],
    "user_id": "0juzbrgcLHqobdK-OZAyiw"
  },
  "KgKwHY0_XK7IWUNJZ3O7KA": {
    "date": "6/2/2018",
    "text": "I am so glad I found the reviews for this place. There was nothing we didn't like and the plates from the kitchen looked just like they were supposed to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pn0bMP9sfRzG3lFhS-X23A"
  },
  "ldKCDYcP5hNT1ElhwKLdJw": {
    "date": "7/13/2018",
    "text": "This place is small, but the food is AMAZING!  Super fast friendly service, will be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tvTxkcTSyV80CegNjnMzSQ"
  },
  "Y4YVXIeG12LO3usRZVTnYA": {
    "date": "10/6/2018",
    "text": "Great service and delicious fresh food! Place was clean and the owner and his wife were super sweet.  Definitely recommend it! Oh and if you like Turkish coffee- this is the spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TKIsd1DtU8Z6-YYQRDutPQ"
  },
  "keVeSO9b-u0vMiIGx8W-XQ": {
    "date": "2/6/2019",
    "text": "The food here is simply and amazingly delicious, we ordered iskandar and chicken kebap with doner as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W7xK0XFdGh8n7yOQCtgPzA"
  },
  "nhmDK-6V9eGGeLV-SrjlZg": {
    "date": "1/4/2018",
    "text": "My friends from the Middle East recommended this place to me because it is a very tasty restaurant that has more traditionally prepared Turkish food. It definitely lived up to their word and more. I tried the Iskender and it was super delicious. The lamb was very tender and perfectly cooked. The red sauce with the yogurt was mouthwatering on top of the meat and sliced pita inside. We also enjoyed an order of some nice, crispy falafel as well as their perfectly seasoned hummus. Thank you for making my night with your delicious food-- keep it up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BH5TnqqyAzUdKNlr4Q87XQ",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Turkish Iskender",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BH5TnqqyAzUdKNlr4Q87XQ/o.jpg"
      }
    ],
    "user_id": "AuPCagEXC1pnGAI0LzLuWg"
  },
  "XF8WeWEeEGuyQ08DNauwWA": {
    "date": "3/16/2017",
    "text": "The gyro meat here comes in slice/chunk form which is a little different, but not overcooked like other places.  It's very moist and flavorful, not too salty. The rice is more of pilaf form (basmati would have been preferred) Nothing much with the salad.    Some others, the hummus here is pretty good along with the baba ganoush.  Both very flavorful and rich.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VFXKRVzEMbnsDcYFdwiiuA"
  },
  "DZ49btt1r-P8E0vCVPrPnQ": {
    "date": "12/28/2016",
    "text": "Picking up our to-go order. They gave me tea to drink while I waited for my order. Love the customer service as much as I love their delicious food!  My favorite meal here is the chicken kebab plate. We add the pita bread because it doesn't come with it. The hummus is creamy and delicious and the chicken tastes fresh and flavorful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9oi9u35J8ZL7VHbGygCURw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Gave me tea while I waited for my order.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9oi9u35J8ZL7VHbGygCURw/o.jpg"
      }
    ],
    "user_id": "c63qpbfn9_3IQuS7LLW7EQ"
  },
  "HYsoDWanaJ7pEFCeAlMIkA": {
    "date": "7/28/2018",
    "text": "The food was delicious and this was the most authentic food in the valley! The server was super nice! Definitely a 5 stars rating!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0oJa0UGRpnrEGpMNm4zXLw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0oJa0UGRpnrEGpMNm4zXLw/o.jpg"
      },
      {
        "img_id": "7J72mqFn6zcdFV0eBzxSBA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7J72mqFn6zcdFV0eBzxSBA/o.jpg"
      }
    ],
    "user_id": "oakZhpNmDg5JamTyOzKuFA"
  },
  "0fl8gFslMJiMoTykNRRA9w": {
    "date": "12/24/2017",
    "text": "This is my favorite place for babaganush and iskender kebab! Its delicious, never too crowded, and you get free tea at the end. Service is fantastic! I had never had turkish food before this, but it's amazing.   Make sure you ask for extra pita though, the babaganush to pita ratio is a bit off. Haha",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "znE6J6cHVOT9KGeLsKBrvA"
  },
  "OSEfrlnJ4UZC_b8lX_7_mQ": {
    "date": "11/14/2016",
    "text": "I went to this place for lunch driving Through Arizona. The place is big and has a lot of seating. There weren't many people there at the time. The food was good but the portions where really small and it was pricey. The service was good I think are waiter knew that we where from out of town. Overall it was a good I just recommend giving bigger portions.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "giKLEU-MaXmaERTl9RaOeg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/giKLEU-MaXmaERTl9RaOeg/o.jpg"
      },
      {
        "img_id": "JSzvnNdVogEcEU2_YU22eA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. More decor",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JSzvnNdVogEcEU2_YU22eA/o.jpg"
      },
      {
        "img_id": "XiJ96dlorrhE50YZb25DnA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Decor",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XiJ96dlorrhE50YZb25DnA/o.jpg"
      }
    ],
    "user_id": "I863eSlvhyP6Zjl5fi3ikw"
  },
  "X2irqOcvwBEI0VD2C-BTgA": {
    "date": "8/15/2015",
    "text": "This is definitely a sole proprietorship, home grow, family run business. Love that. The mom and pop that run it clearly have a passion for their business. We were one of two tables when we came in, one more couple came in while we were there. Here's my ratings:  Atmosphere: it's a pretty generic little strip mall place. I like that you can see into the kitchen. It's clean, spacious and basic. It's one of those places where you know the owners care more about the food than the decorating, not a bad thing.  Food: the food is good. I got a dish I normally wouldn't, small ground chicken patties with spices, rice and salad. The chicken was good, moist, tasty. Wouldn't be my first choice again, but that's on me, not them. The rice was probably the best I've ever had, seriously, rice! Weird right? Don't know if it was special Turkish rice, but it looked like white rice. It was delicious. The falafel was outstanding! It was in my top 3 falafel I've ever had. When we checked-in, we got a free Turkish tea. She gave us 2, very sweet. It was very good.  Service: the mom and pop were very genuine and attentive. The mom was very sweet. The pop was quiet and was not \"Mr. Happy and Social\", maybe due to a language barrier or something, but he was attentive and took good care of us. Clear they care about quality of food and service. For me, this is key.  Quality and Value: very clear the quality is high. The taste was authentic, clean, flavorful and obviously made with care, old school recipes and high quality ingredients. We ate 2 meals for about $20 and were both full and satisfied when we left. Quality and value are both very good.  Overall I'd definitely recommend stopping in if you're in the neighborhood or even making a reasonable special trip to try it. Service, taste, quality and value are really good. I'm not often interested in atmosphere and decorating, I'm into great food, supporting sole proprietorships, off the beaten path, worthy places and this is one. You won't go wrong giving them a shot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jHMoh4xBFcUkhbf1EnzbkA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Turkish tea :-)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jHMoh4xBFcUkhbf1EnzbkA/o.jpg"
      },
      {
        "img_id": "asw3xvWOsO-LSAmifsJT_w",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Looks good, right?",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/asw3xvWOsO-LSAmifsJT_w/o.jpg"
      }
    ],
    "user_id": "FWW0x5aoy-hFXALL5-mq5g"
  },
  "FT21PRz27D2E4-nk_5RkZw": {
    "date": "9/5/2017",
    "text": "If this place was closer to home, I would eat here every week. This may be the freshest Mediterranean food I have found in the valley of the sun. The falafel were perfectly prepared and cooked with such a bright green color inside that I couldn't believe (this is my test for fresh/well prepared falafel; crunch brown outside and green inside from all the fresh herbs). The vegetarian plate was a perfect combo of options. Pro tip: get the baba ganoush. So roasty, toasty, and smooth that I was tempted just to eat a double order with a spoon, but I was already filled with all those falefel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ei8w3z-1fBEmnHjgtJM-Jw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Vegetarian platter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ei8w3z-1fBEmnHjgtJM-Jw/o.jpg"
      },
      {
        "img_id": "CuYVLrIhTlhEfcByaFR4xQ",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CuYVLrIhTlhEfcByaFR4xQ/o.jpg"
      }
    ],
    "user_id": "Hyli6YWc-0PxRAerObzZIQ"
  },
  "oEYRwLvGT6s_EtnIIY1Ltg": {
    "date": "7/27/2018",
    "text": "This place was excellent. The staff is just hanging on to English, so it is very authentic. Food is super healthy. I should have taken a picture. My husband had the trout, I had the chicken shawarma, both very moist, perfectly cooked. Babaganush, humus, and pita were exceptional. Their chicken nuggets and fries looked good for people with kids who might not try Mediterranean. Finally, VERY reasonably priced!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZsXn0Bwi6FqyWhPr6SW4WQ"
  },
  "UYoaOxn4zA6eW29QOQaaag": {
    "date": "11/18/2017",
    "text": "Had the Iskender kebab and it was very good. Had the same dish in Istanbul and it was almost the same, very authentic Turkish food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6TipFZXbBl8FjJ_qWWna8g",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6TipFZXbBl8FjJ_qWWna8g/o.jpg"
      }
    ],
    "user_id": "T4y0-qbeenlTrTvY6icrwg"
  },
  "CedGVJ0W9mXORb4E_svhtg": {
    "date": "7/26/2017",
    "text": "This is rough giving such a low score. But here we go. I ordered the Gyro Philly meal to go.  Nothing was made from scratch. Fries were frozen, pita bread was frozen. Gyro meat was frozen, and to top it off the cheese was pulled from a pack of Sargiento. Truly blew me away for the scores recieved. Will not be returning",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RmIKuzE5PqsFbv08f3G1iQ"
  },
  "p4U_6bIvbmGQx0XuPbDziA": {
    "date": "8/30/2016",
    "text": "Perfect food, good prices. Recommend it I like the Mediterranean healthy food like hummus, falafel, olive oil...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "78nG-iNmHtJThY-hj-fXOg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/78nG-iNmHtJThY-hj-fXOg/o.jpg"
      },
      {
        "img_id": "y6qp91_cPFzpUkGswF4Rew",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Best food",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y6qp91_cPFzpUkGswF4Rew/o.jpg"
      }
    ],
    "user_id": "YVIafmXjgpLPIjCaSFQSbg"
  },
  "Jy8-E2qG4Byp7cGp9ShmPA": {
    "date": "12/29/2017",
    "text": "This is a good place to go for Turkish food. I  have made at least 5 visits to this place over the past year. Each time I had a similar experience which makes the place pretty consistent.  First of all, I lived in Turkey for 3 years and was totally immersed in the culture and food. Authentic Turkish food is among the best food in the Middle East. I found the food at this restaurant somewhat Americanized and crosses over into the popularity of Greek food.  As for value, I compare it with other places that serve Mediterranean food in the valley. I find this location significantly higher than its competitors. I paid over 20 dollars for a single meal compatible to what I pay 8-10 dollars at a competitors. Some competitors that I compare this place with are Haji Babas, Pita Express and Tasty Kebab. The owners and staff at this place are very friendly and welcoming. The atmosphere resembles a small dinner with scattered tables and a few booth-like settings. I would say it's a very casual place to eat but not a place to go for a quiet engagement. No privacy and all tables open to other patrons. Give this place a try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mfW2zFP3j9-AtHaWP45pPw"
  },
  "xSSlPTyB1mB2k8xg6KfvSA": {
    "date": "8/13/2015",
    "text": "Was in the area and decided to yelp. It was a great decision. The food here is so flavorful. It's just a little hole in the wall but it packs a punch. My mother said it was the best chicken schwerma she had even eaten. Though be aware that here it's called chicken gyro ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d-y1i_ope23D7rip05tYOQ"
  },
  "gqlIoCgTFZkIolc0LElNdg": {
    "date": "12/29/2014",
    "text": "Top food and a great value for the price. Hummus was super creamy and good, lamajun hands down one of the best I've had in the US.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hSYQAsy-2ht_O4xWH98oDQ"
  },
  "T7ohRLwRlHRUyl5HO17paw": {
    "date": "10/6/2015",
    "text": "We've been to this yummy hole in the wall, on Southeast corner of Rural and Ray in Tempe. Everything top notch. We had specifically Turkish stuff (which we've both eaten in Turkey, and love), although they have the usual Pan-Middle Eastern staples as well. We've ordered marvelous manti (dumplings), Lahmacun (\"Turkish pizza\"), cigarra borek (irresistable savory filled pastries), the best Middle Eastern lentil soup around. Their only available dessert at the moment was baklava but it was anything but routine. Turkish coffee: rich and satisfying. They have a large selection of specifically Turkish kebabs, which we intend to try next time. You can't get much Turkish in this neck of the woods, and I hope they make it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hOCOZCeUmCZmC1XCp8l8RA"
  },
  "QMuwteqxM2IBKw05SujSIw": {
    "date": "9/29/2015",
    "text": "Just found this place. Ordered the chicken kabobs with humus and pita and a Greek salad. The chicken was perfectly cooked and seasoned, fully cooked and moist. Not over cooked and dried out. The salad fresh and crunchy. Most of all the humus, light and delicate. I've only had it like this when it was homemade. Fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dF6RweJ-i3NeCMpIPWzWKQ"
  },
  "WhX-gsJydYIJG3wq8y4I8Q": {
    "date": "2/1/2015",
    "text": "We found this delightful unassuming restaurant tucked away in a shopping center in Chandler, Az across from the library. At first glance it looks like a take out restaurant but it is more than that.The gyros is wonderful, as is the hummus, and falafel. The owners provide wonderful Turkish hospitality! And you can have a sit down meal if you like.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qfir5UwFoAbCnNP-uEBkhw"
  },
  "8R13I6AI0xLuCW6fyjc9eA": {
    "date": "11/22/2014",
    "text": "Had a dinner catered from here!! The food was amazing - great hummus, pita, and all sorts of awesome middle-eastern food! YUM!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pBQxKQf9oYbcjGxczgElFw"
  },
  "SRtxRMg2d0eG3ZVfvLCrwA": {
    "date": "3/20/2015",
    "text": "Have been looking for a good Turkish restaurant for awhile so glad I finally found real authentic Turkish food!! Was superb, cant wait to come back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4n8pB1zNn4-LyrR8wpAR_g"
  },
  "5LfsJyUXrMruDDVeaiZn8Q": {
    "date": "11/25/2014",
    "text": "The owner took time out of his busy day to sit down at my table and describe each dish so I could make the best selection. I enjoyed everything I tried and would highly recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PKP36ulpM46aufDKUJvRhw"
  },
  "LXOtLXWaS-EqS2T6sccfrw": {
    "date": "2/26/2015",
    "text": "Kabobs are amazing. I can't wait to try their bakery (only open on Sunday I believe).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4IlBcP2vZaQzeBGY_j8SRQ"
  },
  "RGmrEFqM25UL0FDRSfccEA": {
    "date": "6/24/2015",
    "text": "This is a very authentic Turkish restaurant! I came here with a Turkish friend of mine; in fact, the restaurant was actually recommended to me by her. All of the quintessential Turkish staples are served here like lamb kofte! I had the Turkish pizza and a chicken dish here and found myself very contented by my dining experience here. The dining room area is spacious and there are also traditional Turkish drinks served here as well like Turkish tea and Turkish coffee. I can't wait to bring my Turkish boyfriend here because I am certain that he would validate the notable quality and the sheer authenticity of the food here. Hopefully, in the future, there will be a lot more Turkish restaurants in the Phoenix area. TurkDish, so far, is doing a commendable job of introducing Arizona to exotic Turkish cuisine. Istanbul would be proud. All in all, a great place to dine if you are looking for something different. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "27BMNuquQ-SoExE56gqs1Q"
  },
  "eVuW8yP7P3i-AESya8zvBQ": {
    "date": "3/19/2019",
    "text": "The food here is wonderful! We went with a native Turk and he reported that everything was authentic, including the gyro meat which they make in house. If you're looking for authentic delicious healthy Mediterranean food, look no further than here.  I had the lentil soup, (delicious)and I had a gyro salad.  Both were outstanding.  I was fortunate enough to spend three weeks in Turkey several years ago and realized that it is my most favorite food of all.   It is delicious, healthy and full of wonderful flavor. I highly recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F7jSg1dw-nzy-mMNW_pgEw"
  },
  "7sQ6ULfMldKDU4kFvL3Ptg": {
    "date": "6/19/2018",
    "text": "I have come here a number of times, sometimes taking my food to go, sometimes dining in, and every experience here has been so good.  Let me tell you about their vegetarian mix plate. You might look at it and think, \"I could do without the obligatory salad and the plain white rice\".... Well you would be wrong.   You must start with the salad, not to get it over with, but just because it's the perfect place to start... crisp romaine, a perfect mix of veggies and red cabbage, and this dressing that is herbaceous and balanced and perfectly seasoned.    Then you have to have a dolma. It melts in your mouth, the perfect bite of comfort after your salad.  Don't eat them all at once though, you will want to bring this back into the rotation later.  Then you have the main event, the falafel. It has that perfect, crispy/crackle-y exterior that makes a great falafel great. Now is when you really have to pay attention though, because you have pita, hummus, and falafel that need to be combined, but you have to make sure you don't run out of one of these things before the other. Put your cell phone away. Stay focused and portion out your falafel and pita like a real boy Pinocchio.  Now onto the rice. Any other restaurant would throw some rice and water together in a rice cooker and call it a day. But no, this stuff is seasoned and unassuming and delicious.   It's so simple and so satisfying. Every component is flawless. And I'm stuffed.   Also. Get the kunefe.   Also. They are super nice here and care about the quality of their food.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "shfUvQ_vwnvCgfYaB1gb1A"
  },
  "8XuON8OUDUNG85GbK5iL0Q": {
    "date": "10/21/2018",
    "text": "I tried traditional Turkish Pide with ground beef and mozzarella. It was really delicious. I strongly recommend. As far as I know there are other poses with mushroom and sudjuk. Definitely I'm gonna try them all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J3lNeqxfTRQiwxk5j00JFQ",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J3lNeqxfTRQiwxk5j00JFQ/o.jpg"
      }
    ],
    "user_id": "QSn29qDzeOktCLAmumfiTA"
  },
  "PntFSj09nRJuT-CRxgI1zg": {
    "date": "12/19/2017",
    "text": "I've been looking forward to trying this place and finally came in for lunch.   It's a pretty no-frills place with a takeout counter and dining room. One waiter was hustling around taking orders and bringing out the food.  I went with the doner plate and a salad and hummus as my sides.  The doner meat was tasty and the hummus went well with the nice, hot pitas I also ordered.  The menu leans heavily towards what I'd call fast, street food.  Doner, falafel, hummus, kebabs etc.  It would be nice if they had more time-intensive, intricate Turkish dishes.  You know, like the stuff a Turkish grandma would cook if a special guest was coming over for dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "S9Jw00eZHVj5_0sOM_C5Rg"
  },
  "OS722tDariH8o4bOT3UTYQ": {
    "date": "1/16/2018",
    "text": "Flavorless food  Alexander Kabab is not even relevant to what it should look and tastes like. Doner no flavor at all and dry ... lahamachin not too good !! :(  Disappointing !!! I though I can make it up with desserts , Konafa took 20 minutes to get ready .. it arrived a little burnt :( and soaked with the syrup , very watery !!  Not recommended ! Unless if you're too hungry",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iaPK048CfBiv5ezQG0B4Aw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iaPK048CfBiv5ezQG0B4Aw/o.jpg"
      }
    ],
    "user_id": "SUMhNQVCB_JGY7lkdHHTlQ"
  },
  "62U11o_7mTpGGFOVJinpzg": {
    "date": "4/13/2019",
    "text": "The kunafe is amazing!! Highly recommend! Great food and fast service for takeout. I am going  to Turkey later this year and can't wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dbAn20d1JVGZkVEVLTk09g"
  },
  "F7r2XJhYEFfRE1VN4fwUww": {
    "date": "6/30/2018",
    "text": "Oh, how I missed Turkish food!! I liked it, felt like eating in a restaurant in Istanbul again!  I had the lentils soup, the chicken shawarma and the shepard salad. Wish they had the authentic Ayran, but the one they have is still good. The salad was a bit different than what I ate in Turkey but I still liked it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DfThUT2hE0h9ZjjpMkpOkw"
  },
  "P95jSp_kF1ohwQZdqgRTyA": {
    "date": "3/15/2019",
    "text": "First time at this place. Customer service was not very welcoming.  Food was good but not enough to want to come back especially because service was poor. They just look mad that you walked in. On a good note, the establishment looks clean and well kept. Wish I could give more positive feedback.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y2d9B6yp7fMetb5uDJZnww"
  },
  "FNEL83lEE436w8tSPWRApQ": {
    "date": "5/15/2019",
    "text": "The food's a 5. If you're big into ambiance this isn't the spot for you. Just order the donor kebab plate and thank me later.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ucw1zfcz44XX4yFVc9enQ"
  },
  "TWVe-WQghi-MlxUArkXMdg": {
    "date": "9/10/2016",
    "text": "I told my fiance that I wanted to try somewhere new for dinner and he came up with Turkdish via Yelp search. We were both pretty hungry so we got the Ezme appetizer to share and the Chicken Gyros plate with rice & hummus as well as the Gyros sandwich combo which came with fries & a drink.  First, the appetizer was different than what I expected because the eggplant was served cold with a warm pita. For the first couple of bites, I was a bit confused as to wether or not I liked that it was cold, but after having more I really appreciated the flavor of the eggplant with the spices. It was a bit on the spicier side which we liked. The pita that came with it was amazing - served hot and was super soft and doughy/fluffy. I would definitely recommend the Ezme!  I had gotten the Chicken Gyros plate. The rice & hummus with pita were definitely my favorite components. I am picky about hummus, but I liked the one here as it was very smooth and had good flavor (not too lemon-y). I didn't like the Chicken Gyros as much as I was hoping I would.. I'm not sure exactly what it was, but while garlic sauce did make it better, I would opt to get something different next time.  Our server (who we thought was also the owner) asked my fiance if he liked spicy food. Since my fiance said yes, he was brought out the spicy version of the Gyros sandwich which was quite tasty. I only snagged a couple of bites but based on those would be willing to get this item. Let's stop a minute to talk about the fries they serve here though. Super thick-cut steak-style, fried to a perfect crunch! So freaking good. It's worth getting a combo just for those as the side!!  Overall, we were pleased with our experience. The service was good as was the food. I know for next time that we definitely need to order an extra side of fries! We will be back.",
    "rating": 4,
    "rated": {
      "funny": 12,
      "useful": 23,
      "cool": 18
    },
    "photos": [
      {
        "img_id": "Ik5lh_ngkErXq5aKSCufPA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Chicken Gyros with Rice and Hummus.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ik5lh_ngkErXq5aKSCufPA/o.jpg"
      },
      {
        "img_id": "hudE4cFKCyjgsu0Oi8yG2Q",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Ezme With Pita (appetizer).",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hudE4cFKCyjgsu0Oi8yG2Q/o.jpg"
      }
    ],
    "user_id": "CjhTdmN6qWEKC7Zo6qadow"
  },
  "Rs217jDHf6KUYeuY9_phUA": {
    "date": "3/28/2018",
    "text": "Donner was good.  Rice was rice.  Salad was salad.  Hummus was fair...not the best, not the worst.    Overall ok.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lyj3OLJOGkqnjq2ZApa1lg"
  },
  "kxd293cNZxYn3R2ebwEzmg": {
    "date": "5/5/2018",
    "text": "This place is very casual and chill. Tastes like home food which is extremely important and awesome. The customer service is right on the dot, it is there but at the same time not every minute coming to interrupt your conversation. I would really recommend it. And get the Adana Kabab with sides of hummus and baba ghanoush.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MfRJ9k39Rl0EK3qyozPX9g"
  },
  "DSAxJ1HHCk0ysKIgklt30A": {
    "date": "2/4/2019",
    "text": "A place that takes me back to Istanbul,   The food is authentic and delicious, the variety in the menu has something for everyone.   The specially blended tea is something to look forward to after every meal. If you have saved some room for the freshly made Kenafah dessert you will definitely not regret it.   To top it off, Unal, his wife (owners) and their team make you feel like you are family always welcoming you with a smile and recommendation for what to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "olkzQPEy7qZSd2bXuALyTw"
  },
  "_F4GlfPHtfnddOPhS3sOEg": {
    "date": "5/12/2019",
    "text": "I was a bit hesitant to try at first because I've had so many disappointing experiences with Middle Eastern places in the East Valley. But I'm glad I gave TurkDish a chance. The food is great. Shared the Iskander kebab and vegetarian mix, with kunefe for dessert. Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xigcsix8wEumF5AinljRiw"
  },
  "hrmU5GCLL1ywNNQGY1nhWQ": {
    "date": "5/18/2019",
    "text": "Very, very, good food and the staff is very nice.  We will be coming back lots since it is so near our place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jZQy2TMXVOkEZpBKVrnJYw"
  },
  "1rCWjIyu5ex2bZ1sc51uBQ": {
    "date": "7/7/2017",
    "text": "Casual and authentic food. Service and food delivery was quick - granted I was the only one in the restaurant because of the time of day I was there.  The falafels were perfect. Not oily, fresh, and crispy. Had the falafel plate with salad and ezme and asked for anything spicy on the side. He hooked me up with two different sauces. Also ordered a side of pita (the platters don't come with it). For everything it was just over $10.   I would definitely came back here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "z0icHOu9f9WmBiWPl23MKA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Falafel platter with house salad, ezme, and side order of pita.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z0icHOu9f9WmBiWPl23MKA/o.jpg"
      }
    ],
    "user_id": "PVGVaZQLCLh28rLykh6CSQ"
  },
  "7StSZik34Js4Xx0pFmT79g": {
    "date": "4/17/2019",
    "text": "My wife and I have been eating here for a couple of years. The food is delicious. The plain decor doesn't bother me a bit. Phoenix is full of these little restaurants hidden in nondescript strip malls. For me it's about the quality of the food and the value; TurkDish delivers on both --consistently. I love the veggie platter. The Urfa kebabs are great. Even love the homemade salad dressing. I haven't had a bad meal here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sutGkkA37TZMVsVUZykZaw"
  },
  "3m2g_vrLgTYAIpvVdFw41w": {
    "date": "10/18/2018",
    "text": "I was traveling from out of the area and just took a chance coming here. It was probably the best discovery I've made yet. Truly homemade food, the best Turkish in all of America. Everything from the tea, to Baklava to the appetizers to the entree. Meat quality is excellent. Service with a smile. If you're looking for real food, give it a try",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hN2gRiMKrinZRZEg677LQA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hN2gRiMKrinZRZEg677LQA/o.jpg"
      },
      {
        "img_id": "z_6A9lICf7UcyuqcSAMLZw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z_6A9lICf7UcyuqcSAMLZw/o.jpg"
      }
    ],
    "user_id": "iwZxeCCwV6jAA2DB_DMBKQ"
  },
  "S7AgMPRNbkXPgP94A1x1Ow": {
    "date": "3/26/2019",
    "text": "Food was pretty good the one time we visited. The place was empty. We were polite and respectful and dressed modestly. Only two stars because the server (manager/owner?) treated us poorly, as if we were a great inconvenience. He made us quite uncomfortable with what seemed like an attitude of contempt. Maybe this place is ok for takeout, but I wouldn't eat there again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d5oPmQDI8UfLnjsd9HJJCw"
  },
  "Qf_ubU-TIY-6hElkjiGCmw": {
    "date": "10/19/2018",
    "text": "We visit a Turkish restaurant everytime we travel. This nice restaurant was a real surprise. Most of the time we find the food average. But the food at this place is really great. We had the meze platter, lahmacun, iskender kebap and soup. The grapleaves dolma was so good that we ordered extra. lahmacun was perfect, way better than I had some in Turkey. Reasonable prices and fast friendly service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QUEu3gMALa8pcSW_UARapA"
  },
  "5SUB15oD6ALDwMdtUPa02Q": {
    "date": "4/1/2016",
    "text": "First time coming to this restaurant and I will definitely be back. The kitchen was spotless. I had the beef gyro with hummus, pita and salad. Everything was very fresh. The salad dressing was very refreshing. It was made with olive oil, lemon juice and vinegar. Overall great experience and I will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8A4YA2rdbqMUgKkUjkoQDA"
  },
  "vuUWBQ0QelaSYGhxiF4YPw": {
    "date": "3/16/2015",
    "text": "Nice place close to Intel and makes it easier to try out ethnic food on time crunch days...service could be better...food selection is typical...i still like ZK grill off 48th the best for quality of food....nice cozy place tucked in a shopping area...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lriO569ko0MtlZQ6Ddzn7g"
  },
  "AxVW9jVZ6D8e_PGUsitNRg": {
    "date": "11/22/2014",
    "text": "Delicious food. Everything was great. After having their catering I'm excited to visit the restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mDGn--BYKTPw9iV9Tx4JVg"
  },
  "s3KytffpFQwQBZLHQsbiKg": {
    "date": "11/22/2014",
    "text": "Love love love it. Finally a Turkish restaurant that serves the dish my Turkish grandmother made for me. I'll go back tomorrow for the Simit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVkpM_9GnjY6M0LP2yIt-A"
  },
  "UqgG_tYmZ-Nrbfee8Fiocg": {
    "date": "9/30/2016",
    "text": "Excellent, authentic Turkish food delivered promptly.  The falafels were out of this world as was the Ezme (eggplant dish). We ordered it twice, once cold, once warm and we preferred the warm for our palette. The lamb kabobs we moist, cooked perfectly and melted in your mouth. Very dis we ordered was out of this world. I would give this place ten stars if I could.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZigS1ZtTwAo7f5FOTTJYdA"
  },
  "ZfBeDmp12ayQ3Y-0bQTGTQ": {
    "date": "6/5/2015",
    "text": "Great food. Hummus was one of the better ones that i have had in Phoenix. Had chicken kebob which was juicy and well made. Salad was great as well.  The owner even offered free Turkish tea which was a joy to have.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QZSAYlze3t-zwwRXi1OpOQ"
  },
  "TEAYyxNXB0YaASi20vvGsA": {
    "date": "9/25/2016",
    "text": "The food is always great and the owners are very kind. It's clear they take great pride in their business. Ask to try the Turkish tea. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tRtcisJiA_5g5sbwPkl5IA"
  },
  "0DB57HjSz2cgKDrBNtFxVw": {
    "date": "9/10/2015",
    "text": "I just tried the falafel sandwich at TURKdISH and it's DELICIOUS! Quaint atmosphere, great management, would definitely recommend to friends! I would have taken a picture of the falafel, but it tasted too good and I ate it :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqGh4fjOOOUBxjyBPa23Tw"
  },
  "0qlsISq2mGBALPWCHZj6oQ": {
    "date": "7/7/2016",
    "text": "Awesome food!! The service is great too, the prices are just perfect for the quantity of the food, the quality is amazing. I most definitely most recommend it. Their chicken gyro sandwich (spicy) one is really good, a must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OOVzGyuG30cXgPoN-00isw"
  },
  "Z52ji-5XR3wZQwqym04GAw": {
    "date": "4/23/2015",
    "text": "This is the best food I've eaten I had the chicken kabob plate and it melted in my mouth the flavors were out of this world and the service is amazing this is the best place ever I'm definitely coming back multiple times.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ilySfS-QJJffUV9cIhAfEw"
  },
  "Rx8rdFOIKIVZ7xGjFpO09w": {
    "date": "8/23/2016",
    "text": "If you miss the 'lahmacun', so Turkdish is your restaurant. it is really great to remember the good all days!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KNIXNzHdSFnajgz_KQMqlw"
  },
  "nag3ZydIsCNyFc6rHATDSA": {
    "date": "5/27/2016",
    "text": "I visited for the first time today. The owner was helpful in describing the menu items and even tipping me off that I need to mix the yogurt with the rest of the dish. The Iskender Kabob and Turkish Tea were both outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RkyN0zrOfXQZparLSJbY1Q"
  },
  "7l1KqGZqfOshJZ4EWzPYDA": {
    "date": "4/29/2016",
    "text": "We gave this restaurant a try and probably had high expectations due to the reviews. We were not too happy with the food. It's not the best it's just okay. Chicken had an after taste that didn't seem right. We won't be going back. They need to keep newer spicy sauce bottles because our table had an expired bottle since the top of the sauce had a brown layer. My soda tasted funny so I checked the expiry date and this was also expired in June 2015, almost a year ago!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ww8usyt1SKlMd8cCsYDYOw"
  },
  "yh1qI9zBoqYmiD8Knc7cDw": {
    "date": "11/23/2014",
    "text": "Had the opportunity to experience their food thru a catered event. As soon as I saw the labels of each dish, I was super excited - this was my kind of food!  Tasty, delicious, unique food that you don't get the chance to experience in a sea of chain restaurants.  Check them out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wI1hQGye9EicBK6mx7C-9Q"
  },
  "vTevtQIfySJKjqRb4xnRqQ": {
    "date": "11/22/2014",
    "text": "I had a wonderfully catered dinner this evening and now, 4 hours later, I'm craving it again.  Should have filled some doggy bags.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BqgvzZkDio5Zm888azti9A"
  },
  "VFPHUV2lYpAzM8baJau85A": {
    "date": "2/15/2015",
    "text": "I came all the way from Tucson for the lahmacun and I will be back for more, for sure! Next up on my list is the cheeseburger!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QPLvCtD1j9U7or2DBudwHQ"
  },
  "p5r8iJfjyoztF2OllPBBhg": {
    "date": "10/14/2015",
    "text": "Good place overall but just not quite a 4 star. Order at counter type place, in an older strip mall. Food was good but not memorable. Most folks I ate with thought it was just ok as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wE-EJtWoLAZJSKDDDC368Q"
  },
  "Sb_JUBJWAx9h6J604JwnbA": {
    "date": "12/6/2014",
    "text": "Very tasty, fair prices, and awesome hummus! This place is legit. I highly recommend them. Lamb is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "svXUqqPuJkU0719PGrnfyA"
  },
  "mltMh0kSLoq_PB9Kgo20sA": {
    "date": "8/7/2015",
    "text": "The food is amazing, and the owner is so kind. Everything was served quickly and piping hot. I wish I could take a picture of the chicken kabob plate because it looked like it should have costed at least 15 dollars, but it was less than 10! Would definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ggcNbu_GpNjqtbIwcz-tdA"
  },
  "Cg9E5Yg4avK_Wbzd2kH6Aw": {
    "date": "2/11/2016",
    "text": "I love this place. I am somewhat new to Mediterranean and Turkish food but this place is truly phenomenal and very reasonably priced I've been there twice and have not been let down and plan on going again and bringing friends. The staff is very friendly and very helpful with those of us that don't know a lot about the cuisine and the hot Turkish tea that comes after the meal is a great way to end the experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hdbjzCmQJ47TLqe-M-hYtg"
  },
  "hkQa7vf-UXMCxtvTe-tAJg": {
    "date": "4/25/2019",
    "text": "Had the spicy lamb with salad and rice. She had the gyro dinner.  The owner said, he likes to see plates all empty.  Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IVhrTDL4u_hDyhzHzLU1vQ"
  },
  "1Vox2PAGWwqDl4jU5R-nJg": {
    "date": "7/7/2019",
    "text": "It was great.  I got a kabob mix plate with the spicy eggplant.  The quality was great---the meat was cooked perfectly.  The rice was amazing, I think they use jasmine rice instead of basmati.  The bread was great and the eggplant was delicious.  I got mine to go and it was a homerun.  Definitely worth trying.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MkZSJduovr2SCyQS-2VtmA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MkZSJduovr2SCyQS-2VtmA/o.jpg"
      }
    ],
    "user_id": "4H6IMcL8DeS-YBN0Jp00gQ"
  },
  "DeufqPqDg05PdXDgm4Cchg": {
    "date": "9/17/2019",
    "text": "We ate iskender kebab However it was not Turkish kebab. Generally Turkish food are very very delicious but the restaurant can not do Turkish food. I think They only use the Turkish and mediterranean name. In addition the restaurant's food are very bad. Also the restaurant smells very bad. Do not try it :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nerm7prNUCU_Sb8UN7Z8TA"
  },
  "onenURGyCQ742E_qe9eDVA": {
    "date": "7/31/2019",
    "text": "TurkDish is as Authentic as you can get maybe even better than in Turkey. This family run restaurant should not be in Chandler it's under valued and hidden from a major Metropolitan city. If this restaurant were in San Diego on any beach area it would be packed day and night round the clock. I've eaten here the past 2 years almost bimonthly and it's worth the trip from anywhere in the Phoenix area. The food is Authentic home styled meals, from the Lentil Soup ( Red Lentil )$4.49 (server hot every time) and worth twice the price and packed with flavors your mouth can really enjoy. Then my favorite meal is Urfa Kebab ( Mild Lamb ) $10.99 always juicy and delicious never over cooked. You really don't want to leave as the food is so good! Don't just take my word for it, try it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Rt4rUHCxfs4tqefX1CgVAg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Rt4rUHCxfs4tqefX1CgVAg/o.jpg"
      },
      {
        "img_id": "TQ_WnzTp9r4OB9186Rw91A",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TQ_WnzTp9r4OB9186Rw91A/o.jpg"
      },
      {
        "img_id": "nTPbYbT2ql9EnOHVEy328w",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nTPbYbT2ql9EnOHVEy328w/o.jpg"
      }
    ],
    "user_id": "S4wDDKjMoUWhZrxCIamHrA"
  },
  "8ARNBEpKIrxAct-0QQipgA": {
    "date": "8/16/2019",
    "text": "I had an absolutely fabulous meal at TurkDish for lunch!  Chicken Shawarma, Beef Kofte, Hummus, Pita, Rice, and a salad....all I can say is wow!  Stop by and give TurkDish a chance...you won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m1SC4n0zCodg47x9qsc5YA"
  },
  "-Cxjt3BCm60xmgs8U7nqjw": {
    "date": "9/10/2019",
    "text": "Yikes! Not good by my stretch of he imagination. Avoid at all costs.....unless u like soggy dishwater on a plate.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FqKy0_LyZvnWYJBI2wLaSA"
  },
  "h2PR4rUaDAICAnMsvlYb9g": {
    "date": "2/16/2019",
    "text": "Pros: kunafe is amazing. Cons: plate sizes are small, iskender and doner definitely were the smallest I saw in Turkish restaurants  Chicken shawarma was ok, hot tea was fresh, even though they are a bit stingy on refilling it, not the Turkish generosity I am used to.  Lentil soup was ok, size was ok. We ordered shakahouka as an appetizer, was good too.  So mixed feelings. Overall value for the money is not high specially that the service is ok but not exce",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1fAIHc_SUJvfCyYxNhYKeg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Turkish tea",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1fAIHc_SUJvfCyYxNhYKeg/o.jpg"
      }
    ],
    "user_id": "YSlELYJ3hyt41gj-3acKJg"
  },
  "vYwoNMLS-gOZB8RITjwn1g": {
    "date": "6/14/2019",
    "text": "I was referred here by a Turkish friend and I very much enjoyed the food. I had a gyro, chicken burger, and eggplant. All were very good and tasty. The food is somewhat similar to Greek food and this makes sense as the two countries are in close proximity.  TurkDish has a convenient location with good service. They do have a large flat screen tv in the restaurant as well. I  will be back to test out more dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GCJaTWN6Hs9x7RGFpAVqPw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GCJaTWN6Hs9x7RGFpAVqPw/o.jpg"
      },
      {
        "img_id": "2cAyAqEifYhPxRJPySuW8Q",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2cAyAqEifYhPxRJPySuW8Q/o.jpg"
      }
    ],
    "user_id": "BuoeBRpUhNZud9LPycrMWw"
  },
  "iqCX2vDCecz4vXwptjO8LQ": {
    "date": "5/31/2019",
    "text": "The best Turkish food I've had in Phoenix metro area! Great options for vegans and vegetarians! I wish they had the stuffed breads in vegetarian!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6olRLg5bqAs7Tj1dBdA_nQ"
  },
  "XPxqZJH8_aIRT31EhsPGxQ": {
    "date": "6/30/2018",
    "text": "Little local place, close to home.  Located in a strip mall and a very unassuming place for sure!  We wanted something different for dinner and the soon-to-be wife wanted vegetarian so we yelped and this place came up.    I had the gyro with beef and a side of the pita and babaganush.  She had the vegetarian mix plate.  Everything was so delicious!  The rice...yes, others have written about the rice as well...is so flavorful.  Not sure what type of seasonings it has but it is not just plain ole rice!  The babaganush was creamy and tasty and the pita was soft, warm, and just perfect.  The gyro was very good...I've actually had a better yogurt sauce, it really didn't have a lot of flavor.  The falafel was da bomb!  They are so crispy on the outside and so tender and moist on the inside.  Will definitely get these again!  And the grape leaves had an excellent tasting filling.  They were tender and just so good!  The place is very plain in decor and there were only a few other people when we were there.  We will definitely go back and try some other things!  (photos to follow!)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m1hh7pNYO7qMJcueiBwD_w"
  },
  "z4qecUp2X3IzUvewEI5mlw": {
    "date": "4/9/2019",
    "text": "An affordable slice of yum! We went in for lunch and found the food fresh, delicious, and inexpensive.  I managed a quick photo of my bowl of red lentil soup before devouring it. Well, most of it. It was so filling! I do believe I've found my new comfort food. My husband had the spicy gyro. Fantastic. Truly spicy, which he loved. We're going again soon for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g7Ytanm0S4NtcUJ14dFwLA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Red lentil soup with pita",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g7Ytanm0S4NtcUJ14dFwLA/o.jpg"
      }
    ],
    "user_id": "nwem4ENTX13VG4ATzQrsXw"
  },
  "Adtw_bkcCZ6XnOwkU1Gr1g": {
    "date": "12/15/2018",
    "text": "Came here with family. Excellent very tasty food. Manti (raviolis) are soooo good. Kids had chicken kabab, chicken and beef shawarma. Lentil soup is amazing as well.  The service is amazing and very attentive. The owner came and explained everything about menu. Great place to eat. Very clean too. Loved the service, food, and place - definitely placing this on my \"places to have lunch at\" list!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "40APUB4YvAE0PMcEo43nNg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/40APUB4YvAE0PMcEo43nNg/o.jpg"
      }
    ],
    "user_id": "k8bGLAajYC0VAwHSbbFG6A"
  },
  "AWJI_hmaY1eqooj86wmLhA": {
    "date": "6/28/2019",
    "text": "Fresh, tasty, and I'll definitely be back. The online ordering is easy and my food was ready on arrival and travelled well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8tx6_XHcx-shBVPPZ8xmg"
  },
  "m1guGGjq0SSwtNGPmS0c6w": {
    "date": "4/20/2018",
    "text": "I'm scratching my head trying to figure out why anyone would think this place is amazing. It's a little hole in the wall that is for quick casual eats or take out. The food is as lackluster as it gets and was disappointing.   FOOD: Pita looked and tasted store bought. It was so bad that I couldn't eat it. The pita had a weird taste and texture, not authentic at all. I love a real homemade pita and this was not it.   The falafel was flat and as hard as rock not to mention flavorless and dry. Extremely disappointing.   The humus was fine. Not sure if it's homemade or not. It didn't wow me but wasn't bad. The hummus was the only part of the meal I liked.  As someone else wrote, rice is rice so not much to say there. It was not flavored or interesting. I would say the same about the salad except I liked the olives since they weren't the super salty Kalamata olives.   I ordered Baklava but they didn't have any which was disappointing. They substituted with a cake slice that had a cream cheese frosting. Not a good substitute for baklava.  Overall I'd say the meal was meh. As much as I like to support locally owned establishments I wouldn't return nor recommend and this is coming from someone who is part Turkish and has eaten many authentic meals.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ohAOR3uiHO2-3TcPrOLEVw"
  },
  "4qbJQX4LOIVBDZZBn8izyQ": {
    "date": "4/4/2019",
    "text": "Great service! Very good food! Super yumm deserts ! It's easy to order take outs I wouldn't call it a restaurant, it has very simple decor, but I come here for their authentic Turkish food . The owner is a very nice woman. She gives me  Turkish tea at no charge when I am waiting for my order to be done",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eaPDqWNYR2A8-EHgiwojjg"
  },
  "JdHCgbziKUXcMneOcXuHiA": {
    "date": "9/23/2017",
    "text": "I love Turkish food. I always have since I visited Turkey as a kid. So for me to find such an amazing Turkish restaurant right here in Arizona is just great!!   I've had TurkDish bookmarked on Yelp for a while but I was hesitating to try it because it was a bit of a drive to get there. Yesterday, we were already pretty close to the area so we finally decided to try it.   The restaurant is small and cozy but warm and inviting. They have a tv were they play Turkish programs and yesterday, it was a Turkish cooking program that was showing some of their best dishes!   The restaurant's menu has some of my favorite Turkish dishes. Iskander kabab is my number 1 dish so I ordered it. I recommended the Manti to my husband. Before we finished ordering, we were recommended the Lahmajun which is the Turkish version of our Lebanese meat pie (lahm b Ajeen).   The food came out pretty quick. So fresh and delicious, I was so happy! I don't know if there are any other Turkish restaurants in town but this one is now my favorite!   Before we paid we were asked if we'd like to have some Turkish tea, so we decided yeah why not. We also were asked if we'd like to have dessert and we are so so glad we said yes to Kunafa. I have not had Kunafa for such a long time and this was absolutely delicious!! It was cooked fresh so it took about it 20 minutes to come out but it was so worth the wait.   Our bill for everything was about $36. Not too bad. I just wish their dishes was slightly bigger coz for such great food, small dishes are just not enough!!   Can't wait to go back again and try more of their great food!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "8iUJ4isXY88IGQ4JrCkydQ",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Freshly made Kunafa - you have to wait 20 min for it :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8iUJ4isXY88IGQ4JrCkydQ/o.jpg"
      },
      {
        "img_id": "rLeHsXDbjAVvcDfr_TxArA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Turkish tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rLeHsXDbjAVvcDfr_TxArA/o.jpg"
      },
      {
        "img_id": "t_svoJ_ktmZWH2IqrEyShw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Mante",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t_svoJ_ktmZWH2IqrEyShw/o.jpg"
      }
    ],
    "user_id": "L4dg-hA4Ek0M9sSBMJCqWg"
  },
  "n2wu03IHYhMqVujyGZ2qoQ": {
    "date": "5/26/2019",
    "text": "Food was solid. We got chicken sandwich and doner sandwich. The side of rice was very tasty. I'd come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fqyqcMjQ18wMJ0rhcXjeTw"
  },
  "a1JfzpWCtnuF-JaztUc0ww": {
    "date": "3/25/2018",
    "text": "Mediterranean, Middle Eastern, and even Turkish cuisine are foods with which I have some familiarity with.  In fact I would argue a majority of the valley's so called Mediterranean or Mediterranean-Inspired restaurants contain elements of Middle Eastern and Turkish influence.  Perfect example:  Baklava.  An iconic dessert dish invented in the Ottoman Empire (now present day Turkey) which you can find at most any Mediterranean food spot.  Or how about Doner Kebab?  Also Turkish in origin, but with variations available in almost every corner of the globe.  But despite my familiarity with these cuisines, I knew there had to be more to Turkish food than what I could find at a local Pita Jungle or any of the numerous other Pan-Middle Eastern restaurants in the valley.  Thus why I had TurkDish in Chandler bookmarked on my Yelp account.  A Turkish menu that goes beyond the kebabs and the baklava (though they certainly have that too).  I happened to be in the neighborhood on a Sunday around lunchtime, so I jumped at the opportunity.  You'll find TurkDish embedded in a quasi empty strip center on the southeast corner of Ray and Rural Roads in Chandler.  The restaurant is easy to miss as its footprint is quite small.  The interior seats maybe 30 or so in a somewhat bland no frills space.  There's some paintings of Istanbul, Ankara, and other points throughout Turkey as well as some relics from the Ottoman days on the wall.  But the setup is otherwise pretty unassuming.  The entire staff is from Turkey (or at least the staff on hand today), and the menu delves much deeper into the finer points of Turkish cuisine than you're likely to find elsewhere in the valley.  While I'm confident the kebabs and the baklava are good here (fellow Yelpers appear to confirm this), I decided to go outside the box for lunch.  For my starter, I went with their Sigara Borek.  Layers of thin filo dough are topped with cheese, parsley, and seasonings and then rolled into taquito form (or cigar form if you will) and deep fried.  The starter comes with 4 to a plate.  The light flakiness of the filo dough compliments a light but complex texture of the cheese and spices inside.  Sharable, but plenty light enough for one as well.  And quite tasty.  Now then for the main event.  There's plenty of options for kebabs, falafel, salads, and even fried chicken items on the menu.  But for me I went with a dish most Americans have probably never heard of.  Manti is Turkey's own version of ravioli.  Tons of tiny dumplings full of minced beef are boiled until tender, then covered in tomato sauce and garlic yogurt.  You also have the option to sprinkle some dried mint on top if you want (and I did).  The dumplings themselves certainly have the texture of ravioli you'd expect, but the sauce and portion of the meat make this a much lighter, cleaner version than your Italian brethren would make.  The yogurt in particular is a nice touch, helping to mellow the flavors while still giving the ravioli extra depth.  For the big finish, I did not order baklava.  Oh no.  I went with a popular Turkish dessert that I've not yet seen any other Mediterranean or Middle Eastern restaurant in town offer other than here.  Like Baklava however, Kunefe is a dessert of layers.  In this case, the bottom layer is shredded filo dough, the second layer is sweet cheese, followed by another layer of shredded filo dough, followed by layer of ground pistachios.  And to top it all off, they drench this dessert in a syrup of sugar and water.  From start to finish, this dessert takes the kitchen at least 20 minutes to make from scratch.  But from my experience, its more than worth the wait.  A masterpiece dessert with multiple levels of sweetness along with a slightly crunchy texture of the dough and pistachios.  TurkDish doesn't serve theirs with vanilla ice cream on top as is often the case in Turkey.  But if you're getting this dessert to go, a dollop of vanilla on top will likely take this into the stratosphere for you.  And at the end of my meal, a bonus from the manager who served me a glass of piping hot Turkish Black Tea on the house.  Tesekkur ederim! (That means thank you in Turkish, FYI).  Total cost for the meal, tax, and tip came to $27.  Can't beat the prices here as almost all of their menu items are $10 or less.  The staff were extremely kind and welcoming throughout (the language barrier was a little bit of a challenge at times, but just be patient).  The place doesn't look like much, but the food is True Turkish tradition and a more in depth taste of the former Ottoman Empire than you're likely to find anywhere else in the valley.  And the food is 100% Halal for those of you wondering.  I'll be back for the baklava and kebabs of course, but just know that even the rare find menu items here are worth the exploration.  After all, food exploration is all part of being a good Yelper, is it not?",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 11,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "qG6F8OXD1Oj1L3k3tIZgSg",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Kunefe",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qG6F8OXD1Oj1L3k3tIZgSg/o.jpg"
      },
      {
        "img_id": "LJJEWhqF-RE-JGt5YcrozA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Manti",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LJJEWhqF-RE-JGt5YcrozA/o.jpg"
      },
      {
        "img_id": "cRVELRKOIgYYx5pZd-FJGw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Sigara Borek",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cRVELRKOIgYYx5pZd-FJGw/o.jpg"
      }
    ],
    "user_id": "WMMI5Q4Rmm1Rqdu0jOvyhQ"
  },
  "ivzCdLSeUgrxgJoS2njGNw": {
    "date": "5/7/2018",
    "text": "This place is considered as halal restaurant. I believe the food is from Costco, they sell halal food, or restaurant depot.  The food is good. I tried the beef shawarma wrap, was tasty. The kanafa was really good. I would recommend that for a dessert.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q1RqRSBVZA8NTcLQvo5QfA"
  },
  "vDweXNyoKDaJ7bmCJpqP5Q": {
    "date": "4/4/2019",
    "text": "My earlier review was just based on that day. I am still regular to this place and their food is delicious as always. And service is good too. Very friendly staff and welcoming.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1TH8qKUkaVp9zY5vpBE3nQ"
  },
  "F2jetMcHpdbfqbGQXbVCAg": {
    "date": "8/22/2015",
    "text": "New to the area, read the YELP reviews and reaped the rewards! Great fresh food with authentic flavor, amazing...I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZcvKb_1gXb4D7ISGRTpjSQ"
  },
  "ZeXQe6yvculmkojKjilLpg": {
    "date": "1/16/2016",
    "text": "I got the chicken gyro, I asked for not spicy. It was soooo good!! Marinated chunks of chicken with super fresh veggies and fluffy pita bread. The spices were awesome, customer service was great. Place is very clean and comfortable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kq8B7VHFD-vVp9xJThfbNg"
  },
  "wrAipl_hvrB4S3D5iJ1gyQ": {
    "date": "3/2/2016",
    "text": "Great Mediterranean food! Highly recommended by a friend, we tried it and it's one of our favorites in this area. So far, every dish I tried it's delicious. Try their Turkish hot tea.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qtY0Qcbf-6JzzXRP9jDqHw"
  },
  "y0SPHQBGdW-OFUY69v9lIA": {
    "date": "3/7/2015",
    "text": "Excellent!  Just like the food I had on vacation. Not many Turkish restaurants around so I'm glad this place is a good one. toys to keep the kids distracted too. I'll be back soon for some iskender! Thanks for the awesome service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Zy0A40pD9qRgQEtLZz-c-w"
  },
  "47V3c0uWyIluqIQoNl_HrA": {
    "date": "10/27/2015",
    "text": "Their eggplant dish is DELICIOUS! Restaurant is clean and their Turkish tea is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VPoIDsGNA4JqYO2QHO7cOQ"
  },
  "tcZraWtrDPpI673pQgg-JA": {
    "date": "2/22/2015",
    "text": "This casual Mediterranean diner is great for groups or when you don't feel like cooking and want to take-out something fresh. My wife and I enjoyed the hummus plate and the lamb gyro. The grape leaves were a nice side to our main course.  All in all, a nice experience and we would go back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ob1AYMOY43nUFVdcvaKGmQ"
  },
  "NhCsLkXCrtp9arKfDF_6KQ": {
    "date": "11/27/2016",
    "text": "Awesome service , great food. Very friendly staff! I keep going there again and again for the wonderful kababs, hummus and pita! I really enjoy eating here !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IYarw--SC5km61Cpa5bEog"
  },
  "0RN0Yn7FSRIRvZJHui_UPg": {
    "date": "8/5/2015",
    "text": "This place is a hidden strip mall gem. I had the chicken kebab with rice and it was tender, juicy and flavorful. My husband had the chicken kafta, which was spicy, interesting and perfectly paired with a delicious yogurt dip. The pita bread is fresh and soft, don't skip it. We'll be back...soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SIDO_HUSQ5Gweb-Orww2zA"
  },
  "3P6HW18LxTv6xISbM6Ixgw": {
    "date": "8/11/2015",
    "text": "Worth the try! The hummus and Turkish coffee afterwards was delish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ohEHoxEBPQGzYcSZbfvwUQ"
  },
  "UYON-Lj7xWaCsrHKLUhjcg": {
    "date": "10/12/2016",
    "text": "Excellent food. I have had both the Adana with lamb and the Adana with beef. Both are not to be missed. Truly the most authentic good Turkish food I've had outside of Turkey. In fact I think you could put this restaurant in Adana and it would do very, very well. A hidden gem of a restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MZWP6rPRxRaOaxJM2MF9iA"
  },
  "7ohm2GOs03pxocxxdHvmOQ": {
    "date": "7/11/2015",
    "text": "I'm so happy to eat there, best Turkish food in town, especially the Adaneh Kabob and lahamacun, love it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9sgXAGF4hoxaosPhOXxcbw"
  },
  "HaBPdNkJJx9XKpqiP8ltXg": {
    "date": "8/8/2016",
    "text": "Hummus and pita, chicken skewers with rice and salad. Excellent quality. Friendly service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-WzIX7s6sZyYCkSKd7dcRQ"
  },
  "HSeLp9-_qy8HiX3xeYOGmA": {
    "date": "6/27/2015",
    "text": "This place is great. I highly recommend the Chicken Kafta. It's got a delicious blend of spices that will make your mouth water. Enjoy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ctQGpEAOCb6rZnAVBgPhOA"
  },
  "_V3wdINlHVoJIblNJThIBQ": {
    "date": "5/29/2014",
    "text": "Just moved to AZ and this is one of the first restaurants we visited. Amazing food and the owners are extremely nice. We asked about a dish we saw some other folks eating and he gave us a sampling on the house. We've already gone back twice. Highly recommend the 'Turkish Pizza' and their gyros are great too. Strongly recommend this place if you're looking for great food and excellent service. This place is definitely family friendly as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "Gr8tmDgHkUj5TkTXXDM1Eg"
  },
  "U-Eny0SkBHKhanFyrFgCvA": {
    "date": "3/19/2015",
    "text": "Good food, friendly staff. The plate portion was just right. Next time I'm trying the Falafel",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4rvhhRksRRzOEuZhds-tJQ"
  },
  "d2lGyjuBr1SsZw1LuNjd6g": {
    "date": "8/13/2014",
    "text": "Delicious food, good price and very nice people! Absolutely offers best examles of Anatolian Turkish Cuisine! You have missed a lot if you haven't been here yet!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UgjdDBxILGBFXYXT4U9VcA"
  },
  "u-0XkG5DQ-71aP2_7J1mZA": {
    "date": "6/18/2014",
    "text": "Great food and extremely friendly and welcoming owners.  Lamachun is delicious as is all the offerings. Gyros, kafta and kabob plates especially. Great vegetarian offering as well.  American offerings also have a Mediterranean flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "S88Fs1el_o6G8D4bTZcN-Q"
  },
  "-YeCyxZNT8LEGAG_Wbg_Cg": {
    "date": "2/22/2015",
    "text": "Chicken was amazing! Pita bread was toasted perfect. Happy people here. Definitely coming back :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XYzqUf3kHlsvL3OdXGCi2A"
  },
  "d_pYv17h7TcAY6cc1inc1g": {
    "date": "4/8/2016",
    "text": "They have great food the first time I was taken there about a year ago I was not familiar with Turkish food and we go at least once a month.  Also we live in west Phoenix and travel that far to eat there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YsDKVTEITy-9ADmump12yw"
  },
  "DpF--ZWTHUkHkXgHczNO3A": {
    "date": "7/17/2015",
    "text": "I came in for a good gyro, and left with a great experience! My friend and I came in and ordered our food (which was great) and then we decided to have some baklavas. The man in charge brought them out along with some free Turkish tea! They have great service there and the atmosphere is awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gWOZf5ODRaEk6VXYJU264A"
  },
  "CYIOJdbik45diqyApwUCKg": {
    "date": "11/18/2016",
    "text": "Wonderful food, very clean, nice presentation and very friendly staff.  Seems family run and they have a very good Turkish tea they give you after the meal.  Everything you look for in a mom and pop restaurant.  Well worth the time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Raxyghpfm6929KRdPgOYmA"
  },
  "EMPpCzaAeG5iaRblJruCgA": {
    "date": "12/23/2017",
    "text": "We needed to get baklava for a party later on and decided to stay for lunch...We both had the shawarma chicken pita (my husband had a spicier one and we both liked it very much)...We took the baklava to the party and it was such a big hit that we went by the next day and got more for guests coming in...We will be returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qkXw01hutRVYpVTwFCM-Uw"
  },
  "tkqi94aepnoo7czYNU5yHQ": {
    "date": "5/27/2017",
    "text": "For HALAL beef/lamb and chicken I selected this restaurant, I like the beef/lamb gyros plate  with rice and ezme, for dessert I ordered kinafa (order it with the main dish) You will enjoy it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUgTDx_P2GhdQ8YxgHvMww"
  },
  "USzLug6AK59jOkMvOpHtNQ": {
    "date": "7/20/2016",
    "text": "Great food for a reasonable price. Not very many Turkish places around this area,  so I was pretty surprised when I found this place. These hole in the wall type restaurants tend to be the best, and this is no exception. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ekRk6Mvhuuk02GoGuXB5Yg"
  },
  "Rb4ab-XchDmIi24JPuaGrA": {
    "date": "2/17/2016",
    "text": "I'm still fantasizing about the food I had there. Hands down, one of the best! I live in SF Bay Area and if TurkDish was at SF, they would be an empire!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ToDiIVpOiJ9qvPmTlJK_gA"
  },
  "Gft_FD25vGDQAK9ii6dotA": {
    "date": "2/1/2016",
    "text": "Food is really delicious and the service is excellent thanks don't skip on trying the tea",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kFI8fm8rVaz6XYV3t0SIhw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kFI8fm8rVaz6XYV3t0SIhw/o.jpg"
      },
      {
        "img_id": "Jb1XTbTDtEKFGJU3JrbZBw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Jb1XTbTDtEKFGJU3JrbZBw/o.jpg"
      },
      {
        "img_id": "k3ebh7cnG0ADba5awsamLw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k3ebh7cnG0ADba5awsamLw/o.jpg"
      }
    ],
    "user_id": "4fzFXdrmvko7q_0MBQCK9A"
  },
  "133cXd1wR-d44CdJNjwE1Q": {
    "date": "3/30/2017",
    "text": "Best gyros (Doner) and shawarma in the valley  We come here every week. My kids love it here!  The Iskender kebab is a real treat. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UchdsFmiccQRj-hy0WK9ww"
  },
  "tvfLgTKiy9xlT1nfsXrsfg": {
    "date": "12/14/2014",
    "text": "The Yelp reviews here are way, WAY off. They have gone through a change in management and name, although the signage on the outside still says Greek Grill.   My husband and I were hoping for some authentic Turkish food since it's impossible to find in the valley. Instead, we got flat-out terrible food. My husband got lamb kafta that was pulled straight from the freezer. I got a vegetarian plate that had an inedible spinach pie. It tasted very old and dried out. The stuffed grape leaves were ok, but even the canned ones from Trader Joe's taste better. The falafel was absolutely the worst falafel that my husband and I have ever tasted. There were no visible spices or onions in the patty. So horribly bland other than the taste of old oil. My husband's Turkish coffee was nothing like we had in Turkey. It wasn't bad, but it was more like chai than the dark tar that is turkish coffee. We usually like to try baklava at Mediterranean restaurants in hopes of finding something close to what we had in Turkey, but we didn't want to risk further disappointment.  The service was friendly though, and that's the only thing keeping me from giving them one star.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "pu_AQig2fw40PshvtgONPQ"
  },
  "Eqm0r7RNlW7i3HZTS1QAuw": {
    "date": "8/9/2016",
    "text": "If you think you like Turkish food or not, this restaurant is just outstanding! From the simplest dish, they put a subtle and delicious spin on it. Examples of simply amazing: bread, hummus, tea!!  Highly recommend it and very friendly, attentive team!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IO1Tv-my9HiKDyZTnJhhgw"
  },
  "C8CPdg9jjMUKWVatO82xNQ": {
    "date": "6/26/2016",
    "text": "Great turkish style mediterranean food. First time I had a Lahmacun which is like a turkish style pizza and it was really good! The beef kofte was also very good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "R6-Ca-p_bKmcbeMzgkXRvw"
  },
  "1rroS490krcPbKI3gIrSiw": {
    "date": "11/5/2016",
    "text": "This was my 3rd visit and i finally decided to update my Yelp app so I can give a 5 to Turkdish. The food tastes even better than other Mediterranean restaurants I have been. Highly recommended!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KvfgeGC-PWYFs-l-__yQ7A"
  },
  "9Jcv5CVCbVOf4S9n4sKplw": {
    "date": "12/8/2017",
    "text": "We visit this place regularly and all of our family loves it. Juicy lamb kababs, tasty burgers, authentic turkish lahmajun, fresh salad and of course, salad dressing they have. There are many more deserves to be called, but it is better to taste than read. I would recommend everybody to visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-5WS7sB0pBBoDRsdRzyx1g"
  },
  "mPunTDZfmiW1lYiBd3Jrhw": {
    "date": "9/13/2015",
    "text": "Very tasty medeterranean. I recommend the gyro plate! I had to add in the pita extra but it was worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9TAi2uofjpFyre8K6lyQQw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Gyro plate with hummus and pita (pita was $1 extra)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9TAi2uofjpFyre8K6lyQQw/o.jpg"
      },
      {
        "img_id": "NBcStPl9BtELMMrbdhKHew",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Gyro plate with hummus and pita (pita was $1 extra)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NBcStPl9BtELMMrbdhKHew/o.jpg"
      }
    ],
    "user_id": "gfkqcA7y6HLCbOSO-bcvjQ"
  },
  "OP39If1Vr7IuhLRvZnszjw": {
    "date": "2/26/2016",
    "text": "Great neighborhood spot. Love to be here with my kids for lunch or dinner. The staff is always friendly and the food is very good. I`m a kebab, hummus and falafel fan and they are doing a really good job. Sometimes you can find traditional Turkish dishes served with complimentary Turkish apple tea accompanied by contemporary Turkish pop music.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o7X9ZpOuR_0ZJyUmKkYywQ"
  },
  "vyEF9mLmznEaf_F5LCaGxQ": {
    "date": "4/24/2015",
    "text": "This is the best Turkish restaurant in Phoenix area.   First of all I loved lentil soup, very tasty and size of the serving was very satisfying. I ate Turkish Pizza (Lahmacun), It is a real lahmacun. (In my opinion tomato paste in it could be less but OK) Another time I tried manti which was good also. The price seems a little high but OK for the delicious meals. I will come again.  Hospitality is always nice in this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y0Ku0rQAeB_jQZXie0kHSw"
  },
  "zOwt70P4e2mwJppPjutJ7Q": {
    "date": "7/16/2016",
    "text": "Very impressed with my first visit! I had the chicken kabob and some beef gyros meat on the side. All of it was very fresh and had great flavor. The rice and salad were great sides as well. Very well done!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "neJ4YM3xtyc1SqUo8p-i7g"
  },
  "JhxnCN2k2Ju-fFa_FDm0pQ": {
    "date": "4/21/2015",
    "text": "I tried Adana Kebab it was little spicy but very good. I checked thru yelp and got a free glass of Turkish Tea. Fast service, friendly people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vX01JAibbu3qS5-dKUG91g",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Adana Kebab",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vX01JAibbu3qS5-dKUG91g/o.jpg"
      }
    ],
    "user_id": "6fB_MHNX4JeMEYL3uKAjrA"
  },
  "p6eQzLZh3nC1zmra35SPSg": {
    "date": "2/28/2015",
    "text": "Honestly love this place! Had Turkish food all around USA and so far the best ! Atmosphere is amazing and the food kebabs are great :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lpN9hdIe3eu_AF4KnUSb4Q",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Turkish tea",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lpN9hdIe3eu_AF4KnUSb4Q/o.jpg"
      }
    ],
    "user_id": "sfxog8nL_JkDbN2gfoIDPg"
  },
  "E1d8Kwznp6zmuIG-8tV_-Q": {
    "date": "10/8/2016",
    "text": "Lahmacun is good and comes with good size. One think you must try is a desert that is made by pumpkin the sprinkles of walnut. It is even better from the ones I tried in Turkey. Overall it is a warm and cozy place. The owner is very friendly as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EQtsTgzrMqAcEMGOY1S-3Q"
  },
  "HvYphL-M9mXZ9BcbCK9ZoQ": {
    "date": "10/7/2016",
    "text": "Adana plate was good; spicy meat, fresh salad, and tasty hummus. I tried the fermented red carrot soda and if you like that sort of thing it's a MUST have. Mildly sweet from the natural sugars in the carrot, salty, and tangy from the fermentation. Great with the spicy meat and fat from the tahini in the hummus.   The owner brought some traditional turkish tea as a digestif and it was a great cap to the meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PntOrrW1zEEgpKHZbh8wmQ"
  },
  "jZcVmY15-HF9FseNRcO2Xg": {
    "date": "3/4/2016",
    "text": "Just amazing Turkish food.. Their spicy sauce is to die for and their chicken cubes are just juicy as it gets.. I also tried their Adana spicy kebab and that is just huge and amazing.  I go here often and is my go to place for Turkish food.. Keep it up !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "kMD7dgJSom6jmdJ3j15DGg"
  },
  "lzoPOyeh2-m2DqrLHKdomg": {
    "date": "12/4/2016",
    "text": "The best hummus and grape leaves in the valley, for real! Apologies to my middle eastern grandmother, but theirs actually beat the family recipe. The people running Turkdish are friendly and helpful, and finished the meal with Turkish tea. Try the iskender, it's mind-blowingly good, and seriously, get some hummus.  We'll be coming here any time we want an authentic and really good Mediterranean meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qt9ShB3goOLNuigIMYJ4_g"
  },
  "6oPC42Xt6kmAwY1bXnIjXA": {
    "date": "10/21/2017",
    "text": "We went for lunch here today. We have been coming here for a few years now and it never disappoints. We were greeted by one of the owners. He is always so friendly and inviting. We started with the Ezme appetizer, it is one of our favorite go to items. We then had the Chicken Kebab Plate with hummus and salad with Pita bread..it is always so tender. We also had the Chicken Kofte Plate with babaganush and salad with pita bread...another amazing dish..followed by hot Turkish Tea..every time we come we leave so full and happy. Turkish food is so comforting and you can tell there is a lot of love in the cooking of the food. No matter what we try in the menu it is always outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Ejl0ZZgnrIbzz_jjgH4mA",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_Ejl0ZZgnrIbzz_jjgH4mA/o.jpg"
      },
      {
        "img_id": "jWaY20LQ0DmlHc9NbPObIw",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jWaY20LQ0DmlHc9NbPObIw/o.jpg"
      }
    ],
    "user_id": "lqZ3alDVfsFM4KIIgRBiDQ"
  },
  "rmtn3RyEkzqmLqvZYGP4jQ": {
    "date": "8/24/2017",
    "text": "My god. I never write reviews, but this place deserves my highest praises. I ordered the Gyro Meat plate with rice and hummus. The lamb meat was excellent. Yes, I said excellent. I have tried lamb meat at several different places, but come close to the quality of the meat here. It is seasoned perfectly, and is packed full of that delicious mediterranean flavor.   I mixed the rice with hummus, sriracha for spice, and the two sauces that came with it. One of the sauces was the cucumber sauce (yogurt texture). The combination of hummus, cucumber sauce, and the perfectly cooked rice made for an incredibly pleasant texture. Coated the dish with sriracha to kick up the heat. Overall, 10/10.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dQ7DrEQD369dHzoK1mzckw"
  },
  "EpRBnNdIuLmhA2LlnC2tww": {
    "date": "1/25/2016",
    "text": "It's decent.  We probably had higher expectations for this place and we should have. Considering it is a dive. Also considering there was no one else there in the middle of the day.  We tried the Gyro meat but it was quite bad and flavorless.  We tried the chicken shwarma and it was very good.  We tried the Turkish pizza and that was also very good. Very small but good.  When we go back? Maybe for a plate of chicken Schwarma and that pizza.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m35ODBrr76JYr20nxoMg_w"
  },
  "tG17iOg2X3MvMQATL7FtWQ": {
    "date": "10/14/2016",
    "text": "Excellent flavors, decent portions, friendly service, and reasonable prices. I can't complain!  I got the chicken gyro plate with a side of rice, hummus, and pita bread. Everything was delicious! The chicken was SOO flavorful and moist, the rice tasted like simply buttered rice (yum!), the hummus was smooth and genuine in flavor, and the pita was thick, warm, and was just wonderful. It didn't look like much on the plate, but I ended up stuffed after I was finished.  The combining of Turkish and Mediterranean food is interesting but complementing.  Lastly, our waiter was very kind, and most of the customers were Turks. (That's how you know it's good restaurant!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "It6lsXJG6hD61BMNMPzl-w"
  },
  "t0eztaZ712uAwBvhUF20Ew": {
    "date": "12/16/2015",
    "text": "I had the beef gyro combo, and it was very tasty. The gyro itself is similar in presentation and taste to the one at Pita Jungle. The fries are almost exactly like the ones at Red Robin (steak fries with that same orange seasoning).  Why not five stars? I struggle with this, as the restaurant is not doing anything wrong. However, there is also nothing that made it stand out in my mind as amazing, and I was the only customer there  while I ate, so it felt a bit empty. If I am in the neighborhood and feel like some Mediterranean food, I would stop in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "LHcmA-TuK2O_JxaZ6eUcWg"
  },
  "4cV3lK2L0uTD2ZIOTiqgGA": {
    "date": "8/9/2017",
    "text": "The food here is amazing. I have tried the Iskender, manti and lahmacun so far, and they've all been very good. Make sure you have plenty of room when you order the Iskender, it is delicious and very filling. Turkish restaurants don't seem to last long around here, I hope this one does :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rrlAUd6v5k5skQxrHTbpdg"
  },
  "iuHpkUXLnhladJSL3jte0A": {
    "date": "1/19/2018",
    "text": "Had the falafel and the lentil soup.  Husband had the doner kebab.  Fantastic.  The staff was very friendly and attentive.  We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U6bON4mCYBlfp5_CoiFQ2Q"
  },
  "jmlCv0pS0W1dKQ_v66uHkw": {
    "date": "4/13/2017",
    "text": "Ridiculously good. I haven't had Falafel this good outside NYC's Greenwich Village. Portions were perfect. Gryo was excellent. And the Rice. What magic do they cast to get something as simple as rice to taste so good?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lTzUzpHMLa0dfg6iFh4psQ"
  },
  "TmuLi_9t-x3nK9u0xCSwpg": {
    "date": "3/10/2018",
    "text": "Great food, awesome desserts, and great customer service. Had to try their baked goodies next",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0cgpPHguP7glKNxy1hql4Q"
  },
  "V4RGq1NO5z-m7v_mOzwC8w": {
    "date": "2/7/2017",
    "text": "The place is small with good vibe. The food is good. We have tasted few thigs and the tastes were good. Baklava was not that great as it looks like they keep it inside the refrigerator (don't linke cold Baklava, destroyss the crispy nature). Overall, good place to take a chance!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wYiQ7P1c2llpIvmHvHmLow"
  },
  "lSPYjYQyZWW_WNae7W5TIg": {
    "date": "8/17/2016",
    "text": "Authentic and delicious Turkish cuisine. Clean and friendly. Reasonably priced.  Belobu Creative recommends this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uXzUK5LPx1WQRPH72IGOdA"
  },
  "CkwcARE_idzQNhR3HofWfA": {
    "date": "4/19/2016",
    "text": "Not only AMAZING food but exceptional service! We ordered for delivery and forgot our coupon and we contacted them to add the coupon and Unal responded immediately! He also emailed me to share that he hoped we enjoyed the order! Very impressive service!   Thank you for putting a smile on my face today!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1jQtp0dTWKagmPbLj82_BQ"
  },
  "z_iZWXpZioOmb0SZt2er6Q": {
    "date": "12/29/2017",
    "text": "Awesome whole in the wall family run place. everything is quite delicious and just hits the spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6_6XIVpehlOTyvYyg0wlnQ"
  },
  "YZZ5LJ-nWOkPzJO_tAeMaQ": {
    "date": "5/27/2017",
    "text": "Absolutely delicious !! Authentic Mediterranean food with great service . Will definitely come back !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SmbB3lHpOkteubrivGbLwQ"
  },
  "2_817xezIAsohEfXAV1FZw": {
    "date": "7/26/2017",
    "text": "Great authentic Turkish food, I recommend the chicken skewers with pita bread and hummus. Tastes amazing. Will come back soon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oN1b0PI48uNAdMDnf3BhMQ"
  },
  "TAmg17GSlKdweCQy4YQ61A": {
    "date": "2/22/2018",
    "text": "You should try Iskender Kebab which is one of the best dishes. Ozlem does a great job serving the food and Leyla cooks the food. Highly Recommended by a Turkish American.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oGfu3RYhleE5az3IVCK1uw"
  },
  "YESP42KYIqyCZ76FLTfz5A": {
    "date": "2/22/2017",
    "text": "This place is amazing! Every time I am in Chandler for lunch, I go here. The food is a classic Mediterranean style cuisine. Save yourself the time of looking at the menu and get the spicy lamb plate with fries, hummus, and pita bread, by far the best thing on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bxNqxwVKtATwiwFMTYv8JQ"
  },
  "VhYi8pHzViMSL5oLDpf3Gw": {
    "date": "10/25/2015",
    "text": "Mouth watering food. Have the kabobs and hummus n rice. Tried the lamb kebab. Very juicy and flavorful. Falafels and chicken gyro is also good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BUZ2QgUW-2K6hqQbnAz_3Q",
        "caption": "Photo of TurkDish Mediterranean Cuisine - Chandler, AZ, United States. Turkish tea",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BUZ2QgUW-2K6hqQbnAz_3Q/o.jpg"
      }
    ],
    "user_id": "GQEE5zo9IFo1_r4k_uIKDQ"
  }
}