{
  "Se4mmb70DgNJC0R-m0xnyw": {
    "date": "10/3/2016",
    "text": "walked over from the hotel to have a cup of coffee and a breakfast sandwich and the palce was excellent nice people and the place is very clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YBvFIoUTEt2V4Ebo5lTPCQ"
  },
  "f9_cQET0dcVTS7qeuTg4IA": {
    "date": "1/24/2015",
    "text": "Pretty great stuff.  The staff is really nice.  Owner is a dad / daughter pair with nice smiles and good service.  The atmosphere is comfortable inside.  I am writing this review from a big leather couch inside the shop using the free wifi and listening to a good mix of John Mayer and Bob Marley and UB 40 to name a few.    Now for the food.  I have only eaten here twice, but both times were noteworthy.  I got a rueben on rye last week with a bottle of coke (YES, A GLASS BOTTLE WITH REAL SUGAR).  The sandwich was phenomenal.  Good meat and nice rye bread.  I am not a sauerkraut guy, so i substituted lettuce and tomato- produce was quality.    Upon writing this, I just finished scarfing down a homemade chicken pot pie.  Great crust and nice tender chicken, potatoes, veggies, etc.  Also it was a good size for a lunch, not too much where I felt like I had to figure out a way to take home chicken pot pie leftovers home, but I am adequately full.    I just started a new job working across the street so I will surely be back and will report the news.  As a long time viewer of yelp info, this place made me actually want to write my first Yelp review.  They deserve their 5 stars and I am sure more and more reviews will steadily come in.   Its a wholesome place with great food at reasonable prices and nice people. That's really all anyone can ask for from an eatery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lIkdsCBOGYtWWafq41tJQg"
  },
  "W7Hes1w9itOMkCpERKjFww": {
    "date": "11/12/2014",
    "text": "Just had my first lunch from here and was impressed! I ordered the Dynamo which is a Tuna sandwich with Siracha. Very good, I could use more heat but I think it's just enough for the general public. The bread on my sandwich was very good, tasted fresh and was very soft. You get a side with the sandwich and I wanted coleslaw but they were out. So I opted for the potato salad and was surprised at how good it was, a bit of bacon in it  added a nice touch. They will probably move up to 5 star once I test for consistency but I surely will go back for lunch again. They seem to be a little new still so give them some grace if you come at the lunch rush, it will take some time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "b5lVdfbzzE-RK_GeiSR6HQ"
  },
  "2CiuV8E95TEQKkTEw1vrTA": {
    "date": "6/19/2015",
    "text": "Love this place awesome food no matter what your pleasure is, great atmosphere and friendly crew.you can get sweets evert hung made to order 5 stars yes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UlW_Zt6bKGNqBlG0GFOaJw"
  },
  "-_pcxnFiFYs8dlpxWmAf9g": {
    "date": "1/3/2015",
    "text": "Wow!  This hidden gem of a deli is fantastic!  I went for lunch and was not disappointed!  Sandwich was wonderful. Really no complaints..if i had any suggestions it would be a bigger serving of side coleslaw. Affordable, friendly, and fast too!  Cant wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MCmaCRd7Dp2NZG3QOtIz_g"
  },
  "3bd0P6xF1dCpj0_6Y3h1kA": {
    "date": "11/8/2014",
    "text": "Original breakfast sandwich with bacon was Really good! Great ciabatta roll. Jerry the owner is very personable. Will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jq9Go_TlIRbqcUvvdfdTmQ"
  },
  "h5efe5IjfCN2a8YeBkXs6A": {
    "date": "8/30/2016",
    "text": "Just in town for the day and had to quickly stop and get breakfast before heading out on the road. Just opened Yelp and found this amazing place, we ordered the Original with Chorizo and the Kennedy with iced lattes. You can't go wrong here, one of the best quick stop finds.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NSdLN1fg3dTujE0WUj3Qtw"
  },
  "Efi-WZo4uSv5EpQKOKRxig": {
    "date": "5/6/2015",
    "text": "A little pricey ($9 bucks for a sandwich), but my sandwich was pretty big and very delicious!  No brisk black iced tea available and the bottled stuff tasted like water. The blackberry Jasmine tea was gross.   The cashier who took my order wasn't especially friendly.  Located in an office like plaza. Lots of office worker types here. Nothing special about the atmosphere. I probably won't be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4DbJF-Pf9EG5no9Ods-qKQ"
  },
  "hORkLsdKV7h0gy_z7ogAVw": {
    "date": "1/7/2016",
    "text": "This place has great food. I found this place 5 days ago and have came here every day so far. LOL. Jerry and Allie are great host! The hippie style oatmeal is great!! Everything I've had here taste amazing which keeps me coming back!! Their original breakfast sandwich and Bento are great!! Their muffin are delicious. Lol... Everything I've had is yummy. Try it out. This place this week has replaced my Starbucks breakfast & coffee runs!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8IkVF-8N1dxUCmefa3uqrA"
  },
  "VcJ0ZvjrX_56C7tqIIPvRA": {
    "date": "10/13/2014",
    "text": "Great food and friendly service.  Try the hippie style oatmeal as a twist to the morning",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "URcFlHVCmbqo7QVtVdsP0A"
  },
  "r9EKs_TFMRbwbld94NyF6A": {
    "date": "6/4/2016",
    "text": "Got a breakfast sandwich, muffin and a smoothie for 15 dollars. Which seemed to be a bit pricey for only 3 items. The smoothie was very bland and the muffin and sandwich were just okay. They only had 2 kinds of muffins which was disappointing also.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QZuQZgmaflphMl4H067OZA"
  },
  "lrBt5GDloifLhgRkx5bfbg": {
    "date": "6/26/2015",
    "text": "Its been my third time at The Brown Bag and I'm hooked, what a great place.  I took my son there and I have gotten food to go for the office. I've had the firebird sandwich twice and the ahi tuna wrap once, great taste, fresh ingredients and high quality.  The seating is casual and the customer service top notch, just such a pleasure going to a place where the people are friendly and smile. There are so many menu choices, I look forward to going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jb6xgWCvI-e0KXMZLI_e5A"
  },
  "gCNTjI7X0WpiqdXk6JRdIg": {
    "date": "3/27/2016",
    "text": "The place was okay. We were staying at the resort next door for a conference and were in the mood for a quick lunch on two different days. I had a wrap one day and a salad the next. The food was decent, I especially liked the bread. I LOVE fresh bread. They have a local bakery deliver bread daily. The food was slightly above average. I am not sure they actually make any thing in house. Everything seemed like food service deli meat. We even talked to the owner and his daughter on the second day we visited. I do have one qualm about the place. The second day we visited the OWNER tip hunted me, with the owner doing it, my guess is that it is a sign that they arn't doing as much business as they expected and are hurting for ever dollar possible. If you read my previous reviews you will know how much I hate tip hunting. There are 100 different ways it is done in the food industry but the absolute worst is the confrontation method which the owner employed. After ringing up the order he turned the screen on the register around and had me press confirmation button to either tip 15, 18, or 20%. I am sure they were a no tip button, but WHY IN THE WORLD would an owner do this. YOU DON'T TIP THE PROPRIETOR. It left a bad taste in my mouth, we stay at this hotel the same week every year for the conference, my guess is next year they will be out of business... I'll keep you updated.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RKnc0RWfqPO8LyftOD4EWA"
  },
  "XoXz2kPWR66raoUF3bvQYg": {
    "date": "5/29/2015",
    "text": "This place has a great Caprese Sandwich like everyone says. The service was great and the sandwiches came out reasonably fast for weekday lunch hour. This place is definitely worth going back to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5-fz4eHM0K4NQanQpc_T_g"
  },
  "AWfJnZ0h-rfCA7qqNr8cwg": {
    "date": "8/21/2015",
    "text": "Having lived in the area my entire life, I hadn't even known this place existed until hearing someone rave about the sandwiches! Earlier today, I decided to try it out for the first time! The menu was very extensive, my food was prepared within a timely fashion, and the service was great!! I was helped by a very friendly girl named Maggie, who put up with me until my food was ready. On top of the pleasant environment, the sandwich I got (the Gus) was absolutely delicious and I will definitely be returning and sending customers their way!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PHnrcRS5qAXwNKRbTrPozA"
  },
  "2A5sdKqTF9Ta9mFi48vv8Q": {
    "date": "8/11/2015",
    "text": "Delicious food. Family owned small business. Very professional and friendly. Definitely worth trying out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VEFyQv9wYpxWkCmAT54cw"
  },
  "DmQM_ClKGrTg4phASMAYnA": {
    "date": "3/29/2016",
    "text": "Wonderful owners, fresh, well prepared food. We couldn't take another generic buffet at the resort, and wandered in here. We ate nearly everything on the breakfast and lunch menu--everything was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SqU4p8QAgEQHTiRtehDLIA"
  },
  "yDsqr2atjKoh3ls2iO51Qw": {
    "date": "1/26/2015",
    "text": "Little sandwich shop in the same plaza as Gallaghers and Tutti Santi. The owner (Jerry?) greeted me with a big smile and we shared a few laughs before I ordered the Caprese sandwich with a side potato salad.   The sandwich was phenomenal! You can really taste the freshness of the ingredients and the toasted ciabatta was perfect to handle the mozz, roasted chicken and tomatoes and a killer pesto. Potato salad had pancetta and was unreal. So happy this place opened up! Has been around for 4 months and I'm sure will stay.  I cannot wait to try the rest of the menu; everything looks good! They even have a pretty big selection of breakfast items and sandwiches. The music was great too! Look forward to coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X6XirdYbL6V8y74gYbcirg"
  },
  "2I0qFQgQmIJ90JRoGiQhzQ": {
    "date": "3/15/2016",
    "text": "Great laid back spot!  Not much to it.  Had breakfast and the coffee and burrito was terrific.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F3Z3X9Ss3R3OdCWqe3HiDg"
  },
  "m0izH9snT2RxDyuTpxKo_Q": {
    "date": "7/30/2015",
    "text": "Oh Brown Bag, you've lost a customer! I'm not dissing your quality of food, because you have some great items. I'm just tired of constantly compromising on what I get to order. Every time you are out of something...the tuna wrap or chips with my sandwich or the meatball sub or olives on my salad. And most importantly you NEVER MAKE ENOUGH COOKIES!!! You sell out everyday before it's even noon. Make more cookies and you make more money. I'm going to start buying lunch where I don't have to have two or three backups for my order. So long Brown Bag!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aB2-cz84Un0LOuJaydRDhA"
  },
  "GJRrM9rlcc1gfE9Tphhu8g": {
    "date": "7/24/2015",
    "text": "Had breakfast at The Brown Bag after reading such great reviews.  The food was great and the service was too!  I had a huge blueberry muffin, which the owner mentioned he had made himself that morning. It was so good! My husband had an egg sandwich and said it was great. Can't wait to go back and try it again. The lunch menu looked great too. Seemed like a lot of regulars there, so you know it is good.  If you are staying at the Pointe Squaw Peak Hilton you can walk over for breakfast or lunch. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ke6-eR2JMENyFENQnWZ3tA"
  },
  "GxVMe-v50pDcZx0cdx77aw": {
    "date": "5/20/2016",
    "text": "Very good food! I had the breakfast burrito and fruit n nut oatmeal. High quality at the brown bag.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3JJNyi9scl3byQnvrLmgCw",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Breakfast burrito and oatmeal with fresh fruit and nuts",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3JJNyi9scl3byQnvrLmgCw/o.jpg"
      }
    ],
    "user_id": "Z2jorAEivgJFuC7-u7ZJxw"
  },
  "dLvjJcBcSCq2w8W9fKdgow": {
    "date": "12/8/2017",
    "text": "Try the Kennedy it's a great breakfast Sandwich!!  A nice atmosphere and good coffee!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ITrfmUCUfGenhpVW_Pn_pg"
  },
  "7oNIlYP6eCOyge90GgQNhw": {
    "date": "3/9/2017",
    "text": "Best breakfast burrito I've ever had, with tasty homemade salsa. Kids loved the giant muffins. Quiet little cafe a 5 min walk from the Hilton.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XjcKdKcPg6LCA5u47p0MxA"
  },
  "1KAss_J5zjLYlIRSt9hAcw": {
    "date": "3/8/2017",
    "text": "LOVE IT HERE! The Benny is my favorite! I love the simplicity and local feel! I highly recommend this place! Sooo yummy and good coffee too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8j4d6Ve8gQ765CPHRAruaw"
  },
  "tzkoj1YZpCQW-AuOi12NLg": {
    "date": "3/3/2017",
    "text": "First stop on our Phoenix trip, and it didn't disappoint! Delicious food and coffee and great service! Will definitely recommend to anyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MqALjW_cu1DixYZU02nfgg"
  },
  "nZiwss897YzMBEUjP-GWaQ": {
    "date": "5/9/2015",
    "text": "Boy, I could do some damage here. I had an island themed smoothie and a bagel today between appointments and both were yummy! I want to go back and try it all. My only complaints were they are a bit costly and the girl who helped me was not the friendliest server on the planet. Still, I will definitely be back even though it is not in my hood, sadly enough. I hear their Caprese and Pops Chicken Salad sandwiches are to die for!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dEk7mXM4npuDPmxrwPcEgQ"
  },
  "BWZFadRw8o3lhN8E3ruSWA": {
    "date": "9/23/2016",
    "text": "Awesome place. One of my favorites for lunch! Great atmosphere, friendly staff, owner is super cool! Highly recommend the chicken curry salad..it is the best salad I've had in Arizona!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wH06kawZ-C3mCjthUe85_A"
  },
  "8DMZKrJG1YXQYwumyTazog": {
    "date": "3/23/2015",
    "text": "Fourth time coming here in a month and each time has been excellent. Service is great and relatively quick (although I wouldn't recommend coming in if you're in a rush).   So far I've had the Caprese and Italian Chicken sandwiches. Both are great and utilize very fresh ingredients.   The breakfast sandwiches are pretty good, too.   Their iced coffee is run-of-the-mill but it gets the job done.   Atmosphere inside is perfect for lounging and getting some work done if need be.   Couldn't recommend this place enough! Especially if you're local!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ydLHVVC-XV7mkpUIXu75hQ"
  },
  "VluBwnRhcsLp6uLwMPoXjw": {
    "date": "11/20/2016",
    "text": "Excellent sandwich, fresh and delicious! Will be coming back to try several more. Thanks to Yelp, I found this place just down the street from work, so friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VP0TEuEWANvti52O7zB_g"
  },
  "7MX9UnzUNF7rKrmd0BmlTg": {
    "date": "2/13/2016",
    "text": "Came from California to stay at a local resort. This was our first stop following other yelp reviews. I had the pop's chicken salad and it was awesome.  My wife had the fire bird chicken and thought it was good. Bread and sauce were excellent.   The over the top friendly staff was more than happy to make my father a breakfast poncho about 1 in the afternoon which was really cool and that he totally  enjoyed. One of my boys had a grilled cheese sandwich which he also liked but I think was a little overpriced for it. The other sandwiches were appropriately priced.  No one left hungry from here.  While we were there, I overheard several (not over exaggerating) come in and, as they ordered, say how much they loved whatever it was they were ordering.  Service was excellent. Overall 4 stars for service and food quality. I would return of I were a local.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Z-HMQ6dYtXu9Hm2nR4Jmw"
  },
  "HupqISfB-IsXv8W9kywGdA": {
    "date": "11/11/2015",
    "text": "Fresh is epitomized by this little cafe. We stopped for a quick bite this morning and their coffee, muffins, and breakfast sandwiches were super fresh and delicious. We tried their Kennedy, and it was worth it...   Jerry and his crew are super friendly and extremely hospitable...greet everyone personally and it appears the locals know them well and know that they dish out super cuisine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pz-LHrz5mXjFfjhBda83uA"
  },
  "K4LZmXCqX1nU_1VzFf6E2g": {
    "date": "2/8/2016",
    "text": "Wait staff seemed super nice. You could tell the man behind the counter made it a point to remember his regulars. Cute little place.   I got the original breakfast sandwich with ham (should've done bacon. It was sandwich ham instead of what I would think of as breakfast ham) and bf got the Gus. The food was ok. Would definitely try something different next time in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9XQz0vTdCKIL6U4DKO0rmw"
  },
  "vGuBK9RJZWd1hC-2o8wxYg": {
    "date": "2/2/2017",
    "text": "Delicious sandwiches. We got the Gus and Snapshot. Both were SO good. The bread was soft and just right. The service was great also. Very friendly, had a small town \"everyone knows your name\" kind of feel",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QI8t_ryb6Y6A8G09vlDKPA"
  },
  "326CPVcejnsEzkwBb2dzgw": {
    "date": "10/14/2016",
    "text": "Finally found a good American owned sandwich shop. The dad of the owner was awesome and the sandwiches were too. Wish I had one closer to the west side but next time I'll be sure to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fWa6wwBrlz-mr6WiQOuFBQ"
  },
  "A1hI3ZowTeUOGtQgP8zSAA": {
    "date": "1/28/2017",
    "text": "Nice, relaxing local breakfast shop with awesome food! We had the breakfast burrito and the \"Kennedy\" sandwich and both were fantastic. The homemade salsa was awesome too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z3HRuLhon8oXmpLBcpn-JQ"
  },
  "2PBObTkzk772rxm2-837zw": {
    "date": "5/20/2016",
    "text": "I'm in town on business and was staying at the Hilton Squaw Peak. The only food option was Rico's, overpriced mediocre. Thankfully this little gem, The Brown Bag, was nestled in the neighboring strip mall. I have been a daily customer during my stay. The sandwiches...amazing. The best part, the daily baked muffins! I just had the BEST blueberry muffin EVER!!!  Food aside, the attention and service are top notch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "q7MRk6FBmx0H2xrZ10QUpQ"
  },
  "zN2XrKthCNIRSyvDMieoOw": {
    "date": "9/3/2015",
    "text": "Upon my arrival at The Brown Bag I was greated by Jerry. He was very friendly and I believe he was the owner of the restaurant. I wanted to get a salad and I ended up getting the La Cocina, which was very good. I also got a daydreamer frappe. The frappe could have been better. I only got htis because someone else on yelp highly recommended it. I think the issue was the employee that made the drink though. I would expect the frappe to be a little thicker and resemble a milk shake almost. This frappe was the consistancy of an iced coffee and very gritty.   I got my salad to go and enjoyed it at home. The homemade dressing that comes with the salad was delecious. There was tons of chicken in the salad and lots of roasted red peppers. I enjoyed the salad and will look forward to going back to try a differnt one.   The reason why I am giving them 4 stars instead of 5 is because the service could have just been a little bit better. It seemed like it was taking them a while to make sandwiches and some of the customers were not to pleased with it. This could have been a back of house training issue, it sounded like they just hired someone new and they were not trained properly. Also my day dreamer was made after my salad came out. Jerry told me he was going to make my drink three times and ended up pushing it off to another employee who then pushed it off to \"the new girl.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "o-a1wzDfezNizSD-PKxxKQ"
  },
  "dXLt3AqvtqLvZmV3dKaMuw": {
    "date": "1/14/2016",
    "text": "First time coming here and it won't be the last! They were very friendly. Place was clean and looked very nice. They have A LOT of menu options, which is nice. I got the Salmon Wrap and it was delicious!!! Also, their potato salad was amazing. It is a great place for lunch. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "07OQgRam3KAYgga0Tr_nUA",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Salmon Wrap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/07OQgRam3KAYgga0Tr_nUA/o.jpg"
      }
    ],
    "user_id": "K_EEYJasMjIAvSIe-SykVQ"
  },
  "zsujUp102rP8yHPYhzYo_A": {
    "date": "9/10/2016",
    "text": "First timer here, read the review and was superstoked about trying their breakfast. They claimed to be fresh and healthy and didn't mind spending the extra money on healthy quality food. I found out that they use a microwave to cook their eggs. Im a very health advocate and finding out they use a microwave really dissapointed me. We didnt want to find another place to eat so we ordered linch food instead. To make it easy the six of us ordered the same thing.  I also let them know that it was my first time, hinting that I could used some pointers on what to get but they just stood there watching me stumble on the menu. Didnt see any kid options. There chorizo is bought and not freshly made. Please don't advertise what you dont provide, its misleading. I gave them a four star because their food did taste good and they were kind enough to come out and see if we would like to get the remainder of our food wrapped. I liked how they decocorated their place as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qjqo4TdRafxGF4yFxVzOOw"
  },
  "lTkvgLVDR2zgzXo6aknTjQ": {
    "date": "4/13/2017",
    "text": "Was there for breakfast. Limited selection - was sold out of ALL muffins at 9 am. Oatmeal was soupy with chopped oats and they poured the brown sugar in as opposed to putting on the side. Chorizo burrito was way too greasy. One bright spot was the Kennedy breakfast sandwich. Not likely to return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "otIxIkBzXjBWybCaZvlQlw"
  },
  "W2Gd34eWLFnk5yAYw_7bjg": {
    "date": "8/5/2017",
    "text": "AMAZING FOOD!!! I got \"Pop's Chicken Salad\" and the \"Reuben\".  Both were HUGE and very authentic! Love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yOKtL9r53ekeh_xNMep6iA"
  },
  "fVgJwg3ZkNz-59Lp9L--SQ": {
    "date": "9/24/2016",
    "text": "One of the best spots in AZ!    Awesome food and friendly/helpful/knowledgeable service!  All the food I've had here has been fantastic, salads, wraps, sandwiches and homemade cookies and muffins are all delicious! My favorite is the chicken curry salad. If your looking for a great place to eat for breakfast or lunch, brown bag is the place to go! I recommend this restaurant to everyone I know!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nj3ACJT8wGtua5mtZNMuFg"
  },
  "6iXDSdSG3o931Lui3RUFSA": {
    "date": "3/12/2016",
    "text": "This place is so delicious! I had the breakfast burrito here because I always get the burrito anywhere I go. The chorizo was seasoned perfectly and the burrito was jam packed with veggies and potatoes. The home made salsa was divine!  It's dog friendly, has a courteous friendly staff, and a very chill atmosphere. The shaded patio made for a really nice meal outside.  I highly recommend the Brown Bag!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Q6-neXB55Dx36_U0iQ05g"
  },
  "CY3Dla8V6Sa21bUuVVMLMQ": {
    "date": "2/10/2018",
    "text": "Great place for breakfast and lunch, they have amazing sandwiches and super friendly service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gCb5D_6Mo1xLWOrcNtTS0g"
  },
  "CAveZ_9fLZ4xv9nPbi3U2Q": {
    "date": "3/24/2017",
    "text": "Non-assuming and convenient.  They don't complicate things.  Good breakfast spot for the nearby resort.  We enjoyed their sandwiches and breakfast burritos enough to come back the next day. I can see why some would say the gentleman at the register is unfriendly.  He isn't, really, just a straight arrow kind of guy.  Not a big conversationalist.  He talked baseball with me when we went in a second time.  Not a peep out of him on the first trip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OYtfJb5xQqb6eQMY3IF9wQ"
  },
  "iTd0vSxnqli7uBBLzO9FpA": {
    "date": "6/26/2017",
    "text": "Better than Subway, but that's not saying much. A bakery / sandwich shop should have fresh made on site bread. This place didn't. Kind of a blah sandwich.  Not a very friendly atmosphere. Actually a bit odd feeling and not very welcoming. Feels a little ghost townish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IVbqNDwZqIY7TGAzDUZ19A"
  },
  "c-R7U_nMnp02GOBxQ-CUaw": {
    "date": "9/21/2017",
    "text": "This used to be a great place to grab a bite, coffee and work but they cut off the WiFi to customers. Excellent customer service, Brown Bag. I honestly can't see myself going back again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OOdDnO8JHhNrWW1Os9jvUA"
  },
  "8okqkDsDTZJ3wJoOdd29Lg": {
    "date": "10/19/2016",
    "text": "Great local spot for breakfast and lunch. Their food is fresh and made to order however I like it !  Friendly and helpful staff. Will continue to come back often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vHBebmNJLIxOl7t8JAW0ew",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vHBebmNJLIxOl7t8JAW0ew/o.jpg"
      },
      {
        "img_id": "zt1fNY3IldVx-9mlcRChhQ",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zt1fNY3IldVx-9mlcRChhQ/o.jpg"
      }
    ],
    "user_id": "AypZnbYz6M3jZyvdmKxsfw"
  },
  "VvTCr69BbhXNrByk_BpnlA": {
    "date": "7/21/2017",
    "text": "The best smoothie ever! Super friendly staff 5 stars all the way around. I had the vegetarian eggs bowl which was delicious.  My husband loved the breakfast sandwich my son had the burrito. The food was fabulous but again the smoothie is a must! We loved it so much we went back the next morning",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FXLQneURmeEyTrhXWpYHkw"
  },
  "InSaUvfcGPfC4rF5YlyYpA": {
    "date": "3/12/2016",
    "text": "Close to local hotels this strip mall eatery is awesome. Hippie Oatmeal is a great start to the day. Hitt'em for lunch too. Healthy alternative to hotel food and still less expensive, even with a tip. Open early and worth the walk (short one) from the Hilton.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cKbtKqg4wUdvl_tv6-pYAA"
  },
  "HLHOQHrKdE29v6M_R_GlQQ": {
    "date": "12/2/2016",
    "text": "So glad we found this gem. We were in this part of town for a doctor's visit and decided to grab lunch, saw The Brown Bag on the map and stopped in. It is a really cute and simple sandwich shop serving up delicious coffee from the Roasters of Cave Creek. My boyfriend and I both had the Gus sandwich and it was amazing! The hoagie was so soft and all the flavors of the sandwich really blended nicely. I'll probably get the same thing the next few times I come in. The owner was also very personable and friendly which is also a plus.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aEAAP7_ekQj6jS9iSNbdTg"
  },
  "gs-LabeircyKbh_G9UIdXg": {
    "date": "12/31/2015",
    "text": "Jerry is a welcoming host at this little sandwich shop. The food is delicious and I really like the interesting selection of breakfast sandwiches available. Get there early and grab a fresh baked muffin too because they are mighty tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Za9wTs31MhZ0o8tjzdHqMw",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Excellent sandwiches and breakfast!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Za9wTs31MhZ0o8tjzdHqMw/o.jpg"
      }
    ],
    "user_id": "OuqUXWx1lmqTbYVmQWzu0A"
  },
  "O6IDsn3Ly2canwqP49rJxQ": {
    "date": "12/8/2016",
    "text": "This small, quaint place knows how to rock breakfast and lunch! Smoothies are good too. Not fancy, but everything tastes like homemade, cuz it is. My favorite is the curried chicken salad. I actually crave it. The Ruben is delicious and has just the right amount of pastrami and sauerkraut, between toasted marble rye. Skip the chips and try the mandarin oranges for your side. The one thing that they need to do...get a better ciabatta bread. It's dense and kinda dry. If sandwiches are more than 50% of your menu, please use amazing bread!! They also offer dog biscuits and a spartan but clean, nestled patio.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JpvtVsjhJXn_z1yeIAl-4g"
  },
  "uJ7QCIC9HmElvFL8UbSZVg": {
    "date": "5/14/2016",
    "text": "The meatball sub is amazing. Meatball are full size. Great seasoning and texture. Marinara sauce perfect. Sunrise smoothie topped this meal off. Also wife schmoo club had great flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LBAtYVJrzoJNDE89C-NbpQ",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LBAtYVJrzoJNDE89C-NbpQ/o.jpg"
      }
    ],
    "user_id": "aJm6FXo1ghtmEKuwanVRwA"
  },
  "ordk_YR961ayvT6edsL6AQ": {
    "date": "7/9/2015",
    "text": "Another great spot to head for lunch if you're looking a sandwich or salad. They have some awesome sandwich choices, it was really hard for me to decide on one. I ended up choosing the Bambino which has tuna salad, chopped jalapenos, bacon, avocado, provolone cheese, and spicy sriracha aioli on a hoagie roll. However, I ordered a their lunch deal of half house salad and half sandwich so it came on whole wheat bread.  It's weird that I ended up choosing tuna salad because that is usually the last thing I choose for a sandwich but for some reason when I read the ingredients to that sandwich I couldn't say no. I'm glad I didn't say no because I devoured it. The flavor combo was on point. The side salad was also yummy and simple as it should be.   The staff was friendly and they have a nice seating area in the back that has some comfy couches which was really relaxing on my lunch break. They have house made pickles which I'm eager to try because they did not have any available when I was there. I'll be heading back to try more sandwiches!!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "LrkuATjnUC7i62ExOXmGcw"
  },
  "roLjmqRhO0oLEueo8ic5-g": {
    "date": "3/3/2017",
    "text": "Fantastic menu with many healthy options...very friendly and prompt service, everything homemade and fresh.  Wish we had this back home in Wisconsin!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IhOsEYKt5TXyr-Qv9NPlng"
  },
  "AbqtpM-JBF-a2F7t1gMd2A": {
    "date": "11/13/2015",
    "text": "Stopped in here for lunch after a morning hike. They have a good selection of both hot & cold sandwiches and various salads to satisfy just about any appetite. The guy who helped us (I wish I remembered to catch his name) was outgoing, friendly & seemed genuinely interested in making sure we enjoyed our food. We got the impression he was probably the owner.   I had the Reuben (hot) and it was tasty & prepared to my liking. My boyfriend had their \"Stacked\" (cold) sandwich and said it was satisfying as well. My only suggestion would be to add another side choice besides chips or potato salad (like macaroni salad ). Otherwise, when I'm on that side of town and want a quick sandwich lunch, I'll be sure to return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Z6O482_BEYiY2As7wDECtw"
  },
  "bvKjISZoYyZjdBnb6howHA": {
    "date": "10/6/2016",
    "text": "This is our very favorite place to eat when we are in Phoenix! The Kennedy breakfast sandwich is so good. We really, really love the blueberry muffins.  You can't go wrong with anything from this excellent place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wNqUK9F3CKr1goL2ghJ13g"
  },
  "rDEVkGkiqtSU8qCF-I6_rQ": {
    "date": "3/12/2015",
    "text": "1st off, I've never felt so welcome or more like a regular in my 33 years of going out to eat. This is amazing because it was our very 1st time here!! We were greeted immediately by the Co-owner, he told us about all of the most popular items, The Snapshot,  Pops chicken salad (my final choice) and the Caprese hot sandwich. He was very knowledgeable with the menu items. He is obviously a dad, he was so patient and great with my 4 year old daughter. She can't wait to go back. The food was great, but the potato salad was the best I've had in a long time. Can't wait to try breakfast there!!  If you are looking for a great/quick/fresh meal with an \"Aim to Please\" type of service, this is definitely the place. Nice job!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t2x4V5JST1UxEFsJtUj8Tw",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. My daughter&amp;#39;s delish PB&amp;amp;J, the wheat bread, oh em gee!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t2x4V5JST1UxEFsJtUj8Tw/o.jpg"
      }
    ],
    "user_id": "-6muf3u-Bq9f7PuGnAcwjw"
  },
  "rkdkHlW5BRruTZZnMEU3Dg": {
    "date": "2/29/2016",
    "text": "So much better than Subway.  Got really lost in Pheonix and found this place after I asked someone who for directions to a nearby ATM.  Food is great and place is really clean. Workers are friendly and they have a lot of variety for both hot and cold sandwiches.  If I were a billionaire, I would buy the place and expand massively but I don't want to turn the place into a messed up chain in Corporate America. I like the small, homey feel to this one.  Great price and great place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TBDi6tr0hs1rPETwULuJTQ"
  },
  "J_WiDiZFAsifPvtrvFmk-A": {
    "date": "2/10/2015",
    "text": "Visiting from Austin, Texas where we appreciate local business.  I am so glad I stumbled upon this spot.  Great coffee and breakfast spot that uses different syrups than the larger chains, and their original breakfast sandwich on ciabatta was perfection.  If you are in phoenix, make it a point to stop by at least once...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Vm8eRpmjXpcOCpLmY6FS3w"
  },
  "NlnJWRqNOxEJEZfrxy4tIA": {
    "date": "3/11/2016",
    "text": "Just came here for the first time and wow was it delicious. It's kind of hidden in this small shopping center. I ordered the Kennedy breakfast sandwich on a bagel and it was sooooo good (egg, bacon, cream cheese, avocado). They have a lot of healthy options as well! I saw them make some yogurt parfaits that looked great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bIMibn-BwuC6LAcEE_6wSg"
  },
  "t_KVl5px37Mlrls_Nawvxg": {
    "date": "12/15/2015",
    "text": "First time.. ordered The Gus... it was incredible... this establishment does not mess around! Great sandwiches... they know what they're doing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N02JwSS55-AOFfEEfz339g"
  },
  "Y25mKAErPqzE32SJDM30JA": {
    "date": "9/11/2015",
    "text": "I work down the road from this place and go here about once a week. The hot sandwiches are my favorite, but have had some of the wraps too. Portions are great and can be spread over two meals if your a lighter eater. Bonus:lunch items come with a side",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dVOargrA-tIScCXrXAdmkg"
  },
  "6YWt0jpr-VfyJjoqKS07bg": {
    "date": "3/31/2015",
    "text": "Had a wonderful experience at \"The Brown Bag\".  All homemade and fresh.  We all enjoyed frappes, sandwiches and wraps.  I had an excellent chiabatta bun that was really soft.  Excellent service and a fresh taste was exactly what was needed on our vacation.  My wife said it was the best meal of the 2 week vacation.  Well done!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "mA8fXOIH4CRaN96pHZvU7A"
  },
  "xj80LTWrsPQQnboM0R6rhg": {
    "date": "7/16/2015",
    "text": "Just ate half of the Rueben I ordered. Oh that bread, that bread is amazing best Rye I have tasted in years. If your a Rueben lover as I am. Get yourself over here and try this sandwich it's the perfect balance. A gentle flow of quintessential Rueben flavors cascading over my taste buds now into the second half slowing down I do not want it to be over.   Brown Bag.... thank you!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r_gEmuztNkAGx1QBXTdPyw"
  },
  "KE_AMuk21pJTRjlzG27Kdg": {
    "date": "11/19/2014",
    "text": "I support local businesses and this place is a great little coffee/sandwich/salad shop. It's a father/daughter run team and they are very friendly and pleasant people. I've been in several times and haven't tried anything I didn't like. Their cookies are amazing! Atmosphere is cozy and there is a great outdoor patio area as well. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MlrfyqSZFrinCx-6GGtuYg"
  },
  "ok7kD93ZqxBZiN50CCeopA": {
    "date": "4/10/2015",
    "text": "My wife and I recently ate at The Brown Bag.  We read the Yelp reviews and decided to give it a try.  Not only did it live up to the reviews, but it surpassed our expectations. Truthfully, we were going to go to Sacks located downtown, but decided we didn't want to make the trip.  I am glad we decided to The Brown Bag, because quite frankly, they put any local deli's to shame.  Also, Jerry, the co-owner, was down-to-earth and didn't hesitate to make conversation with my wife and I.   This place was so good, we had it two days in the row.  My first visit I had the Gus and then the Caprese. Both were absolutely fantastic! I strongly recommend trying it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jeEQkl5FxN_UPmTNY4X5RQ"
  },
  "V_sGrUsbpLUPnalyoY5-sA": {
    "date": "11/13/2015",
    "text": "The food was delicious and fresh.  To top it off, the customer service was great!  Defiently recommend to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Emd1pWycd5aBAneOv4UsFw"
  },
  "fcHPzsEdbmVn2j4A_NPUcg": {
    "date": "2/19/2015",
    "text": "I've had multiple items and everything is always good. There's a nice variety of options along with interesting combinations in sandwiches and wraps. They're really large portions and every bite is delicious. The owner is very friendly and it's a comfortable environment to hang out in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Yko-SCRIrjsV-WTi0AiDjg"
  },
  "lVmYTVP9oMCQF9kM_w_BXA": {
    "date": "12/31/2016",
    "text": "Seriously good sandwiches with fresh ingredients. The bread is wonderful!  The Health Nut sandwich is my favorite!  The cookies are made each day and are yummy. I also appreciate the friendly \"homey\" service. Jerry is great. Really, try this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dnip8UugU1DcV4tQWUMLRQ"
  },
  "9KaLDxcvvAuEiNMNGcPgOg": {
    "date": "4/8/2015",
    "text": "I ate their Reuben. It was good. The atmosphere was great. Had a local deli feel which is nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NVBMkw2RUNfJXuaeHwE1Sg"
  },
  "N_PmFRlaD9iN5yvfCcSjmg": {
    "date": "2/17/2015",
    "text": "I was not expecting such a delicious sandwich, I am thoroughly impressed. I got my nails done next door and just cruised over for a quick bite... The Health Nut was awesome!!!!!! I will surely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "x5hzagMfC8h95LjYb7TGrw"
  },
  "nS285D5Vimrw3ZKEuRGRcQ": {
    "date": "8/31/2015",
    "text": "My daughter and I went here on a Sat around 11 am. We got breakfast burritos that were $7.50 + tax each that took over 20 mins to get without there being any other customers there. I didn't like that i was prompted to tip up front when paying at a place where you get your own drinks at the soda fountain and the plastic utensils are in a tin bucket on the table. The burrito wasn't bad but not worth $8. I won't be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yuVIr3AhEPJ3oiaIcXkcxA"
  },
  "yImXvgE4tbDvNLvf32_EJg": {
    "date": "2/6/2015",
    "text": "Was finally able to stop in for a moment as I've been working next to them for quite some time but sadly start before they open. However today made it and was greeted by some of the coolest people. Not just a welcoming environment but you want to eat a little slower because of how genuine the food is(from scratch) but the owners truly treat you as part of the community. Would highly recommend them. & if you're a fan of Nutella I suggest the banana Nutella muffin",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ens1J5VDo5IhhZbV-wk9QA"
  },
  "5J6mtrNCMB9dZNcYqP_NgA": {
    "date": "3/27/2015",
    "text": "One of the best sandwiches I've had in a long time!  My family is vacationing in Phoenix and we stopped by The Brown Bag to grab some food for a picnic. My wife had the Caprese and I had the Italian Chicken. Both were excellent. Far and away better than the usual sandwich you get at the national chains. All the ingredients tasted very fresh and the price was reasonable for the quality.  The owner brought out our food and was very friendly and personable.  We will be going back at least once more before we go home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UbZX6Ic1q27ehiwxrq1U5Q"
  },
  "sEVzrIFaVcdzvWSYz8RSCQ": {
    "date": "6/5/2015",
    "text": "The first thing I notice about the place are the staff. Good people! Friendly and fast service with a smile. Decor is suitable . tables and chairs but also ample couches and outdoor patio seating. The Kennedy for the win. Eggs, avocado, bacon and cream cheese on a ciabatta roll. Hot, fresh, simple and flavorful. No salt or pepper required. The coffee is always the first thing I try in a coffee spot and their coffee was acceptably hot and fresh and just well normal coffee as expected. Very satisfying. I will try a fancy drink next time....and there will definitely be a next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qzne6aXuvvyb-N40scA-rw"
  },
  "efaOoKEGA3CSiDhN7SjIlw": {
    "date": "10/5/2015",
    "text": "Stopped here for a quick bit to eat and was very impressed. All of their food was fresh and tasty particularly the \"firebird\". Highly recommend this place and will be returning soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nQes4XtS9dTqrBomTQpKHw"
  },
  "xr4woI-OXkaynhW3cGAFhw": {
    "date": "5/4/2015",
    "text": "Absolutely fantastic sandwiches, great courteous service, well be back often! Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DsQ-DriJHYbY7EeroiMXXg"
  },
  "ydcqJaxuZHHFJsMp-f8ssw": {
    "date": "6/7/2018",
    "text": "Delicious sandwiches and potato salad.  Staff is very friendly and it's a very clean and casual place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "utegGLYCi3pBfF7YSamJfA"
  },
  "F7UWQIRkBGuTtc-jBsbYWg": {
    "date": "9/2/2016",
    "text": "This is my awesome local sandwich shop. Classics and originals - all our great! Add to that fresh backed goods and custom smoothies.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_2yNuTi9tRNSNiaA1Gk5_A",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. The &amp;#34;Poncho&amp;#34; breakfast sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_2yNuTi9tRNSNiaA1Gk5_A/o.jpg"
      }
    ],
    "user_id": "dFiTRgfEfk2vA7r5Y3wJHQ"
  },
  "NuXmBRs0JR8bZx6Tnrqv4Q": {
    "date": "3/6/2015",
    "text": "I went to The Brown Bag today for brunch while I was waiting for my daughter to finish a concert at the Biltmore. I love the layout and decor of the cafeand the owners are amazing. It's a very friendly atmosphere, casual, and the food is delicious! I ordered the Benny which has scrambled eggs, ham, Swiss, hollandaise sauce, and spinach on a ciabatta roll and a regular cup of coffee. The coffee was very good, hot and full flavor. The sandwich was served with the ciabatta roll warm and all the flavors work together perfectly, melting in my mouth. It was very filling and delicious. I ordered a slice (or should I say a hunk!! A very thick, generous slice!) of banana bread. It was perfect--moist and dense with the perfect about of sweetness. Yum!   The Brown Bag was so good, I had to recommend it to my daughter and we went back to grab a sammie to go for her. She chose the Caprese Sandwich (pesto, roasted tomatoes, fresh mozzarella, and roasted chicken on a ciabatta roll) with a side of vinegar and dill pickle chips. I'm glad to say she gave me a bite and it was every bit as good as my Benny sandwich. The pesto was on pointe and none of the other portions of the sandwich overpowered the other.   The food, the ambiance, and the people make this a place I will return to and will enjoy introducing my friends and family to this newfound treasure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "N3_jTrhjtfi7Ar0SNpHz0Q",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Main entrance",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N3_jTrhjtfi7Ar0SNpHz0Q/o.jpg"
      },
      {
        "img_id": "Y1zr3beRVtYd4G44SGsreQ",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Patio view from the sidewalk.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Y1zr3beRVtYd4G44SGsreQ/o.jpg"
      },
      {
        "img_id": "-UeyOkc8o43XRsiuvYlIZw",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Another view of inside the cafe.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-UeyOkc8o43XRsiuvYlIZw/o.jpg"
      }
    ],
    "user_id": "Oc8-tjDK5mQRXsrvGmhEVQ"
  },
  "3RyrWfcVN1iF1AgpaUX5Qg": {
    "date": "3/25/2015",
    "text": "Just a quickie here....  This is a new option that's worth checking out.  I got the caprese sandwich.  I tend to like a stronger pesto/motz combo.  I've ordered a caprese salad probably a hundred times and I've learned that my own personal preference is for a very strong taste.  I don't hold stuff like this against a restaurant because it really does come down to personal preference.  It's fresh and well prepared.  Easy parking, easy to find, has a nice little couch area if you want to relax a bit, and it also has some tables outside under shady trees.  Seems like a nice place to get lost in for an hour or so.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IhBd7hFoBAohYOdzHH6f1A",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IhBd7hFoBAohYOdzHH6f1A/o.jpg"
      }
    ],
    "user_id": "Ap0-JqUsibRaVSlTf_HqnA"
  },
  "hgNj2wymQNZLzsd5SlcH4g": {
    "date": "4/22/2016",
    "text": "The Brown Bag is a cool little bag of a find in North Phoenix. My husband works in the area and always wants quick and 'go' foods when we meet up for lunches. Lately, I am into healthier stuff and so when he suggested The Brown Bag, I immediately pulled it up on Yelp to be sure there was more than just carb heavy sandwiches. To my surprise, there was! The Brown Bag is tucked away in a strip mall but don't let that sway you away, things here are tasty. The deco inside is modern and cool. You order at the counter of what could be described as a little like a coffee shop. I ordered the salad that was a special that day called The Siam Salad. The order was delivered to the patio outside, which is lovely in the shade, by the way, within about 5 minutes. Snappy service for someone who only has a bit of time for lunch! My salad was big and good! Lots of freshly roasted chicken breast, sliced red peppers, shredded carrots, cilantro, and a few green onions all on top of LOTS of shredded healthy cabbage! This salad does come with almonds, but I can't.. so they were held. The sweet chile vinaigrette placed on the side added pizazz to this already flavor bursting salad. This was the perfect lunch for this spring day after an intense workout. They also serve coffees with a nice espresso/capp machine to do so with. The teas looked also refreshing! Now I know not all 'brown bag's' are created equal with loads of sandwiches and carbs.. and where as they do offer great looking hot sandwiches, cold sandwiches and wraps, its nice to know there is a healthy item or two or three to wrap your lips and hips around too!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 8,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "k7hpOAC9ITNGrAfonkV9Wg",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/k7hpOAC9ITNGrAfonkV9Wg/o.jpg"
      }
    ],
    "user_id": "1sGYXSkJHPhJ6wQtc-RbZw"
  },
  "aeikQuldrmy18svc5qvoow": {
    "date": "12/6/2017",
    "text": "Ehh... We had heard great things about this place, and I wish we'd had a better experience, but it was just so-so. The food was decent, but we weren't told that we'd be charged extra for picking potato salad over potato chips as a side (and the small, dry potato salad was definitely not worth it), or that we'd be charged extra for water from the soda machine. Had we known we were going to be charged, we would have just gotten sodas!   If not for the lack of communication, I probably would have given this place a 3 or 4. The food wasn't terrible, though the portions were somewhat small, and it seemed clean and well-kept. We just didn't appreciate the extra charges with no advance warning, and the staff weren't friendly at all.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AOOq875ABSynEAUljdLj6A"
  },
  "EOUdQ6rOShRiEP2MdtEqgg": {
    "date": "5/7/2016",
    "text": "Perfect after a piestawa peak hike. The guys working here are all veterans and they put out healthy food with flavor. They even accomadated my vegan sandwich request and it was delicious! Its a simple sandwich salad or coffee cafe, nothing fancy but its very homey and really hit the spot with me.  You have to go through the kitchen to use their bathroom lol, at least you get to see how clean the kitchen is. I make it a tradition now to stop by here after i hike and get a light and delicious sandwich from these awesome guys!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7bhQQHkTdtOucIpdfLAnSg"
  },
  "osshOPbfZFABHIn-panQTw": {
    "date": "5/5/2018",
    "text": "Great sandwich, quick service, nice people! We didn't order off the menu because my wife wanted to create her own sandwich. They were super accommodating and off their input as well! We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DPjuKHYaWzMcuOOVqPI6Nw"
  },
  "lY9GESYEDDfmFvSumfWGIA": {
    "date": "4/8/2017",
    "text": "Not open during posted business hours. Closed at 12:30 pm on a Saturday. Hours say until \"2ish\"",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "I8SwKqpc2YesuE9V5otQew"
  },
  "-LNDu5_DTzlYzWl75PUUqw": {
    "date": "5/26/2018",
    "text": "My boy friend and I can't stop raving about the Fire Bird! Sadly we had to go back to our home states but This place is one of the best sandwich and coffee shops I've ever been too. It's low-key and the customer service is great. I will be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iO_3F-e-XrfYlV0d14yqFg"
  },
  "6wuLFGwOPqyYyDjDiBPjXA": {
    "date": "5/26/2018",
    "text": "There seem to be several good reviews for breakfast, but the lunch service was pretty weak. Not enough employees which equalled a long wait for very average sandwich and overpriced sandwich.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t0oKgmxr3biK8rrco1uZDw"
  },
  "bj_qKsDlmg4Hc6PWQlxJUA": {
    "date": "4/18/2016",
    "text": "The food here is fantastic and the atmosphere is very relaxing. The owner is very chill and enjoys talking to you. I've had a handful of their breakfast sandwiches, but would recommend the breakfast burrito. If you like reubens, get the one here - very, very good.   For locals, if you want to grab something on your way out in the morning, they will take a call ahead and have it ready when you arrive.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "6WYPtBdVh8Iwt96RBGpmSg"
  },
  "ajoyamAeqx_h7l8VD20keg": {
    "date": "5/16/2016",
    "text": "I had the florentine breakfast sandwhich and added bacon to dial down the healthy factor:-)  What goes better with fresh spinachthan bacon! The sandwhich was very fresh.  Although, I started to feel a little bad about the ciabatta bread by the second half of my sandwhich....not because of them at all...just my guilt kicking in.  Speaking of guilt, I also ordered a smoothie despite the fact that I was also EATING...so much for substituting a meal.  I ordered the Maui Wowi(?) with Mango, Banana, Coconut but I asked for Almond Milk instead of regular milk...it was delicious!  If I had  just ordered that and added protein, I probably would have been good until snack or lunch time.  Overall, great little spot!  I may try to squeeze in lunch before I leave for the airport:-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K3Tgvswyt3IiLX086zoncA",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Florentine Breakfast Sandwich...added bacon...yummy!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K3Tgvswyt3IiLX086zoncA/o.jpg"
      }
    ],
    "user_id": "6uWfrB65D4Q7jOhUFPyyag"
  },
  "7CKm3GHnKfjq0hkwWZ0hkg": {
    "date": "11/6/2014",
    "text": "It's surprising how hard it is to actually find a well-made sandwich. This was delicious.   Caprese Sandwich - YUM. Italian Chicken Sandwich  - YUM. Potato salad - YUM.  I heard about this \"new place right up the street\" and am so glad I gave it a shot for lunch today. They're family run, and this is their second location. The first is in Telluride and currently run by the owner's son. I learned this while chatting with him at the counter while his daughter, the chef, made my sandwich. I love local businesses and am so happy to support them. Best of luck!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "z9mjY2mfMn3UZvgyHDXOGQ",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z9mjY2mfMn3UZvgyHDXOGQ/o.jpg"
      },
      {
        "img_id": "vtnmLdFU5CCkoAGtRC9UVg",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Caprese Sandwich with a side of potato salad. Delicious.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vtnmLdFU5CCkoAGtRC9UVg/o.jpg"
      }
    ],
    "user_id": "i4AzAP7gB8Z_-_UBC5cXlg"
  },
  "Od7GBStT20UaL7to8028rQ": {
    "date": "11/29/2016",
    "text": "Had a great late lunch there after a hike.  Great soup of the day-chicken noddle.  My chicken salad sandwich was best in class.  My wife had a great salad that I tasted, and it was superb.  Well done. Friendly and no rush.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQnq1reHh5j-7yTwF1zIyw"
  },
  "KwYyb9cVWIXJNLn3_Ia5QA": {
    "date": "3/20/2018",
    "text": "Awesome sandwiches! So glad we went to this place!! We had the breakfast sandwiches which were sooo good.  We wished we could have tried the lunch too, it looked good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J1ox_0XU0IAB_yinJEgkqw"
  },
  "LpfyaBiNk6vs4ZlTzDlH3w": {
    "date": "7/23/2016",
    "text": "Very cute place with friendly service and top notch coffee to boot. We ordered The Kennedy for breakfast,  and really enjoyed the freshness of the ciabatta bread and ample helping of avocado. One slight criticism is that the eggs were a little overdone,  but we'll definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q8gDfxz87bjb7SNYQtaqqg",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. The Kennedy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q8gDfxz87bjb7SNYQtaqqg/o.jpg"
      }
    ],
    "user_id": "GnQZjXl_6JuP-0Z82U4z6Q"
  },
  "n9bZZ9pVHQ824N_m8Js46A": {
    "date": "3/1/2017",
    "text": "Found this place on Yelp, and stopped in after a busy morning. Overall the sandwich was REALLY good. The vibe of the shop was very mellow. The employee taking my order was very unfriendly, and didn't even say hello, or acknowledge me. I mentioned it was my first time, and he didn't even seem to care. Again sandwich was great, but the experience of ordering was pretty poor..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zcm8RhP_QQApSZUs7buAgQ"
  },
  "pWQ_GActfPUAbwertECtUA": {
    "date": "12/2/2016",
    "text": "Not a local here, but wish I was now!!  ABSOLUTELY DELICIOUS FOOD!!!  Friendly, fast and FRESH sandwiches!!!!!  Love the staff!  They remember you and call you by name.  PLEASE MAKE THIS A STOP IF YOU'RE IN THE AREA!!!  You WON'T be disappointed!!  Wish I could give it more than 5 stars...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qFEl2r1KuojsC6DO5UkJ7Q",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. FRESH, FAST AND DELICIOUS!!  MAKE THIS A MUST-TRY IF YOU&amp;#39;RE IN THE AREA!! Wish I could give it more than 5 stars.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qFEl2r1KuojsC6DO5UkJ7Q/o.jpg"
      }
    ],
    "user_id": "QRlfTrEkoTlixQ3gY1MVRQ"
  },
  "gSbEU5BxjkvVH8EiIpeYZA": {
    "date": "3/1/2017",
    "text": "Needed a place for a healthy lunch as I was staying nearby. Found this place on Yelp.  Liked the menu and Jerry was a pleasure to talk to. Ordered a Maui Wowie and wow, was that a very fulfilling choice. Returning tomorrow to order more on menu.   A good little find in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Vg8AnueX34_a1nsAZUSijQ"
  },
  "1PPbzwRiGspiuZCYOG7DXA": {
    "date": "11/29/2016",
    "text": "The Brown Bag is a great retreat in the midst of the touristy resort across the street. It had damn good food and coffee for reasonable prices.  The biggest five star perk is the friendly and attractive owner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ciWrcsmIQNwI3sEfKpylgA"
  },
  "qyeguBJNg8gaVK0mcT4d4Q": {
    "date": "1/20/2018",
    "text": "I saw this place many times and finally decided to head here for lunch. I got the firebird sandwich it was lit! Must try! The customer service was great the place has a great outside sitting area. Good place to bring your pets and have lunch they have water and dog treats as well. I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IkYBLAt3NTuA976rXKp3GQ",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IkYBLAt3NTuA976rXKp3GQ/o.jpg"
      }
    ],
    "user_id": "j00eY5IPjS85IeidstyVQA"
  },
  "be1Bx2nUvJjcFVUfa0s1ag": {
    "date": "7/3/2018",
    "text": "I have nothing bad to say about this place, it's delicious, reasonably priced, clean and the staff was excellent.  I would definitely come back.  The only reason why I rated it four stars is due to my tough grading.  Between the three of us we got the Paisano, the Stacker, and the Dynamo all of which was excellent but agreed the dynamo was our favorite.  Come on by if you want a sandwich my wife is from New York and says it's not as good as a New York sandwich but is certainly the best you'll find around Phoenix!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AJ5pqYLrZdh2caCjGrMfjg",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. The Stacker",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AJ5pqYLrZdh2caCjGrMfjg/o.jpg"
      },
      {
        "img_id": "MTimabpQaEs9kpzeYyHZbg",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. The Dynamo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MTimabpQaEs9kpzeYyHZbg/o.jpg"
      },
      {
        "img_id": "VX5It87MONA-lfC3Y-5YXA",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. The Pisano",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VX5It87MONA-lfC3Y-5YXA/o.jpg"
      }
    ],
    "user_id": "hD9dANtYmUvsQvUI2e8kng"
  },
  "ZEY-78ZjYbqE6k39L6sQDw": {
    "date": "12/4/2017",
    "text": "First time here & they have really good breakfast sandwiches and a super nice staff! Didn't get to try the cookies/muffins or the regular sandwiches but the original breakfast and the Florentine breakfast sandwiches were great. Also, the guy at the counter remembered our names and said goodbye to us as we left, compared to some places I go every day and they can't ever remember my name...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TczW9iaKB5WWejjYgRx1aA",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TczW9iaKB5WWejjYgRx1aA/o.jpg"
      },
      {
        "img_id": "J8jg8aC5kv14848EemOauA",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J8jg8aC5kv14848EemOauA/o.jpg"
      }
    ],
    "user_id": "xUz4GOXikm7G0iqGzNlWZQ"
  },
  "5-KVrLWPQCOfdseglZaY5A": {
    "date": "7/16/2018",
    "text": "My fam bam and I LOVED this place. We stayed at Pointe Hilton for staycation and were very surprised at what we found on our morning stroll. The Brown Bag is a perfect breakfast stop. We both had The Kennedy, burrito style with added potatoes. It was <a href=\"/redir?url=http%3A%2F%2FBOMB.com&s=ac71b33d32e90570e9c0d70edf9b4cac5f20e98e10501794c62801370f5dd3f7\" target=\"_blank\" rel=\"nofollow\">BOMB.com</a>. Our kiddos had smoothies that they devoured. I'd recommend this place to family & friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMrNlnc8ZK_5Q6iNSOt09Q"
  },
  "TROiJZa8kZ5ktAWxS7bgKQ": {
    "date": "4/22/2015",
    "text": "I recently started a new job which meant finding a new spot for lunch... 1 week in and I think I found my place! Walking in I was greeted by one of the owners Jerry. The Brown Bag is a family owned business and is run by a father and his daughter (how awesome is that!). He runs the front of the house and she is back in the kitchen! Having never been there before, I asked Jerry for his recommendations, He gave me 4 solid recommendations (The Health Nut, The Chicken Salad, The Caprese, and the Snapshot),  all sounded delectable but I decided to go with the Snapshot.   Seriously, let me tell you this - The Snapshot is quite possibly one of best sandwiches I have ever had. It's a hot sandwich with delicious turkey, melted swiss cheese, tomato and avocado smothered with a srirachca sauce on a warm ciabatta bun! What more could you ask for?!  Not only is the food great, But as people came in to pick up stuff to go, he knew a fair amount of the peoples names and preferences. It doesn't get any better than that!  I firmly believe is supporting family run businesses, but when you have the opportunity to not only support a family run business, but one that is run with pure love and passion like brown bag is, it's a no brainer!  So if your looking for a salad/sandwich/wrap that is simply out of this world paired with killer customer service, The Brown Bag is your place! I know it's mine.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "xlcSCAUI8ezK_6Hr4tWTTw",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Tina wrap as a salad!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xlcSCAUI8ezK_6Hr4tWTTw/o.jpg"
      },
      {
        "img_id": "dPOuWfAHrrxz9AB1tCIwEw",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. The Gus",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dPOuWfAHrrxz9AB1tCIwEw/o.jpg"
      }
    ],
    "user_id": "5jz-BicrPZGCp-Mi-oBRUw"
  },
  "QyOguQjmbmMLtsZCcmZeTg": {
    "date": "6/30/2016",
    "text": "Brown Bag is right up the street from my office, and as such makes a great place to stop for a sandwich, salad or, as I've discovered, a breakfast item.      I've tried several of the hot sandwiches and most of the cold sandwiches by now, and while I certainly have my favorites, I haven't had a bite there I didn't like.   Brown Bag has even become a \"go-to\" spot for my wife and I when she drops in to have lunch with me during my work day.   She loves the salads, which are healthy and delicious.   There are a few tables inside, along with a couple of couches in the back to relax on, and for the cooler months there is both covered and uncovered patio seating.    This is a locally owned business, and the owners are friendly folks who are making your food for you while you wait.  Can't recommend Brown Bag enough.  Dine in, or grab an item for carryout.    Either way, you'll be highly satisfied!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "s79vzEzqavL_29pmraXZBA"
  },
  "lvXpWO-6ua9qyFvCif7ZJg": {
    "date": "3/8/2018",
    "text": "Visiting from out of town.  Staying at hotel near by. If your visiting def check this place out.  Real good breakfast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZcDtO12KDGXdIKskq7dgRw"
  },
  "D6wnNbMIxHhOgA3-vVRc2A": {
    "date": "8/19/2017",
    "text": "I went here for lunch with my family and the sandwiches are huge and filled with the most Fresh Foods. The chicken was extremely succulents and the bread was crunchy on the outside and soft on the inside. I had the Chipotle Chicken on Ciabatta. My son had a self-made salami sandwich. He said he could have used a little more Mayo but other than that it was amazing. It's a semi-decent shop that could fit a few tables of 4 and some couches near the end. All in all a good place to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XXuLlv9RKhzNFJS8PM9Cug",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Self made salami.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XXuLlv9RKhzNFJS8PM9Cug/o.jpg"
      },
      {
        "img_id": "BH8LtxIUM5NCaNbOuFfv3g",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Chicken Chipotle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BH8LtxIUM5NCaNbOuFfv3g/o.jpg"
      }
    ],
    "user_id": "TMilGgbY0iUdiGulPFC3Xw"
  },
  "yOWls2YFA_eMQ0BJKijaew": {
    "date": "7/9/2017",
    "text": "Great breakfast sandwich. I had the Kennedy. Delicious.  Looking forward to when their Wi-Fi is back up in a couple of weeks. Once that happens, I expect this place to be a regular haunt.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "beCp2AkaoQlOk3mq-sOa6A"
  },
  "Yb6S0jhEMq96pN9zjP6Ilg": {
    "date": "4/12/2018",
    "text": "The guy that owns this place was so inviting. The sandwiches were yum! We had hot sandwiches, Meatball and Italian Chicken and the kids loved them too. Def check this place out if you are staying at a nearby hotel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "isbLGb9cfE1St-S_VZFK6Q"
  },
  "ohJocEXfkg2hDjNAlH6yyg": {
    "date": "2/18/2018",
    "text": "Such a cute place with a friendly staff who I believe was the owner! Got a matcha frappe and it came with espresso,the way I like it, and got a coffee cake muffin which was 3.50 I believe and well worth it. It was huge! I'm also a Colorado native and the decor serves that maybe they're Colorado based? Idk but I'm always down to support the CO",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AlM-ic2JNJ8RWGMn435DdQ"
  },
  "JiYjH5M8crfLu--yx2tGmg": {
    "date": "4/28/2018",
    "text": "Yum! Tried this place for the first time on Thursday; my parents had brought me breakfast from this place. I had the fruit and maple oatmeal, and the Maui Wowie smoothie. The oatmeal was good, however nothing too special, but the smoothie! So good! It tasted like the Tropical Kickstart drink from Jamba Juice plus a pina colada. I could definitely tell that fresh, whole ingredients were used in it. I've been craving another one!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mmSLEwFZBZXVsqDWEcSVGA"
  },
  "8QnxbQOeTT6d_x_M1fJxiw": {
    "date": "5/8/2017",
    "text": "Adorable and cute location  The menu is simple but has some great combinations that you wouldn't think of putting together.  Ordered the breakfast Merle's Favorite which was perfectly cooked eggs with pesto, salami and goat cheese.  Delicious!!!!!!  Didn't overlook the eggs and salami was yummy.    Place is laid out like a coffee shop with tables both inside and out.  Of course friendly service.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "onsdGSGT81VJzIlk17LdSw"
  },
  "mwxVAyvNasGSnVDAMm9dNg": {
    "date": "4/13/2018",
    "text": "Caprese was delicious, atmosphere was welcoming and clean. Staff was very friendly. Would recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wNxntps7apJJKHw3lnO50Q"
  },
  "v_XRHBZh8bLtLn-YTQSR6Q": {
    "date": "3/29/2018",
    "text": "We came here this morning at 8:23am and order a latte and a vanilla latte.  We received the coffee at 8:59am.  Definitely not worth waiting over 30 minutes for coffee.  They need to have more staff in the morning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wiUXi0ZGioC1QXP6qRjBZg"
  },
  "EbH9cac98-14knY4I76IWQ": {
    "date": "1/25/2018",
    "text": "Great place for salads, sandwiches, wraps. All fresh ingredients, prepared when you order.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MIlkVIP3mPBNbXhmBvud-A"
  },
  "-UeCSVaD3DFDfAfP8SEY-g": {
    "date": "10/11/2015",
    "text": "Just happened to be in the area and clicked my nearby button on Yelp. We were heading for a different restaurant and then I saw some photos from the great photographer John L. in PHX. His food pictures alway make me hungry and in this case it worked instantly.  This place is in an older strip mall that has not been updated in a long time. The decor of the complex is very dated with lots of brown colors and accents. I haven't seen front doors with this kind of details since I was a kid in the 70's.  The food and the service here are spectacular. Everything on the menu is very fresh and the selections are all created with fantastic flavors and textures. We were pleasantly surprised at how good the Sandwiches and Salad tasted.  Ordered the Klob Klub which has Pastrami, Bacon, Swiss, Onions and Jalapenos with their delicious homemade Pesto Sauce on a Hoagie Roll. My wife got the Health Nut Sandwich on Whole Wheat and a very fresh and colorful Salad.  Their menu has several selections for sandwiches and you can get them hot or cold. They also have Wraps and Breakfast items as well. We also noticed that there are also Cookies, Muffins and Bagels as a option. Although on this particular weekend visit they were pretty much sold out.  Definitely looking forward to coming back here and trying out more of their terrific menu. I'm a big fan of this place and I overheard my wife shout ... WOOHOO!  4.75 STARS",
    "rating": 5,
    "rated": {
      "funny": 10,
      "useful": 20,
      "cool": 17
    },
    "photos": [
      {
        "img_id": "BzQrAfyL9_3M3SFJNnFLKg",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Delicious Klob Klub.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BzQrAfyL9_3M3SFJNnFLKg/o.jpg"
      }
    ],
    "user_id": "oUst55rUuv2nKEQ0FgJ5GQ"
  },
  "xw_gvnf-jkHaByDAiEsAlg": {
    "date": "3/1/2017",
    "text": "We visit Phoenix every year and The Brown Bag has become our go-to breakfast spot.  The staff is incredibly friendly, the breakfast sandwiches are great with a nice variety and reasonable prices, and the smoothie selection is the best in the area.  They have a variety of muffins that are made fresh daily in-house, and there is also a selection of bagels available.   For a small casual restaurant, there is nothing else in the area that compares.   This is NOT a \"Let's grab grandma and go out for a nice brunch with mimosas\" place but instead is a great place to keep as part of your daily routine.   Very kid friendly, and there's also outdoor seating.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y8e5CQbDxcc3X23t0yex_g"
  },
  "BOybNv5Oc6vdgVlnkvEYWQ": {
    "date": "9/10/2016",
    "text": "There are a lot of simple deli's out there- this isn't one of them. Although they have reasonable prices, and not the fanciest decor- don't let the unassuming cover fool you. The raving Yelp reviews led my fiance and I here. We live in Tempe so aren't in this part of town much, but we are so glad we stopped in! No line and immediate, friendly service. They have a wide array of sandwiches, wraps and salads (for a low carber like myself, they will turn any sandwich into a salad FYI). All the sandieches are made fresh to order with fresh bread and quality ingredients. They also do fun twists like tuna salad with sriracha aioli, or warm sandwich versions of antipasti salads with pest sauce. My fiance LOVED his toasted Schmoos sandwich with roast beef, roast chicken, fresh lettuce, tomato and bacon of course. All good sandwiches have bacon after all.  If you are in the area and want a healthy, light, fresh meal- you should stop in.  Oh and did I mention that they have fresh, giant homemade cookies and smoothies... Yeah , you're welcome.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Gdp6f9IbkPPEzK-GVeq-ug",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Dynamo spicy tuna and bacon sandwich in salad form",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Gdp6f9IbkPPEzK-GVeq-ug/o.jpg"
      },
      {
        "img_id": "ruBu9DhMcRzvKAqwE5wh7Q",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Schmoo&amp;#39;s club- $8.99: roast chicken, roast beef, cheese, bacon, lettuce, tomato balsamic vinegar, mayo on ciabatta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ruBu9DhMcRzvKAqwE5wh7Q/o.jpg"
      }
    ],
    "user_id": "zemsVfzVyyJDPRg6742H4Q"
  },
  "-H4lD4OBIiXlgnr8s4t8fA": {
    "date": "1/10/2019",
    "text": "Grab and Go Lunch  Brown Bag is a family owned business offering simple breakfast fare, sandwiches, baked goods, and excellent coffee (not the fancy stuff, just real great tasting coffee and teas). I love everything about the Brown Bag- the food, the vibe, the staff.    Brown Bag is a small restaurant.  There are tables inside and out. You purchase at the counter and pick a seat.  The food we ordered was fresh, unique, and tasty. This place has easily became one of my favorite sandwich spots",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 12,
      "cool": 9
    },
    "photos": [],
    "user_id": "MMf0LhEk5tGa1LvN7zcDnA"
  },
  "fFqOZgo1z9cI_NbN4D2qww": {
    "date": "8/23/2018",
    "text": "Best lunch sandwich/salad shop in Phoenix.   Let's just start with the name, The Brown Bag....Classic! This place is unquestionably a hot spot for me. They have everything from coffee, muffins, cookies, sandwiches and salads. My favorite sandwich is the Firebird and my favorite salad is the curried chicken salad salad. Can't go wrong with anything, but those are two I'd recommend to a friend.   The Brown Bag has a lounge area in the back that has a few couches with a variety of magazines. Get yourself something to eat/drink then head to the back and do some chillin'.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "rbxVpQGAD-R6IqeHcMujGg",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Firebird Sandwich with BBQ chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rbxVpQGAD-R6IqeHcMujGg/o.jpg"
      }
    ],
    "user_id": "8EoO7nEgAoqelxAIscXyxw"
  },
  "aj93HhYGvuZQcUvkfClyaQ": {
    "date": "5/27/2018",
    "text": "We happened to The Brown Bag by trusting our pal, Yelp. My mom and I were in the area and decided that we wanted to try something new. We are glad that good reviews took us to The Brown Bag.   The establishment this located in a shopping plaza near businesses. When we entered we were greeted immediately and waited in a small line. The menu is displayed on a large board and is easy to read. As we waited, several people came in to pick up their call ahead orders. A case near the register had baked delights which also provided us with more menu options.   My mom decided to eat a breakfast sandwich with eat. For me, there was plenty of vegetarian options and I decided on a veggie wrap with hummus. After we ordered we waited for a short time and decided we were going to eat outside. We sat at a table and had a wonderful breakfast.   Thanks for the great meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C0ZZpeaH2gSd7JbWApRgxA",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Veggie wrap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C0ZZpeaH2gSd7JbWApRgxA/o.jpg"
      },
      {
        "img_id": "D0SpCWRcUIFZ3ikDwCVMcQ",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Breakfast sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D0SpCWRcUIFZ3ikDwCVMcQ/o.jpg"
      }
    ],
    "user_id": "rNqxPsd008ntFmfVoLu3kw"
  },
  "yAqwBhP7quNBxT9f6ATzRA": {
    "date": "8/10/2018",
    "text": "I have to agree with my fellow yelpers! This place is legit! Seriously, the ciabatta is absolutely amazing! Freshly baked just for Brown Bag, they are pillows of softness, unlike most ciabatta, this one is heavenly, holding all of the ingredients perfectly!  I keep getting Maryles Fav! It's pesto, goat cheese, and egg are so delicious together! The coffee here is also very good! A perfect place to grab Real Food, just like their slogan suggests, it's very True!  They also serve lunch! But be aware, come Sunday when you're looking for that perfect breakfast joint, this gem is closed.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "ED7dq2rT3IWXjSl58CR36w"
  },
  "9nWd0t14kupVUu1sdSfKaQ": {
    "date": "8/6/2018",
    "text": "My daughter and her dad were in Silverton Colorado and had \"the best sandwich shop ever\" it's not often my daughter falls in love with something. She has celiacs disease and finding a place that caters to a gluten allergy is not easy. So when she found out there was a Brown Bag in Phoenix (different owner but same menu and same great customer service!) she begged to get to go.   I had the Reuben and it's wonderful.  Perfect toast on the.l bread, melty cheese and thousand island dressing. My daughter had the Snapshot. Which is turkey, Swiss, tomato, avocado and sriracha (she's 9 and opted for no tomatoes or sriracha)  Not often she will eat an entire sandwich but she sure did today.  I'm taking a coffee cake muffin home for breakfast tomorrow.  Only draw back is I wish they had a gluten free snack (brownie or cookie?) for a treat too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DGRRhKoUOFjVKX1YulIkyA",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DGRRhKoUOFjVKX1YulIkyA/o.jpg"
      }
    ],
    "user_id": "KLi21Zq1i_PXB6L-s0uoRg"
  },
  "3cQMuGLSi8Pu-wnP2DfL9A": {
    "date": "9/15/2018",
    "text": "OMG!! What a find and so near my sweetheart's home!   Coffee, amazing sandwiches and muffins, all homemade from scratch!  The musical ambience is exquisite (Police, Elton John, James Taylor, Beatles, and so many more).  Dine-in or take-out, this is a must visit place, family owned with pride.  Tell Betsy we sent you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DBribNTc7liGXBLxuHKrIQ",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. First time here. My sweetheart Kate recommended it because it&amp;#39;s close to her home and it is very very homie.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DBribNTc7liGXBLxuHKrIQ/o.jpg"
      }
    ],
    "user_id": "YaQVD-VkxMzhBsW6b-n_Vw"
  },
  "42rTZlGbo94XJ3mAFtYpfQ": {
    "date": "3/23/2018",
    "text": "The owner was so kind -- I noticed he knew his regulars by name. I had the original breakfast sandwhich with veggies... soooo good! The egg and the bread was really fresh. My friend got the Florentine egg sandwhich on gluten free bread, which she said was amazing!   There's an adorable outside seating area to enjoy the nice weather! Def stop by for a quick grab and go bite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fdoRtvMeqGDY7o18aVeUMA",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fdoRtvMeqGDY7o18aVeUMA/o.jpg"
      },
      {
        "img_id": "KPot2XmKmyABMjLI_Mh9Mw",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Veggie egg sandwhich - yum! Love the bread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KPot2XmKmyABMjLI_Mh9Mw/o.jpg"
      }
    ],
    "user_id": "0laAfGl9b4kd3YOzGUiTSw"
  },
  "Tu2PicSb_xOmihPSiEU0nQ": {
    "date": "8/8/2018",
    "text": "Must admit I'm pretty butt hurt. Normally go to this place once a month for a sandwich or a salad. Prices are a bit higher than normal but the quantity for what you got was worth it. Today I learned that my normal $10 nice large size Caesar salad is now $10 for a reduced smaller size salad. Why didn't the cost reduce with the size of the salad? Disappointing. Needless to say I'll settle for Salad and Go down the street.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aC6lEtaTGK9b3iTXV50wQw"
  },
  "yGzojoH4c2zvaj3mOoDT1g": {
    "date": "6/10/2018",
    "text": "I decided today to finally checkout the Brown Bag. The name is nostalgic to early school days, which aims at creating an emotional bond with the customer.  This place is across the street from the Pointe Hilton and in the same complex as Gallaghers.   It's a relaxed environment with a few televisions playing local and national news. There's outside seating available with some room inside as well, but it became cramped quickly while I waited 25 minutes for my burrito. They don't have too much staff, so it's a slow pace. *muffins are $3.50 plus tax on a side note*  The breakfast burrito comes out to just under $9.00. I had to see why someone is able to charge that much for such a seemingly small burrito. The house salsa has zero heat to it. After I finished off one half of my burrito and the dismal dollop of house salsa, I grabbed the Sriracha from the counter and demolished the 2nd half of my tasty burrito. The chorizo makes it a bit on the greasy side, but this adds to the flavor and keeps the entire ecosystem from drying out. Cheese is present, but could be upped just a hair to give a more gooey sensation to the compliment the texture of the potatoes.   In conclusion, if you are willing to spend the moola, I'd go experience this somewhat hidden spot. Just be patient or you will be disappointed. I'd suggest against being in any sort of rush if you decide to visit. Thumbs up if I was helpful and/or entertaining!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IcvD4T7T8yHmEwscHVwZ-A"
  },
  "pNhjC9y41M1wfz4Q3cxM2Q": {
    "date": "10/22/2018",
    "text": "If your looking for some good quality breakfast burritos or sandwiches, don't hesitate coming to The Brown Bag. I got the breakfast burrito on wheat tortilla and it's delicious! Eating outside on the patio and enjoying the breeze.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "697ZPCGDMo58XpqICgisVQ"
  },
  "wOQRrcG5w1xuvxTKMIwZUQ": {
    "date": "10/29/2018",
    "text": "I have heard great things about this place and live around the corner from it, but every time I have been in they are out of whatever it is that I want to eat. I am talking like 6 out of 6 visits.   The experience usually goes something like, \"I would like a breakfast burrito\" and the response is, \"Well the potatoes will not be ready for another 20-25 minutes. Would you like something else?\"  So I usually get a coffee (which is pretty good) and go somewhere else.   Also, I have read reviews about the outstanding pastries and muffins here. They always look pretty unappetizing to me, but maybe they are cooking more or something. Along with the potatoes.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lseB2VVmlsuyU9F7-W9KaQ"
  },
  "WfwyOdjI8tgwahrdccVFzw": {
    "date": "9/22/2018",
    "text": "This place is so cute and the staff is really friendly and fun to talk to.  Not to mention that their food is amazingly good.  You can't go wrong here.  I'll definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CgtezsA6IDqe5GmpjZNcAg"
  },
  "pexHoTvgHu_SVeHAFoYc3A": {
    "date": "5/21/2018",
    "text": "Great place for lunchtime sandwich's and salads.  I ordered the Dynamite (Tuna Salad sandwich) without bacon and it was really good. Fresh ingredients with a little kick. The jalepenos could be removed if you don't like spice.  Also ordered a Dreamer frappe and the coffee was great. A little sweeter than I'm used to, but a nice treat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kje4ymvJPTudx1I0wAyMJg"
  },
  "5vF-JsbASieHhwEWK63TtQ": {
    "date": "10/16/2018",
    "text": "The owners are super nice and the food is consistently good. My favorite is the Italian chicken sandwich. Great local spot for sandwiches.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wOlF0R6jB4sbDEmNtkfnvg"
  },
  "p1noREm4o5h5DJvVSLGNnA": {
    "date": "7/3/2018",
    "text": "I lay low these days, having expressed enough opinions to last me. Sometimes, though, I have an important moment, an exchange, that I have to appreciate by vocalizing. Today, that moment was running into The Brown Bag, post-mtb ride. First off, it's hotter than a two-dollar pistol in Phoenix, which is something I want prepared for, rolling into town for clients. I mean, I KNOW it's hot. I used to live here. It's just been a VERY long time since it slapped me in the face, like an ex-girlfriend! Anyway, about the last thing I wanted to do this morning was get up and ride. I found a way to put it off yesterday, and went drinking with friends instead. However, I was tossing and turning and just figured, better to get out of bed and go. Glad I did. When I got done though, I realized the only thing I wanted to do, less than ride, was drink CRAP, free, hotel coffee. So, I figured there HAD to be a coffee place down at 16th and Glendale. I mean, hell, the recent gentrification runs right up to it! Uhhhh... no. So, now I'm pissy. Hot, and sweaty...and it looks like a free CRAP coffee in my future. Oh well, 1st world problems... Riding by Gallagher's, I decide to give a peek and see if there's a coffee place in here. I spy...The Brown Bag. Sandwiches...pastries...goodies...COFFEE! Pues ojala! Woman was so super cool, I'm sitting outside now, and I dont want to leave! She offered me water. She offered me butter. She is awesome. Food I'm having is just as good! My latte is perfect. Perfect size. Perfect heat. Perfect flavor. Same with my muffin. Coffeecake muffin. I mean, holy F! Amazing! Who knew, in a sleepy little outdoor mini-mall with a couple bars, an Italian place, and a BofA, that a cool little spot like this is nestled here. Well, hope you all pay attention, because they could stand to become even more popular, and I hope they do!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tJFXtBqmXe3xbiovIyK7og"
  },
  "VYix58_Y7GYvqTB3cbhVlw": {
    "date": "11/7/2018",
    "text": "Incredibly friendly service, cute and cozy atmosphere and delicious Caprese sandwich and chai! That was possibly the best ciabatta I've ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fiabg6LfckAR0YsYbeZGXg"
  },
  "lTtH69Xk_twZ65Qe5SBPDg": {
    "date": "2/13/2017",
    "text": "Happiness - 2/5 Deliciousness - 2.5/5  With the ultra-abundance of trendy indie coffee houses (and let's face it, Starbucks isn't that bad either), I recommend passing on this place. I went in very late afternoon and despite three people working and no line, it still took roughly five minutes to have my order taken. They were out of small cups, and refused to half fill a large cup, so I had to pay more for my son to get a chocolate milk. I ordered myself a sandwich, which came out lukewarm. The sandwich was fine, but incredibly messy and hard to eat. The mocha I ordered was fine too, but I've had better. I also bought a muffin that was increeeeedibly sweet, but my son loved it!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "QrLTUaXi52Xnx9M40Fv1Jg"
  },
  "QuVoTWn7iPrxy3ME-bdkuQ": {
    "date": "10/23/2018",
    "text": "Great little spot.  Fresh, plentiful, friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z13JegsYnMdMJR77RRduWg"
  },
  "wD96mHubqtO-q4__ZW8q3g": {
    "date": "8/22/2018",
    "text": "One of my favorite little delis! The Kennedy is always delicious and cooked fresh. Great customer service too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vYTthHNAFOqIk_ZhBPlZKQ"
  },
  "vYV4DTKUYQ7b8aTz4D_sjw": {
    "date": "11/15/2017",
    "text": "I love that they are a family owned business and greet you the moment you walk in! Their food is so good and I love how friendly they are :) been here a handful of times but they never fail to impress.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GP_gJRKN6si02SkUAbKSQw"
  },
  "dF7sa50ZZRJN8uLQdbEa9A": {
    "date": "3/4/2016",
    "text": "Great food and friendly staff. Stopped here for breakfast before my flight. Breakfast sandwich was fresh and well prepared. Will be sure to stop here again next time I am in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s3rSTX-L136K0QEQ8GpzzA"
  },
  "5kDA2zsnO2JQ6V1WCUXa3g": {
    "date": "2/16/2016",
    "text": "Great place for coffee, breakfast or a quick lunch.  This is a perfect example of a great, charming small business. The owner makes you feel welcome, serves high quality food and does it all at a reasonable price!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8HAmPYl7dJOmbBhO4c4mFQ"
  },
  "LI_p-mzHg4RNmpX2K1HLMg": {
    "date": "3/18/2015",
    "text": "Had The Natural cold sandwich and it was THE best sandwich I've ever had!  All of the flavors complemented each other and the size was very generous. Very friendly service. I will frequent often. Very very good.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "j68qr6AJ0AZxhn9_3XC2SQ"
  },
  "zK6vos20FBGspzFctfqUTQ": {
    "date": "3/17/2016",
    "text": "We are visiting from Oklahoma and wanted a breakfast spot close to our hotel. This place does not disappoint!! Will definitely come back! Great job!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cGwSBmInUdyPdfVqNjWQ7g"
  },
  "sBwULm3Y19Gl5f_tzjgpqw": {
    "date": "12/4/2015",
    "text": "Was nearby and spotted restaurant as nearby on Yelp. Looking for late breakfast and coffee. Breakfast sandwich creative and delicious. Coffee ok not great. Would go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yen42mr07HEXmGu71O905A"
  },
  "k9SaQscuuPFd6smSl1g58Q": {
    "date": "1/22/2016",
    "text": "Sandwiches were delicious and fresh. Enjoyed the welcome from the staff and small talk while chillin in the comfy environment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H-Eeeq-7hhWqukDxPdYpRw"
  },
  "o4nxXOrFq3KrQWkC7nhlmw": {
    "date": "1/20/2016",
    "text": "Very friendly and good food. I've only stopped in twice for breakfast but intend to give them a try for lunch in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DuO-7bonj6ogypA0LDEIdg"
  },
  "6v-HTlznF-F1oGzuGzRfIg": {
    "date": "1/13/2016",
    "text": "Was in town for a week long seminar.  Did not have much time for lunch.  Jerry took my orders early and my food was warm and tasty.  The cookies are awesome.  Very friendly staff and reasonable prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZvlJXBiAOYObQGPJuGRibQ"
  },
  "pptvJiPjvop_J7iifMKi5Q": {
    "date": "3/21/2015",
    "text": "The breakfast sandwiches are good (has \"original\" add tomato)- yum. The oatmeal is tasty, breakfast burrito was tasty! The whole family was happy. AND the cashier (owner?) was so helpful and nice. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WUF5pnNBFzl4gfkc5kjGXw"
  },
  "xtByuFekpqtm16RERrRH4w": {
    "date": "2/11/2015",
    "text": "Had breakfast there and both of us had sandwiches. Two different sandwiches, both very good. Great flavors, soft ciabatta, perfectly cooked and the girls waiting on us were fun! Very yummy. We're back tomorrow to try the smoothies.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_NOJh1d07MfrrO-GwmuabQ"
  },
  "4AH0RfAV4FQMtdjlcHg6Kw": {
    "date": "1/10/2015",
    "text": "I love this place! Great service and the food is delicious! I recommend the iced mocha with a hot cinnamon bagel or fresh blueberry muffin for breakfast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "A89Zba8e4Bv8_uAya5lMZQ"
  },
  "JETMS1ledrKsEyoxGkK3iA": {
    "date": "1/10/2015",
    "text": "Food was on point and service was even better ! Has that family mom n pop feel ! Definitely will be returning .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "J1g_FTKtw2m458oqvMZbIQ"
  },
  "z4zslt5-dgJPdRw0O97r7A": {
    "date": "5/12/2015",
    "text": "I had to find my old yelp account to write about this place. I went in for the first time today and was really impressed. The owner was incredibly friendly and genuinely cares about his customers. The food tasted fresh and hand made which is so difficult to find. I highly recommend giving this place a try and will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yxXMi02uLWDRFQiuZwgfjg"
  },
  "S1bGm22Bs3YNNE84hQvpAw": {
    "date": "10/24/2014",
    "text": "I have only eaten there 3 times, but the three different sandwiches i ate were DELICIOUS!  The cookies are amazing, if not finite in amount, and huge!  Definitely becoming a regular!  The fact that they have a Telluride location is just icing on the cake!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hoa7EqRibxjNwlZON8i6qA"
  },
  "M2JaaiwzaXQZqHMna7FiPA": {
    "date": "7/17/2015",
    "text": "First time here, won't be the last!! Food is wonderful especially the coffee cake muffins. The staff is very friendly!! Love to support a locally own business: dad, sister & brother.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "92zkNM2aI3T6B_TqRtIhZw"
  },
  "7FXW5a0seAtLLXgNFZ4F4g": {
    "date": "7/17/2015",
    "text": "First visit  yesterday and absolutely loved it!!  The wraps are fantastic. Not going to tell you what I tried because I don't want them to run out. Brought my wife back today. Absolutely loved it also. People working are great as well. No negatives.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tus_Qgp2Z-980epaMiVDVw"
  },
  "BsVFudLFRbjgGiJZTg8xcg": {
    "date": "3/18/2015",
    "text": "Great place! We were staying in the Hilton down the street and came here every morning for breakfast! Fresh wonderful food. Great protein smoothies after a hike up camelback! Lunch here one day as well. The wrap I had was better than most I've eaten. Highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MtQCd8YQx2RrZ25rSx5_Vg"
  },
  "NdNiZQ0Cj8kdIVrvtvWcxA": {
    "date": "2/23/2015",
    "text": "We were here a couple of days ago and had a delicious breakfast. Decided to come back on our way out of town. Good breakfast sandwiches and today we are trying the oatmeal as well. Nice, friendly people too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdQmbtzLPYpog9ElKOMrEw"
  },
  "gY9oMNuPSEYo9ZhpbM0gkw": {
    "date": "3/24/2016",
    "text": "Great place, awesome vib and nice outdoor seating. Food was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a2hwXdnwEQM1CKEHTiSTTg"
  },
  "fp0-TfJD5gTJ4JroXGmBqw": {
    "date": "9/11/2015",
    "text": "This is the first time here, and I will be recommending this place to any and everyone! I got the Reuben hot sandwich and it was seriously the best thing I've ever eaten! Wowzers! And the service was fantastic, very friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0c7LKlxHEK7x2wlpSHkBhA",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0c7LKlxHEK7x2wlpSHkBhA/o.jpg"
      }
    ],
    "user_id": "JC_vpv4vkQ2tqphoJ1eMtQ"
  },
  "XIP5lbKXW7jiTheDpWK1_Q": {
    "date": "12/3/2015",
    "text": "Just left this place & I gotta say I'm super impressed! Love the hippie style oatmeal! The atmosphere of this place is great & the girl working the counter was friendly and welcoming :) right across the street from my work- I will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vYo1QntNACb2zuHOdA65sg"
  },
  "uYCKhxzryn6WcLlfJbRoZg": {
    "date": "6/1/2016",
    "text": "Awesome place for smoothies, sandwiches and cold-brewed coffee! Good service and pleasant, no nonsense ambiance. This was the perfect lunch spot after a hike up Camelback on a super hot day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Kc5zdXNMHM8z0dvRRPHsKw",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Kc5zdXNMHM8z0dvRRPHsKw/o.jpg"
      }
    ],
    "user_id": "nNm_pSBq8C-DCKEvTzXCEw"
  },
  "lO-dOu4hk_4bQYT7yqRojA": {
    "date": "2/3/2016",
    "text": "I really enjoy the brown bag. I'll hang out and work from here every once in a while. The whole staff is friendly and the food is great. I always get the hazelnut latte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NTeMyq3IRsJG3179m5AmGA"
  },
  "l22uck0WrzSqZuWbg4YfCw": {
    "date": "5/21/2015",
    "text": "Excellent food, I get the Paisano. The balsamic vinaigrette is heavenly. Excellent service from the owner, Jerry who is always working. Definitely stop by for great sandwiches and an even better atmosphere. Keep small local businesses like this alive!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5fNcxFF_6GOs_USue5ldbA"
  },
  "vsdXYEsgbeVUqot_jlcv9A": {
    "date": "11/25/2015",
    "text": "The food was amazing and service was spot on!! I had a Pop's Chicken Salad Sandwich and it was wonderful! Jerry the owner was a very down to earth guy. Love these mom & pop shops! Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pwJgWC3vkqUH99rdOKYH-A"
  },
  "a-qh56LvDP9-P3mnzCbyrg": {
    "date": "3/2/2017",
    "text": "Excellent food and service.  Great menu. I have been there two days in a row.  They even have dog biscuits.  Yeah!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iu4a4tsBYusEABeAOEmngA"
  },
  "z_GE8snfd2Mdnk7j-5X04Q": {
    "date": "8/10/2015",
    "text": "FANTASTIC!!!!  Steps away from my hotel. I had the Benny sandwich and could not have enjoyed more. The server was very friendly and helpful. Will absolutely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "90FFmvx3kI2KaH4wHEfRow"
  },
  "7MnQhxRZ3Jms4c1aCVhilQ": {
    "date": "5/23/2016",
    "text": "Decent food but nothing special. Good service and clean restaurant. Doesn't seem like anything you can't make at home.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ljv9PXYwYQSsEM0tbGKyAg"
  },
  "x3FSwoNsG2owZvHKzWNUUg": {
    "date": "11/14/2015",
    "text": "We came here with our kids after a Saturday hike, and it was a great choice. Everything we ordered was delicious, the service was friendly and fast. Great new place for us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5EehxF5ThFG1iqZd5iHejg"
  },
  "n1Jd0_Pw0L6LcTZuk3-U6w": {
    "date": "7/20/2015",
    "text": "It was almost closed when I went by, and my iced coffee from them was pretty basic, so I didn't have high expectations.  But the sandwich was amazing (roast beef) and the potato salad so good it was actually with mentioning.  Nice furniture but needs music.   Really great take out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZsOBCjBFH8Xz6w0et0QoqQ"
  },
  "5lPt4uwPbZoIJWYjWuEzqQ": {
    "date": "12/30/2015",
    "text": "Stopped in as it was close the hotel, Jerry was friendly and the sandwich and salad were great.  Highly recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nh5R11Sm-9gHPYzLOudH2A"
  },
  "-ImIGM7qcnw7qmdq2TJFuw": {
    "date": "2/22/2016",
    "text": "Stopped in and had a breakfast sandwich called The Benny. It was very tasty. The ciabatta bread was fresh and soft. The coffee is also very good. The owners were wonderful.  Definitely  recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bVe_YC3OAadZzKP1h2pyXQ",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bVe_YC3OAadZzKP1h2pyXQ/o.jpg"
      }
    ],
    "user_id": "qkkoCiyKQDRRrTpL72Rcqg"
  },
  "J268rF8NHn2JJ49e5JkDCA": {
    "date": "4/6/2015",
    "text": "The food is awesome, service is a little slow at busy times, but they are super friendly and care about the customers. I've had four or five sandwiches and they are all great, as is the potato salad. The Caprese is my favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gaPKs7Nysh48TqcdZo1e3Q"
  },
  "nnszp_PN14hLvIPJv6Fm2A": {
    "date": "11/23/2016",
    "text": "Great customer service, great food. I highly recommend The Firebird sandwich! I'm moving out of state soon and wish I could take this place with me. I never write Yelp reviews, but this place deserves the praise.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZOWC-jmYIm8Kc8dgo6uBBQ"
  },
  "M3gN_Vx7VjrJDCqjEMdk0g": {
    "date": "1/19/2016",
    "text": "Came here for the first time for lunch. Staff was cheerful and helpful, going the extra mile to get us what we needed. Outdoor seating was great. Lots of options for sandwiches hot and cold, with smoothies, too. We all got different things and everybody loved it. Generous portions!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yhzGJtQExBtOytBphOPnzg"
  },
  "gAXbBQTnSIKJQuNjvL2bew": {
    "date": "3/10/2017",
    "text": "I have heard wonderful things about this place so I went for the first time today... and now I know EXACTLY why everyone says such great things about this place!! the service was spectacular! and I got the chicken salad sandwich.... (which I'm very picky about) and OMG....... FREAKING AMAZING!!! My family and I will definitely be coming here on a  regular basis..and I work at a local  shop around the corner so I definitely will be telling my co-workers about it!! I asked Jerry if they deliver and he said no, not yet but if I order before or just after lunch rush, he will deliver it to us!  who does that!?! only a wonderful restaurant that genuinely cares about their customers! and also did I mention, they are pet friendly??!! They have a giant jar of dog treats and water bowls on their patio area! Thank you so much guys! We are so excited to have discovered you!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kDAYNe9LXGpNmsyM3Y0z8A"
  },
  "gnTad85__c6PUm8QD9soUQ": {
    "date": "5/11/2015",
    "text": "I was visiting Phoenix for 4 days and ended up eating here 3 times. The restaurant had a great atmosphere and the owner was very friendly! The menu has a wide variety of choices. Each day I tried something new and was not disappointed. Great quality, fresh ingredients. I would highly recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IMcd-sFigp4nW90MLj2B8A",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IMcd-sFigp4nW90MLj2B8A/o.jpg"
      }
    ],
    "user_id": "U72V5VGBGGtMIW9zQFEgrg"
  },
  "repUzYPRWuOerCS2pfHC9w": {
    "date": "11/14/2015",
    "text": "Great food and great service! I had a breakfast sandwich, coffee, muffins and a lunch sandwich to go and it was all great. The customer service was outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y-triz_L44eb6oWsTFLslg"
  },
  "J5wrUyS7yI9TR2Lgso0xAg": {
    "date": "8/10/2015",
    "text": "5 stars for the food and coffee. 4 for the space and ambience...and they were out of coffee when we got here at 10am.  Father-in-law used the word \"tremeeeendous\" to describe the blueberry muffin which I have to say I was drooling over.  I had the original with chorizo which had just the right amount of spice. Wife had the Florentino which she def gave a 5 star. The ciabatta was fresh...not to chewy, not to tough and crunchy. Coffee was strong and yummy. Gotta be careful, it goes down so smooth I got a buzz in no time. Highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l9G9qMq0M97HP6LWN3akVA"
  },
  "saAjk-RD7iEDhIKqhRrE4w": {
    "date": "11/13/2017",
    "text": "Tucked away in a shopping center by the Hilton resort, this place does not disappoint. Had the Kennedy breakfast sandwich. The bread was light, crusty, soft and warm. The eggs and bacon perfectly cooked, and the cream cheese and avocado deliciously rounded out the sandwich. Wish I had time to try everything on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E47kL36iR-uF0mGpOuWeOA"
  },
  "T355OMeTCTWMO7LBglKkgA": {
    "date": "4/8/2015",
    "text": "Best Blueberry muffin I have ever had! We got a little of everything and they where all great! We got a bagel with butter and it was Amazing!!! The egg whites and bacon where Delish. I loved the breakfast burrito without veggies. I would highly recommend this place. Great service!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "esygDI9AdnJV_VWC-1EzIw",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. Front of the store",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/esygDI9AdnJV_VWC-1EzIw/o.jpg"
      }
    ],
    "user_id": "f85tuEogBCpWN3ACtnv0ug"
  },
  "lr1GAJ0AiKCMWhdJIG6I0A": {
    "date": "11/21/2015",
    "text": "Nice place. Quaint. Maggie the owner is personable and made me a great \"health nut\" sandwich!! I'll definitely go again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kSpmpadKF_tM5g8b9oWObw"
  },
  "6aCJhCNZEl-woK6KeizdJg": {
    "date": "5/7/2016",
    "text": "What a surprise! Don't be fooled by the seventies graphics on their sign! This place makes amazing sandwiches. Found it through Yelp and we will definitely be back. Comforting in its simplicity and care...the way sandwich shops used to be in the seventies! Loved it. The Reuben rocks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ko3fxApPZSSQXXY6pjecwA"
  },
  "nsc-50Q1Cx4MBy4XdXilwg": {
    "date": "9/16/2016",
    "text": "Best sandwiches in town.  Great service!  We loved the K-lob club was amazing!  Thanks Ali for the great food and service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S_-wT5gKQZaJXrxt7dsNPg"
  },
  "ABKyg3AGBSzJJcldIL-gVg": {
    "date": "3/30/2016",
    "text": "We were staying at the Hilton down the road and decided to check the Brown Bag out based on it's reviews.  We were not disappointed, food was delicious and the staff was very friendly!  I would highly recommend them.   They are the real deal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IQ88tJBSIYIEMhT4y-BgBA"
  },
  "eIYmlH0MGFZN9xBU1qObug": {
    "date": "3/11/2015",
    "text": "I absolutely adore this place!  Their original location is in Telluride, Colorado (where i grew up) -- and when i found out they had a location here in phoenix, i was leaping for joy!  It's my little piece of home all in one sandwich shop.  The owners are super friendly. Im surprised to know that jerry remembers my mom back home, cuz they used to do business together.   I highly recommend their \"Benny\" sandwich. Basically an Eggs Benedict on ciabatta.   Will be definitely coming back again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QzIkNFvDd2LAlGx-2PXzhg"
  },
  "c-SJymvIwHU5RackJPlq2w": {
    "date": "7/28/2016",
    "text": "We ordered the Kennedy Breakfast Sandwich and the daily special- the Jae's sub. I live right down the street and heard such great reviews about this place and was excited to finally check it out. Such a disappointment. The daily special was the worst $10 sandwich I have ever tried and the breakfast sandwich was hot, but with runny eggs and zero flavor. Would not recommend this place for someone looking for fresh flavor and a meal worth the price.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DdHEiFb1eOA11ex3zhHjrw"
  },
  "BEa6zQ5GZz0C8DZbVtN6jw": {
    "date": "9/16/2016",
    "text": "It's a great hidden gem. It's perfect if you are staying at the Pointe Hilton Squaw Peak and want to get away from the over priced food at Rico's. The food is fresh and the baked items are great. I wish they had more of a diverse selection of baked goods but the ones they have are great, especially the chocolate chip cookies. If you are looking for some good food that is reasonably priced come here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j37EyagAnpE4cs380gJTOA"
  },
  "4or-S893A4QuxnUHsV5O8A": {
    "date": "5/21/2016",
    "text": "I love the way my coworkers drool over my lunch when I bring in my Brown Bag takeout!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-QbrI8dAnut8gxHiOfpgVQ"
  },
  "5wLebWQ00cPPWZ8ZkgrGWA": {
    "date": "3/9/2016",
    "text": "Stayed at nearby Pointe Hilton and ate here every breakfast and lunch. Wanted fresher food at more reasonable prices than the resort.  Good clean deli with great service and healthy good food. Opened at 6 which is good since I was on East coast time. I really enjoyed the Kennedy for breakfast and the Pops Chicken Salad sandwich for lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wx-UXhtm3ro9Px2r9HmLmw"
  },
  "FaLE_q3A0a62iTNOqzIsCw": {
    "date": "7/9/2016",
    "text": "We are really sad that we live 10 hours away because we LOVED this place! We even went back 2 days in a row. The staff is helpful and friendly. Our food came out very quick, and everything we tried was delicious! We suggest the K-lob klub, and firebird hot sandwiches. Our 2 year old devoured the plain Jane oatmeal-how can one go wrong with brown sugar and raisins?!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RXGaYE5xm_pR3GGc5X9sAg"
  },
  "FXqA-GW0TLd861b_y3KTYQ": {
    "date": "5/27/2017",
    "text": "This is a great little, local sandwich shop, a must try if you are in the area and even if you aren't and you want a good Sammy it's worth the travel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xl_p16rnBMMvMOkXwSiAdQ"
  },
  "bpl95Bamc5ljEAwRfY8TAg": {
    "date": "6/30/2016",
    "text": "This little shop right here knows how to make a great sandwich. Quality every time you go. My personal favorites are the Paisano, The Reuben, and the Smoo. Half sandwich an half salad lunch special is perfect! Great place and great owners!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AxVrgLgPlrKvStxHuKYa7g"
  },
  "PTAIJN5VCLjjcaKag3lBBg": {
    "date": "6/23/2017",
    "text": "First time here today. Ordered the Health Nut sandwich with potato salad as my side. The salad was very dry and in a Costco size sample cup. I must say the sandwich was very tasty but lacked with amount of turkey on it. This is the reason for only 3 stars - I felt this sandwich was extremely overpriced for what I actually got. NOTE: Just saw on the take out menu the potato salad is an extra dollar. Didn't realize this when I ordered as I was only given side choices, NOT TOLD this was extra!  Save your money and get one of the sides that come with sandwich. It was definitely not worth any extra money.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NQkP9T1HXb0AlbrR4kPiLQ"
  },
  "qckLb7RK41xLTOsJC2JndQ": {
    "date": "6/15/2017",
    "text": "It was a fairly early morning and I really wanted some coffee and a muffin. I found this place on yelp and headed on over. The coffee was very good, I got an iced latte with hazelnut and vanilla flavoring. I also got a coffee cake muffin and the inside was good but the edges were hard. My total was $9.42.. that was a little pricy so I won't be back",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pDkx1Z5lSTgFPpWEhctL0A"
  },
  "UhrfY7_TleYniZgyaGbjug": {
    "date": "7/17/2015",
    "text": "And I love to day dream!  Ali whips up a serious cup and the menu is fresh and has great variety.  They have weekly specials too which is nice to see.  The Kennedy sandwich is on point, you cant go wrong ordering the avocado, bacon and egg marriage!  Back to my Daydreamer...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "99mAIwkMiNZWx-Hz3GWh9w",
        "caption": "Photo of The Brown Bag - Phoenix, AZ, United States. The Daydreamer, it does not disappoint!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/99mAIwkMiNZWx-Hz3GWh9w/o.jpg"
      }
    ],
    "user_id": "pQDy4B-hRcc6gs3123dCzA"
  },
  "pLld_7lBsmNX4Ocq19xvFQ": {
    "date": "4/23/2016",
    "text": "Great breakfast sandwiches  and very friendly staff. Their cibata bread was moist and soft and not the typical dry and dense. KENEDY and especially PONCHO are delish!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_sS75Eur7lNMTCvSuu4YJw"
  },
  "pAQJ8HEqkHi-BYo2avejag": {
    "date": "3/18/2016",
    "text": "The sand which and latte I had here were good, but what really stands out is how they treat their customers. Their customer service is top notch. Also, the atmosphere has a really nice vibe and the outdoor seating looked very relaxing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s95vx3xjemGYd5qdZgRX4w"
  }
}