{
  "nz-rI9uGcLq3eD8jsXFXqA": {
    "date": "7/13/2014",
    "text": "Come hungry!!! The veggie fajitas are amazing!!! :) Onions, red & green peppers, black olives, zucchini, cheese & pico + sour cream. Awesome! Tortillas are fresh and I can't wait to go back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dtnPCDPkdC6K5g_lKBtVFQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dtnPCDPkdC6K5g_lKBtVFQ/o.jpg"
      }
    ],
    "user_id": "iok89dK1a8kxIDtXazo8FA"
  },
  "G5iIUggcmXOZogDJuStoWA": {
    "date": "9/26/2013",
    "text": "I don't know what it is but I just thought the quality has gone down since when we used to come here all the time. The salsa was very bland and extremely thin. I like my salsa thick and chunky. The chips were good however. We started off with a cheese crisp and a side of guacamole. I liked how the cheese crisp came with a side if diced green chilis but they were cold. Would have been much better if they would have cooked them onto it. The guacamole was alright however I found myself adding a bit of salt for flavor. There were three of us and we ordered a 1/2 pound of shrimp and a 1/2 pound of chicken. They really skimp on the bell peppers. You only get one little slice on the top and it's not even grilled in with the rest of the onions. In my opinion bell peppers are a normal part of fajitas - not an afterthought. The homemade tortillas they serve you are good although they are much bigger and thicker than they used to be. I definitely do not like that change. I prefer smaller thinner ones so you can eat more of them since I like to mix them up and have a different variety of toppings on each one. So it was an okay dinner but not someplace I am going to run back to anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ek4UZbsT3lIohXs0j4P03Q",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. 1/2 pound Chicken fajitas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ek4UZbsT3lIohXs0j4P03Q/o.jpg"
      },
      {
        "img_id": "2strv6uIyjkMWdNnt0kH9g",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Side of cheese, sour cream, and pico.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2strv6uIyjkMWdNnt0kH9g/o.jpg"
      }
    ],
    "user_id": "2n1VIiuJueBRHDytgTq9Zg"
  },
  "4L3y0PC-YLLPy3hkrHaTyQ": {
    "date": "6/6/2017",
    "text": "It's not True Mexican food it's more Tex- Mex then Mex. Chips and salsa are good, food is good, but the best is their tortillas. They are made fresh, thick and fluffy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OGufU1fcIoHbnoo-ugWfDg"
  },
  "86GfVh1TDCoiaILUYdp_ZA": {
    "date": "5/28/2016",
    "text": "Been eating here for 18 years, never had a bad experience. Shrimp fajitas in those fresh warm shells are fantastic. Cadillac steak and the chicken fajitas are also great, but the shrimp is the star. Queso dip is good too!  Margaritas are good, beer is cold and the service has always been great... what more do you need? Go early if it's a weekend, place gets packed fast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9EP_rKBnl2imQuZsQI_rUA"
  },
  "qIFgR4Axcc9uQyeA67_oAA": {
    "date": "10/15/2017",
    "text": "The term quality not quantity really struck a cord for me at this restaurant. This was my first visit to Fajitas. Though the staff were friendly and accommodating, my first disappointment started with the salsa. If you are a fan of pace picante, this is your place for chips and salsa. Browsing the menu, I noticed the fajitas starting anywhere from 22 bucks but thought it might prove to be worth the price. After seeing other entrees come out, I opted for a salad. Once our food came out, I was optimistic seeing that the portion of my salad was huge and the many fresh and colorful toppings. My salad looked appealing but my parent's enchiladas and chicken fajitas just looked sad and less vibrant. The chicken that came with the fajitas only came with one breast and was very thinly sliced on a bed of white onion, one slice of red pepper, one slice of green pepper, and one slice of red onion. The rice was almost positively instant rice and the beans canned. The chicken Baja salad toppings lay on a bed of iceberg lettuce and 3 pieces of romaine which were overly sopping of water or whatever they use to clean the lettuce which made my ranch watered down and toppings soggy as I started to eat it. I picked up a piece of lettuce to notice a ton of water on my plate underneath the lettuce. I ate the avocado, chicken and olives and left the rest just disappointed and hungry. The best I can say is if you want to go just for homemade tortillas or dessert then have at it because our ice team taco was good. All in all our bill ended up being $80.00 and for what?",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dvd-ncHqI0AN3ZdXgGInHw"
  },
  "EwJHpDA-VXIeCZPsX2n3EA": {
    "date": "5/21/2016",
    "text": "Was in the mood for fajitas and found this place on Yelp. I'm new to area and had a friend who lives in the area meet me there.  We both agreed this place was awesome.  I've traveled quite a bit and these are the best fajitas I have ever eaten. We had half Cadillac and half chicken. Both had great flavor. Will be going back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bfjZrXGZu7Ba2tml1LT8EA"
  },
  "-sP_0ce8HrngmWldE-e4og": {
    "date": "7/17/2015",
    "text": "You don't get your bang for your buck. The fajita pan was mostly onions. Tons of them and 1red pepper ring and 1 green pepper ring. Disappointing. Plus you leave and your hair and clothes smell like the restaurant. Chicken was dry. Hadn't been there in years and won't ever go back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "CU4-xoh00QhcRLehpXil7w"
  },
  "ixECvuNpsR8nd_lacmMZcA": {
    "date": "4/21/2014",
    "text": "I've been coming here for years but this is my first yelp review for this place. The Fajitas Restaurant is probably pretty well know around the valley and for good reason. They make some of the best fajitas in the valley. There are probably only a handful of smaller restaurants in the valley that put out quality fajitas like this place.   Fajitas does entrees other then what they are known for but why stray from what they do best. The fajitas served here come family style with all the cheese, sour cream, guacamole and pico de Gayo on the side. The meats come out smoking hot and smelling fantastic. Choose from chicken, steak and shrimp for your meat, it doesn't matter what you pick because they all rock. The only thing better than the meat is the fresh tortillas. The tortillas are served warm and soft for easy fajitas building.  The tortilla chips served for free before the meal are a meal of there own. Salsa is complimentary but if you want a real treat get the queso dip for just a few extra bucks. This place serves beers, soda and just about any other alcoholic and non alcoholic beverage you can think of.  The staff is always friendly and I've never had bad service in all the years I've been coming here, even when it's busy. The restaurant and bathrooms are clean and the atmosphere seems geared for groups so bring the family. There is even a kids menu that would please the pickiest of eaters. Prices are fair and on par with comparable restaurants.   I would definitely recommend this place and I will definitely be back for years to come. The only reason this isn't a five star is because the wait to get a table can be long at times, but that speaks the how good this place really is.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hZEV1dgTHdIDMiLOFqt61A"
  },
  "FMjnPeldWSBwhgnWDxeGAw": {
    "date": "5/30/2017",
    "text": "Waitress was phenomenal!   Every thing tasted great!We had chicken, pork and beef fajitas.   Home made tortillas were great.  Near the end of our dinner, a cook stood on top of the stove and spread aluminum foil over the air vents and then proceeded to place fryer baskets on them to dry.  He didn't clean the surface after his shoes were on them. eeeeew!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JfCCgm-RmI9yhhCLalFfmQ"
  },
  "rHQBPz3BG0VcLw8Po9pm_w": {
    "date": "10/29/2016",
    "text": "The love for Mexican cuisine made us try this restaurant.. Food first, it wasn't that bad but certainly overpriced. The worst part was the service by the server named Omar. He was pretty rude to us. When asked to provide a plate, he refused and also handed us a very tiny to go box without any paper bag to carry it. Don't know what was so funny that he kept staring and laughing at us. He was being sarcastic when we asked something about the food. The server spoiled our otherwise happy dinner. Go their for the food and ambience but certainly hope you get a better server and certainly not that annoying Omar.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qBMCNX5vA5SxTjHxT7SNhw"
  },
  "70V_WPj_iaxtVs2XCobSsQ": {
    "date": "12/19/2013",
    "text": "Born and raised in this place for the most part. I've been coming here for over twenty years. This restaurant is not traditional Mexican food but it makes no claims to be. The fajitas here are the best in Phoenix hands down. The seasoning on the meat and shrimp is perfect, the salsa and queso are both fantastic. The customer service is phenomenal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-eYOFZAoA-W0xMT2AbsKNg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Chicken quesadilla with pico de gallo and guacamole.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-eYOFZAoA-W0xMT2AbsKNg/o.jpg"
      }
    ],
    "user_id": "QP1szRQ_YTt-rK2UOhuIew"
  },
  "Wu-XzzfU6vHrGvpP5Yz0QQ": {
    "date": "4/20/2014",
    "text": "Great food and service has always been attentive only negative is making groups wait in the lobby until everyone arrived especially when the joint is not busy. It would be nice to have apps, a drink and visit during the wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rcL_47Xv_4ZU9AblNkYlcw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Con Queso and Fiesta dip excellent apps",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rcL_47Xv_4ZU9AblNkYlcw/o.jpg"
      }
    ],
    "user_id": "7NsdwXn0ceuGbkyB2YeCeg"
  },
  "GgGBsmfDieZIR6kjnof3Rg": {
    "date": "5/26/2016",
    "text": "Oh what an enormous disappointment... I grew up coming here. I remember my mom taking me here as a kid and they had the best fajitas. I decided to try them again for the first time in 15 years and I was so excited and then so incredibly let down. The first thing I noticed was the decor. It literally hasn't changed in the last 15 20 years. It's completely outdated. Next was the price. Are you kidding me? $30+ for fajitas!??? The owner has got to be out of his mind to charge that amount. I have never in my life seen fajitas so expensive. Literally double of any other restaurant. It's completely unacceptable. I should have walked out right then but my BF convinced me to stay and we'll just share an order so we can at least try them. Soooo- incredibly not worth it. Not at all. The shrimp were tiny, the steak was well over cooked, the tortillas were very small and they only gave us three even though we were sharing. We asked for more but was told it would cost extra. There was barely enough food for one person let alone two. The chips and salsa were okay and because of their overpriced ridiculousness we only had water, which tasted dirty, so it was tap water, not filtered. I would never go back here. I was so saddened by what has happened to this place. A place that used to be beyond popular is now a place to avoid. Lower your prices by half, up your quality and quantity and maybe we'd return. There are many other places that are way better in price, quality and quantity then this place, so don't bother.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 9,
      "cool": 6
    },
    "photos": [],
    "user_id": "v8QnvfWXCf4651Bxg2vvIw"
  },
  "ckF34nsQcGnyoNHSbjTmCA": {
    "date": "5/2/2015",
    "text": "This was the first time we've been here and for some reason the waitress was just not happy about being our server. Very nice to everyone asking if everything was good offered to fill their drinks. I had to ask for more salsa and more water. When it was time for the check she was just passing by put the check on the table and said \"here's your check\". When signing my receipt I hear her ask the other table if they wanted dessert....hmmmm. Thank you Tiffany for showing us great customer service.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ho83SruaO_djrCIsw6U5dQ"
  },
  "TVDiQpPxmLf3eUo30l2GLg": {
    "date": "7/29/2016",
    "text": "I would never come here again, it was my first and last time! My party arrived early but they kept pushing our wait time, even though party's just as large, whom we arrived before, were being seated before us. And as we asked a couple times on a progress report for our seating time, the hostess-chribak-was extremely rude and condencensing! The only decent host was some beach blond make (didn't catch his name), only because he brought our party chips and salsa as we were waiting in the hall way. However, the chips and salsa was garbage. By the time we got seated, an hour later, they only provided 6 menus for a party of 10. So that was exceptionally inconvient of them . Our party order 2 chicken and 2 beef fajitas. Upside food came out pretty quick, downside food wasn't that great, little to no seasoning, chicken was dry, the flour tortillas were not good at all and I love flour tortillas, these were extremely bland! Our waiter-Daniel-was great at attending to our table given the party size, also he was entertaining, not afraid to crack jokes with us- best employee we encountered that day. Another review was on point, the water was the best part!  Again I will reiterate, I would never go back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "L5cF5z1oZH989V5ttuMKmA"
  },
  "8sYc5p671FHZqRk_PQt-Dw": {
    "date": "9/9/2016",
    "text": "The only good thing about this place was the mints offered on the way out the door. Horrible food. How do you mess up cheese enchiladas and a burrito? Dry rice and beans and the queso sauce - don't even bother. I will never be back here, ever. Waste of $40 for 2 entrees and 2 sodas.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kLfXlJI1Hs7gfgp3CLXtVw"
  },
  "2QT17c1Qqw7Uz86hvJDePg": {
    "date": "4/2/2016",
    "text": "After looking at tbe website, this place turned into a pleasant surprise.  The atmosphere is very nice, a lot of seating, and a full bar.  The food was delicious; and even though the prices sort of took me by surprise at first, the portion size and taste of the food made me more than happy to pay.  All things considered, I would definitely come back to this restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VI5i7pbAX6a3zA7XUrz-w"
  },
  "jNruxuZOvHhYidg-oToS8w": {
    "date": "1/27/2016",
    "text": "I had not been here for at least 20 years. Saw it on the PBS show Check Please and realized it was local! We went there 4 or 5 times last year and every time it was excellent. The service and food are always spot on. The have someone making tortillas all night and they are so good. The grills are in the middle of the restaurant so the only problem is that you smell like grilled onions when you leave, but that's a small price to pay for a great dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3vaLTWPc0AWd-DmDiPN0Sg"
  },
  "9LqnTkrweRTc2RaydFVExQ": {
    "date": "12/27/2015",
    "text": "Got the steak/chicken fajitas. They very tasty! I loved the seasoning on the chicken. The caramelized onions were my favorite, though:) 1 lb was enough for 2 adults and 2 children.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "75LdZTFqClHSaBkbbdtWzw"
  },
  "fhOYXnmsQYSF706B84KmLw": {
    "date": "9/22/2015",
    "text": "HOW ANYBODY COULD NOT GIVE 5 STARS IS BEYOND ME. This restaurant has been a family staple for more then 27 yrs. Always excellent tortillas and fajitas.  The staff is always a step above with friendliness and attentiveness.  Good chips and salsa. Great meats and guacamole.  I am told they have the same manager since the beginning. This person clearly understands the DNA of good food and good service. Thank you for being a place we can come and bring anybody for special occasions and awesome date nights.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nK0uO8UyUfRzvQ1VTaBrvw"
  },
  "kaBv0ExPdj8jK7qfiN1-2Q": {
    "date": "8/8/2016",
    "text": "Ordered chicken fajitas and had then saute onions and peppers.  Was so yummy.  While I'm not usually a fan, I came starved towards end of night and best I have had in a while.  Service is 5 stars sadly I forgot his name but our server was a younger gentlemen and he was so on our order and provided exceptional service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YuHlqGKGw8K_GpXy2-VmfQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Sizzling Fajitas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YuHlqGKGw8K_GpXy2-VmfQ/o.jpg"
      }
    ],
    "user_id": "sGO-stZSJKX39qzKfUraYw"
  },
  "nODqAs12VFj0KKRybVvrOg": {
    "date": "12/27/2017",
    "text": "Went for lunch. Seated quickly and greeted promptly. Warm chips and salsa arrived within a few minutes with the drinks.  Ordered lunch special fajitas with steak. Fajitas arrived with raw onions and 2 raw slices of green pepper. Steak was poorly seasoned and seemed to have been sitting out for awhile. The tortillas however were amazing! This is the second time we have been here and has bad experiences both times. Not coming back! #gringofajitas if you want real fajitas go to Mi Pueblo around the corner!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "szaYgR_OKgaexFqh5BEF7g"
  },
  "F73ejiM6ggqyGLWKSL26TA": {
    "date": "7/8/2018",
    "text": "My first time at Fajitas, and most definitely will be my last.  The best part of the meal were the free chips and salsa.  They are the same chips and salsa that Chili's has.  Ordered the queso dip with pork, which was actually very good; however, the portion was miniscule for the price.  Next, we ordered a pound of the Cadillac Fajitas.  It was the worst $38. I spent on a meal.  It consisted of a few steak strips and a ton of soggy, greasy white onions.  No peppers, no seasoning, extremely bland and oily.  The tortillas were homemade, but way too thick and chewy.  They were like thick slices of bread, the weirdest tortillas I ever had in my life.  It also included a ton of sour cream, cheese, and Pico.  That's it - no rice, no beans, no sides, nada.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xxsl3zab2cogbXPGF_6WVg"
  },
  "2gqgoXzMuSGENi5qm49H7Q": {
    "date": "2/7/2016",
    "text": "This is THE best place to get fajitas. Their tortillas are made there, on the spot - you can watch the magic unfold.   The salsa tastes super fresh, and any meat you get for the fajitas is always amazing, even the vegetable fajitas are amazing. The service is on point, my family and I are in and out in no time. We live about 45 mins away but still drive here frequently for dinner. It is a great place to take kids too! My favorite restaurant in the state.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "M1VvexxzZb-IWqfdWkjyng"
  },
  "RG7ZSs6gooX5mFUTTxbnUQ": {
    "date": "3/8/2014",
    "text": "I've been coming to Fajita's for ages but haven't been here in a long time cause it's so far away. Today was my lucky day to come here. This place has the best fajita's bar none  There is always a long waiting line so I recommend that you get here by 6pm on the weekends. We had a small party so we only waited for about 5 minutes.   The chips and salsa is so good. Chips are always so fresh and the salsa is on mild side but really good.   We ordered a half a pound of pork and half pound of chicken with two sides of Mexican rice. The tortilla's are the best in town. No one can even match these tortilla's. A little thicker than most but so good. Pork and chicken (all white meat) was so tasty with onions and bell peppers. Each order comes with a side of cheddar cheese, guacamole, pico de gallo. BTW, it comes with sour cream but we switched it to guacamole with no extra charge. As always, fajita's were great and we really enjoyed it.   As for the service, our server didn't let us wait and had our drinks at our table right ways. Once we ordered, our food was on our table in a flash. The server was great and kept on refilling our drinks all the time. I had a brain freeze and paid for our meal and walked out. Our server ran us down and personally delivered my credit card. Very cool and I appreciate all the extra effort he gave to make sure I got my credit card in the parking lot.   As i said before, best fajita's in the city, best tortilla's and wonderful service. Another great evening and great meal. Come ready to fill your tummy. Enjoy.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "yYHL1k0PSXvPuDtXtPUeWA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Chicken fajitas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yYHL1k0PSXvPuDtXtPUeWA/o.jpg"
      },
      {
        "img_id": "lO69vVroMgkOHn78idt_sQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Pork fajitas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lO69vVroMgkOHn78idt_sQ/o.jpg"
      }
    ],
    "user_id": "asL1d04xS3y8YQtU5ota-g"
  },
  "AFw1aCzwvHyJzXmFrbQ_Dw": {
    "date": "7/5/2016",
    "text": "Have been going to Fajitas for several years! Never disappointed! Service is always exceptional!  We ask for Ruben whenever we go! He is an unbelievable server! attentive and professional.  You must go!  Our go to is steak/shrimp combo! Perfect!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PT6GrJLyXYtXvprtQ79IMQ"
  },
  "Q-SD6UvWuSySpkQZ_r9S9w": {
    "date": "8/10/2017",
    "text": "I wish I could give Fajitas 10 stars, it's my favorite restaurant in the Valley. I've been coming here since I was 7 years old...1987!!  The food is spectacular... in fact, it's what I've always judged ALL fajitas on (as in, \"yeah these Chilis fajitas are ok.. but they're not FAJITAS fajitas!\") I introduced my husband to Fajitas back in 2001 and it quickly became his gold standard for fajitas as well.    The chicken is seasoned and cooked perfectly and the tortillas! Omg the tortillas! I could eat them all day. Even the chips and salsa are perfect. The staff is always friendly too!  On a personal note-I also love that the place has not changed in 30 years. I cannot tell you how much I love being able to step back in time like that. I open that door, I'm hit with the delicious aroma  and I'm a kid again. We were there last week and they had 80s music playing .. it brought back so many memories of Metrocenter , Golf N' Stuff (err.. Castles & Coasters)!  Awesome.  :)  Here's to 30 more years!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PkCPqQQhkUOyvhJJ7Q_fcA"
  },
  "2kfuCFkfoB2Wtrbv4fkRRg": {
    "date": "12/28/2015",
    "text": "Oldie but goodie. I grew up in Phoenix, it has been here for years, needs a face lift some remodeling. I enjoy fajitas, one of my favorite Mexican dishes. When you leave here you will smell like fajitas. It is always packed which is a good sign. It is never my first choice, I go when the group is going and I am invited.   The service is excellent! The food is ok.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "3bWZTdyxLOc271r8v7AoHA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Great salsa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3bWZTdyxLOc271r8v7AoHA/o.jpg"
      },
      {
        "img_id": "MnS606ufSf8EmI7KfaFO3g",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Zucchini",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MnS606ufSf8EmI7KfaFO3g/o.jpg"
      },
      {
        "img_id": "GlNK27_DL_P1oNOWbJ4eUw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Full order of shrimp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GlNK27_DL_P1oNOWbJ4eUw/o.jpg"
      }
    ],
    "user_id": "JCwOYCDBYtU-nPh2iYiTfg"
  },
  "xSM91skazb7nZPeZDNS7IA": {
    "date": "11/3/2017",
    "text": "The staff is friendly and prompt, but the food wasn't very good. I didn't care for the thin tortilla chips or the salsa. Also, my margarita was just mediocre. However, I will say that the portions for the price were huge. I got the half order of the fajita nachos during happy hour so it was only $3.25! That's a crazy good price! If only they had better chips....and salsa...and....etc",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Cc--Co2l1kxYKmwIEwoH0A"
  },
  "jhziA3bN_6bjwoipxj0kbQ": {
    "date": "8/21/2018",
    "text": "Delicious food. We had the Chicken Fajitas. Yum!  We also sub'd the pico de gallo for quacamole. Amazing dinner & excellent service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4GxXPH7OXDxAp7eiexYuvQ"
  },
  "6iOtw3APvbZAtDp-d_Cylg": {
    "date": "6/19/2017",
    "text": "I've been here twice now in the past two months, the food is absolutely amazing. Granted I haven't had anything other then their Cadillac fajitas.   The price is reasonable in my opinion because the amount of food is very generous compared to other restaurant. They have a full and half pound portion, which both are definitely shareable sizes and even recommends sharing on menu. Tons of meat, with the perfect amount of sauteed veggies to compliment it.   The food has tons of flavor and the thick tortillas that come with it are bound to get you full. Chips are thin and crispy served with a flavorful but not spicy salsa. If you haven't had their interpretation of apple pie for dessert, oh my gosh! It's an absolute must!! If your looking for authentic Mexican food, I can't say that it is. Although they don't label themselves as a Mexican restaurant, rather a Tex-Mex which it definitely is. So for those saying it's not \"authentic\", well it's a Tex-mex restaurant so what do you expect?   The staff has been super friendly both times and very attentive even during their busy hours. The restaurant is a little dated in style, but you go there to eat not for the decor. Over all absolutely awesome!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iB9-_08zbUf6fieVKMx2Ng"
  },
  "ZqIIOOhRER5W6i_yX1m4SQ": {
    "date": "2/14/2016",
    "text": "Used Yelp to help find a spot to eat at in the area and it brought up this one. Very glad I took the advice of other Yelp users and reviews to come eat here! Nice big place, and they were playing 80's music the whole time I was there haha so that was a big plus for me.   Very friendly waiter and fast service. I also love the large basket of complimentary nachos and salsa they give out immediately. Ended up ordering this Mexican pizza thing which was listed under appetizers. It had grilled chicken, spinach and cheese on it and it was delicious! Thing is, it shouldn't be under \"appetizers\" haha It was enough to feed two people. It was very good though. For the main plate I ordered the beef fajitas- which was also very very good!   I was so stuffed though- I felt like I barely made a dent in my food haha Definitly worth stopping in here though! Bring your appetite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2dn1CNpa6HpKZ5-HMfNxFA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Fajita shells!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2dn1CNpa6HpKZ5-HMfNxFA/o.jpg"
      },
      {
        "img_id": "W1iKXb_BqM0c4X863IYbrA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. All the stuff that goes with the beef fajitas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/W1iKXb_BqM0c4X863IYbrA/o.jpg"
      },
      {
        "img_id": "_5iww0b6wCsZShMfyRnDKg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Traditional beef fajitas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_5iww0b6wCsZShMfyRnDKg/o.jpg"
      }
    ],
    "user_id": "wISdr15RJTBtlhilcayCpA"
  },
  "F1YGCtE_oXvEpkAAt9b9wQ": {
    "date": "4/22/2018",
    "text": "How is this place still in business? It has been many years since I have eaten here. We were in Glendale for a conference and some of the people I was with wanted to eat here. We get there, seated fairly quickly in a corner that was actually too small for the 6 of us. We felt like sardines. Took about 10 minutes for a waitress to come greet us. Not really friendly. Just lack luster. Not sure she really wanted to be there and had zero enthusiasm. Wasn't told the specials, nada. The menu was underwhelming and dirty. The place just felt tired. We all ordered fajitas. Seemed logical since that is the name of the place. Chips were good. Salsa was sub par. All I could really taste was tomato. Bland....at best. Order finally arrives. So hear me out, you know how when you order fajitas, you hear and smell them before you see them? Yeah, that didn't happen. No sizzle, just fizzle. Again, remember , we are packed like sardines....we all ordered fajitas....no space at the table. 2 of us got corn tortillas. They weren't really that good. The fajitas had no peppers cooked with them. The onions weren't caramelized and the meat had no seasoning and therefore was just really bland. Not to mention, no rice, no beans with the fajitas. And at $24 for half a pound....really pricy. We would have been better to go to Chili's. Just really disappointed. Save yourself the money and time, find somewhere else to go.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XTUdiYG4cmcAtwNMmprhjA"
  },
  "oSkoLaPmZXva-8owrY2CDA": {
    "date": "9/7/2016",
    "text": "When you see corn and peas in the mexican rice, you know you're going to have a bad time. Beans and rice were really sad, worse than out of a box/can, not authentic at all. Neither my date nor myself enjoyed our food. The prices were outrageous for the quality. The building and decor looks old and sadly in need of updating.  We had always seen their sign off the I-17 and finally stopped in to try it out because they were open until 10 on a week night and we needed a later dinner. Will NEVER go back.  I love salsa but I don't even have anything nice to say about their salsa, it was so run of the mill (at best).",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "453dbofkNF9eza-lZWjcbg"
  },
  "YUt6rZoDyBChxCgIw0xsaA": {
    "date": "8/26/2016",
    "text": "I don't understand how something as simple as fajitas can not turn out, especially at an establishment named Fajitas.  I had the lunch beef fajitas.  They were a very small portion but in hindsight that was a good thing.  - The flour tortillas were thick and chewy; they didn't taste bad but the texture was dense.  The corn tortillas were chewy as well.   They weren't terrible but I expected a lot better quality since they make them on site. - The beef was over cooked, tough and flavorless. - The vegetables were one red pepper slice and quite a few onion slices; they did taste fine. - The sides were cheese, sour cream, and pico de gallo all smashed into one small ramekin. - The guacamole side we ordered was clearly made quite some time ago as it was brown and had a sour taste. - There is one type of salsa which is more like a tomato puree than a salsa.  Our server was very pleasant and service is very fast.  That said, one of the most disappointing lunches I've had.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "zx3y74_pvIRuQSVIrgzCew"
  },
  "lrYkYotag4BpaR7v_F951g": {
    "date": "11/24/2015",
    "text": "We use to love this place. Unfortunately  we now live about 60 miles away so coming here is only an option when we come back from up north.  Used to be Best Fajitas in town, sorry to say not anymore.  Today the shrimp was over cooked which really disappointed me.  I do have to say      The tortillas are made fresh when you order your meal. Piping hot and perfect. They never skimp on the meals. Large portions.  The wait staff are really friendly, fast to greet you at your table and they know the menu. Would I  come here again? I don't  thing so. They us to be the best , but I have had better closer  to home.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "CIn2Ol7ozLy2eetDJmo1bQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. More of dinning room",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CIn2Ol7ozLy2eetDJmo1bQ/o.jpg"
      },
      {
        "img_id": "ImUcTeix8dqmrWQzGUcHMQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Dinning room",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ImUcTeix8dqmrWQzGUcHMQ/o.jpg"
      }
    ],
    "user_id": "kzCdYEvy7MqdslwCtxAu1A"
  },
  "RTXl1uCTIGtTGokMxzJO4g": {
    "date": "8/17/2016",
    "text": "Oh my goodness What a Colossal Rip Off! I stopped in for dinner because I remember this place from the late 80's It was really good then was supposed to see it still open . We were early because of traveling so we sat immediately . Our server Olivia was nice and asked if we wanted drinks and apps . We both ordered iced tea.  She brought us our drinks and we ordered I the chicken Jim the beef. The food came out in a minute I mean literally a minute I guess they precook everything? My chicken had about 6 slivers of chicken s d Jims beef was no better. We ate it was ok but not nearly enough I mean half of a pound of chicken at $19.95 is a lot of money especially when there's barely 4 oz on the plate. I went up to the bar grill area and watched them cook the chicken . The breasts were really small like 4 oz Tyson ?? I thought that they would at least use plump chicken but these were paper thin probably frozen So we left hungry and $49.30 plus tip . I would never eat here or recommend to anyone disappointed for sure pollo loco serves larger and better rating portions",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "oruxZ_RAjIglarkZRvJBPQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Skimpy beef portion at $19.95 Ripoff? You decide",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oruxZ_RAjIglarkZRvJBPQ/o.jpg"
      },
      {
        "img_id": "HHvPdul8ntEqEcxQqeMDFA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Small 4 oz chicken breast suppose to be 8 oz Not",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HHvPdul8ntEqEcxQqeMDFA/o.jpg"
      }
    ],
    "user_id": "pq9Xw58OEUK_DS-RB7X9MQ"
  },
  "_VgOfYrutwV9ajLaDtQKcw": {
    "date": "11/5/2016",
    "text": "Kudos guys for a job well done. We had a group of close to 30 people if not more and we all went there after an exercise/fit challenge event so imagine all tired, and hungry yet the servers (at lest at our table) did a wonderful job. I had the half pound chicken fajita and it tasted great, I know my co worker and his wife had the medallion fajita and they lived it from what I could hear. The rest of our table (we had 3 tables and approx. 10 people at each) was happy. I asked for water to keep coming to me as I drink a lot of water and the server was spot on. Lived in AZ for 17 years and driven on I-17 and seen the place probably thousands of times yet eject gone in before. Glad my company chose this place and now I would definitely bring my family here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "SGobMWMf7xwbOYHL6WMXyw"
  },
  "OirhmT5jGMrfCI11hqZFhg": {
    "date": "3/25/2018",
    "text": "This was the worse place I have ever been to. It was so dirty. From the floors to the walls and the tables. It was over priced for the quality of the food. Which by the way was not very good. I will not be returning here ever again. I will not be giving it any stars. This is my opinion which I'm entitled to. You go and make your own. Sorry but I was not impressed.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "TJrLmDKDw4e0AtCU18GFIg"
  },
  "OG6NQJccxVF8IYbcVc5kAw": {
    "date": "8/14/2016",
    "text": "I was never served. So i left. I sat at the bar.  No one gave me a menu. No one asked if i wanted anything to drink. No one really acknowledged me except for the host that told me i could go sit at bar. That was the only time anyone there spoke to me.   So...yeah, fuck Fajitas. Never again.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "0mfmFQE_8OPVDWkasP9M9w"
  },
  "6o_ygrnFwuqJ-x8a4e7xvw": {
    "date": "8/24/2010",
    "text": "I found the food excellent, but keep in mind this isn't typically Mexican food this is Tex-Mex which is a whole different variety.   Our waitress was fantastic, and talked me into getting the melted cheese on the side. It was quite tasty, indeed it has a bit of skin but generally if you cook cheese or milk included products into a liquid quickly it does get one..and personally I didn't haven't issue about it.   The menu isn't extensive, it would be nice to have a bigger menu but with how accommodating the are, you could probably something off the wall and they'd be willing to do it.  I ordered the bean and cheese burrito, which is delicious, and large.  Its a fatty, and I loved it.  When asked if they cook with lard the hostess had an immediate answer and listed what they used to cook everything with. I was so happy. Most have no idea, and aren't very polite if you ask. She was very friendly like everyone else we encountered there.  I was told that the Steak was perfect, and mr.hard-to-please was filled up (had left overs) and stayed that way the rest of the night. Which was great. The salsa has an interesting flavor, and I must I dig it. I\"m not a big fan of mexican rice so I didn't partake in eating it, however the fan of mexican rice at the table liked it, (but not as much as the fajitas)   Conclusion - Excellent Staff, Great Food (Its Tex-Mex..not just Mex so bare that in mind. There is a difference!) Atmosphere reminds me of some place that would be placed in a Tarantino film. Price is average sit down if not a little high. Expect 2 people = over 30 dollars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B2fDw9pQDw-5ryacJPaH1g"
  },
  "U6VkZemjwy-0WMau3cnakQ": {
    "date": "3/29/2007",
    "text": "Fajitas is one of those places where you may go for an occasional, unmemorable lunch. Nothing is gross. Nothing is exceptional. Everything is just, well, there. I've tried different variations of the fajitas theme over several lunches (chicken, steak, veggie, etc.) and they were all ok. Not a big fan of their tortillas, though.  If you work anywhere near there, then I'd say go ahead. It's a safe bet for lunch. You won't puke or curse the world. But is it a joint where I'm saying, \"Dude, you GOTTA try this place out\"? Nah. You've had better fajitas elsewhere...  3 Stars.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "AKXqbuifvfvNEpr3Qs51hQ"
  },
  "17vtNCMzXn_ZolXbHz166Q": {
    "date": "12/21/2012",
    "text": "The food was good. A bit spicy,. the chips and salsa oh plenty. Salsa a bit warm, but Im a grengo. Price somewhat high. Didn't have a lunch menu? All- in all would try again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gEX0eK3ey_HNPcyDw9xxog"
  },
  "RSiuVZ6x6EpcQ4UrdOr7Fw": {
    "date": "4/13/2012",
    "text": "Good value. Lots of food (too much, in my case!). Very good service on a Friday evening. The menu isn't anything special, but there is ample variety and it's prepared well. I would go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6QByjUgecHo5Uja2-1QiCg"
  },
  "qRokfXUSKz2wk1uQUt98NA": {
    "date": "4/27/2014",
    "text": "I'm not one to normally write a lot of reviews, but I like to give credit where credit is due, and this place was great.  My boyfriend mentioned this restaurant last night for dinner, and as soon as he said they had great margaritas, I was on board.  When we sat down, we ordered a couple of drinks and had some of their chips and salsa.  The margaritas were strong and really good (complements to the bartender), and the salsa was some of the best I've ever had.  For dinner, I ordered the beef fajitas, which came out with on a sizzling platter with onions and peppers.  They also came out with a gigantic side of cheese, sour cream, and pico.  I loved this because at most places, if they even give you all of these sides, they're always small and you end up having to ask for more, which can take who knows how long.  The tortillas that came with it were awesome!!  They cook their tortillas, in the middle of the restaurant where you can see it, and they are a soft, fresh perfection.  To top of the good food, not to be forgotten, was the amazing service.  A big thank you to the entire, friendly staff, but a special thank you to our server Shane.  He had chips and salsa on the table before we even asked for anything, he had drinks right away every time (with none of them ever getting down to empty), anything else we needed was there quickly, and when I mentioned that I needed the bill because I was taking my boyfriend out that night, he placed the check as far away from him as possible.  Haha.  My kind of server!!!  To top it off, he was just genuine and good with people.  Thank you, Fajitas and Shane, for the great night out with my boyfriend!  We will be back for sure. :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GghgeSF0Infg9i-DRxedFg"
  },
  "XOE2kGYfKDPv6dicvTke0g": {
    "date": "2/4/2008",
    "text": "This place is really 3 stars, but because it brings me a sense of nostalgia, I will be generous and give it 4.  3 of us guys ordered 1 1/2 pounds of meat- Chicken, Beef and Pork.   I thought it would have been carnitas, however it was more of a pork chop.  Chicken was great, and the beef was just eh.  The best part about it all were the thick, delicious homemade tortillas. Delicious!!!   A tip that we have always done since high school- switch out the pico de gallo with guacamole free of charge. Use the salsa from the chips and salsa and you are all set. Squirt some lime on your fajita and bam, you have the best tasting fajita this side of the I-17.  Pretty reasonable and tasty and for sure filling, just beware you will smell like what you ate for the next 18 hours after coming here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WPw0LDmsT5HLc5itX8YLVA"
  },
  "ifOgBIVZ9V2K7f7dka1gYg": {
    "date": "9/24/2012",
    "text": "I have past this place a million times and always wanted to stop and I finally did. It was good. The only thing that was fabulous was the cheese crisp. It was actually crispy must places its just a soft tortilla with cheese, I can do that in my own microwave. I didn't have the refried beans but they looked watery and not so good. I enjoyed this place and will come back but besides the cheeses crisp it was average but good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eqlVRVwsE26K_fwI1jwTrg"
  },
  "27wzRiCmFmwQoIb2Mk4dWQ": {
    "date": "5/15/2011",
    "text": "The fajitas are awesome, which makes up for the fact that the place is not very clean.  Also got queso dip which was.not very good.  Also was disappointed by their beer selection.  They had advertised $3 drafts, but their only choices were bud light & amber bock...no Mexican beers, kinda strange.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "xmLzWX7Qc0CHE0Me8lvUHw"
  },
  "3j_8O8m9ylp5jO3NypGw9A": {
    "date": "5/15/2012",
    "text": "When you go to a place called \"Fajitas\" you order the dang namesake! I've had all the different fajitas they offer and I love all them, my favorite is the shrimp it's lightly seasoned and grilled to perfection (side note: order the onions and pepper caramelized)! The tortillas are strong enough to fold without tearing yet still have a nice flavor. The toppings are always bright and fresh, the guacamole is legit. My coworker has talked me into always ordering a side of Queso with the free chips and salsa. Albeit the restaurant is old but the staff is super friendly and detail oriented. And yes, no matter what you order you will smell like fajitas so make sure you don't have anywhere special to go after eating here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RB3_GtWgvQYTLu3bxY2-VA"
  },
  "1zbjDl6Do_oyY6he1iA_eQ": {
    "date": "3/3/2012",
    "text": "After seeing this on twitter we stopped in. A day early for their social media specials but still worth the visit. Wife's dinner had some issues. Manager on duty came out and talked to us, Comped her meal and our Ice Teas. My dinner was awesome. Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ll9KdKBIohH62EP7tx7zow"
  },
  "OlcoXdCXBRAexslATwY3VA": {
    "date": "10/31/2014",
    "text": "Me and my family ate at this restaurant recently after a long day at the boat drag races. We had a waiter named david, and I can honestly say I have never had such a good waiter. There was no waiting around for him, he was on top of everything, and never had to tell him anything twice. In fact,  I talked to his manager and explained to her how great he (David) was. A stand up guy for sure. We had a big plate of beef and chicken fajitas and there's was nothing to complain about, great food. Drinks and food were great and the service was above the rest, 5 stars and two thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "07mmLGYovehLXJwMu-01-g"
  },
  "a_y9PKyLuF37p4tiFrpjng": {
    "date": "10/28/2014",
    "text": "Best fajitas ever! Love this place! Love the food! Love the the environment!  Great place to take your family!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PnRm4m239g7o-Gd2GMRylg"
  },
  "fdPaTIxkEsPKqlkxAw2Wbw": {
    "date": "10/21/2014",
    "text": "Very average. Good service, friendly staff. Remind me of Mexican places from the 80s that didn't have particularly good flavor, so they just overwhelm you with stuff (guac, sour cream, pico, etc.)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yXQ2vTJHGQG1IjRhA607kw"
  },
  "JxcuuHfSQ4yErxp_y6Amag": {
    "date": "11/6/2011",
    "text": "TERRIBLE!!  1st clue: Tomato sauce for salsa. 2nd clue: Dirty floors and bathrooms.   Fajita's, what Fajita's, they just serve you 4oz of meat and a pound of onions for $17.00. look here for photo <a href=\"/redir?url=http%3A%2F%2Fwww.fajitasaz.com%2Four_menu.html&s=7f5952a017df1e562288ace2028efbf0acd30cdd00908e784b956d632bc6e191\" target=\"_blank\" rel=\"nofollow\">fajitasaz.com/our_menu.h...</a> where is the meat - lol...  This place is the COCOS of Mexican food, no flavor, no heat, taste like they use canned food and sauces  Take some advise and go to NANDO'S Mexican food, way way way better then this place. Don't waste your time or money on Fajita's, It's a cruel joke.  I understand it is a wonderful thought to know they cook right in front of you, but I suggest Benihana or any State Fair for that matter. The fajitas at Chili's tasted much better than this place and for much cheaper(chicken and shrimp fajitas for almost $16 or so) !!!! If you are looking for good fajitas try places like Abuelo, Chilis, On the Border, or any other Mexican restaurant but not this. This place for sure does not live up to the hype. This place doesn't even hold a candle when compared to less known restaurants which serve better food for cheap.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Egfkt1tWAv_yOIPfSBaBlg"
  },
  "36VmMYL4B7Ky5fxohn3xrg": {
    "date": "10/7/2014",
    "text": "This was probably the first Mexican food restaurant that I ever ate at, and I was probably 5.  I think it is the reason I love Mexican food so much.  Now, I know that the specialize in fajitas, but seriously, when you get something right, why branch out.  First, lets talk about the tortillas.... AHHH!!!  I would die to have those tortillas every day of my life.. They are homemade, warm and probably the best thing about this place.  The smells are amazing.  Then there are the actual fajitas.  You get a lot of meat and peppers when they bring you your sizzling plate.  The sides, especially the guacamole compliment everything so well.  The only complaint I have is that it is so far away from me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WFpT2Lq8qqnZPcQCvH8OAg"
  },
  "qnlG4hbU1L3VNmx-gdd5Dg": {
    "date": "7/14/2014",
    "text": "Don't waste your time. Ordered fajitas and the onions were raw! Chicken was bland no flavor. The rice tasted like something out of a box minus the salt. We will never go back. You think Phoenix would have great Mexican food but I can't seem to find any.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "39aU54MC_rGPSZR8-fl4fw"
  },
  "hAgaw8NX4dbjrqT88XEieQ": {
    "date": "1/24/2011",
    "text": "It was the most Horrible Mexican food I have ever put a fork to. I asked for a Shredded beef burrito and my wife ask for 2 soft Tacos, 1 Chicken 1 Beef. When I dug into my burrito, NO MEAT just all tasteless dried, re-fried beans. TASTELESS. Then my wife said her Taco's where bland and had a funny flavor. The meal was pretty bad. Save your Money and go the Chipolti Mexican Grill and get better tasting food and a better deal. Fajitas is just plain bad food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "c8yPF4uC7E6XCUBW_GZSJw"
  },
  "FZm4tT71RgO9084NHkWG4Q": {
    "date": "6/30/2014",
    "text": "Food is good but it may not be as gluten free friendly as they may state. I got mildly ill while my mom 20 minutes after eating was in agony. Even when they were SURE that nothing we ate was contaminated. Who knows. Maybe that's why it tasted pretty good :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mYwxIFFqCjtRmN7n_Yy4SA"
  },
  "cQC_OmIhbNJTUpzaEov-Vg": {
    "date": "4/19/2009",
    "text": "Fajita's turned out to be pretty good actually, but \"pretty good\" mexican food in a land of bountiful mexican food is a restaurant that is not trying hard enough. Still they've been open for 22 years so it's clearly not bad mexican food.  One of the things holding this place back from a higher rating in my book is price. Let's face it folks, fajitas are made with cheap cuts of meat, in the case of beef fajitas almost always skirt or \"flank\" steak. Yes that's right, the same thing that a lot of places pound flat to make it tender and fry as Chicken-Fried Steak. Fajitas are just a way to make a tough piece of meat edible, and the price of $23.00 for a pound of fajitas is no bargin.  Still, we had the pork fajitas and they were tender and tasty and you can believe that the freshly made tortillas are a treat. However the condiment plate or \"Molcajete\" is a deceptively small portion of cheese, tomatoes and sour cream on top of a bed of green cabbage. Good stuff to be sure but not enough to get you through a half-pound order of fajitas. No problem you say, just ask for more which they happily bring to you at an additional $3.50 charge. Kind of insulting actually.  The salsa is fresh, despite what Danine D. wants you to believe. It is finely chopped and is not very hot but it is very flavorful all the same. We greatly enjoyed it.  As an appitizer we had a Fajita Pizza, a large flour tortilla covered in cheese, fajita meat, jalapeno slices, onions and olives all baked up crisp and delicious.  The service was excellent despite the servers being seated with a party of 13 and two parties of 20 the same time we came in. We lacked for nothing.  The kitchen is in the centre of the restaurant and you can watch them preparing your fajitas over mesquite wood fires. We saw no fry fats present but the cooks do use fry baskets to cook the shimp in over the fire, allowing the wonderful smoke to add to their flavour.  We liked the food well enough, and if we are in the area and hungry we are likely to return. But it is quite aways to go for us from Gilbert to get \"pretty good\" food, and as I say it is not really much of a bargin. Still Fajitas gets good marks for flavorful food, friendly staff, and a good concept.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N3bLACFC7VL0T7OBmVDSrA"
  },
  "iaYnXQP8F0LEBsgi_HsdAA": {
    "date": "3/14/2013",
    "text": "I love this place. The chips and salsa are great. Love the chicken fajitas. Extra grilled onions are my favorite. Tortillas are a little thick, but still very good. When I order fajitas in other places I am always disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_TyBkVx17MnU32aANhrrNg"
  },
  "VDvT4Fn1hrqwYsUo-oM2hw": {
    "date": "5/27/2014",
    "text": "I've been coming here since the 80's when the restaurant first opened. I love Fajita's - the best dish is their namesake. Warm fresh chips and mild salsa is served upon arrival. We always get the shrimp (sometimes chicken). The tortillas are cooked fresh in house, and they are awesome.  The food is great and the service is great. The only reason I can't give more stars is because this place REALLY needs an update. It still looks like it's from the 80's. The carpet is really old, the walls need to be repainted - dirty looking and scuffed, hand scrawled signage that says to \"watch your step\" (can they get professional signs at least?)  the booth we were in had a piece of wood trim falling off into the booth with nails exposed (if management reads this, we sat in the back, along the window) and the bathrooms are really old (original?) There used to be a long wait to get in on the weekends - now, you just walk right in. I got the feeling they must be strapped for cash if they can't update the decor from 1986. Even the reviews on the walls from magazines are from the 80's. It's time to come into 2014 and freshen up. Decor aside, the fajitas are great and I hope they will be in business for years to come. I just got the feeling the restaurant itself wasn't doing too well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7Km9uq87U9dmbuCQDANmpw"
  },
  "BXSOrMFhQUOjjDp7Sjru5g": {
    "date": "12/2/2012",
    "text": "I ordered their (steak of course) fajitas and they were not good ... at all. I LOVE tex-mex, and I couldn't finish them. The onions tasted like they had gone bad, and soured the entire plate. Add to it that there was almost no flavor in the meat (salt and pepper are not the only spices in the world ....) I was extremely disappointed. When your restaurant is NAMED fajitas, you'd better deliver.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zbuG_wbjhyHRjlu5_YJKtg"
  },
  "_zywZeWqzIW2gcWZo8nKxg": {
    "date": "12/9/2009",
    "text": "Ive driven past this place on the freeway about a million times and has always vowed that one day, i will try this place!   and out of complete randomness.... it became my Saturday night dinner :)   As we park the car, we could already tell this place was packed! we walked in and there were parties waiting to be seated ... lucky for us... we were seated right away... I'm sure we deemed ugly hungry stares for it to... hey its not our fault their are only two of us....   right after we were seated our drink orders were taken by a very welcoming young gentleman. :)  and out chips and salsa were brought out promptly too!  The Salsa was amazing... and the chips were fresh ... and hot!! that could have been my meal i was so content....   this place has great lighting.... not to bright or too dull... just how i like it.  in the middle of the place there was a huge area where they cooked all the food... or at least some of it... it looked like fun....   we shared the beef Fajitas... they were amazing!! grilled on top of bell peppers and onions... red and white... mm served with rice, beans w/cheese, guacamole and a tray of salsa, sour cream and cheese... it was SO good and they brought out your tortillas in a little bowl with a cover to keep them warm.. but they tasted more like pita bread... either way everything was hot and fresh and out in a very timely fashion.. especially since this place was packed...   i like this place alot... i would love to come back again and maybe sit near the chefs area :)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 6
    },
    "photos": [],
    "user_id": "EckWjCrPWekulzJB0YwVaQ"
  },
  "ceR0agvvxJ4Gr03_rmMOYg": {
    "date": "7/4/2015",
    "text": "This is my favorite place in the Valley to get fajitas. My husband and I have been going there for years, they're the best. And they have amazing chips and salsa!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ku8hGq3APfxSEer92eTuDQ"
  },
  "CtXO_4rYD2iOCb1Rm_zZdQ": {
    "date": "2/23/2013",
    "text": "This is our local, family friendly go-to for Mexican style food. My husband loves the shrimp fajitas and I like The Border Dinner (can't beat the pice for the amount of food you get!). The tortillas are so tasty, plus they give small balls of dough to the kids to play with before dinner. Win win.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7SsYWaVik7by1lEimqFDpw"
  },
  "g-U0S3qskgq3FnAG-ntwqA": {
    "date": "5/22/2011",
    "text": "I heard Fajitas was good if you like....you guessed it...fajitas. As I do indeed enjoy yummy fajitas we decided to check it out on Mother's Day. We had a party of six, so the less than 10 minute wait on a busy day like Mother's Day was impressive.   The smell walking in though, funky. I'm not quite sure what it was, but it smelled strange in the place til we were seated next to someone that was just served the hot and steamy fajitas. It was much more pleasant then.   We ordered, it's a lil pricey but not horrible and everything looked great. Their chips and salsa were decent, the service was decent and the fajitas were good. The homemade tortillas were definitely the best part. Even the kids noticed the difference.   We did have a super yummy dessert. I'm not all that eager to go back, but I wouldn't be opposed to it if someone else wanted to go there. There are other Mexican restaurants I like better though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1MrcDAGFHIdl01IDAwqwdQ"
  },
  "7THK4SmTddpWUMvwuUDwEA": {
    "date": "9/13/2010",
    "text": "We stopped here for the first time after a day on the boat and none of us were in the mood to be picky.  Even with this being the case, we were all quite disappointed with the food here.  This certainly is NOT Tex-Mex.  It's the type of mexican food you would expect from a school or nursing home cafeteria.  The salsa is little more than pureed tomatoes with a little chili pepper to give it some heat.  There's no flavor to it except raw tomato.  Adding a lot of Cholula made it tolerable at best.  We ordered the Cadillac Fajita's,  The steak itself was quite tasty, but it was disappointing that $25 fajita's only come with tortillas, sour cream, pico de gallo, and cheese.   Guacamole, Rice, or Beans are all extra.  The tortillas were inconsistent in shape & thickness.  They were all some sort of oblong and a little crunchy on the outside edges.  The onions and peppers were served completely raw with only the heat of the fajita plate partially cooking a small portion of them.  Spanish Rice was made with converted rice giving it the texture of rice pilaf.  This is a gross way to make rice that can sit around for a LONG time.  One of the gals in our group ordered chicken soft tacos... they were so bad she only ate 1 and left the rest.  The only thing that gave them 2 stars was the service.  Our waitress was very friendly and there when we needed her.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Ch6B7LrD0iwbj7PdnjbgQ"
  },
  "E_LaRqKBt4uFoCPs98-1Mw": {
    "date": "2/24/2013",
    "text": "overpriced. paying for the experience and the nice wait staff.  $28/lb of shrimp fajitas. nice but more than we would like to spend. extra tortillas. lots of grilled onions. mild sauce.  we saw lots of little kids, surprised families could afford it, suspect it is a very special outing for most people so economy is not the issue.  good smells  comfortable surroundings very attentive staff. probably desires a 3 star but $20+ per person bugs me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cpOqABn6YiktZqMrJUB8Aw"
  },
  "SDxEfvoKLzHzi_uxNRh6Qg": {
    "date": "7/18/2015",
    "text": "Best fajitas in Phoenix! The Cadillac fajitas is the way to go. Love their salsa, we always order extra for the fajitas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SPH9ANufuO2eu6mgwHVkyg"
  },
  "zC-GRDsiZJbRWs1_ngL-AA": {
    "date": "4/25/2013",
    "text": "Love the handmade tortillas!  So scrumptious.  The queso is awesome, but severely overpriced ($4?  Come on).  Usually always get the shrimp fajitas to share; only tried a menu item once, and it was good.  Love it here; just not a fan of walking out smelling like grilled onions.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cKn9fGSpLh3qYa_uf3BpiQ"
  },
  "askhbHU1aTuMGMqQmeGhjw": {
    "date": "7/6/2010",
    "text": "Was in town for Wrestlemania 26, and decided I would celebrate my Birthday here! Started with a fresh Fruit Daiquiri, and then another.. Lol. Ordered some guacamole and chips, which I really liked! We ordered a bunch of food and shared! Everything was Authentic and fresh! They found out it was my Birthday and brought me a huge chocolate covered cupcake which sealed the deal for me! Would also like to note there open kitchen made for a little entertainment!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "r3ov7FgibBx41_W74I1KiA"
  },
  "OgPmY43w75mkfLjG8J11Ow": {
    "date": "8/21/2014",
    "text": "Great service, friendly atmosphere - Kira did a great job! Over the food is average and not all that spicy. May be time to update the pink tables and outdated tile too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M1NMuBZMcT69x3ptA_vSUg"
  },
  "WScCa0VW21rdIJoHnumfBg": {
    "date": "2/23/2015",
    "text": "Very friendly environment and delicious food!!! I walked-in 15 minutes before closing and they were extremely attentive! Will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xPk82MSLP5JnIzpHZOP7KA"
  },
  "qgddhU25htoT00Y1AlIhqg": {
    "date": "6/8/2015",
    "text": "I love this place! Nacho cheese is amazing! I'm obsessed with their fajitas!! I highly recommend trying the shrimp and steak fajita! Services is amazing. Everyone is so friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KOqkl7Uo3q3or3dMkgcfsg"
  },
  "ep49-3TPzST33_K605RJTw": {
    "date": "1/13/2013",
    "text": "I have no complaints about the fajitas at Fajitas. We like to order a pound of the steak fajita which is more than enough for two people and leftovers. The chips and tortillas are delicious. No matter how busy this place is, the servers are always great. I haven't tried anything else on the menu, the fajitas are always the best :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QOkNZxcKuGzxRVlE5vfiJA"
  },
  "b22pHthI3bi2V8SyJTr-cw": {
    "date": "9/19/2012",
    "text": "There are far better Mexican places in Phoenix than this place. The atmosphere feels like a run down diner, their margaritas are not good, and the fajitas were alright I guess. Been there twice and I felt the same coming out both times.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dztDplZ_f718XH0T0ihnsw"
  },
  "hDYhHU4qXS6JopuNwR1Vbw": {
    "date": "5/23/2013",
    "text": "Fantastic!!!!! Chicken! Beef! Shrimp!!!!!! In house tortillas  and margaritas!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4sbYhwTFs8qdhhYbloN30A"
  },
  "j1pss1k3GqD-IWuz578nXA": {
    "date": "3/7/2013",
    "text": "I discovered this place when I was 10 years old, I fell in love with it right away.  I see people complain about the rice and beans, guess what its called Fajitas and not Rice & Beans.  I am now 33 and live in NYC and I make sure to go here within the first day or two of being home visiting.  Shrimp and chicken fajitas are the best, not to mention the salsa and cheese crisps.  HIGHLY RECOMMEND THIS PLACE!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4N-YLRhhs5d6VkOutuzwmw"
  },
  "8QRo8jCzahAb6V0nhA0rDA": {
    "date": "6/15/2014",
    "text": "I'm not sure if we went on a bad day, or what.  Unfortunately, my experience wasn't the same as the majority of other reviewers.  I went with three stars because the tortillas were very good, and our server was polite and attentive. Everything else was less than mediocre, which was disappointing since this restaurant has been on my places to try list for months.  The chips were fine, the salsa tasted like it was made from canned tomatoes if it was made on site.  I wouldn't be surprised if it wasn't freshly made.  We ordered a side of queso, which was only melted velveeta or cheezwiz with green onions on top.  It quickly hardened making it difficult to dip chips into, and it would have been nice if there was some salsa or jalapenos mixed in.  We split the half order of steak fajitas and added sides of rice and refried beans.  The rice was bland, it tasted like plain white rice even the vegetables in it lacked flavor. The beans tasted like they were straight out of the can.  The fajitas also lacked flavor.  The steak didn't have any seasoning, and tasted old.  I don't think it was out of date old, but it tasted like leftover meat. The entire time we were there several prepared plates of garnishes stayed on the warm counter.  I'm not so sure it is appropriate to charge $20+ a plate that includes sourcream, cheese, and pico that has been sitting in the open air.  I would also expect that the fajitas would be cooked to order. After watching the kitchen for a while, it appears they put the raw onions on a hot skillet and add meat from a prepared bins.    After a few minutes the onions are cooked through, but were mostly raw when the plate arrived at our table.  This is a cute restaurant, but I don't plan on ever going back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "6kFRThbaSRxbIH8W1C1lwg"
  },
  "0Nyx1AtgoOvx0kvpdIve8Q": {
    "date": "5/26/2013",
    "text": "Tried this place for the first time yesterday and it was fantastic! I use to be a server so I really appreciate great service and the server we had was on the ball. You never had to ask for anything! The fajitas were delicious and they have this lady that makes the tortillas right there in house so they were fresh and amazing! The prices were reasonable too- I saw someone complaining about the prices below but the price they gave feeds 2-3 people from what I saw on the menu. Anyways- I will definitely be returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RC64tqpV1nxSY8ex32I9yQ"
  },
  "xxv0_VGalndl3SC-anfLpg": {
    "date": "8/30/2018",
    "text": "Love this place! It's my favorite restaurant. I go here every time for my birthday. The chips and salsa are to die for. I could eat them for days. I always get the pound of chicken or beef and create my own fajitas. Even the grilled zucchini is delicious. I think the only downfall is that Fajitas is pricey. They aren't cheap. I guess for me it is worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QEkehHSsRd3AMRfzSl0pLQ"
  },
  "teAN_nNDpD5fLQeGg5yHqw": {
    "date": "3/15/2019",
    "text": "Our favorite must visit on our annual spring training trip. The fajitas are amazing! Busy place but always great service from an energized and friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lTs0jTic4-vS-qsvmEfvow"
  },
  "yHV6gwIdnpMPit2WEebCpw": {
    "date": "11/25/2018",
    "text": "If you enjoy Fajitas do not go to this restaurant. For a place that claim to have the best, they are completely dry, no flavor and sizzled on a bed of white onions. They peppers are fresh on top, not sizzled at all. For what they charge for a full order, they should be closed down.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KRZykwX-_7Msy6VzH36zCA"
  },
  "tXJFIWTUUiVvZ08aSDaCRg": {
    "date": "10/18/2018",
    "text": "My wife and I used to eat here all of the time before we relocated to another state and we always enjoyed it.  Now relocating back to Phoenix, one of the restaurants we couldn't wait to eat at was Fajitas.  I want to say that the staff at Fajitas were fantastic!  Polite, attentive and our waiter was great.  But the food has taken a surprising unfortunate downward turn.  They have gone cheap!  This is a fajita restaurant right?  We took friends that were visiting from out of town and we were looking forward to showing them a Phoenix gem.  I was embarrassed.  Sorry Fajitas but if you want to succeed (and you could) downsizing is not the answer.  Unfortunately we will not be returning to what was once a great place to eat.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "AMjtn5c_WjMTunrF_w02iA"
  },
  "N0HRaJH6UslWLEdASE8d4g": {
    "date": "5/14/2018",
    "text": "When I first started coming to this restaurant in the early 2000's - they gave you ample portions of sauteed peppers and onions (probably 50/50) to go with your fajita meat.  I was really disappointed to see them change that over the years to now only including 1 slice of green pepper and 1 slice of red pepper (raw) on top of a massive bed of onions that are pretty much raw.  You can ask for more peppers (@ an additional cost) and you can ask for the peppers/onions to be sauteed more but in my opinion, you shouldn't have to.    Interior is super dated and dark and desperately needs a face lift but I can deal with it.  Probably 90% of the time we come here the service is great. The other 10% it's just so-so - but nothing so bad that I wouldn't come back.   Now... here's the part I really want to highlight - GET THE FAJITAS!!  Don't bother with anything else on the menu - the fajitas are what they are known for and where it's at.  Sure, they have great chips & salsa and queso dip - but the freshly made warm, pillowy tortillas coupled with the tasty pico, shredded cheese and sour cream and last but not least - the incredible Shrimp & Cadillac Steak - make this a culinary knock-out.  So don't bother with the enchiladas or taco salads... JUST GET THE FAJITAS!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RIXJQVEU4BMbdbB96rl10w"
  },
  "z5fkaCVhNhJ5unlUPhDUIw": {
    "date": "10/23/2017",
    "text": "This is the only restaurant my family and I eat fajitas, we have been coming here for over 12 years never been disappointed our favorites are cadillac and shrimp salsa and chips are great to my youngest son loves the cheese crisp and so does my husband. Recommend for sure.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bW2gBHqmfinIxzXk8uCLow",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bW2gBHqmfinIxzXk8uCLow/o.jpg"
      },
      {
        "img_id": "TnCRq75j1lPwPGoe0fz3Ww",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TnCRq75j1lPwPGoe0fz3Ww/o.jpg"
      }
    ],
    "user_id": "vnzW3k4ssOF1QncN_AUTjw"
  },
  "6Uzd39xVxNgEhxnAvgBj-Q": {
    "date": "4/11/2018",
    "text": "Service is hit or miss but was fine this time. We've always had the regular beef fajitas, chicken, & shrimp. This time we decided to splurge & get the cadillac fajitas. Woahh. Why in the heck had we not done this before. The meat was sooo much better. They were delicious! And really splurging will only cost about $2or$3 and it's so worth it. We didnt even finish the chicken because we were in love with the cadillacs. Tips: ask for sour cream & guacamole in individual bowls. This makes it easier to scoop and you will actually get it on your fajita instead of the table.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "d5pRjZoqaDsRWBKwIYunrQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d5pRjZoqaDsRWBKwIYunrQ/o.jpg"
      },
      {
        "img_id": "PKPbg00s1NBzoLWo_y7DvA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PKPbg00s1NBzoLWo_y7DvA/o.jpg"
      },
      {
        "img_id": "JEqcMqdnbyrilrXqGC8XRQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JEqcMqdnbyrilrXqGC8XRQ/o.jpg"
      }
    ],
    "user_id": "EzwHlJLIBULHXsdQtFi_Ig"
  },
  "DtrjBavrwOnZVRUZWDJ3Qg": {
    "date": "3/5/2018",
    "text": "Our favorite restaurant for every special occasion and then some.  Worlds best fajitas and cheese crisps.  Never had the other food on the menu but the fajitas are really good and the service is outstanding every time.  They always accommodate us even when we have a big party for birthday, graduation, etc.   If you're getting steak fajitas though get the Cadillac don't waste your time on the other cheaper steak, Cadillac is where it's at :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "gCdQ8ro1UsJfNSpf6w-Cdw"
  },
  "kCOxto7OBx80A31USsdYXQ": {
    "date": "1/3/2018",
    "text": "Cadillac fajitas with grilled veggies.   My hubby and I come here for date night. We get the Cadillac with grilled veggies and the special margarita of the day.  They make the tortillas fresh and are thin and so good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GMUcm-yBB6GwpsFhaFsw8w"
  },
  "3GJiR0FvM_Ht7op8si-rZQ": {
    "date": "6/28/2017",
    "text": "Well... this place isn't good. It's not gross but it's not good. I won't be coming back here again. The service was on point.. clean nice. But the food was just so so.  Wouldn't recommend it",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "QIRaVxbi6miYFgRK_TxPGg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QIRaVxbi6miYFgRK_TxPGg/o.jpg"
      },
      {
        "img_id": "A4BzKgAnHdnXD0-7TiwwDQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A4BzKgAnHdnXD0-7TiwwDQ/o.jpg"
      },
      {
        "img_id": "TAR3PNfUWl553GkSj2dtlw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TAR3PNfUWl553GkSj2dtlw/o.jpg"
      }
    ],
    "user_id": "2yTuG7nv5-SnuIBGnUu8AA"
  },
  "VKQLfRc2-Zs5pcHADj903g": {
    "date": "1/2/2017",
    "text": "I have lived in Phoenix for 16 years and have often heard about fajitas but and embarrassed to say that this was my first time in.   Service was impeccable - Ruben is a second generation employee at Fajitas and filled us in on the 30 year history of this establishment. He made to go have manager Janet stop by and welcome is as first time guests.   Cadillac fajitas were perfect, as was the chile con queso. Tortilla soup is essentially dressed up vegetable soup - don't bother. I went with my boyfriend, ordered 1/2 lb Cadillac fajitas, side of queso, and bowl of soup. We ended up with tons of leftover fajitas.   Huge portions - go sooner than later, and enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OmUUlnKKBBcIuoss1H5l7w",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Cadillac fajitas and queso",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OmUUlnKKBBcIuoss1H5l7w/o.jpg"
      }
    ],
    "user_id": "Jr-bTnChd-aTzMxb42avHg"
  },
  "lLjESHRb7CYdp3YkpAg2yQ": {
    "date": "12/17/2014",
    "text": "I'm really glad I saw the Check Please! Arizona episode for this place.   Upon entering the restaurant, you smell the cooking meat. Like you can open your mouth and chew the air. The kitchen is set up in the center of the restaurant. We weren't seated in a place to easily view it, but the cooking theater certainly creates a savory perfume that makes you want to float over like some Looney Tunes character.  Like any good Mexican place, they serve up tortilla chips and salsa. Both met our approval. My son is autistic and only eats tortilla chips and potato chips in restaurants, and he pretty much inhaled these things.  Then came the difficult decision: which fajitas? They offer chicken, beef, pork, Cadillac (which, to the disappointment of any visiting goats, is not car but beef tenderloin), shrimp, and vegetable. There are a lot of other options, too, and other vegetarian-friendly things, but we were there for MEAT.  We ordered 1/2 pound pork and 1/2 pound Cadillac-style. I asked for corn tortillas along with flour.  A short time later, our food was delivered. The full pound of meat was served upon a mound of grilled onions along with some red and green peppers and a chunk of lemon. On a side dish, they have add-ins like sour cream, lettuce, and pico de gallo.  Then there are the tortillas. Honestly? I'd come here just for the fresh tortillas. They are divine. The flour tortillas have perfect chewiness and can hold a lot of meat. The corn tortillas impressed me in an additional way--since they are fresh, they are flexible. None of that brittle, crack-in-half behavior like standard store ones.  There was much om-nom-nomming. The amount of food was just about perfect for us. The meat had flavor without being spicy; mind you, my husband like super-hot food with a kick, but he still enjoyed this. It's a place I could easily take my parents.   And those tortillas. Good grief. If I am on my death bed and requesting deliciousness, those are on the top of my list.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HPrESnBXDy-AOmtlrzOA6Q",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Fresh flour tortillas. SO GOOD.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HPrESnBXDy-AOmtlrzOA6Q/o.jpg"
      },
      {
        "img_id": "nv2ZB9WydE3ADrLxalJNHQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Fresh corn tortillas! You just have to ask the server.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nv2ZB9WydE3ADrLxalJNHQ/o.jpg"
      },
      {
        "img_id": "TYIRRq38F3EXqe--Pgo_7w",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. The sides that are included with the fajita meat.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TYIRRq38F3EXqe--Pgo_7w/o.jpg"
      }
    ],
    "user_id": "B0muVEQdT02pR7no_JmzOw"
  },
  "jqCKGtaFoD--Moz1JBsRig": {
    "date": "4/22/2017",
    "text": "Excellent Chips and Salsa.Very good Cheese Dip not spicy as stated. Ordered the Cadillac  Fajitas. Excellent high quality meat and vegetables. Outstand ing service. If it was not for the anti-carry policy we would return but adding this plasce to several avoid for Anti-Right to protect yourself aand faamily and they have Zero security. Gun free Zones are the places bbeing attacked watch t he news so the reason for a 1 Star review instead of a 4 is.... This place is Anti-American, Anti-constitution, Anti-2nd Amendment, Anti-Gun, Anti - Personal Protection, and Provide NO SECURITY. It can happen and it has happened. Without the rights granted by God and Country to protect my family NO one in any part of my family will ever return here.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4nODHRwfJf558IZ-PBuj3A"
  },
  "AD7nL1oEwqpd4csEp5HgLQ": {
    "date": "6/19/2017",
    "text": "Sub par Mexican food. The two taco meal for dinner was not very good. Portion size was good. The meal was just bland. Tomato salsa was tooooo tomatoey. No cilantro or lime. The building needs an update. It's like walking Into a time machine. Like a Friday's from 30 yrs ago. Won't be coming back. But service was good too. Mediocre at best C - across the board.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9AzWZ9fV8lQOaepQwE178g",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Half drank dos equis ambar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9AzWZ9fV8lQOaepQwE178g/o.jpg"
      },
      {
        "img_id": "ICOsnYAoyvBQ08dmkgcLSw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Salsa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ICOsnYAoyvBQ08dmkgcLSw/o.jpg"
      },
      {
        "img_id": "tK1qCEQ_zaNnHKvh4uT3og",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tK1qCEQ_zaNnHKvh4uT3og/o.jpg"
      }
    ],
    "user_id": "tuiR8GCh5eX-Z8twljeueg"
  },
  "Bvq8H5XWeIfLs4cemlbFmQ": {
    "date": "8/5/2018",
    "text": "Really disappointed. We go to Fajitas about 4 to 5 times a year and it's usually pretty good. You pay a lot for a meal here and it should be outstanding but it wasn't. We ordered a pound of the Cadillac Fajitas and a pound of the Chicken Fajitas both were dry and not much flavor. I don't think the Cadillac Fajitas were even the tenderloin filet, I think we were severed a cheaper piece of meat. The tortillas were too thick and tough. We also order the Cheese Enchiladas dinner hardly any enchiladas sauce and the beans were dry. Our bill was $107.00 + tip. We won't be going back any time soon.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XIWbu1y3MoqtdPqdglNUEg"
  },
  "mbn_GyffLzGUTFeWwT06Xw": {
    "date": "7/8/2018",
    "text": "This place used to be 5 stars.  I've been going here for 20 years. My most recent visit. The prices are really high and the meat portions small.  Mostly all fixings. The tortillas are of the tough texture. I asked why.  The waiter said it was due to the too minimum wage increase.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Z8dN-_8IMZ3FnHg2AhGlXA"
  },
  "M0X-JDqcaPLFwp9YkCul5A": {
    "date": "1/5/2018",
    "text": "I was there for the first time yesterday and I will not be going back. When we first arrived we were automatically seated which was nice but come to find out there are different prices in different sections. Our fajitas were two dollars more than the bar section, when the bill came I asked to speak with the very rude manager about the price and asked her to fix the price of the food to the price on the sign. She said it was bar price only. I told her we weren't offered a seat at the bar by the host and it was our first time there. Beyond that she was rude and refused to help.  The food there was awful, I got the fajitas (specialty) and the meat was like rubber the veggies were raw, not saute d and the small cheese, sour cream, and pico de Gio dish was just above frozen. If I could give negative stars I would.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "JQUXOzWEAmjtuN-qeMZdRw"
  },
  "VtxXJ8IZ6hPchkSMq0937A": {
    "date": "5/10/2018",
    "text": "This is our Favorite spot in the valley for fajitas and they have the best chips and salsa in town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TEtmpWp1Db3VG2KJQupp-g",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TEtmpWp1Db3VG2KJQupp-g/o.jpg"
      },
      {
        "img_id": "UH9E4b9QbTArTw0WeHH7eA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. The best shrimp fajitas and salsa in the valley. We&amp;#39;ve been going there for 23 years. It&amp;#39;s always consistent and always delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UH9E4b9QbTArTw0WeHH7eA/o.jpg"
      }
    ],
    "user_id": "uZpyoFKyuoBXPmKTEtZ_0A"
  },
  "oZf9CfGwrv9WhJtiyjEPaQ": {
    "date": "1/11/2018",
    "text": "My wife and I remember going to Fajitas when it first opened, 30 years ago. We loved it! Hadn't been to the restaurant in many years since, more options, closer locations for other restaurants. So we stopped by the other day. The fajitas were  good, a bit skimpy for a 1/2 lb order for two. My daughter ordered the chicken taco's rice and beans. She said they were watery. I tried one, the cook didn't strain the meat before putting it in the soft tortilla. And it wasn't tasty. We didn't care for the beans either. The waiter and manager were friendly and offered to replace the meal. We declined, they removed it from my bill. We will stick to our favorite mexican restaurant \"Popo's\" on Bell rd.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jFs2LiuLQg-dWfNvjIiBbQ"
  },
  "dZKqTg63YhKNQrBuHpf0yg": {
    "date": "7/22/2018",
    "text": "I used to go to Fajitas when they first opened many years ago. It used to be a very popular place but has gone downhill the last few years. We wanted to get the shrimp and chicken fajita combo but unbelievably any two meat combo is$36. Are you serious? We wound up getting the chicken fajitas. Aside from the fact that the flavor was average and the veggies hardly cooked, the tortillas were kind of thick. Anyway, how can you mess up Fajitas? Still wound up paying $29 for a small order of chicken fajitas. Won't go back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "waItb2zsmPIeAcvikJsKYA"
  },
  "6VWYh-GekzVx_unSIbeEHw": {
    "date": "3/20/2016",
    "text": "Ok, first off the staff is awesome! Peter at the bar and the female were terrific. The food though. WOW! Not in a good way. Ordered the top shelf Cadillac Fajitas. They arrived with raw warm onions. One slice of Green and one of orange bell pepper. The meat was tender, but cooked uneven. Some piece were rare, some well done. Growing up in Southern California, where real Mexican food is made, and traveling in Mexico, I have never see this. Additionally, the tortillas, made fresh in house, were pancake thick in the middle, and very cake like. Not at all like tortillas I have experienced. This should say Steak and Onions on a hot plate, not fajitas. Maybe White People Sliced Fajitas or something is more fitting. Open for 50 years, they have there fans, but I doubt many are hispanic. The place is old and run down and looks more like a cafeteria or old buffet setting, rather than restaurant. Bar has no TV's. Won't be back. OH and the waste! They bring the warm onions with meat over and a side plate of Orange cheese, about a cup, a cup of sour cream and a cup of Pico 'dgallo. What a waste.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sZwq87yE0YGZtIvXvwgJDA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. The view from the TV less, sad, bar into kitchen",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sZwq87yE0YGZtIvXvwgJDA/o.jpg"
      },
      {
        "img_id": "gv6MiAKuzqtHoLN37NJhfQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. The massive waste of cheese and sour cream",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gv6MiAKuzqtHoLN37NJhfQ/o.jpg"
      }
    ],
    "user_id": "-rL4utE1YXjOsIauK4uTNQ"
  },
  "BX_E8oJr5fYitEsJ6dL2TQ": {
    "date": "3/11/2016",
    "text": "Not what was expected from a Tex Mexico restaurant Nachos poor a few chips with s bunch of toppings made for  soggy nachos  waiter suggested  next time request everything on the side O.o Cheese Enchiladas no better corn shells with dry beans and rice my friend said they needed to add some milk looked like lard..the drinks Ok just ok will not return",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ku76d8yuUlo8SD2yV-ONFQ"
  },
  "WX7CYyiVq42IaWQO2qLvpg": {
    "date": "2/27/2015",
    "text": "Lots of chips and salsa bought to your table up front. Beer not a lot on tap but ok. Watermelon Margaritas a hit with my bro and sis. Chicken quesadilla was delicious mine with Jalapenos. And of course the Fajitas are fantastic!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GCjcgmv-yyYtUBH2EKrm_w",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Chicken quesadilla, yummy!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GCjcgmv-yyYtUBH2EKrm_w/o.jpg"
      },
      {
        "img_id": "WeBQcez-5FHtWQkbDRGqkw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Chicken Fajitas!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WeBQcez-5FHtWQkbDRGqkw/o.jpg"
      },
      {
        "img_id": "ShqPGFrhn7n3vry-_2vO8A",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Chips and Salsa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ShqPGFrhn7n3vry-_2vO8A/o.jpg"
      }
    ],
    "user_id": "Pbbiuh90cZLOpNgeNY1xEw"
  },
  "uFpLsKEkeP7qVR0AY2dJpQ": {
    "date": "8/30/2017",
    "text": "Bar none..the best fajitas ever.  They use beef tenderloin that is tender juicy and over the top delicious.  Tortillias made on site.  Friendly quick service always consistent.  Superior management that runs a well oiled machine.  Absolutely the only place in the valley for fajita!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcI_7Y9QT9vBJJFs9DClqQ"
  },
  "qqgwRYF1Iv4AyQHRe4T1uA": {
    "date": "2/24/2013",
    "text": "It's pretty standard Mexican food but the standouts are the tortillas.  Even if you aren't a \"fajita person\", you should suck it up and have them here just so you can experience the hybrid fry bread/tortilla combo they have going on.    Our server was prompt and friendly.  I fully expected that we'd have to wait on a Friday evening but we didn't which was great.  The margaritas need some work.  They taste like the Cuervo version in grocery stores.  (I like the Cuervo version but obviously, I can have that at home.)  More veggies in the fajitas would be great too.  The chicken was super tasty but they sat atop a pile of raw-ish onions.  There was A ring of green pepper and A ring of red pepper.  (More peppers please!)    It's a loud atmosphere so if you're looking for a venue to have \"that conversation\", I would suggest going elsewhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zTK1nPD2Hpa-ksSXsE-JzQ"
  },
  "V9a44CQa-xl3h7sne_NKJQ": {
    "date": "5/13/2014",
    "text": "Best fajitas I have ever had!  Mmmmmm!  We have never ordered anything other than the 1/2 pound of chicken, shrimp and beef.  We typically have enough left-overs to make 2 more meals for each of us.  The tortillas are made in the back of the restaurant if you want to watch.  The lady who makes the tortillas is very nice and will often make one for my daughter right there and give it to her. The margaritas are very strong and very good.  They go down very well with dinner.   This restaurant can be a little spendy, but worth it because of the left overs. Also, be sure to ask for more tortillas to take home for left overs, the staff is always happy to give more. **Make sure you order the fajitas.  After all, the restaurant's name is Fajitas, not Enchaladas, or burritos.... do not order anything non-fajita...yuck!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "w2da9BTY0I3--fFJG06hGA"
  },
  "tqh1w7rE3q330Ybz67W4bw": {
    "date": "2/20/2017",
    "text": "Just really nasty cheap Tex mex. tortillas are more like pita bread, thick and cake like as well as tasteless. Maybe a place for old people with dead taste buds but not somewhere anyone actually wants to eat. Just go to garcias it's on 35th ave and Peoria and it's a lot better.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EqYjWkwKzj3CPnOq46eZ4Q"
  },
  "taulFOkyPjeyBKyXcIR8oQ": {
    "date": "2/9/2017",
    "text": "Unseasoned chicken and onions that were nowhere close to caramelized.  Two of my pet peeves when it comes to fajitas.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UPA5jzys_FwoJ0rwY81sOg"
  },
  "TM7MS8y4q-rtkdhnwHt2Nw": {
    "date": "4/8/2016",
    "text": "Took my mom here for lunch today. I have eaten here many times before. The food is always ridiculously delicious and the service is decently average. Today, however, we had a server named Matt. Being a somewhat \"regular\", I have a very complicated order with substitutions and deletions. Matt wrote nothing down. He was extremely pleasant. When the order came, everything was nailed to the tiniest detail. We were very impressed. Of course we will be back, but we were so impressed with Matt's service, that I felt I needed to write a review and let his employers know as well. 5 out of 5 Stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZX9EH5P6LTTEh3AQQ7GRxQ"
  },
  "bPyAV9SPX6Bvf7GWc8COHw": {
    "date": "8/22/2017",
    "text": "HUGE portions oh my goodness. The food was good, not great but tasty for sure! Our server, Alex, was fast and friendly which makes the dining experience that much better! I had the Enchilada Guadalajara for dinner. Very good and filling however the tortilla was a little hard for my linking. Other than that, everything was great. Recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZO_RWlwZbk-D74BeKqpbbw"
  },
  "vyQcZiPzXHBxJJ6ARix9UA": {
    "date": "4/11/2015",
    "text": "I have been going here for 27 years, longer than I can remember. Love their fajitas, great rice, salsa and beans.   Can't wait to take my kids to this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CrXTuKbN9EtNtNdwBNIbsQ"
  },
  "jYsIbxg5cWixcsxTiWxgEQ": {
    "date": "2/3/2014",
    "text": "Been to many good mexican restaurants in the Phoenix area.  This was NOT one of them.    Ate at the bar, no TV, not the greatest selection of draft beer, the chips were like eating cardboard, and the burrito I had didn't have much flavor.  The queso topping was watery and bland.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "554mVwZqwlZdPL-RjqJ5CQ"
  },
  "wXHeJtkmuuyT3zXFiiet-A": {
    "date": "6/6/2016",
    "text": "We have been coming to Fajitas for the last 20 years. The food is always good and the staff is friendly and attentive.  The only con is the thickness and size of the tortillas.  They are very thick and big.  You say...really?? Who would ever complain about that??  I'm not complaining but think that it would be yummier and not so fast filling if they were a bit thinner and smaller.  Other than that, it's a great place!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9adGUkJXZc3WazdnUreJGw"
  },
  "clLevWwgqrkdv4tOl8xxIA": {
    "date": "6/24/2016",
    "text": "Been going here for over 25 years!  All their fajitas are good, but I like the steak fajitas the best.  Also they have awesome chips and salsa.  good tacos, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nR4ycs_4uYAfuJoSKPGHHg"
  },
  "5HiNVoncDKJpDKvYHYNujQ": {
    "date": "11/4/2014",
    "text": "We got in right away and the food is good as well as the margaritas.  I ordered Seafood quesadillas with no cheese (I'm pescitarian).  I'm thinking I should have had the fajitas they're famous for instead.  Regardless, it was fast and tasty",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-AQWxTp3ludiwhz7PMZkQQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Seafood fajitas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-AQWxTp3ludiwhz7PMZkQQ/o.jpg"
      }
    ],
    "user_id": "jjyGFopTxx9oWIs62hWR8A"
  },
  "cE3U-r3NBcK5DqYlrta5Zw": {
    "date": "10/25/2014",
    "text": "<a href=\"/redir?url=http%3A%2F%2FOmg.best&s=b0e70840dfae6bdde10ea264fcde82f6cabd1f9349c2ec94b4ab0ef779267290\" target=\"_blank\" rel=\"nofollow\">Omg.best</a> fajitas ever!!! Don't just take it from me experience it yourself.  Did I say Cadillac steak...omg!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "B3yqKCIEeNfXHZV6FnnI3A",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Cadillac steak...bomb!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B3yqKCIEeNfXHZV6FnnI3A/o.jpg"
      }
    ],
    "user_id": "NZfeSaHvQMHvwwQ5ZEqoCA"
  },
  "SV0BOkD0WkV5A-ZoV9iuCQ": {
    "date": "11/9/2013",
    "text": "Many visits later, I'm still loving this place.  Food is consistently good, service is always quick, portions are large, and prices you can't beat.  The queso and veggie fajitas as still my favorites but I've branched out a little to try the taco salad (enormous, fresh, delicious) and they have a layered dip that's served hot and is off the hook.    Sad that someone can navigate to Yelp to give this poor little place a bad review but is too lazy to do their own research in advance to eliminate surprises (pictures inside and out, list of what is included with meals and prices of items are all available on their website).  This place is pretty far from our office but we love it so it's worth the trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "itv1Vh8NTmJk7ipToWYvqA"
  },
  "NQq2PBOeFEnn-KDXhcMfhQ": {
    "date": "2/5/2014",
    "text": "This was my go to lunch spot years ago and we decided to pop in my last visit to Phoenix. The food is still really tasty, nothing fancy but good. Try the tropical apricot margarita-it's delicious, one of the best I've had! Just as their name says it's all about fajitas..steak, chicken, pork, veggies and more. Their portions are big and come with sour cream, cheese and salsa. Guac is extra which is a bummer. The only bad thing about the visit? Their queso was soupy which was kind of gross-thicker queso would've made it perfect.   Overall, still a good experience and for their lunch prices, it can't be beat.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "gfY-BGAJMINto1WK8w6orw"
  },
  "5v4uD9RsCnxSV59Dqqm3CQ": {
    "date": "8/18/2017",
    "text": "Fajitas=Heaven ;)  The fajitas here are the best I've ever had!!!  I will not get fajitas anywhere else ever again because no one else holds a candle to these!!!  Sure, I grew up on them, but everyone I have ever taken to try them here has also fallen in love with them.  I will not stray from the fajitas on the menu, but I have tasted the enchiladas a couple times and they were not good... But the cheese crisp is delicious, drinks are great, & the staff is really awesome!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QyCuMMY6eYmo5xq4b3T3FQ"
  },
  "LrkOwXe1PcZZBwCwRA6adw": {
    "date": "6/27/2016",
    "text": "I loved the food it was delicious! Very generous portions and waitress didn't have to be asked to bring us refills she was on it and provided great customer service despite we were a party of 8 people I would recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZORhaRWhaqr0hjQR8BtgTg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Sizzling delicious shrimp fajitas!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZORhaRWhaqr0hjQR8BtgTg/o.jpg"
      }
    ],
    "user_id": "j8XkM_ErPFp91pDp_aORhg"
  },
  "iWJ1DY5AtiQOdwYUAGADDQ": {
    "date": "3/2/2018",
    "text": "Well, so much for that I guess.   Having been a customer for the better part of a decade, I've seen the ups and downs with this place, and I've experienced just about every level of service and food quality. I get it, everyone has hiccups and mistakes get made, but what I cannot abide is when you have a consistent problem and do nothing to address it. Our visit this week was a case in point.   Once again, for what must be the tenth time now, our table for two started with great service and then, as soon as a larger party showed up, we were completely abandoned. Apparently the servers here only chase the all mighty dollar, and a tip from a party of 20 surely outweighs delivering service to a loyal but lowly party of two. Our server, \"Crysvic\", had always given us good service before and knew we tipped well, but I guess that doesn't count for much when the chips are down and they smell a bigger tip somewhere else.   The part that really frustrates me is that even though Crysvic was working the big party literally four feet away from us, and walking past every few minutes, she still utterly abandoned us and never returned to fill drinks, check on the meal, bring more tortillas, nothing. Eventually another server brought us refills but did not take over our table, even though she was working the booth directly next to us and constantly passing by. I guess she felt bad for us, but apparently not bad enough to do anything else about it? Nice.   To top it off, we had been served lukewarm beans, cool, tough tortillas and pork that was apparently not seasoned enough. I could have gotten past these things if anyone had asked and subsequently done something about it, but instead we were forced to eat it as served. What's more, once the original tortillas ran out (since they only gave us one basket), we had to let the other half of our pound of meat go cold while we emptied our drinks and waited for a server who never returned.   Eventually the second \"sorta helpful\" server returned and we asked her for our check. After that, and only this point, Crysvic returns with the check and some backhanded apology about how she got busy. Four feet away from us. To add insult to injury, no booze, no appetizers, half the food gone to waste and no service, but still got billed the full $50 for this farce. Didn't comp off a single red cent. I elected to compensate myself for this horrendous experience by not tipping her at all, rather than the 20%+ I usually leave. Sorry if that's harsh, but people who walk off the job don't get paid.   We never saw the manager the entire time this fiasco unfolded and, as always, there was nobody at the host stand when we finally walked out, so it wasn't as if we could bring it to anyone's attention. I did call and speak to a manager by phone later in the evening, but if I'm honest, I didn't detect much of any empathy for our situation, even after I'd explained to her that we'd been customers for a decade and had this happen numerous times. I was advised to take it up with the General Manager, which I suppose I'll do, but that was it. No mention of even bringing this table abandonment issue up with Crysvic, much less any attempt to make amends with us and get our business back.   I still dig the decor here, if for no other reason than the retro vibe and bringing back memories of when I worked in the area and some of the good friends and colleagues I dined with. When it's done right, the food is still something I get cravings for and in that case I honestly don't mind the prices either. The service though, has always been spotty and I even called that out in my prior review, as you can see below.   To that end, I will conclude by saying that if you decide to go, at least make sure you don't get served by Crysvic. If we ever go back, and that's a big if, I will absolutely ask for another server if I ever get put in one of her sections again. Abandoning a table of long time, repeat customers is unforgivable. Shame on Fajitas for letting their servers get away with that kind of behavior and shame on Crysvic for chasing a bigger tip and leaving us to rot.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "F-1ClQ8bSEp2T7NSnVYNRA"
  },
  "LjQFj19a3dgz-Sg6CqgAQA": {
    "date": "4/14/2018",
    "text": "Oh my gosh! You don't have to be a meat eater to adore this place! My neighbors/dear friends introduced me to Fajitas today! We ordered both the chicken & vegetable fajitas, which were done to perfection! They serve them with tortillas made in house. The kitchen is in the middle of the restaurant - wide open so you can see everything being cooked on a huge rotating grille. The fajitas stay hot on your table because they're served on cast iron skillets, with huge amounts of fixin's to enhance them. Our server was Eddie, who was very friendly, attentive but not smothering, and took very good care of us. He works Saturday's - ask for him - he's very positive & obviously enjoys people!   This was my first time EVER experiencing fajitas - the dish AND the restaurant. The prices were quite reasonable! Oh and I had a traditional frozen margarita which was perfectly balanced between sweet & tart - outstanding! Can't wait to go back! Also can't believe I've lived in the Valley since 1988, driven by this place on I-17 all this time ignoring this gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eVdt1mK63Ia6UHoo_9zNvg"
  },
  "ZmlzJjpPfsLlvsJo3RuHmw": {
    "date": "8/26/2018",
    "text": "Have gone here for my Birthday every year for many years. Have eaten here several times in between. Today, I ordered nearly $40.00 worth of fajitas to go. I asked if they could please cook the onions and peppers. They didn't the last time I ordered them to go. Just raw onions and peppers . He said..welllll..sure if you would like us to. We usually don't. I said, fajitas come out on a sizzling skillet when they are eaten in house. Just because I order to go, doesn't mean I want my food raw and uncooked.  I mean seriously...does Kentucky Fried Chicken give you raw chicken legs at the drive thru ?   I also asked if they could  please include some chips and salsa since that is always complimentary when eating in the restaurant. He said only if I pay for it since its to go. I asked why ? That doesn't make any sense. You even give free chips and salsa refills when we eat here. He said  \"That's how we've always done it. Do you want to talk to the manager ?\" I said no. It shouldn't have be that big of deal. He then sat my bill in front of me. I got up from the my chair, walked out, and went somewhere else. I will not be returning. Its just that simple. ",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "SpYYs1ddHDcCQTA_OsutOA"
  },
  "pSbY5vlRWvs-yINQqgSV5A": {
    "date": "7/27/2017",
    "text": "I didn't grow up in the valley. I have lived here on and off for the past 17 years, but it has been in the last three that I have lived near Metrocenter. Fajitas is one of those places that I see all.the.time when getting on I-17 north and always say \"Fajitas!\" out loud but always forget that it exists when I am trying to wrangle up some new places to try for dinner...until last week that is. Unfortunately, I wish I wouldn't have remembered.   Stepping inside was like stepping back in time, which I don't think is a bad thing at all. Honesty, at first sight, I think that a place that has \"been around since 1986\" and still has a huge following ought to be good. We were seated quickly although there were some large groups waiting and our server was over at our table in no time to take our drink order and answer questions. Chips and salsa arrive quickly after that.The salsa was bland (we added quite a bit of salt) and we decided to order a small side of queso which was decent.   For entrees I ordered the cheese and onion enchiladas, my partner ordered the Cadillac fajitas, and the kids had a bean and cheese burrito and cheese quesadilla. Quick review of the food....enchiladas had no trace of onion, the red sauce was not good on it's own but combined with the enchilada it was alright. Fajitas seemed to have only been seasoned with black pepper. She salsa, sour cream, and cheese mountain that came with it was pretty great. Tortillas are fresh made there and are very thick. Bean and cheese burrito and quesadilla were average. The rice...oh hell no. I don't like peas and carrots in my rice anyway but on top of that there was also corn. If that's how you like your rice you will probably be happy with it but not this girl. The beans? Super disappointing.  The highlight of the meal was our server who was attentive but I don't recall his name. I won't ever choose to go back to Fajitas on my own for a meal, but if I were with a large party and wasn't the one making the restaurant choice, I might consider it.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "pIrbS8OjmgsT2-NAIt3oZg"
  },
  "7Uh3AzJYVzjsM-RhN8_BEw": {
    "date": "8/13/2018",
    "text": "I've been going here for 20+ years. I moved far away in the valley years ago but still made the trek but haven't for more than 5 years. This place was DELICIOUS once upon a time. Hence me making the 30 minute trek. However when comparing the fajita goodness to even Jack in the Box's fajita pita this place has taken a nose dive. The tortillas of thin, fresh goodness have become chilly thick pillows of gummy yuck. Maybe the machine setting, heat & salt could fix this? There weren't any peppers on the platter only onions. The shrimp were the size of a nickel. My \"michelada\" was horrible. Tasted like watered down tomato juice. No flavor what so ever. The chips/salsa always were sub par so no loss there. They are exactly the same. Just a bummer all the way around. The best part was the kind, speedy staff member named Josh. He rocked even at a busy Saturday lunch time. This place is in desperate need of a make over. Just a shell of what used to be there. So sad that a childhood fave has fallen to this.",
    "rating": 2,
    "rated": {
      "funny": 8,
      "useful": 17,
      "cool": 13
    },
    "photos": [],
    "user_id": "TVkU2gHhe05v_lgsE_NccA"
  },
  "W6gAFTQEONSxJDHC2GO3zQ": {
    "date": "9/8/2018",
    "text": "how many ways can you do it wrong? worst presentation--ice cold salsa--meat had zero flavor---omg tortillas as thick and dry as a cardboard box. simply put-- the worst fajitas ---cant believe still in business. and the place is a shambles.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "KXcpPV86KukJjrzIaP9hmQ"
  },
  "W-Py7w7FBwpg5G8GplAuuQ": {
    "date": "8/4/2016",
    "text": "We love Fajitas!  The decor is dated, literally hasn't changed in 30 years but neither has the food.  I can count on it always being  consistently good. Service is always top notch. Chips are fresh, thin and crispy. Salsa made fresh, but sometimes its mild, sometimes medium, sometimes hot!   Fajitas are sold by either the half or whole pound. Half pound can easily feed 2-3 people. Half pound of cadillac, beef tenderloin fajitas is $21. $40 for 3 nonalcoholic beverages, 1 kids meals, a side of refried beans and a side of guac. Not bad for a weekend dinner for 3, with leftovers!   Tortillas pressed and made on premise in a  glass enclosed work station. Be prepared they aren't the average thin flour tortillas. They are thick but that means you can overload on the fillings. Guacamole, cheese, sour cream, pico and those great caramelized onions. Meats too are grilled in the middle of the restaurant.  If there was a draw back it's when you leave you smell like the restaurant. The smoke from the grill and those onions.   I can't vouch for the rest of the menu. The name is Fajitas for a reason. Try them!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IFJbvfIDzLnauzVvhGcZ2Q",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Cadillac Fajitas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IFJbvfIDzLnauzVvhGcZ2Q/o.jpg"
      },
      {
        "img_id": "zJ_UcqRIE_2f9Y1e9F3CLw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Half pound Cadillac Fajitas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zJ_UcqRIE_2f9Y1e9F3CLw/o.jpg"
      }
    ],
    "user_id": "N-WO-n6-AyVzdROSzhx5rA"
  },
  "4PG6Wztgk6AqYgEHjEY2Yg": {
    "date": "8/26/2018",
    "text": "Great food as always.  The issue is the servers.   The male servers are friendly and attentive, it seems the female servers not so much.  There is one manager that is blonde that Everytime we come in is sitting at the bar and never gets up.  As a manager there is always something to be done and how does that set an example for the staff???   Poor manager.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "r3AyduUY-m-sE0y3bljpHw"
  },
  "zYAIOeI9npOsyyyASPZLCw": {
    "date": "2/23/2019",
    "text": "This place is terrible DO NOT COME HERE !!!! The food was terrible and the service was even worse. Not only did the food take a long time but then it was not cooked right. The chips were stale and overall was a terrible experience",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "M2qdY-ekpntdsatfzKcDpA"
  },
  "Q9EnqNyxIi1FbUMVTCZOUQ": {
    "date": "2/14/2019",
    "text": "Ordered a michelada and they bring it to me in a full glass of ice. Michelle's aren't made with ice. I literally got 3 sips and that was it. Total rip off. The waiter was saying that the manager said this is how we're making them from a search she did online. How about go to Valle Luna and order one you'll see how there made. Oh by the way they don't take VISA gift cards. I won't be back to this place. Over priced.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RHmzjc2-afyElIdgMTpQww"
  },
  "O6BrDj3jfqt8GeU-CsfeSg": {
    "date": "10/25/2018",
    "text": "Since 1986 I have been going there. Smell like onions heading out the door, but it's all worth it. Love sitting at the back bar area and getting lb of shrimp. We have made friends with a lot of the employees over the years. We have argued with the owner about putting TVs up in the bar area, but no luck. It's the worse part of the experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lHWdtD-h2-ka-NtmDPt2tQ"
  },
  "wUZu9XA6M-dvQDS7XXDgPQ": {
    "date": "2/19/2017",
    "text": "Horrible. The food here tastes like hospital food. This is not real mexican food at all. Avoid this place at all costs. I ordered the 2 cheese enchiladas with onions and I was forced to get it with red sauce. I really wanted it with green sauce but the server (Eddie) said \"there wasn't any in the building\". The sauce was disgusting and barely had any flavor, it tasted like really bad spaghetti sauce. The beans and rice was bland and dry with barely any flavor. I will never be coming here again. I waited 30 minutes to be seated just to have the worst \"mexican\" dish I've ever had in my life. The only good thing about this place is the service, Eddie did a great job. I wish I could say the same about the chefs. Do not go to this restaurant. This place is overpriced and disgusting.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "L-4z98OIUiRw7yrwovJVQg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Cheese enchiladas. Looks good but it didn&amp;#39;t taste good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L-4z98OIUiRw7yrwovJVQg/o.jpg"
      }
    ],
    "user_id": "aeuo-PdHqd4IQSoH-Kueyg"
  },
  "9nQE7X_zSXE25qVIDAfQDQ": {
    "date": "2/19/2017",
    "text": "If your looking for a place that serves fake mexican food this is the place to eat at. I  had the taco salad it was good my son had the  cheese enchiladas with rice and beans  the rice tasted weird it had no Spanish rice flavoring and the enchiladas tasted like tex mex which is ok but not the traditional enchilada taste. I tasted it and liked how they smother the enchiladas in cheese. We did have a great waiter named Eddie he answered all  500 questions my fiance asked lol... so i gotta give him most the star credit.  The food is overpriced and it did take about 40 minutes to get our meal. I wouldn't mind coming back for the salad but it is a white people mexican food restaurant not real mexican food.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "27xgYi87OAbgxJPmfHrc_w",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/27xgYi87OAbgxJPmfHrc_w/o.jpg"
      },
      {
        "img_id": "P-cIovugYgkNehJ5p8fvDg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P-cIovugYgkNehJ5p8fvDg/o.jpg"
      },
      {
        "img_id": "eRLUm2rKDmgt4mf2E1GCxw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eRLUm2rKDmgt4mf2E1GCxw/o.jpg"
      }
    ],
    "user_id": "kHXGAlH6h6jY52mn6SSBDA"
  },
  "4bUnBY2EjPo1_PMYqfgENA": {
    "date": "11/28/2017",
    "text": "Well the main reason to go for lunch was to get a better deal than the dinner prices. Now that is shot to hell as they have increased the price of a lunch portion of fajitas to a whopping $9.50 (used to be $7.95). The portion sizes stayed the same, but the quality of tortillas (The highlight of this place) has hit rock bottom on my visit yesterday. The waitress tried to explain the poor tortillas with some wacky \"it relates to the weather explanation\", but truth was I don't know what happened to my beloved thick tortillas. We were served over toasted thin tortillas which is not why I go here (only been three times). I even ordered a 2nd batch, but nothing changed. The fajitas themselves either had grilled or raw onions and maybe could have used a few more more slices of chicken, but otherwise were good enough.Still, with a price surge and poor tortillas, it wasn't a great lunch.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nv2Cl74YrGSmYxgXLY8GwQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Grilled or raw onions",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nv2Cl74YrGSmYxgXLY8GwQ/o.jpg"
      },
      {
        "img_id": "l4ps1xJbn_VbVY-LYP3AnQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. 9.50 now",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l4ps1xJbn_VbVY-LYP3AnQ/o.jpg"
      }
    ],
    "user_id": "ELcQDlf69kb-ihJfxZyL0A"
  },
  "Gs_uAw0Pq8s_v7Wb9wwt1Q": {
    "date": "4/4/2019",
    "text": "I've  been getting great food here for nearly 30 years. Hands down best fajitas ever. Get the Cadillac steak and shrimp perfect mix. I love the chefs they have been there the entire time making awesome food. To this day you can taste the pride they have in the work they do. The serving staff is always great too! I must say the manager has attitude but maybe that's what it takes. The good far out ways the bad so get some today!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kow3wlbtwDZ2Lf8P-ui18A"
  },
  "4vubwKho1HceNz1n4wjy-w": {
    "date": "6/4/2017",
    "text": "So I was at a confrence at the Sheraton Crescent Hotel in SunnySlope Phoenix. The confrence let out for lunch and a group of us decided to go Fajitas for lunch which was right down the block.   Fajitas is a mexican food restraunt that specializes in fajitas but also has other mexican food fare. They also make their own hand made tortillas perfectly sized for eatting fajitas.  We arrived and we're seated right away. The place wasn't packed but wasnt empty either. The smell was great because they cook the food right in the middle of the restraunt. We were seated in the middle of the restraunt and were given chips and salsa. We ordered our drinks and went over the menus.   A friend and I decided to go in togeather n a pound of Cadillac steak fajitas (highly recommend if your ordering beef, very tender). The food came out right away.  Usually when you order fajitas at other places you have you search around for meat hidden in a sea of vegetables. Here its the opposite. There is plenty of meat and plenty of topping on the side for you to dress up your tortilla.   Fajitas is a great place and im sure after I tell my wife about it she will want me to take her there again soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YJTorPfByzMt7IBKo_ywAg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Fajitas and plenty of fixings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YJTorPfByzMt7IBKo_ywAg/o.jpg"
      },
      {
        "img_id": "pkZSGPaEMAa9swmIPjiIsQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Chips and salsa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pkZSGPaEMAa9swmIPjiIsQ/o.jpg"
      }
    ],
    "user_id": "y4GcO5_Ipgi0Fyg7RjGUqg"
  },
  "oEaKoOzhM_qEYfDSc934LQ": {
    "date": "6/19/2018",
    "text": "We went here on Father's Day. Ordered the queso dip. It came in a container a little bigger than a ramekin. The price was 7.50. It was thin and very bland. For dinner we ordered the \"cadillac\" beef fajitas. I think they gave us yesterday's beef. They were very tough. The tortillas were good. I would not recommend the guacamole. 3.75 for a very small side. No flavor and runny. Our server was nice and kept our drinks filled. We will not be back. If we want fajitas Chili's or Applebees has better.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zYRjzI3E_0UYPkhFjQAuFQ"
  },
  "AciehEhzVkIZU_wvWhrYMQ": {
    "date": "1/17/2017",
    "text": "The fajitas here are extremely good! The Cadillac beef is their signature cut and is fantastic. The shrimp are also plentiful and delicious. But the standout are the tortilla shells - homemade, substantial and addictive! Nearing the thickness of a pita, that might actually be the only knock on the place. That the tortillas are SO thick that in order to properly enjoy the contents, you really have to load up the fajitas. About half the thickness would be perfect, but it's not stopping us from coming back. In fact, the tortillas are so good (thickness and all) that we returned within a couple of days.  The service is among the best we've had in our almost 50 restaurant visits in the Phoenix area so far. Our server was more helpful in our ordering than I ever thought I needed him to be. And he was right on every count.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "QT-ddLt8M7jwo7sQ2YcVPg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QT-ddLt8M7jwo7sQ2YcVPg/o.jpg"
      },
      {
        "img_id": "aML9KjBf_md0dvDv_0UZVg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aML9KjBf_md0dvDv_0UZVg/o.jpg"
      },
      {
        "img_id": "Eggr4gh_h7p12Amz1YdBxg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Eggr4gh_h7p12Amz1YdBxg/o.jpg"
      }
    ],
    "user_id": "4bxhIKz9ePWqD93UkEjnbg"
  },
  "o10XV2w3YQyfMODkei7xhw": {
    "date": "12/27/2016",
    "text": "I've been going to Fajitas for most of my life and tonight I realized that not much has ever changed there - and that's wonderful.  The decor may still be the same and thus dated but the tortillas are still my favorite in the Valley.  Our usual meats are the cadillac beef and chicken. I could eat an entire basket of chips by myself and their queso is amazing. I've been coming here for over 20 years and never had a bad experience with service. Thanks Fajitas for always staying the same!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "-HH9X240K3SaBq4xzWGrOg"
  },
  "Inu0ARQVWlmYhBAZqfXJjw": {
    "date": "6/4/2018",
    "text": "Good food, but the restaurant is badly in the need of an upgrade. Tables and floor are sticky.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fGdLeR4xNNk9PsAMVwap6g"
  },
  "6xTAyZtF_q58vyT2f8lZiQ": {
    "date": "11/27/2013",
    "text": "For fajitas, this is THE place to go. The name says it all. Plus anything grilled is also amazing. Huge veggies, perfectly prepared. Service ids consistently good. But margaritas are a little watered down and cheese crisps are just so-so. Warning: After you leave, you will smell like one of their sizzling fajita plates. Been coming here for 10 years and that's a guarantee each time. Oh yeah, the relish plate for your fajitas? Get the guac. Yummmm.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VzrWmTeFoNIJDNX4yJhz0w"
  },
  "eIUlxVAoZzAKnMkm8a6jxw": {
    "date": "10/28/2013",
    "text": "I come here because this is where my husband's aunt and family come. We are very happy with Mike the bartender's service and he gets 5 stars. The food takes a bit to get to you and I think the tortilla is a bit thick. Its a nice place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PyGKfcNiEUGIpN-qv33nkA"
  },
  "O6MMMEe8WeYm-pvYmMhvsw": {
    "date": "5/26/2014",
    "text": "Mmm this place is so good I drive from Tucson to eat here. I have order the Cadillac.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yLQGhQM3rdshyrqZHKs4dA"
  },
  "lGRPXVVq9M2G8O9UIWi9Lw": {
    "date": "2/5/2014",
    "text": "The food was decent, but prices were stupid expensive. The lunch portions were minimal for $8.50, the 1/2# fajitas were $20. Small sides of guacamole are $2.25. Given the early 90's cheese decor, your money would be well spent elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1LM0f41K_mNqBjVl7PB1pQ"
  },
  "d7tuhz3ad0Wnv5b8hKsY9w": {
    "date": "12/29/2013",
    "text": "I've been going here since 1996 after moving back to Phoenix from Orange County, CA...All the food is great. I recommend the Cadillac Steak Fajitas. Guacamole instead of sour cream. The chips, salsa, tacos and burritos are great too. Everyone I take that comes from out of town LOVES the food here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rTJqowuaCZUjh7kpb_sSqA"
  },
  "8VYz6X5yAqmkyvJ0KkUlbw": {
    "date": "11/8/2013",
    "text": "I'm from southern Cali and I feel I know really good Mexican food. The only thing that was good was the chips and that's about it. For a place called fajitas, the fajitas were terrible. The price for what you got was bad. The service was below average. I will not be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JO-ZMtObnyZ7eu_cQ8MyNw"
  },
  "zWLxIE26zCRAKlahhGAvRQ": {
    "date": "1/11/2014",
    "text": "Best queso ever!  Love the shrimp and vegetable fajitas with corn tortillas!  And if there is room, the sizzling apple pie is heaven!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6X9KaSuv0TEKHBupUTvT6Q"
  },
  "5N3YCFGDr3RYqWlBgrup9A": {
    "date": "7/3/2013",
    "text": "Ahhhh! I've loved this place for years and it was such a treat to get to this side of town and have some wonderful fajitas. I'm a big fan of restaurants that concentrate on one thing and do it well, and this place does not waver from that. All the food is made in the middle of the restaurant so you can watch with your mouth watering as they freshly grill the tender meats and spicy onions for your meal. I always get the \"Cadillac Fajitas\" which is beef tenderloin--a little more expensive than the regular steak but worth every penny. And the tortillas (oh the tortillas!!!!!!) are so doughy, buttery, and just plain delicious! The service is always on point, and margaritas are strong...you just can't go wrong with this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "P6rpdRwuwC9cTgaNnU1JaA"
  },
  "-cgnoO-ze8rrm1SHj8c4LA": {
    "date": "6/7/2015",
    "text": "The happy hour is the best in the city. $2 beers and half price appetizers. We ordered hige nachos for $4. Great place, fresh food and friendly people. I go once a week at least and will continue to sing their praise",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G6XG5g-965tM95cEk8LfVg"
  },
  "eBCc5ypDMjrV0knU_Q9X5Q": {
    "date": "12/28/2015",
    "text": "This is my absolute favorite restaurant in the Valley. We have been coming here since it opened in the 80s, and I was a little kid, and it's just as good today. We have only ever ordered the Fajitas, so I can't speak to much else on the menu, but why in the world would you come here for anything but the fajitas? The cadillac steak (filet), shrimp (to die for), and the veggie fajitas are my favorite. The flour tortillas are handmade and so good. We usually order a batch of corn too since the flour is very filling. The tortillas chips and salsa are also handmade in house. Best of all, you can feed 2 people on $30-40 and they always have a low cost margarita of the day. I wish it were closer to my home. I don't even care that I leave smelling like Fajitas. It's that good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6dK2EHJuDfKOWpvUX7-G-Q"
  },
  "hWwUtuIek8IogaPIr05mdQ": {
    "date": "4/18/2011",
    "text": "The first time I went to Fajitas was before the Internet was around and long before Yelp was invented. I think it was 1988. I don't live in the Valley any more, but I try to get by Fajitas each time I return. The food is as good now as it was then.  Bottom line, the place is called Fajitas - so order the damn fajitas!! Don't waste your time on something else on the menu... I usually get the shrimp Fajitas and they come with a solid pile of guacamole, sour cream and cheese. The tortillas are homemade and delicious. The chips and salsa are good as well. Maybe a little mild on the salsa, but that's better than too hot in my opinion.   My visit last week included good food and good service. The prices are a little high if you get the 1/2 lb fajitas but you may well have enough to take home for a snack later on.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7OrcWncSqFSeYXtaML904w"
  },
  "he8gKFALE6_l3oS1ehOhRQ": {
    "date": "3/15/2014",
    "text": "I used to come here almost weekly but the prices keep going up and the past few times the tortillas have consistently been hard and chewy, I got tired of asking for fresh ones... The salsa is inconsistent also, hot one day then like tomato sauce the next, too bad because this was one of my favorites restaurants....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F3aztxDTYmiXoy5jDz0vLg"
  },
  "4H5I5vleIm43LcG5y8DfCQ": {
    "date": "10/19/2013",
    "text": "The fajitas are fresh and tasty as are the chips & salsa.  Love the food and especially the Sizzlin' Apple Pie for dessert.  It gets 4 stars because the physical building needs a facelift.  But I prefer a local place like this with great food over a perfect building with only average quality food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IggzWJBquDJOiTL6NAY0Bw"
  },
  "J09Yr-yHalsCmUooWj5MWQ": {
    "date": "3/4/2014",
    "text": "I think this place is great. The food is terrific, the staff is great. The location and parking are fine. This is nothing fancy, but it's fast and good.   So, mainly, they serve Fajitas but there are other things on the menu. I've never eaten any of them and, in fact, I never even looked at them. We get  1/2 pound of the \"Cadillac\" which is filet mignon for the meat and it's plenty for two of us. I'd be just as happy with skirt steak or chicken but we like to upgrade things when we can. It comes with sour cream, cheddar cheese and some kind of tomato/onion salsa. Oh, and you get chips and salsa before the meal!! I got a \"salad\" as part of my meal. I don't recommend it. It was tiny and expensive for a slice of tomato and iceberg. The grilled zucchini is a nice add on if you want more food.   The food, overall, is a tad bit high for the kind of place this is, IMHO. You have to order the extras separately, but those are things like beans, rice and guacamole.  But, I didn't deduct much for that experience. But, the decor is old. It looks like this place has been around a long time and everything is showing wear and looks a bit dated. Charming in a way, but not that much. Maybe in 25 more years it'll be charming in a good way, if they wait it out. LOL.   I enjoy this place and look forward to eating there when we can.  I always leave full and happy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ETisYtOSqGMXbnLnMQI7A"
  },
  "CE_3AXyUPv1NP57YOLLY8w": {
    "date": "8/24/2013",
    "text": "Awesome, attentive service!    Our family of four, plus my parents, met at Fajita's to celebrate my husband's birthday.  I emailed the restaurant a few days prior, to find out what accommodations they could provide, if any, for my mom who has a severe gluten allergy.  I received a prompt response from Mike S, one of the managers, who assured me that they could cook the corn tortillas in an area separate from the flour tortillas.  He told me to ask for a manager upon arrival, and they'd take these extra steps for my mom.  Sure enough, the (female) manager working tonight was on top of things, and made sure my mom's food was kept away from items containing flour.    We all were very impressed with the quality of both the shrimp and the Cadillac steak fajitas.  Our kids even loved the proteins, and went back for seconds a few times.  The chips and salsa were pretty good as well.     The best part of our visit was the attentive service.  Our server was absolutely fantastic--prompt with taking our order, with refills, and with removing our plates afterwards.  She was cheerful, polite and just an absolute pleasure all around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQDyvpL6S36mfn93fdHmdg"
  },
  "KY9hiMl0Q4nwJOo4aVH4kw": {
    "date": "7/23/2013",
    "text": "I've died and gone to Fajita heaven this place is amazing. You can't get enough of the Tortillas homemade and fresh  the flavors of the beef and chicken are very tasty and the SHRIMP AMAZING.. was there for a dear friends birthday and the waiters kept up on chips and drinks for us and when our food came out they made sure we had everything. It was a great experience. I love this place. Just wish there was one in the east valley",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VNX7wMJf1NSSvMAOb6LymQ"
  },
  "xJvAAp3Ax5LqWwl7hlYKwQ": {
    "date": "10/5/2010",
    "text": "The veggie fajita lunch special here rocks! It also comes with free chips & salsa (although their salsa has absolutely NO spiciness, hence the 4 stars).  For vegans, get the: veggie fajitas, no cheese substitute guacamole for the cheese & sour cream optional: a side of fresh jalapeno's (75 cents)  They tell me their tortillas are vegan, containing just flour, baking powder and one other non-animal ingredient (can't remember what they said).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "aSbnrqpX-CHr8nxHhaCHZw"
  },
  "UX_ysDyXpR9M485ECr8sJw": {
    "date": "2/14/2013",
    "text": "Was just sort of mediocre for me.... I think it's just a matter of personal taste.  Chips were very good for my taste.  Thin restaurant style and tasted fresh.  Service was also very good.  Our waitress was attentive, always topped off drinks, made sure things were good for our table...  I thought they were a bit pricey seeing as the there wasn't anything that set their fajitas apart from any other Mexican restaurant.  I think somewhere around 20 bucks for a pound of fajitas.  Margs were nearly 6 bucks and a draft was about 3.  The part that made me rate this a ' just eh' was their tortillas.  I prefer a tortilla that lets all the other ingredients stand out.  Their tortillas were more like pitas.  You had to pile in a lot of meat to be able to get taste through their thick tortillas.  Like I said, maybe a matter of taste as others on here seem to like their tortillas.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AQZfXApUPe0QTU6hCgwAOQ"
  },
  "mdfy6g852qM1TcoQhnTACQ": {
    "date": "5/30/2013",
    "text": "Best fajitas outside of Mexico!  Fantastic service and great prices!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MW3sgIJwqwZGlWlWdDyjKQ"
  },
  "uUhQ7UFYN8-sz_9W6jzSpA": {
    "date": "11/2/2015",
    "text": "When they pulled out them fajitas sizzlin on that plate...GAAAAAAAWD!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s95ahtqj_WD-teqJ_lyFcg"
  },
  "lODlb4sVvyrCo4_CDb1B6g": {
    "date": "3/11/2016",
    "text": "This place was delicious. My family and I were looking for good Mexican place during our vacation and this was the spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jgH0rm7V04rglA0B_z6ZRg"
  },
  "IYdCFZh8phd2VCM451oPDA": {
    "date": "3/5/2011",
    "text": "I was thrilled to be able to come to Fajitas for my friend's birthday lunch. This restaurant has been around for what seems like eons and a very fitting venue to celebrate the big 4-0! In fact, this place was a regular haunt of mine for years and I even had my 17th birthday party here (with my friend Kari the now 40 year old!).  We had a party of 16-Kari's family, her parents, siblings and their families. We were seated at a long table and the first thing I noticed is that the decor is exactly the same as it was since we were in high school. The menu changed a little bit, but the salsa and chips were the same too. We had a nice waitress, the iced tea was great and we ordered cheese crisps to start and as a table ordered beef, chicken and shrimp fajitas along with a couple of sides of guacamole.  The cheese crisps arrived first and were incredible. Ivy, if you are reading, this is a must have cheese crisp!Better than both Macayo's or Garcia's hands down. Light, crisp and fabulous. In fact I liked the cheese crisps better than the fajitas! The fajitas arrived, the shrimp had good flavor but were small and shriveled looking and obviously overcooked. The steak wasn't as good as I remember it and realized we didn't order the more expensive meat (cadillac) so that could be why. The chicken was perfectly cooked and really good. The tortillas are great-these have been around since before Chevy's hit the Phoenix area and I will admit the guacamole was delicious and quite the surprise. I was thrilled at how good the meal was and even more thrilled to be celebrating with my friend at a place that has so much history within our friendship.  For those of you who are Fajita's newbies-here is a warning. This is the type of restaurant that the food smell sticks to you inside and out. I knew we were coming here so I had planned on what to wear-even down to the bra I traveled in and knew I would be doing laundry before I packed to come home the next day. Yep, long running joke about Fajita burps, farts, and clothing and they are all True so beware! Years ago, they didn't have a product like Febreeze. Now that they do, makes eating here a lot easier!",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 11,
      "cool": 10
    },
    "photos": [],
    "user_id": "9bxdPvAhP6cuipD5s2UnCg"
  },
  "QE0e0QmQZws9D1H844AuNw": {
    "date": "12/3/2014",
    "text": "Never had anything but the fajitas here...because they are the best in town!  If you want multiple meats, ask for one pound of meat with half of it beef and half of it chicken (for example).  Cheaper than ordering 1/2 lb of each.  Good service.  Great salsa and salsa con queso.  I repeat, BEST FAJITAS!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aoDxSvS1GDKV0UlqlYZQUw"
  },
  "lWz8VPHlww881U6nIUmB5A": {
    "date": "3/11/2014",
    "text": "Perfect spot for fajitas And many other Mexican dishes. Fajitas portions are half of pound or full pound. And trust me its fresh and delicious. Happy hour 4 to 7pm. Make sure your hungry when you go. I'll highly recommend this spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qeC_E6DfIpEqtXFib-5h_A"
  },
  "5g6j7WqkzMVTmayKJ0Iq0A": {
    "date": "2/18/2014",
    "text": "Okay, people, you have to order fajitas at Fajitas! It's seems like most people who have given this place bad reviews didn't try the signature dish. Our favorite is the shrimp fajitas and a small order of queso. I always ask for the onions well done because Otherwise they are mostly raw. My husband's family has been coming here for years and we continue to come a couple times a month. Jamie is an exceptional server and remembers everyone and what their order is. And we love the tortillas! Always freshly made and they're definitely not stingy with them!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "LgipVlvoYnqbbd41ka12Ag"
  },
  "nvWfP_e-f1kabWk4dhiUBg": {
    "date": "11/12/2013",
    "text": "This place brings me back to my childhood. A born and bred Zonie, I grew up absolutely adoring this spot and after many years, the food is still just as awesome as I remember.  The service has always been attentive and efficient.   Does the decor need updating? Yes, it does but I prefer to think of it as frozen in a simpler time so I do not think they need a renovation. But of course, I am partial to it. With that being said, I have always thought their prices were on the high side. Not prohibitively high, mind you , but higher than I feel good about paying for the portions.   All told this place is still a gem from my childhood and I plan to return over and over again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uZV0neUr5NefvU4o3NZBPw"
  },
  "_hlB9bCXlQ9OIXlczhp6Ww": {
    "date": "5/3/2013",
    "text": "I've driven past this place a hundred times, and never gave it a try because I thought it was just another chain. When it was featured on \"Check Please,\" the fam and I decided to go there. Boy am I glad we did. The tortillas are what make this place. They are melt-in-your-mouth wonderful (they make them on the premises, and you can even watch them if you're bored!). We had the Cadillac fajitas, which were dynamite. I don't think I can ever order fajitas again at another place, simply because these tortillas were, if I can mention again, fantastic.  For dessert, we split the apple pie. It came on a skillet WITH SIZZLING BUTTER ON THE BOTTOM. Sizzling. Butter. Stick a fork in me. I'm done.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6pP6MCLDgriDcmJGkqSfvA"
  },
  "Nw8KoiethfM6zwNBdhec_A": {
    "date": "9/13/2014",
    "text": "Fajitas is the only place I will eat fajitas. Usually do dinner there with friends every two months or so and have been doing so for 10+ years.  There are five of us and we always order 1 1/2 pounds of pork fajitas, nothing like being in a rut, but they're the best so why switch. I thought it was finally time to write a review.  Last night was no different, same time, same place and same order. We were seated quickly in a large both. Chips and salsa to start with sodas and iced tea for all. Chips are OK and the salsa has just enough kick. Placed our order with what turned out to be the BEST server we've ever had at Fajitas, Tiana. We've never had poor service at Fajitas, but Tiana was above and beyond. Always a smile, drink glasses never got below half before she brought another refill and our order came out spot-on. Tiana kept checking back and brought everything before we had to ask, that's good service! Pork fajitas didn't disappoint and come with fresh tortias and more as needed.  If you want great Fajitas this is the place to go. I can't comment on any other food items because I've never tried anything else. I kind of have my favorite places to go depending on what I'd like to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0LG-6Dno6HK21dTTmt4LQg"
  },
  "upPVGUoJRxuAvNmC2uYDlg": {
    "date": "12/1/2013",
    "text": "We have been back to this place three different times since our first incredible visit and sadly, none have been as good as the first. The service has been good for the most part and the prices are still reasonable but the fajita's have just not lived up to that first time. The tortillas don't seem as fluffy and light and the toppings seem less than quality. I'm not sure if its because that one time I was starving when we got there or if the quality has really gone down hill. The cheese is bright orange, the tortillas seem overly heavy and smell of lard and the overall quality of ingredients just seem sub-par. I don't think after the 3 attempts of ordering the exact same meal to recreate our first experience, we'll continue trying. I do think the place is descent and would be okay if you're really craving fajitas but don't mind mid-grade food quality.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "un2KUxPNvUOZDuUYoN-FQg"
  },
  "nUxsMYzC1KfbUHrl8gEPhQ": {
    "date": "11/4/2014",
    "text": "I live in California but when I come to visit my in laws this is my FAVORITE place to go. The food is all so fresh and a lot for the great price and my kids enjoy the environment and they get to make roll out their own tortillas great fun and great food for everyone. Thanks Fajitas for always making me want to come here every time I visit Phoenix :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BALVnJnVIMbjxxiVMEBC0A"
  },
  "-vzrKCctkXRq0Fue2QrX3A": {
    "date": "1/19/2016",
    "text": "Superb place to hang out with friends, colleagues or family! Great food and superb service! The chips and salsa on the house have always been great. The margaritas and must-haves!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LOHmaTWVJgB3MU723zHBDw"
  },
  "9ysBlhxHqkMsVc0jnvsypg": {
    "date": "6/21/2014",
    "text": "One of the best places in Arizona for fajita lovers . Cadillac fajitas are a must try here. The Cadillac fajitas are a little more expensive than the regular steak fajitas but a better quality meat. The tortilla soup is also great. They will even give you extra tortillas to take home. Good stuff!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6PjkDSUjD75l7AvglOWLxg"
  },
  "CXKR3yavs9DJPmXCQJXnng": {
    "date": "4/11/2011",
    "text": "I would have to say that this place is as \"american\" as you can get when it comes to \"mexican\" food.  The fajitas are ok and have a decent flavor to them.  I wanted a little more than a pile of onions though, think about adding green, red and yellow peppers also...  They gave you chips and salsa when you sit down which is nice but the salsa is very mild and when I asked if they had a spicier salsa they said no but gave me a bottle of Chalula to help.  One good thing is that instead of flour tortillas I asked for corn and they had them, not many places do.  Our waiter was great and made sure we have pleanty of refills on our drinks.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-eBkx1Hl2A40GZAaZvXR1Q"
  },
  "8GeYIV3AIuEUwWYUCemKrA": {
    "date": "2/8/2014",
    "text": "It was OK but nothing to write home about. Service was great but was not impressed. Both kids meals were cold and did not taste good for the kids or the adults when we tried then. Our fajitas were OK but nothing special. If your in the area not a bad place but not worth a special trip.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eg0O-sLtihJjznZMgWOSoQ"
  },
  "hof1f460U_uV_JGnrt0baA": {
    "date": "1/31/2015",
    "text": "Overpriced and no flavor. Apparently everyone who loves this place has not had fajitas anywhere else. Cold chips and whats tastes like can salsa, asked for a side of cheese con queso to maybe add a little life to the chips and by far its it canned cheese you by at Costco with green onions added to it. Service was good until he had more than two tables, waited 20 minutes after we finished our meal to even see him for a check! Disappointed in this place.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "z4CD2UFE5bbbt4gGAahlYQ"
  },
  "YTkN8AaOPuCGlZI60tB5xg": {
    "date": "1/14/2011",
    "text": "Came here for a B-day lunch for myself and the whole family. I think it was 16 total. No problem. They basically gave us a whole section to ourselves, which was great for all the little kids we have.   Why Fajitas?? I have been to this restaurant w/every person that has ever been in my life. So, it is very nostalgic for me. The good news, is that the food is still delicious. We had beef, chicken, and shrimp fajitas. The tortillas are still homemade, and the guac. is some of the best. We also shared two cheese crisps, and they were nice and crisp also.   The salsa is boring, and the place could use a deep cleaning, but I still love the place, and I'm sure I will be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "X0_MP4NVsW6FDxmoKAMYHA"
  },
  "yFRuXqqnDNVU8MHGh6U_bQ": {
    "date": "4/22/2012",
    "text": "Not my side of town, but it is close to a major freeway and easy to find. The menu in my opinion is somewhat on the limited side but the food is pretty good and the prices aren't too bad, for the amount of food you get.  The majority of the cooking is done in the open and in front of all the guests so that is kind of different. As far as the staff, they were all pretty friendly and the service is pretty decent.   If you're driving through and don't want to wander off the freeway too far this restaurant might be worth the try if your current craving is for mexican food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tp28ezGClNKkHMZFETmabA"
  },
  "L_o3KkY27-0iBmjnFTwpug": {
    "date": "12/1/2013",
    "text": "So happy to be back at my most favorite restaurant. Such a perfect atmosphere to spend time with family around the best salsa and chips in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V9bwgi-NAVTp8Fi6WKJXAA"
  },
  "-A9FrUHANCKyffnmsC66ew": {
    "date": "10/8/2013",
    "text": "I've been to Fajitas a couple times with my co-workers for lunch. I had chicken fajitas with a margarita. It's the perfect lunch portion. They come with enough sliced chicken, red and green bell peppers for about 3 fajitas.  I recommend adding a side of guacamole to go along with the pico de gallo, cheese and sour cream.  The tortillas are also made fresh however they are a little thicker than your average tortilla.  The staff is extremely friendly and they get your food and check to you very fast which is great if you have to run back to work. The margaritas aren't too potent but they are flavorful.   They have a variety of lunch specials to you to choose from and reasonably priced. My lunch itself was $7.99.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hxo6ymBwymoD3Rs2B9uYXQ"
  },
  "_56QP8VtBoE-iwn3D8XxZg": {
    "date": "9/6/2013",
    "text": "This is THE best place to get fajitas. Their tortillas are made there, one the spot. The salsa tastes so fresh. Any meat you get for the fajitas is always amazing. The service is so good, my family and I are in and out in no time. We live about 45 mins away but still drive here often for dinner. It is a great place to take the kids too! My favorite restaurant in the state.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZqsH2zNSs45jxKdFbfS9bg"
  },
  "IYG0GPhENfUKIszKGCfi3g": {
    "date": "7/17/2019",
    "text": "$39.00 fajitas, absolutely no seasoning and served with a lemon- should be lime?? You must pay extra for rice, guacamole and other items typically free elsewhere.  Food had a smoked, burnt taste.   We couldn't eat it.  Go to the Outback next door instead.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "WCUvDc5-a47jI3HZfyOP9g"
  },
  "rr0i6DBRazhiFt4rXROYBg": {
    "date": "12/6/2018",
    "text": "We've been coming here for years, probably as long as it's been open, but it's not the same quality. Service was good, salsa and chips were nice ! The chips were all broken though. The tortillas were VERY dense- too tough. We shared the shrimp fawuitas like always- but while the grilled flavor was evident, so was an awful stink- my husband thought it was a seasoning! And they switched out the nice med shrimp with salad shrimps....won't be back",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QIL9Zq1rpiUhhJqghPz1rA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QIL9Zq1rpiUhhJqghPz1rA/o.jpg"
      },
      {
        "img_id": "pJCJUYELPZBc-5r38wkDIg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pJCJUYELPZBc-5r38wkDIg/o.jpg"
      }
    ],
    "user_id": "6-T_8BupuTl1M3O_XGHwbQ"
  },
  "dCKzkDkdwsKRZs0oDRlwww": {
    "date": "6/7/2019",
    "text": "I haven't been since I moved away, but, my Husband and I always went to Fajitas to celebrate EVERYTHING!! He loved the fajitas, and I loved the tortillas!! The grilled squash was an added bonus. I can't wait to go back 'home' and celebrate being 'at Fajitas'!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g28hHfIi_97frenD_kqrgA"
  },
  "Le5jXoskqqqFZcSOV3naVw": {
    "date": "1/11/2019",
    "text": "Delicious food. I had the seafood enchiladas and hubby had the seafood dilla. Both cooked great.  Service was excellent and attentive. Prices were very reasonable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uX54-z8pmy7yn2Mqf0tAGQ"
  },
  "6klYmDk0F6V5n9xcmEAJrg": {
    "date": "8/7/2017",
    "text": "Disappointing   For a restaurant specializing in Fajitas, I expected better.  We stopped into Fajita's for lunch and we were  seated immediately. Our server took our drink order and a hot basket of chips and salsa were brought to our table as we looked at our menus.  The chips and salsa were not the best. I like salty chips and spicy salsa. These had neither.  In fact the salsa tasted just like crushed tomatoes poured directly from a can.  For the main course, my lunch companion and I ordered the lunch portion steak fajitas. The fresh made flour tortilla were okay as was the steak.  The skillet was a large bed of onions (which quickly burned) and 2 slices of pepper, one red and one green.   I would have hoped for more peppers and a little more steak. I am used to the Fajitas I get at my favorite Mexican restaurant.  Which are loaded with green peppers, red peppers, onion, and tomato along with cheese.  At Fajitas, most of the fajita plate is onions.They bring a separate cup with cheese, salsa, and sour creme.  To enter a positive note the wait staff are helpful, friendly, and accommodating. However, the food, slightly below average.",
    "rating": 2,
    "rated": {
      "funny": 6,
      "useful": 10,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "JF83j-N9V5aPSTaZEyTg_w",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JF83j-N9V5aPSTaZEyTg_w/o.jpg"
      },
      {
        "img_id": "VQF_9JzxoexfBpwDrGBqkA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VQF_9JzxoexfBpwDrGBqkA/o.jpg"
      },
      {
        "img_id": "S2nriv1hknERVvr8-nCgng",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S2nriv1hknERVvr8-nCgng/o.jpg"
      }
    ],
    "user_id": "MMf0LhEk5tGa1LvN7zcDnA"
  },
  "HIWKUqyEIuGMqrEl_4agsA": {
    "date": "3/9/2018",
    "text": "What can I say? I don't live around this part of town but I love taking the time to drive and enjoy the food here on date nights.   Service is consistently great. Sodas filled promptly and conversation when needed. I always order the half pound of Cadillac beef fajitas and the portions given are great for two people with left overs to spare (maybe that's just us).   Don't expect it to be quiet on a weekend or Friday night but when you have good food and company. All is well, am I right?",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Jo-GXuGr2jNVJuQFJmT1HQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Cadillac Fajitas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Jo-GXuGr2jNVJuQFJmT1HQ/o.jpg"
      }
    ],
    "user_id": "BmoZfFMm67IZh9-_Qf8C6A"
  },
  "m3AGj34CYFBCpihUJFRBcg": {
    "date": "2/4/2018",
    "text": "I think this restaurant is all about nostalgia for people that grew up in Phoenix. I know my coworkers love it and go for birthdays and anniversaries. My husband and I are not natives. Unfortunately I think nostalgia can only get you so far when there are 50,000 restaurants in Phoenix.  We got a gift certificate to fajitas and gave it a shot. It is thirty years old and looks thirty years old. We felt like it was 1992 when we walked in and it was calling for its restaurant to come back. The fajitas are decent. We got a pound of chicken fajitas. The prices are high for what you get. The chicken was decent but they were skimpy on sour cream, cheese and Pico. The tortillas are a little too thick and greasy.   We went at 5:45 on a Saturday night and not half the tables were full.   I will say the highlight of our trip was our server. She was very attentive and caring.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "3D2KdvX-Ppe2cy6zz1WiRA"
  },
  "6ndEzmPLOT64kbpqlSnvEA": {
    "date": "4/16/2019",
    "text": "These are the best fajitas EVER! We always get the Cadillac Fajitas and they are amazing! They are pricey but worth it. The tortillas are homemade, so they are the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ieE2Hwx-0Q6c-2VCI7FLg"
  },
  "C3ESeOtJ9gOS-szf3sESnA": {
    "date": "12/7/2018",
    "text": "My first time here and I am completely satisfied. Service was excellent, food was amazing, and management was great. The good portions are big man size which is what I like being a weightlifter lol. I had the  1/2 order Cadillac Fajitas and wifey had the 1/2 order Fajita Nachos, both of us could not finish the plates. Everything was made fresh from the tortillas to the meat and veggies. I definitely got my money worth. Definitely will be back next time I'm in Phoenix!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TYxTgqP0tSuU4YDbzwq9ZA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Cadillac fajitas yum yum",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TYxTgqP0tSuU4YDbzwq9ZA/o.jpg"
      }
    ],
    "user_id": "fGAPoLyIvZgwJpgY8EeNYg"
  },
  "iM5uygX8mbyBaboH5Pg88A": {
    "date": "2/23/2019",
    "text": "good customer service... terrible salsa and food. i do not recommend. if you enjoy your taste buds. plus my burrito fell apart on me after the first bite.... wth?! y'all should come taste californian mexican food.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dPicnPvFxBsXVKCgT7MM3A"
  },
  "H0L5SPKfQvcyfX8mw5DZtg": {
    "date": "7/2/2019",
    "text": "Been going to Fajitas for decades.  I cannot stress this enough...TexMex is not Sonoran Mexican food.  Those who review that its bland or not like Mexican food places are likely missing that they full on explain on menu that they are the fire cooked meat of cattle ranchers.  So with that in mind, they have the best TexMex fajitas I've ever had.  The house made tortillas are the key to the meal, but if you eat too many you will feel like you will explode.  Fresh style salsa, thin chips.  Chicken fajitas are always delish, but if you go with beef, I'd ask for medium because it will continue to cook on the griddle they bring it on.  It comes on grilled onions, but you can ask for caramelized.  You can customize the condiment boat, I always ask for no cabbage base and guac instead of pico - cuz the salsa is better than pico IMO.  I love the open atmosphere, its very chill and good for a big group.  Lunch portions are meant for nearby office works having a quick meal, if you are truly hungry go for the real portions.  Its better as a group because of portion sizes and priced accordingly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VBD0kr2y5kkBBjSPgfyxVg"
  },
  "MdUTvmlQRE74TKOwFyn5vg": {
    "date": "2/8/2019",
    "text": "Ugh. I struggle giving 2 stars. No flavor. Seriously overpriced. 3.25 for a teeny tiny iced tea. Old building that needs serious help. It's clearly been more years than I thought id been here. There's no way a small bland lunch for 2 ppl should cost $57. I sense will be out of business soon without an overhaul. Sad.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fLABXkYpwbHZDJKAWe4Mhw"
  },
  "oWivqqi1l-uCXLp3pjnQrA": {
    "date": "4/2/2019",
    "text": "Best Fajitas EVER! I love to take people who have never been to Fajitas. I have a huge number of people who have joined me, so far 100% approval.  Best to me are the beef, chicken is a close second.  I am not a seafood person, but I am told by some who are that the shrimp are also awesome.  Don't miss the cheese crisp or ice cream taco.  Literally, nothing I have tried here is bad.  If you get the chance, try them ASAP!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nTuslv90uzIjJZoTgpidCg"
  },
  "KL_Cvz8rl5JM-leM4HmU5Q": {
    "date": "1/4/2019",
    "text": "I've been coming here since the place opened in 1986-consistently the best fajitas in town!  The service is great!  They're attentive and friendly!  The Cadillac fajitas are the best!  They also have great chicken fajitas!  I highly recommend Fajitas!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "10_IM6yURgMMKuYjDOcJNA"
  },
  "UOY71TIumMu2SPLWZnE4xA": {
    "date": "12/24/2018",
    "text": "People love this place and I can see why. Good food, sizzling fajitas, good sized margaritas, and good service.  But man do you pay for that sizzle!  For two margs and two entrees (nachos and a half pound of chicken and half pound of shrimp fajitas) we paid $68! You can find great food, great drinks, and great service for less and that's why I can only give this place 3 stars. Oh and you will smell like fajitas and so will your clothes the rest of the night!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-XXNYOT4fiuH2-TbqfLVLQ"
  },
  "EB_d-84x9ozYE2RyInQaNQ": {
    "date": "10/29/2017",
    "text": "First and foremost, this place was pretty pricy for \"Mexican food\". I could go to a gourmet restaurant with a neater atmosphere and pay $16+ for a plate. However, my significant other and I ended up paying a total of $48... for a pound of meat & chicken, with a side of guacamole. It was ridiculous for the price. The food was not the best. The beans tasted as if they were in a frozen burrito and it was such small portioned. The meat was cooked with basically only salt and pepper. I truly don't believe I will be returning because of the taste, atmosphere and price. Truly disappointing.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-CBGtN1p7XvT14vy0B__yA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-CBGtN1p7XvT14vy0B__yA/o.jpg"
      }
    ],
    "user_id": "VC_DDLfl78P1JRHy9XxVaA"
  },
  "dMi0cR0ipNt2gIptjkWC_g": {
    "date": "12/21/2017",
    "text": "How can you rate a Mexican or TexMex in this case ...... Did no research prior just saw the restaurant, carpark was busy - a good sign! Friendly and nice service, had my staple Chicken Fajitas! Very nicely done and good quality ingredients. A very nice lunch indeed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CO_Skd-m3qgFKHk7FUtIDA"
  },
  "C9T-7vS2sSRzAAHsGL_6vw": {
    "date": "4/16/2018",
    "text": "I would be fair and say 3.5 for the service, we had a relatively large party and they worked as a team to make sure everything was satisfactory with the exception of one (more on that later) Decor? It looks like your trapped in a Mexican chain restaurant from 1992, I.E. bright tiles, half walls with brass trim (I actually like that though it brings me back to childhood) granted I've never been there before. Chips arrived right away and they were good and they made sure we had plenty baskets of them. I was seated at the end with my partner and one of our servers came up to us and asked me \"if I know what everyone was having OR should she go down there\" meaning to the other people at the table.  I paused and my partner and I starred at each other I thought it was a joke but we just got into a staring match finally I nicely said \"I have no idea what the other 10 people at the table are having, I can't even hear them at the other end\".  She quickly left to get reinforcements and we saw less of her after that.  She was nice and meant well I am sure but was I suppose to stand up clink my glass and announce everyone please text me your order! Shrimp in the shrimp fajitas was actually very good and well seasoned, I was splitting a order and I felt they needed to have slightly less onions and a few more peppers we had to ration I think 2 peppers (one red, one green) I appreciate their homemade tortillas BUT in my opinion they are VERY thick so the majority of what you are tasting is tortilla, I tore mine in bite sized pieces it was much better making little finger sandwiches.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "p91W2jjtwqcWj8rpdFtAiw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Retro",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p91W2jjtwqcWj8rpdFtAiw/o.jpg"
      },
      {
        "img_id": "96XfGVBkVqcmj_sRbavQCw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Shrimp Fajitas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/96XfGVBkVqcmj_sRbavQCw/o.jpg"
      },
      {
        "img_id": "AtZBK8KYvZ6FDsBu5NoRXw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Tortillas (very thick)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AtZBK8KYvZ6FDsBu5NoRXw/o.jpg"
      }
    ],
    "user_id": "IZnsvdPqU_LWTy4yfgiX4A"
  },
  "fOhD4kFrf0qRw8mLNnlAvQ": {
    "date": "10/17/2018",
    "text": "I have frequented this restaurant for decades.  They consistently provided good fajitas and their chips with salsa are great!  However, the rest of their menu is a little blah and their prices tend to be a little ridiculous.  The atmosphere is run-down and a little dirty.  And now, they will nickel-and-dime you with every order.    During my last visit (and it will be my last visit), we ordered $70 in fajitas and were subsequently charged a premium when we requested more fajita toppings.  It seems odd that a restaurant would charge $25+/head for a meal and then charge $5 for 2 oz. of cheese to complete the meal.  I get the impression that this place is struggling and has lost interest in making sure that their customers leave happy.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "eeKbN0TEW6D6mPR-LxZxyQ"
  },
  "ypNztMDCXOEbrgM3O6h8Hg": {
    "date": "7/21/2018",
    "text": "My favorite fajita place!   I've been coming here since it opened 30 yrs ago.  The quality and taste of the food is ALWAYS consistently good!!   Fast and friendly service and awesome atmosphere.   I definitely recommend this place.   A+++!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x4Inm5Tp-XcZbMjQWi9kqg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x4Inm5Tp-XcZbMjQWi9kqg/o.jpg"
      },
      {
        "img_id": "NY0ZkRx-QZRzdcGz0aPxHQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NY0ZkRx-QZRzdcGz0aPxHQ/o.jpg"
      },
      {
        "img_id": "S2b5pf7BMbaftsrvnDT-eg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S2b5pf7BMbaftsrvnDT-eg/o.jpg"
      }
    ],
    "user_id": "CVVz6X39OfPyfzs3LOhg-Q"
  },
  "i3sIkfRYVY0d6TsX0KcPQQ": {
    "date": "2/9/2014",
    "text": "Nice place not great. Salsa was weak packed absolutely no punch. Shared a 1lb plate with steak and chicken steak was good chicken was while not dry wasn't really seasoned at all, meat is supposed to be mesquite grilled but couldn't detect any in any if the meats. Sever was good but seemed to be going through the motions as a veteran server, no extra attention or unnecessary distractions. Probably not return unless in the area will get steak not chicken.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "K9ZIRX2ZAu_8xfyxvui1Bg"
  },
  "M-54aDSReCFBaAP97tnnhA": {
    "date": "6/16/2015",
    "text": "I've been coming here for nearly 20 years. Never had a bad experience. The food is so good and it's my favorite place to celebrate my birthday. Love LOVE LOVE this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JfGZW1FuHoisfpcZdQC4KQ"
  },
  "Km1-afmIw5TuEKKIq_zHWg": {
    "date": "8/5/2014",
    "text": "Oh my gosh these fajitas are to die for.   The tortillas are hand made, hot and fresh.  I love the veggie fajitas -- they come heaped on a sizzling pan - peppers, onions, black olives, all caramelized and topped with seasoned grilled zucchini. The onions and peppers are WAY better even than the ones you get with the meat veggies, so everyone always steals mine. But there's plenty! Tell them you're vegan and they sub guacamole for the cheese and sour cream on the condiment dish, free of charge. I love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mng_kGqPstQqkjAG4gg5jg"
  },
  "tbSPde-2jA7mAI241TJrQw": {
    "date": "3/9/2013",
    "text": "I love Fajitas! I moved from Arizona to Maryland 6 years ago and still come back at least twice a year, Fajitas is my first stop from the airport every time! I cannot get enough of the chips and salsa. My favorite Fajitas are the Shrimp or the Veggie, great value for sharing a meal. The margaritas are amazing, I have had everyone.  My favorite thing about Fajitas is that it looks exactly the same as the first time I went there 25 years ago, when it was brand new and built from the ground up just for Fajitas, this is the only location not a chain. It is always clean, it's great that it has not been totally remodeled to look like every other restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V1lSofAmoqlVqCdLVlpdfQ"
  },
  "J5zRjjxguSBxhQv1-mi9qg": {
    "date": "3/30/2014",
    "text": "Horrible service and food. Worst beef Enchilada I have ever had, even I know Mexican Rice doesn't have peas and corn in it, and margarita tasted like it was poured from a can. This is not considered real Mexican restaurant in my eyes. Was definitely a waste of money!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y61lw9SN6THJNCEL5nnhhg"
  },
  "GTZZjnKwRIU0ggtpf1O9Ow": {
    "date": "7/9/2016",
    "text": "My favorite restaurant! Great food, service, and atmosphere! I go every chance I get. It has been a family favorite for many years.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MczYi9BM8IoxvkAiAE8myg"
  },
  "q3IdI-GgDih5PDQzXrTy8A": {
    "date": "5/21/2012",
    "text": "I love Fajitas.  Have since I started going there as a kid.  Would I recommend anything other than the fajitas?  No, not really.  Its a bit pricey for me to be going very often, its special occasion priced for my budget.   You get a skillet of piping hot meat and onions.  You get a side dish of pico, cheese and sour cream.  For people who like flour tortillas, this is HEAVEN.  they are homemade, thick, puffy, my mom eats them all by themselves and is more than happy.  I like to supplement with a side of beans and guacamole.  When less pregnant, well, much less pregnant I really like their margaritas too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jICqeubo9NKVYcZG2EhTbw"
  },
  "EJynMWPOOxxH9miDvzuXQw": {
    "date": "9/24/2014",
    "text": "I've been coming to fajitas since I was a kid. Food and service have consistently been great. My whole family loves coming here. We always get the fajitas. I love the veggie fajitas, husband prefers pork, but everything we've had has been good. Can't get enough of their salsa!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rtRp44zgds0Fn9W96afCjQ"
  },
  "cWTaqs7SQpGnXRIDyCaaZw": {
    "date": "11/14/2014",
    "text": "Better than expected.. Good service, reasonable prices.. Awesome Nacho's, good Taco salad, sat at the bar.. It was fun watching them make the food..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YYkCDm_kMDkHlcXooUp5jw"
  },
  "gF_4nk6BCkI4p-9pYVkVHg": {
    "date": "7/13/2014",
    "text": "Chips, mexican pizza and of course fajitas are great.  Your clothes will definitely smell like fajitas for the rest of the day.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6AMwQ8cFWIKGbGpVwehkfw"
  },
  "-EqetLc9xU_grFNotYglzA": {
    "date": "5/10/2012",
    "text": "Great homemade tortillas (nice and thick) The service is good The food is good.  Losing a star because they're priced a little high, but if you go family-style and share the whole-pound fajita plate(s) it eases the sticker shock a smidge.   Also, try the pork fajitas, they're much better than the chicken.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVRpLwPfgRaU6sllAHpnAw"
  },
  "HaxuBU2Hhs3QRVjESjoqzg": {
    "date": "10/24/2014",
    "text": "Food is fresh.  Sat a bar staff very friendly.  Food delicious.  Had the enchilada Guadalajara. .Awesome",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5KbrCQ9UPmoJxMQJCUvKg"
  },
  "80F-ogG9Y1OsonaVhExZ_w": {
    "date": "5/24/2011",
    "text": "Wow, this place misses, by a loooooong shot.  Food wise, this place should be rated zero stars, but the server was SO nice and did such a great job, I had to bump it up. If I could rate service alone, I would give this place four stars.  Here's the breakdown.  I've been here probably over a dozen times over ten years, and it's pretty much always the same. Ambiance is ok, clean but dated. As others have mentioned, the only thing to order here is fajitas, and I did, preceded by a cheese crisp appetizer, which I read was great on Yelp.  In short, the simplest stuff at Fajitas is the problem. Their 'salsa' is literally tomato paste and maybe some powdered garlic? It is truly bland and tasteless, remarkably so. It's almost like jr. high cafeteria lady dropouts are making the salsa, it is just a train wreck. I asked our server if they had a hotter (read: flavorful) salsa, and he brought over some hot sauce.  The fajitas arrived and they were fair. Portions were good and tortillas were fresh-ish. For some reason the fajitas arrived with raw onions and a trace amount of bell peppers. Maybe i'm doing it wrong, but I was accustomed to grilled onions and peppers- and this wasn't that.  The service was the shining star at this spot. Our server was awesome, very attentive and kind, without being annoying. I took my nephew and nieces out to dinner, and there were tons of extra requests, and the server (Mike?) was just really great- so much so that I tipped 30% and let the manager on duty know they had a rock star working there.  If this place could just put some effort into the salsa, and a bit more attention to detail, it could be great, but for now I recommend you skip it, and hit up a Mom & Pop spot.",
    "rating": 2,
    "rated": {
      "funny": 6,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "WJKocp9RE0KatUwh3_DkGg"
  },
  "xfXlojEUAFX5XBqfCkn8tw": {
    "date": "8/9/2014",
    "text": "The fajitas are always good, but the place seriously need a renovation.. It still looks the same from when I was kid.. LOL .. They also need more beers on tap cuz this 3 beer selection just doesn't cut it. Other than that I would recommended this place to anyone anytime.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bfkaY3bXPWkescqFQHpEpQ"
  },
  "ny8w3IlC4dP5zshrEaKQUQ": {
    "date": "11/11/2015",
    "text": "The best fajitas I've had in the Phoenix area are at Rosa's in Mesa.  At Fajitas we had fajitas and enchiladas.  The fajitas were poor, funky flavor to the meat, overly thick tortillas like pita bread, and terribly overpriced.  The enchiladas were pretty good and much cheaper, the re-fried beans were excellent, and the apple pie desert was outstanding, although very expensive.  The service was excellent.  If we return, we won't have fajitas at Fajitas.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "e9M8j946RrjyT-Zz8vG-rg"
  },
  "WkLhXEM8ZNA5SHf6awvWig": {
    "date": "10/4/2014",
    "text": "The best salsa and chips as well as grilled zucchini. Their homemade tortillas are amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DQ5BrML8q37UaA4uicyB8g"
  },
  "WW7uV9oFzcgdJKxN5ZNrrg": {
    "date": "5/28/2013",
    "text": "I might need to try this place again to see if my order just got messed up. I ordered a vegetarian fajita to go. The guac was good and fresh. There were no tortillas and no beans so I had to buy a bag of peanuts after I ate this since I was still hungry. I do not eat a lot at one time as well. Aren't veggie fajitas supposed to come with beans?",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "07P1uILTvA5cC6cOWYTApA"
  },
  "Vwvhs6UEw-EE7_c31QylSg": {
    "date": "4/21/2011",
    "text": "The queso is ridiculously good... seriously. And the homemade tortillas are also outstanding.  Aside from that, everything is average at best. As mentioned by others, this is Americanized Mexican cuisine. This is not autentica comida Mexicana, mi amigos!  We had been once before and thoroughly enjoyed the food. Hence making it a point to visit again on our most recent trip to Arizona.  We started with the chips and salsa set for the table - delicious. I ordered a bunch of queso for the table, and I started with a Tortilla Soup. It was hilariously underwhelming. I made the joke that it was kitchen scraps, and it looked the part. It was light tomato broth with a bunch of vegetables, a gob of cheese and a small corn on the cob on top. Yes, a small corn on the cob is on top. It was lousy and I wouldn't recommend it.  We ordered a pound of chicken fajitas and a half pound of vegetable ones (thanks to the vegetarian fiancee). It went surprisingly far for five of us... but the veggies weren't grilled much, which is sad because they were otherwise delicious. Also, the chicken fajitas only had one piece of green pepper and one of red on top. It should be lush with peppers and onions that have been grilled or possibly even caramelized (the onions).  Daniel E. wrote in his review the same concern, that there should be \"more than a pile of onions,\" that he expected at least some green, red or yellow peppers. The fajitas were good and quite filling. The accompaniments were decent - cheese, lettuce, sour cream and the like. Nothing fancy, certainly no frills.  So much potential, but it fails on almost everything. It's a True shame. This place needs to be on Restaurant Impossible with Robert Irvine... badly...  This time around... the service was really lousy. And my fiancee found a bug deep down in her water. Very disappointing. The waitress first replied confirming what size bug it was, and then explained it and claimed that \"we're not dirty, it's just the food smell.\" Then she apologized and walked away. We think she deducted a soda from the final bill... but nothing else. A bug!  And the entry foyer smelled like a high school locker room... it was foul on the way in and out.  Sad to say that we may likely not return in the future. I'm not sure if our family and friends in the greater Phoenix area will either after the bug incident.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "FgnLdCE3q0MqIWgnAH3xtw"
  },
  "DrzguckT63MPp7vzH4FBZg": {
    "date": "5/16/2016",
    "text": "Amazing...had the shrimp & cadillac fajitas plate. The shrimp & steak were seasoned & cooked perfectly, tortillas & veggies were fresh. Danny was our waiter, and he really made our meal awesome. He recommended we try the apple pie for dessert...incredible! Definitely a must if you like fajitas! Btw, the mango margarita was very good also.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fRVRZWDppP9gsPf8oaf6Lg"
  },
  "AqDEc0O-32VbEZ-hxIfrqg": {
    "date": "1/21/2012",
    "text": "I grew up going to Fajitas about twice a month and am still a big fan.  The food and service are amazing.    There is no reason to get anything but fajitas at this spot.  We love the chicken and the Cadillac beef the best.  They tortillas are amazing.. They make them right there and are the best in town. The service is always great and this is a good spot for large groups as well.  The only reason I gave them 4 stars vs 5 stars is because they need to update the dining room and restrooms.  The place is always clean, but the restrooms are in real need of a major renovation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GJ7PTY7huYORFKKg3db3Gw"
  },
  "X01z7fkReCacklckZvk4yQ": {
    "date": "9/17/2019",
    "text": "Jordan was AMAZING. He made our entire family feel like cobb salads. I knew the fajitas restaurant was extremely environmentally conscious when Jordan brought 8 glasses of lemon water to our table without a straw in sight. At that moment, I realized this restaurant was not only a great place to hang with the family and fill your tummy, but also a spot where you could really make a difference in the lives of a few turtles.   The red polo that fit juuust right around our turtle-savior's lush biceps and the tight buttocks that accompanied them were only icing on the cake. The real treat was knowing that a turtle would not choke on a discarded bendy straw because of the carelessness of a a minimum-wage employee and a barbaric straw-consuming family. I slept well that night dreaming of all the things a baby turtle could accomplish because of one man's willingness to stand up to greedy corporations who shamelessly push for straw use in our homes and places of eatery.  the food was also good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r3mi3Bs8kf43UPFForCrwg"
  },
  "KE2MLHYp8Gs631ULRxxXtg": {
    "date": "8/30/2019",
    "text": "We were here on a Friday night. There was no rush, but the service sucked big time. Just to get water to our table it took so long. We ordered Veggie Fajita's, Chicken Enchiladas and Mixed Grill Veggies. The food tasted okay, nothing great, not the best Mexican food in town. For the price, I think there are much better options out there especially in the Phoenix area.  Definitely a pass!!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fn7gU92_4FWDMcZZMgXN_w"
  },
  "SXSHgFYNGKy5w35ZKVkw5g": {
    "date": "6/18/2019",
    "text": "Came in last night on 6/17/19 to order a pound of chicken fajitas for takeout. The girl customer service that takes orders is not listening to your order I pacifically asked for no pico de Mayo and substitute with guacamole. The bartender asked me the same question so that means you get cheese and sour cream with your order also. So I told him no pico de mayo and substituted with guacamole plus sour cream and cheese. I get to work and I open up the container and it's all guacamole. Nothing pisses you off more than people that don't listen to what you order and you get to your destination and get ready to eat and you don't have what you asked for... And this is the second time the bartender had screwed up my order I had dang it in a couple months earlier and he still screws up my order back then. I called the manager last night she reassured me that the manager would call me today to the try to rectify this.... It's already noon the next following day and the manager still hasn't called. Very piss poor customer service down there employees are not listening to what you order I do not recommend this place anymore. I spend $42 also and all I made was 4 chicken fajitas out of one pound of chicken fajitas.... so that's $10 a fajita. I don't even want to give this place one star ,I highly recommend not eating here anymore......",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ajM2dL4e37MN-LpO4z3zLQ"
  },
  "QHAc78jc9JilzMIbEX467A": {
    "date": "3/27/2019",
    "text": "This place is large, clean and full of activity. The staff is quick and attentive, and the portions are enough to share. Sound like it should have been a great experience overall.  We ordered fajitas to share since the place is called Fajitas and I figured they would be amazing. They were so much less than amazing.   Everything was prepared well, and as advertised portions are definitely shareable, but there was a pervasive blandness to the chicken, beans, soup, everything. It was as if they prepared everything with good ingredients, good prep and cooking skills, and the added absolutely NO seasonings of any sort. Completely bland, plain, and not something that I would intentionally drive to and pay for again.   Other folks seemed to be enjoying their meals so feel free to give it a try and judge for yourself. As for me I will not be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ku6yX1uq0yroRY7viPlGFQ"
  },
  "K3iuIM64zmUnB0Kuabk57g": {
    "date": "6/8/2019",
    "text": "I really like this place, food is good always fresh and service is great. Always get the steak fajitas with all the fixings. It comes with homemade tortillas that are are so good   Everything is served family style so great place to have fun with family for good friends. Enjoy",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "1RqrUWd4Cy9Ejjtp4b7Kmw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1RqrUWd4Cy9Ejjtp4b7Kmw/o.jpg"
      },
      {
        "img_id": "FbPopYgFIIMM2mvQRuQynw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FbPopYgFIIMM2mvQRuQynw/o.jpg"
      },
      {
        "img_id": "EMaQPmqVWP1Rsk6Ps7sUuQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EMaQPmqVWP1Rsk6Ps7sUuQ/o.jpg"
      }
    ],
    "user_id": "XmvKKMAkSwyhB9F_C1Ze-Q"
  },
  "maBTf0x-6ZWBw_3Hq1w3tA": {
    "date": "6/27/2019",
    "text": "A good place for some chips and good Mexican food...we headed off to this place after a stressful day ..the person at the bar took our order and we had chips and some sauce...perhaps it's called salsa dip and some Mexican food ...appealing to eyes and tummy ...price is good ..we were a group of four ..quantity was sufficient ...seating and ambience 4.5 star and will surely come back again for some more food ..they have happy hour menu as well but no take out facility by Uber eats .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4xsOMIm8f8O5Wo8TBzuKAw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4xsOMIm8f8O5Wo8TBzuKAw/o.jpg"
      },
      {
        "img_id": "_Fg2y7bU8I-GQV23hk1f0Q",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. The menu special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_Fg2y7bU8I-GQV23hk1f0Q/o.jpg"
      },
      {
        "img_id": "UmFUYFfw2iLa_v1wcDq0uw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UmFUYFfw2iLa_v1wcDq0uw/o.jpg"
      }
    ],
    "user_id": "LxNrHhC_4SljB2tGn9pK7Q"
  },
  "A_os7t5RawASWbEFuGpY1Q": {
    "date": "2/25/2019",
    "text": "The name says it all: FAJITAS! These guys make the best fajitas and tortillas on the planet! I have been going to Fajitas since the start (31 years!) and my most recent visit  was exactly what I love.   On a Saturday night, there was a small wait. The smells overwhelmed my stomach and it growled. LOL   My friend and I were greeted by our server with hot tortilla chips and house made salsa. We ordered flavored margaritas, a pound of fajitas (half shrimp, half Cadillac) and a side of guacamole. Tip: ask for the onions and peppers to be sauteed instead of raw ;)  Everything was perfectly cooked, smelled heavenly and filled our bellies! I can't wait to visit Phoenix again and have some Fajitas",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mzF_TJVRluuhN0keREoNMw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Shrimp and Cadillac steak fajitas (in terrible light)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mzF_TJVRluuhN0keREoNMw/o.jpg"
      }
    ],
    "user_id": "CfNDfU-gWMBEOZHxdSdybw"
  },
  "ykWqa1RHBz-JvYq1TKMjOw": {
    "date": "8/9/2019",
    "text": "I was no impressed everything was only ok nothing was great,  the prices do not justify the meal served,  better to go one business down for a good meal",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "SJMPACSDqY0LbMIr_NEiTQ"
  },
  "byVIZdyOF56euGcCTuVkUQ": {
    "date": "8/23/2019",
    "text": "This was not MY choice for a Saturday lunch with friends but I ended up pleasantly surprised. The fajitas are served family-style in 1 pound or half-pound orders. Our server informed us they only had full pound orders that day, and since we can't agree on anything to begin with, this didn't pose a problem. Our waiter was patient, helpful and a great salesman. It was clear he was passionate about the food he served and offered several suggestions. The chips and salsa were plentiful and gave us something to munch on while we tried to decide on lunch. I ended up with the steak fajitas. They were good--really, really good but I couldn't finish half of them. They made a pretty tasty breakfast the next morning!  The food was fresh and plentiful. The bathroom was clean (I can't help it. I always check!).  have no complaints about the food or service. If I returned, I would make sure those accompanying me agreed on the menu beforehand.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IiPiKOtNxi0HZ16t53C0cQ"
  },
  "Z_QKGLVJ0IJHXVjDzqipEg": {
    "date": "8/11/2019",
    "text": "Chips and salsa were good, but $26.50 for raw onions (mostly), 2 slices of raw bell peppers (1 green 1 red, and 10 small slices of ground beef like meat (it was not steak) I ordered STEAK and $3.25 for an iced tea. Definitely was NOT worth it. I was VERY disappointed.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hIvqyXGp9bs9s2Pu-Ek-4A"
  },
  "po22MCmk4e_NqbVtzmwutw": {
    "date": "9/16/2019",
    "text": "I just picked up a half pound of shrimp with grilled onions.  I have been going to your establishment for the past 30 plus years and every time we have made a to go order we have never had to pay for chips and salsa that we would typically get for sitting down in the restaurant. This is the first time I have been unsatisfied with my experience with fajitas a sizzlin celebration.  I understand your probably going to give me a response that you have to charge for chips and salsa on to go orders but that's not the case if I am not paying for them for dining in the establishment.  I also will always tip whomever is serving me even on to go orders but the way that the bar tender attitude was so condescending about the situation I felt it necessary not to tip and after he had asked me if I need plates and utensils I stated yes and he still ignored the statement and I never received them.  this was a horrible dining experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CJvPVcWBcKLPJsBtjrAy6Q"
  },
  "YiApuQRk2EMWHn3OZE6m0w": {
    "date": "5/26/2018",
    "text": "This is an oldie but a goodie!! Homemade tortillas and fresh variety of meats. Definitely would recommend fajitas since that's what they are known for. Our experience was a good one. Recommendation is to order half orders so you don't over order it's a lot of food and you fill up on chips and salsa before your meal arrives so enjoy!  Happy Eats!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LOOTxNhHJott6jZ8yZTMeQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Fajitas a sizzling Celebration",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LOOTxNhHJott6jZ8yZTMeQ/o.jpg"
      }
    ],
    "user_id": "RYa1fWYn7B_bz_HGNXlvsQ"
  },
  "SCIQwOU28Bb02LoyUoYcZw": {
    "date": "5/13/2019",
    "text": "Bradley B was such a great server! He made sure my Mother's Day lunch was perfect! And also was super patient with our 2 children at the table! Food was excellent as well- Thanks again Bradley B! -The Krause Family",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tsCvXrW3YH2j4TWfaGcrXA"
  },
  "Xuh73uqDa2D-woND2aCO6g": {
    "date": "7/31/2018",
    "text": "We came here as a large group and they were able to accommodate us without a problem.  Food:  Nice selection, but quality of meat could have been better.  Service: Given the large group, I am going to excuse some of the delays in getting refills and follow up drink orders.  Several of the dishes that came out were slightly off from what was ordered and the sides for some of the orders were plain wrong.  That said, the staff was quick to remedy the issues and everyone got what they wanted in the end.  Overall: I am a fan of some of the other places in the surrounding areas, so most likely will not be coming back; but if you are in the area, there is nothing wrong with giving them a shot.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_0L4WNYQ6f6y6pMYzJ3b9Q"
  },
  "lGS7CYLIxILN-9MMNqt2kQ": {
    "date": "8/8/2019",
    "text": "This used to be our favorite place to eat! A must have every time we are in Phoenix! To our surprise today we stopped prices were raised. The fajitas we love went up $6.00! The side of beans went up $1.50!! Then to top it off the food wasn't as good as it normally is either!! We were just there 3 weeks ago.... definitely not the same... will be looking for another favorite place to eat for our trips to Phoenix!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "o675wgYSEiEOlWi5aApRpA"
  },
  "e0EmyNGMoeR55E2k2BwMww": {
    "date": "2/2/2019",
    "text": "Started going to this restaurant back in the mid '90s  Food is consistent, however the restaurant is dated. It's time Fajitas invest in a remodel and freshen up the establishment.  Restrooms are gross!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CV3RXeIMsKLd52C1Q_a1hw"
  },
  "k6BX20ARmk4xiw4A8pCRCg": {
    "date": "6/19/2019",
    "text": "Tortilla heaven!!!  These are like the tortillas I had back in San Antonio.  Homemade and you can tell right away.  As others have stated, get the Cadillac fajitas. They are perfect!  No extra fat and they are always cooked with such flavor that I drive from Chandler to eat here.  The only knock is that this place is a little bit pricey, but even with it being slightly overpriced, the wife and I love coming here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F76i3Syqc_jTR2m2vXGwuQ"
  },
  "Vbd3tlKbE3jFtAoEZG_tMA": {
    "date": "8/23/2018",
    "text": "My wife and I have been coming here since we were kids.  I had my 16th Birthday Family gathering here.  It has been around since the 80's.    They have a great menu and as the name suggests they have fantastic Fajitas!  We have tried them in every fashion and they are all delicious.  Today we got a half pound of chicken with a side of refried beans.  They bring it out in a Sizzlin skillet and you make them yourself.  So Good!  This is the main place my wife and I take out of town visitors.  It is that good.  Some of the waiters there have been there 10+ years.  They are all fantastic, you may have to wait when you come in but it's so worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1u-QQKve8EMseh-5G_uuUQ"
  },
  "oT9Npga81e-ZzXtnL_PqJQ": {
    "date": "11/4/2017",
    "text": "I have been going to Fajitas since I was a child and it's my favorite restaurant!! This is my go to for all birthdays and special occasions. Great place to bring friends and large groups. The service is always incredible! I have had many servers here and everyone is incredibly nice and amazing service with quick refills. Went in today and our server was Eduardo and he was great!   The Margaritas are great. Strawberry margarita is my favorite. Good size and strong!   My husband an I come here all the time! We are those people that don't even open the menu because we know exactly what we want. For an appetizer we get the grilled zucchini which is super good and refreshing. For the entree we split a half pound of Cadillac Fajitas which is perfect for the two of us. The steak is juicy, tender, and flavorful. They make the tortillas homemade to order and they are to die for!!! The sizzling apple pie is delicious if you have a sweet tooth.   A few tips/tricks: - can order steak medium rare since it cooks more on skillet - ask for both pepper and onions extra caramelized - can replace an item on boat with guacamole for no extra charge - we get no cabbage on boat since it's no use to us. We want more of the goods! Haha you can replace it with shredded lettuce though if you like that.  Highly recommend to come here and must get the Fajitas!!! We will be back again real soon. Thank you fajitas for more then 20years of pure food bliss!",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 13,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "9n9oDYCfMc4Zfyt0h_gK_Q",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9n9oDYCfMc4Zfyt0h_gK_Q/o.jpg"
      },
      {
        "img_id": "KikH_XvuXNJpdzAsggJ6ng",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Half pound Cadillac Fajitas. Amazing and awesome for 2 to split.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KikH_XvuXNJpdzAsggJ6ng/o.jpg"
      },
      {
        "img_id": "UVs88BmfmRRfNqtRwFHqfA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Grilled Zucchini to start. So good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UVs88BmfmRRfNqtRwFHqfA/o.jpg"
      }
    ],
    "user_id": "MQwSyZ2MZ6N7rtAmphZCow"
  },
  "jbY8VTBTcvXRwwdlDQWRFw": {
    "date": "3/1/2019",
    "text": "Veggie fajitas are either a hit or a miss for me. This was a hit.  Wandered in here on a recommendation from a friend and left satisfied. Service was a bit slow, but I think the our waitress was new.  We shared the 1lb veggie fajitas & it was more than enough for the next morning! Unlimited chips & salsa foe the table. It was surprisingly empty for a friday night - but I'd come back for the authenticity of the experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aO3FliMoArz8aGtIIsuaAQ"
  },
  "UlzbGGdT5kKeU1Dbdl_VMg": {
    "date": "12/31/2014",
    "text": "Went this evening. Unremarkable. Weak margaritas, fajitas had chicken and beef, a bit of onions and one slice of green pepper and one slice of red pepper. This all cost $50. Service was good. Note no handrail on entrance stairs dangerous when wet. Won't go back and won't recommend.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "1-1D9AVQa_jGeVPWCuZ1tw"
  },
  "oSga4T0kiP9vRtlUTzLPXQ": {
    "date": "6/4/2013",
    "text": "To have the ability to accommodate a 35 person reservation on a Friday evening is to go above and beyond in their ability to provide good service. We had 2 servers who worked VERY hard to keep our drinks full. Our food was served hot, on time, and the could not have been better.   Our fajitas were DELISH--to the point where all of our first timers in the group said they will DEFINITELY be back.    Thank you Fajitas for going above and beyond!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gVmUR8rqUFdbSeZbsg6z_w"
  },
  "8mG5-zlPc0uqiLF8n47b9g": {
    "date": "11/28/2014",
    "text": "I found this a little on the pricey side. We ordered the Cadillac Fajitas for two of us. There were like 6 small slices of meat. I mean, it was enough to feed us, but the price of $21.95 was very high for this amount of food, in my opinion. Waiter got our order wrong and when we brought it to his attention, he said it would be another 20 minutes or so to fix it, so we just ate what we had. Also, the waiter let us run out of water and once we had paid our check, never filled our water glasses again. We were on an extended dinner visit with friends we had not seen in a long time. I can understand not filling our water glasses if the place was crowded and they needed the table, but there were two other parties in the entire restaurant. We ran out or water, so we ate our ice, but when we ran out of ice, we had to leave. The only reason I gave it three stars is that the food was really, really delicious.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Vwwp4QxVhmP7uNJz4pdkDA"
  },
  "Vak2kkNNcohK9Ape6m6zoQ": {
    "date": "4/22/2015",
    "text": "Another on bites the dust.  Visited Fajitas again and was very disappointed.  They have switched to small shrimp like you would find at El Torito.  They used to use huge shrimp.  I think they changed the seasoning also, just wasn't the same and the portion seems to also be smaller.  Not sure if I will return, I'm heartbroken!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "u4BHxiH2fBlH6bRJxDl8Xw"
  },
  "MWPD4XezS4Ky0UwFbPLRQg": {
    "date": "2/27/2016",
    "text": "This place is awesome been going here since they opened in the 80'.always get chicken or Cadillac fajitas and loads of salsa with all the chips. Son and i went tonight the food never lets you down. Servers are plain and just work nothing special about them..just get my food fast..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJNZWQmvg47kO56s04s3dA"
  },
  "oScI2OdvuGOV25Yy81xKfQ": {
    "date": "1/13/2016",
    "text": "My family and I frequent this restaurant when we have family in town. The chili con queso is highly addictive, the salad with fajita meat is a huge portion and delicious if you're looking for a lighter fare. My family loves the shrimp fajitas. I love the chicken and cadillac fajitas. Even though the food is a little pricey, it's pretty amazing. You probably won't find better fajitas anywhere else. My family will argue that the shrimp is the best seasoned shrimp they've had anywhere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "im1okcJRnxBIRo6bPL-PzQ"
  },
  "FiJdq3DdTsER21_6kCzPvg": {
    "date": "11/15/2013",
    "text": "Tonight with my hubby and his cousin went here, good food and drink. But I think you come to here eat must to order their fajitas, it is great and so much for you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mDbcROWb4gXy3jVS9EGtmw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Time to go in:)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mDbcROWb4gXy3jVS9EGtmw/o.jpg"
      },
      {
        "img_id": "AapjJSsvRSw4ZFkoUyDHtw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Friday special : freezing berry Margaret :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AapjJSsvRSw4ZFkoUyDHtw/o.jpg"
      },
      {
        "img_id": "890A_1ue7phfUni0i7EAbQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Yumm, ready to order:)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/890A_1ue7phfUni0i7EAbQ/o.jpg"
      }
    ],
    "user_id": "nM_08-VczMpGinu8Uwmzkg"
  },
  "oytRyDTXiiAFfgDJjceXMQ": {
    "date": "4/3/2014",
    "text": "I've been coming to Fajita's for over 20 years.  For the most part, the food is good, and the service is outstanding.  I normally have the chicken Fajita and cheese crisp.  These are wonderful, and normally very good.  The steak, pork and shrimp are also good, but the chicken is what I like most.  The chips and salsa are \"OK\", though the salsa has not been very good from some time.  I keep complaining that it is too spicy, like battery acid.  I've been told this is due to the chillies and peppers they have been receiving, but I know it was much better years ago.  I keep hoping as there is nothing else close to their recipes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FcFJK2a1wW6c9-yWFhwK5w"
  },
  "Rc0lxBtHz-rfw5nxuIHTbQ": {
    "date": "8/26/2012",
    "text": "Do not be swayed by the dingy office park that this place is located in or the fact that it looks like a redecorated Ponderosa Steak House.  This place was the ONLY place in the valley that could meet my stringent 4-point criteria for fajita perfection.  1) Tortillas must be freshly made in house and of the thick and chewy variety.  CHECK!  As much as I love me a paper thin authentic tortilla to sop up posole or machaca, when it comes to fajitas, I need what I have now learned are sometimes dubbed Texas tortillas that are pillowy, warm and slightly chewy.  Fajitas makes them with skill.  Love.  2) The chicken or steak should be grilled, preferably over mesquite.  CHECK!  Charred goodness awaits you, and those guys behind the grill are masters of their craft.  3) Steak should be able to be ordered medium rare or rare.  CHECK!  Although you can't specify the temperature of the meat, if you order the Cadillac Fajitas made of beef tenderloin, they come out blissfully mooing in the center.  Heaven.  4) Vegetables should be limited to peppers and onions.  No broccoli, mushrooms, squash, whatever, unless you are ordering vegetarian fajitas.  CHECK!  Ok, I know this is nitpicky, but I don't want my meat, pepper and onion experience to be sullied with broccoli.  Additionally, if you like shrimp, ORDER THE SHRIMP FAJITAS.  I don't know what they marinate them in or how they cook them, but those babies are like crack.  Pure, unadulterated crack.  Other bonuses - the portions are huge without sacrificing quality, making the whole experience a killer value.  You literally get a raft of guacamole, pico de gallo, sour cream and cheese to top your fajitas, making a half pound portion plenty to share.  Or don't share and take home the leftovers.  Chips and salsa are yummy, taking up far too much fajita space in your stomach before you eat, the yellow rice is fluffy and delicious, and though the beans are forgettable, the margarita is potent enough to keep you happy regardless.  We found this place in a moment of frustration at the fact that we couldn't locate the perfect fajitas in the Valley.  So what do we do?  We Yelp \"best fajitas in phoenix\" and get (duh!) a restaurant called Fajitas.  If it were a snake, it would've bit us.  We still make the trip to Glendale just to feast at this place and swear to play a round of putt-putt at Castles and Coasters afterwards to walk off the excessive fullness.  Alas, most of the time, we just drive home, happy nonetheless.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "wku4DoyLzZBnPV-ZOKwojg"
  },
  "Jr6_C3hYAfJTT6LVwLosgA": {
    "date": "8/2/2013",
    "text": "Best fajitas on the planet. I lived in Phoenix for 6 years and this was on of my favorite spots. Now that I have moved  out of Phoenix whenever I'm in town I make sure to stop by here. My favorite things here the cheese crisp and the homemade tortillas they are thick like flat bread. Doesn't get any better than this.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0EomDF6jNRo8y5uuQsyRhg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Super yummy cheese crisp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0EomDF6jNRo8y5uuQsyRhg/o.jpg"
      },
      {
        "img_id": "xt8mA5WVGF958PWjWytYzA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. 1/2 chicken 1/2 shrimp fajitas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xt8mA5WVGF958PWjWytYzA/o.jpg"
      }
    ],
    "user_id": "_GCKQmU0WN_NWcbLhauXgg"
  },
  "_DMpASEQM6XXzzH_GEvjcg": {
    "date": "4/21/2015",
    "text": "It was okay. Ordered one of their lunch specials for take out. $8 but it was quite a bit of food. The chicken was dark and kind of seemed like canned chicken. The rice was pretty good. I would probably try their fajitas, since that's what their claim to fame is.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YVdOHf-f4NMfkrEApEZcGQ"
  },
  "1Ze0AfrZ_FuG9oy5qgEaQQ": {
    "date": "3/26/2012",
    "text": "Fa jeetas  3.5  I have a love hate with you.   I love the food, although generally average it all works and works well. The tortillas are a tad thick but that is why I love em. The fajitas are always good. Never had bad quality of meat. The chips, beans, sides are all good.   The hate.. I hate stinking when I leave. I also hate the belly ache from the tortillas and water swelling all up in me.   The service is usually good. There never is too long on a line.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "XEHZoTDWjw3w-gcQyYIe4g"
  },
  "xy1XnctJOKIERk3U1Qt6Kg": {
    "date": "9/14/2014",
    "text": "This place is always just okay. The food is okay, the service is okay, the whole experience is really just okay. I had the seafood enchilada tonight and again, it was just okay. I never think to go here because it's forgettable.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C5CHGx_c1kQkA7kT5xaPaQ"
  },
  "l6GN5sZxd6_F3Rgqwp9F-Q": {
    "date": "8/7/2012",
    "text": "This is no where near my house, but worth the drive.  The food is great  the service always a bit lackluster, though you will never go without.    The tortillas are TO DIE FOR.  Like nothing you have ever had.  You get a ton of food for the price and it is simply a no frills place.  You come here for the food plain and simple.  If you have never been, do it. at least once..but probably twice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TAUwQExTxDnpPwqhouhJcA"
  },
  "89I0Gn3WcKJyNeqEkp_5YA": {
    "date": "5/30/2012",
    "text": "First off, let me be clear, the food is awesome. Especially, you guessed it....Fajitas!! I always get chicken or with shrimp. They make their tortillas in house, which you can never beat. Really good chips and salsa. A little too good, because I eat too many chips along with that tasty salsa.   I have some complaints. The parking lot is a little hard to see in the dark, and if you miss the turn, too bad for you!! Also, inside could definitely be updated. It bothers me that the place is always busy, it's a little pricy, It's dark and hasn't been recently renovated. The portions are big, but it's not a good place for a family on a budget. It's good quality though.  3.5",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "qCzx039NVrJkWnZEqQ1JKA"
  },
  "-Tsbc6_0xkLTpBAfQSybkA": {
    "date": "1/15/2015",
    "text": "Our food was great, but what set this restaurant apart was an incident that happened with my debit card. I accidentally left it on the table after paying and did not discover it was missing until 2 days later. Checked online and there were no fraudulent  charges. My wife called and a lady named Mary told us they had my debit card in their office. Thanks, Fajitas!! Your honesty is exemplary.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O1hCdC56Q3uXfugvU_12OA"
  },
  "VMVIn6ZI3QoADyTNfYTGkw": {
    "date": "4/11/2012",
    "text": "Update:  I realized I had overrated it before. I think i am still being generous with two stars.   Basic chain Americanized style of Mexican food. It's alright, but nothing special. Noting that our GPS had it listed under American food and not Mexican should have been the first clue. Totally forgettable and certainly won't be on my list, or on the list of anyone I know, when I come back to Phoenix.   There are so many choices around, don't waste your time and money on something so very mediocre.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HxPpC4ReQv990p5DWTHYtg"
  },
  "uKipth98jRHf62H_-WD4jQ": {
    "date": "9/30/2016",
    "text": "When I moved to Phoenix 24 years ago, I ask a co-worker for a good restaurant recommendation. He said \"try Fajita's\"! This place has been our favorite all these years! The Shrimp fajitas are GREAT!! The chips and salsa are yummy! Fresh made tortillas! The tortilla soup and queso are occasional treats as well. Can't comment on anything else on the menu... don't need to!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HKn42W1bKfKsYHvLUbLffA"
  },
  "C6pqQqUTkNcPpN5PbRc-pQ": {
    "date": "4/15/2013",
    "text": "Excellent service and food was delicious. We loved the fajitas and the homemade tortillas! Drinks were \"eh\"..Service was good considering it was super busy.  I would go back again, however, it isn't in a close radius to where we live now, so I could probably find something closer..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m-YNLs1N58gcEM4Ee2EIgg"
  },
  "v8i_1Fpl3OR9zR82xi2Xbg": {
    "date": "3/3/2015",
    "text": "I've been eating at fajitas for decades. If one is in the mood for fajitas, there is not a better place to be in Phoenix. Order the shrimp and cadillac and your life won't be the same.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8nCmV4RMwf4GpaN-A_2Tfw"
  },
  "SJAJXT_7keHFNFtNapIooQ": {
    "date": "11/12/2015",
    "text": "It's been years since I have been here. I used to come in just for the peach margaritas. We came here for a late lunch. It was about 2p.m. Wed. As we entered it looked like we beat the crowd. There were a few tables that needed to be bussed. It was quiet. We were seated in a comfortable booth. Our server Brenda was an exceptional waitress. We ordered the half pork and half shrimp fajitas. Of course a peach margarita. It was good but lacking alcohol. The fajitas had lots of grilled onions and only three thin uncooked slices of bell pepper. The shrimp were very salty, the pork was not all that. The tortillas were thick and hot. The salsa was just a chunky tomato sauce, no spices to give it that zing. I was disappointed, I saw the advertising about what a great dish the fajitas are on \"Check Please\" I won't be returning. Valle Luna has a better fajita dish with beans and rice for less money.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7WgEslpFcToO1tg5di5tHQ"
  },
  "joYxRtLpG0gqeZWY1G8_uQ": {
    "date": "3/16/2017",
    "text": "One of our favorites! Food is delicious and the best part is the homemade tortillas. We usually split a pound fajita, half chicken and half steak. Always leftovers to take home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xb-dGi0iPSNz4qtEDLm8Sw"
  },
  "XTyKjFfANYHfdyLg675__g": {
    "date": "5/6/2017",
    "text": "I've been coming here for years and easily the best tortillas and queso in town! Also love the family atmosphere and quick and friendly service I receive every time I go",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5rLypN7YyhsHtQ9VbWiCOw"
  },
  "pYUZ8MUhSWhgmVtwIJT2EA": {
    "date": "1/21/2017",
    "text": "This place is delicious! The chips and salsa, are super yum- Thin tortilla chips, that always taste nice and fresh, and finely blended salsa. Their cheese crisps are a great starter. They cook everything right in the middle of the restaurant. It's fun to watch them heaping that cheese on everything. And of course the fajitas!! The meat is not grisly at all- so tasty. The tortillas are AMAZING! We like to go at least once a month. Good service and great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uHmOM1EOA4sYmhCs1x7iqw"
  },
  "BrX376q0QAgV0x5SX31Tiw": {
    "date": "1/28/2017",
    "text": "This is one of my favorite places in the valley. I have been coming here since I was a kid. Never disappoints. Get the shrimp or Cadillac beef. Both are amazing. I love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zIhlb9GyW9vkohNHenX33A"
  },
  "t2rqZDlGPOYgppI8-tx2kA": {
    "date": "8/29/2015",
    "text": "This is my favorite restaurant. In town only for the weekend and had to stop in. I love their fresh tortillas and fajitas, I never get anything else.  Tonight I had a melon margarita because it was on special but I love their pina coladas.  Their salsa is tasty, flavorful but not overbearing.  Their chips are thin and very crunchy, I believe they are made in-house.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "X9g5MYWf-WUlaqDP6qCBLA"
  },
  "GPyLy_6ZYU5dLhG1BQGWZA": {
    "date": "3/5/2016",
    "text": "Food is really good here, shrimp fajitas are my favorite just order your vegetables well done and add extra bell pepper... Margaritas are also good I like the mango and raspberry.... They offer dough balls for the kids to play with it will keep them quite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WtIsPknE_KB2R5Di-tvd7Q",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WtIsPknE_KB2R5Di-tvd7Q/o.jpg"
      }
    ],
    "user_id": "fLx9y-reYA6aQnq2dWdYPg"
  },
  "5ybP8P8B_SHKUW9EMLlLdw": {
    "date": "9/19/2016",
    "text": "Food is good most of the time, margaritas use to have a decent amount of tequila in them, for the past several years there more in the line of a virgin margarita. The biggest problem I have is the tile surrounding the bar, several tiles have been knocked off, so they replace it with a cut piece of sharp edge tile which has torn my blouse.  And then using the blue painters tape to try to cover the poor way the place is maintained. And to top it off there's food in the grout, other than all of this the service and food is good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lS5XRzyhkWQJmF5Fl3r0dQ"
  },
  "QaBHpJuO5Xrdy7YdNjFHKQ": {
    "date": "5/19/2014",
    "text": "I can't say how good the shrimp fajitas are....you'll have to try them yourself. Best fresh flour tortillas served warm. I love this Restaurant and have been coming here for 25 years. Try it....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WBkzkUI0ZUaNnuiR4UOXeg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Fresh Tortillas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WBkzkUI0ZUaNnuiR4UOXeg/o.jpg"
      },
      {
        "img_id": "k5wy4G2OlS1tqk2t8mBVWg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Sizzling Fajitas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k5wy4G2OlS1tqk2t8mBVWg/o.jpg"
      }
    ],
    "user_id": "HF3fFCdkPUW2RSde8YaLUg"
  },
  "7Sjwvq6wpavGP3TQnASOWw": {
    "date": "2/2/2017",
    "text": "The food here was great! The chips and salsa and very good. The chips are very fresh and huge. The salsa is clearly homemade and flavorful. I did the 1/2 lb shrimp fajita platter and I will have leftovers for sure. The building is a little dated, but the food makes up for the decor",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7As6gOv6Z74c9wh1I22HvA"
  },
  "GEz8f63NRHiOf85nTHZH3g": {
    "date": "7/8/2015",
    "text": "I visited this place on July 4th and the server served the fajitas  skillet with the hot arm facing me. Needless to say, I have a 4 inch burn on my arm and they didn't even aplogize. Very unprofessional - will never go back.  Get handle pot holders!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "35nBdAPl2ilts_d6S4Rcig"
  },
  "3h60vuLgURntDkTOPqTPTg": {
    "date": "1/1/2015",
    "text": "This place used to be good and they advertise it on the walls that they used to be good. However there are no great reviews since 1997 because this place has just been cutting down and cutting back and clearly the owners have taken way too much money out of the restaurant and have done nothing to upgrade or update. Even their food has lost its spice and flavor. 4 ounces of meat , 1 whole onion , 17 bucks ridiculous. In my book fajitas have more than one thin ring if bell peppers on the whole order.  The salsa is nothing but pureed tomato doesn't even have enough salt in it. The salsa has no taste no flavor just tomato puree and small pieces of celantro.   There are plenty of reviews show the lack of taste Ms and quality. Clearly too many people are reviewing this as if from their old memories.  This is a place that Chef Ramsey could help and should!  It is sad to see a once great place go so far down hill.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "TDwsmPlB9H4U8Yr5Tgwa3g"
  },
  "qowGN1QhNfuSJJlL7xLiZg": {
    "date": "1/18/2017",
    "text": "Was here for lunch. I had the beef lunch fajitas and a cheese crisp. The chips were home made, along with the tortillas for the fajitas and for the cheese crisp. Friendly and very quick service. I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w8HAsJM_0mNgSvMbviegnw"
  },
  "z9iwmJhyUvhKpDOy6YqrPg": {
    "date": "11/22/2016",
    "text": "Heard amazing things about this place. They make homemade in house tortillas. Great salsa! I got the half order of beef fajitas. Definitely pretty good and full of flavor. Service was good as well. However this place is a bit pricey and a half order is $20.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZF2CFifmuP1BtNtnc4lvfg"
  },
  "TVDDsyRaOXZ0ZSdKTPTXVg": {
    "date": "8/14/2015",
    "text": "This is hands down my favorite restaurant. I love everything about it and have been eating here since I was a small child.  Order the chili con queso - best cheese dip that I've ever had. And do yourself a favor and order fajitas (duh) -- chicken, shrimp, and steak are all delicious but my personal favorite is the shrimp. The tortillas are made fresh (you can even watch them do it) and are the best tortillas around. The salsa is also fresh and delicious, and the nachos and tortilla soup are good as well.  I have never ordered an entree other than fajitas (though they do have many options) but I think that speaks very highly of the quality of the food considering how many years I have been dining here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MhZAzVSlcuuC4KhyE0RYw"
  },
  "3_JSg8ws2Ep4_KUAEAH3bg": {
    "date": "7/24/2016",
    "text": "Fabulous food! Cadillac fajitas are the best fajitas! Love the homemade tortillas! The customer service is great! The drinks are fantastic! Always a great time in fajitas and it really is the best place in Arizona to eat fajitas! I highly recommend it and enjoy! Cadillac fajitas 1/2 pound can serve for two people- or if you have more than that then go for a pound. Love the fresh flaky chips! Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MagAoZ5NutB5tHw1wzVHeQ"
  },
  "axDn6-WxhdiuEfmCAUcjbQ": {
    "date": "7/13/2016",
    "text": "Just went for a second time.  Geriatric food at best, no spice, no sizzle BLAND, WATER WAS GREAT, mach-aka beef taco was a joke.  This food is the farthest I have ever seen from Sonora Mexican food,  The salsa was sweet UGH.    Dont waste your dinero.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BMd9p4g8BSJDhrDi3SZE1w"
  },
  "7octTBd9d38kCpwNWjm3Fg": {
    "date": "5/1/2015",
    "text": "One word:  Queso  This is the valley's go-to establishment for unique and robust Fajitas. They arrive sizzlin' on a screaming, scorching hot iron griddle! It's a treat!   For starters, the basket of chips/salsa arrives with your intro to the server. The cooks make the salsa in large containers on a daily basis and it's consistently good. The chips are usually cold but thin and lightly salted, which makes up for the lack of heat. They go quite well with the salsa making it easy to overindulge.   My absolute favorite item on their menu is the simple, velvety soft chili con queso. Brian whips that amazingly perfect cheese dip up and the recipe is impossible to find.  Holy wonders of the world, it's unbelievably good. With the salted chips and the salsa...It's absolutely my favorite food on earth, the queso at Fajita's.  Ok, now for the Fajitas. The Cadillac Steak and Shrimp combo is by far the tastiest.  Get the bed of onions grilled (vs raw). The molcajetes come with shredded cheddar cheese; fresh pico-de-gallo; sour cream, and I always sub out one of those for their fresh, tart guacamole.   The tortillas are literally home-made on the premises. There's always a smiling employee in the tortilla corner and you are welcome to converse and tip them while they dole out buttery, flour tortillas.  The corn torts are a fair but not home-made alternative.  The bar is situated surrounding the grill/cooking area which is smack dab in the middle of the restaurant. It's a pretty cool set-up since you can see your food from start to finish.   Drinks are average to good, depending on the bartender. Peter is one of the last men standing and makes a killer top-shelf Margarita.  Despite everything I just shared, if you love queso with chips, DO NOT MISS THIS PLACE.   Seriously, it's the best ever!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rcs7Pvv31piqR3MLqt-l0Q"
  },
  "5U6CvwATUJwcd5clO_DSFQ": {
    "date": "5/20/2016",
    "text": "I have been going here since I was kid. It USED to be really good. The salsa is by far the worse I have ever had (tasted like tomato paste) and the cheese in my enchilada was not even melted. I ordered a margarita on the rocks with salt. It tasted like a watered down crappy margarita. The food is 1 star and I gave it 2 because they play good music and the atmosphere is fun. Makes me sad but I won't go back",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CYyEA1Wl8uUmKYCgjnYl3w"
  },
  "gMnSD8DRxptDtsHsKDkyBw": {
    "date": "12/11/2016",
    "text": "Excellent fajitas and excellent service. I don't care for salsa most of the time, but really like theirs!  If you're craving for fajitas, you MUST go!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_YitmM4N6D_1JzkEfyR0xA"
  },
  "LjDr6Uu1aBDCXYrT9Uwdrg": {
    "date": "2/17/2016",
    "text": "What a party! We were a little worried with the full parking lot and people waiting but we got right in and had drinks in no time!   This is a wonderful and festive family restaurant and the personalities and decor are so vibrant it is impossible to maintain a bad mood here. We got fajitas (because fajitas) and we left here very happy. The pricing was good, service good, clean restrooms, everything was bang on here. Highly recommend if you're passing through!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x0WpY0u5PqIeBqP9MaLfqA"
  },
  "anmaFVdy-r1ha3I0yco3-Q": {
    "date": "3/2/2018",
    "text": "I've lived in phoenix my whole life & have tried almost every restaurant in the valley except Fajitas, until tonight. Unfortunately I can't say I will ever go back. I know good food when I taste it & this was anything but. I wouldn't even consider it Mexican Food. Bland is the best word to describe it. The salsa was the most mild salsa I had ever tasted, straight out of a jar.  When the fajitas came I was even more disappointed, there was absolutely no seasoning or spice, I asked for a side of jalepenos to maybe add some spice to it,  but they tasted more like pickles out of a jar, no spice whatsoever. So than I asked for some cayenne or crushed peppers but the server said they didnt have any... All I wanted was my food to have some spice to it like True mexican food, didnt think that was alot to ask for. It was definitely not worth the $60 price tag. Im not sure what others see in it bc it seemed pretty busy, must be because its right off the I-17 & when people are starving they'll stop anywhere.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "BaQAHMOAvJQjrhb5ba59Ew"
  },
  "DNsgeoeS0ZSKCSQ_RdXY-Q": {
    "date": "4/29/2015",
    "text": "Stumbled upon Fajitas while driving around......lost in Phoenix.  Frikkin' GPS! Left turn here! Right turn now!!! We damn near hit a lightpole before we got our asses good and lost! Grrr!!! Anyway, somehow through this mess we located Fajitias and yazz, yazz!!!  Ya' can't go wrong with amazing deals! The place is actually quite huge and the margaritas (offered at $3/each) didn't disappoint.   We'd actually ordered the Mexican pizza as an appetizer thinking we'd be able to make it to an actual entree (#fajitas)....  But this thing arrived and was so huge that it literally became a meal. The savings from not ordering an actual entree allowed us to order extra booze.   We departed full of food and booze for less than $20. Unbeatable!!!",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 9,
      "cool": 7
    },
    "photos": [],
    "user_id": "63rsfkJ6ptD9jU_Rf96iBg"
  },
  "arrmUocZXYG0XzYQycJoyw": {
    "date": "8/30/2017",
    "text": "Delicious Cadillac Fajitas and their tortillas are fresh and homemade-tasting. The interior is absolutely disgusting though. Everything is dirty, broken, falling apart, and outdated. And the fact that they raised their prices so much in the past year (almost $5!) is not helping their business.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lqeUCeD_cBqktGJN2gYezA"
  },
  "iN25BmfJHbJrj2_zGWTTgQ": {
    "date": "1/29/2013",
    "text": "Wow I cannot believe how long it has been since I have updated my review. Since finding Fajitas I have become a fan, just cannot get enough of the homemade tortillas, if you haven't tried them, you are missing out! And for the many times that I have been there the taste of the food as remained the same, perfect & delicious.  Went with a party of friends, about ten in our party, we had found out that Fajitas does not do reservations, but we did give them the heads up that we are a party of ten and we are showing up around 5ish, so we got their and had to wait a few mins, but we didn't mind, gave us time to mingle with each other before being seated.  I still can't tell you what other items they have the on the menu, because I keep coming back for the beef fajitas which come with a plate of cheese, pico de gallo and sour cream, for me all this is enough, but you can order beans & rice to go with your jamming fajitas.  Yep you can bet I will be be back!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "vSUMwn_GJAx3nVSEI-YONQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Chicken soft tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vSUMwn_GJAx3nVSEI-YONQ/o.jpg"
      },
      {
        "img_id": "pfzkJwy3HSWyYbvjYXPwvw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pfzkJwy3HSWyYbvjYXPwvw/o.jpg"
      },
      {
        "img_id": "SrOsejG-SEBWUCLlMd2oMg",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SrOsejG-SEBWUCLlMd2oMg/o.jpg"
      }
    ],
    "user_id": "bpgbVPJcG-wQ4cNBcPPIxw"
  },
  "LV8cxsT0rw8T7gTvhm5reQ": {
    "date": "6/16/2018",
    "text": "We had a great experience here. Our server, Eduardo, and the manager were very accommodating. We had a minor issue with one of our dishes and Eduardo was sure to let the manager know of the issue. After the dish was remade, the manager brought it over to the table and they both made sure to make the rest of our dinner enjoyable. They didn't charge us for the dish and gave us a free dessert of our choice. Eduardo deserves a raise! Him and the manager has great customer service and show sincere concern and appreciation for their customers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ESaJgw1cqtu-8JxdEOuB0w"
  },
  "QLFzN1k7PQtIgWiTLdt3fg": {
    "date": "3/3/2017",
    "text": "Love coming here for double date nights! A bit of a long drive from our house but SO worth it! The fresh made tortillas are so delicious and sharing fajitas with friends over margaritas is great! We typically order the chicken and cadillac fajitas to split between four people and there's so much food! Also, get the grilled zucchini!!!! It's fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nxuVpb05b1lYBPVyefI9VQ"
  },
  "sd6GYHTh0PHO-fTXdNrVuw": {
    "date": "5/29/2017",
    "text": "My boyfriend took me there once and it wasn't all that. To me the food want the greatest and the service wasn't really good either...I don't think we'll go back...",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ow_qhJg_0zpv0e8eu2K5ug"
  },
  "Z5A18RhF2foR-uyUXZoclQ": {
    "date": "2/6/2016",
    "text": "This is the second time I had dinner here and let me tell you the impeccable food here is never a disappointment. I loved how quickly our food came out and our waitress was the most friendliest and caring person ever. The food was sizzling, warm, satisfying, delicious and there were just so many options to choose from. We ordered chicken fajitas and one pan of shrimp fajitas. We quickly devoured both and had to order another shrimp fajita pan hence why we love this restaurant oh so much! You won't regret coming here for lunch/dinner.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "SW40ihXlP_-x5mOnzP94dA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SW40ihXlP_-x5mOnzP94dA/o.jpg"
      },
      {
        "img_id": "XWxN0NX7tbmuglPsI7YDUQ",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Really nice atmosphere!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XWxN0NX7tbmuglPsI7YDUQ/o.jpg"
      }
    ],
    "user_id": "VoQIJT0nf4xNOrtKOhyMGw"
  },
  "2RhpAFDwBW4ib7XgalepcA": {
    "date": "4/26/2013",
    "text": "Fajitas will always have a special spot in my heart because some of my fondest family and friend memories took place here. My family brought me here at least once a month when I was still in elementary school. Then, in high school, my friends would meet me there on Fridays when we got out of school early. I barely went there while I was out of town in college, and now that I'm in a new stage in life, I had the recent opportunity to see it again. I could not believe that place was still open!! It's one of the few restaurants that has survived the decades. You can see that many restaurants have come and gone, but Fajitas still stands, proud and tall!  Their tortillas are unique in texture and flavor. It's not your typical tortilla that you get at the many Mexican restaurants around town. I wouldn't really categorize it as traditional. It's not quite the Chili's Americanized type tortillas either. Regardless, their tortillas are made fresh right before your eyes and they taste wonderful!   The menu is fairly standard and simple. By the restaurant's title, they stay specialized in what they know, making great tortillas for fajitas. They have regular flank steak fajitas or the more richer Cadillac steak style fajitas. If red meat is not your desire, then they also have other chicken and veggie types available. The sides like rice and beans have never been included  with the entree. They've always been separate, but that sure hasn't stopped anyone from coming here.   I love that they have many types of drink specials throughout the week! That's what makes it such a great place to look forward to going to on weekends!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eAJ3Ip0vh-zuk_BmcmchYA"
  },
  "GPSEtQQo40vWlZDA1-1MSA": {
    "date": "3/24/2018",
    "text": "This place is great. Been coming here for about 27 years. Great fajitas. Fresh tortillas made right there. Big Sizzlin plate of fajitas brought to the table love it will be going back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWsoGtuTKL4_Glro36zxnw"
  },
  "vS-rSoBHPIVGEl6RfhvihA": {
    "date": "7/24/2017",
    "text": "This is a great place to have a very manly portion of whatever you order.  If you leave hungry its your fault.  Great selection of food and the customer service was very good.  I got there after 1:00 pm and it was not crowded and I did not need to wait for a table.  Parking is also good.  Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tR2C6rp-T0cuJkrkgS7yuw"
  },
  "K8vWyF0K7b9JgJ3MVOlmfg": {
    "date": "11/16/2016",
    "text": "This place used to be the BOMB with their homemade, fresh flour tortillas. They used to come out thin and warm and delicious.  They are now gorditas, not tortillas.  They are so thick, it ruined the taste of the fajitas.  I'm not sure if you could ask them to make you a batch of thin tortillas, when I asked our server he said they have been coming out that thick since he had been working there.  Bummer...",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Q_IQ6hxUbeBAGluk9utdXg"
  },
  "PtbAUpGTffEQLkKKDtk5Rw": {
    "date": "11/28/2013",
    "text": "Have passed by this place on the I-17 countless times, but never gave it a shot.  My co-workers have loved coming here for lunch for years so I decided to join them this time.  The place looks and feels like a mix between a Chili's and a Mexican cantina.  The decor won't wow you, but it'll definitely remind you of some of the big family chain restaurants.    There were six of us and the group decided to split 3 half pound shrimp fajita platters.  We also got chips with queso dip.  The queso dip didn't impress me all that much as it was a little watery.  I prefer my queso dip a little more hearty.  As for the fajitas, pretty impressive for a couple of reasons.  The shrimps were cooked perfectly with the onions, spices, and peppers.  And even more impressive were the house made tortillas.  Fresh, warm, soft, and tastes perfect with the meat and veggies.  Between the fajitas and the chips, we were all plenty full from lunch.  I'd also like to mention the very attentive service we received.  The manager came over numerous times to ensure our order was correct and that we were taken care of.  Our waitress actually mixed up one of our fajita platters, so the manager came over with some additional items to snack on for free while we waited.  Nice touch.  Outside of the mixup, the waitress we had was very friendly and accommodating.  Fajita's isn't going to wow you with authenticity nor does the look of the place really stand out all that much from some of the big suburban chain restaurants.  But as an independent family friendly Mexican food joint, it excels at delivering good service and a decent product.  The prices are reasonable and the location is convenient to one of Phoenix's most travelled roads.  Among the multitude of Americanized Mexican restaurants in the valley, you could certainly do a lot worse than this place",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "WMMI5Q4Rmm1Rqdu0jOvyhQ"
  },
  "R_421by0L8eSf-apA3usSA": {
    "date": "2/24/2016",
    "text": "For Fajitas ---this place is Fajitas!!! You will also walk out smelling like a fajita, but hopefully not covered in it. Cadillac fajitas med rare all the way. Substitute more guac or cheese in lieu of sour cream or whatever side condiment..They let you do this no charge. Never tried anything else here because why??? The tortillas are handmade and they also have homemade salsa. It's not a fancy place but the fajitas are damn good. Been going here for years. They also have lunch portion fajitas but you may still need to nap afterwards. Oh and shower too :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g_ANptTz1q0ra2vfX2yNsw",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Choco taco",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g_ANptTz1q0ra2vfX2yNsw/o.jpg"
      },
      {
        "img_id": "EqnIhjKJs2w2wzyBqFjS6A",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. Sizzlin fajitasssss sssssss",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EqnIhjKJs2w2wzyBqFjS6A/o.jpg"
      }
    ],
    "user_id": "DSDL_v5dvLOIJ-o5sRhz4w"
  },
  "3GafdKJrxcNLHgHTwjXUjw": {
    "date": "9/2/2013",
    "text": "All that was missing were The Griswolds and cousin Eddie.   I immediately saw that this place was a hit with the locals because it wasn't very pretty. However, it smelled delicious and I bet the fajitas were amazing.   Some friends and I went for margaritas and appetizers; specifically, Chili Con Queso. Damn, it was good! I had three bowls! And so were our margaritas. Delicious!   But the appearance needed a make over asap! Sorry, but this restaurant belonged in Laughlin, NV. If you've been there, you'll know what I mean. It was like nothing had changed since 1979.   I don't see myself going back. Sorry friends!",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "OvR19daYCBiL4FnZOQzQsA"
  },
  "l9S-xpvbdDT53pzT1fnK1w": {
    "date": "1/1/2018",
    "text": "This place is an oldie but a goodie!  I grew up eating at this place and I always look forward to eating here when I come visit my family in AZ.  I love their fresh chips and salsa.  They make the salsa and and their tortillas fresh daily.  Our favorite when we go is the Cadillac beef and we switch out the side of sour cream for guacamole that comes with the beef.  Overall service and food is pretty good here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jYbyYK3bJ3Hiyg_pgZYQww"
  },
  "kUaqTPwVpXoJNqlFi7T9-w": {
    "date": "6/12/2016",
    "text": "Absolutely love this place! Food is always a! The grilled zucchini is delicious.  I always have the enchiladas  guadalajara.  A huge amount of food! I always ask for the server Reuben he is the greatest.  Very knowledge about the menu and actually everything about there.  He is friendly helpful and an excellent server! If you're in the area you must try it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i-38R6SDoTXUy5fgNU0rlA",
        "caption": "Photo of Fajitas A Sizzlin Celebration - Phoenix, AZ, United States. My favorite dish.  Enchiladas guadalajara",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i-38R6SDoTXUy5fgNU0rlA/o.jpg"
      }
    ],
    "user_id": "Dtql1-zcl73v20Oxq3StFQ"
  },
  "Wu0G9bxvyiWj-4JCfN_Rmw": {
    "date": "3/11/2017",
    "text": "Long time standing restaurant and for a reason! Their food is great! Relaxed environment. Friendly service. Wish there was a location in the east valley!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAJr5OsFmpwcmFTG3Xv3_Q"
  },
  "ytjK9Airu_-_vuTV1CVroQ": {
    "date": "9/7/2016",
    "text": "Other than the good server we had, I did not like this place at all.  First of all, looks like a Denny's inside, not a Mexican restaurant.  Margaritas are average, at best.    Fajitas were not great either; don't come w beans, rice or guacamole and taste rather bland.  We will not be going back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "R_Maz9c6sHEtLObjBE3tmQ"
  },
  "nMKSE9k956jNoqRuBoZQ3w": {
    "date": "11/14/2010",
    "text": "Fajitas is by far the best place for.....fajitas.  The homemade tortillas are some of the best in the City.  I am not sure if any of the other mexican food is even any good here because I have been going here for years and only order the Cadillac and Chicken combo platter of fajitas.  The salsa is very good if you like fresh tasting salsa that is very runny.  The guac isn't always very good but the meat and toppings go well with the dish.  The atmosphere is supper casual and the bar sits in the middle which isnt very large but this place gets super busy in the evening and there is alot of energy in the place.  I have been going here for years and I cant think of a single time the service was not fast and great.  I highly recommend trying it out if you are in the area.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9hMqNBBpTl3lBy6qCAyu-A"
  },
  "5EwenIDS-Tjb8AlJ9zanSA": {
    "date": "5/23/2011",
    "text": "Shrimp fajitas and fresh tortillas make up for the lousy sides and the okay salsa. Best shrimp fajitas I've experienced to date although that may just be the MSG. Wish they would step up there sides though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GwOM1kyHnwTU-FgiDhbO1A"
  },
  "1N3THLDbW3TQMp92Ws2zRA": {
    "date": "8/6/2010",
    "text": "I love this place. I have been going here for years with my Dad and I have to say that they have consistently served good food with a great attitude. The meat is good , I'd suggest the Cadillac if you like beef. The salsa is also excellent with just enough kick to make it perfect. They also have different flavors of tea which I like since I am a big tea drinker. While this place isn't high class dining it is a great time and the food is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5BTWT7vTYWYYkGxAGPBSjw"
  },
  "BAfh_LJv3ZXleOKUyTVrYA": {
    "date": "8/14/2013",
    "text": "I grew up eating here and I can tell you that it never disappoints. The food is so delicious, pricey yes but worth it. You have to have the fajitas here, that is the staple and what they do really well. After moving 3 hours away I have been craving this place non-stop and finally made the trip yesterday. I had a special request and they had no problem accommodating me. If I could give them 10 stars I would. You will stink bad when you leave here and your wallet will be empty but I promise it will be worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ha99eCK5P_egeio3E6s8lQ"
  },
  "2UwW9XyiIFXEzjk4vCeyhw": {
    "date": "8/26/2013",
    "text": "I have been coming here since it opened in the 80's as a kid. I still come at least 1 to 2 times a month. My 7 and 9 year old insist on coming, and having their birthday dinners here. Food is wonderful. You get the best service at the bar, sit with Mike or Peter.T hey make great margaritas, homemade tortillas, and awesome fajitas. The salsa is usually the best around, but just every once in awhile you will get a miss. The queso is a must. We always get shrimp and cadillac fajitas. Great for the money as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sx3jFK57DwFcNV47EwQMOw"
  },
  "LjgvYli9qTF-aVeoDG60Sw": {
    "date": "7/29/2013",
    "text": "Service was great, chips & salsa were great too. I would have liked a little hotter, but good flavor. Fajitas were good, nachos not so much. They didn't rush us which was nice. Prices were reasonable. We would go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OeJYAivFn0sQ6WsX73aaog"
  },
  "NSNbYbuAemHkrOEP3sEPCQ": {
    "date": "1/1/2011",
    "text": "Went here with family. We heeded the previous advice and stuck to only fajitas: chicken, pork and veggie.  My vegetarian aunt and uncle assured me theirs was quite good. Chicken was good, my pork was a lil dry/overcooked. The fajita itself was fresh and excellent as advertised. The strawberry margarita was also tasty though short on rita",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WZ-qd2TrJeKGBKRl_JhjGQ"
  },
  "rN8yQVKTMHautqlp2YAtDw": {
    "date": "7/5/2008",
    "text": "You have gotta be kidding me reviewers!  This place was neither tasty or satisfying, It wasn't cost effective, it wasn't great service. It wasn't even good food.  Let's start with the salsa. There is nothing chunky or spicy or fresh about it, It is sweet tomato sauce with a bit of onion in it. If this is salsa Ragu missed the boat by -this- much. It is most certainly not prepared there and is the absolutely worst salsa I have ever been served. I took one dip and I asked the waitress if they had any other types of salsa available. She said no. My partner said \"it sort of grows on you,\" so I dipped a few more times and all that grew on me were questions as to how a Mexican restaurant was calling this salsa. I was considering an exit strategy, but we decided to let the food determine our visit.  Looking around the place, it was near empty, except for a large family table, a senior age couple and another couple our age who were also visiting for the first time. I know because they were asking all the questions I had about the menu. Interesting layout allows you to watch the cooks plate up the food. This can either be a great experience or a fearful one. Good lord how many onions are being put on the sizzling plate? What is being poured out of a deep frying basket over them? I don't think this bodes well.  I ordered the half pound Beef Fajita. My sizzling experience was that of two cups of undercooked white onion, one ring of green pepper and a tiny ring of red pepper. Sliced Fajita meat that was charred and chewy perhaps dropped in the fryer? Tortillas which were completely uneven in thickness and sizes (I guess that means they are homemade, right?) They were almost too cold to fold and were damp from being steamed warm I think. EW. Still I was hungry and going to make this work. My condiment plates shredded cheese was fused together as if someone had scooped it partially melted with an ice cream scoop. The sour cream was plentiful but warm. I desperately wanted to add the chopped tomatoes to the salsa bowl, it seems they belonged there, but there were only enough of them for one Fajita so I didn't. The only way I was going to get these fajitas to be remotely tasty was request some lime. Fortunately I was able to secure some juicy wedges which helped. My partner said they liked the beef jerky meat, but it's not what I had in mind. At all. That's ok, the border dinner was sure to please them, right?  NO. It should have been left at the border and denied entry into the states. The congealed enchiladas held the fork in an upright position and refused to be edible. The charro beans were only edible if you pierced the plastic shell of dried beans on top and dug out some bite from the middle. My partner who loves rice didn't even scoop a bite of the spanish rice a roni provided. The dinner salad was a wilted ranch dressing mess and was useful only to put on one of my fajitas. I thought it would add some crunch. It didn't. We stared at the fried tortilla cup that held the queso. Under the skin the cheese heart was beating. Seriously, it wanted to live! It would shudder periodically as if something was swimming beneath the surface. Heat, I imagine, is all that made it percolate, but we had reached a stage in this dinner where we knew it was a bust and everything became fodder for jokes.  I am never going back and I thought others should know that Outback and Lone Star are in the same vicinity. Make a better choice.  $33 dollars.   Wasn't it 33 pieces of silver that betrayed Jesus? These positive reviews were a Judas kiss, folks.",
    "rating": 1,
    "rated": {
      "funny": 7,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "vpFzsr7_ub_bpEPRHTthNA"
  },
  "UqqA-Be3AO4hXboQKHmLHw": {
    "date": "6/14/2010",
    "text": "This restaurant has been serving my family for as long as they have been open. They have GREAT service, GREAT food, and despite a recent change in grenadine, great SODA. Recently, when they changed grenadine, and we expressed our dismay, the waiters BOUGHT a bottle of old grenadine to use when we came. Now that is not just SERVICE but FRIENDSHIP.  The food is oh so tasty, homemade tortillas are addictive.. I often stop halfway through consuming my 1/2 pound chicken fajitas with extra seasoning to thank the heavens for the food before me, becuase it's THAT good. Sour cream, chicken, cheese, and salsa are the perfect innard for a fresh tortilla. Always warm chips barely need a little salt, delicious salsa. Also serve awesome cheese enchiladas, respectable cheese crisps, and are SUPER family friendly, although I miss the days of balloons for kids. (See, I've been going here what? 20 years?) Love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zuY8nzjSF_vpXvWRZs0Adw"
  },
  "VrtIejPmw1G_5IsaciNzow": {
    "date": "5/3/2012",
    "text": "We went here yesterday for lunch, it wasnt packed at all and the lunch prices are good. They start you off with chips and salsa. Nothing special at all, I usually love chips and salsa but this salsa was straight up pace picante or somethng similar. Do not go to this place and expect authentic mexican food. We then ordered drinks, Javier had a margarita on the rocks, he loved it and was the perfect flavor and perfect amount of alcohol. We both then got the fajita lunch special, he got chicken with the flour tortillas and I got beef with corn tortillas. It came out in a small skillet but I think it was a perfect portion, I left not feeling too full. Javier on the other hand was too full. He ate the flour tortillas, which were very thick and looked like pancakes. I preffered the corn, not as filling and doesnt leave you stuffed. Im glad I tried this place, I will go back if Javier wanted to, but I wasnt impressed. I could make the same thing at home.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wyfWQDkIQaJssOlvFZrxHQ"
  },
  "7W-LL0l0RnuNiHc86NsEhA": {
    "date": "3/11/2011",
    "text": "My husband and I tried Fajitas tonight for the first and were sorely displeased. Our drinks were mediocre, the salsa was terrible and our food was completely disappointing. The service was good, but we felt like the waitress was rushing us. Overall this was a poor experience. If you are looking for good Mexican food I would recommend Valle Luna. It is far superior.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ncNVG1mVpnTIG8cmSfE-oQ"
  },
  "BAYjKDdl0DSvL-A_1jbT1g": {
    "date": "4/10/2010",
    "text": "Absolutely love this place!!! Only complaint I have would be the tortillas used to be thick and fluffy and now are pretty flat. But other than that this place is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DXsyVhX8ryL2SKdjo_MPFQ"
  },
  "5VTSndjxQ7J7bjYF34ETeg": {
    "date": "7/25/2007",
    "text": "Food is really good. Service is terrific. The bartenders are fantastic. Try the shrimp fajitas. They offer other Mexican dishes in addition to fajitas. If you like frozen margaritas order them with Cuervo Gold...don't use the pre-mix frozen unless you get a shot of tequilla added to it. Also, they cook everything right there in the open. Be prepared to smell like a delicious fiesta after you leave.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "AOQ0yHh-QGTX6H3bgFR16A"
  },
  "dOwLyU-LJSve_K-4UbIR4A": {
    "date": "8/6/2010",
    "text": "This has been a family favorite of ours for years and years.  The only entree we ever get are the family-style fajitas.  I'm sure the rest of their food is great, but their fajitas are the best we've ever had!  They come out sizzling on a hot cast-iron plate with sauteed onions peppers, and are served alongside homemade flour tortillas.  You can't get any better than that!  Great, now my mouth is watering....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ySlXczEvOPXF1yUnF0BJrQ"
  },
  "74Y29VBrq2SIAmcM-VAX9w": {
    "date": "9/8/2009",
    "text": "Service is great.  Food is great.  Don't get anything but the fajitas if you go, though.  It's called Fajitas for a reason.  They make their own tortillas on the spot.  Make sure you get a side of beans for your fajitas; it kind of brings it all together.  Without the beans the fajitas are nothing special.  But with the beans and the salsa.....aaawww yeaaaaah..  Also, the cheese dip (queso con chile) is really good.  Mmm.........",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6RKlszkzjJpVB3FC3rh-Jw"
  },
  "ZXUmnpk7qQzUhUtmB9-AXQ": {
    "date": "6/23/2010",
    "text": "best chips and salsa in Phoenix.  Fahitas are fresh, fast and terrific.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dxvrPKeuDVVCPEUvD13jxw"
  },
  "MggcuWXRi_qTQAoyOVHj0A": {
    "date": "4/15/2009",
    "text": "Fajitas isn't a great Mexican restaurant but I think they do good fajitas.  Its a good place for a group of people to share a bunch of food.  I really like the shrimp fajitas.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L20e_VoJzUvhn2OrjBuX0w"
  },
  "xWz_jZNzvkqqlfJNyyWVGQ": {
    "date": "3/31/2010",
    "text": "This is one of my favorite valley restaurants. Everything is awesome from the queso to the fajitas - not to mention the homemade tortillas. We always bring out of town guests and they always rave about it  wishing they had one in their home town. Salsa is homemade w/ a great kick. I know they have other items on the menu besides fajitas, but I have never tried them because I can't get past the fajitas when deciding - they're too good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ke2l4F4QXKmzM9AuIciajA"
  }
}